{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Fantastic hotel and best location”", "Author": "j2garcia", "ReviewID": "UR128015948", "Content": "There's no way you could improve on the location of the Claris - it's within walking distance of just about anything you could want or need in Barcelona. And, if it's more than a walk away, you just hop on the nearby Metro. Everything the Claris has to offer was top rate - the room, the front desk, the rooftop bar, and especially the breakfast, which was included. I've stayed in a number of European hotels, and none of them have come close to the Claris. If there's anything I would change it would be the overwhelming sweet vanilla scent they use in the lobby - it hits you in the nose as soon as you walk in and by the time you get to the elevator you're tasting it - yuck! A little of that goes a long way. We arrived at 9:00 am and were told that checkin is at 3:00 p.m., but they managed to get us into a room by 11:00 a.m. - very much appreciated. I highly recommend this hotel", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Venerable luxury”", "Author": "HedonistSpeaks", "ReviewID": "UR127966189", "Content": "The Hedonist speaks. We stayed at the Claris hotel in Barcelona. It's near, but not at the top of the luxury market and very nice. Doormen in long white coats are a welcome sight, and probably speak English  better than you do. The brilliant art in the lobby is a nod to all that is modern inside this venerable building. The rooms are large and well appointed with real art, high thread count sheets (important to a proper hedonist), electrically controlled shades for the windows, and pillows that practically sing a lullaby as they cradle you to sleep. The bathtubs are a bit short by hedonist standards, but typical European, so it's (marginally) forgivable. The staff all seemed to have our comfort in mind and did whatever was necessary to make our stay perfect. Wifi is 15€ a day per online device - outrageous and maddening, but not unique. There are free Internet hot spots at some of the cafes throughout the city. The business center has free internet, but you'll need help from the staff to print anything. They have to transfer the page you're printing to a flash drive and take it to one of their computers to print.  Their Terrazza restaurant is excellent and the small bar by the main lobby (dedicated to Andy Warhol, of all people) has mojitos that are pretty good. (The third one is especially good,  for some reason.) Get the fourth one and some tapas at \"Josephine\" across the street. (Live jazz Thursday nights starting at 11:30.) If you want weekend dinner reservations, make them on or before Thursday - especially at the better restaurants. The incredibly helpful hotel concierge(s) will do it for you with a smile. Most places open for dinner at 8:30;  many are closed on Sunday, making reservations more of a challenge.  \"Il Caffé di Francesco\" is the tiny coffee shop one block from the hotel where I went to wake up every day of our visit.  No i-net here, but it's laden with interesting locals, and the coffee and pastries are good, but not world class. Give it a try. \"AaBC\" is a Michelin star (2 of them!) restaurant. Hedonist foodies must go. It's way north, but worth the 20 minute cab ride. Take a high limit credit card... just sayin'.  Overheard: \"what wine goes with the woodcock and foie?\" and \"No foam? No smoke? How pedestrian!\" The food is beautiful and fun, if overpriced; the service, immaculate and not stuffy.  A word to the wise: if you want to go to the Sagrada Familia, get your tickets at any of the \"Caixa\" ATM's (they're everywhere), or get them online. You'll avoid a very long line. At the caixa, it's easier to get them if you speak/read Spanish. They offer an English alternative, but it's difficult to maneuver through the many pages of authorization - at least it was for me. Use your ATM, or credit card with a 4 number pin. Ticketmaster(!?!?) will issue the tickets directly from the machine. If you want the audio tour (recommended), buy it then to save another long line.  When you arrive,  it can be a bit difficult to tell where to go. If you already have a ticket, get into the line farthest to your right as you face the entrance to the Basilica (nearest the info booth). Everyone has internet, so this line is also not short. The audio units are in a kiosk to the far right behind the little school building after you're inside the grounds. Long lines, but worth the wait. Several times a day, they also offer large group guided tours - not a proper hedonist choice (unwashed masses and all that), but it's there if you want it. Be prepared to say, \"Wow!\" Gasps abound. There is something amazing and beautiful at every turn.  In the Basilica, there are seats for a thousand voice choir surrounding the chancellory, with four pipe organs planned (one installed so far). I suspect the music at the first mass will be amazing when construction is finished in the middle of the century.  I'm sorry I won't live that long. My invitation would probably be lost in the mail anyway, assuming there will still be such a thing as mail.", "Date": "April 16, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Walnut Creek, California", "Title": "“A good place to stay in Barcelona”", "Author": "David S", "ReviewID": "UR127952662", "Content": "This is a place we feel very comfortable in recommending. We got upgraded to an executive suite and found it roomy and comfortable. The staff was most helpful and responsive, and the location was in walking distance for most sites, yet in a quiet area.", "Date": "April 15, 2012"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Pretoria, South Africa", "Title": "“Very noisy, disappointing”", "Author": "WLRoos", "ReviewID": "UR127929810", "Content": "We booked the suite but the bedroom area is small and cramped. We were moved to a junior suite on the ground floor which is very noisy 24/7. The staff were really not very helpful. We moved out after just one night.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "carlo.ablaza@gmail.com", "Title": "“Excellent & Perfect Location!”", "Author": "cja2k1", "ReviewID": "UR127780342", "Content": "This hotel is one street off of the main street, which is perfect: it provides quiet and quaint surroundings, but it's also just 2 mins. away from the hustle and bustle. It's spotless -- both the public spaces and the rooms -- and we never wanted for anything in our room: everything was provided for and a quick call to the front desk granted us any add'l requests. The layout of the property is pretty cool -- a spacious entry lobby with a business center and a bar, an easily accessible reception area, light and spacious floors, a roof terrace with a gym, pool, cocktail area, and restaurant, and a basement floor with conference rooms where breakfast was served in the mornings. Everyone was friendly and helpful and prompt. I've stayed in so many hotels where you had to call two or three times to follow up on a blanket you requested 30 mins. ago or an early morning coffee that you ordered the night before -- but not here. Not one things was forgotten or overlooked. We chose this hotel for another reason: the bathrooms were actual separate rooms, like in American hotels. Many hotels we looked at had no door to the sink and shower area; only the toilet room was closed off. We were not sorry we did that. The bathroom was spacious and the products were great! A couple of challenges: the rooms are a little dated and needs some updating. We had a great duplex and it was spacious, but it was a little worn but not a big deal. The bigger challenge was the internet: it wasn't free so you had to call the front desk everyday to request a code, and someone would bring up a card to your room with that code. I wish they would've just made it complimentary or tacked it onto the daily rate. There was a restaurant across the street called Josephine, and it was picture-postcard charming. We ate a lighte breakfast there almost everyday, and they also opened for lunch, dinner, and cocktail hours both in the afternoon and late into the evening and after midnight. Overall, I'd recommend this property wholeheartedly. The staff, including the doormen, were friendly and made you feel welcome. The location can't be beat. A perfect place to stay in the center of it all in Barcelona!", "Date": "April 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "North Wales, PA", "Title": "“Great location”", "Author": "Arlene G", "ReviewID": "UR127774817", "Content": "Stayed in 2 of the duplex rooms - were great. We were traveling with our 2 teenage sons to visit my daughter who was in Barcelona for semester abroad. Thought the front desk staff could have been a little \"warmer\" but overall was a really nice hotel. Had one bad experience - my husband left his wallet with credit cards in cab.day before we were leaving. We were contacted by hotel staff that evening to let us know cabbie came back with wallet but wouldn't leave it because we weren't there.....would come back next day ........next day different person at desk.....gentleman at desk told my husband we should be lucky and should be quiet because we were a little disturbed cabbie still hadn't come back.....well, turns out cab driver did return the wallet, but charged a few cab fares to a debit card and another credit card.before returning the wallet.....I'm sure he's probably a regular cabbie outside that hotel......other than that one incident, hotel itself is in a really good location....near metro and convenient to almost everything.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Madrid, Spain", "Title": "“Kid-friendly”", "Author": "ov_milosz", "ReviewID": "UR127608807", "Content": "We have twin babies and most hotels insist on booking 2 interconnected rooms for us. We spoke to Claris, and they were kind enough to suggest that we could all stay together in a Junior Suite, and we got a great price on www.derbyhotels.com. The location is wonderful, the service impeccable, and the artworks fabulous. There was some drilling noise from the 6th floor, but when we complained about it, it immediately stopped. The restaurants in the hotel looked great, but there were so many wonderful places nearby that we ate out all the time. A special mention for the doormen who were always kind and helped us with the strollers, shopping bags and taxis on multiple occasions. Our kids loved the hotel and we will come back again.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "", "Title": "“Rooms need updating”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR127521704", "Content": "Although the hotel is excellently located in the example, and the neighborhood is elegant, our room was tiny and dark. The wood floors were extremely scratched and worn, the bathroom was claustrophobic, and didn't seem to deserve the 5 star rating. The lobby is cool and the rooftop lounge was lovely. It is time to renovate the rooms. Also the hairdryer was broken..", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Chadds Ford, Pennsylvania", "Title": "“FABULOUS HOTEL in Great area”", "Author": "momofmombo", "ReviewID": "UR127215836", "Content": "Just returned from 3 nights at the Claris in Barcelona. Great hotel. Rooms are modern and immaculate. Staff was great. Can not say enough great things about this hotel. Very attentive with subtle luxury amenities.", "Date": "April 3, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Excellent customer service”", "Author": "staceybl", "ReviewID": "UR126957028", "Content": "Not only is the Claris's location wonderful, but the customer service provided by the hotel is just amazing! The staff was accommodating and always went beyond expectations to say hello, and assist. The hotel has a small hotel feeling, very clean and the rooftop is a relaxing place after a day of touring this wonderful city! Would definitely go back and recommend this hotel to anyone traveling to Barcelona!", "Date": "March 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Perfect for a Mini Break in the Sun”", "Author": "Ruth_Reading", "ReviewID": "UR126751429", "Content": "We chose the Claris as the location for a family mini break in March 2012. It is well situated in the Business district which gives easy access to the Ramblas etc and is surrounded by upscale shops, restaurants and bars. The hotel is bright and modern with communal areas filled with antiquities and interesting exhibits. We were upgraded on arrival from a twin room to a suite which was very well kitted out providing every amenity you could think of and that other reviewers have listed! Standards are high here and the staff are discreet yet attentive. The rooftop bar & pool should not be missed!", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Owings Mills, Maryland", "Title": "“Hotel Claris is a gem!”", "Author": "Ronnie G", "ReviewID": "UR126624515", "Content": "We stayed in this ideal location in the L’Eixample district of Barcelona for a week in late March and found the service, amenities and especially the staff to be warm, welcoming and helpful. Located in the middle of an upscale area with great shops and restaurants; two blocks to La Rambla. Staff anticipated all needs from the gentleman who ran the sumptuous breakfast bringing cappiccino without request on my 2nd morning to Billiana (front desk staff member) suggestions for the best reasonably priced restaurants in Barcelona, where we joined locals out for the evening (not an American tourist guidebook in sight)! The rooms were beautifully decorated and the bed/linens are among the best I’ve ever slept on. Rooms were spacious and beautifully appointed; thick, fluffy towels and robes and marble tile floor in bathroom. Would happily return again!", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Enfield, United Kingdom", "Title": "“5 star service in the best location !!!”", "Author": "PaulandAndria", "ReviewID": "UR126389393", "Content": "We spent 3 nights at the Claris Hotel from 3rd march 2012 and stayed in room 322, The Claris is only 100 metres from the nearest metro station. The room and the bathroom was very clean, there is a mini bar, a flat screen tv and a free safe to use, also there were complimentary slippers and dressing gowns and toiletry set. The breakfast in the morning was very good with a hot and cold selection of food and the service from the breakfast staff was excellent !!! In actual fact the service from all the staff is excellent at the Claris !!! There is also an egyptian museum in the hotel which is very interesting. Also it has a lovely roof terrace and small swimming pool and gym and sauna. My wife booked this city break as a birthday treat for me, We were so happy to have booked a 5 star hotel at 3 star prices !!! Anybody that stays at the Claris will be very well treated and we would love to go back and stay there again.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Outstanding Service All Throughout”", "Author": "brad b", "ReviewID": "UR125731298", "Content": "It was my wife's birthday as well as the Mobile World Congress and thus needed the attention to detail necessary to satisfy both personal and business needs. The Hotel Claris excelled on both levels. We were booked into a fantastic loft that reminded me of a cool pad in Soho with all the amenities. In addition, the concierge Biliana and manager Maria Rosa were incredibly accommodating to ensure that we secured difficult to come by restaurant reservations as well as a fantastic guide to lead my wife around while I attended the Congress. I would highly recommend the Claris for anyone looking for an intimate but sophisticated experience right in the heart Barcelona. I am already helping a couple family members and friends get set up to stay there in the coming months. Muchisima gracias!", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“5 star Service at the best location!”", "Author": "cbuffara", "ReviewID": "UR125172674", "Content": "Steps form. P. Gracia with top qualityService ! Definitly recommend!", "Date": "February 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“Perfect except for a couple design flaws”", "Author": "directoman", "ReviewID": "UR125165491", "Content": "We've just spent five nights at the Claris and are very happy with our choice. Given the upscale atmosphere and attitude of the hotel and staff, the price was fair. It's located in a very nice upscale neighborhood and we were thrilled to find a Paul Pattiserie, or favorite Parisian bakery, a block away. It's a healthy walk to the Ramblas or the Gothic area, but we love to get our exercise that way, and like being away from the turismo crush. Our room was very nice, in the newer top floor area, had a fabulous view of the street but had some very questionable design flaws that seemed to be the result of overthinking by some modernist design committee. It's impossible to turn on the shower without stepping into the tub and getting soaked. There was no chair in the room at which you could sit at the desk...only an artisinal stool that was more suited for milking cows. After asking, though, they brough us one from a ballroom so I could work on my computer at the desk. We've lucked into a wonderful heat wave this week in Barcelona, which unfortunately made our room oppressively warm. The only way to cool it off was to request that they unlock the windows, which also allowed in the loud traffic noise. Internet service was a hefty 13 euros a day, even though we were members of the Small Luxury Hotels club. Given all of this, we very much enjoyed our stay and the service was fabulous. We would definitely recommend the Claris with those caveats.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Torrance, California", "Title": "“Location! Location! Location!”", "Author": "woogieandkate", "ReviewID": "UR124739292", "Content": "I booked our room at Hotel Claris on the advice of a world traveling friend and was extremely pleased with the choice. It was only after our visit that I read reviews on this site and was somewhat amused by any negative comments. The cumulative positive elements of this hotel surpass our recent experience at a Ritz Carlton. The location was perfect, the staff pleasant and attentive at all times, the quirky ambience was very comfortable, the rooftop terrace is excellent and we even enjoyed the bonus experience touring the Egyptian museum (we've been to Cairo and visited several Tut exhibitions in America). What endeared me to this hotel for all time occured when we were in customs and my husband realized his cell phone was missing. I emailed our last two hotels and got a timely response from Claris notifying us that the phone had been found in the safe by a maid. I was astounded when it was delivered by FedEx two days later. If Barcelona ever pops up on a planned itinerary, Claris will be our home.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Excellent Hotel in an Excellent Place”", "Author": "Sanchez73", "ReviewID": "UR124701812", "Content": "Claris has all you could wih for. Great location (walking distance to Passaige de Gracia, 10 mins to Rambla, many shopa and restaurants around). My room had a great panoramic view and was full of sunlight all day long (506, if you'd like to enjoy the same). Bathroom has the same panoramic window too so you can either enjoy a view of Barcelona or let Barcelona enjoy nude you :-) or simply close the curtain :-)", "Date": "February 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hampshire", "Title": "“Great hotel, well located with friendly staff”", "Author": "Nick T", "ReviewID": "UR124651332", "Content": "We stayed two nights for a birthday treat. Got upgraded to much better room on 5th floor and gave us a half bottle of red wine to enjoy together. Very happy overall - and was exceptional value as we booked months in advance (€120/130 a night). Few slight negatives - I would say this is probably a four star not five, both for quality of room but also service. The staff were very friendly when you engaged with them - but not pro-actively ensuring your stay was to a five star level with those personal touches. The room we had originally booked was too small and poorly equipped for five star - but upgrade was fine with a good view. Oh finally roof Terrace looked superb - and I'm sure great asset in the summer with pool and great city views.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Location": "5"}, "AuthorLocation": "Abu Dhabi", "Title": "“Great location”", "Author": "DenisEire", "ReviewID": "UR123845528", "Content": "the rooms are interesting, layout of the suites with the upper level TV area is quite funky. staff friendly, the f&b is good, roof top bar is great for people watching and looking out over the city. reception staff, at least the lady on duty on arrival was the only negative", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "andalusia", "Title": "“Unbeatable location.”", "Author": "mojaqueros", "ReviewID": "UR122806152", "Content": "Comfortable and, by Barcelona standards, good value for money. Outrageous €17 per hour charge for wi-fi and only 1(very slow) PC functioning in “business centre. Service was friendly and helpful. We were made to feel immediately welcome by the doorman who took charge of our car and parked it (and had it ready and waiting as we checked out!) and the reception staff cheerfully helped with street maps, directions etc..", "Date": "January 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York", "Title": "“nice location in the L'Eixample area”", "Author": "lisadhome", "ReviewID": "UR122797824", "Content": "My husband surprised me with a trip to Barcelona to ring in the New Year. Overall, we were pleased with this hotel. We arrived early in the day (9am) and the hotel upgraded us to an executive room that was ready. Per Trip Advisor reviews, I requested a room facing the center courtyard vs the street. We stayed in room 501. We had no view from our room given the choice to face the courtyard, but it was definitely less noisy than the street side. We live in a NYC apartment, so we are used to occasional noise from neighbors & didn't find it difficult to sleep due to noise from neighboring rooms. Granted we went to bed pretty late & rose pretty late (trying to eat late as the Barcelona locals do) We could definitely hear people talking & water running in our bathroom, but nothing bothersome. We did find that the room could get a bit stuffy at times. There was a heat/air switch, but it didn't seem to work that great on the cool setting. We found a big move towards conserving energy, and guessed that the hotel was limiting the time the level of the a/c. If the windows opened (they were locked), this may have eliminated this concern. We both thought that we might not want to stay here in the summer if the a/c could be a concern. (It was in the 40s & 50's most of our trip) The doormen, front desk staff & the housekeepers were all very pleasant & willing to help. There were several metro stops within walking distance. There are many nice restaurants in walking distance. Most of the shopping nearby is upscale chain oriented, but there were a few boutiques too. I preferred the boutiques in the Born area of town as they seemed to have more unique clothing & leather goods. Paco Meralgo was one of our favorite restaurants on the trip but a long walk or short cab ride from the hotel. Cornelia & Co on Valencia was a nice option for late night eating or grabbing something to go. Crusto bakery across the street from Cornelia & Co had lovely sweets and offered some yummy sandwiches & salads too. Dolce was a nice place in the same area. Known for their sweets, but they have a nice lunch & dinner menu too. Great price fixe deal the night we dined there. We enjoyed dinner at Habaluc too, also in walking distance & a nice option when you tire of all the Catalan tapas places. Great wine bar on Passeig de Gracia nearby too.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great location and staff”", "Author": "Susie523", "ReviewID": "UR122778996", "Content": "We stayed here for three nights in July 2011 in a two-story Duplex room (with our niece in a Standard room). Our room had a great walk-in closet and a lovely living room upstairs. We found the beds perfectly comfortable (and I'm pretty picky about that) although not plushy. We almost did not book here because of the high-priced WiFi, but we asked the front desk about this and you can get one hour free per room per day with a special code. It was all we needed, so we were quite satisfied. The rooftop lounge is absolutely delightful and we had a nightcap there on two of the three nights. We also used the (very small) business center to print our boarding passes. The artwork and ambiance of the hotel are impressive. The location is the best part of this hotel (in addition to a really accommodating staff, who made excellent restaurant recommendations). We were within easy walking distance of many attractions, restaurants and shops. It's not very far really to walk into the Barri Gotic, but this area is so much quieter. Most of the Gaudi sites are either just around the corner or a short walk. We would definitely stay here again. Highly recommended.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Perfectly Located Gem”", "Author": "robin p", "ReviewID": "UR122725226", "Content": "Amazing location, midway up, but one block off of the main drag (Passeig de Gracia) so you were minutes away from great restaurants, the Ramblas, Guadi sites, and great shopping; but it was quiet. Claris is more of a Boutique hotel than a typical 5 star, however what they lacked in amenities (tiny gym, small business center) they more than made up for in service. I was having trouble on the old PC's while trying to print boarding passes and someone from reception sat with me trying to help and eventually let me use her office computer; the concierge made and changed restaurant reservations as needed and made excellent recommendations - we ended up having a wonderful New Year's Eve dinner at a hip restaurant nearby that we wouldn't have known about otherwise. Rooms are nicer than in the picture and again, well serviced - twice daily maid service, ice within minutes of making a call, sent someone up to our room in 1 minute when the key was not working. Great for romance or a family - would stay here again.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great location and very helpful staff”", "Author": "Bleadonboy", "ReviewID": "UR122040332", "Content": "Had a quick pre Christmas break without the children. Arrived at the hotel around 8.30pm asked the front desk to organise a nice restaurant for us they were great. Restaurant booked, nice table , they gave us a card to show we were from the hotel which I am sure helped us get very attentive service. The hotel was in a great spot just off the main boulevard and close to the metro. They upgraded us to a suite which was nice and also very quiet. The front desk couldn't do enough to help providing maps booking restaurants and offering advice. We would certainly return to Barcelona and would happily return to the hotel Claris.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Keep returning...”", "Author": "pelun", "ReviewID": "UR121563154", "Content": "16-19 July Suite number 622 WIFI AT A (HIGH) CHARGE Booked through Small Luxury Hotels and was triple upgraded to a suite (nice)! Stayed many time at the Claris. Like the location and love their rooftop pool and terrace. Staff professional, friendly and service minded (not the standard feature in Barcelona). Even though bedrooms are nicely decorated and comfortable, they need to be upgraded. In particular the bathrooms which also tend to be a bit small (even in the suite). Rooms on the lower floors facing the street are a bit noisy so I stay away from them. But Claris has its charm, you get what you expect and most often also at a very decent price. Don’t expect W or Mandarin Oriental, but the quality and service is still more than adequate with a third of the price tag from the hotel mentioned. BUT why no free wifi???", "Date": "December 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Good, but rooms not the best”", "Author": "awesometraveller05", "ReviewID": "UR121374480", "Content": "Good location, quite small rooms and EXTREMELY hard beds! Pool and balcony were very nice, but pool can only fit about 3 or 4 people in it at a time. Very good service but VERY pricey!!!! Overall very good.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good. A rating.”", "Author": "Qrottyspj", "ReviewID": "UR121361238", "Content": "We just got back a week ago. I booked this hotel from all the reviews from this sites. Good location. About 2 blocks to the main shopping and reastaurant street. Hotel is new. Does have bellboy services. Room is cleaning. Air flow not very good in the room. Windows can't open it at all. I booked room with breakfast package. Breakfast does offer hot meal. Very good. Hotel also has gym, swim pool. We only spent for 3 nights. Didn't get chance to use at all. Very nice. I liked it. I will stay there again, if I do got back to Barcelona.. I give 3-4starts rating for the hotel.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Personal Letter....”", "Author": "DajanaS", "ReviewID": "UR121342366", "Content": "Dear lovely Hotel Claris Team! Your Hotel is unique in design and facilities. Small and cosy - to feel like home, even far away! Once you arrive at the small corner, the beautiful facade, with modern and historic architecture is welcoming you. The always helpful and very friendly doormen are greeting you with \"Ola!\" and you know, where you are! Regardless if luggage, shopping and sight- seeing advises or the TAXI request, the 2 gentlemen have been always at our service- prompt and warm hearted! Chatting with you...having a word, not just because they are supposed to, because they want to... Your amazing Front Office team, always busy, but quick and efficient in the same time- but never stressed or hectic. Any language spoken, always smiling, ANY request- they can make it happen. Thanks at this point for the apples :-) keep it! My special regards and thanks goes to your gentleman, serving every morning at the daily breakfast restaurant: very very friendly, prompt and supe attentive! Nothing came out of my mouth- he was already there...I never needed to turn around to look for anything...my coffee hot and never empty, he knew you from the first day and how you like your breakfast...how much more relaxing can a day start? At any point of service either the ladies cleaning the room, opening my bed sheets in the evening or the good looking guys from your room service ( good strategy!)...you have an amazing team and I trust you know! It is not common to receive such a positive attitude now a days in many places..keep them happy :-) Don't let anyone of them go!!! Whenever I will return to Barcelona and you are not running 100% occupancy, you will see me again :-) Cheers and thank you all very much, for such a pleasant memory! (P.S. Loved you bed and pillows!) D.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Great value and location”", "Author": "Joe H", "ReviewID": "UR121133646", "Content": "Fantastic hotel for the price. Great location and service, and a lovely breakfast. The rooms are well-furnished and impeccably clean. The bathroom is great, tho the shower was a little awkward to use. We enjoyed the rooftop pool and terrace to relax and for the views.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Good hotel but slightly pretentious”", "Author": "DoctorDebs", "ReviewID": "UR121128164", "Content": "Lovely location, beautiful and stylish hotel but the worst bit was the breakfast room and the low-ish quality of the overpriced food. Rooms were not on a par with the rest of the hotel but I didn't feel they were as bad as some reviewers wrote. The pool was nice but not really big enough to accomodate more than 2 or 3 guests at a time. And that's all the sun-loungers they've got anyway. Overall, good enough service, but I wouldn't go back to it when I go back to Barcelona.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Newtown, Connecticut", "Title": "“You Can Do Better...But Location & Staff Are Excellent”", "Author": "Thomas S", "ReviewID": "UR120928991", "Content": "We just stayed 5 nights at Claris Hotel. The diappointments: The rooms were the worst part of our trip as they were dark and cramped. They are kind of depressing to be in. You won't find a worse bed anywhere as they are hard and short to the floor. The bathrooms are luxurious yet dated and it's hard to get in shower easily. Eating in the basement for breakfast was not ideal...again, it felt dark and cramped. The positives: The hotel itself was very modern and you can't beat location...taxis are waiting across street 24/7. The staff is extremely accomodating. The rooftop is beautiful and a great place to relax at night with wine or anytime.The price was right but this really isn't a 5 star hotel...it goes downhill after lobby and friendly staff. More a 3-4 star.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Westbury, New York", "Title": "“CONVENIENT LOCATION”", "Author": "JRM1860", "ReviewID": "UR120586926", "Content": "Just returned from our 4 day stay in Barcelona and at the Claris. Couldn't be happier with the service of the more than accomodating staff, particularly Bilianna, the concierge. She went over and above in helping us to make the most of our limited time in the city. The hotel was very conveniently located just a block from a major street, but without the noise and hustle, bustle that would accompany such a location. The room was clean and spacious and offered a window that actually opened! The morning buffet breakfast was more than adequate with choices of hot meals prepared per your request. In all, a wonderful hotel in a exciting city.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Just OK”", "Author": "jim m", "ReviewID": "UR120403203", "Content": "Other reviews here note most of the positives and negatives.. Good location and nice lobby. Everything else at the hotel -- room, service, ammenities -- was just ok but nothing special.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Beautiful hotel and location”", "Author": "annekins", "ReviewID": "UR120266979", "Content": "We just completed out first trip to Barcelona. We stayed at the Claris. We were alittle unsure of our bearings as we had never visited this city. The Claris was perfectly located. It was a nice, quiet neigbothood and within walking distance of everything. We were able to walk to the Rambla and Placa de Catalunya. Also walked to the Cathedral and the old town area. Goudi house also within walking distance. Hotel upscale. Room was clean and very nicely equipped. Beautiful rooftop bar and restaurant. Food was excellent but a little expensive. Staff can arrange anything you need like transfers to airport. Taxis right outside the door. Shops close by. All in all-perfecC", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Location was great, lacked character”", "Author": "Julie P", "ReviewID": "UR120263268", "Content": "I give this hotel 3 stars because of it's proximity to cultural attractions (5 minute walk to La Pedrera and Passieg de Gracia). That is a definite plus. You feel the upscale nature of the hotel when you walk in the lobby; it's very modern and bright. However, the rooms are tiny and dark, so it is not a hotel you want to laze around in. The pool on the roof is just okay, there is nothing fancy or especially inviting about it. Also, internet is an extra charge, about 15 Euro a day, which is always something that surprises me in a nicer hotel. When I go back to Barcelona, I will probably stay somewhere else, I don't think this is worth the money.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Woodland Hills", "Title": "“Don't bother booking at this hotel!”", "Author": "Bumpyone", "ReviewID": "UR119958794", "Content": "My wife and I were booked into this hotel by a travel agent. The 5 star rating being shown for this place made it seem absolutely acceptable. Nothing could be further from the truth. Upon arrival we were taken to a room on the 4th floor. There was an odor (which turned out to be drying varnish) in the hallway which got worse when we entered the room. We asked to be shown another room. The next room was smaller and the bed was uncomfortable in appearance and more so when sat upon. Once again we asked for another room. After some delay we were told by the manager that the first room was an \"upgrade\" from the original room booking and the only option was another \"upgrade\" for a fee! We decided to try to stay with the first room when we were told that the facility staff knew what the problem was and it would clear in an hour or two. After waiting for about an hour we reentered the room and found that the odor was as bad as before. There was a clue just outside of the room: incense burning in an obvious attempt to cover the other odors! At this point we were tired and decided to try and deal with the problem by opening the windows and airing the room. The odor was not the only problem. There were no chairs, the closet was too small to hang anything more than a few shirts, the TV was not easily viewable from the bed (because there were no chairs the bed was the one place to sit aside from a low bench along the wall), the sink and floor in the bathroom were not clean, there were no tissues, access in and out of the tub was difficult since there was no railing or handle to provide assistance, one of the sheets on the bed was stained, the door to the small refrigerator would not stay closed, no food service in the hotel except at specific times, and finally, the lobby had only limited seating. We stayed three nights and did survive. The staff at Reception was as helpful as they could be given the circumstances and the attitude of the manager. Don't bother to book this place. There are a great number of hotels in the city to choose from.", "Date": "October 31, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York City, New York", "Title": "“Loved the hotel and its location”", "Author": "Janice K", "ReviewID": "UR119762529", "Content": "From the moment we walked thru the lobby everyone was welcoming, warm and friendly. The room was great (except the internet connection never worked from the room). I especially loved how helpful Pau at the front desk was. His restaurant and other suggestions were greatly appreciated. The location of the hotel is perfect for all the Gaudi sites. We would definitly return to the Claris.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Great Hotel - we would stay here again.”", "Author": "natk4", "ReviewID": "UR119738050", "Content": "Wonderful location for Barcelona. Great room -- we had a suite with it's own sauna. Didn't get a chance to use it -- too busy enjoying the city. Very good breakfast buffet. Only complaint is that wifi connection was very poor. Very helpful staff -- gave great recommendations for shopping and services in the area.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Randolph, New Jersey", "Title": "“Overall excellent hotel”", "Author": "harlady", "ReviewID": "UR119735038", "Content": "We stayed at the Claris for 5 nights in October. The room was excellent - very quiet, clean, turn down service every night. Although we got to the hotel early, our room was ready and we were able to check in. The concergie services were good, and we got a dinner recommendation almost every night we were there as well as other recommendations. The breakfast was wonderful, very fresh and an ample supply of food. We loved the location of the hotel in a quiet area of the city and walkable to everything, but definately not in the center near all the action of the Ramblas. We would definately stay here again!", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rancho Palos Verdes, California", "Title": "“Great Location, Service and Staff (what else you want??)”", "Author": "Tjunoon", "ReviewID": "UR119200395", "Content": "Recently we had a pleasure to stay at this chic hotel in the center of Barcelona. During our stay my wife got very sick because of the malfunction of our room aircondition. As anyone can understand traveling on vacation and get sick is the last thing you want. After talking with the hotel team about our situation, they helped us with everything they could, from calling a doctor, offer to change the room and help us in any way possible (even getting gatorade drinks, thanks Pedro) One of top of that, they deputy general manager, Ms. MaRosa was there to check on us on daily basis. She went out of her way to make sure we comfortable and if we need anything. We have been around the around the world and stayed good amount 5 stars hotels, because of Ms. MaRosa and her team makes Claris Hotel stand out from the most of them. Truely a pleasure experience when we needed the most during our tough times.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Not at it's prime anymore.”", "Author": "ardis5", "ReviewID": "UR119180708", "Content": "The good: location was pretty good, the rooftop was very nice and room service was good. The staff was helpful sometimes. The bad: couldn't figure out why they burned incense in the hall on each floor until day 3 when we were checking out and the smell of sewer gas was strong enough to over power the incense. The TV in our room did not work and they had no one to fix it. The toilet ran and had to be jiggled to stop it and had no one to fix it. Large crack in the wall by the door. The room was modern and fairly clean however overall this hotel has seen better days and is moving toward \"the run down and in need of updates\" phase of it's lifecycle. There are many other choices that are better for the price.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Macclesfield, United Kingdom", "Title": "“Jules”", "Author": "Cheshirechic", "ReviewID": "UR119147170", "Content": "Enjoyed everything about our stay at the Claris. The staff could not have been more helpful. We arrvied early for check-in left our luggage and went out for lunch. We arrvied back to be upgraded, at no extra cost, to a junior suite. Location is great. Would certainly recommend this to other people.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“Okay, but not outstanding for a 5 star hotel”", "Author": "EspressoDane", "ReviewID": "UR119054354", "Content": "Had high expectations as the hotel is a member of Design Hotels. The interior might all be handcrafted but so is the crack in the wall of my room only scarcely covered with some white paint in the wrong colour.. TV remote did not work, the internet connection that you pay 13 Euros for a day only sometimes work and overall I think you can find better value for money elsewhere. Staff was nice, roof top terrace with swimmingpool was also nice.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Not 5star by USA standards”", "Author": "Cjcks1", "ReviewID": "UR118807936", "Content": "The hotel was nice. Location was great. Amenities and staff were nice but... Walls are very very thin. Wifi is not free. And overall its just not up to USA standards of what classifies as 5 star. To me, not worth the money.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Lovely hotel, would definately go back!”", "Author": "JemManchester", "ReviewID": "UR118777052", "Content": "Stayed here at the beginning of September for 3 nights and had a very enjoyable stay. Before we left for Barcelona I emailed the hotel to say that we were celebrating my boyfriends birthday and on the first night they sent some champagne and strawberries up to the room! The room was really nice and we couldn't fault the maid service. Lovely roof top bar and the hotel is in a fantastic location.", "Date": "September 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Excellent hotel and service”", "Author": "D-and-C11", "ReviewID": "UR118650612", "Content": "We stayed at the Claris for four nights in late September 2011 and have nothing but praise for the staff, service and accommodation. Although the room was at the front of the hotel in the original building and looked out onto the street, noise was not a problem. The room was very clean and spacious, with an excellent king sized bed. Terrific toiletries and a nightly turn down service with chocolate was a nice touch. Nothing seemed like too much trouble for the front desk staff, especially Pau, who suggested restaurants and happily booked them for us and arranged taxis when necessary. The rooftop bar was a lovely spot to have a pre dinner drink. We stay in many high end hotels and I have no hesitation in recommending The Claris!", "Date": "September 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Allentown, Pennsylvania", "Title": "“Would return to Claris in a Heartbeat.”", "Author": "Judith H", "ReviewID": "UR118539106", "Content": "Of our week in Barcelona, we had originally booked the Claris for 4 nights and a noted hotel in the Ramblas for the other 3 nights. We enjoyed everything about the Claris--location in the Eixemple section and within walking distance of many attractions and restaurants and accessible to others by taxi or bus, our elegant and contemporary room in a stately and historic building, terrific rooftop pool, bar, and gym, friendly and helpful staff and fine service, and splendid breakfast buffet. Asked for a room over the front entrance and enjoyed our view from the long windows in our 2-story room, after discovering the motorize shade control behind the drape. The Claris is a fun conflation of contemporary and ancient artwork and decor. We became very attached to this terrific hotel and ultimately cancelled our reservation at the other hotel in the noisy Ramblas area so that we could continue our stay at the Claris. I inadvertently left some valued jewelry in the room safe and the staff was attentive in seeing that it was located and returned to me promptly to the US. We highly recommend the Claris and would return there in a heartbeat.", "Date": "September 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Atlanta", "Title": "“Perfect location, great hotel”", "Author": "LoveTravel1155", "ReviewID": "UR118185698", "Content": "The location was perfect for us, the hotel superb. The staff could not have been more helpful and friendly. And many thanks to them for the easy and early check-in after a long overnight flight. We would definitely return.", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "London", "Title": "“Lovely rooms and good location, but stay spoilt by very noisy re-furb work”", "Author": "Business_Visitor1", "ReviewID": "UR117590158", "Content": "Booked 2 nights in superior room in August 2011. Room on 5th floor was great but woken at 8:30 next morning by very loud hammering by workers re-furbishing next room. No warning about this work taking place when we booked, checked in or were shown to the room. Asked to move room and moved to similar room on 3rd floor and same thing happened next morning. Complained again and was given 10% discount on bill - Spansih sense of humour. Understand that rooms have to be re-furbished and that closing hotel does not make financial sense, but why not do the following: 1) notify people in advance so that they can make up their mind whether they want to stay 2) schedule noisy work, for periods when most guests are likely to be out of the hotel say 11 to 6 3) let guests know when noisy work will start and stop so that they can plan accordingly.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Service": "5"}, "AuthorLocation": "Mirandola, Italy", "Title": "“Staff were awesome”", "Author": "Mars1771", "ReviewID": "UR117364569", "Content": "Hey all, I had friends who stayed here and i would go over and meet them morning and sometimes for a swim at the roof-top pool. The staff were so very nice to me and welcoming even though I did not stay there. I'd recommend this and I did not stay here as they were booked out at the time or out of my budget, either way it was a great hotel and close to all good things in Barcelona.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Good but not as great as I thought it would be”", "Author": "JohnNYC980", "ReviewID": "UR117234996", "Content": "Nice but not inexpensive hotel. Room was clean but not as impeccable as the price would suggest. I chose a duplex room because I thought it would be cool. We never used the upstairs. Not the hotel's fault but something to keep in mind. I found that charging for WIFI was a little cheesy. We has stayed in less expensive hotels earlier in the week and it was free as it should be. Good location however and the staff was pleasant and very helpful.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Excellent Hotel In Great Location”", "Author": "jrp01778", "ReviewID": "UR117135074", "Content": "This modern hotel is a very short walk to most places you would want to visit and very close to a Metro stop. Our junior suites were large and quiet (We were on the courtyard side of the hotel, I don't think there is much to see in the front, but I can't imagine it is too noisy in any event). The housekeeping staff was excellent. The included breakfast was very good. The pool area on the roof is a very nice extra. The few pieces of fitness equipment on the roof work. The staff were always cheerful and generally very helpful. Like other small hotels, the same folks who work the front desk also take turns as the concierge. I do have to say that one of those folks was either not well informed or perhaps there was a language issue -- she said a restaurant didn't take reservations when it did (no harm because we were early enough to get a table), she said we wouldn't have to wait at another restaurant when the wait was over an hour (which was impossible for our children), and she didn't know that what we (and the map) would call a Furnicular was necessary to get from the Metro to the Gondolas to visit the old fort. None of these things was a big deal but if you speak to the front desk staff you might want to verify particularly important details. None of this detracted much from our very positive experience at the hotel which I highly recommend. Don't miss the exhibition of Egyptian artifacts on the second floor.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "East Hills, New York", "Title": "“Return Stay as Memorable as the First”", "Author": "Dan-Lu14", "ReviewID": "UR116990170", "Content": "On our third trip to Barcelona, we returned to the Claris Hotel which we had been to 3or 4 years earlier. On our initial stay, it had been considered one of the best hotels in this fantastic city because of its location, ( 1block off the Passeige de Gracia) unique architecture( beautiful modern, boutique style within a modernist palace), amenities ( great rooftop pool, bar and restaurants) and service. This time ,I was hesitant to rebook because the tour books (ie Fodor) were not raving as they had before. However, we were not at all disappointed. We still love this hotel because of what I have previously written. Also, I feel it offers great value, especially compared to other 5*L Barcelona hotels.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Dublin", "Title": "“Excellent hotel - love bar at the top for late evening drinks”", "Author": "aoife_37", "ReviewID": "UR116693554", "Content": "Second visit here. Good comfortable room and excellent service. Love the poolside bar on top of the hotel with excellent cocktail menu. Can be crowded at weekends thought Avoid breakfast in little basement downstairs.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Tampa, Florida", "Title": "“Great location, clean rooms and nice staff.”", "Author": "tpa2eurotravelers", "ReviewID": "UR116683282", "Content": "Went with a group of friends and although we did not spend much time in the hotel, each minute we were there was quiet and cozy. Us Americans had to get used to the small quarters and the bathroom was very tiny (we had a standard room with king bed) and our friends had an adjacent room, which the staff was very accommodating! The shutters were pretty cool as they completely black out the room with a touch of a button. The view was not bad at all. We were in central location from the tours and museums like Gaudi, Picasso, and La Rambla. The check in process was smooth and the hotel is clean and property was well maintained. The breakfast spread was phenomenal and the concierge was helpful in giving us directions, getting event tickets and they even gave us a courtesy car free. All in all we will return to this hotel soon!", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Skipton, United Kingdom", "Title": "“Overall it ticked all the boxes”", "Author": "The_Dalesman_53", "ReviewID": "UR116462940", "Content": "We went to Barca to celebrate our wedding anniversary (3 nights) and chose the Claris through Trip Advisor. The Hotel is very modern in style. Located close enough to be able to walk to many of the key sights and districts. Our room looked to have been recently refurbished and everything worked as it should. The only minor irritation was that our towels kept being replenished every day even though we indicated a preference to reuse them by placing them back on the rail as per the green policy info. We thoroughly enjoyed the roof top bar and pool area and appreciated the advice from the reception on the options for restaurants within walking distance. Overall this hotel contributed to what was a really great break.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Lugo", "Title": "“Perfect !!!!!”", "Author": "Lemos33", "ReviewID": "UR116381056", "Content": "Dear all, I recommend you the Claris Hotel, in the centre of the city, very modern and vanguardist Hotel. Very helpful staff, always available and the best concierge with a big list of recommendtions. Very big terrace with a very nice and romantic restaurant and live music at night. Our stay was a dream !!!!!.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Hong Kong, China", "Title": "“Very cold, unfriendly and unwelcoming atmosphere”", "Author": "magicHK", "ReviewID": "UR116328000", "Content": "As soon as we went inside the lobby, my family and I knew that we had made a mistake. The lobby had a dreary look to it. It looked like a lobby in a drab apartment building. We had stayed at Hotel Arts Barcelona before our cruise and what a difference. The feeling at Hotel Arts was upbeat, friendly and light. At Claris it was the exact opposite. In fact it felt a little depressing. There were only 2 people at the reception. They had us pay at the beginning, which felt a little odd. We went to our room, and it looked a little run down. We turned the TV on, and no TV channels were available. That night, a storm came. The rain poured in through a leak in the window, which seemed to show the poor construction of the building, or at least of the windows. The bathroom shower was poorly designed. The staff were not warm and friendly (in fact some of them were outright sour and surly), although they had a good tapas restaurant recommendation and the concierge helped us get tickets to The Sagrada Familia. We should also mention that the hotel is not kid or family friendly in any way. Overall, we can't recommend this hotel.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "2.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Valencia, Spain", "Title": "“Not a 5 star hotel in my opinion”", "Author": "Graham_Andrea", "ReviewID": "UR116267405", "Content": "When I say the best thing about this hotel is it's location, then you'll understand why I don't rate it as a genuine 5 star hotel. If you want a genuine 5 star hotel with fantastic rooms and service, then I would recommend the 'W hotel' (we have stayed there before). When I use the minibar in my room for my pleasure, I don't expect to find bottles of drinks that are not only 'flat', but actually OUT OF DATE!!! there is NO excuse for that.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Great location”", "Author": "GailFred", "ReviewID": "UR115786917", "Content": "Excellent quality, friendly and helpful staff. Wonderful quiet pool and dining area. Metro chic boutique hotel that is within walking distance to all the things you will love seeing in Barcelona. We loved the hotel!", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Perfect location, knowledgeable concierge and friendly staff”", "Author": "TravelBug_mkj", "ReviewID": "UR115573821", "Content": "We spent 2 days in Barcelona and stayed at this wonderful hotel. The staff was excellent! The concierge was extremely helpful, giving us great ideas for dinner (we went to some amazing local places thanks to her) and she helped us to secure tickets to La Sagrada Familia during a time that wasn't very busy. The doorman were also extremely pleasant and helpful - always ensuring we had directions and warning us to be sure to secure our belongings so as not to fall victim to pickpockters. The location of this hotel cannot be beat - it is very centrally located and within walking distance of most of the major sites. The rooms were clean and well appointed. We had drinks on the terrace both nights after returning from a late dinner and enjoyed a really relaxing time. The only item keeping this hotel from getting 5 stars is we were not able to check in until after 3pm. We arrived on the overnight flight, very tired and hoping to freshen up. The front desk staff pointed us to the bathrooms downstairs and said they would call us when our room was ready but it would be no later than 1 or 2pm. When we returned at 1:30 we found our room was still not ready so we went to get some tapas. When returning around 3/3:30 our room still was not ready and after hurriedly calling housekeeping we were finally able to check in and go to our room around 4pm. We saw many people checking out when we arrived at 11am so we were surprised none of the rooms were ready. I would still recommend this hotel but advise those hoping to check in early that this may not be feasible. Overall though, a great experience and I would stay here again.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "", "Title": "“All right”", "Author": "TanaLeah", "ReviewID": "UR115562367", "Content": "Beautiful design for certain. Don't expect welcoming warmth or a smile from the staff and you won't be disappointed.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Sydney", "Title": "“Great area and good hotel.”", "Author": "Cate31", "ReviewID": "UR115455118", "Content": "Great area, excellent service and very helpful staff. Breakfast was not included and was not tempting at over 20 Euro, however there are plenty of lovely cafes close by. The rooms were not soundproof and I was kept awake after midnight by the piped music playing in the foyer.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great welcome to Barcelona Hotel”", "Author": "seattlesez", "ReviewID": "UR115258598", "Content": "25 euro taxi from BCN.... smooth check-in.... comfortable room, quiet for jet-lag recovery... hip rooftop bar-restaurant with a small but elegant pool, all with a club feeling, a respite from the bustle outside.... EXTRAORDINARY LOCATION.... a great place to settle into Barcelona. Expensive but well worth it.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Remarkably appealing and hip - would stay again and again”", "Author": "GenandLauren", "ReviewID": "UR115094785", "Content": "We stayed at this spectacular boutique hotel for 8 days in April of this year and were wowed beyond our expectations. This is a stunning little boutique hotel and we HIGHLY RECOMMEND it for your travel accomodations in beautiful Barcelona. The rooftop patio we attended each evening for a pre-dinner drink and after one visit, they knew our drinks and they were on the table as we sat. The parma ham snack we had at the rooftop patio and restaurant was off the charts delicious. Rooms are great, staff goes above and beyond the call of duty to ensure you are well looked after. G&L", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "", "Title": "“Lovely Hotel - Great Location & Helpful Staff”", "Author": "cruiseyvrgirl", "ReviewID": "UR115064736", "Content": "Overall, my experience at Claris Hotel was great. We stayed in a duplex room. It was clean, inviting, and very comfortable. Very cool with the beds on the first floor and the living area at the top. Loved the ambiance of the hotel, especially the rooftop performance we stumbled upon Saturday evening. It was a memorable way to end our day after an afternoon of strolling. The mood was so romantic with the singer sitting on the steps and the band behind her. Breakfast was included in our room rate. There's an impressive spread in the middle of the room, but you could also have made-to-order breakfast. It was fabulous! The waiter that helped us was very attentive as well (look for a man with the mustache - I forget what his name is though!). My boyfriend and I both had a delicious omelet. One negative thing about this hotel though is the gym. It was very small with only a few cardio machines and a very small free weights area. Other than that, our experience was wonderful.", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Fab Hotel, Fab holiday and we will DEFINITELY return”", "Author": "goingonmyholidays", "ReviewID": "UR115051344", "Content": "We arrived at Hotel Claris at midday on June 27 2011. We were greeted by smiling staff and we were checked into our room immediately. The room itself was perfect - lovely soft cotton sheets and some very comfy slippers and robe were provided during our stay! The breakfast was absolutely wonderful - a great range of foods to cater for all breakfast needs and the wait staff were fantastic - especially the gentleman (didn't catch his name) but he was an absolute credit to that hotel! The terrace was lovely and got very busy in the evening, although we mainly used it in the day time but it was a perfect little haven up there! The walk form the hotel to the designer shops was 5 mins and a further 5 to the Ramblas - ideally situated!! We will definitely return to this hotel as the staff were magnificent and really made our trip special. (The only thing I know my husband would change was the lack of free wifi - we did manage to find coffee shops on the ramblas that allowed it but it would have been better at the hotel - however, this did not ruin our holiday with Hotel Claris)Thank you Claris!!", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Pay Extra for Everything”", "Author": "AZWiz", "ReviewID": "UR114917794", "Content": "It started out ok... the room at the Hotel Claris was clean and included a mini frig to keep some of our heat sensitive stuff in. I guess I expected that, plus other amenities as normal having stayed at numerous hotels all over the US. I admit it was my first time outside the US. I learned after the fact this hotel you PAY EXTRA for everything. The nightly rate ($270) was absolutely no bargain compared to comparable US hotel stays. Euros or dollars it's a high price. We stayed for two nights, except the first night was about totally opposite from the second night. At the beginning, I agreed with my wife that the room was peaceful and quiet. Well, that all changed on the second evening when apparently the hotel rents out the roof and the pool for parties! A huge party on a Thursday night going on and on to well past 1AM! Not good when you have get up by 6AM to met the plane. We were told when first checking in, that there was a pool on the roof, plus a bar and dinner entrees. Just assumed it was for the hotel guests only. On each floor next to the elevator doors is a small podium which listed the dinner entrees available that day on the roof and price. We were also told \"breakfast is served below the lobby between 7AM and 10AM\". Great I thought! Since we already experienced a delicious free breakfast buffet in Verona Italy, I was looking forward to more European fare... Not until we sleepily turned in our key at the hotel desk at 7AM did we see our supposedly pre-paid bill had been added to... a $32 charge for EACH of us for a measly breakfast we now regret ever having in their tiny basement! No where when we went downstairs the first morning, was there any indication that there was a charge. A huge charge! Considering it was only a few slices of fruit, little wedges of cheese, and very runny scrambled eggs. A waiter motioned that we must go to a specific table right next to the buffet table. Since I thought it was free, I dare not use tables in a more secluded spot. Since we thought it was free we even gave the waiter a tip! Bottom line, the hotel was noisy, expensive, no morning coffee, cold pool, no free room Internet ($15 per day). Our room was not even turned down the second night (everyone must have been at the party).", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Not much effort ,very noisy inside , a 4 star at best if you travel a lot and know how it works”", "Author": "lacosteman", "ReviewID": "UR114883870", "Content": "The hotel is situated in a great location . We were on the back end of a fabulous trip to Italy ,Sicily , and Palma , all at 5 star stops, La Residencia etc . We thought we had chosen a top hotel . The initial check in was okay but not warm though the man who brought our bags up was very helpful . The hotel is very noisy , I mean noisy , lots of banging , its not from the street , its inside the hotel . We went to the roof top bar for a cocktail , we could not get served despite going up to the manager and several staff over a 30 minute period , the staff were all consumed with a couple of girls sipping on the same drinks , this included the manager . We left and went across the road to a great place , had a good meal and spent our money else where . checkout was very cool and no questions were asked of our stay , in fact at no point in our stay did we have any communication from the staff . my conclusion is great location , poor management .", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "manchester", "Title": "“Lovely hotel, good location”", "Author": "ManchesterSnowbunny", "ReviewID": "UR114861535", "Content": "This hotel is in a great location for access to all parts of Barca. Has Metro stations extremely close closeby to all areas including the airport. Hotel nicely set out with a rooftop pool/bar/restaurant. Staff really helpful and friendly and room serviced very well several times a day including 2 towel changes a day. A great stay!!", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Atlanta", "Title": "“Better than the first time - unique and a perfect location”", "Author": "GeorgiaToast", "ReviewID": "UR114101798", "Content": "We'd stayed here in 2003 and when the opportunity to visit Barcelona at the tail end of a cruise came about, we again chose the Claris. I'd reserved three suites well ahead of our arrival for our small group and the others appreciated the Claris as much as we did. The front desk staff was knowledgeable and professional. The location is superb - close to the best shopping and close enough to the upper parts of Las Ramblas. Tucked a block away from major thoroughfares, so not noisy. The rooms are all different, 217 and 218 both have lofts. 217 with a living area upstairs and 218 with a great entry way and sleeping accommodations upstairs. Very clean and well managed with air conditioning that is silent and almost cold. We found our rooms to be quiet and nicely dark for sleeping in. It is affiliated with an Egyptian museum and each room houses various examples of Egyptian art. The roof houses a restaurant, cocktail area and pool. A great rooftop venue. We did not eat here, but enjoyed drinks. Like everywhere else in Barcelona, it is not busy until later. Great value and a If we are ever back in Barcelona, we'll again choose the Claris.", "Date": "June 17, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Mediocre hotel”", "Author": "JdbE", "ReviewID": "UR113595996", "Content": "My husband and I stayed in this hotel for 3 nights in April. We loved the neighborhood it was situated in, some nice restaurants and shops close by. However, the hotel itself did not quite live up to our expectations. It is a design hotel in the cold, impersonal kind of way. The staff was friendly, but nothing more than that. The rooms were impersonal as well, and the materials used looked a bit worn down. The roof terrace is great, however, so that is definitely worth a visit. Stay there for a drink and wait for the sun to set, then hit the town. Conclusion: While the hotel is at a great location, we will not stay here again soon due to the impersonal feeling the hotel breathes.", "Date": "June 15, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Not the money worth”", "Author": "Cedti", "ReviewID": "UR112517073", "Content": "Old old, not like 5 star but at most 4. Location is good.", "Date": "June 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“The trip of a LIFETIME!”", "Author": "FitGal19", "ReviewID": "UR111946164", "Content": "What an INCREDIBLE hotel. Before arriving, I was in constant contact with Victoria at the concierge desk. She graciously answered my MANY ,MANY emails about restaurants and sights to see and made all our reservations prior to our arrival. When we arrived she introduced herself right away and we felt welcome. She took us upstairs and bought us a glass of wine while we briefly waited for our room to be ready. At the pool overlooking the city (a breathtaking view) she went over our itinerary and explained how to get everywhere going over the mapof the city in detail.Waiting for us in our room was a bottle of champagne and strawberries to enjoy for our honyemoon, a very nice surprise. Each day when we saw her, she asked if she could be of further assistance. We then met Pau and Biliana who also worked at the concierge desk. They too were friendly and helpful. Each day Biliana when we came back from our long day of sightseeing asked how our day went, what we saw, and offered suggestions what to do at night. Tinto Verano was a FABULOUS suggestion of hers! It was like seeing an old friend to chat with at the end of each day. ALL the staff couldn't have been more friendly and accommodating. We kissed them goodbye and felt sad to leave them.The hotel is beautiful, clean, and in a perfect location to most attractions(within walking distance easily) MAGNIFICO!!!! Gracias Victoria, Biliana and Pau for making our stay in Barcelona A TRIP OF A LIFETIME!", "Date": "June 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "N.Ireland", "Title": "“Excellent Hotel - Could not fault it !!!!”", "Author": "bewitchinggal", "ReviewID": "UR109622305", "Content": "Just returned from a most wonderful stay in Barcelona for our 20th Wedding anniversary and I have to say the Hotel Claris more than added to how perfect our break away was ! We were on an early flight and arrived at the Hotel mid morning and the receptionist could not have been more accommodating in trying to get my friends and I rooms, not only together, but that were ready for us to check in immediately. She went to a lot of trouble and re-arranging to make this possible for us and was more than pleasant about doing so ! So we were able to check in as soon as we arrived - no having to leave our bags do shopping and then come back to our rooms ! Our rooms were beautiful with a lovely view over the front of the hotel. The service was excellent, the staff at all times courteous and all in all we just could not fault this beautiful hotel in the centre of Barcelona with the most amazing roof top Garden and restaurant overlooking the city. (We would recomment you book the restaurant in advance though as a lot of local people use it and as it was the week-end of the Grand Prix we could not get a table there in the evenings to eat - which was the only dissapointment we had !) So all in all we would highly recommend this Hotel for a romantic week-end away or a sightseeing tour of this amazing city ! A big Thank you to the Hotel Claris and its lovely staff for making our 20th Wedding Anniversary a happy and special one !!!! We will be back ! Tim and Heather Robinson", "Date": "May 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nice, France", "Title": "“impeccable in every respect”", "Author": "eagertraveller099", "ReviewID": "UR107948433", "Content": "I have been travelling since 1955 and have always sought out the best hotels wherever I went. The Claris, where I stayed for eight days, is among the very best. In every way I found it outstandingly good. The reception was as friendly and helpful as you could want and the hotel manager active, friendly and available. My room itself (I had a spacious junior suite) was extremely comfortable and attractive. The room service was impeccable (rooms are cleaned and used towels exchanged several times a day). Although I did not use them, there was a beautiful terrace pool and a small exercize room. One of the best features of all was the small, delightful terrace restauurant. The service was efficient and friendly; the cuisine was so imaginative excellent (and so well-priced) I had most lunches and several dinners there. All in all the Claris is a winner. It well merits its five star rating.", "Date": "May 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia, USA", "Title": "“A great hotel can make a vacation great - Claris is a great hotel”", "Author": "eac53", "ReviewID": "UR106857918", "Content": "One block off the best street in the best neighborhood in Barcelona, we could not have asked for a better location. Lots of restaurants, bars, shops it is convenient to everything. Beautiful hotel with spectacular public spaces. Art is everywhere in the Barcelona tradition. Our standard room was very comfortable, quiet and roomy with a great bed. Nice to have a sofa in the room to watch TV. Staff is helpful and friendly. On the down side, the shower is a little weird and difficult to control overspray, no free WiFi and we had some air conditioning issues. Overall a very good value and we would stay at the Claris again with no hesitation.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Albany, New York", "Title": "“Wonderful staff, average accommodations, no wireless access.”", "Author": "SpartanSue", "ReviewID": "UR105278317", "Content": "Beds and rooms are a little small. Wireless is said to be available for 15 euros/day, but we were only able to get a signal in the bathroom, and even that signal was weak. Location is good, not very far from metro stations or Eixample area sights. The staff was the only real highlight of the place, everyone was wonderful.", "Date": "April 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Traverse City, Michigan", "Title": "“Disappointing”", "Author": "marywynne58", "ReviewID": "UR104889186", "Content": "The hotel was extremely noisy and the staff not particulary hospitable. They were not very accommodating in helping with restaurants,sightseeing or bike tours. Thanks goodness we had the Frommer guide since it was our first visit to Barcelona. We could not sleep because we could hear the guests above,below and next to us at all hours of the night. For the price we paid it was very disappointing. Yes. my friend did let the manager know of our disappointment. Would not recommend this hotel to other travelers.", "Date": "April 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Paris", "Title": "“the room we were given was far from being 5 star L”", "Author": "anybodyParis", "ReviewID": "UR102881547", "Content": "Room small and dark (small corner window), small bathroom (1 basin), toilets not separated, small bed. Everything would have been perfect if the hotel had been 3 or 4 stars but for a 5 stars L, it is like daylight robbery. I guess that when you buy a package (flight+hotel) they give you their lowest standard rooms, which is not fair. You have to pay for listening music! great disappointment", "Date": "April 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“A great start to our belated honeymoon.”", "Author": "c2otto", "ReviewID": "UR102308871", "Content": "This hotel is in a great location-close to Passeig de Gracia, metro, and about 15 minutes walk from Plaza Catalunya and The Ramblas. It is a truly elegant hotel. They knew we were coming for our honeymoon, and they pulled out all of the stops for us. The rooms are spacious, and the bathroom is just stunning (sauna included!). Staff are extremely helpful. The rooftop bar/restaurant is fantastic, well worth the price. For those who have food allergies (I'm GFCF), they will adapt to your needs beautifully. There is also a small gallery in the hotel which has some great Egyptian artifacts. We were the only ones in it when we visited it. Only minuses to the hotel were we found the beds a little too hard to the point of not being able to sleep, no free wifi (15 Euro a 24 hour period) and the lack of English channels on TV. BBC world was frozen, so we really only had one channel to get any information from at all.", "Date": "March 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“You pay for perfect location, service, and a spacious room, and the Hotel Claris does not disappoint!”", "Author": "A TripAdvisor Member", "ReviewID": "UR101453725", "Content": "We have just returned from 5 nights in Barcelona and loved our stay at the Hotel Claris. We enjoyed early check-in, the ample and tasty buffet breakfast, extremely helpful staff, and perfect location. We were traveling with our two young children and the hotel was so accomodating, providing a roll away bed and even linens and slippers for our youngest when he decided to make the sofa his bed. The front desk helped us secure dinner reservations and always provided excellent advice. It would be best if they could provide free wifi but the two free computers in the business center sufficed. We loved our stay in Barcelona and the Hotel Claris had a lot to do with a great vacation.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "birmingham", "Title": "“Great Hotel”", "Author": "carly_bowles17", "ReviewID": "UR100628833", "Content": "My husband and I stayed here for our first wedding anniversary at the end of February for three nights. This is a nice hotel, fabulous reception area, modern, fresh and clean, and the bar/restaurant on the roof terrace is wonderful with a nice, modern sitting area with sofas and tables, then an inside part for the restaurant and a pool next to this (which we did not use as it was not heated and it was fairly chilly) however the bar was very overpriced but we expected this from a four star hotel in the center of Barcelona, however if you walk just minutes in any direction you can literally buy the same drinks for nearly half the price. The staff in all areas of the hotel are friendly and extremely helpful, they recommended some gorgeous restaurants and were happy to make us reservations. Breakfast was nice, fresh fruits, yogurts, pastries, breads, juices, coffee and they also offered a hot menu which was cooked on request which was very nice and the waiter in the restaurant offered fantastic customer service. The only down side to the hotel was the rooms, they were extremely dated and worn compared to the rest of the hotel; the rugs, the curtains and furniture needs to be replaced, and the room as a whole was small, dim and over looked some residential flats and gardens, however this is to be expected in a large city. The beds were comfortable and the maid service was fantastic, cleaning and tidying the rooms twice a day, and leaving complimentary chocolates on our pillows each night for when we got home, with some slippers and cotton mats laid out next to our beds, nice touch. The location of the hotel was good, but not fantastic, La Ramblas and the port were about a 30 minute walk away, as were the Picasso and Gaudi museums and we had to get a taxi which cost approx 13euros each way to the Nou Camp. However there was a lot of authentic Spanish bars, tapas bars and restaurants close to the hotel which we prefer to the tourist bars and restaurants anyway, so it was a bonus. The main shopping street was only a 5 minute walk as well, which is handy for those who go to Barcelona to shop. Overall we enjoyed our stay and we would certainly stay there again.", "Date": "March 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portland, OR", "Title": "“Lovely boutique hotel in wonderful location”", "Author": "Trish2007", "ReviewID": "UR96878644", "Content": "We just returned from Barcelona where we stayed at the Claris for 6 nights. The staff were friendly and helpful without being overly effusive. We looked at several rooms before choosing a junior suite that was very quiet as the window was not over the street. The bed was super comfortable. At first I thought it would be too hard but it was great. The hotel location enabled us to walk everywhere from the Eixample to Barcolonetta to Barri Gotic to Parc Guell etc. The only time we took a taxi was when we went to Montguiic. The only problem with the hotel was that you can hear flushing toilets and showers (both sounded like rain so not bad) but no noise from neighbors. Rooms are nicely decorated, stylish, and comfortable. I would definitely stay here again.", "Date": "February 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Bra, men förväntade bättre...”", "Author": "Encrenca", "ReviewID": "UR96424164", "Content": "Nice location, walking distance to several places of interest and tourist locations. Hotel room was hot as well as the floor I was in (5th). Small rooms, slightly out of date, but clean. The breakfast area was small. Nice and friendly staff! Confortable bed. Very nice pool in the roof with sunbeds and a restaurant.", "Date": "February 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Burnaby, Canada", "Title": "“Location and value make Claris a winner”", "Author": "Bigbadbob6224", "ReviewID": "UR96054230", "Content": "Stayed 5 nights taking advantage of Winter special posted on Travelzoo. Lots of good English speaking staff at front desk upon arrival and throughout our stay and helpful indeed. Interesting two level room separating bedroom/bathroom from living room mezzanine. Firm comfortable bed, spotless bathroom with high end toiletries updated frequently. Terrific breakfast with numerous and good buffet items and fresh eggs/omlets on request. One block from Passeig de Gracia and 3 blocks from Plaza Catalunya. Great shopping, restaurants, Gaudi buildings, subway, regional trains within a couple of blocks. What's not to like!?", "Date": "February 9, 2011"}, {"Ratings": {"Service": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Chattanooga, Tennessee", "Title": "“Find my luggage”", "Author": "esnyder25", "ReviewID": "UR96034039", "Content": "Upon Arrival, I realized ! had left one of my suitcases at another hotel in La Sue D'Guell, Spain. The staff at the front desk \"was on it\". My bag arrived the next day thanks to a great job by the front-desk staff. Great rooftop spa, sauna, lounge chairs, etc. Well located hotel.", "Date": "February 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Monte-Carlo, Monaco", "Title": "“Average 4* hotel, with a lot of faults”", "Author": "CesarAlonso", "ReviewID": "UR95597483", "Content": "Was a good hotel few tears ago, now is just living from the old times memories, it really need a deep refubishment, the rooms, even if are clean, you dont feel comfortable, the bed is like a 3* hotel, internet is a disaster......", "Date": "February 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Great Location but not quite a 5 star experience”", "Author": "mjp66", "ReviewID": "UR95233861", "Content": "The Hotel Claris is located in a prime area of Barcelona and within easy access to many of the main attractions this great city has to offer. If you are a fan of the work of Antonio Gaudi you will find Casa Batlo and Casa Mila within an easy walk of the Hotel and La Sagrada familia a short taxi ride away. As a family we were required to take out two rooms which were right next door to each other but not interconnecting as we were told this option is not an available configuration within the Hotel. Having to take two rooms made our 5 day stay considerably more expensive but after researching Hotels we chose The Claris hoping it had a \"WOW' factor. I have to say that although the staff at The Claris were professional and seemingly well trained the Hotel's public areas,restaurants and accommodation should really only rate at a 4-4.5 star going by European standards.The rooms are adequate in size and moderately furnished - nothing luxurious though. Despite the \"dirty\" windows being double glazed traffic and street noise can still be heard in the rooms facing the street especially in the early hours.The bathroom was spacious enough and there was a shower over a bath situation which was OK if you were able to climb in and out of the large bathtub - I would not recommend this though for elderly guests or young children. There was a nice arrangement of \"Derby Hotel\" toilettries on offer and bathrobes/slippers in the wardrobe if required. I always expect 5 star properties to offer tea and coffee making facilities in the room for their guests but this was not available at The Claris - not even complimentary bottles of water. During our stay (January/winter) the rooms were extremely hot and despite having the air conditioner on the lowest setting we were uncomfortably warm at times. When I enquired about this we were told they were on \"set\" settings - doesn't really make sense!! We only had breakfast once at the Hotel which was pleasant but pricey for what it was - the buffet was fairly standard with a few cold chef prepared items to jazz it up and if you wanted something hot then it was made to order. Fresh orange juice and coffee was also available but it was served by the Restaurant staff so you had to wait for \"top ups\" rather than having the pot at your table which was a bit controlling for my liking. We wanted to eat dinner at the hotel (although pricey) but the menu was just not that appealing or expansive enough to accommodate for the likes of our family. So, after enquiries at Reception we found an unreal Tappas Bar a few blocks away which was reasonable and delicious and we also ate on the Passage de Gracia just a block away from the Hotel most days for things like Pasta, Pizza, Tappas etc. All in all we loved our stayed in Barcelona...the hop on hop off buses are a fantastic way to get around and the taxis also offer a terrific service. There is so much to see and do in this great Modernista city that you really must allow at least 2 full days to explore it's vast attractions. Last note on The Claris - pleasant Hotel in a great location with professioanl staff but sadly it did not have the \"WOW\" factor I would expect from a 5 star Hotel in the Small Luxury Hotels of the World Group.If you want to stay here then make sure you get a great rate otherwise you may be disappointed with the cost v's value for money ratio. PS. Unknowingly we also arrived on a special celebration day in Barcelona \"The Kings Parade\" . If the Hotel Manager had organised a nice letter to be placed in all guests rooms advising them of this festival then we may have had the opportunity to attend this colourful parade. Also...the following day was a Public Holiday in Barcelona so apart from a few food outlets/cafes being open nearly everything else was closed!! Again, this information would have been welcomed at check in.", "Date": "February 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“TRULY A GREAT EXPERIENCE”", "Author": "jrmccoy1", "ReviewID": "UR94858476", "Content": "We traveled to Barcelona with great expectations and every one of them was met. The hotel location is terrific, staff marvelous,room clean and comfortable,roof top bar and garden a delight. We would go back in a moment and stay at the Claris. We loved Barcelona so much we have to return .", "Date": "January 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“Pleasant stay - hotel needs updating”", "Author": "Grenouillesansleau", "ReviewID": "UR94679660", "Content": "I have stayed in Derby Hotels before and liked them. I decided to splurge a bit on the Claris for this trip. While I had a pleasant stay, I don't think that the price differential between, e.g., the Astoria (about 60 euros) and the Claris (about 120) was represented good value for money spent. The Claris definitely has some pluses: the location is superb, the public areas of the hotel are stylish, and the staff I dealt with were very friendly and service-oriented. There are more amenities at the Claris than the Astoria (e.g., restaurant, bar, gym etc) and that no doubt is part of the reason for the price differential. However, there were a few, somewhat less satisfactory elements. First of all, the decor is a bit tired and dated - it needs refreshing, a coat of paint here and there, etc. Second, the bed was rock hard. (I like hard beds, but this was too hard for me.) Third, while there is a gym in the hotel, it is miniscule and fitted out with old machines. The single treadmill, for example, looked like the one I bought 2nd-hand 20 years ago. The rooftop room was cold (with no way I could see to turn on the heat). I realize one generally doesn't stay at the Claris to use the gym, but if a hotel is going to offer a gym, it should keep the equipment up to date. The pluses at this hotel outweigh the minuses, but as other reviewers have said, this isn't a 5* hotel in terms of luxury level, even if it does have the amenities typically associated with a higher-end hotel. The next time I'm in Barcelona, I very likely will stay at a Derby Hotel - but one that offers better value for money spent.", "Date": "January 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Good, but not great!”", "Author": "cabernetsue", "ReviewID": "UR94146116", "Content": "We stayed at the Hotel Claris from the 15th January 2011 for seven nights in order to explore the City. The hotel is located one block from Passeig de Gracia where there is an excellent selection of regular and high-end retail stores as well as numerous bars and restaurants. The hotel is well positioned for the Barri Gotic and also the districts of Eixample and Gracia. It is quite feasible to walk to the waterfront but it took us around half an hour to do so. Placa de Catalunya is located at the top of La Rambla and if you are visiting for just the weekend and want “tourist Barcelona” this might be a more convenient location. The area around the Hotel Claris is quieter and perfectly pleasant with plenty of shops, bars, and restaurants close by. It felt very safe to us both day and night. We did not eat at the hotel restaurant purely because there is a staggering choice of venues in the City. We would recommend Josephine’s (directly opposite) and the Vinoteca wine bar and shop, which is a five-minute walk north on Pau Claris - small but serves its own excellent wines and the best tapas that we found all week - highly recommended! As for the Claris, we found the staff very attentive and helpful and the majority had some English. The common parts to the hotel are maintained to a very high standard, namely the reception, bar, restaurant, corridors, roof terrace and pool. The hotel’s East 47 bar was quiet during our stay, and whilst a little small it was perfectly comfortable. We stayed in a junior suite at the Claris which was a good size with a separate seating area. The television had a reasonable number of channels in various languages but screen size and picture quality were not great. The suite was comfortable enough and quiet but unfortunately the bathroom was disappointing. The shower and bath were combined, and not well maintained. The bath had lost its enamel finish around the plug and drain holes, and really looked quite tatty. Some of the surrounding tiling and grouting was also discoloured. The shower is mounted behind a fixed glass screen and we suspect it was not always cleaned as it should be, as to do so would have required standing or kneeling in the bath. Overall we enjoyed our stay, but on the basis of our suite (and in particular the bathroom) that 5th star that the Hotel claims is, in our opinion, wishful thinking.", "Date": "January 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Lovely hotel”", "Author": "cgallag", "ReviewID": "UR93241601", "Content": "This hotel is in the perfect location - about a minute walk to one of the tour bus stops and only 5 minute walk to la rambla, on a beautiful street. Quiet enough at night so we slept really well. Staff were so friendly and did lots to make our stay enjoyable, e.g. I forgot an adaptor and they gave me one for the whole stay. Beautiful hotel and the rooms were lovely. Great shower and comfortable bed. Only thing is there was only one english tv channel which was BBC world news and its 15 euro to watch a movie which I think is too expensive.", "Date": "January 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Nice hotel but not a 5*”", "Author": "TTK", "ReviewID": "UR93215184", "Content": "We stayed in this hotel on a special offer, which included an upgrade to a duplex and breakfast. Our room was nice, albeit rather tired decor wise, inlcuding holes in curtains. Had we not been upgraded I would not have gone for the duplex as we didn't use the sofa area. Whilst our room was at the back and quiet we did hear a lot of noise from the other rooms despite the hotel information saying that the rooms were soundproofed. There were some 5* touchs such as having robes and slippers, beds turned down and lots of complimentary toiletries, but overall I don't think it warrents being a 5* - we have stayed in 4* hotels in Barcelona which I think are much better. The location is good and the roof top is fab, albeit the swimming pool area is quite small. Breakfast was very good although we found we had to continuously ask staff for more coffee, a cooked breakfast etc - I would have thought for 5* we would not have to had done this. The receception staff were quite helpful and friendly but they were not aware that the airport bus no longer goes up the Passeig de Gracia and could not tell us bus numbers for the buses outside the hotel (minor thing but all adds up). Overall whilst a nice hotel there are better in Barcelona from my experience so I would probably not stay here again.", "Date": "January 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Iowa City", "Title": "“Lovely hotel in great location.”", "Author": "IowaCityProf", "ReviewID": "UR93073115", "Content": "This was a great hotel, especially for first time in Barcelona. The rooms were spacious and very clean and comfortable. Loved the various bath salts. The staff was very kind, especially the folks at the front door, bellmen and maids (front desk very efficient and helpful). I loved our view but there is some street noise - not excessive but too much to leave windows open at night. My friend's room was inside so no view but quiet. We never ate in hotel - breakfast pricey ( 23 Eurosbut who knows...might have been great). Anyway, Josephine's across the street was perfect for coffee and rolls. Computers for guest use though I used internet which cost 15Euro a day...would be nice for that to be free someday. The pool on the roof is lovely and it was a great place to sit and have tea. We got a great price on our rooms and it was more than worth it. EAsy walking distance to everything and cabs and train stop for everything else! We had a few issues with wrong billing on final bill but staff fixed same quickly and with no hassle.", "Date": "January 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“Claris Hotel 5 Star!!!!!”", "Author": "CherrytreesGlasgow", "ReviewID": "UR92414587", "Content": "My husband surprised me back in 2002 and took me to Barcelona for valentines day. We stayed here at the Claris Hotel. It is goooooorgeous! The service is amazing, the room was a little snug but very luxurious! Would love to go back and stay there again. Highly recommend it.", "Date": "January 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nice, France", "Title": "“Perfect!”", "Author": "SLeila", "ReviewID": "UR92041453", "Content": "Everything was perfect! Great location, great hotel, but above all great staff. Thank you for making our stay so enjoyable and for being so helpful. Little things make all the difference: free internet access cards, complimentary coffee for early birds,complimentary tickets for the Egyptian Museum, fruit at the reception desk", "Date": "January 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Beirut", "Title": "“Charming hotel, helpful staff”", "Author": "Ghazi-Baker", "ReviewID": "UR92038846", "Content": "We stayed there over the new year , the hotel is in the center of the city yet just a block off the main P. de Gracia street , close to everything yet away from the noise pollution . we had a lovely duplex suite that is highly recommended. The rooms do need some maintenance but any negative point was compensated by the staff , Victoria (guest relations) was superb , and Luciano (the Argentinean bellhop) was brilliant with his suggestions and so helpful .", "Date": "January 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Texas", "Title": "“Front Desk RUDE, Management RUDE, Ran Credit Card as CASH.”", "Author": "AliciafromTexas", "ReviewID": "UR91517421", "Content": "For Dec 26-29, we stayed at Claris Hotel in Barcelona. Our stay was an great experience until the last morning at check-out. When we checked in, we were greeted by a front desk attendant, who informed us that breakfast was complimentary and served between 7:00 and 11:00. Upon reviewing our bill, however, we noticed a charge totaling 84 EUR (approx. $112.00) that was for 4 breakfasts . When we questioned the front desk attendant (a different individual than the one who checked us in) about these charges, he told us breakfast was not complimentary and ridiculed us for not reading the Claris Hotel website more carefully. We attempted to explain to him what we had been told upon checking-in and were met with additional rude and disrespectful comments. He never offered an apology for the confusion, despite the fact that the gentleman told us - in English - that breakfast was complimentary. Because we did not desire to continue dealing with this individual, we presented our credit card for payment. After giving the attendant a credit card to pay for the room, he informed us the card had been declined. We explained that there was plenty of credit on that card, but were met with - once more - a rude and condescending attitude. Because there were numerous people attempting to check in at that time - and we had already been humiliated enough - a different card was presented for payment. As we knew would happen, after leaving the hotel and checking with the credit card company, we were informed there was ample room on the first (allegedly declined) card to cover the stay. We were also informed that the attendant RAN THE CARD AS A CASH TRANSACTION rather than a credit for some inexplicable reason. Had he run the card as a credit card, as requested, the entire experience would have been avoided. Additionally, he failed to inform us that he was running the card as a cash transaction; had he done so, we could have corrected him and, once more, avoided the embarrassment and hassle of this situation. The real shame of the aforementioned experiences is that - up until this morning. And because of this, we are sad. As it stands now, after being treated the way we were, we will not only never stay at Claris Hotel-Barcelona again (or a Derby Hotel for that matter), but we will also never recommend this hotel to our friends and family. Lastly, when we emailed the hotel an explanation of everything that afternoon after checking with our credit card company, his response was embarrasing to the hotel industry. I have NEVER been treated like that by a hotel you spend $1000.00 with over 4 days. I was disgusted. Sleep Qualtiy is 0 because the \"Sound Proof\" windows are really not so...the street noise is so loud. The \"Business Center\" had TWO computers and neither of them worked. The internet shut down ALL the time and the mouse on one wouldn't work. When we asked the front desk about this, they really didn't do anything other than give us a card (reluctantly and as if we were annoying them) for free wifi for 30 minutes in our room. This hotel also did NOT have free wifi which many others do.", "Date": "January 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "newport news", "Title": "“Helped me when I was sick--wonderful staff”", "Author": "engprof", "ReviewID": "UR90612145", "Content": "I arrived at the hotel after getting sick on a cruise. The staff was so helpful, particularly the waiter in the breakfast room, Jimmy, who got me soup and made me feel better when I was really feeling ill. The hotel is beautiful and they made me some special room service. I'm just sorry that I couldn't enjoy the lovely hotel and Barcelona. But the service--whether you are ill or well--is excellent. Thank you Hotel Claris staff!", "Date": "December 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Perfect spot in Barcelona”", "Author": "JudyMG", "ReviewID": "UR89197366", "Content": "We spent five wonderful days at Hotel Claris. We loved everything about it, from the architecture and decor of the hotel, to the friendly and helpful staff, the ideal location, the quiet elegance, the charming rooftop pool and lounge, and the delicious breakfast. During the planning stages, I had read some comments in on Tripadvisor that concerned me but after emailing the hotel, I was reassured and decided to stay there. That turned out to be a wonderful decision. It was just perfect.", "Date": "December 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "philadelphia, PA", "Title": "“Claris, Barcelona Hotel - Excellent in Every Way!”", "Author": "travellingman", "ReviewID": "UR88415152", "Content": "On our recent triip to Barcelona, we stayed six nights at the Claris. In a great location - within walking distance to most of the sights we planned to take in - i.e. Casa Batllo, Sagrada Familia, Las Ramblas, etc. The hotel staff was very welcoming and very helpful in every way. The concierge recommended restaurants and was very much on the mark. The room was immaculate and in great condition. The overall impression of the hotel was remarkable. Upon check-in we were offered tickets to the Egyptian Museum and complimentary Cava for later that day. We would not hesitate to stay at the Claris on future trips.", "Date": "November 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Excellent Hotel”", "Author": "GValen", "ReviewID": "UR87883639", "Content": "The hotel was excellent overall....the staff were friendly and very helpful. The rooms were impeccable and the food was excellent. The hotel is also perfectally situated near many of the key sites and world class shopping.", "Date": "November 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "uk", "Title": "“Good location, some staff excellent, some not?!”", "Author": "zzzzzzzzzzzzzzzzzzz0", "ReviewID": "UR85776952", "Content": "We spent 4 days in Barcelona, before travelling south. Fab location for all restos, shops etc, and rooms good. Most staff in hotel good - namely reception staff, bar staff and doorman/concierge- however, breakfast waitresses were rude, impatient and generally awful! Considering we were a party of six, in 3 rooms, spending a significant amount, this was a definite disappointment to us. We are returning to Barcelona in January- hotel Claris was good but our custom may go elsewhere- purely because of bad manners from their breakfast staff. Seems such a shame ?!? The Voy Family", "Date": "November 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "mulhouse", "Title": "“very good hotel”", "Author": "patsye", "ReviewID": "UR85685897", "Content": "luxury design hotel and very helpful and nice staff. Excellent breakfast and location.Some criticisms are very hard with this hotel. I would recommand it definitely", "Date": "November 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Great Hotel, would stay there again”", "Author": "willieBB", "ReviewID": "UR85063080", "Content": "The staff were excellent and were extremely helpful. We were there during the strike and the staff were able to change our train tickets to Madrid and re-book us for a train the following day. The room was comfortable and quite. The location was close to resturants and the metro. The morning breakfast was very good. The afternoon of the strike we stayed in the hotel and used the pool and bar on the top of the hotel. We were able to waive to the strikers as they passed the hotel. The only downside is the resturant on the top of the hotel. We ate there once on Sunday night and the service was so so.", "Date": "October 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hilton Head, South Carolina", "Title": "“what a fabulous place from which to experience Barcelona”", "Author": "tiquer100", "ReviewID": "UR84920878", "Content": "Tthe Claris is a beautiful, charming modern hotel with an ideal location in Barcelona...a short walk to fabulous shopping, dining,architectural wonders and all the \"must see\" cultural neighborhoods. The staff of the hotel is extremely attentive, helpful and very knowledgeable about all the aspects of the city that any visitor might need assistance with. The roof-top bar and restaurant is an added bonus for the weary tourist or shopper---a great way to end the day!", "Date": "October 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Not a 5-star hotel”", "Author": "DesdemonaNewYork", "ReviewID": "UR84678884", "Content": "My husband and I stayed at the Claris earlier this month. The main snafu occurred at check-in which unfortunately tainted the remainder of our experience there. I am pregnant and had requested a no-smoking room. We were shown up to our 'non-smoking' room which reeked of cigerette smoke. I mentioned this to the receptionist who had shown us up there and she made a phone-call to the lobby and asked us to wait in the room while they figured out an alternative room for us. So far so good. Five minutes later we were called by the lobby and asked to come downstairs where we saw the another receptionist yelling at the lady who had shown us to our room saying that she shouldn't have told us to stay in that room because ''now we will have to clean that room!!!' All in plain view of us! And to make matters worse another receptionist told us very matter-of-factly, that 'yes, that was a smoking room. Now we will have to wait for a non-smoking room. Which could take another hour.' No apology!! My husband and I decided to wait in the lobby for our room. I want to note that I was visibly 7 months pregnant and a 5-star hotel would be a little more accommodating rather than have us wait for hours in their lobby. Its the little things that count and unfortunately the service at this hotel is sub-par. One annoying thing was the lack of free wireless internet. In the year 2010 I really do not understand why the Claris is charging for it. Initially I thought it was a Europe thing but I have stayed at plenty of hotels in Europe (a lot that are 5star) that offer free wireless. Moving onto the hotel. The hotel itself is nice . It is a small boutique hotel with a lot of trendy pieces of art being displayed. It is a block off Passeig de Gracia so its not that noisy. The rooms are a decent size, uncarpeted with a lot of wooden furniture. Nice bathroom with slippers, a bathrobe, hairdryer etc. There is a rooftop pool with a bar area around it that is quite nice. There is also complimentary coffee or tea that is delivered in the morning. Unfortunately the coffee was provided without milk so I would hold out and get my morning coffee from one of the cafes outside. Its in a good location-with most of the sights within the walking distance plus there is a taxi stand right outside the hotel so it was always easy to get a taxi. I do want to to say that the concierge we spoke to (Maureen) was lovely. She recommended some great restaurants, helped us make reservations and was generally super helpful. Also the white-jacketed doormen were very gracious, always smiling and ready to call you a taxi. Overall, its a good hotel, just not great. A 5-star hotel must provide exceptional service which unfortunately the Hotel Claris failed to do in our case. While not all the receptionists were unfriendly, the few that were (especially those involved with our check-in) made it a less than satisfactory experience for us.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“All-Round Excellence”", "Author": "rokisrani", "ReviewID": "UR84304112", "Content": "If you want a 5* hotel that is in an ideal location, has exceptional service and great views of the city then I cannot recommend a better hotel... My friends and I took a duplex suite which was extremely comfortable and spacious. Bathrooms are of a good size and there is plenty of cupboard space (walk-in wardrobe). I'm not sure what the other rooms are like but I do recommend staying in a duplex suite. The hotel itself gives off a boutique feel; the hotel lobby is very contemporary and filled with unique pieces of art, reminding you of what Barcelona is famous for. There is also a chic bar on the rooftop which offers a stunning view of Mt. Tibidabo. All the hotel staff are very friendly and extremely quick and efficient when it comes to meeting guest's demands; Room Service would arrive within 10 minutes of placing an order. Similarly, housekeeping would deal with any problems within 5 minutes of addressing an issue (unlike most hotels where you would have to wait at least 20 minutes for someone from housekeeping to come up to your room). All in all I was very happy with the Hotel and it made our trip to Barcelona all the more worthwhile. I would definitely stay here again.", "Date": "October 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Greenville, South Carolina", "Title": "“Outstanding Barcelona adventure”", "Author": "dodger1226", "ReviewID": "UR83891534", "Content": "Am writing this from my room. I read mixed reviews here before I booked the trip for three nights as a side trip from our original destination of Madrid. I must say the hotel and entire staff including the room cleaners, concierge, waiters, front desk, etc. provided outstanding service. Also, very, very cool hotel with art and all amenities, excellent room. Highly recommend.", "Date": "October 18, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New York City, New York", "Title": "“Beautiful hotel”", "Author": "Helenmoon", "ReviewID": "UR83811593", "Content": "Great location, beautiful hotel and attentive staff for a great price! Roof top pool didn't have enough seating though so we didn't even get to get to enjoy it but did get have a few delicious drinks there. Had a problem one night with dining at the restaurant hotel as the wait staff didn't want to seat us because we didn't have reservations and the restaurant was half empty, even though we were told by the concierge that we didn't need them. Finally the hotel manager came in and fixed the problem which was very nice of him. I would definitely go back", "Date": "October 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Great Holiday, Great Hotel”", "Author": "pscu", "ReviewID": "UR82656484", "Content": "The Claris Hotel is not only situated in a great location in the city it also has great facilities and friendly staff. It really is everything you can ask for from a hotel.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Cute little hotel - great value as \"Top Secret\" hotel”", "Author": "JQ_1a", "ReviewID": "UR82445902", "Content": "We spent two nights at this hotel at the end of August after booking it on lastminute.ie for 80euro's per night - what a bargain!. It is a small boutique hotel with a great roof terrace which has a pool, bar and restaurant. The hotel is about 10 mins walk from Placa de la Catalunya and the rooms were pretty decent too - bathrobes, slipper etc... It's not quite a 5 star but for that price, I would definitely go back!", "Date": "October 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "ireland", "Title": "“Great location.”", "Author": "brockcork", "ReviewID": "UR81952480", "Content": "Arrived after long train journey from pamplona and was just about to embark on another epic one between Barcelona and Paris. Hotel itself is reasonably trendy and lots of smiles from staff when checking in. There seemed to be a fair mix of guests there when I was checking in. Pool and roof top restaurant were not used by me so couldn't comment. I had read all reviews on here prior to staying and while I would say that it wasn't the quietest hotel that I've ever stayed in it wasn't deafingly loud either. I would stay again because of its location and staff smiles.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic Hotel in a great location”", "Author": "AKT52", "ReviewID": "UR81583991", "Content": "First time in Barcelona and we hit the jack pot - Hotel was brilliant , excellent location, wonderful room, beautiful breakfast buffet and a roof terrace not to be missed. Hope to be back some day!!", "Date": "September 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“where's the luxury? Only found attached to hotel name”", "Author": "Thousandeurist", "ReviewID": "UR79470067", "Content": "Extraordinary location for a hotel that seemed had better times not long ago, but there is no anymore worth of the “Great luxury” label. The members of staff we deal with (reception ladies and breakfast room waiters) were professional, attentive and caring. Standard double is a good size room with a king (very comfortable) bed, two-door-closet, sofa, tea table, carpet and LCD tv-set. The pieces of furniture are announced at arty ones, quite well maintained (not obviously brand new) and beautiful in a classic, sublet way. Bathroom let them down a bit, as it is quite old fashioned, with all this pink marble, bath tube instead of shower cabin and small size. Breakfast is fine, with a fair but short continental and cooked selection. Orange juice was good the very first day and not so next (did they run out of oranges?) but coffee is awful. Roof pool is a joke, more a puddle that anything else. There is only 4 sun bench available, so in a hotel with 120 rooms … just make your maths. Although there was live music on Fr & Sa, we didn’t stay for a drink up in the roof: it is small, lighting is not inviting and in essence there wasn’t any reason to stay over. Small things make the different and here is where hotel fails miserably: the mentioned undrinkable coffee, the frayed bathrobes (if you are not providing a wearable ones, just don’t provide any), the lack of any amenities that can be consider different, special or real value against cheaper 4* options…. In essence you don’t appreciate for a single second what you’re in a boasted 5* GL. If looking forward for the luxury experience don’t show up. There is no any.", "Date": "September 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Beware of terrible beds”", "Author": "BrianInDallas", "ReviewID": "UR78441425", "Content": "The beds gave both of us sore backs every morning- the were hard like a sofa and short. The last night a private party was being held on the pool level with a singer who was very loud. When we called down to complain, they said it was a private party and there was nothing they could do about it- really? Would not book again.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Structurally & Operationally Noisy - Aesthetically Attractive”", "Author": "AngloAlba", "ReviewID": "UR78267867", "Content": "Sitting on bed of suite on 2nd floor of hotel Claris waiting at 11:15pm waiting for loud music and singing to stop on 7th floor roof of hotel - the sounds of the roof being channeled down the middle of the hotel because of its design, and down the light shaft providing the small window to our bedroom. Reported to reception who say it will stop in an hour, so being unable to sleep for early morning departure decided to write review instead. The welcome to the hotel was fine, especially the later flourishes. The arrangement of the suite good. Large bed, bathroom with large bath, double sinks and shower over bath, dining table and on duplex floor a pleasant lounge. We checked in early in the day having arrived from night train, and were given a very welcome early check-in, but became clear through banging that there was building work in next door building. Reported to reception, but there was not another available equivalent room away from the adjoining wall. The noise from that came to be tolerable as occasionally background noise. The rooms themselves because of the hardwood floor laminates, insulation and plumbing could be noisy, though at their noisiest when housekeeping were cleaning adjacent rooms as one might expect. The lifts/ elevators tended to cause a low level hum in the room as they went up and down, but that wasn't reported to reception as an issue since there seemed very little to be done about it. The emptying of sinks, WCs and baths elsewhere tended to be heard as falling water too. Some small details missed, like an obviously broken bin in bathroom that one expects a hotel like this to simply replace, but not done until second time of asking. That's just niggles though. We were able to sit around the rooftop pool on all but one occasion when it was too busy, and it was not the hotel's fault that there was road works below that were noisy. The pool I'm told was unheated and cool, and lounging on the rooftop otherwise pleasant. Very much liked the location of the hotel and tended to walk everywhere from it, though there are also nearby metros and a taxi rank opposite. Breakfast was fine, though we tended to be left to our own devices once seated and served juice and tea/coffee. Bed lovely to sleep in. Enjoyed the visit. At times, would have liked a little more friendliness. Location great. Aesthetics of hotel and in-suite art great. Melted marks in bath less so. Our particular suite felt noisy from internal noises despite not having a window to the street, and was surprised at the earlier volume of tonight's rooftop noise, though it is less now at 11:45pm. Nevertheless, looking forward to silence later. As Barcelona is a vibrant city at night, late neighbour doors and sounds are naturally going to occur, but felt the hotel could be quieter in its own structure and operation. For instance, can hear sound of large number of people from roof singing and applauding now at gone midnight, someone whistling in next door room, large rolling wardrobe doors heard from room on other side, hum of busy elevators, and echos of people in corridor. Still feel privileged to have the opportunity to stay in such a place overall. Nevertheless, will probably try somewhere else on next visit, despite the hotel's and our suite's attractions.", "Date": "September 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin Ireland", "Title": "“A great stay in Barcelona”", "Author": "Marcpc", "ReviewID": "UR77824863", "Content": "This is my fifth stay in Barcelona and my third in this hotel which I stay in for two or three days as a treat after a few weeks holidaying on the cheap in a basic resort. The first impression of the hotel is coming in from outside Barcelona's hot summer weather into a reception area that's cool in two senses: Refreshingly cool temperaturewise, but also a cool blend of modern design and ancient roman and egyptian artefacts. The staff don't mess about getting you into your room which, provided its ready, is done prompty. We got an upgrade for the second time and they recognised us even though our previous stay was five years before. The pool at the top of the hotel is great, as is the nice bar/restaurant beside it. The exercise room is small but adequate. The staff are freindly and the interior design of the rooms, corridors and even the lift and interal atrium are all great. The location of the hotel is also very good. You are two minutes away from the Paseig de Gracia (the main drag) and so have the benefit of avoiding the traffic and high prices of hotels directly on it, but also of the lower prices. The nearby bar \"Les Gens qui J'aime\" is not to be missed for a dreamy late night drink in a mysterious setting. Neither are the restaurants \"Can Culleteres\" or \"Les Quinz Nits\" near and on, respectively, the Placa Real.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Lovely hotel - just lacking in a few basics”", "Author": "LauraSmyrell", "ReviewID": "UR77454178", "Content": "From the moment we arrived we were very well treated by the hotel - they greeted us by name, took our bags up to the rooms while we were checking in, showed us how everything worked and then made sure that we had everything we needed. The rooms were a decent size (we had a standard double and a standard twin), if lacking in some of the basics that I'd expect in an English hotel - there were only a few hangers in the wardrobe, no tea and coffee facilities (though you could order complimentary tea or coffee to your room between 5:30 and 6:45am) and that bath was very small. The rooms were turned over 3 times a day; once in the morning, just before siesta (if you were out) and then in the evening and the housekeeping staff were always helpful and friendly. We didn't eat in the hotel as we felt it was too expensive (breakfast was 22 Euro) and there were so many great value eateries nearby - try La Rita one block south, which has great food at really reasonable prices. The pool was lovely to relax in, though the space was very small and we were only able to secure a couple of sun loungers on one occasion during our 5 day stay. The only issue we had during our stay was a faulty safe, which couldn't be opened until the hotel manager came with her master override code. She was very quick to come and sort the problem, was very apologetic and left a letter for us when we checked out offering us a superior room upgrade for our next visit. A lovely hotel, but if you don't want to pay an arm and a leg for food; take a travel kettle and visit the small convenience store 3 blocks south on Pau Claris for milk, fruit and brioche.", "Date": "August 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "munich", "Title": "“nice hotel”", "Author": "krist2117", "ReviewID": "UR77305140", "Content": "very nice hotel in a town incredible great service and very good staff enjoyed.", "Date": "August 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“A beautiful hotel with uneven service, the Claris needs to better train its staff.”", "Author": "Keith000", "ReviewID": "UR77126031", "Content": "When my wife booked the room at the Claris for a week long stay for a combination of business and leisure, she requested a king size bed and received an email confirmation, but after we checked in we were brought up to a room with two twin beds. The front desk said that they were fully booked and could not change our room that night, but to try again the next day. There was no apology or attempt to compensate us. The next morning, a man at the front desk informed us that there were still no doubles available with a king bed. One of his colleagues looked up and said that yes, there was one available, which they gave us. In a week long stay, rarely did they greet us in reception. In fact, the reception staff was usually unsmiling, surly, and unwilling to assist. And we both speak Spanish fluently, having lived in Barcelona, so language was not a problem. It is a beautiful hotel, with an amazing rooftop pool deck and restaurant, but with prices starting at several hundred dollars a night, the staff should be bending over backwards to serve the hotel guests. The Claris was once known for its service, but those days seem to be gone. The management needs to retrain its staff.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NJ & Fl", "Title": "“Beautiful, well priced, well situated!”", "Author": "Ednamae08", "ReviewID": "UR76818445", "Content": "One block from the action, this oasis is a great bargain. The rooms are on the small side but provide every sense of a luxury hotel. The service is lovely and food is spectacular. The breakfast was included and is both a buffet and made to order. It is the prettiest presented buffet I have ever seen. Pool on roof top with bar adjacent. I would stay again.", "Date": "August 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Wonderful Staff, Location, Amenities....You will be Pleased!!!”", "Author": "monacogirl", "ReviewID": "UR76657969", "Content": "Excellent location,staff, breakfast, room,pool, rooftop terrace!!!!! From the moment we arrived, the staff was welcoming, friendly, helpful...always asking if we had a nice day touring or if there was anything they could do for us. The hotel itself is fun and nicely laid out, with a refreshing rooftop pool and terrace. Though sometimes difficult to find a poolside lounge, there were always seats or comfortable sofa options. Breakfast was delicious, with many superior fruit, cereal, veggie, egg ,pastry, yogurt options. The staff was always refreshing our cafe and juice cups. The rooms are large by European standards and though a bit worn, the size more then overcame that minor issue. Also our rooms were near the lift so until you fell asleep there was a background hum. Not a big problem relative to this great stay. The location is excellent, a quick walk to the Passeig de Gracia, a beautiful upscale shopping street and very near a couple of Gaudi sites, and Metro but far from noise. La Ramblas is 10 min. walk anyway. Excellent turn down service at night and always fresh towels when we returned after dinner. Wonderful overall !!!!!", "Date": "August 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cheltenham", "Title": "“Interesting choice of hotel”", "Author": "MrsDT", "ReviewID": "UR75628297", "Content": "My husband and I stayed at the Hotel Claris in August 2010. The main reason we chose this hotel is because the Manager genuinely seems to care what people think of his hotel (see other reviews here and replies from the Manager). Really nice touch on his part. We had an issue when we checked in and further to a complaint made to Reception, we found a complimentary bottle of wine, glasses, cork screw and chocolates in our room, with a note from the Manager... again nice touch. Staff on the whole were very good actually. Rooftop bar and restaurant excellent. Shame the other hotel restaurant and bar are shut in the summer though. Pool on rooftop way too small... only accommodates a handful of people at any one time. We were in a standard room which was a little tatty around the edges. Good central position though. Hotel expensive as it's a 5 star. However, in my opinion, the Hotel Claris is no more than a 4 star hotel... with a 5 star hotel Manager.", "Date": "August 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Very nice and convenient”", "Author": "Lyskamm049", "ReviewID": "UR75398511", "Content": "My wife and I stayed in Claris for a weekend. The hotel is perfectly located, one block away from to metro/bus station, with practically everything within walking distance. We wanted to stay away from the Ramblas and street noise and still be downtown. The Claris was a perfect choice, we could not hear a whisper from our room. We took the smallest kind of room available and liked it a lot. It is modern, cozy and spotless. We saw other larger rooms, really beautifuly ones, to be considered if you have money to spend. The terrace is also an asset.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Nice upscale hotel...but \"snooty\" staff.”", "Author": "atcken", "ReviewID": "UR74105671", "Content": "My wife and I stayed at the Claris Hotel for three nights while in Barcelona recently, one night prior to a cruise and then two nights following our return from the cruise. As previous reviewers have said, this is a very nice boutique style hotel with upscale “Euro” amenities. Positives: 1) One of the strong points of this hotel is the breakfast (make sure to get a package where this is included with your rate) which is buffet style offering a very nice assortment of hot and cold items. Unlike the front desk staff (see below), the wait staff in the breakfast area (located in the basement area but nicely appointed) were very courteous and attentive. 2) Location – if you aren’t averse to walking several blocks, the Claris is within 10 to 20 minutes walking time from many Gaudi sites as well as La Ramblas and the port restaurants and shops. We ate several times on La Ramblas, once down at the port, and once across from Casa Batllo and had a comfortable walk to and from all of these areas. Of course, taxis are plentiful too if you choose. The hotel is north of La Ramblas and Placa de Catalunya so you are away from the crowds until you choose to venture down to those areas. 3) Claris Hotel has a nice rooftop terrace and pool as well as a rooftop restaurant. I can’t speak to the restaurant as we didn’t eat there however we did have a few drinks while lounging up next to the pool and that was nice. We happened to be staying at Hotel Claris on the night of the World Cup finals and ended up watching the entire match in a viewing room the hotel had set up next to the restaurant. Wanting to avoid the huge crowds on the streets, it was nice to still be able to join in the spirit of the finals without venturing out. 4) The rooms themselves were fine – we stayed in two different rooms, each with a King bed and couch. We had a slightly larger room our second and third nights that had a view out the front of the hotel and this room had a raised area for the bed and step down “separate” sitting area which lead to the exit hallway and bathroom. The bathrooms were large by European standards and there was plenty of closet space. A safe was provided although the instructions were a bit confusing (again, see below). Noise was not too bad while in these rooms but they were typical of big city hotels where you can hear sirens, horns, street noise, etc. 5) There is a taxi parking area right across the street which is very convenient. Negatives: 1) The front desk staff seemed aloof and was not very customer oriented. As we entered the hotel, no one at the front desk even acknowledged us with a greeting. I finally went up to the counter and after a moment, an employee looked up and I actually greeted that person first! We just felt it was poor customer relations. They weren’t rude necessarily, just not welcoming. Even the manager acted perturbed when we had to have our in-room safe reopened. We were unfamiliar with this type of safe, had mistakenly locked it, and were just asking for help but this seemed to be an inconvenience to the manager. My wife said he even “rolled” his eyes behind my back when I asked for a quick demo of how to work the safe again. Very unnecessary to act this way, we felt, and maybe this attitude spread down to his employees. 2) We never saw a concierge the whole time we were there although there seemed to be a concierge desk. The front desk personnel did help us with directions when asked and so we found our way to the nearest Barcelona tourist information site for assistance with tours, etc. 3) Pay for use internet – an upscale hotel like this should provide free internet to the customers, in my opinion. 4) The elevators were very small - my wife and I had to take separate elevators when we headed down with our bags. Any group larger than 3 people has to take separate elevators so not too family friendly in that respect. Overall, an above average hotel experience but due to the “cold shoulder” from the front desk staff and the one manager we encountered, we probably would try a different hotel next time as there are many comparable hotels in Barcelona. I would think with the amount of competition in this city, pleasant customer relations would be a priority.", "Date": "August 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "rome", "Title": "“stay away”", "Author": "ondina2009", "ReviewID": "UR71452043", "Content": "there was a room, but with the swimming pool on the roof very NOISY all day long. there was a roof swimming pool, but with VERY dirty water, there was a breakfast, but in the basement instead of on the roof there a was a bath, but dirty there was a TV, but with pay movies only there wa a fitness room, but small and dirty the staff is very young, but unfortunetely very unsure. I suggest to go to this hotel only if you are in barcelona with no other options. trust me.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kuching, Malaysia", "Title": "“Near to Casa Mila and Casa Batlo”", "Author": "Daniel_THL", "ReviewID": "UR70109448", "Content": "If you like Egypt style, this chould be a good choice. Very well design common area and pool, spacious room - just I don't really prefer the dark brown colour theme in my standard room. view from the pool is nice but was closed when i was there in March.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "bristol", "Title": "“Location and roof-top pool are winners”", "Author": "grahamhuw", "ReviewID": "UR66745998", "Content": "Got upgraded from a duplex to a suite - cost me about €310 for two nights. Room was fab, staff polite and attentive. Rooftop pool / terrace is a great place to unwide before venturing out in the evening. Maybe not fully 5*, but excellent value all things considered - couldn't fault it.", "Date": "June 7, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Disappointing in so many ways”", "Author": "Holidayfan57", "ReviewID": "UR66623762", "Content": "The hotel was small and had a lovely roof-top pool. However, the room was not carefully checked before we arrived - the internet wasn't working, one TV was not working and one remote was not working. After several attempts they managed to fix the remote, but we had to wait until the second day for a TV engineer to fix the television. They offered us free internet in exchange. I must say that charging 15 euro for a half hour access to the internet seems very petty given the price we were paying for the room overall. We were three in the bedroom, but they forgot extra towels and they had forgotten to put the extra bed into the room. The rooms were very small, and with the extra bed it was very cramped. Room service was friendly but the selection of food was very limited. Wooden floors meant that the noise between the rooms was very annoying - trying to sleep in after 9 am was difficult because of the sound of adjacent rooms being cleaned. You also could hear people in the bathrooms on either side at all times of the day and night. I think that for a major hotel in a major city, The Hotel Claris needs to try much much harder to impress.", "Date": "June 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lisbon", "Title": "“Not a 5 star hotel nor a 5 star \"gran lujo\" as they state they are”", "Author": "richeyint", "ReviewID": "UR65185558", "Content": "I always value a hotel comparing it to previous experiences in the same category of hotel and as well depending on the type of hotel, meaning that a 3 star hotel can have 5 in every category. The Claris hotel is not a 5 star hotel at all.... The service is of a 3 star hotel: At reception they dont even look at you or greet you when you pass by. In the room the made put us some nice packed chocolates one day and never again we had them... One day we came to the room after it had been cleaned and the room service tray from the previous night was still there... 2 bulbs were dead the whole stay... There is no turn down service. They leave the room turned down since the morning cleaning. The quality of the towels is more of a 3 or 4 star hotel. The WC amenities are ok but not great for a named grand lujo hotel. The noise from the street is just unacceptable in a 5* hotel. The hotel has also some good things. The bed linnen is great and the terrace is very nice.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Good price but not a 5 star property”", "Author": "Wimsey", "ReviewID": "UR64410683", "Content": "I got a great rate on Expedia for the Hotel Claris in Barcelona. It was listed as a 5 star hotel, and was half the price of other 5 star properties. In hindsight, there was a reason that it was half the price. It just didn’t measure up to the standards of a 5 star hotel. I booked a duplex suite room. The room was split on to two levels with a bedroom and bathroom on the main floor and a sitting room above the bathroom. I would have preferred to have the sitting room on the main floor and the bedroom on the upper level, but I imagine not all guests would have wanted to climb the stairs to the bedroom. However, it would have been nice to have that option. The bathroom was a bit dated, but everything was very clean, and I liked the large walk-in closet. The staff at the front desk were polite and tried to be helpful, but I never really knew who to speak to if I had any questions. If I asked about restaurants, they would confer with each other and try to determine which person had the best recommendation. When I asked about museums and tours, again the person I asked kept checking with his colleagues until finally someone who could actually answer my questions appeared from the back room. It didn’t give me the confidence that the staff providing accurate or useful information. The hotel was well located with some other 5-star hotels nearby. The Mandarin Oriental Hotel was a couple of blocks away, and I ended up talking to their concierge if I needed any help. Next time, I’ll pay the extra and stay there instead.", "Date": "May 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Excellent location, service; rooms could use improvement”", "Author": "yaneh", "ReviewID": "UR64123350", "Content": "We stayed here for three nights at the end of April. Like many other reviewers, we were somewhat disappointed in the size, decor and ambiance of our standard room, not to mention the small window towards a nondescript courtyrad. We asked to see another room, and this room was slightly larger, but had a strangely shaped window and an even stranger odor, so we stayed in our original room. The rooms are definitely due for an update -- it would be easy to make the rooms much more comfortable and appealing despite their European size. That said, the common areas of the hotel, like the lobby, the inner covered courtyard and the roof are lovely, and the service was excellent. Katy at the front desk in particular was very helpful with a car rental crisis we had, and this was much appreciated. Most importantly, the location is terrific for viewing Eixample sights and the general area is very safe and has several excellent restarants. Some other hotels in the area may have more luxurious rooms, but if they are facing a busy street, the noise may be significant, whereas the Claris is on a quieter intersection 1 block from the Passeig de Gracia. We also stayed 1 night at the Le Meridian on Las Ramblas, which has almost exactly the opposite pros and cons from the Hotel Claris (excellent rooms, spotty service).", "Date": "May 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Helsinki", "Title": "“5 stars and wifi as an extra??”", "Author": "Armando_73", "ReviewID": "UR62938891", "Content": "Good location and nice place (even if it should be soon updated) but I dont understand a 5 stars hotel trying to charge wifi as an extra. Whats next? Paid for towels used in bathroom? Not logical in 21st century... This small details are the ones that makes people come back (or not to places).", "Date": "May 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London", "Title": "“Noisy room with tiny window is not worth EUR200 per night”", "Author": "PanicosLondon", "ReviewID": "UR60346921", "Content": "We booked this hotel on last minute.com for a long weekend. They showed us to our room but when they opened the door the non smoking room had an unbearable smoke smell. We asked for a different room and they placed us in a very small and depressing rear room. Again we asked to move and they gave us a 4th floor room with zero light. In the morning you could hear everything. It felt like the maid and the elevator were actually in our room. They said the hotel was full but it did not seem so and I feel they could have made an effort to give us a good room. I will never stay at this hotel again. A tip, if you have the cash stay at the arts hotel.", "Date": "April 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "davie", "Title": "“Outstanding!”", "Author": "cmrDavie", "ReviewID": "UR59732702", "Content": "Maria Rosa Castillo, Deputy Manager Victoria Amoros, guest relations manager Emma del Valle, guest relations They did a fabulous job for us. Three very nice and helpful people. 5 star accommodations and very, very accommodating. Everyone had a private room and we all had breakfast every day at hotel. Prices were extremely reasonable. They arranged several sightseeing excursions for us and also all of our meals.", "Date": "March 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Le Vesinet, France", "Title": "“Very good”", "Author": "florent", "ReviewID": "UR58967402", "Content": "Great location & staff, Average breakfast & room amenities", "Date": "March 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new jersey", "Title": "“Wonderful hotel in wonderful part of Barcelona”", "Author": "wajtv", "ReviewID": "UR58797500", "Content": "My wife and I recently spent a long weekend in Barcelona. We booked the Hotel Claris through one of the discount hotel sites at a very reasonable rate. It exceeded every expectation. The staff was superb (even to pushing the elevator button as you approached). The restaurant was world class and no more expensive than most of the local restaurants. The location in the Eixample district was brilliant. We were a short (two to three block) walk from two of Gaudi's masterpieces (Casa Batllo and Las Perdreras) and the wonderful Fundacion de Tapies and the Carrera Gracia was a wonderful place to stroll. And if you don't mind walking, the Barie Gotic and the Ramblas were not too far to reach.", "Date": "March 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Good location, Good hotel”", "Author": "Taruko78", "ReviewID": "UR50726016", "Content": "The Claris looks great for the outside and the inside. Its near the busy streets but its calm inside. Service is not to the standard of a 4 or 5 starts hotel.", "Date": "December 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "ohio", "Title": "“Good location, superior accomodations, unique elegance”", "Author": "photonutOhio", "ReviewID": "UR49600815", "Content": "Wishing to be a little remove from the Barri Gotic or La Rambla, we found this hotel to be ideal in many ways. The well thought out room decor made out stay very special.", "Date": "November 19, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "new york", "Title": "“Had a terrible stay”", "Author": "marmaduketravel", "ReviewID": "UR49322735", "Content": "The window in our room hadn't been sealed properly, and the traffic noise was terrible. We had a duplex room, and I ended up sleeping on the small sofa on the upper level just to get away from the noise. I complained to the desk, with no success. The pool area on the roof is beautiful, but didn't come close to compensating for our terrible experience.", "Date": "November 16, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Los Angeles, California", "Title": "“Horrible Hotel. Much false advertising in their amenities.”", "Author": "Steveola", "ReviewID": "UR48529932", "Content": "We spent a lot of money for a 3 night stay. It was the absolute worst experience I've ever had in a hotel. When we checked in, the front desk switched the room we chose and paid for online saying they didn't have what we ordered available. So they gave us a small suite in the back of the hotel with a tiny window and a view of the buildings in the back alley. The house keepers did a lousy job of cleaning the room. Upon check-out, the front desk staff coerced us into taking a cab to the airport which we were grossly overcharged for. When we came down to the cab, we found it had been running the meter long before we arrived and had racked up over 10 Euros in fees. The cab driver refused to blank out the meter when we refused to get in her taxi and pay for the time she waited for us before we even drove anywhere. When I insisted the that front desk call us another car service, they rudely refused. Because we had little time to continue arguing as we had to make an international flight we were basically forced to take the cab to the airport. On the way, the cab driver basically admitted she paid members of the hotel staff under the table to be on of the only cars they called for their guests. That explains why the front desk wouldn't accommodate us with another car and didn't care how awful we were treated by the cabbie. This kind of nonsense is something I would expect from a motel in a shady part of town, not an expensive hotel like the Claris. Other disappointing facts: A sign on the rooftop bar labeled it 'indefinitely closed', the outdoor pool was tiny and unswimmably frigid and their supposed 'fitness center' consisted of a cramped bicycle and treadmill.", "Date": "November 4, 2009"}, {"Ratings": {"Overall": "3.0", "Location": "3"}, "AuthorLocation": "London", "Title": "“Very disappointing..”", "Author": "AnnekeJaneWestberg", "ReviewID": "UR47877810", "Content": "I had read some great reviews about the Claris however struggle to see what all the hype is about. The pool is lovely - that was definitely the highlight. The room was small and dark and the bed was similar to a camp bed in size and comfort levels..The bar area is definitely not that of a 5 Star hotel - more IKEA canteen. We were very disappointed as it was not a cheap choice.", "Date": "October 27, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Lausanne", "Title": "“Very far from being a 5*GL!!!!!!!!!!”", "Author": "FrequentTraveller36", "ReviewID": "UR47778736", "Content": "I have stayed at the Claris 5*GL in Barcelona from 1510.09 to 19.10.09, and I have to say that this hotel is very far from being a 5*GL. I booked a Suite in the hotel’s website at the rate of 353 Euros per night (tax + breakfast included). To start with, some of the staff treated me in a very familiar way and they behaved as if we were friends, they didn’t keep the distance that has to be between the client and the employee. To follow, the suite is small taking into account that it is a 5*GL. For example the smallest Suite in any Four Seasons is 80 sq. m. (and this year I’ve stayed twice at the F. Seasons in Buenos Aires, so I know what I am talking about), and the room was in a deplorable state of neglect. Part of the ceiling is full of cracks due to humidity and it was never repaired. It seems that there was a leaking in the wall as it is full of stains that nobody bothered cleaning (see pics). The room is divided in two rooms by a sliding door. The room and the bathroom don’t have any window at all, which equals to zero ventilation (see pic). The wood floors are all scratched as a consequence of moving furniture around or adding beds (see pic). Last but not least, the furniture is just deplorable too! It gives the impression that they have gone to a second hand store and bought some spare pieces and cheap furniture and they put them together with the existing one, so nothing matches with nothing. For instance, there is an old English style wood table with three plastic black chairs!!!!! I’ve sent a three pages letter with the pics to the General Manager. The day that I left the hotel he came to apologize for the inconveniences and he deducted 100 Euros from my bill. I go very often to 5*GL and as far as I am concerned, that was not a solution. I don’t want to sound pretentious but if I can afford to pay 350 euros daily I expect to have a comfortable stay, and 100 Euros less in the final bill doesn’t make any difference. All in all I don’t recommend this hotel at all. There are far much better options in Barcelona for that price or for a slightly higher price.", "Date": "October 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York City", "Title": "“loved it- boutique feel with personal touches”", "Author": "jobmama", "ReviewID": "UR47187919", "Content": "We just got back from Barcelona- stayed for 7 days with husband and 4 year old daughter. I agonized of where to stay and was glad we settled on the Claris. It was beautiful and in the perfect area. one block from the train station which made it easy for short trips down to sitges. 1. This is kind of like the NYC Park Avenue area. This was a nice change of pace from the Rambles or Bari Gothic area. These are all close enough to walk to but not in the thick of tourist traps. It was a treat to walk back to the hotel where it was a bit less hectic. 2. Awesome pool deck to relax at 3. spotless hotel 4. great service- got fabuolus recommendations by conceirge for special restaurants 5. standard rooms have separate seating area. My suggestion is if you want a quieter room ask for the back of the hotel- if you want a bright room with a view ask for the front of the hotel. Also be sure to check rates on the hotel derby website. I found by booking direct I got a 25% discount which was cheaper than any of the travel sites.", "Date": "October 18, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York", "Title": "“Excellent well located find”", "Author": "Travelmaven64", "ReviewID": "UR47080450", "Content": "Stayed three nights at the Claris at the recommendationof our son who was there last year. Rooms are perfect. Services excellent. Front desk staff was very helpful and even the doorman remembered who we were. Hotel is located several blocks from Las Ramblas but is nevertheless within easy walking distance of all the major sites in Barcelona. It is on a quiet street so the hectic city noises were not a bother. There is an excellent rooftop restaurant. With all the great restaurants in Barcelona, this is on a par with those and is considerably less expensive than many of the other Barcelona hotel restaurants.", "Date": "October 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Maryland", "Title": "“Nicely designed hotel, good location”", "Author": "storm011", "ReviewID": "UR42757207", "Content": "We stayed here at one of their junior duplex suites last week. The rooms themselves are very nicely designed with nice hard wood floors, nice modern bathrooms and all the necessary amenities. Overall the whole hotel had a fresh modern design. The location is a short walk away from the main street. Service was good and anything we needed was brought to our room promptly. The roof top restaurant is good for a drink, but the service is pretty slow. The one issue I had with the hotel was the fact that there was no real concierge service. In fact I dont think I ever actually saw anyone at the concierge desk during our stay. Most of our questions were answered by the front desk people. While they were competent, they were not as useful as a a full time concierge would be. A five star hotel should have a full time concierge.", "Date": "September 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Miami", "Title": "“luxury at its finest”", "Author": "travellermack", "ReviewID": "UR38491700", "Content": "great hotel, great staff, great location, great views, great rooms, affordable luxury...highly recommended", "Date": "August 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "NY Metro", "Title": "“Red Roof Inns have better bathrooms.”", "Author": "syberseeker", "ReviewID": "UR35016963", "Content": "While the location is good, the lobby is beautiful, the rooms are clean and the service is impecable, the bathrooms were over designed for all style and no function. First of all, there is no ventilation -- not so much as a wall grate, so when you rush back to the haven your room to relieve the effects of an unfamiliar diet, you find yourself having to leave again till it airs out, which could be quite a while. The sink is one of those flat bottom troughs which look sophisticated, but don't drain. Your toothpaste and spit effluvia can sit there until the maid comes. The toilet paper holder is located so that you have to be a rubbery contortionist to reach it. The trash bin is a spring loaded lid with a pedal -- step on the pedal, and the can tilts forward and hits you in the shin. Most egregious, the shower has neither door nor curtain, and the shower head is a hand held thing. It is impossible to shower without drenching the entire bathroom, and the shower is in a very deep tub. So you have to climb out of the tub onto a treacherously slippery floor, and reach around to some remote place for your towels -- there are no bars either to hang a towel or to grab to steady yourself during the climb. Clearly, the bathrooms are meant for high style twenty-somethings who could care less if they soak the room or throw the bathrobes on the floor to mop up.", "Date": "July 17, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "U.S.", "Title": "“Beware of the Claris.......”", "Author": "travel5107", "ReviewID": "UR34649924", "Content": "Claris was recommended highly in Fodors and also some travel pubs and I did see it mentioned on Goop (Paltrow blogsite). Location is perfect and hotel at first glance and entry seems nice. Front desk staff is almost non existent in terms of getting any attention or assistance. Upon arrival they immediately handed us a full page list of warnings for walking around Barcelona...theft, pickpockets, etc. We travel a lot so this was something we are aware of in every city. The mgr. of hotel checked us in and insisted we pay for our 4 or 5 day stay right then on our credit card. Reservation had been booked months in advance and held with card. Had never experienced a hotel asking for payment on room stay up front. We let them put thru the charge because we were going to be there but were puzzled and he gave no explanation. I later asked the evening clerk why this took place and was told that a new ruling or law went into effect in Barcelona that all hotel rooms must be paid in advance upon checkin. The following day we visited some friends staying nearby at the OM and Majestic Hotel and I asked about this policy at the front desk and the staff told me there is no such law in Barcelona and their procedure for clients is to hold credit card for the booking and client pays bill upon departing the hotel. Seems the only rip off in Barcelona to \"beware of\" is the staff at the Claris who seem to have some scam going on. When I asked the desk clerk on another day what would be done if I needed to check out earlier that my 5 day stay.....after paying in full on 1st day> Answer: You would get a refund The staff only seem concerned with the traffic coming in and out for the rooftop restaurant/pool deck. During stay we could never find the concierge so we could get some assistance with a day plan. Not once did we see the concierge. Coming back to hotel in evenings...staff at desk always seemed to be having a party..sitting on the front desk...nobody is asked if they are staying at hotel...no security of any kind is present. There is a mgr. but he does not seem to know what a mgr. should do..except get your pymt. upfront - when you check is. Stay away from this hotel.", "Date": "July 13, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Francisco", "Title": "“Fabulous Hotel... excellent staff”", "Author": "travelwellca", "ReviewID": "UR32920883", "Content": "Hotel Claris is an all around winner! Great location, wonderful neighborhood - near great restaurants, shopping and GAUDI! Modern hotel with great design and artwork. Warm and hospitable staff. 7th Floor Terrace is wonderful - pool, bar and restaurant with views of the city.", "Date": "June 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Ubud, Indonesia", "Title": "“totally overrated”", "Author": "deepsapphyr", "ReviewID": "UR30429095", "Content": "we initially booked for 5 days but checked out after one night, rooms were very small, prices outrageous, location excellent. staff quite snobby. food quality so so wouldnt stay there again, there are much better deals going on.", "Date": "May 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Not a 5*L hotel, more like a 4* hotel”", "Author": "ARMNewYork", "ReviewID": "UR28148726", "Content": "My stayed in this hotel was from 4/5/09 to 4/8/09 (3 nights 4 days) The service at front desk was good/plus; cordial and welcoming. The reception area was very clean, 5* with a desing and decor from the 70's, 60's or 90's a little be of every decade up to the XXI century. My first room #501 was near the elevator and I could hear the noises of the doors open and close plus the going up and down, this was a double room for single use (full size bed) I called front desk and they put me in a different room # 502, room with 2 single beds, I was not very happy but I took it; the lady at front desk explained to me that the rooms were far apart. At night I found out that room 502 was nexts to the service elevator. The next morning they gave the choise to look the room first (that was nice) to see if I like it before they switch my room. My permanent room it was fine, on the 3rd floor in quite area. The rooms are in need of fresh paint, better matresses and a different way to stop water come out from shower in to the bathroom floor; as a guest of a 5*L hotel I don't like the idea of need to dry the floor every time I take a shower. The view from the window of this room was back of different buildings. In general the rooms are OK good size, nice bathroom (marble) very clean exellent towels and amenities, hight quality of linen but.... 5*L ?? I did like the location near every thing and far from the crowd; the food in the restaurant is very good, set menu, and good price special offer 25% off I did not like the terrase restaurant and it seems they don't have enough staff of servers", "Date": "April 16, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Worcester, MA", "Title": "“Hotel Is Under Construction, and it needs it!”", "Author": "kevinparvin", "ReviewID": "UR28082717", "Content": "Hotel is in a decent location, but I would prefer to stay closer to the gothic area next time. The major problem for me was the construction that was going in the hotel. We could hear loud banging, drilling, and grinding ALL DAY from 7am till 7pm everyday. Which may not be an issue if you are out most of the day and getting back at night, but when we first got there in the afternoon after a long flight we couldnt rest at all. I asked the guy in the front desk if he could put us in a different room away from the construction area, his response was that they have to do construction during the day and the rooms on the other side of the hotel that is further away from the construction area are an upgrade that I had to pay more, but you still could hear the construction, but not as bad. The hotel is not in great shape, but decent. I will NOT stay there again with the construction as they are redoing their rooms. Hotel staff and manager are NOT accommodating. We finally decided to move out of there for a piece of mind. Moved to Hotel 1898, closer to southern part of the city which is more activity, first class place and first class service, was a couple of bucks more, but money well spent.", "Date": "April 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Denver, Colorado", "Title": "“Wonderful Hotel in Barcelona”", "Author": "DeniseLaw", "ReviewID": "UR27463014", "Content": "Our family of three just stayed at the Hotel Claris in Barcelona and had a great experience. The hotel is located approximately 8 blocks from the Sangrada Familia and two blocks from the main shopping area. Like much of Barcelona, the HC is a very modern, contemporary hotel complete with its own art collection. There is a very chic rooftop pool and dining area (with a great view of the entire city) perfect for a glass of wine or cappacino after a long day of sight seeing. The pool is not heated. Hotel Claris had a great location. We could walk to just about any where we desired. Our room was a small suite that was well suited for our family. The beds were comfortable and there was plenty of room for all of us to relax when we weren't out discovering Barcelona. The staff at the hotel was very nice and helpful and by the end of our four day stay, we were on a first name basis with everyone. The breakfast that came with package was very good too. We did find that the restaraunts that we found on our own (especially for Tapas) were just as good and less expensive that the ones they suggested. One good suggestion they did make was for a small Tapas Restaraunt called Bohemia- fabulous. Be prepared to spend a lot of time at dinner as this is part of the experience; little taste of each artfully prepared dish. Dinner can easily last for three hours. Hotel Claris is just as nice as it looks in the pictures and a top pick for business or pleasure.", "Date": "April 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Belfast", "Title": "“Claris - a five-star hotel with one-star beds!”", "Author": "DRKellyBelfast", "ReviewID": "UR26458089", "Content": "What a pity! This five-star hotel has lots of potential: it's in an excellent location, it's very clean and the staff are friendly. However, following the worst night's 'sleep' we've had in years, a simple request to rectify a problem concerning a 'rock-hard' mattress could not be resolved. After telling us that 'all of the mattresses are the same\" and before demonstrating this unfortunate but extremely important oversight in three other rooms, they attempted, in vain, to address our problem by putting a thick blanket below the mattress. After expressing our concerns again and with little or no response, we politely suggested that, instead, they give us extra pillows to lie on - which they did. No questions asked! So was the problem resolved? Absolutely not! With no alternative, other than move to another hotel, I spent the remaining two nights of our five-star stay, sleeping on a settee in the room, while my wife slept on the pillows we had requested! Did anyone ask if the problem had been resolved to our satisfaction? NO! Ignore this genuine complaint at your peril - the 'five-star' Claris Hotel Barcelona.", "Date": "March 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Chester", "Title": "“Smart, quirky and a bit noisy but very cool and dont forgte to bring your trunks!”", "Author": "FarrahChester", "ReviewID": "UR26370054", "Content": "Good central position, great staff impeccably turned out. Nice to enjoy something different to the Holiday Inn on a business trip, forget it if your looking for Grand, but this hotel so suits Barcelona. A city that has reinvented itself to be my favourite destination when on business. Try and get an upgrade to one of their duplex suites, all very cool but equally all very comfortable. Restaurant’s menu is expensive and a bit weird for my tastes so enjoy the Tapas off the Ramblas or take advice from the concierge. Great roof top pool.", "Date": "March 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Beautiful design and convenient location”", "Author": "GeorgeTO", "ReviewID": "UR26030025", "Content": "We overnighted at the Claris Hotel recently following a cruise. Despite arriving mid-morning, the excellent front-desk staff were able to give us a room immediately. The hotel has a very modern, elegant interior with a glassed-in waterfall feature, visible from the glass elevators. There is a small gym and pool on the top floor. A display of Egyptian artifacts is on the first floor, where the restaurant is located. The hotel offers free admission to the Egyptian museum 1/2 block away. The room we were given was a bit worn (scuffed hardwood floor), but very clean. The bathroom had double sinks and a tub/shower combination, and a nice amenity kit. Robes and slippers were also provided. Wireless internet is available for 10 euro per day, but as we were there for just the one night, we used the computers in their business centre instead. Our major quibble was the noise in the room at night. There is a bit of street noise, and a noticeable gurgling sound that was probably coming from pipes in the wall. This can be a problem if you are a light sleeper. We also could not get the LCD television to work, but were not in the room long enough for this to be more than a slight annoyance. The location of the hotel is very convenient, near the centre of the Eixample area attractions and shops. We were satisfied on the whole with the accommodations, particularly as we booked a good promotional rate on the hotel's website. The overall feeling we got was that design here won over function.", "Date": "March 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Connecticut", "Title": "“Loved the Claris Hotel”", "Author": "sej904", "ReviewID": "UR25211284", "Content": "Central location for seeing the major sites made this a perfect choice for our family. The hotel was immaculate, service was friendly & prompt. Times are tough all over, so we were given a great rate for adjoining suites which were very spacious. One suite had a king bed, a table for 2 and a full size sofa that could have slept a third person or child ... don't know if they offer cots, but the suite could have easily accommodated a family of 4. Very modern interior, beautiful marble bath with european shower. The adjoining suite had 2 double beds, a desk and chair and a couch. Would definitely recommend. We walked everywhere from the hotel as the tourist bus lines were way too long!", "Date": "February 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Seattle", "Title": "“Not A Five Star Hotel”", "Author": "AAflyerSeattle", "ReviewID": "UR24930017", "Content": "We stayed at Claris Hotel during the World Congress last week. The rate were inflated to the large convention in town. Our rate was over 950 Euros per night. Since it was a five star hotel we were expecting a luxurious experience. As noted on previou reviews, the location of the hotel is super, and the reception area and lobby is very nice. However, the first room we got had two small twin beds. My husband is 6'3 and his feet hung off the bed. We pulled the beds together for that first night. The sheets were too short and rough. The beds reminded me of beds you would get at summer camp. The mattress was hard. They moved us to different room for the remainder of our stay. The King bed is not what I would consider a King bed (especially for a five star hotel). Same issues, hard mattress, sheets too short and scratchy. Some other issues we had with the hotel. The hardwood floors in the room were extremely noisy. You could hear other guests walking around. The tile in the hallways is also noisy. You could heard people coming and going morning and night. You could hear toilets flushing, showers being taken etc. We could hear water running all the time. Also, the walls were thin. I could hear coughing and talking in the other room. The housekeeper department made no attempt at being quiet in the morning. They were talking outiside our room and banging their cleaning equipment. The bathroom was adequate (but again, not a five star standard). Both rooms on the second floor had a living room loft area (a waste of space that we didn't use). The morning breakfast was just ok. The staff at the hotel were very nice and helpful. We never ate at the restaurant, but did have drinks at their bar.", "Date": "February 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Newcastle", "Title": "“old tired 5 star”", "Author": "darrenlikestotravel", "ReviewID": "UR22160676", "Content": "We arrived back yesterday, we flew to Gerona then drove down to barcelona. This 5 star hotel looked great from the reception, but as soon as you went into the room it looked really tired, it was once a nice room. The parque floors were scratched and dirty, the marble bathroom was fitted 20 years ago at a guess and there were black mouldy areas in the shower area in the bath. No seperate shower. The window would not open an inch and the aircon would not get cool, it was'nt a hot weekend although the room stayed stuffy and hot all weekend long. The gym was 4 pieces of dated equipment squashed into a small glass room on the roof and the pool was very tired too! What a shame, location great, the consierge was friendly and the city was wonderful. This is a four star at best hotel, with a note that it is tired.", "Date": "November 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Princeton", "Title": "“Best of Barcelona”", "Author": "Paud", "ReviewID": "UR20825554", "Content": "We stayed at the Claris before doing a Butterfield & Robinson bicycle trip in Barcelona. We found the location and the ambience sensational. Breakfasts were lovely. The concierge, Emma del Valle, was terrific in making dinner reservations and suggestions. It was truly a memorable experience.", "Date": "October 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Oh dear........................”", "Author": "lodea", "ReviewID": "UR19913737", "Content": "On the positive side, the staff, without exception were superb, friendly, helpful and courteous. Also the hotel location is very central. Like many frequest travellers I am curious how hotels of different styles, age, service, facilities etc....can equally be classified under a particular star rating as there often seems to be inconsistent offerings. While I have learned to accept this I can not accept a same star rating (5 Star GL) for two hotels owned by the same Group where their customer offerings are wildly inconsistent. I stayed in the Hotel Urban in Madrid in early August and could find no fault with this property or its positioning in the 5 Star GL market. I had looked forward to my stay in its sister hotel in Barcelona. Was I disappointed.................. I had requested early check in due to flight timings and was informed on arrival that the room was not ready, which was not an issue. The manager of the hotel was on hand to greet us on arrival and as part of our booking upgrade we were to get a complimentary glass of champagne and a room upgrade. Wonderful I thought! We were given a room to freshen up and then go to the roof top bar for our drink. When it came to signing for the drink the barman could not deal with it as complimentary as we had not been assigned a room! I paid! I am still waiting on my complementary drink................... We were given access to the room at 2:30pm. The upgrade room was duplex, which is a category down from the junior suite originally booked! We were then taken to another upgraded room. We had lost interest in complaining. After a while the various noises were a curiousity. I then worked out that our room was directly below the roof top pool! Noise of loungers being dragged along and all the splashing around. The pool closes at 8. The hotel makes reference to its \"total sound proofing\" - even the quiet summer time traffic of Barcelona centre was audible. If this qualifies as an upgrade, I dispare. As for the room......... the hotel prides itself on its antiques collection and boasts at least one piece in every room. Perhaps I missed it, but there was no obvious antique in the room. The advertised tea/coffee facilities did not exist, no iron/ironing board was to be made available - meaning (costly) hotel services had to be used. This is entirely unacceptable. The bathroom was clean and functionally but totally in need of modernisation. No, I won't be back, but it is the expectation gap from my Madrid experience that I felt most let down about.", "Date": "September 9, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Belfast", "Title": "“5 star?????”", "Author": "freqtraveller29", "ReviewID": "UR19147326", "Content": "Not a bad hotel by any means, it was clean, modern, trendy and the room was large with a large window and another in the bathroom. However I am not convinced it meats UK 5star status as the room showed its wear and tear and the entire hotel although uber modern lacks any atmosphere what so ever. My wife and I stayed in another hotel which did not boast 5 stars and yet was much superior in every aspect. The staff where friendly enough but to finish our honeymoon here after a great cruise around the med was disappointing, as i said before there is nothing badly wrong with the hotel but its 5 star hype was made insignificant when my wife said, I preferred the other hotel!", "Date": "August 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Fantastic Hotel +++++”", "Author": "Littlesean", "ReviewID": "UR19109099", "Content": "I recently spent five days at the Claris hotel on my 5th Visit to the beautiful city of Barcelona. This was by far the best hotel i have ever stayed in in Spain let alone in barcelona. The service was fantastic and the staff were very very helpfull. The rooms were luxurious and the room service was impeccable. I cannot find any fault with this hotel and you must try the terrace and the Pool on the roof. The location of the hotel is also perfect as it is right in the heart of the city and within walking distance of many famous sights and landmarks (La Rambla etc etc). I will definately stay here if i come back to barcelona and i recommend it for those that seek something special, the epitome of luxury, service, location and total comfort.", "Date": "August 19, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Need to improve!”", "Author": "pelun", "ReviewID": "UR19066108", "Content": "Stayed 5 days 6-11 july -08 in a Duplex Suite. It's my 4th stay at this hotel but unless there is an overall improvement I doubt will be a 5th time. The décor is not bad, art deco style, and rooms are comfortable. Bathrooms are bit run down but they are good in size. I’ve previously stayed in Duplex Suite and been satisfied but unfortunately this time had a room towards c/ Pau Claris and noise was disturbing. All Duplex suites are on 2nd floor. Agree with previous comments it is really poor the hotel charge for use of wireless internet. Previous occasions front desk staff including concierge have been helpful and service-minded, but this time must say they all seemed dull, tired, uninterested and not motivated (except the concierge Monday evening). The roof top terrace is very nice with its swimming pool although not enough sun chairs and, again, service is pretty poor (used to be much better). The gym is a joke. Machines which are out of date and useless.The air-condition didn’t do any help so it became impossible to stay in the room. Food and drinks at the hotel are ok, but I don’t think worth the price. Location is pretty good for shopping but not so good for the beach which is far away. This hotel needs to shape up in order to compete with the rising stars in Barcelona!", "Date": "August 18, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Saint-Malo", "Title": "“Wanted to enjoy the Claris but didn't”", "Author": "arutun", "ReviewID": "UR18744610", "Content": "Do not be fooled by the \"5 stars\" in the title of this hotel. This is far from 5 stars. As I sit here in our room waiting, waiting, waiting for reception...they seem to tell you everything you want to hear but are never quite able to deliver. The hotel boasts about \"Mercedes Smart courtesy car\" -- actually this is a rental that you must pay for. The hotel only has 2, and on this day the owner of the hotel is galivanting around Barcelona in one of them. That leaves one car, which is apparently unavailable. The hotel website mentions \"wireless internet service\" -- this is paid internet like any other ordinary hotel. The restaurant tried to cheat and overcharge us. At first, the waiter tried to charge the room without showing us the bill. Then it became clear there was an additional $40 charge on the bill that had appeared mysteriously...imagine that. The bands playing on the roof last night and today can be heard in pretty much every corner of the hotel. Location is good, which is one thing they can't fake.", "Date": "August 8, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "miami beach", "Title": "“Eixample location is great”", "Author": "bkmiamibeach", "ReviewID": "UR17551824", "Content": "We spent 3 nights in Barcelona. Loved the city but hotel was not great. It was the most disappointing of the hotels we stayed at during our 2 week vacation. However it was the least expensive of the hotels we stayed at as well. The Hotel Claris is rated a 5 star GL hotel but it does not exude a luxury hotel feel. The Hotel Majestic one block away exudes that luxury hotel feel. The public spaces in the Majestic had a 5 star feel where the Claris did not. The Claris is a 19th century building that has been completely gutted and converted into a very modern hotel with interesting design and modern atrium in the middle to provide light. Our junior suite was very dark with a separate livingroom with no window and the sole window in the bedroom was on a courtyard with very little light. The roof top pool and lounge area was nice but the gym is poor. just 3 cardio machines in a very small space. We totally enjoyed our stay in Eixample as opposed to staying in the more touristy Las Ramblas area. Within easy walking distance are the fine shops on the Pg. de Gracia (1 block away) and many of the fine Gaudi architectural treasures are within walking distance. I love art nouveau design and there is great examples all around. I enjoy walking and the old city is a good walk away but for those that don't enjoy the long walk it is just a short cab ride. There are also many great restaurants and cafes just a short walk away. We spent 3 nights there but we could have easily filled 6 days in Barcelona. There is much to see do and experience. Also the city is every bit as sophisticated as the top European cities.", "Date": "July 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Princeton, NJ", "Title": "“Not really 5 Star, pretty loud, very stylish”", "Author": "DTimberLD", "ReviewID": "UR16478352", "Content": "Stayed one night at the Claris on our way through to France. Nice modern decor, great terrace bar & pool. The room and service were lovely. The staff were really helpful and all the amenities in the room were great - clean, well stocked with toiletries, towels, robes, slippers, etc. Very rough sheets (appeared to be linen, as in not cotton but actual linen, but the effect was too hard for me) were a disappointment. The a/c worked well and is completely temp adjustable. One big caviat - they are not soundproofed. The hallway is not the issue - there is a lobby door between the room and the bath/hall door. The issue is really the windows to outdoor. We were awakened to traffic sounds and an auto accident, even though we were on the top floor. Easy access to business center downstairs with two computers & internet access free.", "Date": "May 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Good, 4.5 star - not quite 5 star”", "Author": "Superdocuk", "ReviewID": "UR16136574", "Content": "I stayed here whilst at a meeting in Barcelona. The location is great being just one block off the Paseig de Gracia and hence only two blocks from the metro. The hotel itself has been constructed within an older building and the architecture is very interesting. The hotel is built around a central atrium. The front lobby is very arty with various glass and water features. The public areas were generally of a high standard. The front desk were very friendly and helpful. My room was on the fifth floor - the lifts are very small, glass affairs. The furnishings were to a high standard in the room. The bedroom and separate bathroom were spotlessly clean. It did suffer majorly from having only one small window which was set a one end of the room and opened out onto the internal atrium. This meant that little natural daylight got into the room. The toileteries were ample and of good quality. Breakfast was served in the basement - so no daylight there either. The room I found to be featureless and devoid of atmosphere. It started serving at 07:00 which is quite late for business people. The choice was reasonable and the presentation faultless. I have had better breakfasts in Spain, but I have had many worse. There is a pool on the roof but this is much smaller in reality than the hotel website photographs would suggest - so be warned you won't being doing traiing laps here. There is a bar beside the pool and another small one on the ground floor. Overall this is indeed a luxury hotel but I am not sure it meets UK 5 star standards, mainly due to the lack of amenities. It is a moderate sized, boutique-type hotel rather than your large scale Mariott or Hilton.", "Date": "May 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Virginia Beach, VA", "Title": "“\"Don't Believe the Negative Reviews - A Wonderful Hotel\"”", "Author": "VAEnglishteacher", "ReviewID": "UR14818714", "Content": "My family and I stayed at the Claris during spring break. We missed our original flight to Barcelona and our luggage did not arrive until a few days after we did...it was very comforting that, from the moment we arrived at the hotel, the staff was very accomodating; the Public Relations Manager, in particular, went way above the call of duty to help us with our lost luggage crisis. The rooms are nicely adorned and we particularly appreciated the hardwood floors and furnishings. The location is accessible to \"all that's Barcelona,\" and the room rates are very reasonable for the ammenities offered. We look forward to staying at the Claris again on our next trip to Spain:-)", "Date": "April 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Amsterdam", "Title": "“Fantastic Service”", "Author": "Lizzy36", "ReviewID": "UR14544629", "Content": "My husband and I stayed at the Claris over the Easter holiday weekend. While I was concerned about the service over the holiday weekend, we had nothing to worry about. From the moment we stepped out of the cab until we left, we received warm hospitality and excellent service. We ate dinner at the hotel one evening because we were too tired to go out. The restaurant was quite excellent with service and quality of food. While we had an outside room, I would admit that the noise level to the street was noiceable but not too distracting as we slept in most days. Also, the rooms are not large but they are quite clean and our rooms were serviced every day. Lastly, my husband and I wanted to go to an Easter mass in English. We had located a church prior to our arrival but didn't mapquest the location. The hotel concierge was kind enough to map it out for us and gave us the easiest route.", "Date": "March 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lugano, Switzerland", "Title": "“Good location, particular rooms.”", "Author": "quattromonti", "ReviewID": "UR14530174", "Content": "The Claris Hotel is sort of a boutique style hotel. They have duplex rooms wich are nice but a bid old style. Lobby is nice and location is good!", "Date": "March 25, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "no", "Title": "“Unbelievably Noisy for late sleepers and rotten service”", "Author": "996vtwin1", "ReviewID": "UR14195854", "Content": "First of all I will must say that overall this hotel wasn't all that bad except for an Extremely big problem. Understandedly Spain is known for it stone and Marble but this is a Huge problem for a hotel that uses all the corridor flooring in Marble/Stone and has thin walls. At about 10am the Hotel comes alive with showers, toilets flushing, made's service, elevators, shoes clacking, vacuums and chattering. If you are a late sleeper like me this Hotel is a nightmare. The noise was so loud that even a deep sleeper would have problems. The bedding wasnt all that great either and the mini bar was scant. I guess I can go on and on but it's really not worth it. I should have followed a person's advice and stayed at the Majestic which was a blcck away. I also want to mention the front desk was also very rude.", "Date": "March 10, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rockville Centre, New York", "Title": "“Location, Location, Location”", "Author": "ChinadollRVC", "ReviewID": "UR13152186", "Content": "During our recent trip to Barcelona to visit our daughter who is studying abroad there, we opted to stay at the five-star Hotel Claris. While I'm not sure it deserves its five-star rating, we were pleased with many things the hotel offered. First and foremost, the Claris is located in one of Barcelona's most elegant neighborhoods––L'Eixample. It's a stone's throw from Paseo de Gracia, one of Western Europe's most beautiful boulevards. Within walking distance from the hotel, we were able to tour La Pedrera, Casa Batllo, Placa de Catalunya, Las Ramblas, and Gaudi's unfinished masterpiece, Sagrada Familia. A little further away, but still within walking distance, was the Bari Gotic quarter. There are numerous cafés and restaurants within walking distance of the Claris. At 25 euros per person, there's no need to take breakfast at the hotel as there are excellent, moderatey priced cafés right around the corner. Plus, it's infinitely more fun to frequent places where the locals go. Also within walking distance is Dow Jones, an American-style sports bar, where we were able to catch the Patriots and Giants playoff games. The hotel combines an Old World European facade with modern amenities. Glass elevators overlooking the hotel's interior whisk you to your room, all furnished with antique kilim rugs and Brazilian cherry floors. My husband and I happen to like modern furnishings, so we were very pleased with the décor. The hotel's staff was uneven at best. Some people, especially bell staff and doormen, were extremely helpful and attentive, but some front desk personnel were rude and impatient. There were very few English speaking television channels, and by the end of the week we started to grow tired of the steady dose of CNN and Sky News. Our in-room movies, something you expect at a five-star, were not working and the front desk was unable to fix it.. It was January and the hotel was not busy, so the staff accommodated us by giving us access to the room next door. There's a small collection of museum-quality Egyptian antiquity on display on the second floor, which is definitely worth a look. There's also a rooftop bar/restaurant and pool, but since we were there in January those facilities were not operational. On the flip side, January was a perfect time to visit Barcelona. The weather was ideal for long walks and you didn't have to fight the crowds anywhere in the city.", "Date": "January 31, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Washington, DC", "Title": "“Not bad, perhaps not 5-star”", "Author": "DCTravelman", "ReviewID": "UR12617973", "Content": "This is certainly an above-average hotel. It is quite nice, in fact. I'm not quite sure it is 5-star, though.", "Date": "January 14, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "England", "Title": "“Really disappointing, don't waste your money”", "Author": "WhiteHouseEngland", "ReviewID": "UR12567007", "Content": "I am a regular business visitor to Barcelona, but on this occasion my wife came with me and so I booked us into supposedly the best hotel in town, the 5-star Claris. The internet booking I made promised all sorts of luxuries (e.g. antique furniture) which never materialized. The service promises things that also did not materialize (e.g. Leave this tag on your door and we shall deliver wake-up coffee). The room was very badly designed, e.g. nowhere within reach of the bed to out anything. Complained at the time and got nowhere. Filled in a form to the manager, but have just got blocking replies from the secretary. There are plenty of decent hotels in Barcelona, so I won't waste my money here again.", "Date": "January 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Great location but overpriced and overrated”", "Author": "DublinItchyfeet", "ReviewID": "UR12208873", "Content": "Great location for accessing central Barcelona, friendly staff and lovely decor. Very impressive exterior in particular. But doesnt merit five star rating - the facilities/amenities and services provided are just not good enough for such a high rating. Has services of a good 3 star with 4/5 star decor. Bad points: - small rooms that are very noisy because of traffic (double glazing just not good enough) - very overpriced - no basic amenities in rooms such as iron, drinking water etc. Having stayed in other hotels of the \"small luxury hotel\" (slh) brand, this one should definitely not be included. It just doesnt compare when it comes to services and facilities.", "Date": "January 1, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "New York, NY", "Title": "“Claris clearly NOT condusive to comfort or work!”", "Author": "ntravinsky", "ReviewID": "UR10962843", "Content": "My husband and I stayed at 2 hotels while we were in Barcelona, the Claris Hotel and the Majestic Hotel. The reason why we ended up at 2 is because we initially booked our reservation at the Claris, and after 1 night we swtiched hotels. I was mildly unsatisfied, my husband as the business traveler was MAJORLY unsatisfied. The lobby was nice and modern in design. We arrived at the hotel at around 9:30pm and there were 2 gentlemen to greet us. They were busy behind the desk and weren't extremely welcoming or attentive. However, they did manage the check-in and a very nice bellhop showed us to our junior suite. The junior suite was located on the first floor directly off of the elevator. When we entered the room the decor was very dark and reminded me of something you might expect in a lodge in the southwestern part of the US (Arizona or New Mexico maybe). There were hardwood floors (dark reddish brown tones) with rugs on them. Everything in the room was very low to the ground. The bed, the television, the couch. There was a small table with chairs next to the entryway and then upon entering the room there was a couch on one wall with the bed facing it. A flat screen tv was facing the bed and was mounted so that it stood about 1 foot off of the floor. which meant that if you were sleeping in the bed, you would not be able to really see it unless you were propped up. There wasn't a desk area in the room unless you wanted to work on that small table by the door.... I proceeded to unpack while my husband attempted to do some work on his laptop. He was literally logging into the laptop every 15 minutes because the internet connection wasn't working. After 2 hours he called the front desk and they sent the bellhop to our room to try and assist with the wireless connection. A failed effort as the bellhop knew nothing about wireless connections. Finally, at around midnight--my husband had to go to the lobby and work from the lobby for about 2 hours (to access the internet connection). I couldn't get the air conditioner to turn off all night so we were freezing in our bed. My last complaint-the sheets were not soft! I was surprised and unsure if this was a Spanish thing. Fortunately, when we arrived at the Hotel Majestic I realized soft sheets can be found in Barcelona!", "Date": "November 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fairfax, Virginia", "Title": "“Very pleasant saty at the lovely Claris”", "Author": "memjfm1", "ReviewID": "UR10868656", "Content": "A seven night stay at the Hotel Claris for our fortieth wedding anniversary! Conveniently located for the first time Barcelona tourist, the hotel is a compact jewel in many ways. Lovely lobby with dramatic hallways, glass interior elevators ascending through a pleasing water garden, and an attentive staff made the stay most enjoyable. But, as with all good things, there was a wrinkle or two. With a street side room, there was consistent late night traffic noise. The maid opened the windows for the first 2 or 3 days and required a desk person to come up and re-secure them with the special key. And the attractive bathroom sink took forever to drain. I advised the desk of this to no avail. Because of the ultra convenient location, we’d probably stay at the Claris again although there are super alternatives in the immediate area.", "Date": "November 17, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manalapan, New Jersey", "Title": "“Great Location, Decent Service”", "Author": "sm122097", "ReviewID": "UR10086509", "Content": "Barcelona was our second city in our Spanish trip and the Claris was our second favorite hotel. We arrived around 11:00 and while they had some rooms ready, we were being upgraded and ours was not yet ready, so we made our way off for lunch and the bus tour. When we came back, not only did we have our room, but they had moved our luggage into the room. And let me tell you, the room was worth the wait. We had a 2 floor duplex. The first floor had the main bathroom (separate shower and bath) as well as a Sauna (looked a little small, but what can you expect for a private sauna). It also had the living room/dining room with comfortable couch and chairs and big screen flat tv/ Upstairs had the bed and another full bath (no sauna). Another great feature was the tv, which seemed to have movies you could rent, and, most importnatly, 5 english speaking channels (CNN Int'l, CNBC Europe, BBC World, Sky News and Disney). There was nice art in the room, and we were left a rose. They also gave us a bottle of red wine. On the negative side, the room was not up to the level of cleanliness I like. The sink in one of the bathrooms was not clean and the floor was dirty/dusty. I normally do not wear the hotel slippers (my feet are too big). But fortunately, their slippers were a little bigger since I needed them. Service was also a little spotty. While everyone was helpful (including the door man who remembered that my wife and I wanted a non-smoking restuarant and asking how dinner was), there was one mess up that bothered me. We had the hotel make reservations in advance. They made excellent suggestions and we loved 3 of the 4 restaurants. However, we had a bad experience the night before in Madrid where we went to a smoking resturant. Therefore, when we picked up our reservations, we asked if they were all for non-smoking restaurants. We were told that they were. However, the first one was smoking only. We left and went back to the hotel. They found us a non-smoking restaurant nearby, but not us fancy or nice. They followed up with phone calls to ensure that the rest of the restaurants were non-soking (they were). Breakfast was a buffet. Very nice selection of breads and an excellent choice of fruits. You could also order food (such as eggs, pnackages, breakfast meats, etc), but they do not tell you that. Last, we enjoyed the car they provided to take us to the airport (included in a stay of 3 nights or more). However, agan ask for non-smoking since at least one car reaks of cigarettes. The location was great. A very short walk to a couple of Gaudi houses/museums. We were also very close to the Metro and only about a 10 minute walk to the Gothic Section.", "Date": "October 16, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Excellent service - would definitely return”", "Author": "dmatsushita", "ReviewID": "UR10083972", "Content": "We stayed at the Claris in September 2007. I've written a couple of other reviews about places we didn't think were perfect, but we were really very pleased with the Claris. The location is excellent - just off Passeig de Gracia, one block from La Pedrera and a short walk from Las Ramblas and Barri Gotic. We experienced excellent service throughout our stay. We had booked a 2-br suite for our family of four, as well as an adjacent room for my in-laws. When we arrived in the late morning, only one of the suite rooms was available, but the hotel immediately arranged for the other two rooms to be prepared for us. Within ten minutes, we had access to all three rooms. Despite the short wait, the hotel still gave us vouchers for free drinks. The remainder of our experience was similarly classy in gracious hospitality. The buffet breakfast was varied, fresh, and tasty. Dinner at the terrace restaurant was delicious. The wait staff was friendly and attentive. Our 2-br suite consisted of two junior suites whose living rooms were connected by opening the wall between them, making a comfortable larger common area. The bathrooms weren't huge but they were certainly ample, and the bathtub was an unusual somewhat triangular shape, which was interesting and kind of fun for the kids. We would definitely stay here again; in fact, we would plan a trip back to Barcelona in part because our experience here was so pleasant.", "Date": "October 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Rueil-Malmaison, France", "Title": "“Claris hotel”", "Author": "giannia", "ReviewID": "UR10022651", "Content": "The hotel is not too bad. Very good location near the city center. However I don't agree about the 5 stars Luxe. The hotel is clean and the swimming pool is great but the rooms are not so large and also are not soudproof. There is a main road just close the hotel... The bathroom is very small and some details have to be reviewed. To me it should be a good 3 stars. That means it should be cheaper than 200€ night.", "Date": "September 30, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "NEW YORK CITY", "Title": "“Loved the Claris”", "Author": "LOVESVACATIONING", "ReviewID": "UR8716780", "Content": "What a beautiful, luxurious hotel !!! We had a pefect stay. The staff was wonderful, especially the concierge. The rooms were great !!! A great find !!!", "Date": "September 14, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "minneapolid", "Title": "“Beautiful Building but Customer Care Missing”", "Author": "princesjudy", "ReviewID": "UR8567739", "Content": "I had high expectation of this 5 star rated hotel but it left us feeling ..no soul. The owner evidentally is into Egyptian Art but what he needs for his customers are Egyptian linens...the worst bed linens I have ever experienced in my lifetime. Rough sheets and horrid pillows and course towels...and in a 5 star facility. The rooms was a bit beat up and all in all...great foyer and lovely roof top deck but client quarters...just so-so. I found nothing special about this hotel other than a nice location in the Example...close to Gaudi home and Sagrada Familia. Just a neutral experience at a high dollar hotel...not worth the money but perhaps this is as good as it gets in Spain????", "Date": "August 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fort Worth Texas", "Title": "“Close To To Perfection and Las Ramblas!”", "Author": "GailC2", "ReviewID": "UR8452541", "Content": "Not majestic on the outside but stunning on the inside the Hotel Claris is in a prime Barcelona location. You're within easy walking distance of Las Rambles, and close to public transportation. We found the entire staff to be friendly and accommodating. The breakfast buffet is a veritable feast, and the helpful wait staff will prepare whatever else you might wish. Our room was spacious with enough hanging space and it was an interior one, thus we were not bothered by any street noises. We did find that the safe did not work properly and since it was a Friday, they said they couldn't have a repair man there until Monday so we simply moved our things to the hotel safe. It would have been nice to have had bottled water in the room, and a clock. We're assuming it was an oversight as there was only one bar of soap in the bath which my husband and I tossed back and forth between shower and sink. These are, of course, minor details but things one does expect to find in a five star hotel. I should add that there was a special bath amenity - a zippered tote holding six products - shampoo, conditioner, lotion, bath gel, mouthwash, cologne, and cotton balls. This tote was freshened every day. A nice touch! Plus, our room was cleaned thoroughly and made up promptly each day. A return trip to Barcelona will bring us back to the Claris. - Gail Cooke", "Date": "August 19, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "London", "Title": "“Not 5* Grand Luxe”", "Author": "Jonathan69", "ReviewID": "UR8380218", "Content": "We arrived at the Claris on a Friday evening and were met from the taxi by a bellboy who took our luggage. Inside our check-in was handled swiftly and efficiently and we were given maps of the city and local information without asking. The room we had booked was a duplex, which was on the second floor. It did seem strange however that upon entering you find yourself in the bedroom and then have to go up the stairs to the living area. Most duplexes I’ve had in the past have the bedroom upstairs which tends to make for far better use of this type of space. The next thing you notice is how dark these rooms actually are due to the small window on the lower level while on the upper level there’s no natural light at all. The window overlooks a busy main road and doesn’t open. Traffic noise was evident throughout our stay. While the décor is pleasant the furniture and fabrics are rather on the worn side. The bathroom is very small and rather old fashioned. The shower is extremely powerful but always flooded the floor due to inadequate screening. The bath products were of the cheap un-named variety. Disappointing for a hotel that’s supposed to be 5* Gran Luxe. The worst aspect of this room was the very hard and uncomfortable bed. The mattresses are the sort that cave in the middle slightly from overuse. The bed linen is actually real linen, which is a nice touch, but what good is that with a bad mattress? And why no duvet / comforter? Just a cotton bed cover, which again didn’t help. The air-conditioning vent for the bedroom was situated directly over the bed and even on the lowest setting resulted in wafts of chilled air over one’s head while trying to sleep. Breakfast was served in a lower ground floor room and was a buffet. Plenty of variety and attentive service. The small roof top pool wasn’t anything spectacular and with six people around it seemed rather crowded. The adjoining bar did seem to have good views of the surrounding area and I’m sure would be a great drinking venue at night if busy. All in all a decent hotel with good service. However the very uncomfortable beds let the property down.", "Date": "August 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Connecticut", "Title": "“A wonderful hotel”", "Author": "gfox46", "ReviewID": "UR8363929", "Content": "We traveled to Barcelona in June, and on the recommendation of our travel agent, we booked the Hotel Claris. It was delightful. We were with another couple as well. We arrived early and they upgraded our rooms. We found the dining area on the terrace to be one of the finest dining experiences we had in Barcelona. After a short trip to the south of France, we returned to the Hotel Claris prior to our departure to the States. The location of the hotel is superb, the staff was superb, and the dining was superb. We all look forward to returning.", "Date": "August 6, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Helen's Bay, N Ireland", "Title": "“Confident, Stylish, Self Assured Hotel”", "Author": "saparker", "ReviewID": "UR8254091", "Content": "We recently returned from a 4 day stay in the Hotel Claris and felt inspired to share the experience. This hotel is worth booking for any stay in the city. The location is excellent, and within walking distance of the Passeig de Gracia and Eixample, with its many elegant shops and restaurants. The hotel interior is an eclectic mix of historical artifacts and contemporary furnishings, rather than the usual generic modern design template. The service and attention to detail exhibited by the staff was just the right balance without being intrusive. This is a stylish, confident and self assured hotel. Indeed the staff almost sensed our requirements and attended to any matters before they arose. The roof top pool, whilst compact, afforded an escape from the days heat and included a small number of loungers for sunbathing. The roof top terrace and bar came to life in the evenings, and included live smooth latin jazz. to help us chill! This was our third visit to the city in 4 years and the most satisifying stay to date, due largely to the hotel and the quality of the staff.", "Date": "July 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Luis Obispo, California", "Title": "“IGood choice”", "Author": "sgbslo", "ReviewID": "UR7631016", "Content": "We recently stayed at the Claris for 2 nights prior to a cruise. We booked it because the friends we were travelling with had already booked a room there and I was a bit skepitcal after reading the mixed reviews on TA. But we really liked the hotel. The public spaces are very nice, the staff is quite helpful and our room was very pleasant. Our room was on the backside of the hotel so we had no noise problem and it was spacious and well appointed. The bathroom was large and nice. They offer a free mini-bottle of wine as a welcome gift which is a nice touch. The concierge suggested a restaurant on the night of our arrival which was very good and made a reservation for us the next night at a restaurant I had selected. The location is wonderful for upscale shopping and visiting the some of the Gaudi sights.", "Date": "May 16, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, England", "Title": "“Fantastic!”", "Author": "Long-haul-traveller", "ReviewID": "UR7494472", "Content": "My husband and I booked a last minute city break and decided to go to The Hotel Claris. Check in was very efficient and our room was on two levels with the bedroom downstairs and sofa and an additional TV upstairs, the room was beautifully decorated with very modern art work. That evening a bottle of wine and a pack of specialised bath products were brought to our room to welcome us. Unfortunately we had a very noisy room of people above us who kept us awake from 6am. We rang down to reception who said they would investigate and apologised. My husband then went to reception and they were most sympathetic and said we shouldn't have waited two hours before complaining! We were then moved to a junior suite which was very nice (bigger bathroom etc.) but was only on one level. We slept extremely well the second night. The Hotel is in an excellent location just off the main shopping street and a 10 minute walk from Las Ramblas. It is also well placed for the open top tourist bus. The staff were very pleasant and helpful and the hotel is beautifully furnished. We also spent a few hours at the open air swimming pool which is situated on the roof and was lovely in the sunshine. A most enjoyable stay.", "Date": "May 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York, NY", "Title": "“We really enjoyed Hotel Claris”", "Author": "Mary383", "ReviewID": "UR7342718", "Content": "We recently stayed there for a week, right before Easter, and found the hotel delightful. We booked a standard with two twin beds. Aside from the room being a bit stuffy temperature-wise (couldn't open the window), it was overall pleasant and modern. Nice linens, bathrobe and slippers, turn down service - everything you would expect from a fine hotel. The service was excellent and staff gracious. Additionally, it was one block from Passeig de Gracia and a short walk to the Plaza Catalunya, so the location was great. One evening we could hear a dog barking from a nearby room, but honestly, there was very little to complain about. I enjoyed it very much and wouldn't hesitate to stay there again.", "Date": "April 12, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "3", "Rooms": "1", "Location": "2"}, "AuthorLocation": "harrogate uk", "Title": "“awful”", "Author": "mrscritical", "ReviewID": "UR7236794", "Content": "Booked this via last minute.com the morning of arrival. The cost for a five star property appeared very good value for money. As always, a big mistake ! I can only assume they keep this horrid little room for that purpose ! Most probably it makes more money than any other room in the hotel. The room was described as a junior suite which it is not. It has a totally seperate pokey, windowless, tiny sitting room. The bedroom has a view of an 'inner courtyard' ie. airless and quite clausterophobic. Bathroom had large corner bath but was small and very contemporary toiletries; ie no face cloths or anyhting more basic than unbranded soap and cheap shampoo. What a shame I would never dream of recommending the property to anyone. It is not suitable for business as facilities are not five star if one has an important day nor located well for sustainable tourism. The staff have been very pleasant which made a difference. My other big complaint is that I went to make a call last evening and attempted to turn down CNN only to realise it was the volume of the TV from the room next door that I could not alter !!", "Date": "March 28, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "London", "Title": "“Everything was nice apart from my room!”", "Author": "HotelTrasher", "ReviewID": "UR6918294", "Content": "Stayed here for a weekend, hotel was beautiful and in a great location. You can walk literally two blocks one way and you have Casa Battlo, walk two blocks the other way and you have Casa Milo both Gaudi must sees! It is also very close to the Metro and some great restaurants. The staff were very helpful and totally on the ball, if we seemed like we needed help they would come to our assistance before we even had a chance to ask. The only thing I didn't like about the hotel was my room, it was basic and stuffy as the window wouldn't open and one of the lights above the bed wouldn't switch off. Definitely not 5 star quality. It was also very very noisy being on the main road and reminded me of staying in 2 star hotels in Paris on a college trip - you could hear everything going on outside and in the corridors. All in all it is a very chic little hotel and feels luxurious as soon as you step inside. Just make sure you get a decent room.", "Date": "March 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Diego", "Title": "“Great Staff”", "Author": "tker48", "ReviewID": "UR6775640", "Content": "Yes I do agree that it is not a 5 star, but the location and staff are great. The room was very big and clean. I must say that this is one of my favorite hotels ever. Its also very quiet.", "Date": "February 9, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Venice", "Title": "“Not a luxury hotel”", "Author": "PippiVenice", "ReviewID": "UR6611827", "Content": "I stayed at the Claris right before Christmas. We booked a junior suite and the room was big and nice. Hotel is beautiful and warm, staff is friendly and professional. The location is worderful, close to Passeig De Gracia and the main sites of the city. Negative items: HOTEL IS VERY NOISY!!! You can hear people talking in the rooms close to yours, and housekeepers usually scream in the corridors. Heat didn't work and nobody could fix it; after our request the concierge bring us an old portable radiator. Bar is expensive, but in line for a deluxe hotel.", "Date": "January 17, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "kent", "Title": "“not 5 star but....”", "Author": "colant", "ReviewID": "UR6358201", "Content": "My husband and I stayed in the Claris in April this year, to celebrate our wedding anniversary. The hotel is perfectly situated to explore Barcelona on foot, and a two minuite walk to the nearest tourbus stop. Our room was more than adequate for our needs, with a lovely bathroom with excellant shower. A particularly nice touch was complimentary aromatherapy bath oil delivered to our room on the first night. The downside of the room was that the double bed was actually two singles joined together, not particularly romantic! While it was a bonus to have a rooftop pool, the view was rather disappointing. We found all staff to be courtious, helpful and friendly but the hotel lacked that certain something expected from a 5 star rating. Think 4 star when booking and will not be disappointed.", "Date": "December 10, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "New Zealand - Barcelona - Brasil", "Title": "“Be carefull with 5 Stars in Barcelona”", "Author": "There_&_Back_Again", "ReviewID": "UR6164624", "Content": "Got to tell you all, be very carefull with 5 Star Hotels in Barcelona. This Claris Hotel in calle Pau Claris is far way from what a 5 Star supose to be. The envioroment is good but the services and the quality of the rooms.... Our toilet was out of work for 2 days, and nobody could make things work. I could keep on writing here a huge list of things, but I write just to let you all know: \"For some of Barcelona Hotels to see the 5 stars look at the Sky\"", "Date": "November 22, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "California", "Title": "“a gem of a hotel”", "Author": "janetjoel", "ReviewID": "UR6082902", "Content": "My husband and I checked into the Hilton Hotel, a recommendation of a friend, but quickly checked out because of old-fashioned decor and its distance from all of the fun things to do in Barcelona. We got on the internet and reviewed our notes, quickly called the Claris and were lucky to find availability at a very good rate for our 8 day stay. We are experienced travelers and enjoy staying in 4 and 5 star resorts wherever we go. From our first phone call to check-out, we were treated like VIP'S by Ricardo and his staff. We found the Claris to be a charming boutique hotel only a few blocks from the Ramblis. It is convenient to exciting areas, very friendly and quiet. The suites are like little apartments but with no kitchen, and we preferred the floor plan that was all on one floor because it felt more spacious, rather than the floor plan where the sitting area was a loft. We were thrilled with the help and recommendations given to us by Victoria, their Guest Relations Person. We had some of the very best meals we have ever had thanks to her suggestions (we don't like fish or meat...so eating in Spain was a bit of a challenge for us). We HIGHLY recommend the Ming Dynasty for delicious Chinese, Bembi for perfectly seasoned and beautifully presented Indian and the magnificently appointed Thai Gardens. I must add that the breakfasts at the Claris were extremely satisfying and pleasantly served. We also enjoyed \"hanging out\" at the Magestic Hotel (down the street) for its piano bar and roof-top refreshments and view. It is a bit pricey, but it gave us the lounge experience that the Claris was lacking. We look forward to returning to the Claris!", "Date": "November 7, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Midwest", "Title": "“The Claris Hotel, Barcelona”", "Author": "mikie12", "ReviewID": "UR5826392", "Content": "Part of the joy of visiting a lovely city, is a hotel that is convenient to the sights, perfect service, and delightful accommodations. We studied our choice of hotels, and The Claris continued to be a top choice, and our final decision. The Claris is a member of the excellent group of hotels called Small Luxury Hotels located throughout the world. They are expensive, but known for the high quality while staying on the small side with outstanding personal service. The Hotel Claris was built in 1992 keeping the facade of the former Palacio Vedruna. Barcelona has been working very hard to upgrade and improve on its elegant architecture, and although the exterior of this hotel appears very old, the interior is an entirely different story. The Claris is a crossroads experience of the past, present and future. Behind the palatial facade you discover a private pre-Columbian Art collection, and one of the most extensive museums of Egyptian relics in Europe. The modern interior is quite a diversion from what you might expect. Everything is crisp and clean, simple, but elegant in design.....almost mysterious. We arrived in Barcelona by ship, and were at the hotel at 10:00am. It was too early to check in, however, they were more than gracious to put our luggage in a safe place and invite us to have lunch, or just stroll around the city. We returned several hours later and our room was ready. The reception desk was most interesting in appearance with a beautiful burled wood wall. All of a sudden, the person that had been helping us went to check on something and he was gone. The wooden wall was actually secret doors to the back, and with a swift push he disappeared...quick to return, I might add. The staff was most friendly and always willing to be helpful. They arranged a tour for us and best of all gave us a list of the best Spanish brandies and were to buy them. All of the 120 rooms, have been decorated with a mixture of modern contemporary and classic styles. There are over 100 antique kilim rugs, 17th and 18th century English and French furniture, and many sculptures from the 2nd to 7th centuries. All rooms are air-conditioned, several phones, satellite TV, a safe, mini-bar, desk, and sofa. The bathrooms are quite the most beautiful, done in coral marble with fresh flowers attached to the mirror in little tubes. We had the standard room, which was a little on the small side, but still a good value at $175 US including a grand breakfast and taxes. The hotel has three restaurants, one being the Caviar Restaurant, which didn't appeal to us. However, the main one, on the lower level was where breakfast was served as well as dinner. Breakfast was a buffet style with every imaginable pastry, meat, and more than enough to last you for a week. Several nights we ate dinner there also, where they have a fixed price menu including wine. I loved with spinach soup with scampi! The price per person was about $30....not bad at all, and well worth it. There is a restaurant on the roof, however we were there in the Spring and it was not open yet. Yes, we enjoyed this hotel so much, but best of all, it was just one block away from the Paseo de Gracia, the heart of Barcelona. We were able to walk everywhere from this convenient location. So, are you looking for a special place to stay while you are visiting this marvelous city? You need to seriously consider the Claris, it is a good value, and a most interesting hotel!", "Date": "September 22, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Essex UK", "Title": "“More of the same”", "Author": "DeeEmm", "ReviewID": "UR5817237", "Content": "Like previous reviewers, we are mystified by the 5 star accolade. The location is excellent and we too found the staff exceptionally good. Our room, although quiet at the back of the hotel, had a grim view. The decor was well maintained if a bit odd colourwise. The bathroom was OK - good size and well equipped. The bizarre thing was the lack of sound proofing from, not next door, but above. We could hear every move they made and even voices. Somewhere in the refurb process, something has gone amiss. Fortunately this only effected one of our 3 night stay. Breakfast was unimaginative although beautifully presented. I thought the roof terrace was grim - the pool uninviting and it only took a few guests to make the whole area feel packed. High above the city, it was noisy and had no view to speak of. Barcelona is a great place - better than Madrid because of its seaside location. Do use the train to get to the city from the airport, it's cheap and convenient. Once in town, use the open tourist bus to get around - it's excellent value and very frequent, but do look carefully before choosing the Claris.", "Date": "September 19, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cheltenham England", "Title": "“Great rooftop pool!”", "Author": "CheltenhamLady", "ReviewID": "UR5637900", "Content": "This hotel is overated and over priced, however the pool and bar on the roof overlook the hustle and bustle and was very nice. Rooms are small, I stayed in suite and it was just a large hotel room, although the marble bathroom was very nice. I found the staff to be very friendly and the breakfast was great. Great for a 2-3 night stop over.", "Date": "August 21, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“A cool Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3816409", "Content": "The hotel has very nice rooms. The Roof Terrace restaurant was fab and the evening entertainment by the pool was really laid back, fun and chilled out. Generally good service and pleasant staff. A friend told us to check out the hotel online at TabletHotels and we were so surprised to find this fantastic site filled with the most amazing boutique hotels. The site was so easy to navigate through and there was so much information on this hotel and others that we already have our next vacation planned. I would certainly come back here again.", "Date": "August 30, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "New York City, New York", "Title": "“Dark and Noisy”", "Author": "renelle06", "ReviewID": "UR3767340", "Content": "I would agree with all the negative comments and wish I had heeded them. The rooms are very small - even a junior suite is not large enough for three people. Two people cannot pass between the bed and the wall! Noise - yes, you can hear between the walls easily. If someone coughs in the next room, you will hear it in your room. This is especially true in the anteroom of the suites. Staff - more interested in telling us about how to use their card system to save electricity rather than telling us anything about the room, the hotel or the city. Staff - conceirge did nothing but give out wrong information. Told us hours of things that were closed, etc. Said she would book a car rental for us no problem/ then said need to do 2 - 3 weeks in advance. Reviews of water pressure are correct; it is low. If you stay here, be very choosy about what room you accept - we had a room at the bottom of what amounts to an air shaft - so dark that it was depressing. Luckily, the room was so small that we didn't want to stay in it anyway. Maid service - weak - very nice to have a bag with bottles of toiletries, but when half of them are mouthwash and the other half are body milk and you have no shampoo, you start to wonder. Pool is very very small - really just for a jump in and cool off. Views from roof are not great. After we complained, manager tried to make better but this was already 5 days into a 6 day stay so we had given up. Would definitely NOT rec'd if you are looking for 5 star pampering and luxury. Also, would disagree that this is a great location. Seemed out of the way for most everything. Far from beaches, and clubs and not all that close to many of the best shops and the trendiest neighborhoods. If you are familar with NYC, I would compare it to Park and 88th steet. By subway or cab you can get anywhere, but when you go out the door of the hotel there is really nothing. Lobby is pretty, but so what - with the smokers sitting in it, it becomes not usuable. Free internet was helpful.", "Date": "August 15, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Sydney", "Title": "“Fantastic”", "Author": "A TripAdvisor Member", "ReviewID": "UR3689228", "Content": "We stayed at the Claris a few weeks ago and had a very pleasant stay. Staff was friendly and helpful. It is a fantastic hotel with a great location.", "Date": "July 21, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "boston", "Title": "“beautiful decor”", "Author": "skiierboston", "ReviewID": "UR3530047", "Content": "The hotel is beautiful; a small lobby was cozy for our children to relax. Pool a big plus. Location was superb. Staff was friendly. Main complaint was that the hotel has wooden floors and thus we could hear EVERYTHING from rom to room.", "Date": "June 5, 2005"}], "HotelInfo": {"Name": "Claris Hotel", "HotelURL": "/ShowUserReviews-g187497-d190615-Reviews-Claris_Hotel-Barcelona_Catalonia.html", "Price": "$206 - $493*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Pau Claris 150</span>, <span class=\"locality\"><span property=\"v:postal-code\">08009</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "190615", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/2b/e1/a6/hotel-claris-barcelona.jpg"}}