{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“full service hotel with a boutique feeling”", "Author": "tomruko", "ReviewID": "UR128421426", "Content": "reflects a positive feeling from the moment you are in. nothing fancy about the rooms but they are very comfortable and clean. you have served breakfast in a michelin star restaurant, though sometimes orders come a bit late from the kitchen. since you don't have masses of guests around, you can get good attention from the staff. they are quite helpful as well. one negative point was the kitchen smell in the room when we opened the windows. they claimed it was not from their kitchen.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Great location and service”", "Author": "woodstockgalBoston", "ReviewID": "UR128116965", "Content": "Lovely hotel in central area in Berlin with good shopping and restaurants nearby. Well maintained, spacious rooms with good service. Great Thai massage also", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tel Aviv", "Title": "“Good Service”", "Author": "Dikla_10", "ReviewID": "UR127808238", "Content": "Old style hotel, heavy decoration. The rooms are very clean and overall the service is great. The hotel has only about 100 rooms so it doesn't feel busy and it's nice. The location is great for shopping...They have an excellent restaurant.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tel Aviv", "Title": "“Best deal”", "Author": "Haim S", "ReviewID": "UR127725214", "Content": "Very comfortable,superb location,charming service,excellent food", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Luxury hotel”", "Author": "HScuba", "ReviewID": "UR126756106", "Content": "Luxury hotel with old-fashioned (traditional) look, spacious rooms and comfortable beds, excellent service, superb restaurant, convenient location at \"Gendarmenmarkt\", close to shopping and subway. Spa/sauna facilities rather small and disappointing.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Reigate", "Title": "“A swish traditional hotel”", "Author": "Richard S", "ReviewID": "UR126283014", "Content": "This is a very swish traditional hotel with lovely rooms and excellent discrete service. The breakfast is brought to your table rather than left as a buffet, the drinks are served with olives (and nuts): its interesting how much these little things count. Certainly recommended if you cna find a deal which makes it affordable.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Egypt", "Title": "“a gift in your room”", "Author": "MIRAHEgypt", "ReviewID": "UR125905492", "Content": "very efficient, high qualified staff , starting from the concierge, receptionists, chefs, room service , everything is judt perfect . I would like also to mention that during the ITB , the days are long , hectic, what will u feel when u go to ur room then find a small gift to make u relax, & ur stay enjoyable ? of course u'll feel blessed by being aguest in Regent Berlin . Thank you for everything, thank you for making my stay an excllent stay . everything ... but when u walk a little bit around u'll find a treasure in each corner !", "Date": "March 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“\"Old World\" Class and Style!”", "Author": "Idenburger", "ReviewID": "UR125686962", "Content": "Having stayed at the Regent many time I now write my first review of this hotel to share the qualities of this must stay hotel. Service starts at the curb with a very efficient team, including a voiturier. The reception desk team is excellent and upselling a charming experience. Rooms are what we always dream of, well put together with only your comfort in mind. Little ledges in the bathroom, cosmetic mirror in the room and in the bathroom, a great bed and luxurious furniture. Room service breakfast is beyond excellent, try the Weiss Wurst with sweet mustard. No pool though, that's a little disappointing, the only disappointment.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vienna, Austria", "Title": "“We love coming back to Berlin”", "Author": "lucasstein", "ReviewID": "UR125381319", "Content": "I travel for business at Berlin and I always stay because of the location at the Regent Berlin hotel and I always add a couple of days (weekend) for pleasure. I love the location; charlotenstrasse is very quiet and central the same time. There are many restaurants around where they stay up very late and we find it absolutely safe as we enjoy several late walks. The rooms are very spacious and the bathroom very convenient as there is plenty of space and separate shower as well. The bed is heavenly, there is a good internet service everywhere in the room, and the TV has an interesting selection of channels and the quality of their towels and bath amenities is excellent . The breakfast is very delicious , I love their cheese – ham selections, and their dinner is very romantic and stylish. Housekeeping does an excellent job and they make sure we have everything we need every day as they come several times. The proposals of the concierge are always right as they recommend the newest and coolest places; they know us by now and they recommend the ones we like. We are happy finding the same people at the concierge every time we come back All in all we have a pleasant stay every time and we enjoy coming back to Berlin", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“First rate in Berlin”", "Author": "southernguy11", "ReviewID": "UR125371175", "Content": "Stayed three days at the Regent last week. Staff and facilities were top drawer. Accomodations as good as they get. Our room was large and the bathroom fantastic. I would go back tomorrow.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Quiet elegance, understated charm”", "Author": "Glengarry3007", "ReviewID": "UR125332796", "Content": "As a regular visitor to Berlin over many years, I've staying in many of the city's hotels. None though are as quietly classy and well-served as The Regent. Hotels such as these typically come with an attitude - doorman who seem to think they're on face-control duty, snooty concierges and sniffy check-in staff. Not this one. The rooms are large, clean and well maintained, the prices are not excessive and the food, especially the breakfast, is excellent in the restaurant downstairs (Fischers Fritz). Service in the lounge area is slow - it seems they don't have anyone permanently assigned to this area and we had to wait 15 mins for a waiter to enter to get the bill. Having said that, that was the only complaint in an otherwise relaxing and enjoyable stay. Highly recommended.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Central NJ", "Title": "“Fabulous hotel”", "Author": "ReadHereNow", "ReviewID": "UR123808046", "Content": "Everything was absolutely superb in every way, start to finish. Got an excellent deal through AmEx Platinum.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Convencience”", "Author": "Janet O", "ReviewID": "UR123153259", "Content": "Great hotel, excellent central location, but quiet, big comfortable rooms, attention to details. Very friendly and helpful staff from reception to concierge to housekeeping and doormen", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Grand and beautiful majestic Hotel”", "Author": "Moveround", "ReviewID": "UR123128526", "Content": "My husband and I stayed at the Regent Berlin for 3 nights in July 2011. Reception was fantastic and they escorted us to our beautifully decorated room. This room was so large and had every ammenity and more that one could imagine. The marble bathroom was grand and there was a separate room for the toilet. The bed was luxurious and the view was across the nearby park with a beautiful church. Breakfast was out of this world. Silver service and the attention was first class. The array of cereals and accompaniements was vast and nothing was lacking. Afternoon tea was served in the lounge and was great. We did not dine in the restaurant as it was rather expensive and also as we have some concerns with allergies. The restaurant is one of the top restaurant in Berlin. Conceirge was great and most helpful. Berlin is a wonderful historic city and when you go there we would definitely recommend The Regent.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Lovely, comfortable hotel”", "Author": "hoh_11", "ReviewID": "UR122963080", "Content": "Great location for walking. Helpful, accommodating staff. Pleasant in all ways. We thought the value for our December-priced room was excellent.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "usa", "Title": "“Very good, convenient location”", "Author": "gsrs", "ReviewID": "UR122404586", "Content": "Our room, while not large, was completely adequate. The service at the hotel was almost perfect. We visited during the holiday week and sometimes felt that the concierge on duty was not as knowledgeable as we had hoped. The failing was most noticeable when we requested information re money savings schemes- such as public transport and airport VAT refunds. Also on some occasions when it was raining, we needed to ask for umbrellas; at other times, they were offered immediately. Other reviewers have commented on the wonderful breakfast. While it is certainly acceptable, we have had a much more diverse and interesting buffet at other five star hotels and hence were disappointed. The hot offerings from the kitchen were very good", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "boston", "Title": "“Just Wonderful...”", "Author": "2travelersboston", "ReviewID": "UR121944646", "Content": "We tend to like small, intimate hotels or inns and this was a big \"real\" hotel. But it was a great experience. This was a fantastic hotel in lovely old world style without feeling stuffy. Our very comfortable, large room with every convenience (and this was a standard one) was a pleasure to come back to after a long December day sightseeing. Particularly loved the walk-in-closet, the beautiful marble bathroom and the daily surprise snack left in our room. The staff could not have been nicer; service felt very personal in spite of the size of the hotel, as did the public rooms of the lobby, broken down into a series of elegant smaller areas. They remembered our name, made sure we had umbrellas and responded to every request. And how not to be charmed by their recommendation on the phone to just take a taxi from the airport as the transportation they provided was more expensive? We didn’t eat there, as it was really quite expensive, but they recommended other good places in the area: we especially liked Refugium in the Gendarmenmarkt Square, a lighter, creative take on German food. Our only quibble was that the hotel lounge didn’t really serve any small appetizer items when we just wanted a snack with our drinks later in the evening; what they did serve was pricey and much too much. But overall, we loved it.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Wraxall, UK", "Title": "“Quality and comfort in best location.”", "Author": "BobandGina", "ReviewID": "UR121629010", "Content": "Almost everything was right here so far as service is concerned. The hotel itself is actually good value, and the restaurant is so, so good (anther review under Fischers Fritz). EUR25 for a buffet continental breakfast is pushing it though. Can't better the location, in the Mitte district. A most comfortable three days.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Grand Junction, Colorado", "Title": "“Luxury hotel in a great location”", "Author": "FourWinds_11", "ReviewID": "UR121396704", "Content": "Spent nearly a week at this terrific hotel, located within walking distance to Unter den Linden Boulevard and the Brandenburg Gate, and numerous decent area restaurants. Excellent, spacious (for Europe), quiet room with great beds, lovely bath and good service. We had a breakfast rate and were able to order hot breakfast items, plus choose numerous other items from the buffet. A lot to eat, but a great way to start our busy days. The hotel is well-located near both U-bahn and S-bahn stops, and there is also bus transportation nearby on Unter den Linden. We were able to purchase transportation passes directly from the concierge. We weren't sure when we'd arrive in Berlin, and hadn't pre-arranged tickets to the Reichstag, which our concierge was able to obtain for us, as well. We weren't aware of the need to arrange in advance, and would have been very disappointed to miss the Reichstag. Concierge, desk staff and doormen were all friendly and helpful with information and directions. We had traveled in Germany for several weeks and were looking for a change from German cuisine. We found the Dressler restaurant (French/Continental) on Unter den Linden, and had such a great dinner that we returned a second time. We rarely do that because we enjoy trying different places. Enjoy amazing Berlin.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Fabulous city centre hotel, an oasis of calm and luxury”", "Author": "HOTELCONNOISSEUR1966", "ReviewID": "UR121380520", "Content": "We really love this hotel. We used to stay here when it was managed by Four Seasons and were a little worried when we heard it was changing hands to Regent. We needn't have worried and indeed the hotel has gone from strength to strength under Regent's leadership and especially under the exceptional management of Herr Athmann and his Team. Don't let the hotel's modern exterior fool you - inside it is beautifully decorated with the finest marble, and exquisite furnishings, and beautiful flower displays. It has a feel of a very grand private house, and never feels overly busy. The staff throughout is excellent and they get the balancer right between professionalism and friendliness. The bedrooms are without doubt amongst the very best in Berlin - even the standard rooms are 40 sqm and all are furnished in a tasteful, classic style with excellent bathrooms. The hotel boasts a number of suites from Executive through to the fabulous Presidential Suite on the 8th floor overlooking Gendarmenmarkt. We really like the deluxe suites which are on the corner below the Presidential and Gendarmen Suites, but some of the Superior Suites such as 825 and 625 are really lovely and spacious. Housekeeping is of the very highest, as is Room Service. Another highlight of the hotel is breakfast in Fischer's Fritz which offers an amazing array of hot and cold food all served in the beautiful restaurant. The food in the restaurant for lunch and dinner is amongst the very best we have tasted and Herr Lohse (Executive Chef) more than deserves his two Michelin Stars. Dinner at Fischer's Fritz is an exceptional experience - do not miss out! The hotel's location is great for visiting the beautiful Gendarmen Markt the shops of Friedrichstrasse and of course the Unter den Linden. After a busy day shopping or sightseeing it is lovely to come back to the peace and comfort of the Regent. We have been fortuntate enough to stay at many of the city's top 5 star hotels's including the Adlon, the Ritz-Carlton,The Hotel de Rome but this is without doubt our favourite hotel and what marks it out above other hotels is the staff and the quality of the hotel's management. We highly recommend that you treat yourself to this truly fabulous hotel!", "Date": "December 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NY/Westport/Provence", "Title": "“The Finest 5* Classic Luxury Hotel in Berlin”", "Author": "LeTerrible", "ReviewID": "UR120763078", "Content": "What a gem. What a perfect experience. The Hotel Regent , centrally located near Potsdamer Platz and Unter Der Linden, is the most spectacular hotel I've stayed at in all of Germany. I cannot find one fault and only say kudos for every subject one covers in a review. The Lobby is breathtaking old world charm with immaculate taste in design and warmth. The salon, for tea service and Champagne at night, was so wonderful to end the day by sitting by the beautiful mantel in front of the fire surrounded by classic 19thC formal antiques..and yet...such a feeling of warmth and coziness. The lobby staff is impeccable as is every single person who works in this amazing hotel. Our room, a superior, was a wonderful size with beautiful furnishings mixing classic with an all modern comfort luxurious. The large closets were even amazing made of fine cherry and beautiful wood drawers and hangers. The sitting area is an added plus and fresh fruit and water was put in the room each day and upon arrival. The bed was a dream for sleeping and the calm of the room added more to lulling you to sleep. The bathroom is gigantic with a separate shower and bath. Totally 5* luxe with marble and stone and every upscale, modern appliance you could think of for your dream hotel bathroom. Truly a room for people who want the best. Breakfast in the beautiful 2* Michelin restaurant (we did not dine for dinner as Fish is the reason you dine here..and I do not eat fish) was a delightful way to start the day. Beautiful tables with fresh orchids. Cheerful staff that served the best fresh Orange Juice ever tasted. The Breakfast selections were wonderful each day and the buffet was over-ladden with delicacies. German cheeses, salmon, many different variations of fruit salads and fresh yogurts, amazing artisinal breads, cereals, german traiditonal breakfast pastries, hams and breakfast meats and I could just go on.....the cooked to order dishes were mouth-watering. This breakfast was included in our very reasonable price that we found through Amex Platinum. By the way..the hotel glows. I think they must polish every inch of it twice a day! I can't forget to mention the beautiful spa area and well equipped gym. Well...need I go on? I travel in Europe (mostly France) 7/8 times a year and it takes a lot to impress me. This hotel did that...and more.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Best Hotel We've stayed in.”", "Author": "MihaelBM", "ReviewID": "UR120706230", "Content": "Absolutely first class in every way. We received a spectacular upgrade", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Wonderful, classy hotel-best breakfast in town!”", "Author": "Snupy11", "ReviewID": "UR120311606", "Content": "This hotel is gorgeous, and the staff know how to treat their guests. Very helpful with advice and directions. Quiet street at night and close to everything, beautiful bathroom with robes and slippers, comfortable beds, thoughtful touches. The breakfast is amazing-the fresh fruit is delicious, as is the French toast, selection of meats and cheeses, and fresh-squeezed orange juice (although don't order it at the bar at 9 Euros per glass!). Highly recommended.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“A Quiet Palace in the Center of the Chaos”", "Author": "ittessot", "ReviewID": "UR120200123", "Content": "I cannot say enough amazing things about this Hotel. We usually stay Ritz Carlton if a city has one, but the rate here was much less for our time in Berlin back in September, so we gave it a go. The location is perfect, you’re in the center of it all. The pope was visiting during our stay and the Berlin Marathon was taking place our last day, so location was everything. Upon walking in the immaculate lobby, we were instantly greeted and guided to reception. To my surprise, we were upgraded to a junior suite for the entire stay, and I just about fainted. The room had a huge bedroom with TV and lounge chair, living room with seating for six, a desk and a Bose music system and TV. The room also featured a nice bar area and massive all marble bathroom. Not only did the public areas feature fresh flowers, but also our room had a live orchid and fresh roses in the bathroom every day. We never ate at the hotel’s restaurant, but we spent two nights at the bar. That’s how you spend late night in Berlin. Both nights it was the two of us, another couple, a three-piece band and two bar chefs. That’s an impressive staff to guest ratio. Their drinks, while very expensive, were top notch. It was a real treat to sit and watch the bar chef Roland mix our sazeracs each time, all while the jazz singer Carol sang in perfect English and greeted guests in their native language. I will always book this hotel while in Berlin. This is one of the best hotels in the world.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“The Glowing Reviews are Correct”", "Author": "Geewiz1948", "ReviewID": "UR119696563", "Content": "This is an outstanding hotel. Beautifully fitted out in classic style and with the the most helpful and professional staff we have encountered anywhere. Reasonably priced for a hotel of the highest quality and ideallly located for a visit to Berlin. We have stayed elsewhere in Berlin but would strongly recommend this hotel. Not so convinced about their Michelin star restaurant - pretentious and overpriced but there are plenty of good German style places just down the street.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“A great place to stay in Berlin”", "Author": "Bmjr", "ReviewID": "UR119689402", "Content": "We just returned from a 4 night stay at the Regent Hotel in Berlin. The rooms, concierge service, friendliness of the staff, and overall value could not be beat. The breakfast (included in the room rate) was excellent as was the service in the restaurant. The personal attention paid to our party made our stay special. Having just left comparable hotels in Vienna and Prague, the Regent Hotel was not only a better value but provided better service and an overall superior experience.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Simply Excellent !!!!!”", "Author": "Varito", "ReviewID": "UR119581836", "Content": "I was on business in Berlin last week for a night, and stayed at The Regent. In fact the hotel was choosed by my assistant, and I had no chance to even take a look to their web-site or to the reports at TripAdvisor. All-in-all I was very positively surprised. It´s a great hotel, the rooms are big, spacious, comfortable, clean, with enough space for your bags, a great working desk with different plug-ins (UK norm / US norm / German norm), what is great because you don´t need to ask for an adaptor if you need to work on your notebook or charge your mobile, etc. I used several services of the hotel like the laundry (ironing), valet parking, room service, and everything was excellent, on time, and with high quality standards. Some services are not cheap (i.e breakfast), but also not more expensive like other same-level hotels. Location is also excellent. I was on business, but my wife joined me and specially told that the hotel is located very close to great stores and key attractions in Berlin. The only negative thing I found are the lights inside the room. I know that the trend is to have low-consumption lamps, and it takes a while until they are really efficient, but there are some key places on the room, like the desk (if you must work), or the couch (if you want to read the newspaper or a book) where you simply need more light. We had a gala dinner in Berlin, I was with my wife, who complained because she said was not able to see really good her make-up and her dress. This is the only aspect which I found needs improvement at the hotel. For the rest, I can fully recommend this hotel.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newton, Massachusetts", "Title": "“The finest hotel”", "Author": "Happytravelor187895", "ReviewID": "UR119539996", "Content": "We only have positive comments about The Regent Berlin. The lobby is gracious and beautifully appointed with rooms for afternoon tea in front of a roaring fireplace, a hotel bar that is dark and atmospheric, spacious and lovely dining rooms. The guest rooms are large and luxurious. The bathroom is also large accommodating two people at the same time with ease. The most important part of the hotel is the staff. Beginning with the reception area, Each and every person is lovely. The Concierge desk is the best we have encountered. When asked a question, we always got a thoughtful answer. All of the service people were terrific and friendly and efficient. The General Manager, Mr. Athmann frequently checks in with guests as to their stay. He is charming and warm and professional. The location of the hotel is easy walking to significant attractions, if you have time. The best we have found.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Tel Aviv", "Title": "“Superb:-)”", "Author": "revit", "ReviewID": "UR119112015", "Content": "We stayed almost a week in the hotel. Everything was great. This is one of the best hotel we ever been in. Great location, a very nice, big room, large bathroom. Breakfast is super!", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mexico", "Title": "“Great Hotel !!!”", "Author": "Elda A", "ReviewID": "UR118881837", "Content": "My husband and I stayed there for 6 nights in April. The hotel is wonderful, the staff very helpful. The location is the best. The only thing I wish they had wireless internet in the rooms...there is at the lobby and bar. The concierge is great, we got very good recommendations. I strongly recommend it!!!", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Paris, France", "Title": "“Quiet,Elegant,Professional”", "Author": "highlander001", "ReviewID": "UR118567706", "Content": "Last week was my 4th stay at the Regent in Berlin. Plenty of time to check if first impressions were right. They were! The hotel is understated/quiet at the entrance , with a small elegant lobby. The greeting at the curb , through to check-in, is professional and efficient. However , on return visits the front-desk & concierge recognise you. Small touch , but those things count! Rooms are very tastefully designed. Everything works of course. Breakfast is extensive in choice and the restaurant quiet. Service is excellent as .Lobby lounge for coffee or tea is again a haven : peaceful with unobtrusive service. Bar is full of leather chairs , and is again quiet . A bit like being in an exclusive club. Final point : It is great to see the General Manager walking the lobby. Very visible & approachable. You feel that he takes your comfort personally. This is a great hotel. Conveniently located for commercial area & shops. For my taste ; best I have stayed at in Europe.", "Date": "September 25, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Elegant refinement”", "Author": "gallerygirl09", "ReviewID": "UR118016792", "Content": "We just returned from visiting Berlin and must simply rave about The Regent. Our European trip included other cities and to be honest Berlin wasn't the city that I had great anticipation about so this gem of a hotel helped to set the tone for our visit to Germany's capital city. It was trip advisor that first made me take notice of the hotel. I originally booked with the Cosmo Mitte but I had reservations about the hotels location. A few weeks prior I got cold feet and went back to the trip advisor review by an american woman from NYC who raved about The Regent and as I read her review I saw her reference to WHATAHOTEL.COM and their signature travel perks. I got in touch with Maria who was able to assist me making the reservations. The room was extremely comfortable with luxurious pillows and bedding. Our sleep was sound as the hotel was the only hotel that we stayed in that you couldn't hear anything room neighboring rooms. The breakfast was superb. We loved the waitstaff. They were so professional and yet warm. This we did not encounter in any of the other hotels on our vacation. So we appreciated it. The maid even left us a thankyou note after receiving our trip. American's like to tip but it is amazing when you get thanked for it! I will state that Berliners are very appreciative of tips on the whole. Cabs were not that expensive and we very happy with the minimum tip. The check in was seemless as was the check out.It was my first time booking with WHATAHOTEL.COM and I was skeptical but I will use them again. We will definitely return to both Berlin and The Regent. We were shocked to hear how young the hotel is as it feels like a classic place not at all like a luxury chain. The location can not be beat! Easy to hop on a train or to walk to the sites or to the Museums. The Concierge gave us some great recommendations. Very hip again not what we would have expected. Great hotel, I cannot rave enough!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“The height of luxury -beautiful with brilliant staff. Would definitely stay again!”", "Author": "HughJars85", "ReviewID": "UR117040102", "Content": "The regent is situated just a stone's throw away from the Gendenmenmarkt - a lovely square between two beautiful cathedrals. We saw a concert here during the Clasic Open Air festival, and really appreciated the hotel's proximity. It's very close to a big shopping centre, and several museums, and is within walking distance from some sublime restaurants. The hotel itself looks relatively inconspicuos from the outside, however everything inside is lovely, really ornate. Our room was spacious, very nice, very clean, and exceptionally comfortable.\\Our bathroom was lovely also. We stayed in their most 'basic', lowest-price-tier of room - and found the room absolutely lovely, really luxurious. The staff were fantastic, very welcoming and incredibly helpful. I can't praise them enough. Whilst we only stayed one night, we really enjoyed our stay in this beautiful hotel. Even if it is outwith your usual budget-range, it certainly is worth it.", "Date": "August 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Darien, Connecticut", "Title": "“Spacious and comfortable suite, friendly and attentive service, great location.”", "Author": "bjamar", "ReviewID": "UR116726125", "Content": "Wonderful room, comfortable, spacious, homey... Great recommendations for restaurants from both reception and the concierge. Wonderful breakfast, not enough reasonably priced wines on the wine list, very good dinner, but maybe not deserving of two stars from Michelin.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Rio de Janeiro, RJ", "Title": "“5 nights - not consistent service!”", "Author": "jaymedrummond", "ReviewID": "UR116705550", "Content": "I booked The Regent Berlin for 5 nights during a business trip. Location is great either for business or leisure travelers. However hotel has to improve in terms of facilities, such was the lack of wi-fi in the rooms, not acceptable for a german 5 stars hotel in 2011. The room was smelling cigarettes when I checked in and there was no other option in terms of twin beds. In the elevators there is a nice picture of a smiling head concierge. Unfortunately this gentleman does not behave the same way while interacting with guest. The head concierge is cold as an iceberg and doesn't smile while interacting with guests. When I was checking out I was chocked to see a lady working at the reception interacting very badly with an old gentleman who was asking her 2 easy information. The same head concierge was almost shouting at the old gentleman, who was apparently 80 years old and very sweet. They were not busy and could do much better way their job. Anyone would be very mad to watch that scene. I have to recognize that housekeepers are very friendly and were the only one to greet me by my name. Good breakfast but again, some nice, friendly and helpful servers while others can be very cold, like machine industrial workers. Service is not consistent.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Jerusalem, Israel", "Title": "“For me it was perfect”", "Author": "justsharing123", "ReviewID": "UR116360924", "Content": "really good location, very good service from the concierge and a very nice bartender -- Tobias :) breakfast is very good and dinner is even better, I'm sure I'll come back", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "NYC", "Title": "“Excellently Situated Hotel and Helpful Staff”", "Author": "nonfancyfoodperson", "ReviewID": "UR116273734", "Content": "Fantastic location - easy walk to the Brandenburg Tor (where I took various walking tours) and right by the Gendarmenmarkt Square (which is so pretty) and whose sidewalks are filled with cafes. Train station is also very close by to go to various sites. Restaurant is overpriced so I highly recommend just eating outside - there are many good restaurants nearby that cost less.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“The best you can get in Berlin”", "Author": "juiced", "ReviewID": "UR116179665", "Content": "I don't believe it can get much better than this. This \"Grand Dame\" offers excellent service and spacious rooms. On arrival we found nice chocolates, water and fresh fruit in the room. The fruit was replenished every day. Staff was very nice, really did care and arranged everything we asked for immediately. I only missed a pool... The location is just perfect, around the corner of \"Unter den Linden\". Just don't think and go for the Regent. Trust me, it's the best! Booked through AMEX FHR, we received a complimentary room upgrade, free wifi, some food&beverage credit and a complimentary breakfast each morning.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "", "Title": "“Fantastic hotel in the Mitte”", "Author": "Trve", "ReviewID": "UR115986993", "Content": "Spacious and elegant rooms with outstanding staff and service. The buffet breakfast is excellent and the restaurant and bar are outstanding. Free WiFi was a plus and they even have a helpful iPhone app that provides useful sightseeing information.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Tokyo, Japan", "Title": "“Good location”", "Author": "VikingOpolo", "ReviewID": "UR115963923", "Content": "The hotel use a lot of good stone in public areas. Lobby is smart \"old world\", paintings would need an upgrade. Would like the room a bit bigger and also a bit more lush decoration. Miss a kettle and coffee/tea in the room, this has nowadays also become a standard also for 5star properties. Service a bit spotty in the breakfast area.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New York City", "Title": "“Best Service, Charming Accommodations”", "Author": "Carol L. W.", "ReviewID": "UR115500362", "Content": "Located ideally in the Mitte, within walking distance of almost everything including the Gendarmenmarkt (beautiful square with two historic churches and a concert house) lined with colonnaded streets and excellent restaurants and stores, Museum Island, shopping streets like Freidrichstrasse, the famous Unter den Linden and not a bad walk to the Brandenburg Gate and the Tiergarten. Our room was spacious, large, comfortable and with modern bathroom, double exposure windows but quiet. The staff was extremely accommodating, even taking care of getting our Ice train tickets to Hamburg after our stay so we didn't need to deal with lines at the Bahnhof, answering numerous questions about walking itineraries, museum openings etc. with great politesse. I would absolutely recommend this hotel to anyone going to Berlin without hesitation.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Service": "5"}, "AuthorLocation": "Arlington, Massachusetts", "Title": "“Luxurious, Attentive Service”", "Author": "Adam M", "ReviewID": "UR115463105", "Content": "Stayed here for two nights in March. The hotel is immaculate, luxurious, with exceptional service. The room was spacious enough with a comfortable bed, plenty of desk space to spread out a computer and work papers, and a generous sized bath. The staff is what really sets the hotel apart- incredibly attentive when you need them. They were always polite whether it was helping with the business center computers or checking me out at a very early hour. The lounge was my favorite part of the hotel- a very cozy area to sit and have a late-night drink and do some reading. While I normally don't go for this ind of luxury hotel, I can recommend it without question.", "Date": "July 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Adelaide", "Title": "“I think that I've gone to heaven in Berlin”", "Author": "hercules77", "ReviewID": "UR115394995", "Content": "This is one of the best hotels I have ever stay in 29 years traveling. That's a big call, especially in a tight hotel market, but this place just takes the accolades. Staff were just fabulous, breakfast was fit for royalty nd the rooms were delightful.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Best hotel by far”", "Author": "GeorgiaJandL", "ReviewID": "UR115369023", "Content": "we stayed for four days of vacation in Berlin. Facility clean and upscale. Rooms more than ample. Staff friendly and courteous. Dinner on patio was wonderful. Great breakfasts. Concierge Lars and Philippe both knowledgable and friendly. Location was in the middle of the attractions we wished to see. We visited four cities during our trip, and the Regent was by far the best hotel. Would return in a minute!", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York, NY", "Title": "“My Favorite!!!”", "Author": "Lizzie1955", "ReviewID": "UR114679271", "Content": "I travel a lot, usually staying at 5 star hotels and am very picky. The Regent Berlin is my favorite worldwide. The rooms are large and elegant but also cozy and comfortable. The service is seamless, warm, friendly and non-obtrusive.The Regent knows what I need before I do and takes care of it quietly and without fuss-- a true gift. I booked via WhatAHotel.com and got not only a fabulous rate but exclusive perks including: a full breakfast, a food and Beverage Credit of 50 euros, a welcome gift, and an upgrade at the time of reservation to a stunning deluxe room on a high floor with a balconey. Early check-in and late check-out were both offered. When I arrived, I found a plate of hand rolled chocolates, fruit and a bottle of sparkling water waiting for me. The water and fruit were replenished daily. I had both high speed internet and wifi in my room. Both were complimentary and worked easily and well.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Wonderful location and very comfortable”", "Author": "poesy", "ReviewID": "UR113337085", "Content": "I stayed here even though it cost a little more than I usually pay, but it was well worth it. The hotel has a beautiful lobby; friendly, helpful staff; and large, attractive, comfortable rooms. The location is fantastic for seeing Museum Island, catching the bus on Unter den Linden, and going to the Konzerte Haus. One of the drawbacks was that presently there is only wi-fi in the lobby, but they say they will have free wi-fi in the rooms in a couple of months. The other real drawback is the ridiculous price of breakfast. E25 for a continental breakfast is absurd. I went elsewhere for breakfast. I did not eat dinner there because it is a fish restaurant and I'm a vegetarian, and it is also very expensive. But there are many good restaurants nearby. But I don't choose hotels for their food. The room was so large and bright and the bathroom beautifully appointed. A pleasure to be there. Eat at Holyfields a long block away on Unter den Linden.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Palma de Mallorca, Spain", "Title": "“The Regent far surpassed our expecations....a perfect stay!”", "Author": "puiggirl", "ReviewID": "UR102959429", "Content": "I rely on trip advisor often and thought I´d give back after an exceptional stay at The Regent Hotel in Berlin. We are Americans living in Spain and for over six months I agonized over where to take my mother for her 70th birthday. She is very well travelled and has stayed in her share of luxury hotels around the world so my choice had to be a special one. Once I narrowed our destination down to Berlin I relied on Trip Advisor reviews to help me decide where to stay. I wanted a hotel with old world glamour but with all the modern, five-star amenities. Schlosshotel Im Grunewald caught my eye but I mapped it and saw that it was a 15 minute drive out of the city center. The Ritz Carlton was a contender based on general reputation but I´d read that The Ritz in Berlin was quite flashy, sort of Dubai style with lots of white, black and gold...not our style. The two obvious choices for our taste were the Hotel Adlon Kempinski and The Regent Berlin. Both seemed very popular in the reviews and I had a very hard time deciding but thankfully opted for The Regent. In a nutshell.....don´t judge a book by its cover. At first glance The Regent looks like an office building from the outside. Very nondescript. My heart sort of skipped a beat as the taxi pulled up. But I breathed a huge sigh of relief the second I walked through the door. Attentive doormen, STUNNING flowers in lobby, very friendly staff in reception. So far so good. When we stepped out of the elegant lifts to our floor I knew we had chosen well simply by the immaculate and well-appointed furnishings in the hallways....everything from the wallpaper, carpets, framed botanical prints and furniture was elegant, refined and very pretty. Our superior deluxe rooms were adjoining and were both spacious and well-equiped with everything one would expect from a 5-star. Massive flat screen Sony TV set discreetly into a wooden console dresser, a writing desk, reading chair and ottoman, a bar, generous closet and a large marble bathroom complete with robes, slippers, L´Óccataine products, a powerful hairdryer, toiletries, even beautiful fresh rose. Toilet in its own cubicle, a deep tub and a gorgeous glass shower. I commented that all the stainless fittings looked as though they had been installed that same day. That sort of sums up everything in that hotel, really....gleaming, polished, immaculate, prestine....plus incredible attention to detail (staff remembered our names immediately and our likes and dislikes from the first day). And breakfast was a delight, room service of that standard being one of life´s greatest indulgences. The tearoom and bar were both equally beautiful and inviting.There was an overall hushed feeling, something very peaceful, soothing and luxurious about the place. After a day out it was always a relief to return to such comforting accommodation. Mom and I both agreed that our time there was perfect, if there is such a thing. Our only complaint would have to be that their 2-star Fischers Fritz restaurant offered an extremely limited menu (primarily fish courses with the only alternatives being frogs legs, pigeon or venison). And the prices are astronomical (about 80 euros for a main course). We stumbled across a fabulous alternative at the nearby Hotel de Rome and had such a phenomenal dinner there that we returned again the next night. I could write several paragraphs about it (best dessert of my life- the Blueberry and Basil Cheesecake) but I´ll save that for another review. DON´T MISS IT THOUGH if you stay at The Regent! Oh - we checked out The Adlon for a drink at the bar and walked away feeling relieved that I had picked The Regent. It was larger, noisier and slightly tired-looking, and apparent that a guest would not receive the level of personal attention that we did in a smaller hotel.", "Date": "April 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "nyny", "Title": "“Can't say enough good things....”", "Author": "jls57300", "ReviewID": "UR102450683", "Content": "Service, room, food, location...all perfect. But please fix the weight machine in the gym! Looking forward to returning.", "Date": "April 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Brilliant, luxurious, outstanding restaurant, impeccable service”", "Author": "marg342342", "ReviewID": "UR93813488", "Content": "Lives up to what his expected of a Regent Hotel. Room luxurious with separate bathroom / toilet, excellent bedding, walk in robe, very spacious. Staff very attentive , knowledgeable and friendly. Restaurant has 2 Michelin stars and is an experience not to be missed.Well located and within walking distance of many attractions. When can I move in??? Free wifi in lobby. Would be more convenient in rooms.", "Date": "January 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Perfect for location and the Christmas marketsI”", "Author": "madpatsy", "ReviewID": "UR93392039", "Content": "This is one of the best experiences I have ever had in a hotel. The Michelen stared restaurant was excellent for lunch. The concierge service organised brilliant tickets for the ballet. Most importantly ther location was perfecdt for all the sites that are within walking distance. The hotel even organised an amazing chocolate cake in the room on our arrival for my aunties 70th birthday. It was the nicest cake I have eaten and it was a lovely touch. the staff were brilliant. I didnt like the foyer down stairs and bar as it was a little small and lacked atmosphere but that is a small quibble. UI would highly recommend the hotel and I would return there. If you are planing to stay in Berlin when the Christmas market is open then this is really the place to stay. It is just outrside the hotel and is a magical experience.", "Date": "January 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellent and spacious luxury hotel”", "Author": "Bard_Lucy_Hume_XI", "ReviewID": "UR92474297", "Content": "The Regent is an excellent luxury hotel. Our Deluxe room was very spacious and well appointed. The bathroom is huge, with bath and separate shower cubicle, and the toilet behind its own door. A complimentary bottle of water and a fruit plate are provided each evening. Bed linen is changed daily, and towels twice a day when necessary. High speed internet is provided free of charge, but wireless is not available in guest rooms. A short cable is provided, but given the lack of Wi-Fi, I would have brought my long cable from home for browsing away from the desk. The desk very conveniently has power sockets for European, US and UK plugs. Breakfast in the restaurant is served a la carte. The choice is wide, including German / Continental, eggs, bacon, sausage, waffles and pancakes. A choice from all that is available costs 35 euros, however most breakfasts of a couple of courses can be ordered less expensively as individual items from room service, which is served excellently. The location diagonally opposite Gendarmenmarkt afforded pleasant views from our balcony, and a convenient central location amongst Berlin’s many historical sites. The streets were largely free from traffic at the weekend, and even on Monday morning the small amount of traffic was completely inaudible from our room. There are many restaurants in the area, although we chose to eat further afield in less corporate surroundings. Late in the evening when the concierge was not available, the receptionists were rather uninspiring with restaurant recommendations, but the concierge desk was very helpful with choosing restaurants to our preferences and also has useful advice for sightseers. I would certainly recommend the Regent Berlin as an excellent, well located luxury hotel whether for business or pleasure.", "Date": "January 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Warsaw, Poland", "Title": "“Superior stay”", "Author": "aniaandrzej", "ReviewID": "UR92181372", "Content": "We have stayed in this hotel for one night, just to try the culinary arts of Fischers Fritz's chef, Christian Lohse. (The restaurant was awarded two Michelin's stars for three consecutive years - we recommend you share our experience.) Our room was spacious with a beautiful, large bathroom. The service was - as Bart Simpson would say - the bestest. The hotel's stuff was very kind and helpful in any situation we had found ourself in; from not being able to connect with the Internet (after midnight) to losing GPS before departure. They were alert, responsive, kind and professional - that is the class. My wife did not want to leave, neither did I.", "Date": "January 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Midlands", "Title": "“Fantastic Hotel,,, Excellent Location...”", "Author": "Ric9903", "ReviewID": "UR87563818", "Content": "My husband booked this superb hotel as a surprise for my birthday just for the two of us, it was the first time I had ever left my 2 children with nanny & grandad so i was a little apprehensive about going but i could not fault this hotel in any way its just brilliant. The service starts from the minute the taxi pulls up and nothing is to much trouble. The rooms are big and spacious and spotless, the restaurant is excellent, the bar area is great,, This hotel in my opinion is a must when visiting Berlin, we will definately go back as we loved it.", "Date": "November 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“Great location, terrific restaurant”", "Author": "Hawet", "ReviewID": "UR85027204", "Content": "The Regent enjoys a great location: right on lovely Gendarmenmarkt, a short distance from famous Unter den Linden, an easy walk to the Brandenburger Tor, and only a few steps from shopping street Friedrichstrasse (Lafayette!). The public areas in the hotel are lovely, and we had a large room with all amenities. Service is immaculate, as might be expected from a 5-star hotel. (But we were just a bit disappointed when we returned to the hotel one afternoon at 2.15, to find that our room had not yet be done.) There are many restaurants in the immediate neighborhood of the hotel, but I recommend that guests should at least once have lunch or dinner in the hotel's restaurant Fischer's Fritz. The two Michelin Stars are really appropriate. We were very impressed by the food and the service. When we returned for dinner two days after our first visit to the restaurant, the staff even remembered our preferences!", "Date": "October 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nicosia, Cyprus", "Title": "“Excellent”", "Author": "igtravel", "ReviewID": "UR84863065", "Content": "Excellent service, location, facilities, room. Added benefit of not being in a standardised hotel but one with a much more pleasant and individual character and approach Twice a day cleaning - Exceptional breakfast for a European Capital Free internet - Free business center - Free newspapers", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Reno, NV", "Title": "“Huge room, huge and fabulous bath”", "Author": "peglow", "ReviewID": "UR74794383", "Content": "Loved our stay at the Berlin Regent. Our room was enormous-- not sure if we were upgraded or if this was a standard double. The bathroom was bigger than most hotel rooms I've had in Europe. A bit pricey but totally worth it. Comfy and beautiful furnishings, great service, and wonderful extras (a fresh fruit plate every day, an entire box of chocolates on our last night to thank us for our stay). We had previously stayed at the Regent in Zagreb and had a similar experience. If there's a Regent wherever we go, we're staying there!", "Date": "August 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“SUPER HOTEL”", "Author": "HanaPrague", "ReviewID": "UR71438847", "Content": "This hotel is very nice, with superb location, 10 min from Brandeburger tor, 5 min u bahn station. Rooms are big, comfortable and nice decorated. Beautiful bathroom :) Staff is very helpful. Breakfast is also perfect. I can recommend this hotel.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent hotel, excellent location.”", "Author": "Snob-girl", "ReviewID": "UR69649874", "Content": "Loved everything about this place, great location, very good service. We had a huge room, beautiful bathroom. Worth every penny.", "Date": "July 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "wayne,pa", "Title": "“Five star hotel in a great location”", "Author": "simmie17", "ReviewID": "UR69489271", "Content": "Stayed recently for 4 nights with daughter, My travel agent had booked this and we were upgraded to a very large corner suite (2 rooms) . Upon arrival there was fruit and water for us. Staff was very gracious and the concierge (several gentlemen) were very patient with all my questions and requests. The breakfast(which was included) was generally very good ( cereals, fruits, breads choice of egg dishes, cheese and meat course), though our waiter the last 2 days was not as proficient as the waitress we originally had. I loved the outdoor summer lounge- great service and drinks. The room was immaculate- no issues with housekeeping. Towels were plush and amenities replenished daily save for the soaking bath soaps but if we had called I am sure they would have replenished those as well. Air conditioning worked as well. Our view was the market- super charming. We ate in the hotel one night- service was excellent. I enjoyed the dinner though my daughter did not, but check the menu first to see if it is to your liking. I loved the Regent. The location was near the Reichstag, Holocaust Memorial Brandenburg Gate, museums, and manl great restaurants and bars. One note- I have a bad back/leg and sometimes need a cab and experienced a problem getting a cab in the area, though not in front of the hotel. Very tempermental cabs like NY. This is a superlative hotel.", "Date": "July 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Grosse Pointe Farms, MI.", "Title": "“The Height of Elegance and Discretion”", "Author": "gjpbh", "ReviewID": "UR68849943", "Content": "I recently stayed at The Regent Berlin and the experience was nothing short of magical. I booked the hotel only a day or two ahead of arrival due to unforseen circumstances, through American Express Fine Hotel and Resorts Program and selected it based upon their recommendation. It was an absolutely great experience. For a European hotel, the room was very large with a state of the art bathroom. The small foyer lended a sense of privacy while the decor was impeccable, understated and elegant. There was an evening turndown service that added to the specialness and the breakfast that was included was nothing short of spectacular. There was everything from buffet to specially prepared dishes, all of it white linen service. The hotel was discrete and gracious with great attention to detail. The service was above and beyond with concierge being extremely helpful and courteous. Their restaurant recommendations were right on and their attentiveness most welcomed.The location was great, only two blocks from De Unter Linden, the main street, and walkable to most sites. I cannot recommend this hotel enough for its atmosphere, service and comfort.", "Date": "June 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“A great hotel”", "Author": "Billtowner", "ReviewID": "UR65924522", "Content": "Very good location -- easy walking distance to major sites, close to S- and U-bahn stops (even a Starbucks is only 10 minutes away). Rooms are spacious and have the usual amenities -- robes, slippers, etc. Free internet access was a surprise. Staff was friendly and helpful. Was able to get into my room when I arrived before noon from a trans-Atlantic flight -- which was certainly an unexpected pleasure. Not quite as grand as the Adlon Hotel, but not as pricey either. The Regent is definitely a winning hotel choice in Berlin.", "Date": "May 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Mateo", "Title": "“Best in Berlin”", "Author": "Tipster2000", "ReviewID": "UR65767115", "Content": "I stayed 6 nights at The Regent in Berlin in May. This is an outstanding hotel of the finest quality and I think the best in Berlin. One guidebook called it \"the most hushed luxury hotel in Berlin\" and I agree. It has a subdued, intimate feeling. Everything about this hotel is high quality and uncrowded. The location is outstanding. Next to Gendarmenmarkt, two blocks from Unter den Linden, across the street from Galleries Lafayette and a block from high-end Friedrichstrasse shopping and the U6 subway line. An easy walk to Museum Island and only a bit farther in the opposite direction to the Brandenburg Gate, Reichstag and Tiergarten. Many good restaurants are in the immediate area. My junior suite was spacious and appealingly furnished in a traditional style. The bath was good sized and had a separate shower. Robes and slippers. My room overlooked the courtyard and was very quiet. Rooms facing a street might have some street noise, but no adjacent streets have much traffic. The cold buffet for breakfast was a very reasonable 12 euros. A unlimited breakfast costs an expensive 36 euros. I found the cold buffet more than enough. And--hold on to your hat--high speed internet service in rooms is FREE!!! I had good dinners in the neighborhood at Dressler, Lutter & Wegner and Borchardt. But the head-and-shoulders best restaurant where I had dinner twice is Bocca di Bacco on Friedrichstrasse, just a block from the hotel--an elegant, upscale, polished operation with a buzz and nice ambiance. Bocca di Bacco has great food, great service, great atmosphere and reasonably moderate serving sizes. I mistakenly had dinner one night at XII Apostel which is further away and is a noisy, down-scale Italian restaurant featuring primarily pizza. I do not recommend it. Don't miss Fassbender & Rausch on Charlottenstrasse, about 3 blocks from the hotel at the southwest corner of Gendarmenmarkt. This claims to be the largest chocolate shop in the world and I think the claim is probably true. Upstairs is a nice cafe for a light lunch or an afternoon snack with hot chocolate. The cafe has a nice view of Gendarmenmarkt. The Regent is simply a high-class, really comfortable place to stay in Berlin. I walked through the Adlon Kempinski lobby and quickly walked back out. The Adlon is undoubtedly a luxury hotel, but it lacks the intimacy and quiet of The Regent.", "Date": "May 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Aussie in London", "Title": "“Great hotel”", "Author": "fussy1s", "ReviewID": "UR64134973", "Content": "We stayed in The Regent, Berlin for a weekend and really enjoyed it. We paid about 160 EUR a night which seemed like a good price for such a good hotel. I was a little worried it might have been dated and run-down but it was a delightful hotel in great condition. The room was huge and so was the bathroom. Our offer didnt include breakfast as we were meeting friends for the weekend in berlin we met them for breakfast at a great place recomended by the hotel - kyser sosa or something like that - it was wonderful. We found everything in berlin much more affordable than anywhere in europe we have been. We had some fantastic meals in funky little places in east berlin for not much money. The only thing about the regent is that it might not be the best location if you are after a buzzing vibe. it seems to be in a slightly more corporate area of town. The hotel was so lovely though we would stay there again if we oculd get another good deal. We did a 4 hour walking tour recomended by the hotel which was great!", "Date": "May 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Lausanne, Switzerland", "Title": "“The cold elegance of the East”", "Author": "Travellersfromswitzerland", "ReviewID": "UR61962904", "Content": "For our first trip to Berlin, our aim was to be in Berlin-Mitte with easy access to the cultural highlights. The Regent seemed to be a quiet hotel with a view on the Gendarmenmarkt. This was actually the case: the hotel was extremely quiet even so it was the week-end of the 20th reunification anniversary and we were granted a room with a view (see related picture). Room and bathroom were big, comfortable, elegant and well maintained. It was a cold and wet week-end and it was a big relief to run back to get into the big, nice tub for a hot bath after having been totally showered ! Easy check-in and out. The reason why we give 4 stars rather than 5 is that we could not make out any atmosphere and warmth. If this is a minor issue to you, then certainly we would recommend this hotel.", "Date": "April 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Top end hotel in great location”", "Author": "fisherontour", "ReviewID": "UR58359224", "Content": "We enjoyed a memorable long weekend at this hotel with friends. The ambience is one of luxury and elegance. The standard rooms are what you would expect from a top end city centre hotel; good furnishings, well kept, but not over generous with space. However you have everything you need for a comfortable night of rest. Our rooms had excellent views over Gendarmenmarkt towards Franzosischer Dom. We chose the hotel mainly for the excellent central location, within easily walking of most of the famous landmarks. For sights a little further a field (or for non-walkers), public transport is excellent and taxis are relatively cheap. We ate a number of meals at the hotel; dinner & breakfast in Fischers Fritz (Mitchellin 2*), and afternoon tea in the lobby. All were very enjoyable, of excellent quality and I could not fault the service. The downside is that this hotel is expensive, particularly the eating options, therefore this is a hotel for splurging, not penny pinching. As we all had a really enjoyable stay, the large bill represented fair value for money. Look out for deals on some of the travel websites; we found a deal that offered a modest reduction in room rate and free admission vouchers to museums etc.", "Date": "March 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dublin", "Title": "“Luxury in a superb location”", "Author": "dublintraveller100", "ReviewID": "UR52784166", "Content": "We very much enjoyed our seven nights in the five star Regent, built to a Four Seasons specification in the 1990s but later relinquished by that chain. It's just one block S of the Unter den Linden and at the edge of the Gendamenmarkt i.e. within walking distance of many of Berlin's most important cultural and government venues and close to elegant hi end shopping and some of the city's best restaurants. There is no better tourist location. Our room was large, comfortable and well equipped, apart from a curiously small bathtub. The Fischers Fritz restaurant gets a high Michelin rating and deserves it. Breakfast is a comprehensive buffet with cooked meals to order also available. The elegant decor and furnishings are in typical Four Seasons style and include some interesting historic etchings and contemporary art. All the staff we met were friendly and competent. There is free in-room internet access but the WiFi and Business Centre facilities are overpriced. There is an well equipped fitness centre with a sauna. Highly recommended to those not on a tight budget.", "Date": "January 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sweden", "Title": "“Fantastic stay at the Regent!”", "Author": "PMSweden", "ReviewID": "UR52743934", "Content": "Stayed at the Regent for four days between christmas and new year and really enjoyed it. It is really classic in terms of style and design but in a very nice way and the rooms are very well appointed. Service is fantastic and so is the location a block from Gendarmenmarkt with lots of very nice restaurants within walking distance (though do not forget to try the business lunch at the two michelin star \"hotel restaurant\" Fischer Fritz). Will stay here next time in Berlin and really recommend it.", "Date": "January 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Paris", "Title": "“Excellent Hotel”", "Author": "AddAdrTA", "ReviewID": "UR51649968", "Content": "Excellent hotel worthy of its 5 stars We booked a deluxe room and had a very cosy one with a nice view on Gendarmenmarkt Bathroom was large & great (pink marble, separate bath tub and shower, choice of care products, etc ...) Room spacious & comfortable (large flat TV, even a DVD player) It seems there's a nice fitness room but I didn't use it Top class service Very well located The only minus would be the Regent Breakfast that I wouldn't recommend as, for a high price (35 euros), you have good quality food but very limited choice As for the rest, this hotel is really excellent, we had a very nice stay and I would recommend it without any problem", "Date": "December 22, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Germany", "Title": "“Cost saving program at The Regent Berlin”", "Author": "warum", "ReviewID": "UR51124184", "Content": "We stayed for three nights from Sep. 27 - 30, 2009 at The Regent Berlin. We booked directly at the hotel and got a promotional rate for a standard double room (164,-- Euro for the first and 172,-- Euro for the last two nights, breakfast not included). We arrived sunday afternoon and were welcomed by a friendly doorman who also took care of our luggage. The reception procedure was efficient and the room was quite spacious, clean and furnished in a classic style like shown on the photographs. The marble bathroom was luxurious with bathtub, shower stall and separated toilet. Unfortunately there was a noticeable cost saving program which wasn't dramatic for the rate we booked but would be a bit annoying for guests who pay the regular rates and expects upscaled service given in top deluxe hotels: - At check in my partner was named wrong although the reservation office explicit asked for the name of my girl friend at time of reservation (\"...and does she also have an acadamic degree?\") and sent a specific reservation confirmation with both names on it. - A guidance to the room wasn't given, the receptionist just showed the direction to the elevators (although the hotel was nearly empty and we were the only guests checkin in). - In the room was neither a welcome card nor a little welcome gift like flowers, sweets or something what makes you feel welcome. - Turn down was done correctly (including a change of used towels and emptying the paper baskets) but there were no bedtimes sweets or a complimentary bottle of water given or anything else like a notice with the weather forecast placed in the room. - A newspaper wasn't delivered to the room all three days although the receptionist asked for our preferred paper at check in. - Our room had a king bed with one oversized blanket and we asked for two single blankets. After changing the first blanket the housekeeping discovered that there were no clean bedlinen for the second blanket available so we finally got bed linen from suites with a gold application. Needless to say that the bed linen wasn't changed each day. - In the evening and during the night there was no doorman available. We saw guests arriving in the evening who had to carry their luggage from the taxi to reception and after check in to their room (also without guidance). This is far away from upscaled hospitality. All three days there was no significant guest frequency in the hotel. The lobby area and the bar were nearly without guests. Maybe the (f&b-) management should check the price policy: about 30,-- Euro for a mixed cup of ice cream with fruit topping, cream and choclate sauce are far away from all competitors and simply annoying. All in all an acceptable stay for the rate we booked but without the service standard one expects in top deluxe hotels.", "Date": "December 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "ohio", "Title": "“Elegance elevates this establishment beyond its superior offerings.”", "Author": "photonutOhio", "ReviewID": "UR49600306", "Content": "This is a great location for all that Berlin has to offer, and the attentive service took care of everything else. Breakfast at The Regent was an unsurpassed treat, and the elegance of this simple meal must be experienced in order to be appreciated.", "Date": "November 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Rome", "Title": "“Wonderful but expensive”", "Author": "LeleItaly", "ReviewID": "UR49486948", "Content": "Best position in the city, rooms big enough and confortable. Price not that affordable. A bit old-fashioned (especially in the rooms)", "Date": "November 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Toronto, Ontario.", "Title": "“Outstanding Hotel.......Best Location”", "Author": "sparkhill", "ReviewID": "UR47173849", "Content": "We recently spent 5 days at the Regent Berlin. It was absolutely perfect...... and I highly recommend staying here for an experience that will enhance your vacation. The staff are exceptional. Everyone is very knowledgeable and friendly. They are extremely accommodating. The rooms are oversized and impeccably clean. The location gives easy access to restaurants, sites, public transit as well an easy walk to many locations.", "Date": "October 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Francisco", "Title": "“Fabulous Hotel”", "Author": "Professor44", "ReviewID": "UR46367318", "Content": "The Regent is one of the best hotels we have experienced. Great location within walking distance of most of the sights in downtown Berlin and many restaurants and stores. Simply amazing level of service. A beautiful, large room and spacious bathroom. Every need is anticipated. It is pricey, but worth it.", "Date": "October 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Newport Beach, Ca.", "Title": "“Best Room and service!”", "Author": "savvytraveler", "ReviewID": "UR43785571", "Content": "The Regent is the former Four Seasons hotel but completely renovated and in a perfect location for sights. We had a deluxe room, 1 up from standard which was perfect for us as a couple with our older daughter, who had her own bed with plenty of space in the room and the bathroom. There was no extra charge for our 17 year old daughter which is rare for deluxe European hotels in the city centers. We are very critical and have high standards, however, the Regent met all our requirements. The only minor recommendation would be a higher grade of toilet paper. All the stafff were helpful, from reception to housekeeping, with the exception of the concierge, L., with misinformation and a lack of willingness to help make a phone call we needed for help in German. Otherwise, the Regent is a best buy in this expensive, but entertaining and beautiful city.", "Date": "September 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Dallas, Texas", "Title": "“Excellent But a Bit Uninspired”", "Author": "TurtleCreekTraveller", "ReviewID": "UR42534248", "Content": "I've stayed in more than a half dozen Conde Nast Gold List hotels in Germany and while I'll be quick to commend the Regent as an excellent hotel providing first-rate service, I personally found the rooms dull and uninspired. Part of it may be due to the peachy pink room decor, which usually isn't a guy's favorite color, but other than the bath, the room just didn't feel rich or interesting, and it also seemed just slightly tired....not to the point of objection, but still perceptible. Two walls had large undecorated spaces which looked bare and the crystal lamps looked more like those at an over-stock discounter than ones from a Baccarat showroom. The order tag on the club chair cushion indicated that it was made for the Four Seasons back in the mid 1990's, and the hotel was, as I understand, a former Four Seasons. I chose the Regent for this trip based on its high Trip Advisor ratings, but on my next trip, I'll go around the corner to the Adlon, which is my favorite in Berlin, especially in terms of the pool, spa, and rooms. The Regent is a very solid choice and certainly has well-turned out common areas, but I found the Adlon to be a clear notch above in terms of both the room and the amenities.", "Date": "September 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Connecticut", "Title": "“Fantastic hotel”", "Author": "bossids", "ReviewID": "UR40219567", "Content": "Our family (2 adults and our 13-yr old daughter) stayed at the Regent Berlin for 3 nights in early August. Our experience at this hotel was terrific, and we’d definitely rate it at 5 stars. We booked a deluxe room online via the hotel web site and requested an early check in. The following day, I received an email from the hotel asking about our desired check-in time. Sure enough, when we arrived at the hotel at 11 AM, our room was ready. The room was spacious with elegant furnishings and comfortable beds. Even with a king bed and a roll-away for our daughter, there was plenty of space in the room. The marble bathroom was also very nice, with a separate shower and tub and the toilet in its own room. Free internet access is also a nice feature at this hotel. The location is terrific. Gendarmenmarkt is a beautiful square with nice restaurants and cafes, and many key sites are within easy walking distance from the hotel. The U-bahn is only about a block away. During early August, the hotel was not at all crowded and much of the time we felt like we had the whole hotel to ourselves. The staff was always very polite, professional and friendly. There is a very nice fitness center on the lower level of the hotel, although we preferred to run outside and take advantage of the nice weather and beautiful location. The doormen always had towels and bottled water for us when we returned from our morning run. When we return to Berlin, we will definitely stay at the Regent and I would not hesitate to recommend it to anyone.", "Date": "September 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "brighton", "Title": "“Divine!”", "Author": "ozzgirl102", "ReviewID": "UR38731100", "Content": "Absolutely beautiful hotel. 5* luxury but everyone made to feel welcome and invited. Breakfast was sublime. Would have put on several stone if we had stayed any longer just on the breakfast alone! Staff were fantastic; so friendly and helpful. After the nightmare of the Adina this was so welcoming. The room was enormous and plush. Queen size bed. Double glassed doors into the bathroom (again large); separate shower and bath; door into toilet. Two big, plump pillows each that melted around you when you laid down. It was our birthday on the Monday and when we came back from breakfast there was a delicious chocolate mousse cake with happy birthday written on it. Wonderful. Would have liked to have stayed here longer.", "Date": "August 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "new jersey", "Title": "“european elegance”", "Author": "epekes87", "ReviewID": "UR37688841", "Content": "what a treat to check in to such an elegant european hotel with my 20 year old daughter. it was just the 2 of us and the concierge Lars was so helpful. he went out of his was to direct us to the zoo, the restaurants, he advised us to walk from the Jewish quarter to a lovely residential area much like tribeca in new york city. the hotel was very luxurious with giant rooms and high ceilings and although the air conditioning was not working in our room we had an amazing time.", "Date": "August 14, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "London", "Title": "“Not 5 star as we know it”", "Author": "Vincentvilla", "ReviewID": "UR36702629", "Content": "We had booked through lastminute.com. When we arrived they said our reservation had been cancelled. We had to pay again up front. On return to the UK we found that the hotel should have checked with lastminute who could have assured them the room had been paid for. Room and service were fine. Conceirge service poor - often no-one on desk. Meal in restaurant was by no means 2 star. Pretty poor food for the money. We shall contact Michelin about this. We declined a simple croissant breakfast @ £25 each in favour of local cafes @ £5.", "Date": "August 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "São Paulo, Brasil", "Title": "“Fantastic!!”", "Author": "FromSaoPaulo", "ReviewID": "UR36594606", "Content": "We loved The Regent Berlin Hotel!!! Everybody was so pleasant and always smiling, from the moment we walked in, to the time of check-out. Breakfast was perfect, partly “a la carte”, with a huge variety of things to choose from, all included in the rate! (- I like this idea of “a la carte” as it doesn’t permit as much waste of food as the buffet breakfasts. When I see those large buffets, I notice that people tend to put much more on their plates then they can eat; for me it’s a shame the quantity of good, fresh, healthy food being thrown into the garbage!) The location is perfect too, so one can walk to most of the important sites or take the subway that is a stone throw away. The room is large, very nicely decorated, impeccable, freshly painted and with white crisp linens and fluffy towels. I can’t praise this place enough!!! This is a real 5* hotel!!!", "Date": "August 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dubai", "Title": "“The Regent Berlin demonstrates what a five star luxury hotel is all about.”", "Author": "Holidaydreamer_9", "ReviewID": "UR35064391", "Content": "We stayed at the Regent Hotel, Berlin in early July 2009 for five days and had the most wonderful time.Berlin itself was fascinating, full of history but embracing new and avant garde architecture.It is also full of amazing museums which are literally on the doorstep of the Regent Hotel. As others have stated here, this hotel is in a fabulous location central to everything. We even had the summer outdoor opera wafting into our room each evening from the Gendarmenmarkt opposite! The hotel itself was superb, from the faultless service to the finish of the rooms to the magnificent food. We ate in three nights including one meal at their 2 Michelin starred restaurant, Fischers Fritz. What a memorable meal we had.I would argue that this hotel deserves to be rated as the best in Berlin.I would certainly recommend it and would not stay anywhere else..", "Date": "July 18, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Toronto, Canada", "Title": "“Flawless in all respects”", "Author": "SunsetJohn", "ReviewID": "UR33737455", "Content": "This is a great hotel. Service is impeccable, gracious and friendly. Breakfast was a magnificent experience. The suite they gave us was absolutely outstanding, tasteful, spacious and very comfortable. Many good restaurants nearby. Easy to get to the various venues. We would stay there again anytime.", "Date": "July 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, UK", "Title": "“Superb - would not stay anywhere else in Berlin”", "Author": "tal27", "ReviewID": "UR27981310", "Content": "We had been booked into the Ritz for the Easter weekend, but I saw a special deal on the Regent website (Euro164 per night) so switched the booking here. Best decision I have made in years. From start to finish, the stay was faultless. It was our anniversary and the hotel kindly upgraded our room to the top floor, and provided some chocolate dipped stawberries, profiteroles and half a bottle of champagne to help us celebrate. Wonderful. The room was huge, the bed a super king size, smooth beautiful sheets on the bed, housekeeping twice a day (and we were out at different times each day, but the staff managed each time to have the room done when we were out without us telling them our movements), L'Occitane toiletries refreshed constantly, interesting platters each day (one day dates and plums with chocolates, the next day a very generous Easter chocolate display), large marble bathroom with separate shower and bath, and (best of all) a separate toilet so that if you are bathing, the toilet is not \"out of service\" for your partner. The block out curtains in the bedroom were some of the best I have ever seen in a hotel room - meaning we slept in most days longer than we should have! There were two huge double cupboards with lots of good quality hangers (the real sort of hanger, not those annoying ones that clip into holders so that you feel as though the hotel is expecting you to steal everything!), robes and slippers, all the toiletries and cotton wool, sewing kits, emery boards you could need. Free shoe shine every night. The reception staff were some of the most pleasant I have come across, the concierge always helpful and friendly, the location right next to Gendarmenmarkt very central to all the sights and the tube stops. Why stay anywhere else? We did not use the bar or restaurant, but both looked lovely. There is a central courtyard where you can sit outside for lunch or a snack and enjoy the weather in season. Yes, the television is an older style CRT one, but it is kept in a lovely cabinet, so why would the hotel upgrade to a flat screen? The room is more than big enough to be able to handle the size of the furniture. There was free wifi. For the price, this was unbelievable value. For double the price, I would still stay here.", "Date": "April 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Wonderful stay”", "Author": "Hannies", "ReviewID": "UR22823522", "Content": "My husband and I stayed at the Regent at the end of November. We had the most fantastic stay - staff are welcoming, helpful beyond the call of duty and without exception make you feel very special. The room was spacious and very comfortably decorated. The bathroom had seperate shower and bath, endless supply of top end tolieteries and towels. Breakfast was like a four course feast - nothing too much trouble or effort. Never needed to wait for anything during the three days we spent there. The concierge booked restaurants for us on 2 out of the 3 nights of our stay and was spot on with his choices for us. He also supplied advice on a range of requests we had over the few days. The bar is very expensive 11 euros for a baileys! but very comfortable, again with exemplary service. Berlin itself is a fantastic city - we had not been before and enjoyed our stay immensely but the cherry on the cake was the fabulous Regent.", "Date": "December 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new york", "Title": "“Berlin revisited”", "Author": "annhar51", "ReviewID": "UR20408806", "Content": "Spent the past week in Berlin staying at the Regent Hotel. Stayed there five years ago when it was the Four Seasons. Same high level in every aspect. We were upgraded to a suite through our travel agent, Lorraine travel and they arranged for additional amenities. Room was wonderfully quiet although it looked out on the street. Location for us is perfect as we love the museums, operas and concerts and could walk to most everything. The hotel now has a Michelin two star restaurant where we ate and it was a rating well deserved. The meal and service were superb. Service throughout the hotel was excellent with special kudos to the concierge, Lars. We look forward staying there again on our next trip.", "Date": "September 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Better than we expected”", "Author": "the_real_fatbear", "ReviewID": "UR20204955", "Content": "disclosure - our stay was May, 2007, and I've been remiss in not posting this Last Spring we did a 22-day Totalitarian Tour (Vienna, Prague, Berlin), winding up in Berlin for 10 days (which wasn't enough for this New Yorker to see everything). We wanted the following (in no particular order): central location quiet largish room good service good room service On all counts the Regent reached or surpassed our expectations. We arrived after a long trip from Prague, and everything was done from the first moment to make our stay comfortable. Fruit and chocolate in the room, replenished every day. Room service food very good, and at the time requested. Maid service well done, and porter too. It was almost like being in a 2nd home. The room had a side view of the Gendarmenmarkt square, which was fine - except for the corner rooms, none have a direct view (the square is catty-corner to the hotel, not directly across). There was no late night or early morning street noise, except for one night - and that was only a slightly tipsy crowd singing its way down the street - not so annoying for someone whose home is in Greenwich VIllage. As many have mentioned, the location is perfect for seeing Mitte, with excellent restaurants nearby. By the way, if no one has mentioned Fassbender & Rausch Chocolatiers, let me be the first. If you are or have a chocolate lover along, go - it's 3 blocks away from the hotel (opposite the SW corner of Gendarmenmarkt square) and be prepared for a chocolate shop unlike any other. Also - my wife doesn't trust hotel laundry and/or dry cleaning services, but in this case she relented (we needed lots of it - don't do it in Prague) and was pleasantly surprised - as good as she remembered at The Regent in Sydney. When we go back to Berlin, it will be our home away again.", "Date": "September 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hamburg", "Title": "“Great hotel in a great city”", "Author": "brasileirohh", "ReviewID": "UR19275400", "Content": "I had a lovely weekend in Belin and the stay at the Regent was great. This was already my second time there. The location is perfect and this time I got a room at the 8th floor. Rooms are really big and confortable with complimentary Wireles Internet and DVD player. Just the TV is a little bit old - they could do better with Flatscreen. Bathroom is huge, very clean, towels and bathrobes very confortable. Breakfast is delicious, with a large selection of hot dishes and sweets that are brought to you so you do not have to stand up the whole time. Very friendly and efficient employees at the reception desk, concierge and porter. Also housekeeping was very friendly. Complimentary shoe cleaning worked great! Fitness and sauna are small but nice. Pity that they do not have a swimming pool. Just one issue during breakfast this time: I had the impression some waiters were new at the hotel and looked somehow nervous and stressed. But they were guided by other colleagues who really knew what they were doing. I am very often in Berlin, and the Regent will always be my first choice. Just a pity that the special rate I got is not always available.", "Date": "August 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“First class hotel in Berlin”", "Author": "Neworleanian", "ReviewID": "UR18095886", "Content": "This place was part of the Four Seasons chain before changing to Regent. I used to stay here often when I worked on a project with a JV partner in Berlin. It is is centrally located close to the Brandenburg Gate, the Holocaust Memorial, Checkpoint Charlie, the Bundestag (the Parliament), Gendarmenmarkt and the concert hall. This is one of the best hotels in the world I know, second only to the Mandarin Oriental in Kuala Lumpur. The service here is simply impeccable, from getting out of your car, checking in, getting settled in your room, to ordering drinks. The place is elegant, with an old-world charm, but relatively newly built. The hotel restaurant, while expensive, has some very good food and wine selection. The breakfast is excellent. Down the street a block or two is my favorite restaurant Lutter und Wegner (dine in a wine cellar appointed in dark wood, surrounded by wine bottles). The hotel concierges are very capable. I asked if they could find a rental car with a manual gearbox and at least 200 bhp, to avoid the usual offerings of automatics at most rental companies, and they did... Perfect equipment for a week on the Autobahn. :)", "Date": "July 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“A lovely gem”", "Author": "Katrina70", "ReviewID": "UR17298532", "Content": "After a 30 hour flight I have to confess to a tiny bit of initital disappointment with the Regent. I had read that you should request a room with a view over the Gendarmenmarkt. I emailed and phoned the hotel to request such a room, but when i arrived I was told my room was not in the right price bracket to have such a view. It would have been helpful if someone had replied to my email to let me know this, rather than disappoint me at check in. The room I was given was pleasant - it had at least a partial view of the Gendarmenmarkt, but it was a bit tired - 1980s sage green carpet, pale apricot walls and gold taps in the bathroom. (One other quibble which I will put now so as not to end on a negative note - outrageously expensive computer access - I wish hotels would learn that the what they reap in profit on this, they must lose in annoyed guests.) Once I had a decent night sleep though I could begin to appreciate the Regent's other benefits and I forgave them for the decor. The Regent is in a fabulous location - on a quiet side street in the old Eastern bloc - perfectly located within walking distance of all the major sightseeing centres. I had worried that this part of town was a little removed from the heart of the city - the Kurfurstendam - but after visting that side of town I felt that we had definitely made the right location decision. The Regent is walking distance to the Brnadenburg Gate, to Checkpoint Charlie, to all the major galleries and museums. There is the Galleries Lafayette across the street and several beautiful high end boutiques minutes from the hotel. The service in the hotel was very impressive - complimentary shoe shine each night; a book mark left on a book we were reading; bowls of chocolates left every day and a box of chocolates left as a farewell gift. The doorman was particularly friendly and it was a pleasure to come back to the hotel at the end of each day. It is a relatively small hotel so the overall feel is one of calmness and tranquility.", "Date": "June 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Top End of 5 Star Deluxe”", "Author": "cantbebothered", "ReviewID": "UR17116147", "Content": "This is a superb hotel. Faultless.We have stayed in many of the 'great' hotels in the world and we would put the Regent up there with the best. The service was impeccable with all the staff doing all that was possible to make our stay memorable - which it certainly was. The size, position and furbishment of our room was of the highest order and the location of the Hotel was ideal for our sightseeing and tourist purposes. A definite must for those seeking the highest quality at a competitive price.", "Date": "June 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Just another glowing recommendation”", "Author": "relay1112", "ReviewID": "UR17075343", "Content": "Listen, you probably don't need to read my review to convince you that the Regent is an excellent hotel. It's perfectly situated in the East, about a two minute walk from the Gendamenmarkt. Charlotenstrasse, the street the hotel is on, is full of good restaurants and some decent shopping. We did a walking tour of East Berlin, and we ended just a few minutes from the Regent. As for the hotel itself, it can be summed up in one word: service. The service is absolutely superb; the staff is willing to do almost anything to make sure that your stay is satisfying. I forgot a blazer in the closet of my room, and I called the next day with the slim hope that they had recovered it. In fact, they did, along with a bottle of medicine I had also forgotten, and they offered without my even asking to ship them both home for me at no profit to them. What other hotel would have done this? The interior is warm and welcoming without being particularly spectacular, and the same went for our room. It was tastefully decorated and very homey, and I actually liked that it lacked the ostentation of other hotels in its class. Overall, this is, in my mind, THE place to stay in East Berlin.", "Date": "June 20, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "belgium", "Title": "“High standards but lacking atmosphere”", "Author": "topsmed", "ReviewID": "UR16020739", "Content": "Modern exterior and neo classic French decor inside. Very high standards of service, some of which go back to Four Seasons days, like Frette bed linen and L'Occitane toiletries. The rooms are large (I had one with a view to the Gendarmenmarkt), very comfortable and in mint condition. The restaurant is two-star Michelin, and there is also a good lounge + terrace with drinks and sweets (all good, with particular attention paid to the tea service). Breakfast combines a buffet with dishes cooked to order. The cooked dishes were superb but the buffet is too limited. One morning I had breakfast at the Adlon and the buffet there was far better (also more expensive). The fitness is good and very elegant, but there is no pool and the sauna facilities are limited for a hotel of this standard. During this trip I also stayed at the Ritz Carlton (see my review), and the main difference is that the staff at the Regent is much more formal.", "Date": "May 14, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Fleet", "Title": "“I recommedn to book it”", "Author": "Coolmark", "ReviewID": "UR14079511", "Content": "A friend of mine and me were there last week and we liked so much. Staff was very helpful because we were robbed in the downtown and they helped us to find a police station to make a complain. The room is spacious and the bed is quite big. Breakfast is a little bit expensive but good quality. One thing i loved was the location. We make the reservation through www.gumtrip.com because we found a good offer. Finally, the experience was good and Berlin is great!", "Date": "March 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nottingham", "Title": "“Luxury Central”", "Author": "NottinghamMike_t", "ReviewID": "UR13676563", "Content": "Berlin: The Regent, Berlin, \"Luxury Central\". Date: 10th Jan, 2008. Reviewer: Michael T, Notts. Just spent 2 nights in this fantastic hotel in central Berlin, almost booked into a larger hotel around the corner but pleased not to have done due to the scaffolding outside. The Regent genuinely is a luxury hotel, marble foyer, cosy bar and fantastic michelin star restaurant. The staff were attentive, spoke perfect English and as we were out of season and it was my wife's birthday we were upgraded to a mini suite for free. The prices are that of a luxury hotel, so expect to pay top prices: dinner for two with wine just over £200. Breakfast (was included) was fabulous. Stay here!", "Date": "February 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“It's good but not Berlin's nicest”", "Author": "gettingaround", "ReviewID": "UR11629770", "Content": "It's very clean, comfortable and central but it's more very good chain standard than one of the alleged best hotels in the World (Conde Nast obviously saw different rooms). It is portentous rather than stylish: and the room decor was a depressing and naff derivative of the 1950s. The Regent's \"working\" staff at the hotel (doormen, room service, cleaners) seem to be meticulous but \"managerial\" staff were engrossed in conversation with colleagues, visibly irritated by my appearance and words did not become deeds. There are nicer if less pretentious hotels in Berlin: for example, the Sofitel Berlin Gendarmenmarkt next door has its quirks and lacks some of the pretension of the Regent but it is a nicer place to stay and the staff are kinder.", "Date": "December 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“One of the best”", "Author": "Steelers_7", "ReviewID": "UR11511188", "Content": "The Regent Hotel is a beautiful hotel located in center city Berlin. A very courtious and gratious staff throughout this hotel. The rooms are what you would expect from a 5 star hotel. It reminded me very much of The Ritz Carlton hotels in the United States. The food was excellent in their 5 star restaurant. I feel their rates are pretty much in line with other hotels of this caliber. Rooms are very spacious with one of the most comfortable beds I have ever slept on. All rooms are accented by a very large marble bathroom. Simply a beautiful property.", "Date": "December 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“An oasis in central Berlin”", "Author": "Cranford217", "ReviewID": "UR10417669", "Content": "Excellent hotel and very central. We were driving and as we stopped at the door everything was taken care of without fuss and drama. The bar area was perfect after walking around Berlin all day and although this is an expensive hotel it was worth every penny. The staff seemed to adapt to you a sign of a good hotel and the bedrooms were big, clean and comfortable. Breakfast was a little fussy and is done better at other similar hotels I've been to. We chose to eat out and therefore can't comment on the restaurant for dinner but it did look very expensive even for Berlin and slightly over the top.", "Date": "October 29, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Las Vegas, NV", "Title": "“Luxury hotel”", "Author": "judyumcer", "ReviewID": "UR10051985", "Content": "Stayed here 3 nights. Very good location (used to be the Four Seasons). Elegant lobby and diingroom. Lovely breakfast included, newspapers provided. Our room was nice and comfortable. Good size for Europe. I requested a birthday cake for my husband's 60th birthday unpon arrival. And there it was waiting in our room. Staff were all pleasant and helpful. Great location near lots of restaurants and shopping. Probably would not go back to Berlin but if we did we'd stay there again.", "Date": "October 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Tx", "Title": "“Wonderful Hotel”", "Author": "piatty73", "ReviewID": "UR8689661", "Content": "My wife and I stayed spent four nights at this wonderful property. The rooms and the common areas are of Four Seasons Hotel design and quality. I beleieve this was a former Four Saesons Hotel. The restaurant is superb and of course pricey but was our best meal in Berlin. The breakfast that came with our Amex platinum package was great and we were not charged for the coffee we had in our room before going to the restaurant later in the morning. I was torn between this hotel ant the Ritz and am glad I decided to stay here. We liked the area better than the Ritz or the Adlon.", "Date": "September 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Orange, New Jersey", "Title": "“Superb in Every Way”", "Author": "Palmtree2000", "ReviewID": "UR8467884", "Content": "Although not impressive looking on the outside, The Regent is superb in every way inside. The public areas are beautiful including a small courtyard area for drinks and conversation. Rooms are luxurious and large with every amenity provided for. For an extra quiet room ask for one facing the courtyard. But best of all is the knowledgeable and caring staff. Every staff member we encountered went out of their way to be nice and helpful. Special thanks to Cem the concierge who was unbelievably helpful in answering our many questions about getting around Berlin and it's various sights. The hotel in the former East Berlin is just off the Unter Den Linden the main shopping street. The hotel is within walking distance of the Reichstag, the Brandenburg Gate, the Berliner Dom, Staats Opera, the Oper Komisch, Gendarmenmarkt Square, the Konzerthaus,and Museum Island", "Date": "August 21, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Auckland", "Title": "“Total elegance plus”", "Author": "charlie53", "ReviewID": "UR8004204", "Content": "Our week's experience in this elegant welcoming environment was totally positive. The staff were friendly, supportive and professional at all times always making an extra effort to ensure our stay was as pleasant as possible. Our suite was perfect with added touches to make us feel even more special. Breakfast was a feast every time .. again with attentive staff to ensure all dietary needs were catered for. We can't fault this beautiful hotel or the wonderful staff. Thank you for such a relaxing and enjoyable stay, it was fantastic. Kate and Carol from New Zealand", "Date": "June 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new york city", "Title": "“luxurious and overlooked”", "Author": "luxuryhoteljunkie", "ReviewID": "UR7953077", "Content": "The Regent, Berlin, used to be the Four Seasons. Four Seasons obviously has a much more recognized name. We stayed in this hotel when it was the Four Seasons and loved it then. On this trip back to Berlin, we were a little concerned because of the name change, even though Four Seasons owns Regent, I believe. The name change seemed like a downgrade. In addition, with all the other deluxe hotels in Berlin, like the Adlon, where Michael Jackson stayed (and dangled his baby off the balcony), the Regent seemed almost second rate. We got a terrific rate-- unexpectedly reasonable, especially considering what other deluxe properties were asking. What a delight. The Regent is beautiful, elegant and has SUPERB service-- attentive and polite, no whiff of condescension, even when I asked one afternoon re dinner at their Michelin one star restaurant dressed in a Tshirt and jeans. Rather, the maitre'd, a day later when we were seated, told me, very endearingly, that she hadn't expectedto see me return. This is a truly wonderful hotel, in a wonderful location only a block from Unter den Linden, a few blocks from the Brandenburg Gate and Museum Island, with some of Berlin's best restaurants within a few blocks. Try Vau, with 2 Michelin stars, only across the beautiful Gendamenmarkt Square. They have outdoor seating in the courtyard and are very reasonable for lunch. The outdoor restaurants in the square are also reasonably good and less touristy than you might expect. I have stayed in numerous other hotels in Berlin -- the Ritz-Carlton, the Grand Hyatt, the Bristol Kempinski. This is the best of the ones I've stayed in.", "Date": "June 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Excellent Hotel & Location”", "Author": "Porschetd", "ReviewID": "UR7755547", "Content": "I just completed a week’s stay at the Regent Berlin and was generally pleased with my stay. The hotel is located in East Berlin in the up and coming Friedrichstrasse area one block from the major street Unter den Linden Blvd. Friedrichstrasse is emerging as a major upscale shopping area in Berlin although it’s not yet on a par with Kurfürstendamm Strasse in West Berlin. The Regent’s location is very convenient for Museum Island and many of the other major attractions of the city and is close to the other 5 star hotels. As for the hotel service is excellent and the staff is very attentive and cooperative. This hotel was a Four Seasons before the owners and the chain decided to part ways and thus the change of flags to Regent. The rooms are typical of other Four Seasons hotels, although not as nice as say the George V in Paris. On the negative side I found that the HVAC system was strange in that it was apparently a central system and room controls were limited. The televisions also need to be updated to flat screens and the choice of English language channels improved. On a very positive note this hotel provided high speed Internet access free of charge whereas Four Seasons flagged hotels can charge as much as $35 – 40 per day. Overall I highly recommend the Regent Berlin but they need some fine tuning.", "Date": "June 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Lovely Hotel, Great Staff”", "Author": "PKR", "ReviewID": "UR6654379", "Content": "Stayed here in December and had a wonderful time from start to finish. Very helpful staff, spacious room with view over Gendenmarkt, whole experience was superb. Booked the hotel by phone, advised on the nicest room (and that would have virtually as good a view from a cheaper room), promised that the room would be available early morning as we were arriving from the sleeper from Brussels. Duly arrived at 8.45, assured the room was just being checked by the housekeeper, we were given coffee and our bags and coats whisked away. That was the start of a an extremely comfortable stay. The staff were charming and helpful, the room always immaculate. We didn't take breakfast as there are so many good bars and cafes close by that always are better value and actually more fun. I would return there any time - and it was topped off by taking the sleeper home again - trains don't care about fog!", "Date": "January 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Surrey Hills UK", "Title": "“great location”", "Author": "christel", "ReviewID": "UR5763039", "Content": "Great location for shops and sightseeing. Delicious if pricy food in Fischers Fritz restaurant but don't rate breakfast- have had better bread, fruit and juice choices elsewhere. They need to improve the lighting in the bedrooms as I could not see well enough to put my make up on and get more powerful hairdriers please (a common hotel fault). Overall a good visit and I would stay again.", "Date": "September 2, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "derby", "Title": "“loved the informal”", "Author": "bazzabee", "ReviewID": "UR5613612", "Content": "loved the infomal atmosphere of a top class hotel and the way the staff went about looking after you excellent very happy couple DERBY ENGLAND", "Date": "August 15, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Among World's Best”", "Author": "Respun", "ReviewID": "UR5597707", "Content": "My teenage sons and I cannot say enough about this hotel. Chic, beautiful, delightfully located, with a welcoming, truly helpful staff. Our experience far surpassed that at our other 5-star hotels, leading us to believe that the Regent is still a secret waiting to be discovered. I, for one, would detest the sterile and ill-located high rises of Potsdamer Platz. Give me the historic Gendarmenmrkt and a short stroll to Unter den Linden and the Pergamon any day. P.S. I am a total princess, if that helps guide you.", "Date": "August 10, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Denver", "Title": "“Best place to stay in Berlin”", "Author": "moserdvm", "ReviewID": "UR5476814", "Content": "My family and I are experienced European travelers, but this was our first trip to Berlin. We generally stay in fairly nice hotels but none have ever been as wonderful as this hotel - regardless of price. The service provided by every member of the staff - from reception, concierge, bell service, restaurants, house-keeping, room service, etc. - exceeded that of any hotel I've ever stayed in. They were friendly, gregarious, and really seemed to care about making our stay a memorable one. We were shown to our rooms by one of the reception staff, greeted with a welcome gift in the room (a \"personalized\" large chocolate chip cookie, assorted candies and some fruit), and given thorough information and directions about the room amenities. Each day, upon return to our rooms, we found more goodies and fruit. Returning from site seeing on our last night stay in the hotel, we found a large plate of chocolates and a chocolate souffle' awaiting us on the side table. The room was spotlessly cleaned each day. Every time we saw any staff member that we had met before, they greeted us by name, and with a firendly smile. Obviously, I cannot say enough about the service. In addition to superb service, the hotel is very well located virtually at the center of the more significant historical sites and attractions, with many being within walking distance. For those sites that require subway travel, the hotel is one short block from a U-Bahn subway entrance. The food in the restaurants was fantastic - some of the best we had in all of Berlin, and comparable to some of the best meals I've had anywhere in Europe. All of this was at a price of about $200 Euros per night (not including any meals). It truly would have been worth it had we paid double that amount.", "Date": "July 17, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "leicester", "Title": "“great hotel in an excellent location”", "Author": "leicestershire", "ReviewID": "UR5325707", "Content": "I can only reinforce the views of previous correspondents. Taking our son with us, we had a 'superior room' which comfortably accomodated the extra bed. There was a nice treat for kids in a room, but this should be a suprise, so we won't spoil it! The location is excellent, close to many of the major tourist and shopping areas, and with easy access to all transprt possibilities around Berlin and environs. The breakfast is superb and is on a par with all the best hotels. This hotel is highly recommended.", "Date": "June 8, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Stone Ridge, VA", "Title": "“Fantastic, Fabulous Hotel”", "Author": "VDeliz", "ReviewID": "UR5231918", "Content": "The Regent is a #1 first class hotel. The staff goes out of their way to satisfy all of your wishes. The location one block from the Gendarmarket is great with lots of restaurants close by and fabulous shopping in the Friedrichstrasse. It is also a block from the Franzchoistrasse subway station (in the U line), and a block from the Under den Linden avenue (where the Branderburg Gate is located). The rooms are big in size. They are classy in their look, or as they say \"timeless elegance\". The bed is really plushy and the pillows are down feather and huge!. If you have allergies, they will bring hypo-allergenic pillows for you. You also have free internet access in your room. The bathroom is outstanding. The marble tiles are very pretty with separate bathtub and shower plus a separate toilet (with door). The products in the bathroom are L'Occitane and the towels are really nice. The closet is equiped with wooden and satin hangers (nice touch) and it has a safe. The breakfast is outstanding and included in the price of the room. You get what they call The Regent Breakfast. It has juice, coffee/tea, basket of rolls, 3-tier plate selection of cheeses, cold cuts and pates. Also fruit, cereals, and pastries. You can also add an egg dish, french toast, bagel/salmon and pancakes. And you can eat as much as you want! They also have a Japanese Breakfast (with miso soup) and a continental breakfast, plus you can order a la carte. Definitively, this is one fantastic place to stay.", "Date": "May 29, 2006"}], "HotelInfo": {"Name": "The Regent Berlin", "HotelURL": "/ShowUserReviews-g187323-d190664-Reviews-The_Regent_Berlin-Berlin.html", "Price": "$218 - $1,320*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Charlottenstrasse 49</span>, <span class=\"locality\"><span property=\"v:postal-code\">10117</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "190664", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/28/2f/282f93482275a8c9ecd5009f9afe38687large.jpg"}}