{"Reviews": [{"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great location, interesting decor”", "Author": "Vini B", "ReviewID": "UR127764932", "Content": "On my way back to Canada, I stayed for a couple of days at this boutique hotel. Overall, if you plan on staying in the downtown core this would be a neat hotel to stay in with your significant other. The interior is very funky and post-modern. There's a big chalk board at the entrance of the hotel with all the guests writing whatever, and the front desk is very low-key with a glass table and a Macbook along with pink and purple lighting. Rooms were nice and comfortable, very clean, showers were awesome (his and hers). My one beef is that it's kind of hard to find (sort of hidden) and the parking around the area is a little steep. Staff were great, recommended some good places to eat. Location is wicked, 5 minute walk from the Bell Centre so you can catch some Habs games. Recommended.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Awesome stay!”", "Author": "SinOttawa", "ReviewID": "UR127611179", "Content": "Found Chez Swann on a Dealfind promotion of $99 for a one-night stay. We were in Montreal for a concert at the Bell Centre so the location and cost were ideal for our needs. I made the reservation over the phone easily and was advised I could request a room upgrade (if avaialable) upon check-in. Once we found the unassuming entrance on Drummond Street, staff at check-in was friendly, quick and the upgrade had been taken care of without me having to ask. We loved the room! Decor was modern and comfortable, room was clean and well stocked with local touches (handmade soap and bath products). We really liked having the iPod docking station/stereo getting ready for the show! Albeit a minor flaw to consider, the TV is rather far/too small for viewing from bed. Breakfast options were limited but I was permitted to take a tray of coffee, juice and pastries up to the room instead since we weren't up in time to go down to the restaurant. We would definitely make a point of staying there again if the circumstances were the same. Front desk staff would be best to have a list of recommendations for food etc.. in the area. The gentlemen we asked couldn't really suggest any great options nearby. Also of note, they do not have their own parking garage but provided a discount coupon for a spot on the same block. Worked out really well.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“A-Mazing!”", "Author": "PCWedding", "ReviewID": "UR126659688", "Content": "What an amazing hotel and awesome staff! The deal that we got was beyond belief. The room was $99/night for two beds and and included many extras including free breakfast...Free Wi-fi...spa coupons (which we did not have a chance to use) The room was extremely modern and clean. Super comfy beds and great funky feel. The Shower and bathroom win general was awesome! My next visit to Montreal will include a stay here! The location could not have been better! Two minor negatives...The included breakfast...when we arrived there was little more that juice left...That was a bit of a let down...and the staff at the restaurant were not that helpful at all...and the temperature of the room...Too warm! I can assume that was due to the time of year. We were visiting in mid March and were were lucky enough to be in a serious heat-wave. Great for nights out in the city but too warn in our room no matter how low we tried to get the AC Ah well...I loved the room and the staff were way above and beyond Even with the minor negatives there is no way I could less than a 5 for the price we paid v. what we received AWESOME!", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Albany, New York, United States", "Title": "“Wonderful experience”", "Author": "springb0und", "ReviewID": "UR126519631", "Content": "Lucked into a great deal and got to stay here for our first trip to Montreal. The room was extremely clean and the decor was funky and fun. The staff was very nice and helpful. I would have expected to pay a lot more for this quality than we did. I am glad we read reviews saying how there is no sign, since we would have driven past it. When we return to Montreal, this will definitely be where we will stay again.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Love this place!!!”", "Author": "cdelucia", "ReviewID": "UR124679075", "Content": "I can't say enough good things about this hotel -- it's really a fantastic place to stay, especially considering the cost, and we really enjoyed everything about it. I'm not sure I understand the negative reviews about this place, but I guess it's not for people looking for the standard cookie-cutter hotel, as it is definitely a boutique place. But the rooms were amazing, with very cool bathrooms; everything was extremely clean; it's in a great location; the staff are very helpful and friendly; and the extras that are included (free wi-fi, great breakfast, etc) made it that much better. We will definitely return!", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Finland", "Title": "“Enjoyed my stay, the hotel has a personal touch”", "Author": "morrisen", "ReviewID": "UR123309925", "Content": "I really enjoyed my stay here, it is one of the better hotels I have stayed in. The staff was the friendliest I'w ever encountered in a hotel. The bed was good, and the shower a real luxury item with three shower heads. The improvements can be made on the breakfast front - I would have liked something simple but salty, and a yoghurt would have been an easy and cheap addition to the selection. The soundproofing is the second improvement that could be made, the sound from the hallway was quite loud, and understandably so, when there was a opening under the door so high that you could see the light on the other side. Cleaning wise I would have liked if they would have mopped the floor, as the amount of salt that is used in Montreal really leaves trails. Find the place was no problem, just look for what the house looks like on the outside. The airportbus 747 is a good option for this hotel. Get of on stop number 3 and walk up Rue Drummond. Metro station Peel is also close by (3 min walk).", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Four nights, Rooms great, traffic noise not so much”", "Author": "Toronto G", "ReviewID": "UR122949441", "Content": "Stayed here for four nights starting on a Friday night. I have lived in Montreal so I knew that the location was excellent. Close to Simon's and the nicer (albeit expensive) restaurants on Crescent Street. Stayed on the second floor in one of their suites (Les Mondaines). Clean, comfortable with great amenities. I agree with all comments regarding the shower (the number of jets is great) being that is really is great. Lots of lighting and it really is a nice boutique hotel. Breakfast at the restaurant was very good and all the staff were friendly.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oakville, Canada", "Title": "“Nice, but...”", "Author": "Feb58", "ReviewID": "UR122522637", "Content": "First of all, I booked a King but I got a Queen instead, and I was dissappointed to find out the Queen room was too small compared to other hotels I stayed at; The photos showing on the website showing suite or bigger units with sitting area, with funky chairs and table is not available in the Queen room, there is only a desk with 1 chair, and you do not see the shower area from the bedroom as indicated by other reviews, it is all based on the room you will get. Yes, the design and washroom/ shower are special, but is it worth the money? Maybe when it's on sale. Breakfast was OK, but the host was like a robot with no smile and all he want to know is what room you are staying at. Couple of times he moved us from one table to another without even asking us, he just moved our stuff to another table! In general there was no warm feeling or smiles betwwen most of the staff! Actually, I felt that all businesses in Montreal need to improve their customer service skills. Finally, the price do not include parking, so good luck finding a parking in the busy downtown area, otherwise you have to pay about $22.50, after $3.5 discount from the hotel, with a parking lot that they deal with.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Great room & great location!”", "Author": "italarmo", "ReviewID": "UR121598569", "Content": "Stayed during my 5 year anniversary. It was a very romantic room with glass partition seperating the room and the rain shower for couples. The bed was comfortable and TV was good. Some things that were not ideal was that (1) our room had a skylight. Yeah it sounds great and romantic, but when morning comes and the sun is shining, it sucks. We couldn't sleep in at all. (2) there was no mini fridge in the room and (3) the lobby & elevator smelled really bad. I think it was because of the water/ floor cleaner the janitor was using... it smelled horrible! Other than that, our stay was great and our room was amazing :)", "Date": "December 10, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Great room, stylish hotel, few ammenities”", "Author": "AdrianCrook", "ReviewID": "UR121438096", "Content": "First off, I love the style of this hotel. Modern, clean, high ceilings (at least on the top floor - not sure about the others). Hardwood floors throughout the room, an elevated bed, huge windows with a reading nook, a skylight (again, obviously only on the top floor). The bathrooms are pretty insane too - half glass, half tile, looking out onto rest of room. The price was excellent. Downsides: the hotel has no affiliation with a drycleaners. I had to walk 5 blocks to Eaton Centre to get my clothes cleaned. No minibar. No room service. TV in room had only the very basic cable service, so most of the channels that had stuff I wanted to watch were not available. The hotel has no umbrellas either. The staff is nice-ish... depends who you catch and when. Not overly effusive, but that's OK. No ironing board in the room. Slow internet (not the worst I've had - maybe 15K/sec download... so forget streaming video). The location is great though. And a huge added bonus, for me anyway, was the Liquid Nutrition smoothie store connected to the hotel lobby. Insanely good, nutritious smoothies made it easy to grab one on the way into m client's office.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wallingford, Connecticut", "Title": "“Great location and design, but missing a few services we'd like”", "Author": "EYEHAVEYOU", "ReviewID": "UR121256631", "Content": "Stayed here with my fiancee while visiting some family in Montreal. The hotel's location is great, plenty to do in the surrounding area. Others have talked plenty about the hotel's design, and I won't bother repeating that here. We particularly liked the showers - the glass was nice, but the massage jets were even better. Would love to have the same type of shower in our house. A couple things that I didn't like: - No one at the front door to help with our luggage - would have made life a little easier. - The room we were in was particularly noisy at night, this is due to the restaurant/bar downstairs that has live music. When booking I had requested a different room as suggested by the reviews here, but since we didn't get in until around 10pm, ours was the only room available. As someone who can sleep through virtually anything, it didn't bother me, but my fiancee had a lot of trouble getting to sleep. On the whole though it was a good experience and I wouldn't hesitate to recommend this hotel to anyone looking for a new boutique experience in Montreal.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bayonne, New Jersey", "Title": "“Contemporary and Modern Hotel”", "Author": "B0ri", "ReviewID": "UR121083962", "Content": "It is a little tough to locate this hotel since it does not have a billboard with \"Chez Swann\". Hotel is very contemporary and modern. The room has an interesting setup. Bedroom has LCD TV, Office Desk with Phone, and a Cupboard. Phone calls to US and Canada are free of charge. A glass wall and curtain divides the bedroom from the bathroom. From the bedroom one can see \"everything\" that's happening in the bathroom and shower room. WiFi is fee of charge. Parking is NOT available. You will find to find a parking lot. We took the one next to the hotel for convenience and paid 30$ for almost 11/2 days. Every time you leave the lot, you have to pay. The continental breakfast is in a restaurant within the hotel. It is decent with bread, croissants, coffee and juice.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“This Westcoaster will definitely come back”", "Author": "joc21", "ReviewID": "UR120050385", "Content": "I stayed here for six nights in the beginning of October while attending a conference at the Palais des Congres. The room was great, modern and stylishly furnished. It was really spacious and the bathroom was equally huge! Bed was really comfortable. The only slight problem I found at times was there wasn't enough lighting when trying to look at my clothes and the safe in the dark armoire. The walk to the conference centre was aapproximately 20 min which was nice in the mornings; a taxi cost around $7. It was located right by the great shopping and some great restaurants. I felt like i was right in the heart of Montreal. I had breakfast a couple of times in the hotel which was provided. It was a simple option of croissants, pain au chocolate and other pastries, juice and individually made coffee choices from a machine. Would have liked a yogurt/more healthy option especially when staying here for so many days my waistline wouldn't appreciated the pastries every morning! The staff were always very helpful. I felt really comfortable here, especially as a woman traveling alone. The hotel was on a slightly quieter street too which i think made it quite quiet. Overall the hotel and staff were fantastic and I had a great deal and stay. I would definitely come and stay here in the future and would recommend it to my friends and family. A great, funky, well located hotel.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, BC", "Title": "“Boutique hotel in a great location”", "Author": "vancouver123", "ReviewID": "UR119992882", "Content": "We stayed at Hotel Chez Swann for two nights in mid-October. We would definitely stay there again. It is decorated in a modern style; great colours and overall decor. Not your usual hotel decor, much more funky but still comfortable. It is half a block off of St Catherine's street and is close to many restaurants, stores, and the Bell Centre. The hotel is in the same building as a great restaurant for the included breakfast (croissants!) and also for a drink or appetizer at night.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Quaint decor, outstanding service”", "Author": "jasonwisdom", "ReviewID": "UR119801738", "Content": "The style of this place is reason enough for me to give this small hotel a 4 or 5 star rating, but what really stands out was the service I received, when I lost a critically important item for a presentation I was to give the next day. It was suspected that a new maid had started that week and she might have cleaned off my desk. The entire hotel staff searched high and low, through their stores, lost 'n found, closets and even the trash dumpster (they got out the yellow gloves). In the end, said item was recovered, and I was prepared for my presentation. This was above and beyond anything I could have expected or asked for. Not to mention, the location is great (5 blocks from the convention center and 2 blocks from prime nightlife), the showers are cool, and the skyroof on my third floor room was huge. Highly recommended.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Guildford, United Kingdom", "Title": "“Fab location, great people, lovely room”", "Author": "SusanL212", "ReviewID": "UR119571435", "Content": "We stayed here for 4 nights on our first visit to Montreal earlier this month and could easily have stayed longer. Our room had two large double beds and a cute seating area. The bathroom was spacious with a walk-in wet room that had two separate showers. Staff couldn't have been more friendly and helpful and the complimentary breakfast taken next door in the restaurant was perfect for getting a great start to a busy day!", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Panaji, India", "Title": "“Simply Superb”", "Author": "SushNam", "ReviewID": "UR118352787", "Content": "I don't want to repeat what others have already said. This is a great hotel right in the heart of the city, you walk out the door and there is a bixi bike station on the opposite side of the road. Joe's panini is only a 2 min walk. St catherine is a block away. What I liked the most about this hotel is the staff (except for the ones in the restaurant). The guys/gal at the reception were always there to help us out, help us decide in finding out good places for poutine, one of them even went to the extent of giving us his personal umbrella since we didn't have one on us. They truly and genuinely are glad to have you stay at their hotel, unlike some plastic smiles I have seen in other hotels. Some cons :(really minor ones) The TV is at a weird angle in the room ..if you like watching TV from the bed then get ready for a neck ache. The safe is located way on top in the cupboard so it might be difficult for some people who are not so tall. Having said that,will stay here again if the opportunity arises and definitely recommend to everyone.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“So chic!”", "Author": "LAR_91", "ReviewID": "UR118090181", "Content": "I was glad we had the street address or else we'd never have found it--this hotel is literally a hidden gem! The people at the reception desk were so friendly; we never went in or out without being greeted, and they were very helpful with maps and internet connections and general information. It's located in a very central area, close to shops and metro stations, and you can even rent bikes right across the street. The room was small but very chic; the bathroom was plenty large, and the shower was AMAZING. This hotel is a great deal and a unique place to stay, and we would definitely stay here again.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Sexy steal”", "Author": "Jackie B", "ReviewID": "UR117925358", "Content": "Seeking a boutique experience we had booked at the Opus Hotel, which turned out to be a cheap-looking delapidated disaster for $200+/nt... After refusing to stay and battling for a refund, we located Chez Swann on the fly and what a breath of fresh air! Upon arrival a friendly and knowledgeable front desk person was willing to match the cheapest price available online, and even provided a discounted upgrade to a second floor suite. The room was funky and romantic - complete with peek-a-boo shower! Included all kinds of freebees including complimentary phone calls and wireless, and free drinks and appys at the bar downstairs. The decor was cool and the building well maintained. The location is also second to none, perfect location less than a block from the shopping strip and entertainment district. Bar downstairs also offered delicious and affordable upscale dining. Only downside was the $40/day parking, although typical of the area. We love you Chez Swann!", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Would definitely stay again and again”", "Author": "JaeGuzzi", "ReviewID": "UR117764124", "Content": "Upon our arrival we were greeted warmly and were given all the information we needed at the time of registration. Each time we left the hotel and entered the hotel we received a welcoming greeting. When we first walked in the room we were already impressed by the decor! It was a very unique arrangement and exactly what we were looking for when we searched for a hotel. We did not want the typical hotel room; we wanted a comfortable place to stay, in case the weather did not hold up for our trip. The staff was very accommodating and upon our request for extra items, the staff responded immediately with no hesitation. We want to thank you for such a great hotel and keeping to the 'boutique' feel that it promised. And another thank you for making out stay feel like 'home'.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Italy", "Title": "“Intriguing hotel!”", "Author": "Achille C", "ReviewID": "UR117581316", "Content": "I admit it: reading the reviews of Chez Swann, we were absolutely curious about the shower thing. Having an open view shower in the middle of the room was something very peculiar, and it is! Our room was at higher floor, so we did not experienced any heel tiktak. Yes, there was some noise, but hardly enough not to sleep. You have to consider noise if you choose a downtown hotel. We slept quite well, even if our was a corner room, hence we had - well screened - windows on the left and behind the bed. Very fine, stylish room decor, very, very comfortable bed, a lot of pillows, and an efficient air conditioning. The famous shower was gorgeous, vertical and horizontal jets; very special thing. Good quality amenities, with a huge scrub soap bar. Very nice TV set, but complicated to use, and no trace of ESPN channels. Most of the channels in French language. Next to our room there was a spinning room with 4 bikes. I am very surprised that some is complaining about breakfast. We knew when we booked it was a continental type; we found it of very good quality; the french patisserie was very good and is wide variety. Then, so good having breakfast in the lounge of a nice restaurant, in the middle of many champagne bottles; I lived it as a touch of class! Unbeatable position, in the middle of action and very close to Peel subway station; the personnel lights and shadows, a couple were very nice, some other shy if not indifferent. In general, very good price/quality ratio: would recommend this hotel with no hesitations.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great location but the hotel is just OK”", "Author": "Topperllett", "ReviewID": "UR117552615", "Content": "My husband and I stayed at Chez Swann for two nights in August. The hotel is definitely cool but it was almost too boutique for my liking. We stayed in room 201, it was very clean and quite large, the bathroom was massive. I found the hotel quite noisy, we could hear the people in the room above us stomping around and every time the elevator opened or closed we heard that too not to mention everyone in the hall waiting for the elevator. The staff was very nice and keen to help but utterly clueless about some really obvious things like where to get breakfast that's not Eggspectations (M Cafe across the street had a nice and reasonable breakfast) and how much a cab is to the airport ($38.00 flat fee). The beds are really comfortable and as mentioned before the rooms are clean but it's very much a no frills experience and I felt there was a faint cat pee smell in the lobby and elevator. If you're willing to let cool override the comforts of a slightly more conventional hotel then Chez Swann is just right. The location is fantastic.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London", "Title": "“Excellent location, lovely room, perfect for a city stay”", "Author": "ILovetheLakes", "ReviewID": "UR116614435", "Content": "Spent three nights here at the start of a longer trip and found it to be an excellent base to explore MontrÃ©al on our second visit there. The room was spotlessly clean and the dÃ©cor really funky. Loved the shower window from the bedroom and the many different shower heads. Even the complimentary bathroom goodies were lovely!. There's always someone on reception, and theyre very helpful. We were late checking in and out and they didn't bat an eyelid. The views aren't incredible, but its a city, so that doesnt seem to matter. Expect excellent wifi service, for those who care, and an iPod charger (although not for the iPhone 4). There's no restaurant. Breakfast is pastries and coffee/tea served in the reception (very cool area) from early in the morning until lunchtime. You can take it to your room or eat in the reception area. If you like waiter service, this isn't the place for you, but we loved the flexibility of grabbing a pastry and a coffee on the way out for the day (MontrÃ©al food is too good to fill up on hotel breakfast anyway!). There's a bixi stop opposite the hotel (by far the best way to get around the city) and you're a short walk/run from the mountain. In addition, there's a spinning room (with 4 bikes) on the 3rd floor (I think). Excellent if the rain hits! This was absolutely perfect for our stay in the city and we would definitely recommend it to anyone wanting to be left to their own devices in a convenient location in funky and clean surroundings.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“stylish and unique montreal boutique hotel”", "Author": "jeremyalan", "ReviewID": "UR116133857", "Content": "room - modern and minimalist, comfortable bed and furniture, sexy double shower. (stayed in 205, great layout) location - bixi (bike rental) across street, one block from peel metro station, steps from st catherine breakfast - espresso and delicious pastries (check photo), dedicated space for dining opening soon service - beyond friendly and helpful loved every second... we'd be back again. it will be a little easier to find once the sign is up :)", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Waterloo, Canada", "Title": "“Amazing Value”", "Author": "Ms_Anthropic", "ReviewID": "UR115596651", "Content": "My husband & I stayed here for our 3 year anniversary for 3 nights. It is one of the cheaper hotels in MTL and in a prime location. We walked everywhere! From Rue Drummond where it is located Rue St. Catherine is literally 2 minutes away & Crescent Street with all the night life is one block down. We went to Bistro's on Boulevard de Maisonneuve. There are lovely little restaurants & places to eat all around it. The hotel's breakfast wasn't our thing every day as it's just pastries & tea/coffee, but we had it on our last day & the pastries were delicious. There is a small health bar in the front of the hotel which has some very nice healthy options for a snack or protein shake. We had to travel a bit by cab to see Notre Dame & St. Joseph's but it was only maximum $10 each way. We saw everything Montreal had to offer including a walk down Rue Sherbrooke to Rue St-Paul (Vieux Montreal). We even went on a day trip to Quebec City. I highly recommend this hotel! It was a great experience for a young couple & the decor is fresh & inspiring. If you like the traditional hotels like the Radisson or Hilton with your mother's curtains in each room, then this is not for you!", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lincoln, New Hampshire", "Title": "“loved it, loved it, loved it!”", "Author": "Bouton71", "ReviewID": "UR115584805", "Content": "We have been going to Montreal for over five years, this was a special occasion our 40th anniversary. Great location,wonderful ,wonderful service,super room,very romantic,clean, cool decorations and fun! We mentioned our aniversary and when we went back to our room there was a gift bag with fabulous chocolates and gift certificate to a spa, how wonderful is that. The manager, the front desk, everyone was quick to help and give us ideas on our stay. This is now our favorite hotel to go to anywhere . Not cookie cutter and well thought out down to the last detail.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Hidden Gem in Montreal!”", "Author": "SamW_DC", "ReviewID": "UR115452303", "Content": "What a surprise! For the price, you can't beat the funky, modern accommodations of this fantastic little hotel in the center of Montreal. The rooms are spacious and well-appointed: Great, comfortable bedding, a beautiful bathroom (double shower, great products, soft & fluffy towels). The design of this hotel is arty / funky, but not in a cheap-looking way. I was very impressed. Check-in was simple (they use Apple computers at the front desk). Staff were friendly and English-speaking, the common areas are very nice. Location is fantastic - just a short walk to shopping or office towers in the center of Montreal. Felt secure/safe the entire time in the hotel. Will definitely stay here again - my only gripes (but still 5 stars) - the wifi is a bit weak at times and the breakfast (coffee and danishes/croissants) is a bit minimal, but for the price I was not bothered by this at all (Second Cup is about 2 blocks away). STAY HERE!", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“A winner! Sleek, modern decor in a great location.”", "Author": "ShaShaSha08", "ReviewID": "UR115400103", "Content": "This hotel is great! Would stay there again. It's unique and not like a chain hotel, is relatively new, and we hope that they make it. We wanted to stay closer to old town, but this was better. Could still walk to old town but enjoyed being close to restaurants on Crescent. Pleasantly surprised by plush spa robe and slippers, free wi-fi, free calls to Canada and US, free continental breakfast. Staff was extremely friendly and helpful, but not trained. There was no literature in the sleek room, and no one could tell us what the TV stations were, how to adjust the TV - picture was larger than the screen, how to retrieve messages on the room telephone when the readout said there was a message, etc. Very kind desk person brought us ice, but there is no vending or ice machine. Hotel room 212: on the south side - 2 windows faced a skylit atrium, not outdoors, but completely private. We could hear footsteps above us, but nothing adjacent (if we had neighbors). Would ask for a 3rd floor room. Room doors slammed in the hall as guests came/left, but no housekeeping noise. Two beds, desk, wardrobe, chair. Spacious enough but very black and dark and a bit tricky to negotiate. Decor is minimal and trendy cool. Good a/c unit is very quiet. Lighting - OK for reading in bed but otherwise the room is very dim. For serious work, would need to request an additional lamp. Inside the entry door, and from bathroom, are 3 steps down on a completely black floor that could be a falling hazard. Spotlights along the steps are too bright to leave on overnight, so we left the bathroom light on with the door closed to remind us that the stairs were there. Two of us were non-romantic friends, so to obscure the peek-a-boo shower we pulled the red curtain but it was quite sheer, so we turned on the floor lamp in front of the window to obscure images from the shower. We didn't see any other rooms so don't know how this compares. All in all, a great experience!", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Lots of room to improve.”", "Author": "pmcdsl", "ReviewID": "UR115362010", "Content": "I Stayed in this hotel last weekend (rooms 203/204) and I'm not sure if I would stay here again. The service was great and staff very friendly but... - There were two dirty towels on room 203 upon check-in. - Hair all over the bathroom on 204. - You can hear people walking on the 3rd floor all day/night long. - Strange layout on 203 (TV on the side of the bed). - Poor, very poor breakfast. Over all the hotel is a great value.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“Great location, friendly staff”", "Author": "MarlouDenHaag", "ReviewID": "UR115133605", "Content": "Advantages: great location, very friendly and helpfull staff at the reception (except for the managers.... they seem to ignore the guests, too 'busy' to even greet), hip furnishing (we love the floor lamps in the lobby), huge bed and shower. Disadvantages: the breakfast (a Nespresso & muffin) has to be taken in the small lobby, sitting on the hip but not exactly comfortable bench, a bit noisy (our room was located on the 2nd floor above a restaurant wich played music till 2 am), we found no manuals or information about the in our room.", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Perfect place for a romantic getaway”", "Author": "cflavoured", "ReviewID": "UR115054327", "Content": "My wife and I stayed at Hotel Chez Swann over the Canada Day long weekend for a quick getaway. It seemed like the perfect place for a romantic getaway and it didn't disappoint. As others have reported, the hotel can be a little tricky to find so keep an eye out for the 2 glass doors to the immediate left of the Liquid Nutrition juice bar. Parking is located halfway down the block, closer to rue Saint-Catherine. You can park your car first and check into the hotel after. There is also free, temporary street parking in front of the hotel if you want to check in first. You'll be given a parking voucher, which gives you a discount at the garage. The garage is a little dark and narrow but it's safe and staffed 24/7. Parking for 3 nights over the weekend was $50, which I didn't think was too bad. You can apparently go in and out of the parking garage and pay a lump sum at the end but we didn't do that. The hotel is extremely well located in downtown Montreal... Peel metro station is about 2 minutes away and there are countless restaurants, bars and shops in the area. All of this is great, however the neigbourhood can be quite noisy at night. If you're not used to the noise, you may find it difficult to get a good night's sleep. There is also a restaurant located directly below the hotel, which has a fairly large patio. The sound of restaurant patrons and the music playing in the restaurant is almost always present in the room (from 9am to past midnight). It's nothing an air conditioner or TV can't drown out when trying to sleep but I think this may bother some people used to quieter environments. The room itself is totally unique and unlike any other hotel I've stayed in. The bathroom is incredibly modern and clean. The shower is truly amazing... a two person rain head shower with a window looking into the bedroom definitely makes this a wonderful place for couples. There is a safe large enough to fit a laptop, free bottled water, bathrobes and a hair dryer in the room. A fridge would've been nice and I didn't see any do not disturb signs either... funny, considering it's geared towards couples. Breakfast consists of coffee and very large pastries. Overall, I think is a great hotel with a bit of room for improvement.", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Newfoundland", "Title": "“Unique hotel, fantastic staff, excellent location!”", "Author": "pema_blue", "ReviewID": "UR114946819", "Content": "We stayed here for 4 nights while visiting Montreal for a short vacation. The hotel has a great decor and our room was very nice & spacious. Our king size bed was comfortable and the showers are by far the best I've ever been in - the fact that it is a two-person shower really cuts down on time taken to get ready in the morning. The toiletries are from a local company - Bella Pella - and were awesome (actually went to their shop and bought some soap to take back with it). We stayed on the second floor and could hear the noise/music downstairs which might annoy some people but it never prevented us from getting to sleep. The hotel is a boutique hotel - very trendy, artsy, etc. so it isn't designed to be as functional as other hotels but we went for the experience of it - and I really enjoyed the feel of the hotel and also the fact that it was very quiet (only 23 rooms so there was never a lot of chaos). The staff there were fantastic. Very friendly and helpful. One girl on the front desk helped us find the best Thai restaurant - in a spot that we never would have visited on our own. We also made good use of the free wi-fi to find places to visit during our stay and they also offer free local & long distance calls (in North America) which was a nice additional feature. The location of the hotel is also excellent - make sure you keep an eye out for the blue-lit entrance as there isn't a sign. There are tons of restaurants/bars and shops near by, as well as the Peel Metro station. Also, in the mornings they have croissants & a variety of teas/coffees (Nespresso) available in the lobby which is a great way to start the day. Overall, we had a fantastic experience at this hotel. We wouldn't necessarily stay there again simply because on our next trip we're thinking about staying in the Quartier Latin area but if you are looking to stay near St. Catherine/Crescent and also McGill it should definitely be an option.", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Virginia Beach, Virginia", "Title": "“Fantastic Hotel - Horrible Parking”", "Author": "harpmike", "ReviewID": "UR114610876", "Content": "Arrived in evening during heavy traffic. Found the right street with my GPS and parked. Hotel was kinda hard to find until I remembered the blue door in the Tripadvisor pictures. Desk clerk told me I would have to park down the street in their parking garage. Garage is located on a seamy side street and is dimly lit, dirty, with small parking spaces and tight turns on the access ramp and costs over $20 a day. This was my first trip to Montreal so maybe this is the norm for garages downtown. The two attendants were rude and distant. Had to move the car after parking on 11th floor when attendant told me that I could not park on that floor. Scraped the my rental car just below the door on passenger side on a low retaining wall while navigating one of the ramp turns. Was so dim in the garage that I didn't see the damage until after we left the next day. On the other hand the hotel staff were very friendly, professional and helpful. Gave us a map and pointed out all the local attractions and told us WIFI and long distance telephone was free in North America and also about the free continental breakfast. Was upgraded to a king suite when the room we booked was not available. Large modernistic room, big comfortable bed, with new HD television (lots of varied channel selections), clock radio, and distinctive lighting. Shower was huge (probably could have got five people in it) with a floor to ceiling window to it in the bedroom. A window for the shower was kinda kinky but different. At our age showering is not exactly a voyeur's dream. Only complaint was the two steps from the foyer to the bedroom (nearly fell when I forgot about them the next morning) and the noise from people on the street below. Left TV on to drown it out. Loved the hotel but hated the parking. Would stay again but would try to get an interior room and find anywhere else to park.", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Fabulous location for fun and romantic urban getaway”", "Author": "OttawaClaireBear", "ReviewID": "UR114579198", "Content": "My husband and I stayed in room 310 for a weekend to celebrate our first wedding anniversary. The hotel was great. It is a bit hard to find if you don't know all you're looking for is the door beside a smoothie bar, just south of Maisonneuve Street. Once you find it, you realize it's in a great location - one block from the shops on St. Catherine and a couple of blocks from Peel St (and the metro station) and Crescent St. But it's on a side street, so it's quiet. The layout of the hotel is a bit strange, so if you like having a view, don't go here. Our room overlooked the hotel lobby, but there are huge skylights, so it was fine. The shower was huge, and you could keep the curtain open between the shower and the bedroom. The bed was comfortable, and it was nice to have a desk and a huge TV (which we never used). The staff was very helpful. They offer free continental breakfast until noon (croissants, danishes, coffee and tea). Wifi and long distance calls in North America are free. We greatly enjoyed our stay here and look forward to visiting again.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“What a fabulous place to celebrate a birthday!”", "Author": "lynnie_rocks", "ReviewID": "UR114427725", "Content": "I booked my 18-year-old daughter and her partner into the Hotel CHez Swann and they had a wonderful experience. The two had been travelling around the US by car and they totally loved the Swann and its beautiful arty and funky surroundings. Very inspiring. My daughter celebrated her birthday there and the staff, particularly Honorine, were fantastic, interacting with me in Australia to create a wonderful arrival surprise for the travellers. Thanks so much for making their stay so marvellous. What a fabulous boutique hotel.", "Date": "June 19, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Very nice new hotel”", "Author": "NewChapter036", "ReviewID": "UR112899322", "Content": "This hotel is very new, not even one year old. It does show a bit since the staff seems a bit inexperienced. However, everybody I talked to was very friendly and helpful. The room was clean, well decorated (modern design) and a good size. This hotel is well located very close to the subway and right downtown. This hotel will probably become my go-to hotel for my future Montreal trips.", "Date": "June 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester, New Hampshire", "Title": "“Excellent hotel in excellent location - cheaper than Marriott/Hilton”", "Author": "ChubbyNinja", "ReviewID": "UR110719686", "Content": "Great hotel. Clean, comfortable, helpful front desk staff. And the rooms were clean and comfortable too! Ha ha! But seriously, I loved this hotel. Amazing shower - huge, with two cool shower heads. The bedroom and the shower have a glass wall in common. But for a curtain on that glass wall, the person in the shower would be visible to people in the bedroom. I, for one, cannot imagine why this would be desirable. Great location, very close to the bars/restaurants on Rue Crescent. There wasn't much of a breakfast, just machine-dispensed espresso and some pastries. Very comfortable beds. Strong air conditioner. Our king suite had a nice little sitting area, and a nice window seat with a long couch. I booked this hotel last-minute, and when I was searching for a reasonably priced room I was getting discouraged by the high prices of the major chains in town. This hotel was considerably cheaper, so I took a chance. It was so nice! Better than most Marriott/Hilton rooms I've been in. So bottom line, this place is cheaper and nicer than the major chains. I guess I could've made that clearer at the beginning of this paragraph but hey I'm not being paid to write this review. If I was, I'd take the grammar and paragraph structure a little more seriously. Thanks for reading.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Trendy and clean hotel near downtown”", "Author": "SexiBexxi", "ReviewID": "UR109959397", "Content": "Three friends and I stayed in a two-bed room one night after deciding to make a road trip to Montreal from Ottawa. It was a little hard to find and we ended up driving around the block a couple times before we spotted it. All in all, we were very pleased with the location and cleanliness of the hotel. Our room was spotless, the fixtures were all new, trendy and modern, and the bathroom was spacious and had a gigantic shower. The only thing our room was missing was a fridge to keep our drinks cold. Other than that, the service was great, staff were polite, and it was a fairly quiet place to (finally) go to sleep. Our third floor window didn't actually look outside - rather, it looked down to the floor below, which was kind of odd, but given the hotel's small size, it was understandable. It was also very bright, so don't plan on sleeping in too late! All in all we were pleased with our stay and we would book it again. There is a parking lot right around the corner from the hotel - the hotel itself had an agreement with a parking lot further away but we opted for the closer lot. It was only $20 for the night.", "Date": "May 26, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New York City, New York", "Title": "“Great location, funky space”", "Author": "beth1966", "ReviewID": "UR109888334", "Content": "A fun and pleasant hotel right in downtown, just 2 blocks from the Green Line of the Metro and across the street from a Bixi bike rental station. There's also a fantastic chocolate shop around the corner and M Burger, which makes delicious fries. And you can walk to the \"mountain\" and to almost anywhere you want to be in downtown. Style at Chez Swann sometimes trumped substance. There's a glass wall separating the double shower from the bedroom area, allowing you to watch your partner or companion. There are curtains if you choose not to watch. I'd have preferred an old fasioned bathtub. Our room had no mirror, meaning any makeup application and checking of wardrobe must be done in the bathroom, where the one mirror was hung over a very wide sink. If you're a nearsighted woman and you get this room, be prepared to climb the sink to put on your mascara (It's really no big deal, just a little annoying). The fee includes croissants and espresso in the lobby each morning. The young staff is very nice but not always helpful. We learned over the weekend that they weren't always on top of things. For example, one of them sent us to the contemporary art museum - which is a 15 minute walk - instead of to the Museum of Fine Arts (which is around the corner!). Just ask for a map and check anything twice. They said the hotel is new so maybe they're still getting up to speed.", "Date": "May 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "toronto", "Title": "“beware or room 207 suite”", "Author": "billycomics", "ReviewID": "UR109834848", "Content": "I recently stayed at chez swann with my wife. I figured i would pay up a bit and book a suite for a special occassion. When I arrived in the suite i founds that the restaurant speaker from the floor below (I was in room 207) was materially audible in the room. When I checked with the front desk the clerk advised me that there was no other room. I asked the front desk to check with the offsite manger and find a better solution. The front desk fully admitted that this was an ongoing problem with the room and several had complained in the past. When the front desk called me back they magically had found another \"suite\"(room 308). When I entered the suite I found it to be materially smaller (like 60% of the size) and inferior (queen instead of a king bed/ 1 tv instead of 2 in the other room) . I reminded the hotel that I had paid more the suite than other nice hotel rooms in the area (W, Le Germaine, Sofitel) and that the downgraded room deserved some special consideration (ie a rebate or coupon for future stay, something ...). The hotel clerk stated he would check with the off site manager who, in turn, stated I could have the unreasonalby noisey room or stick with the small \"suite\". I called expedia who also got the same response. This hotel manager could have easily alleviated the situation by trying to be reasonable. Instead he chose to take a hard line, leaving me with the feeling i was taken advantage of. I paid the full suite price for basically a slightly nicer standard room. The room I ended up with did not match the picture online at expedia as well. Next time I would choose to stay at other hotels in the area that offer much better service.", "Date": "May 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Ottawa", "Title": "“Loved it. Love Trip Advisor!”", "Author": "Chula_Banana", "ReviewID": "UR104545254", "Content": "Booked this despite having doubts based on the photos that it might be sleazy and over the top. Decided to trust Trip Advisor reviewers. Healthy doses of clean modern class made it very \"boudoir\", but not at all \"bordello\". Had a GREAT evening in our room relaxing with some wine from the SAQ bought around the corner lounging in bathrobes and slippers after a sweet shower. Hotel bathrobes are almost always bleach-hard but these somehow managed to stay soft and smelled like lavender. Breakfast was only coffee and pastries, but good-quality coffee and oversized, flaky, buttery croissants instead of banquet-hall quality stuff. Hotel is small without many of the usual trappings but service was polished, the hotel was chic, sparkling clean and very much a delight. I'm not sure how well this hotel will age, so enjoy it now while it is still fresh!", "Date": "April 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brattleboro, Vermont", "Title": "“Great hotel, great value, will stay again!”", "Author": "ZeldaBoro", "ReviewID": "UR104414122", "Content": "We loved our anniversary stay at the Hotel Chez Swann. We had checked out TA before booking, and knew about the lovely, albeit very subtle entrance. When we telephoned ahead we were told by the CS staff about parking so arrival was smooth. Also, when my husband phoned and mentioned that we were travelling for a special occasion, they gave us an upgrade from a queen bed to a king - never expected, and always lovely when it happens! Our room, #301, was spotless, stylish and very romantic. The desk person on duty ( why did I not get the spelling of his name? Many apologies for completely misspelling this) Silva from Brazil made helpful suggestions when we asked about dinner. The Chez Swann is so well located, we never used our car. It was a great trip; we will definitely stay there when we return to Montreal. And the amazing double shower!!!", "Date": "April 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Loved it”", "Author": "fashioista", "ReviewID": "UR102792316", "Content": "Being a seasoned traveler, I was in Montreal on business as I work in the beauty indsutry and had my whole team with me. We were first greated with such professionalism and with a great attitude. The manager came highlt recommended from colleagues who had stayed the Chez swan in feb. Mr. Newton was all smiles, very pro and very helpful. We needed much supplies for our work and he was more than helpful coming up with information and making arrangements. The rooms are gorgeous!! So gorgeous that we ended up having a photoshoot inside the room. So clean, so classy. The hotle has such a unique vibe, it is very artistic, ver relaxing and you just wanted to stay there for another week. The hotel is strategically placed right in the heart of beautiful Montreal. Next Montreal visit we will surely come back. Sucj=h a pretty and fun hotel. I can't emphasize on the vibe and treatment we recieved. I wou;d recommend it to all.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, Canada", "Title": "“Amazing! Fabulous! Parfait!”", "Author": "littlelewisdog", "ReviewID": "UR100892850", "Content": "This hotel was by far the best value and comfort for a solo traveler! The room was gorgeous, clean, and well-equipped (the shower especially was worth the price of the room!) The staff gave me a free upgrade upon arrival - as they gave others as well, which I learned from some eavesdropping! The staff were gracious, friendly, and extremely helpful! They made a tremendous effort to meet my needs and answer questions. Even the cleaning staff were polite and friendly, asking if I was enjoying my stay and if there was anything the room needed! The location was two blocks from Station Peel of the Metro, steps from the Cours Mont-Royal (entrance to the underground city) and within walking distance of many big tourist attractions - Musee des Beaux Arts, Basilisques, etc. I will book this hotel again in a heartbeat!", "Date": "March 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bethlehem, Pennsylvania", "Title": "“The Sexiest Chic Boutique Hotel in Montreal”", "Author": "BethBPR", "ReviewID": "UR98687776", "Content": "Hip, trendy, sexy decor...spacious rooms, and an amazing double-shower! In Montreal for a very special occasion and my stay at Hotel Chez Swann made it even MORE spectacular! Wonderful staff, perfect Continental breakfast every morning...nothing negative to say AT ALL! It was a lovely experience all the way around and I hope to stay here again soon.", "Date": "March 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ontario", "Title": "“Funky decor, great value”", "Author": "SkwidMan", "ReviewID": "UR97423839", "Content": "The decor was trendy, see the hotel's photos to get a glimpse. Great location and value for the dollar. Room was quite comfortable, spotless, and had a skylight that let in loads of daylight. Could have used a sofa in the room, there was plenty of room for it. Staff was excellent, especially Marie-AndrÃ©, and the gentleman at the from desk at 1am who brought us a bucket of ice and seemed shocked to get a tip for this! Negatives: as somebody else commented, my wife would have liked a full length mirror, and some of the typical amenities were not in the room: hair dryer (available from the front desk), coffee maker, etc. On the other hand, if you are in downtown Montreal, why are you having coffee in your room?", "Date": "February 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“perfect for couples”", "Author": "rapher", "ReviewID": "UR97222722", "Content": "We were in 304, it was our valentines get away. Loved the service, staff was very polite. The place was very clean, the decor is just superb, different but very nice. We loved the double shower.", "Date": "February 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“A genuine 4 Star General”", "Author": "spacetravel07", "ReviewID": "UR95763027", "Content": "My husband and I stayed for 5 days in this wonderful hotel. Very clean, I mean S P O T L E S S to a point where we decided to let our shoes outside the room. The room # 308 was perfect for us, fitted with all the amenities one would need in a hotel. The decor outside the norm of any expectations like for example the shower wall made out of glass overlooking directly inside the room where a table made out of a tree-trunk added a touch of art to the main room. The towels and the bathroom robes were thick and so wonderful to have. The breakfast was simple, but \"sweet\" arranged in the lobby as the cafe is still under construction, nevertheless enjoyed it. The staff, like Richard the \"the room service Lion\" and Dwayne, the associate manager and others were very friendly and very professional, a true rare species nowadays. Finally, the central location of the hotel made our stay in Montreal a true delight as Saint Catherine street was a block away.", "Date": "February 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Loved Chez Swann”", "Author": "hello031", "ReviewID": "UR87800646", "Content": "Definitely enjoyed my stay at Chez Swann. Everything feels brand new and sparkling clean. The funky decor is consistent throughout and added a little extra enjoyment to my stay, as opposed to some standard brand hotel. The pastries and espresso for breakfast are top quality and in my opinion eliminate the need to find breakfast elsewhere. And the staff were always friendly and helpful. Overall, Chez Swann is a great value, conveniently located, clean, and very quiet. Oh, and the free wireless internet is actually reliable!", "Date": "November 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great little hotel with alot of potential”", "Author": "1boutiquebabe", "ReviewID": "UR87298014", "Content": "Booked at Chez Swann on a last minute trip to Montreal. I was enticed by the fantastic location and good value [$125.00 Cdn B &B]. The hotel is brand new and just getting on it's feet. The rooms are fresh and trendy and very comfortable. The staff is friendly and accomodating and the hotel is spotless. The hotel does not have a formal restaurant or bar but it is right in the middle of downtown Montreal which gives one plenty of choice, but it would be nice to have a coffee maker in the room just to wake you up before you leave your room. Breakfast is served in the lobby and you can take it up to your room. There is a choice of very good pastries and expresso. On the whole I would definitely stay again but if you are looking for all the amenities offered in the bigger hotels then this would not be my choice. If you want something more intimate and cozy then this is highly recommended.", "Date": "November 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Laconia, New Hampshire", "Title": "“fulfilled our expectations and added to overall enjoyment of Montreal”", "Author": "goodfind", "ReviewID": "UR87081650", "Content": "We would return on our next visit but would like offer some constructive critisism. We brought a nice bottle of champagne and couldn't find any ice to chill it off?? The staff was great, the beds were very comfortable. My wife would have liked a full length mirror. The lobby had a funky odor?? Maybe the mop head needs to be changed. I've offen used these reviews and felt this deserved a good review.", "Date": "November 14, 2010"}], "HotelInfo": {"Name": "Hotel Chez Swann", "HotelURL": "/ShowUserReviews-g155032-d1910532-Reviews-Hotel_Chez_Swann-Montreal_Quebec.html", "Price": "$177 - $280*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1444 rue Drummond</span>, <span class=\"locality\"><span property=\"v:locality\">Montreal</span>, <span property=\"v:region\">Quebec</span> <span property=\"v:postal-code\">H3G 1V9</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span></span></address>", "HotelID": "1910532", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/df/46/df464338f739e317063621f6568ade971large.jpg"}}