{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Good choice!”", "Author": "Maija67", "ReviewID": "UR127855238", "Content": "In a beautiful old area of Rome with very narrow streets and close to the wonderful Piazza Navona. Room was not superb but nice. And very quiet, though we were facing the street and on the 2nd floor. Staff at the reception desk was very helpful and friendly and they spoke good English. The breakfast room on the top was exceptionally beautiful, and excellent Italian coffee was made by a lovely lady. The closest restaurant is only 2-3 metres from the front door and in 100 metres there are several. Also very close to the hotel is a small bakery open 24 h/day! A barber's shop is opposite the hotel, if you need a quick hair-cut.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Houston, Texas, United States", "Title": "“Perfect for our family trip to Rome”", "Author": "Jennifer M", "ReviewID": "UR126506772", "Content": "Pros: - Great location (we easily walked to Vatican, Piazza Navona, Colloseum, Spanish Steps). - Quiet room with ample space for our family of 4. We stayed in a suite and it was just the right size, and nice to have a separate space from the kids. - Good breakfast and rooftop patio is lovely; indoor area as well as outdoor. - The staff were very friendly and helpful. They had good recommendations for restaurants nearby. Cons: - Bed and pillows were not the most comfortable", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "anaheim", "Title": "“GREAT location! Wonderful hotel!”", "Author": "katie s", "ReviewID": "UR121900715", "Content": "We stayed here on our honeymoon and loved it! The location is fantastic! Just a few blocks from Piazza Navona, great shopping, cute restaurants, cafes, etc. I felt like we were staying in a real Roman neighborhood, not a tourist trap. The lobby is clean, classy and the front desk staff helped us with anything we needed. Breakfast was good and the staff was nice. The rooms were semi small (typical European size), but clean and comfortable. You can't beat the location! Everywhere you turn this is another adorable restaurant or shop. We will stay here on our next trip to Rome! The hotel just sent us a Christmas Card!", "Date": "December 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Small but perfectly located”", "Author": "BlueskiesN16", "ReviewID": "UR121257929", "Content": "Second time that I've stayed here and its location, and the breakfast room, make the difference. It's off the tourist drag in a narrow street but you are only minutes from all the main sites. We had two truly excellent meals within two minutes of the hotel, which adds to its allure. Inside the staff are helpful, the rooms are quite small but the shower was excellent and the breakfast more than adequate. Good value but its position makes it hard to beat.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "massachusetts", "Title": "“A hidden gem in Roma!”", "Author": "artguru", "ReviewID": "UR120901977", "Content": "This hotel satisfied my need for a Rome-fix. My sister (a first-time traveler to Europe) and I had just a short afternoon & evening in Rome, but our stay here was exceptional. The location is superb. Desk staff was helpful, our room was quiet, the bathroom was modern and clean. I love ancient buildings and this one fit the bill nicely. Will definitely consider staying here next time around!", "Date": "November 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Illinois", "Title": "“A Disappointing Return”", "Author": "prink_123", "ReviewID": "UR120204186", "Content": "I was looking forward to returning to the Portoghesi. I stayed there in 2005 and found the location to be superb and the rooms small but adequate. My mid October 2011 stay was very disappointing. The rooms are badly in need of decorating, for example, fresh paint and new bed linens. They are, as another reviewer said, depressing. Worst of all, there was a horrible smell coming from the shower drain. This problem has been mentioned by other reviewers, which seems to indicate that is is something the hotel is unable or unwilling to correct. My rating for the Portoghesi would have been \"poor,\" but the location does, indeed, remain superb, and hotel staff were very helpful.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vacaville, California", "Title": "“Great Location!!”", "Author": "Vacagirlie", "ReviewID": "UR119844069", "Content": "We have stayed at the Portoghesi 3 years in a row for 2 nights each stay. The location is fabulous, in a great neighborhood with lots of shops, restaurants and cafes as well as being very centrally located to all sites. We have always had great service from Marco & Claudio, the owners, as well as David. They have always been kind and helpful to us. The breakfast garden is lovely and the server is a very nice gal. The hotel is not fancy but clean and comfortable, very, very European!! Make sure to pay the extra $ to get a junior suite, room 26 or 44 as they have nice all tile bathrooms and are larger. I would not book the hotel for a honeymoon but it is fine for other travellers.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Great location; depressing rooms; rude desk clerk”", "Author": "aemlovesnegril", "ReviewID": "UR119254962", "Content": "The Good: My husband and I spent the last three nights of our honeymoon at this hotel. Breakfast was adequate and we enjoyed the roof deck. The young woman who managed the breakfast room did a great job. The location was fabulous; we walked to all the major sights. Our room was quiet and we slept well. I give this hotel three stars because of its location but I do not recommend this hotel to honeymooners. It is fine for people who want to stay in the center of Rome for cheap but it's not worth even the 200E a night. The Bad: Upon arrival, the young man at the front desk was cold, disinterested and unwelcoming. Our room was by far the worst of our honeymoon; small, dark, lacked a safe and the toilet did not flush. On our way to lunch, we told the desk clerk about the toilet; when we returned, he said he had fixed the toilet. Our toilet still did not flush. I called the front desk several times; no answer. I went downstairs to inquire about the toilet and the clerk told me with a smirk that there was nothing he could do about the toilet; he would call a plumber in the morning and we’d have to deal with it until then. I asked if we could move to a room with a working toilet and perhaps a safe. He said that no rooms had safes and no rooms were available. I told him that I was on my honeymoon and refused to accept a room without a working toilet. This young man was sarcastic, snippy, rude, sighing, rolling his eyes... He finally told us we could move to the special room for one night but we would have to move again in the morning. We lugged our bags up to the fourth floor and within minutes he called to say we had to move again. He has “suddenly” found us another room with a working toilet and a safe too. The walls of the new room were covered in orange velour and the curtains were orange too but at least the room was slightly less dark and depressing than the first room. I would like to note that the young desk clerk was the rudest person I have EVER come across in a hotel – the older gentlemen who also worked the desk were pleasant enough. Also, the marble stairs in the hotel are very slippery and I slipped and hurt my forearm. Use caution on the stairs!", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Burlingame, California", "Title": "“Traditional hotel in great location near Piazza Navona”", "Author": "PepperRoss", "ReviewID": "UR119199458", "Content": "We spent 5 nights at this lovely hotel in early October. It was a welcome relief from the crowds of Rome although it is only about 2 blocks from the Piazza Navona. We had a quiet room in the back. Although it was not large, it was very comfortable with nice furniture and an immaculately clean tile bathroom. It would have been nice to have room for 2 chairs (instead of just 1) so that we didn’t have to sit on the bed all the time. Our room had individually controlled AC which was very welcome since it was in the mid 80’s while we were there. We loved the power awning control – hadn’t seen that anywhere before. The room rate includes a generous buffet breakfast on the top floor with a great view of the roof tops of Rome. You could eat inside or outside. The staff at the front desk was efficient and helpful. They helped us locate a shop that we had read about on a block-long street, arranged for a car to take us to the airport and gave us lots of restaurant suggestions. We found the internet charges to be quite reasonable – one euro for 30 minutes. After all, who wants to spend all their time in Rome on the internet? Great hotel in a great location. Would definitely stay there again.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Perfect location and beautiful breakfast room”", "Author": "Pottios", "ReviewID": "UR118548545", "Content": "We were introduced to the Portoghesi by friends, and have stayed there 4 times over the past 20 years. It has greatly upgraded itself in that time, but its most endearing feature - the roof-top, glass enclosed breakfast room/roof garden - is unchanged and a lovely way to begin the day. The rooms in the back of the house are quieter, but generally smaller, than the rooms in the front. The location is unbeatable - an easy walk to the Piazza Navona, or the Pantheon, or Giolitti, or three fabulous Caravaggios at San Luigi dei Francesi. Just down the street is Orso 80, a wonderful place for a long, delicious italian meal. We look forward to our return!", "Date": "September 24, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "san francisco", "Title": "“Fantastic location - helpful front desk staff”", "Author": "szullo", "ReviewID": "UR118130567", "Content": "We stayed here for three nights and it was great. Walked to the Colosseum (about 30 mins away), the Vatican, Trevi Fountain, Spanish Steps, Piazza Navona... you name it. Can't beat the location! The staff was courteous and spoke English well - they gave great restaurant recommendations and made the reservations for us, no problem. They also arranged a private car to the airport for us (45 Euro, about the same as a taxi, but our car was immaculate, on time, and the driver a pleasure to ride with). Breakfast was fine, nothing spectacular, but the rooftop deck certainly made up for any lack of culinary magic. Bathroom & room were small, but typical for European hotels. Very clean. Only drawback: no free wi-fi, had to pay for internet access/computer use. But would definitely stay here again. The neighborhood/location were fantastic.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Akron, OH", "Title": "“Eat, Pray, Love”", "Author": "MXDeCapua", "ReviewID": "UR115984072", "Content": "If you have seen the movie Eat, Pray, Love you may have seen Hotel Portoghesi when Julia Roberts approached her residence in Rome, The Barbieri. This hotel was also featured in Cheap Sleeps in Italy and while no longer so cheap, it is a wonderful 'off of the beaten path' hotel that is perfectly located for many of the great destinations of Rome. The rooms are typically Roman small, but nicely appointed and very clean. Perfectly located near Piazza Novonna, Campo di Fiori and the Vatican. At the end of your day pick up a bottle of wine (or two) and head up to the roof top garden for your own picturesque 'happy hour'. So Roman, so wonderful. Don't miss checking out the church next door. An unexpected jewel most tourists never see. I have stayed at Hotel Portoghesi several times, sent many friends here too, I've always been extraordinarily satisfied, as have my friends.", "Date": "July 29, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Atlanta, Ga", "Title": "“Great location near Piazza Navona great rooftop breakfast area”", "Author": "Msaly1", "ReviewID": "UR115930704", "Content": "My daughter and I stayed here in a junior suite. It was large by European standards with a large bathroom. The hotel personnel, especially the front desk are unhelpful (sometimes rude) but we rarely needed and consequently did not use them. Breakfast is better than any other *** hotel we had in Italy other than **** Hotel Londra in Venice. Wait staff efficient. The room rate is high for the quality of this hotel but is worth it for the charming neighborhood it is in and the convenient location", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“A quiet location in the heart of historic Rome”", "Author": "shri420", "ReviewID": "UR115863367", "Content": "We have stayed at the Portoghesi on two previous visits and were happy we had the chance to spend another three nights there on our departure from Italy. Most of the reviews have pretty well summed up the situation--nice rooms that are, mostly, not huge, but well appointed. A location that permits a leisurely walk of say 8 minutes to Piazza Navona or the Pantheon; walkable to the Vatican, and Castel San Angelo, and fairly close to some important bus lines. The street is narrow and quiet for the most part--horn honking has really diminished in Rome over the past ten years. There are adequate restaurants nearby and some very fine ones as well. The Portuguese national church is next door and is a gem. Watch for concerts and recitals there--very interesting mixes of traditional and modern classical music. The included breakfast is served on the top floor which includes an open air area in nice weather. The food selection is fine and the only point to be made is to know that toward the end of the service hours food is not replenished and the door is shut on the dot of closing. There are a few points which will not cause concern for most visitors, but it should be noted that while there is an elevator, it is reached by walking up two steps from the lobby. Also, it does NOT give access to the breakfast room, and that involves climbing a flight of stairs. As someone who occasionally has mobility issues, I think this could be significant for some folks. The staff are, for the most part, friendly and helpful. There are lockable safes in the room. Internet is available on a computer in the lobby--for which I think there is a charge. I had my own laptop and paid a fee for access. It is sold on basis of set number of hours and can be carried over from day to day. As in many Italilan hotels, the AC is centrally controlled or the thermostats are not offering much discretion. The weather was ok while we were there and we were able to keep our room comfortable, but I suspect during a hot spell, that the cooling is relative only to what is going on outside. But, if you want cool, come to Seattle! We think the Portoghesi is a great hotel for visitors who are familiar with Rome, but not a bad 'first stop on first visit\" place either. It does not boast luxuries, but offers comfort, quiet and convenience. One overall tip--at least this past June, regular taxis offered a set rate to the FCO airport of, I think, 40 Euros--to which we added a 10 Euro trip for an especially fine driver whom we had engaged before. The hotel will set up a car to the airport, but I seem to recall that their charge was 60 Euros.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Carlisle, Massachusetts", "Title": "“Great hotel in perfect location”", "Author": "CHL44", "ReviewID": "UR115589858", "Content": "We stayed here at the beginning and end of our Italy vacation for a total of 5 nights. The rooms were clean, continental breakkfast was good, and the location was outstanding. Walking distance to many of Rome's sights, in a quaint area close to restaurants and shopping. The staff was friendly and helpful. Highly recommended.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "", "Title": "“Awesome location, pretty good hotel.”", "Author": "Jerry-enjoys", "ReviewID": "UR113280466", "Content": "I was warned that the hotel was great location wise but not splendid. When we arrived we witnessed a teenager throwing a tantrum because she didn't like the hotel. Would go back but would share a few things. Pros 1) Nice and helpful staff 2) Breakfast was pretty good for a continental spread, good coffee, and good service. 3) Location is spectacular. We could walk everywhere. Vatican, Trevi fountain, etc are an easy walk. Amazing food within 2-10 minute walk. Cons 1) Charging for internet is poor form and they do it (though it is cheap) 2) I could not turn in the shower with out hitting the controls. 3) Honeymoon request for one bed, ended up with two twins that were always pulled a part by cleaning staff.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "North Queensland", "Title": "“Great location, comfortable hotel”", "Author": "MissMNorthQueensland", "ReviewID": "UR110057380", "Content": "We stayed here for 4 nights as the last destination of our month in Italy. The location is great, near Piazza Navone, the Pantheon and the river. We walked everywhere from here. There was no need for taxis or buses as it is very central. The rooms are quite plush, reasonable size and although the bathroom is small it is fine. The breakfast on the rooftop is a nice extra and a lovely way to start the day. Would definitely return.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Central location makes the simple room reasonable”", "Author": "ATW123", "ReviewID": "UR103841242", "Content": "The location of this hotel is virtually perfect. A 20-30 min walk to the Vatican and the same for the Colosseum. Felt very safe and close to the Piazza Navona. The room was a bit small and simple in its decor including a small tv that looked like it was a computer screen. Shower was small and may be a challenge for a larger person. Breakfast was okay. The service however made up for all these small items. Giuseppe recommended the best coffee shops and restaurants, and everyone at the front desk was more than hospitable. Overall the location and service more than made up for the other items. I would stay there again.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bangor, United Kingdom", "Title": "“Location, Location, Location”", "Author": "StephenLansdown", "ReviewID": "UR102672519", "Content": "Don't be put off by bad reviews: it's lovely. If you want a base for exploring Rome on foot, and Rome can be explored on foot, then Hotel Portoghesi is ideal. It's not huge (only 27 rooms) and it's 3 Stars but it's well appointed with quality furniture and fittings,absolutely clean, quiet and comfortable. The staff are friendly, English-speaking and efficient. Breakfast is plentiful but lacks fresh fruit and wholemeal bread, otherwise fine. The bathroom is perfectly adequate, the shower excellent. The area (Centro Historico) is a maze of narrow winding streets which are a delight to wander, armed with the necessary detailed map. Round each corner is a piazza or a Baroque church or an excellent restaurant. Because it's so close to Parliament you see lots of important- looking men and women, and official cars. So the restaurants have to cater for a discerning crowd, and it shows: any restaurant near hotel Portoghesi will be top class. I'd return to this hotel tomorrow.", "Date": "April 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Excellent value in a great location in Rome”", "Author": "rar1960", "ReviewID": "UR98816825", "Content": "My sister had stayed here and recommended the place. It turned out to be perfect for us. We stayed 5 nights, and it was very well located to everything in Rome. We rarely if ever had to take a cab to reach any destination, from Vatican City to the north, to the Coliseum or Trastevere, or the Spanish Steps. The staff was helpful and polite. The lobby and rooms are not flashy or particularly lavish, but they are clean and comfortable. By European standards, the room and bathroom were adequately sized. Bottom line is that the hotel served as an excellent base for walking everywhere in Rome, and was comfortable and affordable. A winning combination.", "Date": "March 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "L'Orignal, ON", "Title": "“A little gem in the heart of Rome”", "Author": "nortonoma", "ReviewID": "UR94595689", "Content": "My friend and I stayed for 6 days at this small (27 rooms) hotel right in the heart of Rome. It was a joy. Although the rooms were a bit small, the comfort, the service, the cleanliness was excellent. The price included breakfast, which was buffet style and there should be something for everybody's taste. Not over the top, but certainly enough to please. The staff was very friendly and always ready to fulfill all our wishes. They have a computer for guests' use at a small cost. We were able to walk to all major attractions and never had to use public transportation to go anywhere. Excellent restaurants close by. Both of us would certainly go back in a heartbeat.", "Date": "January 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ann Arbor, Michigan", "Title": "“Always a pleasure to stay here”", "Author": "barbgoodkin", "ReviewID": "UR84118223", "Content": "I've stayed at Portoghesi a half dozen times. The staff is friendly and accommodating and the breakfast is more than adequate. Yes, the shower is small, but its not any different from any other 3 star hotels in Europe. Having a newspaper in English was a nice enhancement. The rooftop breakfast room is charming and if the weather is good it is fun to see all the sights from there. Being able to access their airport car service is also most welcome. I plan to stay there again next year when I return to Rome. I need to thank my niece for recommending the hotel to me when I first came to Rome in 2003.", "Date": "October 19, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Brooklyn, New York", "Title": "“little more than a good location”", "Author": "CobbleHillCouple", "ReviewID": "UR81127570", "Content": "Small room, teeny shower - you'll find getting into the shower a very tight squeeze, even if you are fit and slim. at 200 euros, annoying to have to pay for wi fi. TV had very few channels and poor reception. the \"double\" bed, two singles put together, separated every time you moved. Breakfast was mostly german packaged goods, the worst breakfast of any hotel we stayed at in two weeks in Italy.", "Date": "September 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Newton, Massachusetts", "Title": "“Great Location, nothing fancy but helpful staff and very nice.”", "Author": "Karen55_10", "ReviewID": "UR71153258", "Content": "The location of this small hotel, just a few blocks from Piazza Navona, makes this a real find. Combined with the helpful staff (who will call places and make reservations for you in Italian) and the clean, quiet rooms-it's a gem in a big city. In a city with a lot of walking you will appreciate the location (for the price) of this little hotel.", "Date": "July 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Orlando", "Title": "“All we needed”", "Author": "TrippleTime", "ReviewID": "UR69113134", "Content": "We just returned from Rome on the 25th of May. I can recommend the Hotel Portoghesi which is about 2 blocks from the north end of Piazza Navona. The hotel is on one of the many narrow side streets and it was very nice. The room we had was on the 4th floor with a short walk up to the breakfast area on the 5th. The windows were double-paned and blocked out any late-night street noise and the external shutters made the room perfectly dark for sleeping. The bath was brand new and well appointed. The TV has about a dozen channels including a few international ones (English). If you want room service or other such on-site amenities, perhaps a different hotel would suit you better. But we spend most of the day walking around Rome so breakfast is all we really needed. As with most centrally located hotels in Rome, the elevator is just big enough for 2 people and 2 suitcases – barely. Think phone booth and you get the picture. It did break down one day so the walk up was not fun after spending most of the day on our feet. The front desk personnel were very professional and helpful (in English). Wi-Fi is available for €2 for 60 minutes with laptops in a first floor sitting area (you get a logon/password account that you can use intermittently until the €2 is used up). Very good restaurants surround the hotel (we personally didn’t like Orso 80 just down the street) so we would walk to a restaurant then stroll around Piazza Navona afterward to enjoy the street performers and vendors. You can read my restaurant reviews on Trip Advisor – Rome. It took us under 20 minutes to walk to the Vatican and about five minutes to get to the Pantheon area. “So many great looking restaurants, so little time.” The taxi ride from the main train station to Hotel Portoghesi was €27 and took 20 minutes. We will definitely stay there again.", "Date": "June 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“absolutely our favorite”", "Author": "saipanlady", "ReviewID": "UR64971509", "Content": "Our 6 night visit overlapped with travell, but our experiences could not have been more different. We found the men working the desk enormously friendly and helpful. They gave us great advice on places close by at which to eat (Pietro's was one of our top 2 meals in 17 days in Italy). I emailed them a day before our arrival asking if we could leave our luggage about 9 AM and then return later when our room was ready. They replied 'of course'. But when we arrived they had moved us into the apartment (with tiny courtyard) since it could be ready for us...and at the price of our room. The neighborhood is charming and quiet, the people at the coffee shop 3 doors down talked with us every time we stopped in (which was at least once a day) and the little shops were terrific. We walked everywhere with this as our base, it being under 3 minutes to the Piazza Navona and perhaps 5 to the Pantheon. We sat upstairs on the terrace every night to have a glass or two of wine before heading out for the evening and usually had it to ourselves. The breakfast every morning was just fine, the coffe was great, the other guests all smiled at breakfast and we chatted with other English speakers (which was probably less than a quarter of the guests). The bathroom in our room (where we moved after the second night...or actually they did the moving, we just left everything in the apartment and they moved it all into our original room) was small, but so has been every bathroom in every hotel in which we have ever stayed in Europe. Linens were changed every day, the room was spotless. We just loved this hotel and thought at 200 Euros a night it was a terrific bargain in the heart of Rome, close to everything and staffed by people who made us feel welcomed and important.", "Date": "May 22, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London", "Title": "“Poor service, poor maintenance”", "Author": "travellerim", "ReviewID": "UR63897958", "Content": "The hotel decor is tired and depressing. The elevator broke down 3 times in two days, we were trapped inside once. The receptionist 's response when we came out was \"such things happen\". The t.v. didn't work and the bedroom door was hard to open. The hotel is poorly maintained and one receptionist is really rude. Breakfast is basic. The only positive thing about the place is its location, and it's really not worth it.", "Date": "May 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Vacaville, California", "Title": "“Fantastic location!”", "Author": "Vacagirlie", "ReviewID": "UR46929110", "Content": "We stayed in the apartment at the Portoghesi for two days. The apartment was large and comfortable with it's own entrance off an alley. We enjoyed everything about the hotel. The small breakfast on the roof top garden was nice and the staff was very helpful. The location is the best! We walked everywhere and felt very safe at night. We will stay here again next year when we return with friends. Just remember, this is Rome, not the USA. The hotels are smaller but the Portoghesi was comfortable and secure. And the location is fantastic!", "Date": "October 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Nottingham", "Title": "“What more could you want?”", "Author": "dnh2209", "ReviewID": "UR44740504", "Content": "I have read all the mixed reviews on this hotel, and had to chip in. Yes some of the rooms are small, we stayed in a junior suite complete with king sized bed. Good double glazing keeps street noise down The bathroom was large, clean and well appointed. The breakfast was more than adequate for both my wife how eats a little but needs coffee, and me who eats a lot and needs a cup of tea in the morning. The location is idea, no need for taxis, or buses. All the major sights are within 25 minutes walk. Top tip, use the shop 6 doors down the road, for water, cokes, beers sweets, snacks etc. Papa's bar just down the road is good for a lunchtime pannini, or an evening beer or wine", "Date": "September 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "San Francisco", "Title": "“Very Nice Hotel; Wonderful Location”", "Author": "Badger1949", "ReviewID": "UR34490458", "Content": "Just returned from a week long stay at Hotel Portoghesi. The staff was very kind and helpful (recommending restaurants, making reservations for dinners, calling cabs). The rooms in the hotel are clean, pleasant but a bit small in size. If you want more room and bigger bathrooms, book a junior suite (which is really not a suite, but a larger double room). Breakfast is served on the roof top. Limited choices, but adequate. The hotel is on a very quiet, quaint street, with many small shops on the same street or around the corner. There are many more shops in the surrounding area. The windows are double paned so no noise gets into the rooms. The location of the hotel is terrific. You are within walking distance of the Pantheon, the Vatican, the Colosseum, Piazza Navona, Piazza del Popolo and many, many lovely churches, including one right next door (don't miss it; its wonderful). There are probably 30 +restaurants within 5 blocks of the hotel, too. The hotel is a very good value and its location could not be better. Highly recommended.", "Date": "July 11, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Concord CA", "Title": "“Great location, not-so-nice staff”", "Author": "docjm", "ReviewID": "UR33757735", "Content": "We stayed at this hotel on a friend's recommendation, esp. for the location. I will never regret that- we were able to walk everywhere , from the Vatican to the Borghese gardens. It is literally a stone's throw away from the Pantheon and Piazza Navona. Breakfast on the rooftop garden was quiet pleasant. The noise factor wasn;t an issue with us- in fact, it was very quiet most of the time. The staff was another issue. One of them in particular was singularly rude every time I spoke to him- too many \"how-should-I-know\" shrugs of the shoulder, eye rolling and sighs. DIdn't really care for his attitude. Would I stay there again? Probably, just for the location. I would just steer clear of that one desk clerk. :)", "Date": "July 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Menomonee Falls, WI", "Title": "“Will definitely stay again at Hotel Portoghesi on our next visit”", "Author": "Jerry819", "ReviewID": "UR33002415", "Content": "My wife, and 2 children (son 20 and daughter 16) and I spent 5 wonderful nights at this charming hotel. We were in room 20 which had a room with a queen size bed for us and 2 singles (1 of which doubled as a couch) in another room. Plenty of closet space, great terrace for breakfast and a very friendly and helpful staff. Location was the best in Rome. Just a short walk from the Vatican, Piazza Navona, Pantheon and other great \"must see\" places in the center of Rome. We will return to Rome in 2011 and see no reason to stay anyplace else. This hotel was everything I hoped for and more. Please note that I am comparing this hotel with other hotels in Rome, and not trying to compare it to a luxury hotel in Chicago).", "Date": "June 23, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "uk", "Title": "“B&B in excellent location. Not a 3 star hotel”", "Author": "monkeyelf", "ReviewID": "UR32791366", "Content": "Just back from a stay here and felt compelled to write a review. We booked this hotel on the back of the many excellent reviews (\" favourite hotel in Rome etc\" ), and on the back of which we were left feeling disappointed. The key here is that this is not really a hotel in the UK understanding of the term. 100% factually what you get ( noting that we stayed in a double room - 2 twin beds - and not a suite ) is a smallish, but clean room, basic but has obviously been refurbished in the last few years. You get a decent breakfast on the roof terrace, and the staff are very friendly. If you want to be right in the thick of things then location is excellent, being literally 200 yards from top of piazza navona. That however is it. Once breakfast is over, then you can't as much as order a beer or a bottle of water ( there is no bar ), no fridge or coffee/tea making facilities in the room, and the roof terrace isn't high enough for a view so no point sitting there later on. If you are happy with this, and this is what you're looking for, then as said this is a perfectly adequate B&B in an excellent location. If however you're looking for a bit more then this won't be for you. Personally we would have preferred somewhere with a few more facilities, so that after walking about for hrs, it would be a pleasant place to spend a couple of hrs to relax, prior to heading out again. If we went back in the future, I think we'd stay in a larger hotel in Travestere with a pool, so that could have a bit of time chilling out at the start and end of the day. Taxis are plentiful and cheap, so staying 10mins out of the centro storico really wouldn't be a problem. So, nice B&B, but sure you could get similar facilites at something that called itself a \"B&B\" for a fraction of the price. Not really a 3 star hotel", "Date": "June 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Francisco, CA", "Title": "“Best hotel in rome with a reasonable price”", "Author": "mtovarp", "ReviewID": "UR32540670", "Content": "STAY IN THIS HOTEL !!! YOU WONT REGRET !! This hotel was great !! if you are going to rome i really recommend you to stay in this hotel. the hotel is very clean. the rooms are big and pretty. the prices are very reasonable for the quality service you get. the breakfast is above the average including fresh bread with jam and cheese, they also provide croissant with 2 types of juice among others. front desk employees and maid are very friendly. the hotel is very nice! its located in the heart of rome close to everything.", "Date": "June 17, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London", "Title": "“My favorite hotel in Rome”", "Author": "Brighton1939", "ReviewID": "UR30894335", "Content": "Hotel Portoghesi is in the centre of historic Rome,in one of the few quiet areas.The rooms are very clean and comfortable and there is always hot water.The breakfast room on the top floor provides an interesting and plentiful self service cold buffet or you can take yours onto the sunlit terrace and roof garden.The hotel has a lift.The staff are all friendly and efficient, most speak English.The hotel is one of the oldest in Rome (not that you would notice inside).It is very well kept and within easy walking distance of Piazza Navona,the Pantheon, the Corso and Tiberside walks.There are many excellent restaurants of all types,food shops and a lovely fruit and vegetable market.There are plenty of buses from Navona.To say it is four visit of my wife and myself says it all,BACK NEXT YEAR.", "Date": "May 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Charlotte, North Carolina", "Title": "“Charming and a Good Location”", "Author": "Shannon36", "ReviewID": "UR28342605", "Content": "This little hotel is on a lovely little street and within easy walking distance of many of the sights in the historic district. The rooms were spacious, and the bathroom modern and comfortable. Breakfast was upstairs in a roof top solarium, and was simple but delicious and filling. The service was good, but not terribly personable. I'd stay here again if I was specifically looking to stay in Centro Storico. Otherwise I'd look at a B&B near the Termini Station, as those tend to cost much less.", "Date": "April 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3"}, "AuthorLocation": "San Diego", "Title": "“We finally found a satisfying three star hotel!”", "Author": "LaCostaflower", "ReviewID": "UR22248981", "Content": "My husband and I visit Rome every year and always, forever hopeful, try a different hotel. In Rome, it's the \"agony or the ecstasy!\" Finding a comfortable hotel without spending a fortune is a major challenge, especially with the weakness of our dollar. So, when we found the Portoghesi, we decided that maybe we have finally found the right one, without breaking the bank. Granted, the first time, we booked a suite, and the second time, a junior suite, because I got the impression that the standard rooms are very small. We actually preferred the junior suite, which was of decent size and had a nice bathroom. A new flat-screen t.v. on the wall offered cable reception (more channels)including \"Everybody Hates Chris\" dubbed in Italian! The only thing I missed in the room was a safe. The location has been described by other guests of the hotel. The area is safe at night because there a very visible police presence due to the government buildings nearby. The highlight for us was our after-dinner walk to Piazza Navona to see the artists at work, or to the Pantheon, to enjoy the street scene. And, right next door, is gorgeous (what Roman church isn't?) St. Anthony, the national church of Portugal. It doesn't hurt that \"L'Orso 80\" is just down the cobblestone street...very fresh, well-prepared seafood. The Portoghesi is a comfortable, cosy three star hotel that pleased us more than some of the more expensive hotels we've tried in the past.", "Date": "November 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“great location and hotel”", "Author": "SEPLondon", "ReviewID": "UR19785304", "Content": "Great location and a pleasant hotel, better than expected. We stayed in room 38 which is perfect for families. There is a double room with ensuite and a sliding (solid) door which can be used as a sitting area but for us the hotel put in two single beds for our children. Air conditioning in both rooms, TV in double. No view but the hotel is so close to piazza novona and lovely cobbled streets. Quiet too, we didn't hear any noise from other rooms. Hotel staff were very friendly to us but I noticed they were less so to a rather loud and forceful American lady in front of us! There's a small roof top terrace for breakfast. Breakfast not very exciting but fairly typical for Italy. All in all a great start to our holiday and would definitely stay there again.", "Date": "September 5, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Boston", "Title": "“Charged me for a cancelled reservation”", "Author": "grifficl", "ReviewID": "UR18752395", "Content": "I made a reservation through this hotel's website and decided to cancel a couple of days later. The reservation site sends you a confirmation email with a link to manage your reservation going forward. I used this link to cancel the reservation. To make sure it was indeed cancelled, I clicked on the link again and it said that my reservation no longer existed. So I assumed I was in the clear. However, I returned from my trip to find a charge of $250 from the hotel on my Mastercard. The hotel representative was not helpful at all, saying I needed to provide them with the fax that I sent to cancel. Apparently, using the link in the email wasn't enough. I am disputing the card with the cc company, but most likely won't have any luck. Read all of the fine print to make sure you are aware of any actions you need to take.", "Date": "August 8, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "england", "Title": "“Loved this hotel”", "Author": "csbengland", "ReviewID": "UR17935736", "Content": "Just arrived back from staying at the Hotel Portoghesi which was perfect for our anniversary break. I selected this hotel since I was attracted by having breakfast on the roof terrace and this is really lovely in the morning and a great way to start the day. The hotel is small and our room was fairly standard but the bathroom looked new and was quite adequate for our needs and the amount of time spent at the hotel. The hotel is very central and perfect for travelling out in all directions. I would definitely recommend this hotel to others who want a centrally located and authentic Italian hotel", "Date": "July 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kansas City", "Title": "“A Wonderful Experience”", "Author": "Tarrier", "ReviewID": "UR17283080", "Content": "The Hotel Portoghesi was wonderful. A fantastic location, just a couple of minutes' walk from the north end of Piazza Navona. The hotel is beautifully appointed and very clean. Breakfast on the rooftop terrace was just what we needed to start our days. The staff was personable, pleasant, and very helpful. This is a small, boutique hotel so there's no grand lobby or restaurant, but to us, that's not the point of being in Rome anyway. My wife and two boys (12 and 15) shared the quad suite: very spacious for European standards and absolutely all we needed. My father-in-law had a single room, which was perfect for his needs. He's 79 years old, and was happy to see a working lift! I would stay here again in an instant.", "Date": "June 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“very satisfied”", "Author": "paci", "ReviewID": "UR15088708", "Content": "we stayed in the apartment.Four of us(Two children and two adults) Very spacious two large rooms and entrance hall.Huge bathroom very well furnished.Nice patio.Very quiet even with open french window doors.Location superb.Staff at reception very pleasent and helpfull.", "Date": "April 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Minneapolis", "Title": "“Loved the place”", "Author": "mstarnes", "ReviewID": "UR15034843", "Content": "My wife and 2 daughters spent 4 days here en route to Florence. David and the rest of the satff were more than helpful with everything that included an unfortunate run in with British Airways and the infamous terminal 5 luggage fiassco. The location is perfect, the beds were fine, our bathroom (#31) was very large, and we would not hesitate to stay there again. When you consider that you are a short walk from stuff that's been there 1000's of years it's amazing the place is so nice. Like when were they going to tear everything down so they could put in a theme park hotel? How could they get machines down those streets that barely held a smart car ? Multi Graczie dudes!", "Date": "April 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minnesota", "Title": "“Great Rome Location”", "Author": "getupango", "ReviewID": "UR14698430", "Content": "Hotel Portoghesi was recommended by a friend for its location in Rome, and we were not disappointed. It is just a short distance from Piazza Navona, but far enough to avoid the noise. It is located on a quiet, narrow street next to a small, but fantastic neighborhood church. This hotel is small, which adds to the feeling of being in Rome. You know that you are not at the Marriott. The hotel served as a perfect staging point for walking to the sites of Rome. We were within a short distance to the Vatican, Colliseum, Trevi Fountain and Pantheon. The Borghese gallery (a must see!) and Termini station were a bit of a haul, but allowed us to feel better about the gelato that we ate daily. We had a junior suite (#38) with 2 twin beds pushed together for my wife and me and a third twin bed in a small \"ante-room\" just inside the entrance for my daughter. We were all comfortable. The bathroom was adequate and clean. A small refrigerator and flat-screen TV were provided. Breakfast was included each day including a variety of fruit, yogurt, cereal, and pastries. It was nothing fancy but very adequate and probably saved us 20-30 euro per day. The breakfast service staff was delightful and always made our coffee drinks to order with a smile. The front desk staff was generally courteous although I would not go as far as to call them friendly. Rarely, they even seemed a bit burdened. However, we did get an excellent restaurant recommendation. If you go, do not miss L'Osteria de Memmo on via de Soldati, 22-23. This was a great restaurant. I would recommend the \"antipasto della casa\" to start, but it comes in about 15 different bowls with great variety. The primi plata of choice is the seafood pasta. The secundi was amazing: monkfish in tomato broth. We went back on our last night in Rome and they remembered us with special treatment: after dinner drinks and biscotti on the house.", "Date": "March 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco Bay Area", "Title": "“Hotel Portoghesi is molto bene!”", "Author": "Dr_SJ", "ReviewID": "UR14600173", "Content": "I add my endorsement of the location and the quiet street that other reviewers have made for the Hotel Portoghesi. I stayed there for six nights, enjoying the quiet of the side street that the window of my room (30) overlooked when I returned in the evenings. There were simple room amenities -- a television, a minuscule desk and chair, the single bed, a clothes closet and bureau, a shower with good water pressure and temperature -- and I liked the availability of two computers down the hall for which hotel guests could purchase Internet access. The staff in the charming rooftop breakfast room remembered which hot beverage I preferred after the first day and freshly brewed my capuccinos each morning. Within easy (5-15 minutes) walking distance are the Trevi Fountain, the Vatican and Vatican Museums, the Castel Sant' Angelo, the Gesu and St. Ignatius Churches -- it is in the historic district of Rome, and I was there during Holy Week. But the hotel readily calls taxis for its guests as well, such as I needed for an early flight home: they reserved one the night before, and the driver came early, so no worries there! As others noted, the Piazza Navona was close by for its restaurant choices and activities, but a few steps down the street is Orso 80, where I'd been told to order the antipasti and house red wine and nothing else. Nothing else was needed: the house antipasti was ample (grilled eggplant, tomato wedges, fried mozzarella balls, a fresh mozzarella ball, melon and proscuitto, meatballs, a bowl of warm cannellini beans in sauce, etc.), and the house red was smooth and fine. (David at the front desk said they're famous for their antipasti.) Nearby also is a mozzarrella bar, Obika, that David recommended; it has a contemporary feel and plays soft jazz. Within a few steps from the hotel is a wine store for purchasing grappa and limoncello for bringing home for gifts, well packaged for check-in luggage. I am more than satisfied with the recommendation that I had received for this hotel, and one of the locals commented when she heard I was staying there that it was a very nice hotel, so it is known there as well.", "Date": "March 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Perfect Location - Apartment and Hotel in One”", "Author": "LFaith", "ReviewID": "UR12387728", "Content": "We stayed in the hotel's apartment for five nights, and it was perfect for our family of four. With the exception of the pull-out couch not being a very comfortable bed (it didn't matter - late nights, plenty of wine - we slept well), it was a lovely way to be away. The hotel has an enclosed roof-top breakfast room for the cold weather, and the buffet was quite good. Though not effusive or elegant, the desk service is efficient and friendly. They were happy to call cabs, make dinner reservations, enquire about train schedules, etc. The location - close to the Piazza Navonna, in the heart of old Rome, with wonderful stores, restaurants, and character can't be beat!", "Date": "January 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Best Location Ever!”", "Author": "BijouxButtercup", "ReviewID": "UR12356370", "Content": "I just returned home after spending 8 days in Rome. The Hotel Portoghesi was incredibly well located. Just north of the Piazza Navonna, we literally walked to every site in Rome from this hotel, with no distance greater than 2 miles and most sites within 1 mile. Though in the center of the historic district, the hotel is on a very quiet street so there is no crowd noise, (even on New Year's Eve!). In addition there is not shortage of services within a block of the hotel. I travel a lot and I've never had a hotel so well located to everything I planned to do. The staff is friendly and helpful, the rooms are quite small but very clean and the prices are reasonable. A great value all around.", "Date": "January 5, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "NJ", "Title": "“Great location”", "Author": "shortiekp", "ReviewID": "UR12209231", "Content": "We loved the location of this hotel. the area was great for affordable restaurants, bakeries, small grocers and near several good restaurnats. DO not overlook the lovely chuch next door -- quite a treat! The piazzza Navona was nearby -- also fun to walk through. The rooms were servicable and some seemed to have been more recently refurbished. Just stay away from room 54 -- for the money(it was a suite) the comfort was not worth the price -- poor heater, and horrible shower-- not a single shelf in the bathroom to hold a bar of soap. But #38 (also a suite) was much nicer. The basic twin rooms were fine and small as to be expected. I recommend this hotel overall but do not expect much help from the front desk as all but one of the staff bordered on surly. That was the most disappointing aspect of this otherwise nice hotel. the breakfast was fine and the breakfast room was lovely.", "Date": "January 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Virginia, USA", "Title": "“Hotel Portoghesi - great location”", "Author": "Ramblingman27", "ReviewID": "UR10657145", "Content": "We stayed in the Tower Suite for four nights in October. It wasn't inexpensive but the rooftop patio really added to our comfort and enjoyment. The suite included good linens and a great shower. The AC performed well. The breakfast buffet has plenty of goodies, including excellent cakes, to fill you up for a day of sightseeing. As others have noted, Portoghesi's location is perfect. just off Piazza Navona. You can walk nearly everywhere from there, including the Vatican and the Borghese Gallery, the latter of which is not to be missed. Hotel staff were uniformly polite and helpful. Highly recommended.", "Date": "November 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NJZeke", "Title": "“Great Location and a GreatExperience”", "Author": "NJZeke", "ReviewID": "UR10035719", "Content": "The Hotel Portoghesi is perfectly located on an ancient road near the Piazza Navona and the Panteon. Short walk to St. Peters, St Angelo Castle. We walked everywhere, even to the forum, spanish steps etc. I was traveling with my parents and we rented the apartment owned by the hotel which is located on the side of the hotel. Our own key and apartment! The situation was ideal! Large bedroom, large bathroom, very comfortable fold out couch bed (mine). TVs in each sleeping rooms. Desk, table, refrig, small kitchenette! In the back there was even a small patio space which wasn't big on views but was very italian - nice for afternoon wine break! There was even a computer which we could use in the apartment for a small fee! The hotel provided the breakfast everyday on their roof terrace. After 3 stays in Rome (in 4 years), I think my family has found our home away from home. I can also recommend the Lagana Ristorante next door for a great meal! Enjoy!", "Date": "October 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Fabulous hotel, perfect location!”", "Author": "HockeyMumTO", "ReviewID": "UR8522789", "Content": "We stayed in the Hotel Portoghesi's apartment for three nights in July. The hotel was recommended by a colleague, and was fantastic!! The staff were prompt with e-mail replies when booking the hotel, and for all requests when we were there. The apartment has a separate entrance around the corner from the main entrance and was wonderful. There were two rooms for our family of 5 (2 adults, 2 teenagers and a pre-teen). There was a lovely patio, computer with reasonably priced internet, a fridge, small cooking area and a huge bathroom!! Our room was very quiet, spotless, and the A/C worked great. The rooftop breakfast room was lovely also, with a great selection. We can’t say enough about the location of the hotel. We walked to everywhere: Vatican, Colosseum, Spanish Steps, Trevi Fountain, etc. We loved that the Pantheon and Piazza Navona were very short walks away. We spent a lot of time in these Piazzas!! Overall, this was a fabulous experience, and we will definitely return there the next time we are in Rome!!", "Date": "August 28, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "washington, dc", "Title": "“Nice hotel, fabulous location”", "Author": "ebostic", "ReviewID": "UR8316159", "Content": "My brother and I took my mother to Italy for her 65th birthday. At the suggestion of a few friends I checked out the Hotel Portoghesi. I was not disappointed. The beds were a bit harder than I was accustomed to but other than that it was great. A simple breakfast in the roof sunroom was included in the room price. The people at the desk were delightful and very helpful. Our room had two windows, one facing another building and the other facign the street but when we had the windows open it wasn't noisy at all. From this location we were able to walk to many nearby places - the Vatican, Piazza Navona, Pantheon, Trevi Fountain. We even took long walks to the Borghesi Gallery and the Trastevere neighborhood. It's a bit expensive but absolutely worth the money. The only thing - its a small hotel with a fabulous location so I'd suggest making reservations as early as you can.", "Date": "August 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ann Arbor, Michigan", "Title": "“Love the location”", "Author": "barbgoodkin", "ReviewID": "UR8213366", "Content": "The management is friendly and the location is excellent if you like to walk around the old city center. Rooms are small but adequate. The shower is really tiny so if you are obese you might have a problem. The breakfast provides several choices.", "Date": "July 21, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "california", "Title": "“Splendid Hotel”", "Author": "tessaCalifornia", "ReviewID": "UR7976464", "Content": "This is an excellent property. Centrally located with polite employees. The room did not smell like cigarettes. It was quiet and the majority of the guests appeared to be older guests without children. They do not have services to help you book side trips or porters to help with luggage. There is only one employee at the desk. The continental breakfast rather simple. So this is perfect for quiet older travelers, probably not the noisy family that needs to feed teenagers lots of breakfast. I would definitely stay there again.", "Date": "June 24, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Great Location”", "Author": "D_and_LScotland", "ReviewID": "UR7973430", "Content": "A very nice hotel and in such an excellent location. The staff were very nice and helpful and the roof garden was great to escape from the hectic pace of the city. Decoration of the room could have been more modern but would recommend this hotel 100%.", "Date": "June 24, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“awesome location”", "Author": "setty", "ReviewID": "UR7960651", "Content": "My wife and I concluded our honeymoon with 4 nights at hotel Portoghesi in Rome. We had a Jr. Suite, which I would compare in size to a regular room in a mid-range American hotel. The room was very comfortable and immaculately clean. Also, prior to our arrival, I arranged to have Prosecco and flowers waiting in our room and the flower arrangement was nothing short of spectacular – in fact it was the largest we had ever seen and the cost was very reasonable - they ultimately charged me 20 Euros fewer than they had quoted me. (scored big points with the wife!). All in all, my wife and I agreed that this hotel was a great value for the money spent. We found the service to be very adequate, although we made very few requests of the staff. The location is absolutely perfect and with all the walking done by tourists in Rome, it’s crucial to have a centralized home base. If you’re looking for true luxury, this might not be the place for you, but for the money, the Jr. Suite was an absolute bargain and we’d stay there again and recommend it to our family and friends.", "Date": "June 22, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Great location, good price but...”", "Author": "NonUnTurista", "ReviewID": "UR7935799", "Content": "My group of 6 just stayed here for 5 nights. We enjoyed the location and the roof garden very much but when we checked out we all noticed that the credit card receipt had a total in Euros and U.S.Dollars. We each insisted that we be billed in Euros, which they assured us, was the case. After checking our credit card statements we all found the amount had been exchanged by the hotel with a higher rate than MasterCard would have given us. This cost us approximately $40 more for each of our 3 rooms. Maybe their staff does not realize that the rate they are using is higher or maybe they do??", "Date": "June 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "san miguel de allende", "Title": "“great location, but.....”", "Author": "la4tuna", "ReviewID": "UR7827864", "Content": "this small hotel is in a fabulous location but the double room with two beds, shared with my sister, was tiny. there was barely space to move. the bedroom was huge compared to the mimiscule bathroom. there was a tiny shower stall, i mean so small a large man couldn't turn around and i couldn't raise my legs to shave them. breakfast was a bit of a disappointment. no fresh juice or fruit, just canned. nice bread but basic. i would not choose this hotel again.", "Date": "June 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bedfordshire", "Title": "“Second visit, better than ever!”", "Author": "GeorgeB1", "ReviewID": "UR7771412", "Content": "We visited Hotel Portoghesi in late May, some 5 years after our first visit, and enjoyed it even more. We'd had problems with the arrangements for our visit, (travelling friends cancelled through illness, air traffic controller disputes), but the staff were extremely flexible and accomodating. Rome was experiencing an early hot spell, and the air conditioning in our (small, standard double) room was a blessed relief. No need to repeat praise for the location, breakfast, helpful staff. ( but also St. Peter's Square and the Vatican Museums are both 15/20 min walk) Good restaurants within 2/15 mins. We enjoyed Tre Archi, Antica Taverna, and Hostaria Orso 80 ( a few doors along from he hotel ; beware antipasto misto della casa, one portion beteen two is more than sufficient!) On a general point, the Vatican Museums opening hours this year start at 10.00am ( not 8.30). We arrived at about 10.00 and joined a queue more than 500 yards long, but got in after an hour. When we came out at 14.00 there was no queue. Final point, we may be getting old (and risk averse) but we found the limo service from and to the airport, organised by the hotel, very efficient, and keeps you out of the clutches of Rome taxi drivers.", "Date": "June 5, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Still a treat - 10 years after 1st stay”", "Author": "Dixie_in_UK", "ReviewID": "UR7668433", "Content": "We stayed in the Hotel Portoghesi 10 years ago... and loved it. Maybe it was the quirky desk attendant, the sweet breakfast staff... or the close proximity to the best icecream in the world... but we loved it. When we had a chance to return to Rome this spring, we decided to try it again. We couldn't have been more pleased with the results! Our flight was very late arriving but when we rang the bell, the attendant said, \"Welcome Mr and Mrs X. I'm sure you must be tired, so just leave your passports and we'll deal with the paperwork tomorrow.\" He also gave us bottled water...and a much needed beer! This hotel is ideally located and breakfast on the roof garden is just the way to greet the day. It's nice to see that the best hotel in Rome a decade ago hasn't changed a bit!", "Date": "May 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City", "Title": "“Loved the Hotel Portoghesi”", "Author": "clb3", "ReviewID": "UR7636881", "Content": "Hotel Portoghesi was the perfect choice in Rome! Located on a quiet street, within a short walk to the Pantheon, Piazza Navona and other sites. Each morning we looked forward to our cappuccino in the lovely roof top garden. Highly recommend this hotel!", "Date": "May 17, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "St. Louis", "Title": "“Great Location for Rome travellers!”", "Author": "Funtimesstl", "ReviewID": "UR7616436", "Content": "A nice, smaller hotel in the Piazza Navona area of Rome. We loved the location. The Portoghesi is on a quiet, non-touristy street, but we could easily walk to the main tourist attractions. Rooms are average size, showers are small, but bathrooms are well-equipped. Front desk staff could be friendlier, but they aren't unpleasant. The best cappuccino in town is just two doors down, and the best cheese/sausage plate is down the street at Papa's Cafe. Best gelato, around the bend at Giolatti. Average hotel, but a good pick for anyone who wants access to the mayhem, without staying in it.", "Date": "May 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Goteborg", "Title": "“Close to everything”", "Author": "druiden", "ReviewID": "UR7394653", "Content": "The location of the hotel can hardly be better. Just a stone-throw from Piazza Navona in the narrow alleys. The rest is within walking distance. We arrived late due to various air-traffic problems and had some mixed feelings when the limo went into the narrow streets. At daylight the next morning we found ourself in the most charming surroundings. The church next door was fantastic, so beautiful. We felt very welcomed at the hotel. Nice breakfast-room on the roof. Our room was adequate but not large. A little bit noise from adjacent rooms inherent from the plumbing. The street noise could not be heard. We had a wonderful stay. Rather high-priced but it well was compensated by the location and the friendly staff.", "Date": "April 19, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "liverpool,uk", "Title": "“Lovely hotel, friendly, professional, helpful reception staff.”", "Author": "ukArtist", "ReviewID": "UR6837300", "Content": "Lovely hotel. I booked by email through their web site and their responses were very prompt both to my original enquiry and further questions about travelling from the airport to hotel. As a family of 4 we had a tastefully decorated suite ( room 54), which was very quiet, clean and comfortable. The breakfasts in the pretty roof terrace room at the top of the hotel were delicious...warm croissants and cappuccino were my favourites but there was a large selection of cereals and spreads, toast,cheese etc. to choose from. We arrived a day late due to flight problems (air traffic control strike) and the hotel were extremely understanding and accomodating. We wanted to add on a day to our booking and although they were fully booked for that night they phoned around and found us a suite at another, similarly priced hotel nearby. We have already recommended this hotel to friends and relatives and very much hope to return ourselves.", "Date": "February 25, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Worcester,MA", "Title": "“OK place, nothing spectacular”", "Author": "Cliff0rd", "ReviewID": "UR6796279", "Content": "I stayed for four nights in a single room. The room was adequate, but that's about it. The \"desk\" was more like a ledge, about 15 inches deep, with no power outlet. The wireless internet in my room was very weak and just barely usable. I did, however, speak with another guest who was staying one floor down and he said the wireless signal was pretty good there. There was no place to put toiletries in the bathroom, not even a ledge above the sink. As others have stated, the place was clean and well-maintained, and the bed was comfortable. TV reception was excellent, but with only three English channels (CNN, MTV, Eurosport). Breakfast was quite satisfactory. I didn't ask much of the front desk staff, but they were always courteous and quick to call a cab when I needed one.", "Date": "February 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Very Nice Hotel”", "Author": "Gemini16", "ReviewID": "UR6594436", "Content": "After checking through many, many hotels in Rome, we decided on the Hotel Portoghesi which is situated near to the Piazza Navona on side side and the River Tevere on the other. It's situated on a narrow cobbled street in the old part of Rome which added to it's character. The front entrance is pretty small and the reception area the same. A narrow passageway leads to the lift which is also very small; can accommodate three adults with no luggage or maybe two with a bit of luggage. The lift was pretty old as well but again this added to the character. We had chosen to stay in the Le Torre (Tower) which is what they call their 'superior suite'. I did expect it to be a little larger as suites in SA are pretty roomy, but by Rome standards, it was fine. It consisted of the main bedroom with double bed, television, internet facility, dressing table. Through some double doors, there was an interleading bedroom which had one single bed. Off the interleading bedroom was the bathroom. This may present a problem if the people staying there were friends and not family but it was fine for us. The bathroom was very roomy and had a good sized shower, sink, toilet and bidet. There was also a walk in dressing area with plenty of cupboards and drawers. Off the interleading bedroom, there was a sliding door which led to a rooftop terrace which would have been really nice to enjoy in summer but as we were there in January, we didn't make much use of it, but it was still nice to have. I would definitely recommend the Hotel Portoghesi and will stay there again if we manage to get to Rome in the future.", "Date": "January 14, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "California", "Title": "“Great small hotel, Friendly staff, Super location”", "Author": "Janson", "ReviewID": "UR6175426", "Content": "We stayed at Hotel Portoghesi Nov. 8-15, 2006, 8 nights, recommended by friends who have stayed there. We had a room with 2 twin beds which was small but adequate. There was about 3 ft. on each side of the bed and about 4-5 ft. at the end of the bed where you entered the room. Here there was a double wardrobe, a desk with a drawer and a cupboard and 2 large drawers. On top of the desk was the tv. Each bed had a night stand with a drawer and an open compartment. Very usable space for an extended stay. The bathroom was like a ship's bathroom, small but very complete and nicely done with tile and marble and very clean. Large beach size bath towels were provided plus a linen hand towel, but no wash cloths. Breakfast was served in a lovely room with windows on 3 sides located on the top floor of the hotel. Food selection was the same every day with a nice variety of choices. On Nov. 06 the winter rate of 140 Euros was in effect. We made our reservations by email through their website and received prompt replies to the reservation and subsequent questions that we had. While there, the staff was very friendly and helpful with directions, transportation, restaurant suggestions etc. etc.. Two of our favorite restaurants were la Campana and Memmo both within a couple blocks from the hotel. All in all, this hotel contributed to our very successful 8 day visit to Rome. I recommend it if you are looking for a nice small Italian hotel, not luxurious but very adequate.", "Date": "November 25, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“Location, clean and nice”", "Author": "patnprivate", "ReviewID": "UR6164531", "Content": "We are just back from Rome and we stayed at the Portoghesi Hotel. It is very conveniently located near piazza Navona, it is clean and modern. We had no trouble at all, everything went smoothly, room was ready when we arrived, smiles and helpfulness, professional no italian profusion. Of course, as we were in Rome, bathroom was tiny, TV also and with mainly italian speaking channels, but the breakfast (included) was nice on the roof of the hotel. For a good price/quality rate and good location, I definetly recommend the portoghesi.", "Date": "November 22, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "friday harbor washington", "Title": "“what a wonderful location”", "Author": "doxinaes", "ReviewID": "UR6131060", "Content": "After reading all of the reviews on this hotel, I was hoping the Hotel Portoghesi would meet our needs. It was a delightful experience. The location was outstanding, the room was very quiet, the staff very helpful, and breakfast abundant and served in a lovely garden terrace.", "Date": "November 14, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Connecticut", "Title": "“Great Location and homy feeling”", "Author": "nicholanna", "ReviewID": "UR5960405", "Content": "Hotel Portoghesi was a great way to start off our vacation in italy, the location was great, as we walked around to see most of the sites, we took a taxi to the vatican musem one morning. The hotel staff was pretty helpful, and we enjoyed the terrace the most, which we enjoyed breakfast on. the street was quieter than most, but however i did get woken in the middle of the night, by an italian man singing, a love song? but that just added to the experience i guess! great time in rome.", "Date": "October 16, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“Convenient, clean, friendly”", "Author": "kaibab1", "ReviewID": "UR5883333", "Content": "A gem of a hotel, if you can actor in the fact that rooms and baths in this range tend to be small compared to what one gets in the USA . But hey, it's been recently remodeled, it's a 2 min. walk to bustling Piazza Navona, yet lies nestled in a quiet street with Roman neighborhood characteristics and the rooftop breakfast is more than adequate. It's a brief walk just about anywhere worth a visitor's time. That includes the Vatican, as one can saunter along the Tiber (no more than 100-150 yards away), catch a wonderful prospect of Sant' Angelo Castle and then saunter into St. Peter's Sq. on the Via Della Conciliazione. All the sights (with the possible exception of the entrance to the Colosseum) are close at hand: the Spanish Steps, Pantheon, Via Condotti, Trevi Fountain and Campo dei Fiori square. Don't be put off by the romantic ruin called \"The Monkey Tower\" right across the hotel's entrance (the staff will give you a booklet explaining the moniker), which adds atmosphere and tone to the setting. Also, don't miss the superb baroque church of the Portuguese, right next door to the hotel (No, they don't toll the bells, so you can sleep late into the morning). To the right of the hotel, as one exits, on via dell'Orso 44, there's a true Roman trattoria, Lagana. The food is exceptional as is the service. There are more than half a dozen other outstanding eateries within steps (recommended: Ristorante Mancini, just around the corner), without having to fall into the clutches of the turisti joints on Piazza Navona or nearby overpriced Ristorante Alfredo. Also almost next door: a phenomenally well-stocked wine and food store, a pastry shop and a salumeria (deli). And the hotel staff couldn't be nicer. In sum: a winner. NOTE: contrary to what's been posted here, our room had more than sufficient a/c.", "Date": "September 27, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florida, USA", "Title": "“Wonderful hotel next Piazza Navonna”", "Author": "AJFlorida", "ReviewID": "UR5817423", "Content": "This a great little hotel next to all the sites in historic rome. You can pretty much walk to all sites except Vatican. The rooms are nice and reasonably sized for Rome. The location is ideal-- it is less than 1 minute walk to Piazza Navonna, 3 minutes from Pantheon and 10 minutes from Trevi fountain. The front desk is helpful but just make sure that they do not automatically charge the amount in US dollars but in Euro. There are ample restaurants in the area and they are reasonably priced on small residential streets.", "Date": "September 19, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "S. California", "Title": "“Right in the heart of Rome”", "Author": "kdszdad", "ReviewID": "UR5761101", "Content": "Date of Rome visit: 8/12/06-8/15/06 Shuttle from airport cost 45 Eur. The location of this hotel was a 5-minute walk to Piazza Navona, 5-mins to the Patheon and probably a nice 15-min walk to the Vatican. I had my 14-year son and 70-yr old mother with me. We all checked in without any problems. We had a 2 bedroom unit. Mom had one BR while my son and I had the other. The room was very clean and the staff was very friendly. Breakfast in the roof garden was very nice. The shower was clean and offered hot water. The A/C was perfect. The hotel had wireless PC available in the room. Internet charges were great -- 5EU for 5 hrs. This is cheap compared to others. Our Rome visit was perfect.", "Date": "September 1, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“great location, friendly staff”", "Author": "A TripAdvisor Member", "ReviewID": "UR5443668", "Content": "We enjoyed our stay at the Hotel Portoghesi in Rome. It was an excellent home base for sight seeing, within walking distance to the Vatican and Pantheon, among others. The room was comfortable, the room breakfast room was wonderful and the staff was very friendly and helfpful. And a computer with inexpensive internet right in the room! We will recommend this highly to all of our friends.", "Date": "July 9, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Lima, Ohio", "Title": "“Woderful Hotel with a great location and a friendly staff.”", "Author": "hfoltz", "ReviewID": "UR4991491", "Content": "We visited Rome and stayed 7 nights at the Hotel Portoghesi. The rates were reasonable, but the location is just fabulous! We could walk to the Vatican in less than 20 minutes, and the Colosseum in 25 minutes. The Piazza Navona was a block and a half. Breakfast was provided by the Hotel. The staff is very friendly and always greeted us with a smile. I would highly recommend staying at this Hotel if you are going to visit Rome.", "Date": "April 20, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "İstanbul,Turkey", "Title": "“Location, Location, Location”", "Author": "ICM", "ReviewID": "UR4373954", "Content": "We- myself and my wife visited this hotel during January 2006.We had no clear idea where it is located because we booked the room via internet. But, after the first day of our Rome holiday, we see that the location of the hotel is perfect. You can reach every worth to see places by walking, even in winter. Piazza Navona is nearby, Vatican,San Pietro, Pantheon, Trevi Fountain are all very close.. And also,our room was neat and comfortable. Staff is friendly. Breakfast is not superb but ok- if you do not want to pay 10 euro per person outside! I do not know whether we visit Rome again but if we will ,gonna stay there again.", "Date": "January 24, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "2", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Plano, Texas", "Title": "“Better in Florence!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4360933", "Content": "We were in Florence for 7 days then on to Rome. The Hotel has a great location and is very clean. However our bathroom was like on a ship-very small. Also there is no air conditioning and it was warm in Sept. Another negative was the noise level outside of our window that faced the street front. The Hotel Silla in Florence is wonderful!", "Date": "January 18, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Findlay, Ohio", "Title": "“Location Location Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR4125999", "Content": "The Hotel Portoghesi is in a great location, we walked to the Vatican, Navori Square, The Coliseum. Rooms small, but clean and sufficient - one of the 4 couples in our group got the rooftop suite - with great patio - would recommend spending the extra money for this suite - however, the other \"suites\" they charged extra for were not worth it - would opt to get the rooftop suite or just go with regular room. The rooftop breakfast each morning (we stayed 4 nights) was very nice. Unlike other reviews - we found the front desk help to be very friendly and helpful. There is a restaurant 2 doors down that we ate at twice, called Lagana - reasonable and great food - also bought some jewelry at the place right next door. If the church right beside the hotel is open - Don't miss it - not much on outside but breathtaking on the inside.......we would stay at this hotel again and will recommend it to friends.", "Date": "November 18, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Boca Raton, Florida", "Title": "“Loved the Hotel Portoghesi”", "Author": "A TripAdvisor Member", "ReviewID": "UR4086524", "Content": "We stayed in the one bedroom apartment on the little side street next to the hotel. It included the breakfast on the rooftop terrace and daily maid service. It was a wonderful experience. The apartment is bright, furnished beautifully and although it had only one bathroom 5 of us were quite comfortable. Loved our little patio out back where we had cheese and wine every evening!", "Date": "November 4, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Stoke Poges, UK", "Title": "“Great value in a great location!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4072711", "Content": "This is a great hotel in a great location. The rooms are of good quality and the staff are pleasant and helpful. Breakfast is reasonable. We stayed in both the Apartment and a suite - both were good quality, clean and with good bathrooms. It now has WiFi and laptops in all rooms! Limo from hotel to airport was prompt and good value.", "Date": "October 30, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Illinois", "Title": "“Wonderful hotel in the heart of old Rome”", "Author": "prink_123", "ReviewID": "UR4022552", "Content": "We just returned from spending six nights at this lovely hotel. It's location on a quiet street near Piazza Navona and the Tiber could not be better. It was a few minutes walk to the the Pantheon, the Vatican and Piazza di Spagna. Our comfortable junior suite was very clean and simply, but nicely, decorated. Hotel staff were very accommodating and efficient. The rooftop breakfast room was bright and cheerful, with outdoor seating in warm weather. I highly recommend the Hotel Portoghesi and would definitely stay there again.", "Date": "October 14, 2005"}], "HotelInfo": {"Name": "Hotel Portoghesi", "HotelURL": "/ShowUserReviews-g187791-d191097-Reviews-Hotel_Portoghesi-Rome_Lazio.html", "Price": "$237 - $244*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via dei Portoghesi 1</span>, <span class=\"locality\"><span property=\"v:postal-code\">00186</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "191097", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/66/2f/b6/roof-garden.jpg"}}