{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "cavan", "Title": "“Excellent Hotel, great location!”", "Author": "CavanJet", "ReviewID": "UR128456700", "Content": "Stayed in this hotel with a group of friends for a week. The reception staff were very friendly on arrival and were very helpful with directions, restaurant tips etc. All the staff were very friendly and efficient. The rooms were lovely with very comfortable beds. There were a number of English language news channels on the flat screen tv. The shower was one of the best I have ever used. The choice at breakfast was excellent from cereals, fruit, cold meats and cheeses to a hot buffet. The hotel was only a very short walk from Naturkundmuseum underground station with excellent transport connections all over the city. Berlin at the moment resembles a huge building site but there are many interesting things to see. Overall it was a great trip and I would recommend Tryp Berlin to everybody!", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Hampshire, England", "Title": "“Perfectly good”", "Author": "mumof2Hampshire", "ReviewID": "UR127345656", "Content": "The good things: clean, smart, quiet (we had a room at the back though ugly-looking courtyard view), friendly staff, good value, handy for tram & underground Not so good: street is a bit grotty, wafts of sewage smells drift up but that is true of many streets in Berlin, breakfast expensive but lots of cafés down the road to choose from, TV was tricky to sort, room hot at night For the price you get a smart hotel, clean and comfortable, and very close to the main attractions. Room was quite small but perfectly adequate and nicely fitted, great shower.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Great location, friendly and comfortable”", "Author": "WooHou", "ReviewID": "UR126698767", "Content": "Stayed at this hotel for 4 nights in March 2012. Reasonable price for a 4 star hotel. Friendly and helpful reception staff. Very clean, comfortable and quiet room. The location of the hotel is a pleasant 20 minute walk to the river Spree and Friedrichstrasse Station, however the Naturkundenmuseum underground stop is right across the street from hotel. The breakfast was a bit pricey at 16 euros per person. However its worth joining the MAS Card scheme when you book you qualify for 2 for 1 on breakfast and a late check out. There are a number of cafes a few minutes from the hotel to get cheaper breakfast. Would certainly stay here again should we return.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Scituate, MA", "Title": "“Nice, clean and quiet in a good location”", "Author": "BostonBeachGuy", "ReviewID": "UR126330894", "Content": "I found this hotel to be solid, clean and quiet. It is located in Mitte and about a 20 minute walk from Check Point Charlie (although the Naturkundenmuseum U-Bahn stop is right across the street and would get you there in about 10). It is another of the kind of hip hotels that have lean offerings and sparse hotel rooms. It was fine with me. What is crazy, however is 10 euro per day for internet. Come off it, Tryp Hotels (Wyndham), it's 2012. WiFi internet should be free. Full-stop.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vienna, Austria", "Title": "“Brand New!”", "Author": "packnandunpackn", "ReviewID": "UR125876553", "Content": "Nice rooms with brand new fixtures and the added bonus of hardwood floors. Easy to get to subway and trams. Very friendly and helpful staff. They even gave our children small gifts which of course won their vote.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Outstanding”", "Author": "Andrew1976Liverpool", "ReviewID": "UR125796804", "Content": "Incredibly slick and fabulously located. Only 2 U-Bahn stops from Friedrichstrasse station which connects to Schoenefeld airport. This hotel excelled all my expectations. It's clean, modern, phenomenally professional and with friendly staff who speak brilliant english. Yes, the buffet breakfast is expensive (16 euros) but is buy one get one free if you have a MAS loyalty card, so that works out not too expensive. It's also incredibly secure. I'd stay here again in the blink of an eye", "Date": "March 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vantaa, Finland", "Title": "“My Tryp – A great place to stay”", "Author": "Timo-J", "ReviewID": "UR125713180", "Content": "Hotel is centrally located, right next to U-bahn (Natural history museum) and S-bahn station (Berlin-Nordbanhof) round a corner. U-bahn is very easy way to move around with a baby stroller, nearly every station has a lift. We arrived early morning and at Front Desk we got a great & efficient service. Our room was ready, but they delivered baby bed later, we got information about this. They also told us a good introduction about hotel services and surrounding facilities like U-bahn. Room furniture was modern and simple style, looked nice! There was a big double bed and baby bed, desk table, two chairs and bathroom. Room was a good sized, we could fit luggage and baby stroller in room and could still move nicely around. Bathroom was good sized with big shower area. Room was clean and daily well cared. Berlin Wall museum / monument and Natural history museum are about five minute walk away. Breakfast and coffee can be found at the corner of Chausseestrasse and Invalidenstrasse. There is also grocery store and bakery at Chausseestrasse towards city center. Restaurants can also be found towards city center. I travelled with my wife and 4 month old baby, our room was for two person.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Modern and clean but extras expensive”", "Author": "khollingsworth", "ReviewID": "UR124723574", "Content": "I've stayed in Berlin before so had a rough idea of what to look for, and this place ticks most of the boxes. Plusses: this hotel is in a central location (about half an hour's walk will get you to the Brandenburg Gate). The U Bahn and trams run on the street just outside. It's new, very modern, and exceptionally clean. The bathroom was massive and the power-shower and organic toiletries were great. There's a free gym and sauna (my husband used the former) and it all comes at a budget rate. The staff were good too. Minuses: the room we were allocated was very small, and all extras were expensive (such as internet and breakfast). There weren't any tea or coffee making facilities. Personally I didn't think the hotel had much character -it's part of an international chain- but it was spotless and inexpensive, and well located too.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "russia", "Title": "“Modern hotel close to metro & not far from city center”", "Author": "zelenskya", "ReviewID": "UR124114383", "Content": "The hotel is modern & new. I was even confused by the fact that Google doesn't recognize the address (there's a wasteland instead). The room was clean with fresh bed; the most impressive thing in it was the shower. We had a room which look inside so that it was very quiet there but it looks like the hotel is soundproof enough by itself. Location is perfect! 5 mins to metro & shop, 15 mins to the city center with lots of cafes on the way.", "Date": "February 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Guildford, United Kingdom", "Title": "“Great Price, Great Location”", "Author": "AGainer", "ReviewID": "UR123211521", "Content": "Really modern hotel, rooms were really modern and clean, good size tv, really close to metro stop and lots of places to eat. Will be going back again!!", "Date": "January 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Perfect for the price”", "Author": "chrrul", "ReviewID": "UR122814462", "Content": "Good location for Mitte and it's variety of bars, restaurants and clubs and easy access to tram and metro makes this an hard-to-beat place for the price. We stayed twice in 2011 and had a pleasant, stylish stay every time. Good location when flying into Tegel airport too.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "greenock", "Title": "“Great value hotel in Mitte”", "Author": "bhoyGreenock", "ReviewID": "UR121925768", "Content": "Booked thru Expedia after checking out on Tripadvisor,good result! The hotel is 50mt from Nuturkunde Museum U-Bahn station,if coming from Tegel airport get the 128 bus from airport to ralf schumacker platz approx 5min,then the U-Bahn 8 stops to Naturkunde Museum on the Mariendorf line, this line runs into Friedrichstrasse also. Hotel was all that was promised great shower,good bed,join the club for half price breakfast. Reception and breakfast staff were fantastic really helpful.Its an easy walk into the centre if the weather is good.Oscar Wilde pub near Orienburger Strasse U-Bahn is a great place for a beer on the way! Chrismas markets great! will be back!", "Date": "December 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good stay”", "Author": "Anthony M", "ReviewID": "UR121885282", "Content": "I'd booked a weekend with the Girlfriend, and had booked this a little hurredly. It looked pretty trendy when I arrived, and was soon up-sold the premium room. After getting in the lift thinking how easily I'd said 'yes' with the missus in tow, I wasn't disappointed thanks to the best shower ever... Although we didn't stay in the building long, it was clean and had superb pillows. Could I also recommend the grill/kebab shop down the road, which was superb at 2am. Shoredtich eat your heart (and CurryWurst) out.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Nice hotel in reasonable location”", "Author": "CarolinLondon111", "ReviewID": "UR121879892", "Content": "Just got back from a weekend in Berlin ath Hotel Tryp to make a last-minute trip to visit the Xmas markets. I booked this hotel since it was part of a package, and from a wide choice of hotel options, this one had the best reviews and price combination. It did not disappoint as the reviews were fairly accurate. Overall: Great value for price in a good location not far from main attractions and sights in Berlin I would definitely recommend this one, but wish I could rate it 3.5 star instead of 3 or 4 because it's not quite one or the other to me. Positives: -Very polite and friendly staff that actually smiled (bit of an issue for some German venues) with easy checkiin and check-out -Only a minute or two walk from the underground/subway/tube stop, only two stops from Friedrichstrasse, which has good access to most destinations around Berlin, and not far at all from the Brandenberg Gate (about 10 minutes away by underground) -Whenever we left and came back, there were always people in the lobby bar. We didn't have drinks in the bar ourselves but took this as a good sign and hints at good bartender service as well. -Excellent bathroom and shower and bathroom supplies. In our room (room 341), we had little bottles of shampoo, bath gel, and lotion, but shampoo was also in a dispenser in the shower, meaning you had virtually an endless supply! -Good security in that you cannot use the lift unless you use your room key -Because it wasn't quite in the center of everything, we welcomed the slower pace on the street. -An excellent chinese restaurant next to the hotel with very reasonable prices -A very reasonably priced middle eastern (gyros and souvlaki) restaurant across the street and just south of the subway stop -A tram (M6) that runs late into the night and runs right on the street of the hotel -Our room was fairly quiet and looked into the roof/courtyard Negatives (or \"Could-be-betters\") -The hotel sign is a little bit on the small side, so the close proximity to the subway stop is slightly dwarfed by the fact that you have to walk about 20 meters before you see the sign. There are also other bright signs that will block your view of the hotel sign so not all their fault. -Beds were hard and we requested a double room and ended up with two singles pushed together. Not sure if this is the norm in German/European hotels but it wasn't a huge issue as the two beds didnt wander away from each other very easily. -The room was a bit cold as we stayed in December. I tried to turn up the heat but the thermostat was set to max out at 25 C, which is ok if it hits that temperature. But as we had two single beds, we also had two single blankets which were narrow and hard to keep some of the cold out. -The street is a bit dark (perhaps we were spoiled by the Christmas lights in the main city squares) and the neighborhood was usually a bit too quiet with the occasional streetperson (but we found this around Berlin so I don't think this was only on our street)", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, England", "Title": "“One of the best bargains ever”", "Author": "PerryM", "ReviewID": "UR121592428", "Content": "It's hard to believe that we paid just 55 euros a night for our room at the Tryp. I'd happily pay more! It's an extremely stylish property with a great lobby bar and well appointed rooms. The staff was extremely friendly and helpful. The breakfast buffet has everything you could want; you can halve the 16 euro cost by joining the Mas club which gives you two breakfasts for the price of one (so no good if you're travelling solo). Location-wise it's a 1 min walk to the nearest metro station or you can walk to many of the main sights in Mitte. Would definitely stay here again.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Madrid", "Title": "“Clean functional and well located”", "Author": "OriginalJourneyman", "ReviewID": "UR121409480", "Content": "Chausseestrasse is the continuation of Friedrichstrasse so the hotel is close to all major atractions of former E. Berlin. You can walk to Alexanderplatz, the museum island, Reichstag very easily and for further destinations there is a metro station on the doorstep. Rooms are great, a decent size, modern and spotless. Breakfast can get a little busy at weekends but a good selection of food on the buffet. Staff friendly and accommodating. A really good option for a short break especially if you can get a good rate.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Good value”", "Author": "RileyMabel", "ReviewID": "UR121362502", "Content": "Visited for a short trip celebrating my 40th birthday! Well positioned near u6,2 min walk to u6 Nature museum.Modern clean n tidy. Room at back quieter.Good Buffet breakfast - should be 16 euros per person.With a tryp loyalty card(fill in at hotel)this can be bought for 8 Euros per person. Bar also good value. No tea coffee facilities in standard room. Kettle supplied when asked. Double room, two single beds put together,not an particular issue to me though.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Stylish and functional”", "Author": "silvascreen", "ReviewID": "UR121126878", "Content": "Located in North Mitte, Tryp Berlin is a modern, stylish chain hotel. Clean rooms, very comfortable bed, good location, but rather lacking in atmosphere. That said, we got a fantastic deal from Last Minute's 'secret hotel' promo. To do: excellent cafes and restaurants in the neighbouring old Jewish quarter, a walk with Insider Tours - we did Cold War Berlin (Maria, the guide, was excellent), Bauhaus museum was good, DDR museum has an irreverent take on life in the old East Germany. Very good dinner at Kellar Restaurant in Brecht Haus (400m down the road). At £90 for two nights, this was a great bargain.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Clean, modern and in a good location.”", "Author": "Del_Amitri", "ReviewID": "UR120942112", "Content": "We really enjoyed our stay in Berlin. The hotel was modern, clean and comfortable, the staff were friendly and the hotel was located next to a U-Bann station which meant we were never more than 5 minutes from the most central areas. The breakfast was very expensive (€16) but you get a 50% discount if you join the loyalty programme (they hand you a leaflet when you arrive and you can join instantly).", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool, England, United Kingdom", "Title": "“Didn't stay here but wanted to!”", "Author": "Holly S Posted by an Accorhotels.com traveler", "ReviewID": "UR120561711", "Content": "We came to Tryp for a drink after a long walking tour during our trip to Berlin. We were staying in a hostel and in the time we spent at Tryp (less than an hour) we felt more welcome and looked after than we had the whole time at that hostel. The bookings manager was so kind to us and set up another hotel room at Mercure (which was lovely!) Nothing was too much trouble and after a series of bad events (broken suitcase, broken camera etc, etc), this holiday could have gone horribly wrong! We came to Berlin to celebrate our 7 years of being together, when we moved to Mercure, we slept soundly and managed to navigate our way to The Bird (which is apparently where all the English and American people go anyway). We had a great night and thoroughly enjoyed the rest of our stay in Berlin. Anyway, we just wanted to thank you for the kindness all the staff at Tryp showed us. You didn't have to do any of that, but you did. The minute we left that hostel, everything changed- we stopped resenting Berlin and starting enjoying the beautiful city!", "Date": "November 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Bring your own tea/coffee for standard rooms”", "Author": "Starbomberman", "ReviewID": "UR120458545", "Content": "The only down side of this hotel is that there is no tea and coffee available for standard rooms. You can bring your own tea and sugar and borrow a kettle and cups from the bar though. The shops are conveniently close to buy milk and there are good restaurants around. The rooms are modern but slightly on the small side - the same can be said about the gym. Would have given this a 4/5 but I feel that the standards rooms are 3 stars at most and not 4 star facilities. Staff were friendly though.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellent value for money in central Berlin.”", "Author": "LukeSharp", "ReviewID": "UR120355988", "Content": "I booked this hotel through an online site and got a very cheap offer (€60 per night). This was advertised as a 4 star hotel and was amazing value for money. Included a small but perfectly formed fitness centre and excellent customer service from all of the staff. The night porter could not have been more helpful in helping us make arrangements for getting to the airport and researched pretty much every available alternative. Breakfast was extra at €15 each per day which was a very extensive buffet. This was reasonably expensive but the quality was so high that we opted to go for it and felt that we had had our monies worth. The hotel was immaculately clean and decorated in a modern style. Location-wise it was very central - a few minutes walking distance from Freidrichstrasse and pretty great for all the major tourist sights with a U-bahn practically outside. Would definitely revisit!", "Date": "November 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Brussels", "Title": "“Good price/quality ratio for Berlin”", "Author": "PGRBrussels", "ReviewID": "UR120101110", "Content": "The Tryp Mitte is a nice modern hotel in the centre of Berlin offering easy access from Tegel Airport and with the metro stop opposite the hotel, ideal for visiting the main tourist sites. Rooms are fairly basic for a 4* hotel but with good quality furnishings and bedlinen, a nice walk in shower, mini bar and LCD TV, there's everything you need. The hotel staff are also most helpful. The buffet breakfast is also pretty good although at 16 EUR a bit expensive. However if you are a member of the MAS fiedlity programme you get two for the price of one, or there are much cheaper dining options along the street. Overall a very nice hotel, ideally situated and I wouid not hesitate in staying at the Tryp Mitte Berlin again.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good base for 4 night visit to Berlin!”", "Author": "Dmg8", "ReviewID": "UR119301865", "Content": "Rooms are exceptionally clean and have modern decor. Beds are extremely comfortable and bathroom has a power shower! Hotel staff are friendly and suitable facilities. Location is good, u-bahn station very close. Public transport is easy to use and very reliable. We had a great time in Berlin!", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Haifa", "Title": "“What a find!!!!!”", "Author": "CliveNoble", "ReviewID": "UR119287951", "Content": "The Tryp is just 100 meters from the Metro in a very central area... we walked almost everywhere. The staff were very friendly and helpful, total cleanliness throughout, breakfast very good and quite cheap. Amazing modern bathroom and good fittings throughout plus a flat screen LCD TV. We'd definitely stay there again.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Clean, friendly hotel”", "Author": "Bil3712", "ReviewID": "UR118825157", "Content": "I would definitely recommend this hotel, rooms a good size, clean and the staff friendly. What more do you need?", "Date": "October 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Oslo", "Title": "“New and allright... but not more”", "Author": "Radler09", "ReviewID": "UR118481808", "Content": "Stayed here in february, when the hotel just opened. Overall satisfied, but that was because we got a cheap price. Have seen that the price has nearly doubled since the opening offer - and then it's not a good deal in Berlin... Maybe it was the winter, but the rooms felt a bit cold with the wooden floor. The area was ok, but there are many better places to stay. Hotel typical modern, without anything special.", "Date": "September 23, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "London, England", "Title": "“Good modern hotel - recommended”", "Author": "LucysPop", "ReviewID": "UR118031192", "Content": "We stayed 3 nights at this very modern hotel. Modern, functional room with excellent en-suite. Reception staff were friendly. Breakfast at 16 euros was too expensive for us but there are very decent coffee bars close by. Hotel is just a short walk to the underground and to bus route. Would recommend hotel. Berlin is a fabulous city!", "Date": "September 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Newcastle, United Kingdom", "Title": "“Excellent”", "Author": "daveyruthers", "ReviewID": "UR117501993", "Content": "We stayed here August Bank Holiday weekend 2011. We booked through late rooms and paid £150 for 3 nights stay. Hotel is located a couple of mins from the nearest S Bahn stop and this is easy to use also. We found the rooms really clean and the bathroom was huge with a power shower. We didn't have found in the hotel as we eat out every day. Berlin itself is very reasonable for beer, paying around €3 a pint. Overall excellent hotel,good location,good sized rooms, very clean and excellent price!", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Northampton, United Kingdom", "Title": "“Great location!”", "Author": "Annie S", "ReviewID": "UR117064745", "Content": "Stayed here on 4night secret hotel deal with last minute.com. Pretty easy getting here from schonefeld airport,one change at freidrichstrasse then u6 for 2 stops to natural history museum.hotel is a minutes walk from the subway station. This makes the location perfect for exploring Berlin. Room was ok,very clean,came with twin beds. We knew to ask for a room at the rear from reviews here and it has been very quiet. No tea/coffee making facilities and tv channel choices pretty dire. Limited drawer space for clothes and only 6 hangers. We haven't eaten here so can't comment on food or service. This has due to preferring to go and explore the diverse eating options in the city. Room service is fine,clean towels and toiletries topped up when required. Wireless is available at the hotel,not free but to be honest it hasn't been that easy finding hotspots in the city. For example the Starbucks at freidrichstrasse is always extremely busy. For the price, as a clean comfortable base to come back to after a day sightseeing,it's been perfect,just don't expect home comforts and lots to do at the hotel.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Wakefield, United Kingdom", "Title": "“Almost a very good hotel but.........”", "Author": "richcath1", "ReviewID": "UR116811075", "Content": "After a seven night stay at the Tryp I can honestly say that it is almost a very good hotel apart from a few problems that it really should address.First thing to say is that the deal I had was great.I paid two star prices for a four star hotel.I had a premium room upgrade which gave me quite a large room,a coffee machine & dressing gowns The bed was huge & very comfortable,They seem to be the same beds used in the parent companies Melia hotels.The bathroom was large.modern and fully loaded.Nice towels and fittings etc.At first glance and after a top nights sleep everything appeared to be ten out of ten.However the downsides soon showed themselves.Please remember that these are only a series of niggles that maybe you could overlook.First up then,the aircon did not go cold enough.As this is during a not very hot August.I just opened the windows instead but this wouln't work if Berlin ever gets its summer.It was quiet at the back of the hotel though. The bathroom is designed for six foot five baldies.The main shower head being the very modern \"rain forrest\"type.No shower caps provided so I had to use the smaller conventional shower head.The mirror is miles away from where you stand at the wash basin & is to high to dry your hair at.Thats fine if you use the hotel drier as it wouldn't dry my hair in an hour anyway. You need to stand on a box to look downwards into the shaving/make up mirror.Great for shaving to top of you head,not so good for under your chin. Oh and there is no light in the walk in shower,it has an opaque window into the bedroom.Fine if you shower at 10 am on a sunny day.Not so good when its dark outside.Poor shower cream & no body lotion rounds off the complaints. I made the girlfriend iron my shirts first night.She reports the iron is very good(Her report on me is not as glowing) So the room is almost but not quite very nice. The bar & breakfast area looked like an airport lounge.I only ever walked through it so it didn't matter to me.The bar seems to close early too or maybe I just got in late every night. Transport links are all first rate.M6 tram at 50 metres.U6 at 200metres & the Nordbahnhof just around the corner.Maybe ten minutes walk if you are slow. Berlin is a city full of bakers & coffee shops and you can find a breakfast to suit every price range not far from the Tryp.Hotel breakfast prices are a bit of a sore point with me.It is fair to say that I would never be using the Tryp's offering at 16 euro.Maybe it is very good? To sum up then.Lots of people will like the Tryp.I almost did and at the price I paid it was good value.Having stayed down the road at the Melia I can't help puzzling how they are both four star hotels.I would rate the Tryp 3star & the Melia 5.See what you think", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Cumbria, UK", "Title": "“Great hotel - right opposite the U Bahn”", "Author": "saz-up-north", "ReviewID": "UR116577548", "Content": "Myself, husband, sister and her partner stayed at the Tryp Berlin for a long weekend in July. After spending some time trying to decide which area of the city to stay in we opted for this one. It was a great choice! The hotel was modern, clean and as it was a stone throw away from the Naturkundemuseum U bahn station it was great for getting around the city. Most of the places we wanted to be were about 2 stops on the U bahn system which took a matter of minutes. The only hotel staff we spoke to was the guy on reception at check in. He was very helpful and spoke good English. We opted not to have breakfast in the hotel as it was expensive - instead we wandered down to the small bakery a few metres away. We had a premium room - I'm not sure what advantages a premium room has over a normal room though! The room itself was very modern and had a huge bed! The TV in the room had a couple of English channels and there was a good cofffee machine. All in all if we go back to Berlin (we might well do as it was fantastic!) we will be staying in this hotel again! We couldn't fault it!", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Madrid, Spain", "Title": "“Great hotel, bad wifi strategy”", "Author": "JustoHS", "ReviewID": "UR116388383", "Content": "We spent one night in Berlin last July 26th. Overall, the hotel was almost perfect. Close to downtown, subway was available at 3-minute walk, staff was friendly, price was just great and the hotel room was just what one would expect: clean, functional and stylish. My only concern is that a hotel chain like Tryp should not try to charge 20 bucks per every 10 hours of wifi connectivity. Maybe 5 years ago that was OK, but not now. If they understand that, then this hotel will be a 5/5 for sure.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Very nice modern hotel and we will return”", "Author": "weeteenie1", "ReviewID": "UR115918442", "Content": "This was our first visit to Berlin and we enjoyed it so much we hope to return in the not too distant future. The hotel was extremely modern and with easy access to the centre of the city, it was a good choice for us. The only downside was that, on arrival, we were allocated a room at the front which because of the hot weather felt like a sauna and the traffic noise prevented us from opening the windows. However, when we called reception, they immediately reallocated us to a quieter room at the back of the hotel. The air conditioning system does not seem to work efficiently. The buffet breakfast was extremely good and the staff were always helpfull and courteous. It was definitely value for money and we would go back there.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Padova, Italia", "Title": "“Good position, good breakfast. Perfect to visit Berlin”", "Author": "ricpast", "ReviewID": "UR115792583", "Content": "We stayed in the hotel for 5 nights, location is near the U6 station NaturkundenMuseum (just 150-200 meters). All the hotel is new with modern furniture, personel is young and kind. The room was good, the shower was very large but the bathroom has not the bidet... My suggestion is to book including breakfast because it costs 16 euros (!) if you decide to include it when you arrive; we're talking of a very big breakfast with sweet or salty food up to 11 in the morning. The only thing is that our room, which was direct to the interior garden of the hotel, was a little bit noisy because of a cold-warm machine postioned on the ground of this garden. One suggestion if you want to eat german food with a little touch of international cousine: \"Oderquelle\" in Oderberger strasse at number 27. For a mojito or a cold beer in a simple but very cool mood: Wohnzimmer in Lettestrße 6. Enjoy it!", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "sanremo, italy", "Title": "“Good modern hotel”", "Author": "viaggitrice_ligure", "ReviewID": "UR115692217", "Content": "Good new hotel, very clean and functional, nice big beds and powerful shower. Booked through Expedia it was really cheap. Very convenient to all main transports. We did not have the expensive breakfast because Berlin's cafes have so much for so little money that's criminal not to visit them. there are so many good independent cafes and restaurants and shops, really loved Berlin and with the good sleep I got at the hotel I had lots of energies to explore it well. I just wish I knew a bit more german so to arrange a taxi myself and not rely on hotel staff to arrange an overpriced minicab to the airport.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "London", "Title": "“Very good with some teeny weeny quibbles...”", "Author": "Pedro_ALondon", "ReviewID": "UR115571144", "Content": "Stayed at this hotel for a city break from Friday to Tuesday. Beautiful, new, modern, clean & modern hotel with polite & helpful staff. Hotel is less than a year old so feels very new & clean. Decor of the rooms was spot on & very trendy & modern, with some nice flooring & no cheap stuff. Nice LCD Samsung TV in each room & roomy power shower in bathroom. My room was facing the rear so it was nice & quiet & tranquil at all times. Downstairs in reception they have a bar which is open all day until late (about 2 or 3am). Bar only ever had a few people staying at hotel there at any time. So not very lively, but nice still. They have a clean & modern dining area right next to reception but never got to eat as we were out every night partying. But quite high food prices did put us off eating there in first place anyway. For instance breakfast was 16 euros (which is about £16 nowadays!) which was pretty expensive for a buffet. And a coffee was about 2 & a half Euros (about £2.50). So about Starbucks prices for a little cup. Hotel is very centrally located. It's not slap bang in the middle of the hustle & bustle of Berlin but it is very, very near to travel to. About 20 mins walk or 10 mins by underground train & the train station is 5 mins walk away. Only very minor quibble was one morning we did have a bit of breakfast. Not the full 16 euro one but a 6 euro one where they let you have a bit of meat & cheese & one roll & a cup of coffee. We had that & as I was eating I noticed what looked like a little flea (or could be a fly) crawling over my sandwich. I called the young waitress & she just sort of said \"yes, and?\" I was expecting her to refund me in full for the breakfast but she just said \"yes we do get a few fleas here sometimes\". My friends thought I was making something out of nothing but I'm not really used to eating fleas for breakfast! That could have been just a one off & to be fair the waitress was only about 18 & looked quite inexperienced hence she didn't react how I expected or wanted her to. They claim to have a gymn at this hotel which I found on the top floor. It's really just one running machine, one bike, one multi gymn & a couple of free weights & a sauna room & that's it. It's quite a small room too. So don't expect a proper well equipped gymn as the gymn here was just basic. Another thing which may be of interest is this hotel is part of a Spanish-owned chain. So the hotel had loads of Spanish staying there. Being half Spanish myself that was a big bonus as I got to speak Spanish with some of the other guests & they were all very friendly, polite & respectfull (as the Spanish naturally are!). So apart from the expensive food & drink & the odd flea, this was a brilliant hotel & if I go back to Berlin (as I'm hoping to soon), I'd definately stay here again as I loved it. Pedro", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "denmark", "Title": "“Great hotel”", "Author": "hrg24", "ReviewID": "UR115392610", "Content": "We stayed at the hotel for a few nights, and it was a great stay. However, there are construction work outside the hotel, so if you want to sleep in, or if not being a heavy sleeper ask for a room not facing the street. Rooms were modern, and clean. Internet was very expensive, but there is a cafe down the street that has free wireless, so we used that. Breakfast was expensive 16 €. there are plenty of breakfast places not far from the hotel, and we spent about 9€ 2 ppl incl coffee. It is easy to get around, and the metro is running just outside the hotel. There are some great dinner places and bars in Prenzlauer berg area. Found a GREAT winebar/restuart at helmholdtsplatz in Prenzlauer berg.. there are also many other good dining places. Tips: was told by my friend from Berlin that you don't normally tip. If service has been really good you leve 2 € or so.. We gave around 5-6€ just to be sure.. We went on a bike tour 4,5 hour ride, and it was very good.. we payed 16€ per person incl student discount. otherwise it is 19 or 20€.. There is a tourist information at the hauptbahnhof where you can find lots of information.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "england", "Title": "“Great value”", "Author": "cuthman1", "ReviewID": "UR115320065", "Content": "New hotel in (north) Mitte Berlin. Clean modern with good facilities and excellent staff. If your map reading is good many of Berlins sights are just about within walking distance.. if not tram and U Bahn just outside.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Great Hotel, Great Location”", "Author": "JenRobo6983", "ReviewID": "UR114849092", "Content": "We stayed for 7 nights and were very impressed with both the city and the hotel. We are regular tripadvisor followers and have had \"trip anxiety\" on occasion over the years as a result of some wayward reviews so hopefully you will find this an honest and positive account of the hotel. The room was lovely, nice and new and the bathroom was fantastic with stone tiles and a big shower. We would have preferred a double bed to the two (very large) twins pushed together but it was not a problem for us and I slept like a baby every night - I'm sure they would have changed if asked as don't think the place was too full. The beds are firm but very very comfy and supportive in my opinion. The only real negative was that, on very rare occasion, there was a sewage smell in the bathroom but the occasional whiffs seem to be a city-wide problem and I was glad for future trips to see they appear to be working on the sewer systems. So I don't think this is anything you could blame the hotel for and I think it only really affected us on one morning. However I haven't stayed in Berlin before so I don't know if any other hotels have experienced this. If it was a hotel problem i'd have expected it to be constant. Anyway regressing back a bit we arrived on the U-bahn and were delighted to be just a few strides from the hotel door. The check in process took 2 minutes and the desk staff could not have been more helpful or friendly. I don't know why people had negative staff experiences, I can't say I usually try for much interaction with hotel receptions other than checking in/out and getting a map, and for this they were brilliantly friendly and efficient. different staff on each shift generally said hello or have a good day or something as you walked past them even if not approaching them, which was nice, so don't think negative staff reviews are representative at all of the hotel. Barman was also friendly and beer as good value as anywhere else if you fancy a nightcap. We did not eat in the hotel - you don't need to due to great range in the city although the dinners looked to be decent value (not sure why the €16 breakfast though). The rooms were cleaned and well made up every day with new towels, one morning after a late night I forgot to put the \"do not disturb\" on the door and at least 3 different housekeeping staff knocked on it in the space of half an hour or so, so they are definitely keen to clean! Neighbourhood nice and quiet. To underground station - 1 minute. Walking to nearest cluster of bars etc - 10 mins (or one stop on the underground). Schoenfeld Airport via trains around 1h depending on time of day, inc 2 station changes €3 for a single ABC region ticket. Particularly good places (although everywhere good value and all food superb that we had) - Schwarzwaldstuben (and the place over the road, forget name), Chipps Serious Eating, Barcomi's Deli, Hasir, Gambrinus, that's just the food! If you don't fancy more cocktails and German beer and want a cop-out night, Kilkenny's Irish bar has great live bands and (my husband's fav) cider, which is relatively hard to come by. All in all the Tryp Mitte was an absolutely perfect base for exploring Berlin and we would not hesitate to book this hotel again.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Chester, United Kingdom", "Title": "“Very nice hotel but too hot indoors”", "Author": "Sprowenhull", "ReviewID": "UR114682698", "Content": "Recently stayed for 4 nights at Tryp Hotel, Berlin. Hotel a couple of minutes walk from Naturkundemuseum u-bahn station. Just two stops to Friedrichstr. station, where you change to get anywhere in Berlin. Not a lot local to the hotel but it's a short walk to Oranienburger Tor where there are a few restaurants. Hotel was very modern, clean, decent sized comfortable bedrooms but let down by the fact they were way too hot, even using the air conditioning system in the bedroom. We had to leave the windows open during the night, which was a problem given that building work local to the hotel started at 5.30am! Would hate to be there during when it was very warm (we were unfortunate with the weather - lots of rain...). Didn't eat at the hotel - thought breakfast was very expensive. We ate breakfast in various restaurants in Hackescher Markt which were lovely, very reasonable. It was Hackescher Markt we met for the Insider Tours walking tours, which were very good value and would recommend doing. You get a discount if you purchase a City Tour Card (for travel). We used the trains to/from the airport and daily during our stay - very efficient.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Budapest", "Title": "“Wow, what a fantastic hotel!”", "Author": "TravelBoy83", "ReviewID": "UR114623232", "Content": "I stayed 2 (non-consequtive) nights here. It was a wow factor from every aspect. I found the staff welcoming and friendly, the room spotless clean with very nice decor and quality furniture and fittings. The bathroom was real designer stuff, the matrass was very comfortable. The hotel has a free gym and a sauna on the top floor, plus a small \"sun terrace\" which is a small bonus. Internet is wireless across the hotel but is not free. I did not try breakfast or any of the food. Location is very good, 1 minute away from metro station Naturkundemuseum, on line U6 which gives easy access to the city centre, and good connection to both Tegel and Schönefeld Airports.", "Date": "June 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great stay”", "Author": "Londina", "ReviewID": "UR114360444", "Content": "I love the design of this hotel, very cool and trendy. Service was ok and rooms clean. Good location, easy walk to the center.", "Date": "June 19, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great hotel, not great staff”", "Author": "ali_travelling", "ReviewID": "UR112341378", "Content": "Brand new hotel, impressive rooms. But let down by unwelcoming and unfriendly staff. Location ok.", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "London", "Title": "“An enjoyable hotel experience”", "Author": "I-veritas", "ReviewID": "UR111469023", "Content": "The Tryp Berlin is a luxurious hotel, just 6 months old and very modern. However, because it is so new, not many businesses in the area actually know of it's existence. Part of my reason for selecting this hotel was it's proximity to the U-Bahn (just 1 min from Naturkunde Museum), in the summer it is not visible from the exit as ithe sign is obstructed by foliage. So I would recommend exiting from the lift, crossing the road to the LHS and then taking a left for maybe 100m, you'll then see the hotel. The hotel is on fact located directly opposite the junction of Chausseestrasse and Habersaathstrasse. If you get as far as Subway / Balzac Coffee / the junction with Invalidenstrasse, you have headed in the opposite direction to the hotel. The location of the hotel was fine, I'm happy to walk everywhere anyway and it was just 5 mins to the junction with Friedrichstrasse (Orianenburger Tor U-Bahn. There is plenty of nightlife close by, and Berlin is a very safe city, but the location meant that the road was quieter in the evenings than more central hotels. I wouldn't recomend walking north of the hotel, it is just on the edge of the centre and there is nothing going on beyond, although there is considerable construction (new hotels??). The hotel reception was open and spacious, with a modern bar. The male staff members were welcoming and informative, but I think some of the female staff perhaps needed a bit more training, they neither particularly friendly nor efficient, but this is a very minor niggle. What it did mean was that reception could be very busy when patrons arrived concurrently. I was allowed to check in before time (12.30pm) but my request for an upgraded room away from the road could only be met if I checked in after 3pm, and I was happy with what I was given as I'm not bothered by traffic noise. If you are, you should be aware that the road outside is reasoinably busy, and that the tram runs right outside too! (The premium rooms are on the 6th flr, so I'm guessing that the hotel is cleaned from the bottom to top). I was happy with my double room, which was comfortable and stylish although minimalist, there was a nice mini-bar with space for additional small bottles although the safe's positioning on top of this was I think a design error as the contents became rather hot. The bed was large and comfortable, and their were both privacy and blackout blinds. As noted in previous posts, the bathroom was lovely, the shower in particular was well-designed, designed not to flood no matter what the angle of the showerhead, and the tiles dried quickly. The hairdryer was much better than expected, it did well to tame my curly mass. I was very mindful of the cleaning, in fact housekeeping asked me whether they could clean my room just 1 hr after I had arrived, which wasn't necessary, Based on that, I left the do not disturb sign on my room whenever I was in it, and staff were generally unobtrusive. The toiletries were fine, but could be eratically replaced. The gym on the 6th floor was small but more than adequate, and importantly accessible 24/7. The sauna had more restricted times (6am-10pm I think), and required a member of staff to be informed before using these outside these times. I didn't try the bar or dining facilities, but would say that E3.00 for a cup of coffee is not a lot to pay compared to the prices charged by the numerous coffee shops in Berlin. The only thing that I would change would be the cost of the wi-fi, it would have been preferable to me if this had been offered foc. The nearest free wi-fi point I located was at a cafe on Invalidenstrasse, 3 mins away and just down from the Mercure Hotel, but this never seemd to be open! Starbucks gives 2 free hours of wifi, the nearest branch is on Frierichstrasse (just past the station on the LHS of the road, a 10 min walk away) although Balzac Coffee is actualy far tastier! I would also highly recommend the Michelin-starred Weinbar Rutz which is just down the road, and avoiding the Bellini Lounge on Orianenburger Strasse. Berlin is a fantastic 24-hr city, the negatives I have mentioned are very minor niggles, and did not detract from my great experience at this hotel. Overall, I enjoyed my stay at Tryp very much and would not hesitate to recommend this to others.", "Date": "June 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Excellent and classy hotel”", "Author": "Clarky040", "ReviewID": "UR110871093", "Content": "We loved this place although we booked it on last minute.com as a mystery deal. We only paid $50 per night total but this place is worth a lot more. Very clean and spacious rooms. Great amenities and excellent location. Although it isnt in the heart of the attractions this location is a short walk to good restaurants and right next to the metro stop.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Luxembourg City, Luxembourg", "Title": "“Great location, stylish hotel”", "Author": "Hellojed", "ReviewID": "UR108646712", "Content": "My husband and I stayed at Tryp earlier this month for his birthday. We had received a discounted rate, and in the end of our stay we agreed that it was definitely excellent value. All staff that we dealt with were friendly and helpful; we arrived too early in the morning to receive a room straight away but we left our suitcases behind in a secured room with a tag system. Our bed was very large (two single beds put together, mattresses slightly too hard) and the bedroom well decorated and designed. The bathroom had a large shower but no bath. Plenty of tv channels. We did not order wifi because at 10 euro an hour we felt it was too expensive. The cafe Mr Vertigo nearby had free wifi however, as does the Sony Centre in Potzdamer Platz. The hotel is very close to the Naturkundemuseum (previously named 'Zinnowitzer') U-bahn station on the U6 line. We took a taxi to the Tegel airport from the hotel, which took only 20 minutes and cost under 20 euro. We didn't have breakfast at the hotel but I would recommend Chipps on Friedrichstasse, where we ate twice and enjoyed.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hampshire UK", "Title": "“Super, convenient for the centre and good value.”", "Author": "CW_1", "ReviewID": "UR108224119", "Content": "Stayed for 3 nights. Interesting location in what was once East Berlin. We chose a room facing inwards, so was very quiet. The surroundings are not pretty, but few places are in cities. The decor is modern and the bathroom very nice with a wet-room arrangement. Oddly, the main clothes hanging area is IN the large bathroom, but the ventialltion is very, good so damp isn't a problem. However, it did seem a strange arrangement! (We were in a Premium room, as a freee upgrade(!) so perhaps others are different.) This hotel is right by a U-bahn station so very easy to get to from Tegel airport. (Bus 128 for about 5 stops, then the U-bahn- took us about 30 minutes and cost very little.) However, don't forget Tegel is due to close in a year's time. The new airport is miles away in the south. The Friedrichstrasse U-bahn station is 2 stops away, with access to other lines and one is there on the end of \"Unter den Linden\", so can stroll along to the Brandenburg Gate, Reichstag etc. Breakfast is good, but not perhaps the cheapest, at about 16 Euros, however, there are cafes down the road- not far. However, overall, even at today's rubbish £ vs Eu exchange rate, we only paid about £53 per person per night B&B, which was amazing value. I wouldn't hesitate to recommend this hotel and would happily go there again, without looking for another. As an aside, my wife assures me that the chap who is the TV cook who does \"River Cottage\" was staying there at the same time as us!", "Date": "May 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edinburgh", "Title": "“Great Base for visiting Berlin”", "Author": "Scooter2074", "ReviewID": "UR108116928", "Content": "This was my first trip to Berlin and I was recommended to stay in Mitte. After some searching I found this hotel on the internet. I e-mailed the hotel in advance to ask for directions from Tegel airport to the hotel, these arrived very quickly and were easy to follow. It only took about 20min from the airport the the hotel. The hotel is very modern, meticulously clean and very friendly staff. I'd definitely recommend it as a base for all visitors to Berlin. 2 stops on the U6 and your at Freidrichstrasse station. The rooms were a great size, huge walk in shower - downside perhaps the TV, only german channels - would be good to have a couple of english speaking channels.", "Date": "May 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Farnborough, United Kingdom", "Title": "“Great location”", "Author": "bonny_hewlett", "ReviewID": "UR106870737", "Content": "We spent 3 nights at the Tryp Berlin. It's literally right outside the U bahn station which is 2-3 stops into the main centre or a 10 minute walk. It is very well located for all the main tourist spots such as the Berlin Wall, Brandenburg Gate and Checkpoint Charlie. It's also very close to the area with all the nice restaurants around orienburg. It is a nice modern hotel with clean rooms, a friendly reception and decent flat screen TV. Perfect hotel for a weekend away.", "Date": "May 4, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "london", "Title": "“Birthday”", "Author": "holiday54", "ReviewID": "UR106386172", "Content": "Stayed at Tryp for 4 nights for my husbands 60th Birthday. Everything was perfect - food, bedroom, (we were put in a premier room as it was a special occasion) at no extra cost. Breakfast was cheaper if you booked it for more than 2 days stay (10 Euros). I dont drink coffee so asked for a kettle to which was supplied immediately. Very good location and central for everywhere. Would recommend this Hotel.", "Date": "May 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“ok hotel”", "Author": "helpel", "ReviewID": "UR103245509", "Content": "ok hotee, chose it because of the special offer on the price when we booked. Hotel is situated not too far from Freidrich Strasse and is quite a good location, although the area is a bit run down. Hotel is modern and rooms nice, the shower is fantastic! No ketlle though, and be warned its the smallest cappucino in the world that they serve you at the bar (cost just under 3 euro). Fantastic chinese resaturant next door, and you are a short walking distance from all sorts of restaurants. Would particularly recommend CHIPPS restaurant on Freidrich Strasse for breakfast. Only negative thing about the hotel is that the housekeeping staff are not very good at knocking! We're not early risers and quickly learned to put the do not disturb sign on the door! The hotel charges for wifi, but if you go to Starbucks you can have up to two hours of wifi FREE! Oh, and you absolutely have to do the Segway Tour!!", "Date": "April 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“great value for money”", "Author": "kostasicebar", "ReviewID": "UR102689152", "Content": "right outside to the naturkundemuseum underground station (U6) was very easy to reach the hotel fron tegel airport.very modern and minimal decoration,big enough room and bathroom.very helpful and friendly reception.we booked it 3 months before so we get a very very cheap price.there are also many trams just outside the hotel so you wont need to use a taxi.wi-fi is expensive as the breakfast also(althouthwhen we arrived they gave us a good offer if we had breakfast all the days of our stay in the price of 10 euros per person instead of the normal price of 16 euros).beside hotel about 1 klm is the Bernauer Strasse Berlin Wall Memorial...don't miss it!!!", "Date": "April 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellent hotel”", "Author": "Flyingred", "ReviewID": "UR102433298", "Content": "The Tryp is a new hotel in a relatively quiet location, two stops north of Friederichstrasse on the U6 underground line. The entrance lobby is open plan with reception facing the bar and the dining area to the rear. It is minimalist, neat and efficient. We arrived before noon and the receptionist was very welcoming, attempting to see if clean rooms were available (they weren't) and she efficiently stored our bags so we could make a start sight-seeing. Our rooms were very neat, well-equipped and clean. I would have preferred coffee making facilities but their absence was not a deal-breaker. Wifi at €4.95 per hour was expensive. Skip the expensive breakfasts in their restaurant. Turn left out of the hotel and just before the junction with Invalidenstrasse there is a Balzac coffee bar - a German version of Starbucks. There is a Subway next door. There is a bistro opposite, which we didn't use. My recommendation for dining nearby is La Focaccia, at Chausseestrasse 20, on the next block after the Invalidenstrasse intersection.", "Date": "April 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“Good location and price...few flaws”", "Author": "chettle123", "ReviewID": "UR102280515", "Content": "We stayed late march, the average temp was over 10degrees. The rooms only have 'aircon' with minimum temperature of 20degrees!!! We phoned reception to check we were not being silly and missing a vital button..their advise...just turn the aircon off. we had the windows open from that point on...but could not have windows open at night as the road (mainly the trams) was loud at times. The room and public areas of the hotel were definitely too warm!!! The breakfast was v.good...offering cooked, savoury and sweet options. We liked the location, although there were no views of the city, the hotel was only 2 stops away from one of the main shopping streets....Friedrichstr. We used the public transport a lot, mainly due to it being a bit chilly!! It cost 8euro for a 4 day pass to zones a and b. We had to buy a ticket for zone c when we went back to the airport. We did not eat any other meals in the hotel, the menu did look nice...if not a little pricey staff were very polite and helpful. If i visited Berlin again I would want to pay a little more and have city views, but if good price is required, close enough to centre I would recommend to friends. One thing about Berlin....to visit the Reichstag...you now have to book AT LEAST 3 WEEKS IN ADVANCE or through a travel company...we didn’t get a chance to go in which was pretty gutting!! Berlin is a great place, I would suggest going in warmer months..as so much to see and look at outside!", "Date": "March 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Comfortable, Friendly and Good Service.”", "Author": "rpatel543", "ReviewID": "UR101740948", "Content": "The hotel staff are friendly, word of advice, they tend to throw two single beds together and label it a double bed. Just be persistent at the front desk and hopefully they'll be a king-size bed available which they can put you in instead. Didn't try the food so no comments on that. The gym was average and the sauna was an added perk. Area is average, some building work taking place. There's a few good restaurants nearby but not really the cheapest for drinking. But you can walk to Alexandraplatz and Friedrich Strasse with relative ease. All in all a very decent hotel.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Great location and very Clean”", "Author": "Monkeytree1", "ReviewID": "UR101620765", "Content": "Stayed here for 5 nights and was not disappointed. The staff were very friendly and spoke english very well which helped a lot. The hotel was nice and new and room very clean.The bathroom had a lovely large walk in shower. There wasn't any tea or coffee making facilites which I would have liked. Hopefully they will included this later, also the tv only has 2 english channels which happen to be the news, so you might want to take your laptop and watch films on that. The buffet breakfast was great with plenty of choice. It is right near the U6 subway so getting to the centre was easy. The internet it very expensive, but we found a cafe about 5 mins walk down the road called Vertigo and they had free internet. also not that most of the shops close on Sundays. We also ate at a lovely italian restuarant. Turn left out of the hotel and it is further down on the left. Would recomment this hotel and will stay here again when I next visit Belrin.", "Date": "March 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Great value”", "Author": "Depac", "ReviewID": "UR101293931", "Content": "Just returned from Berlin with six friends and chose this hotel as such great value and newly opened (Dec 2010). Good location, albeit limited restaurants on door step, you are only 15 minutes walk away. Fantastic rooms with great shower - ultra modern. Bar area is again very modern, and serve wonderful concktails. Staff could not be more helpful.", "Date": "March 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great hotel, ideal base for exploring and would highly recommend!”", "Author": "nasher_basher", "ReviewID": "UR100535577", "Content": "We stayed in tryp hotel in February 2011 for two nights for a short break. Hotel was in a good location as a base for exploring but not much in the area surrounding the hotel that I was aware of. The hotel is very new and therefore very clean and shiny with retro style deco. Reception very friendly and spoke good English. Rooms were a good size, we booked a double room and had two double beds pushed together which wasn't a big deal and very comfortable. Bathroom was nice and modern with an excellent shower! Our room came with minibar, safe and hairdryer as standard. Gym facilities were reasonable with a small gym and sauna on the top floor which could be used anytime. Sauna was nice after a long day in the cold!! Breakfast was very expensive €32 for two people wouldn't recommend it for the price. Nearest u-Bahn is Naturkundemuseum (Zinnowitzer Straße), easy links from the airport on the airport express (s-bahn) to friedrichstrasse. Would definitely stay here again!", "Date": "March 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nantes, France", "Title": "“Excellent Hotel”", "Author": "Pet0", "ReviewID": "UR99432233", "Content": "Last week I went to Berlin with my wife and stayed at the Tryp Berlin for three nights. The location was excellent, the staff was very friendly, the room was very modern and very clean and the price was fair (Since we were two, we paid almost the same price that we would have paid for a hostel). If I would go back to Berlin, I would definitely come back to this Hotel. I recommend it either for a leisure trip or for a business trip.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bomlitz, Germany", "Title": "“Great value hotel in good location”", "Author": "Sarahlou272", "ReviewID": "UR98421132", "Content": "We managed to get a half price weekend deal on this hotel with Lastminute.com. There was some roadworks immediately outside the front which made things a little difficult when we arrived with our car but we used the hotel car park which was very secure if a little expensive at EUR15.00 a day. The hotel itself resembles an up market Travelodge or Premier Inn with a modern design but even after only a couple of months of opening it is already showing signs of wear and tear which I think means the place could look a little run down within a year or so. Check-in was quick and the staff very friendly and helpful. The room was nicely decorated with a lovely bathroom, the shower was great but no matter how careful we were the bathroom did get flooded every time. The mini bar was extortionately priced and we were charged for something although we never used it but the reception staff waived the cost with no doubt. The beds were great and the room was quiet so we managed to get a really good nights sleep even though the room overlooked the main road. The room was let down by not having tea or coffee making facilities and upon asking we were told they are only available in the Premier rooms. The breakfast buffet was good value for money (for some reason we were only charged EUR10.00 per person). There was a really good selection but the food from the hot plate was only luke warm and the cereals were of cheap quality (which seems typical in German hotels). Not sure if it was an extreme means of portion control but they only had tea spoons and tiny tongs to serve food rather than large serving spoons which is not ideal when trying to get a bowl of grapes and you can only pick up one at a time. There was no restaurant but just an area off the main reception and lobby bar. The seating was set up in an informal way that was equivalent to that in a work or school canteen so you were seated in rows next to each other which doesn't seem in keeping with a 4 star establishment. The location was very good close to the Naturkunde U-bahn to take you all over Berlin but was also convenient to explore the east of Berlin on foot being within walking distance of many attractions.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Taunton, United Kingdom", "Title": "“Clean, comfortable, great location, good value for money”", "Author": "funedin", "ReviewID": "UR98134967", "Content": "Stayed one night, £40 excellent value. Friendly staff, in new hotel. Good sized room, again clean, brand new, lovely en suite. Excellent, quiet nights sleep. There is a Finnish sauna upstairs but we did not use it. Location 200m from subway with connections to all over Berlin. Close to Hauptbahnhof. Good restaurants and bars approx. 20mins walk away along safe streets. All in all very good for the price paid. Would definitely recommend this hotel.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Nice Hotel, Easy Access to the U-bahn”", "Author": "Thesultanofping", "ReviewID": "UR97823470", "Content": "I stayed at the Tryp hotel for 3 nights on the weekend of the 19th February. I booked a flight + hotel package through a website but needed to adjust the booking slightly shortly before my stay. I emailed the hotel directly to adjust the booking and they did so without any problems, replying to me within a day. The location of the hotel is very convenient to the U-bahn station which provides easy access to all of Berlin. Confusingly the U-bahn station must have changed its name fairly recently as some maps still had its old name \"Zinnowitzer Strasse\", its now called \"Naturkundesmuseum\". The area isn't the most glamourous, its very much on the edge of the city centre and a little rough around the edges but we (2 fairly big guys in our late twenties) felt fairly safe at all hours of the day and night. Its location is made by the proximity of the U-bahn but it is also only maybe 15 minutes walk from Friedrichdtrasse Bahnhof and 5 minutes from bars and restaurants at Orananienburgerstrasse. Service at the reception and the bar in the hotel was excellent. The bar workers in particular were very friendly. The bar generally had a few people hanging about, a few groups at times, but generally the lobby was pretty quiet and relaxed. The rooms were certainly not dirty but I did find a few stray long dark hairs that certainly weren't mine in the bathroom. They're modern and comfortable and the wooden floors were not as cold as I thought they would be. Our room was at the back of the hotel so I could open the window but at the front of the hotel this would probably be quite noisy. There was some construction work going on in the next building but it didn't cause us any problems. I didn't use the restaurant for any meals but the 16 euro breakfast is a bit expensive, a cheaper smaller option would be appreciated. All in all I'd say the hotel is decent, I'm not sure if its 4-star but its certainly modern and comfortable. I would probably best describe it as a more glamourous version of a good new Premier Inn!", "Date": "February 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hampshire", "Title": "“Super Hotel, Great value, Great service”", "Author": "nsmith73", "ReviewID": "UR97622680", "Content": "I was really impressed by this new Hotel (openend in December 2010). The rooms were very good - great shower, comfortable bed. Very friendly staf - very helpful.", "Date": "February 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“A relaxing and comfortable stay”", "Author": "RachelC2778", "ReviewID": "UR94269923", "Content": "I stayed for two nights at this personable hotel which is very close to the Naturkunde U-Banh in January 2011. I stayed on a room only basis so cannot make any comment about the restaurant. The room I was allocated was very comfortable, clean and warm. Staff on reception were friendly, efficient and multi-lingual. I am planning to return to Berlin soon and will definately be looking to see if I can book this hotel again.", "Date": "January 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Munich, Germany", "Title": "“best value for money”", "Author": "travelpussy_minga", "ReviewID": "UR94169176", "Content": "Berlin is full of hotel-options at reasonable prices. Must say - this is the best budget option I´ve ever experienced. Okay the area around the hotel is not really exciting or attractive but the subway \"Naturkundemuseum\" is just 100 m away and so you are right in the heart of Berlin within 10 min. The hotel is quite new. The reception area and entrance hall is quite modern furnished and nice to look at. The room was tidy, spacious and with a modern interior in neutrals. The bathroom was much bigger as expected and the shower huge - liket that. The bed was very comfortable and the room not noisy at all - though the hotel was fully booke due to a fair. Of course there was not much service to expect but the staff at the reception was very friendly and offered a room at the backside of the hotel. So I enjoyed a very silent night. All in all I am very satisfied with this hotel and will book it definately again.", "Date": "January 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Livingston, United Kingdom", "Title": "“Get the right room”", "Author": "steely28", "ReviewID": "UR93632658", "Content": "The tryp hotel is a modern and funky hotel in East Berlin, we stayed for 5 nights over the new year period. The hotel was easy to find and is very close to the underground station which allows easy access to the whole city. Check in was fine and the staff all seemed friendly enough. Breakfast was an additional 16 euro p/p which seemed expensive so we just ate at one of the many coffee shops, bakery's etc in town. We had a room on the 2nd floor, overlooking the road. When we arrived (on a weekend) the road had light traffic and we immediately noticed the noise, but initially we didnt think it was too bad. After a couple of nights the noise became a real pain, sirens. tooting horns etc, also the road is cobbled at this point which makes even more noise. The trams also pass directly in front and make a fair noise. We didn't ask for a move as we tried to ignore it so it's partly our own fault. To end on a positvie note ........... The shower was great !!!", "Date": "January 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“Long Berlin weekend”", "Author": "NJHomeRN", "ReviewID": "UR92830562", "Content": "This trip was a Christmas present for my husband. This hotel is very \"ultra\" modern in design. The staff is very helpful. The rooms are larger than your normal European hotel. The bathroom was also very modern and large. Did not pay the extra $16EU/ per person for the breakfast buffet, however it did look nice. Our room facing the street did provide for a lot of noise traffic wise, but we were in a city.", "Date": "January 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "glasgow", "Title": "“Room - lovely, Breakfast - superb, Staff - great..just a few teething problems that could be easily fixed..”", "Author": "palmsie", "ReviewID": "UR91875410", "Content": "Hotel is fresh, contemporary, stylish and very very cool. Great bar in the foyer. Brilliant location (walkable to central district & train station. Tube is directly outside). Restaurant food is excellent for breakfast & dinners - a wee bit expensive for food though (although at least at breakfast there's an amazing buffet big enough to keep you going until dinner time!!). The staff are friendly, helpful and generally really lovely people. Check in was prompt. We were placed in a very large & most impressive premier room on the 4th floor (it was just luck, we didn't request it) where we presented with a huge 4-man very comfortable bed (big enough for both of you to 'starfish')!!! Great showers (2 in one beautifully tiled enclosure) & an OK hair dryer (not great power, but did the job). There is also a coffee/tea maker in the premier rooms. Issue 1-this is NOT replenished when the room is serviced, so you need to ask reception every time you run out of tea, coffee or the milk sachets. There is also a gym & sauna on floor 6. The gym is small but has a great range of machines and an exercise Mat. Issue 2 - when in use, you could hear the treadmill from our room! Kind of annoying if you want a lie-in & there's someone pounding away at 7.30 in the morning. A dull Bang, bang, bang was heard on several mornings.....The hotel should think about sound proofing the gym area. There are 2 lifts and a flight of stairs. Issue 3 - Guests are not permitted to use 1 of the lifts (opposite the premier room) - (if you try to get to 'Ground') you end up in the laundry area on the ground floor, although you can get to reception through a side door entering the restaurant. We were told off (very nicely I must say) by one of the waiters that this lift/door was for staff only. Also, if you want to work off some of your beers and apfel strudel the stairs are a 'no go' - you end up in the same laundry area!! The hotel should clearly mark that this lift / stairwell is for staff use only. As in most hotels the rooms are serviced every day - this consisted ( i think) of fresh towels and a wipe around the sink. Issue 4 - the bed making is pretty poor to be honest (I am being too picky??) - the duvet often looked very crumpled (I'm sure on one day it wasn't touched at all) & I'm not sure that the floors were well cleaned. A bit sloppy on the room servicing front, but fine if perhaps room rates are kept low as a consequence (or if this is to save on using harmful detergents)- this should be made clear to patrons though. And finally, Issue 5 - they use huge metal crates to shift the dirty linen - they are loud. Ironically base camp for these crates was opposite our 'premier' room. (the door to this room with the crates was generally open & not that aesthetically pleasing) . So we also had crashing and banging noises some mornings from the laundry crates. Despite these issues, I have rated the hotel highly. I would definitely go back. It has huge potential - we're just telling you about this minor issues - so you can become even more brilliant going forward! x", "Date": "January 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "saarbruecken, Germany", "Title": "“perfect stay”", "Author": "mhbusby", "ReviewID": "UR89772909", "Content": "location is nearly perfect. U-Bahn (tube) and tram are directly at the hotel. S-Bahn is just a 3 minutes walk around the corner. There are a few restaurants nearbymainly french and italian but also a typical Berlin restaurant (Kellerrestaurant) in the Brecht Haus. The rooms were very new (opened 1st of december) and because it belongs to sol hotels quite a lot of spanish people and the nice feeling of being in the south (even if it was quite cold - 10°). Very friendly staff German, English and spanish speaking very helpful. Near to Alexanderplatz and Friedrichstrasse. Very comfy beds and instead of a bathtub a real big shower - lovely. At the lobby there is a bar to get some drinks, the hotel is quite stylish and, modern We had a room to the rear was very quite and it is possible to open the windows. Air condition (heating) was perfectly working.", "Date": "December 13, 2010"}], "HotelInfo": {"Name": "Tryp Berlin", "HotelURL": "/ShowUserReviews-g187323-d1917207-Reviews-Tryp_Berlin-Berlin.html", "Price": "$88 - $230*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Chausseestrasse 33</span>, <span class=\"locality\"><span property=\"v:postal-code\">10115</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "1917207", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/af/26/af2648bd2b1bd3fb6474ec48facb0dae4large.jpg"}}