{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Never again”", "Author": "zs30", "ReviewID": "UR126348278", "Content": "Rude staff,not welcoming at all,ruined our weekend.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Bodmin, United Kingdom", "Title": "“small room and unhelpful staff”", "Author": "philip w", "ReviewID": "UR126035367", "Content": "we booked 2 nights stay and was very disappointed with the hotel , room was very small with a tiny shower/ wc , more like you would find in a caravan , staff were unhelpful , i only asked for extra pillows but no joy , breakfast was very basic , tea /toast/cereals/ and juice.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "", "Title": "“Cramped and uncomfortable”", "Author": "Lamca274", "ReviewID": "UR125732980", "Content": "I booked this place mainly for its price and reasonable reviews. Located in Pimlico and about 10 minutes' walk from the Victoria Station and various eateries and supermarkets, this bed and breakfast inn offered a simple continental breakfast and relatively comfortable bed. The wifi was not free but reasonably priced at 1 pound/24 hours, and you could use the internet for free on the computer in the reception area. The place was monitored by CCTV and the rooms were fairly clean although some of the blankets had some mysterious stains on them. This place was let down mainly by the very poorly designed open-plan shower/toilet which was extremely cramped with the toilet being right adjacent to the shower screen and no separating stall so that the shower water would run under the screen and right into the toilet floor, unless absorbed by a shower mat. There was also no light in the shower so one had to shower in the semi-darkness with only the lonely toilet bulb providing some feeble lighting. The shower pressure was good but the temperature was temperamental and I alternated between getting scalded and gasping in the cold when taking a shower. There was also no hairdryer, no jug to boil water and no helpful list of internal numbers and other hotel services. Also the new towels had a pungent food-like smell to them. I had no complaints about the staff although it appeared that some of the guests were not too happy with some of their pricing options. Overall this place was very basic and average, but if low cost and good location are paramount to you and you are desperate, then this hotel is tolerable.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Queensland", "Title": "“Tiny room & Miniscule bathroom, but good sleep!”", "Author": "LorrainePAustralia", "ReviewID": "UR123352901", "Content": "Stayed here two nights. Not too far to walk from Pimlico tube. A very small \"double\" room, a pre-fab miniscule en-suite bathroom, but all clean and slept well at a good price for London (44 pounds per double per day). Used the Wifi which worked well in the room - cost one pound per day. Basic breakfast included. Manager was a bit offhand and not very welcoming, but other than that no real complaints.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“Good little budget hotel”", "Author": "Tiramisuli", "ReviewID": "UR120825534", "Content": "The overall impression of this hotel was good. It is a tidy, little hotel for budget travellers on prime location near Victoria. The price/quality ration considering the location is good. The rooms were tidy and service was ok. Some minor things lacking though. There was not any kind of glasses or cups in the room, nor anything to boil tea. Ok, tea is not so necessary, but it would be nice to have at least a glass for drinking. Breakfast consisted of toast and cereals. Bacon and eggs would have been nice, but not necessary for this price. However another toaster would be nice, the queues were long while people were waiting to get their bread toasted and if one is in a hurry there is no time to get any warm toasts. I have been in a couple of other hotels in the same area, some which were better than this, and some much worse. So in the end this could be a good choice when staying in London.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Remember, this is the most expensive real estate in the world!”", "Author": "jonnyac", "ReviewID": "UR118360723", "Content": "This hotel is exactly what I expected it to be. We had a basement room which was booked as a double and there was actually also a single in there too. I'm not complaining as it gave us somewhere to put the bags. As a native Londoner I knew what to expect in terms of size and I have had the same in Rome, Madrid and Paris etc. The room was clean, the en-suite bathroom had a great shower, the bed was comfortable and the TV, although small, worked with a great picture from the bed. The reception was twenty four hour and we could leave our bags as long as we needed the next day. It's a short walk to the coach or train station which is why we booked it. The fact is you're in London and very central. When I stay in cities around the world the quality of my hotel room is always second to location because I'm there to see the city not to sit in my room and stare at the walls. I have one very important comment which nearly made me review this as very poor. Don't get reception to book a cab for you, take a black cab from outside there are plenty around or walk up to the station. The receptionist did us a favor of calling his friend to take us because he was reliable and fairly priced. What this means is they over charge you and the receptionist gets around 50% of your overpriced fare. I know this because from where I sat I could see the message on the drivers PDA which said he forgot to give the reception Â£10, our fare was Â£22.", "Date": "September 20, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Shrewsbury, United Kingdom", "Title": "“horrible filthy dirty hovel”", "Author": "JRB1968", "ReviewID": "UR117355875", "Content": "this really was the worst of all dirty shabby B&B, s i have stayed at in london or any where else we are 4 guys working away from home in construction and are no way fussy !!! but our office book us in this place and when we arrived the guy took us half way down the street to some house which was a flea pit ... when we said we did not want to stay he just said will charge your credit card anyway horrible place run by horrible people ...DONT STAY THERE AND DONT GIVE THEM YOUR CARD NUMBER !!!", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Glostrup, Denmark", "Title": "“Low quality but survivable”", "Author": "Stine H", "ReviewID": "UR116482999", "Content": "We got two en suite double rooms. The one my parents stayed in had a broken tv, but they were otherwise pleased with the room. We had issues with the heat, which was unbearable due to a lack of suitable ventilation. The sash window had a lock on it, but it was broken, which left us uneasy as the room was on the ground floor. We even returned once to find the maid had left the window wide open, which was necessary due to the heat, but concerning for our property nonetheless! The bed was made once a day, but the sheets and towels were changed every two. The room was otherwise clean. Personally I found the matress very hard for my comfort, but the rest of my family were fine. Breakfast was (the bad kind of) simple. The dining room was in the cellar and could only accomodate about 20 people and even then it was cramped. People would arrive to find no seating available and would queue in between the door area and serving table. The toaster had 4 slots and people would (again) queue to even get their bread toasted. All on all, the breakfast secnario left me mildly stressed and eating there was uncomfortable. I would advise visitors to arrive at 8 for breakfast to get a table as the breakfast is only served for an hour. We went there as soon as possible (at 8) and it reduced the stress and we had our breakfast with less waiting. We also brought our own cheese to put on the bread, the jam and butter is otherwise all that is made available by the hotel.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "2.0", "Value": "1", "Service": "1"}, "AuthorLocation": "angus", "Title": "“booked colliers hotel for 2 nights put was put to 2 others!”", "Author": "drumsman", "ReviewID": "UR115114379", "Content": "this review is for the colliers hotel but hey,i only went there for breakfast,any one thinking about going would be advised to ask if ,a ,what hotel will i be in,b,will the broken lamp,tv remote, window,curtains ,be extra,Â£60 a night in london is cheap but,but treating people like this,will only end in bad reveiws,this is mine.", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "leeds", "Title": "“Oh My God”", "Author": "juliecc", "ReviewID": "UR114712927", "Content": "unfriendly , unhelpful, ignorant staff, dirty, smelly hotel, room was like a cupboard, window didnt lock, would never ever suggest anybody stays hear, continental breakfast means cornflakes and toast which you have to make yourself, then sit in the cellar to eat it.", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Hotel or hostel”", "Author": "judywebs", "ReviewID": "UR111612699", "Content": "Stayed 3 nights and wished I was anywhere but there. Toilet leaked and towels were placed around it instead of fixing it! Not even a plastic mug in the bathroom.Towels were dirty as was the carpet. Breakfast was the meanest I have ever seen; a stack of white bread plus toaster, a choice of cornflakes or cornflakes, cracked cups and plates and coffee in an old sugar shaker. I was asked for the first night's payment in cash and paid for the other two nights up front! It felt like maximum payment for minimum outlay. Other hotels in the road looked more pleasant.", "Date": "June 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Stoke-on-Trent, United Kingdom", "Title": "“PLEASE DONT EVER GO IN HERE”", "Author": "GrahamNorton", "ReviewID": "UR108796736", "Content": "Was in London for a conference. I booked a single room, and was offered a single room that was OK initially. on my last day I when i came back around 12.00 am I was told that i've been moved into a different room. Then i was told that room is in a different hotel 2 min away. This room was a box of a box room. it had a bed that is 2 feet wide and about 5 feet tall and the room could barely contain the bed. that's how small it was. when confronted, the manager (like person) was so rude and offered a refund for me to leave right away. They apparently didn't have a single room vacant but still accepted my reservation. Please be aware when you book.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“USELESS”", "Author": "RINEHART10", "ReviewID": "UR101087400", "Content": "Arrived late at night only to be infomed that the second room we had booked was not available and our friends had to stay in a hotel about a mile away. The manager had an extremely bad attitude and was very unhelpful we stayed one night and were then transferred to another hotel. We were not impressed with the staff and received no co-operation from then only stories about some electrical faults or water problems very unprofessional to say the least.", "Date": "March 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ayrshire", "Title": "“Flawed but still a bargain”", "Author": "Barco84", "ReviewID": "UR99302386", "Content": "Room was an outside cellar and wasn't the most comfortable (the heating, or lack of, being a major issue) but what do you expect for Â£23 a night? Considering that's the London financial equivalent to sharing a hostel room with fifteen or so people you could do so, so much worse. Granted I lost sleep anyway due to the lack of quilt provided but I'd rather that than a backpacker snoring in the bunk above me! I wanted somewhere central to drop my stuff off and sleep after a heavy a night out so this was ideal - I appreciate it won't be to those who want to stay in the room longer. Depends on your budget at the end of the day. Sink was in the room. Toilet and shower was shared with a few other. The WC room was so tiny it makes an airport toilet feel gigantic. You can literally have a shower and use the toilet at the same time - not that I tried to master that art or anything! Didn't bother with breakfast as there was a queue and the things on show didn't seem that appetising. Hotel staff friendly enough, offering to hold my bag free of charge and happily providing information on events and allowing free internet usage. Television and DVD facilities available, though the freeview signal is terrible and can only get a few clear channels. Phone signal could also be better. Would definitely stay again for the price and location.", "Date": "March 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Liverpool", "Title": "“Good budget hotel”", "Author": "bo22", "ReviewID": "UR97616524", "Content": "Stayed at this hotel in February '11...wasn't expecting too much for the price I paid - about Â£55. However the room was nicely furnished with matching furniture, small flat screen TV. The room and bathroom were only small but were spotless. Can't comment on the breakfast as it was only served between 8am - 9am and I had a sleep in! Close by are some nice local shops and restaurants Would be happy to stay there again.", "Date": "February 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Portsmouth, England", "Title": "“Great Location”", "Author": "treacle/simon", "ReviewID": "UR97333151", "Content": "Ok - this is not a palace but we got a great price for this centrally located hotel. We were within walking distance of Victoria Train and Coach stations. The area itself is charming, beautiful buildings and parks etc and close to the Thanes. The room was small and if you were 'large' you might have trouble using the bathrooms facilities but we were ok. My only preference would have been if they had duvets on the bed not blankets as I personally did not like them so chose to sleep on top of the bed instead", "Date": "February 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Great cheap hotel, worth a look”", "Author": "kate8624", "ReviewID": "UR93762030", "Content": "The low room prices for this hotel definately make it an attractive option, however after reading other reviews I expected the worst. I was pleasantly suprised with this hotel, for the price you can't expect luxury but the room was clean, decent bed, small mounted t.v. and a small but sufficent shower with hot water and good water pressure, it's all you need to be comfortable. The man on reception was very polite and helpful. This hotel is perfect if you need cheap accommodation with the basics. Also good location. I would definately recommend this hotel", "Date": "January 19, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Budapest", "Title": "“For backpackers far better than reviews suggest”", "Author": "walkun", "ReviewID": "UR87331299", "Content": "If you are on a low budget, it could be a good choice - good location, rooms are ok enough to spend the nights. Definetely not a spa hotel, you get small rooms, narrow staircase, the shower and toilet have a feeling reminiscent of airplanes, but we havent seen any bedbugs, mold, and alike that other reviews mentioned. Staff wasnt unfriendly rather they poorly understand English, i guess. Breakfast is simple, and you have to make your tea and toast, big business, hah?! All in all, we're pretty satisfied, it was ok for the price.", "Date": "November 16, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Ayr, United Kingdom", "Title": "“Poor Hotel - Good Location,”", "Author": "looby51", "ReviewID": "UR83574239", "Content": "Worst hotel we have stayed in, unhelpful staff, bed not made, no fresh towels, breakfast not ready, breakfast poor choice, however location and shower were good", "Date": "October 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lincoln, United Kingdom", "Title": "“I've been in far worse hotels, much better than most reviews suggest!”", "Author": "Dazmb", "ReviewID": "UR82729166", "Content": "Summary: An ok hotel. Pay Â£55-67 for a double en-suite and you will be fine. I can't vouch for the single rooms with shared bathrooms - I guess they will be far worse. You do after all get what you pay for in London hotels. If you pay Â£20-Â£30 a night what do you expect? So ok, just stayed @ Colliers for 4 nights on a business trip. And having read the reviews on TA I was fearing the worst. However, I was very pleasantly surprised. It's actually pretty middling in terms of quality and cleanliness. But it's not without some issues. Good points : - The hotel has a nice enough reception and entrance (some marble steps no less..) and it looks like it has had some recent money spent on it for refurbishment. This is true of the carpets which are new all throughout the starways and certainly were in my room. Decor is in good state too. - If you (like me) get one of the en-suite rooms on the top floor you will have a nice newish bathroom that whilst small is totally adequate. - The beds were made every day, the bin emptied and the towels were clean and new. - The noise levels were low both outside as it's in a decent area in Victoria. - Local shops and pubs are plentiful and major public transport links (Rail/Bus/U-Grnd) are 200m's away. - Safety is good with smoke detectors and camera's and key cards for the rooms. Bad points: - There is clearly a bit of a problem with damp in the hotel stairways as the odour of damp is quite high and they have to have a window open in one of the landings to help diffuse it. This odour was also present a little bit in my room. - There was some dry paint flakes on the carpet (not sure where that came from), and some of the stairway woodwork needs a bit of TLC. - The breakfast (and the breakfast room) is the thing that lets the hotel down the most IMO. The breakfast is basic and poor and the room just is not big enough for all those wanting to use it especially as breakfast lasts for only for 1 hour. There is also some room for improvement in the cleanliness of the sideboards where the food is taken from. And the lady who 'supervises' breakfast spends most of her time talking on a mobile phone is some east european language!", "Date": "October 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Great location but thats where it ends.”", "Author": "gridsysmith", "ReviewID": "UR72402862", "Content": "Wow. Only a few minutes walk from Victoria stations and sites. Great. But thats where the positive points end i'm afraid. Arrived at the hotel to check in. Handed over our details and the guy couldn't find us on the check in list despite us pointing our names out on it 4 time over. Then we discovered our room was not ready for another 3 hours despite us paying extra for an early check in via the internet. So we left our bags in an non-secure room. Our room was clean enough and the only faults were a leaking toilet that was letting water out at the seal around the base and a flip-bin that was broken and would not open despite my efforts. The room was absolutely tiny as was the en-suite but hey it's London so not that much of a concern. Bed was incredibly uncomfortable and due to being on a main street we were woken up by several incidents involving police cars screaming by with sirens blaring out. Had about 2 hours sleep in the end. Not the hotels fault but at least we had a refreshing continental breakfast to look forward to. Continental meaning a corn flakes dispenser and toast/morrisons 20p flimsy bread. The tea was rank, the milk was off and the orange juice which is dispensed by two ladies guarding the kitchen area was disgusting. We had to go elsewhere for breakfast and the breakfast room was tiny and did not accommodate for the number of guests. We also had to clean dow the table from the previous users as the 2 ladies who run the kitchen were to busy having a chat. In the end we were just glad to get out of there. Its really a hostel with hotel prices.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Auckland", "Title": "“There are better value hotels than this one.”", "Author": "FALEVILLE", "ReviewID": "UR60237806", "Content": "Stayed here for 3days after I came back from europe. Don't get me wrong the hotel is more nicer than other hotels but it is not worth the money we paid for. We paid 55 pounds per night for a room with bathroom and shower. Our room was so narrow and small that you have to close the room door to get into the bathroom. Whoever cleaned the room DIDNT....they literally just threw the covers of the blankets on it and didn't even vaccum the room. The bathroom had the shower and toilet in AND the shower didnt have a shower curtain in which everything got wet especially the toilet paper (I already asked the management for the curtain in which they told me..\"but you have more space in the shower without one\"). The hall and corridor down to the breakfast rooms smelt so old and damp. the breakfast was the basic cereal, toast etc. the internet was crap and you had to pay for it. Will not be staying here again. You can get better value somewhere else and you need it in a place like london. I'm from nz where every cent counts and 1GBP is equal to 3NZ dollars.", "Date": "April 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Plymouth", "Title": "“Nasty, nasty, nasty!!!!!!”", "Author": "fgracja", "ReviewID": "UR58230478", "Content": "Nasty, nasty, nasty, stained sheets, horrible and unhelpful staff. Shower donâ€™t work, and the water was cold. Please any other hotel in Victoria but not this one. I go over on business all the time and stay in Victoria, but will never stay with them again.", "Date": "March 10, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Paris", "Title": "“A terrible, terrible hotel.”", "Author": "Paris093", "ReviewID": "UR39380175", "Content": "Poor service, dirty and dangerous (ancient electrical wires hanging everywhere, old socketsâ€¦). This hotel is a trap for people who wish to find a cheap basic London hotel by internet. It seems that all their clients reserve/pay for their stay in advance by internet. So, when they stick you in a miniscule, dirty room looking onto the street with a large window that cannot shut, you are stuck. They were supposedly constructing a bathroom on our floor while we were there, i.e., the renovations are being funded by the client who suffers from (1) the noise of the construction beginning very early in the morning; and (2) the fact of having to go to a toilet/shower 2 stories below. Read the rest of the commentaries on this site for more. Thanks again to the Internet and client feedback. I regret not having consulted this before!", "Date": "August 31, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Australia", "Title": "“Walked in, walked out”", "Author": "ardanon", "ReviewID": "UR37482754", "Content": "Totally filthy. Walked in, paid for the night and then was shown my room. I put down my bags and immediately went back out to see if the other hotels on the street had vacancies. Shared toilet and bathroom, very poor security, pretty sure my room was actually an old drain in a thin coat of plaster. Smelt like it, too.", "Date": "August 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "estonia", "Title": "“it is ok hotell. the price is very normal. if you need luxury just go and visit 5 * hotell and dont complain.”", "Author": "signes", "ReviewID": "UR37368502", "Content": "I picked this hotel because of the location, it's a short walk from everywhere. the price was very ok. the breakfast was just breakfast. the bread and marmelad and tea were ok, but coffe and oringe juice were awfull. usually we had coffe and some food a later somewhere. The room was basically only two beds and a basin. Toilet and shower where shared with the rest of the hotel. it was not so bad. the sheets were clean:)", "Date": "August 11, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Valongo - Porto - Portugal", "Title": "“Basic”", "Author": "RaquelFerreira", "ReviewID": "UR33261540", "Content": "The room was basic compared with price. The breakfast was very good. Good location and calm. The staff was friendly.", "Date": "June 26, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Glasgow", "Title": "“Id rather sleep on the street”", "Author": "ScottishWarrior", "ReviewID": "UR31040611", "Content": "booked a single room for one evening whilst in london, the room dirty,there were bare hot pipes running up wall and across ceiling one of which was hangiung down, carpet was dirty and not fitted to room, the shared toilet, yes shared was also dirty , dry rot running up wall and the shower head was alive with dirt and also had toilet paper around it. I have photos of it all, breakfast in the morning , well it was all self service and I mean everything , that was your cerial, yes that was all you got, will never use again, will never reccomend and will be reporting this hotel to the relevant people.", "Date": "May 28, 2009"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Just for sleep”", "Author": "LulaQ", "ReviewID": "UR23750428", "Content": "I picked this hotel because of the location, it's a short walk from Victoria station which is a main hub for major sightseeing. It's a short walk until you reach Buckingham Palace and onto St. James Park and so on. The residential street was nice and felt very \"English\". As far as the hotel itself: it served its main purpose which was sleep. This is not a luxury stay by any means but for those who are low-maintenance it shouldn't be a problem. Breakfast is served in the morning and it's a simple one of cornflakes, toast, coffee and juice. When I was there it was deathly silent in the eating room and the women who were serving didn't look very happy to be alive! The room I stayed in was a no-frills double that had a wet spot on the floor. It was one of the more basic places I've stayed in, but it wasn't a problem considering I just used it for sleep. Romantic getaway this is not!", "Date": "January 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "norway", "Title": "“Good Location but rooms were ok..........”", "Author": "christinia81", "ReviewID": "UR23222396", "Content": "We stay in colliers hotel just for 1 night & its bad experience but compare to price its ok start with t.v.in the room just 2 channels were working & just 2 bathrooms are there in whole hotel & there were many rooms sharing it..I think you need a sense of humour to visit this place. It's fine but it's not a hotel. It's a strange b&b that is cheap enough by London standards breakfast room was nice but in morning 7.45 we went to have breakfast we see reception boy & room cleaner girl kissing each other although we don't mind might be they were couple but just they told us to come at 8'oclock for beakfast. & since breakfast timing is 8-9 so that's fine with us atlast we want cab which they help us.I think you get what you pay for. Overall it was satisfactory.", "Date": "January 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Gothenburg, Sweden", "Title": "“On the verge of unacceptable”", "Author": "Fruttidimare", "ReviewID": "UR23025571", "Content": "We where staying at this hotel since we wanted a budget one and I guess we got what we where paying for. The room was basically only two beds and a basin. Toilet and shower where shared with the rest of the hotel. The sound isolation was very poor and you could hear anything going on in the nearest room and out on the street. The breakfast was ok considering the hotel standard although it only includes cereals and white bread. The staff where friendly and the location is excellent but all in all do I think that you could get a nicer hotel for the same money down the road.", "Date": "December 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "torento", "Title": "“Good Employee & Budget hotel”", "Author": "anirTorento", "ReviewID": "UR21878645", "Content": "We had stay in this hotel & found it all right since when we check in around mid-day time reception staff help us for our luggage room were small but clean & comfortable.Breakfast was simple but in that price its well & good.At last they help us by giving adapter,iron,hair dryer its really I appreciate.We will go back to this hotel in near future.", "Date": "November 15, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Location": "3"}, "AuthorLocation": "Dublin", "Title": "“Disaster!!! Don't go there!”", "Author": "ReneDublin", "ReviewID": "UR21398422", "Content": "Me and my husband booked Colliers a month before going to London. We recived confirmation by email and I called them twice to confirm our booking. They ensured me that everything is booked. When we arrived they told us that the room we booked is not available.They cancelled our booking. Very rude man (with disgusting long nails) from the \"reception\" (the hole in a wall) told us that he sent us an email YESTERDAY!!! We were furious, because we have not received any emial, especially 1 day before coming to London. We checked mailbox in front of him and of course there was nothing form Colliers. He showed us his screen and he sent an email but to HIMSELF!!! Can you believe? It was unbelievable, we were so angry. We ended up trying to find some hotel ad-hoc, it was bank holiday and it was very hard to find something. I do not recommend this B&B, very shabby place with rude, damp, unproffesional service. Don't ruin your stay in this busy and attractive city. Renata from Dublin.", "Date": "October 30, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "UK", "Title": "“Right! Not in your wildest dreams!”", "Author": "imahappytourist", "ReviewID": "UR18384207", "Content": "There were 4 of us, 3 adults and a 3-year-old child. I booked an en suite room in Colliers for 3 nights. However upon arrival, I was told that I wouldn't get an en suite room for the first night (Apparently, my room was taken!). People with babies will understand how inconvenient things were for us! When we tried to open the door, something was stopping us. There was a bed which prevented it to be fully opened! They must have added another bed to our room when our original room was taken! Talking about professionalism, tsk tsk. When we entered the room, we were shocked by the condition of it. It was...beyond description! Everything was wrongly positioned (because the additional bed wasn't mean to be there!). The cupboard was placed right in front of the basin, which means that we had to stand next to the basin when using it, tilting forward if we needed the mirror! Not only that, the window was broken and we were on ground floor! People could just jump in and say hi (I wouldn't complain if it was Brad Pitt, tho). We knew it was a budget hotel, but it didn't have to be that bad to reflect the price? lol. Initially, we wanted to tell them that we didn't want to stay for the remaining 2 nights but I was sooo paranoid that he was gonna kill us or something that night so we left it till tomorrow! I called them to cancel our booking but they got so mad!!! They raised their voice and said that I should have told them the day before if we knew we didn't want it. And my reply was, they should have told us that they couldn't provide us an en suite room for 3 nights before we arrived! They breached the terms of the contract! And they didn't know what to say and hung up. I tried to call back but there was no answer. The nx time I travel, I won't mind forking out a lil' more. =)", "Date": "July 29, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Salem, Oregon", "Title": "“Colliers Hotel, \"The ultimate in comfortable\" -- NOT!”", "Author": "sjaKeizer", "ReviewID": "UR18360543", "Content": "This hotel bills itself as \"the ultimate in comfortable\" but it falls far short of meeting the mark. While it is clean and in a convenient location (very near Victoria Station), and is reasonably inexpensive for the area, we experienced many problems. Upon arrival the evening manager was in the process of yelling at a young couple who were simply complaining that they had paid for a double bed and were given a single. Literally -- his voice was raised far beyond comfort level and they were being told to leave (without a refund) if they didn't like it. We had booked 5 nights and were told (in a much more polite tone) that if our travel plans changed, we were not entitled to the advertised three-day cancellation notice because we had booked online. We were given the option of paying for the 5 nights in full or leaving then and there. There is no lift (a minor inconvenience unless you have bad knees); the bathroom was so small that you couldn't use the toilet with the door shut; the shower wavered between too hot and too cold, with a few seconds between where you could actually stand under it; the bathroom fan vented the steam directly into the room; the furniture was a couple of plywood desks and a wobbly wardrobe, which took up so much of the limited floor space that you could barely get around the bed; the telephone only allowed incoming calls (you couldn't call out even with a calling card -- in fact, you couldn't even call down to the front desk!); and on our third night the building fire alarm went off repeatedly from 10pm to 5am, every half hour or so. In the morning when we asked for either a refund for the night of no sleep or to be let out of our 5-day obligation, we were literally yelled at and told that refunds were impossible. Another guest who joined in our conversation was insulted by the manager and told to leave the premises. Note: Neither we nor the other guests we observed approached these requests as demands. We were all quite polite, but were not treated with reciprocal civility. (On a happier note, after putting on a sappy-sweet and overly understanding composure, I was successful in getting out of the last two nights' contract.) In summary, if you're looking for a reasonably priced place right in the heart of town, and you don't mind some serious inconveniences, this place might be alright -- but beware of doing anything to set off the volatile employees/managers.", "Date": "July 28, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Finland", "Title": "“You get what you pay for”", "Author": "Tuomas", "ReviewID": "UR17338027", "Content": "I paid so low price that i can't ask more. Yes, hotel was a little filthy but breakfast was good and bed was clean and comfortable. Situation is also very good. So if you need ONLY place to sleep and something to eat before leaving to sight-seeing, Colliers is ok. Oh, and the shower worked properly and it was clean also. I booked from travelstay.com where the price was very low then.", "Date": "June 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Stockholm", "Title": "“Disgusting!!! (Lice/Fleas?)”", "Author": "QASIK", "ReviewID": "UR16553475", "Content": "The place was really.. REALLY filthy. Not at all as nice as presented on their web site. We had two rooms, one on ground floor that was allmost new and quite ok. But the one on top floor with wc in hall was like in a horror movie. That wc has probably never been cleaned. Lots and lots of DNA - if you know what i mean. The wall-to-wall carpets are a focus of diseases, and the bed covers as well. I'm allmost 100% certain of that the bug bites and my allergic reaction two days after staying there, came from the bed in Colliers \"Horror\" Hotel. The only really good thing was the man that seemed to work 24/7. He was so kind and service minded, that i felt sorry for him. He even wrote us a map, and gave us good tips about best way to see London. The sad part is that it's really hard to find a clean B&B/Budget hotel in London. WHY?!! I some times seriously wonder if all english people are as dirty and unhealthy as their small hotels.", "Date": "June 1, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Ireland", "Title": "“Disgusting pls don't stay at this hotel”", "Author": "gb2007wa", "ReviewID": "UR13685851", "Content": "It was hell on earth. Everything about it was hell, we had a 19 month old baby travelling with us, I booked ths hotel in August and emailed the hotel twice asking them if they would have a travel cot available for us and we would pay the extra charge etc, they never answered my emails and now I know why. When we booked in we asked for the cot and were told to go out and buy one at a shop down the road!!!! We were then given a basement room and our baby had to sleep in our bed with us, there was no headboard on the bed and the back of the bed was not against a wall with the result that our child fell out of bed one night!!! My blood is boiling as I type this because of the danger of that room, we had to go down two flights of stairs with a pram to get to the room and then there was 2 foot of space on one side of the bed to walk through the room! There was a steep step into the bathroom which again caused problems with a young child. The stairs were failing apart as I was walking on one step it fell right through!! The next day it was repaired with staples!! The room was so filithy and disgusting, the pillows were dark brown with stains! We were freezing, the breakfast was disgracefull, we were there for 4 night and not once were our 2 towels changed, there was 1 tv channel on the tellie! I have been in many hotels around the world and I have never come across anything like this, I could write a book on the place it was so bad, in fact I am going to fill in every review I can find to warn people about this place..please do not alow anyone else to stay here, it is beyond words how bad it is. In case you are wondering why we stayed there, well it was because we had no choice, we walked to 9 neighbouring b&b's and hotels and all were booked out as it was the bank holiday weekend. The rate for the hotel is cheap but for gods sake they would want to pay people to stay there instead of the other way around. And when we booked in they tried telling us that the price was 190 instead of 160, we had to take out our print out from booking.com to correct them. The site is very easy to use however I think you should remove this hotel from your website as it is horiffic, dirty, filthy, the worst I have ever stayed in, can'nt believe a hotel can be so disgusting", "Date": "February 19, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "england", "Title": "“Never in your wildest dreams”", "Author": "noddyears", "ReviewID": "UR13147048", "Content": "I booked this Hotel(if you can call it that) for my partner, myself, son and his girlfriend for a two night stay, boy how I wished I had'nt. When we arrived our train was late which made us late on arrivign at our Hotel,we only had time to check in put our case in our rabbit hutch and rush tothe theatre. On arrival the receptionist was in a tiny room full of smoke and informed us our rooms were in the basement. The stairs were very narrow, the rooms were dull, dirty and draughty, although the sheets were cleen, the rest of bedding was disgusting. We would have tried to find somewhere else to stay but did not have enough time. Breakfast, well that was a joke, dirty tables, none of the staff spoke to us, crockery dirty and cornflakes already poured in a bowl, no choice, toast which was almost toasted and boiled water to pour on the tea bag which was in a dish with butter and jam, once again dirty, the floor was dirty and the carpets in the rooms needed agood hoovering. The box in which the shower and toilet was situated was tiny and a huge step up to get in. I know it was in the cheaper stay section but really it should be clean. A warning to others don't be taken in by photographs and description, you'll be sorrrrry. Rating out of ten minus one.", "Date": "January 31, 2008"}, {"Ratings": {"Overall": "1.0", "Location": "5", "Value": "1"}, "AuthorLocation": "Italy", "Title": "“BEWARE-THEY DO NOT HONOR THEIR OWN BOOKING!”", "Author": "Makr", "ReviewID": "UR8268197", "Content": "READ THE TITLE- yes as outragious as it may sound, THEY DO NOT HONOR THEIR OWN BOOKING... I booked through their own website 4 months in advance, receiving an email saying everything is ok.. just a week prior to my visit, I get an e mail saying my booking has been cancelled owing to the fact that the credit card I gave them had been declined. To cut a long story short, my credit card has a $5,000 limit.. bank assured me they never had any request for debiting of funds from this hotel, and hotel never advised me anyway, even though booking had been made 4 months in advance - plus advising me when I was already on the road ONLY 7 DAYS BEFORE ARRIVAL! No use arguing with them as they said they had no room: threatened them they had to pay for the difference in costs of new hotel, all the tran continental phone calls and all that crap.. but what's the use.. seems a foreign customer has no legal rights in the UK so stuff it, or just one night and an extra 150$ cost is not worth the legal fees.. BUT BE WARNED!!!! Don't say you haven't been told.", "Date": "July 31, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Scotland UK", "Title": "“Dont go here”", "Author": "sparkieplug24", "ReviewID": "UR6320305", "Content": "Stayed here on two evenings. Firstly the hotel had very little working lights/bulbs. The rooms were not very clean. We were also put in a top floor room with a young child and the hotel has no lift and there were lots of steps up to the top floor. The toilet outside our room was in a tiny little cupboard that you couldnt even turn around in. Also we had not booked ensuite facilities so did not expect to get them however there was a shower and sink in the room which had bare wires hanging out of them not exactly good health safety. Now as I said we stayed here on two evenings over a week and the second time we did think of cancelling but as we were out of the country the days in between it wasnt really practical for us to do so. The hotel advertise cooked breakfast but what you get is egg on toast. Also the dinning room was not big enough for the number of guests that the hotel can accommadate. Which meant when we came down to breakfast we couldnt all sit together and the child who was only 3 at the time ended up sitting on my mums knee. The only things I would say that this hotel had going for it were it was centrally located and was near main bus and rail links. Sparkie", "Date": "December 3, 2006"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Calgary, Canada", "Title": "“Smokey”", "Author": "Yeroc", "ReviewID": "UR5709903", "Content": "We just stayed overnight to be near to the Victoria tube station in order to catch a flight out of Gatwick the next morning. Our experience is similar to other reviews: the place reeks of smoke including our supposedly non-smoking room and the bedspreads are stained. It was okay for the few hours we were there but wouldn't recommend it to anyone else!", "Date": "August 25, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Finland", "Title": "“Not that bad”", "Author": "jares", "ReviewID": "UR5543035", "Content": "The place is not that bad as some people have written! Sure it's quite messy or badly cleaned but so has every cheap hotel that I've visited in London been. Also our room was quite worn out also as most cheap hotel rooms are. Beds were good and extremely wide. Our room had a private shower and the room was \"cleaned\" and beds made on both days that we were there. Breakfast was also ok, some corn flakes, cooked eggs and toast with jam or butter also tea or instant coffee.", "Date": "August 3, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "NL", "Title": "“hell in london”", "Author": "A TripAdvisor Member", "ReviewID": "UR5028274", "Content": "i had a really bad expereince, which you can say that i stayed in hell for couple of nights, when we arrived in the hotel we found receiption room like a junk yard and person lying on the chair was full with cig: smoke, first i thought i am in some where in third world, after that he asked our name and told us that he has nt got our name booking register after providing the \"print out\" of our reservation he denied to give us a room because they have no availablity in the hotel and asked us to accomodate our self in other hotel, but after huge argument he ready to give us a room which i can not explain wht it was i never saw that kind of disgusting room and poor service in my life, but did not have any choice because all other hotel was fully booked. so i am giving you an advice stay away from this hotel, better to sleep on footpath but not in this hotel.", "Date": "May 2, 2006"}], "HotelInfo": {"Name": "Colliers Hotel", "HotelURL": "/ShowUserReviews-g186338-d192052-Reviews-Colliers_Hotel-London_England.html", "Price": "$95 - $198*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">95 - 97 Warwick Way</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">SWL 1QL</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "192052", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/ed/9b/ed9b8b32dbe57f13293aa6d366b54bc46large.jpg"}}