{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Wales", "Title": "“Oh my God....”", "Author": "Shovel_monkey", "ReviewID": "UR70195071", "Content": "Really, words cannot describe how bad this place is. My room was upstairs on the 3rd floor, I never knew damp could climb so high. On suite bathroom was a 1970's plastic lined cabin, no hot water at all in shower and toilet worked when it wanted to. The sink was disgusting and the smell was absolutely shocking. As for the carpet, I was scared to walk on it without shoes on. Wallpaper was coming away from walls and curtains looked like they were ready to fall down. Sockets were well doggy with cracked casing and faulty switches. My collegue and I returned at 11:30 after having a meal out, to be met by the hotel in darkness with no lights on the stairs. Other guests were walking around trying to find staff but it appeared none were present in the hotel. This place is really the worst hotel that either my collegue or I have stayed at...how this place passes inspection I do not know as any self respecting inspector would shut them down immediately.....avoid like the plauge !", "Date": "July 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "England", "Title": "“Unbelievably Bad”", "Author": "PickleJim", "ReviewID": "UR43137886", "Content": "we weren't sure about booking after seeing the previous reviews, but since they said they had redecorated we took a chance. On arrival the Room was as filthy as others have described and the net curtains were black. If they have redecorated, they must have sourced the paint, carpets and wallpaper from a demolition site! We refused to stay, and told them that as long as they didn't try to charge our card we wouldn't report them to trading standards for the description on their website.", "Date": "September 20, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "London", "Title": "“Stear Clear of this filthy hotel”", "Author": "LondonBandit", "ReviewID": "UR35575420", "Content": "On arriving at this place they call a hotel my wife and I refused to stay as it was filthy and un kept. The manager could not care a dam so I refused to give up my key till I got a complete refund which I relunctanly got. In short STEAR CLEAR OF THE BENTINCK HOTEL. I hope in the near future it will be inspected and shut down", "Date": "July 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Durham", "Title": "“Avoid at all costs!”", "Author": "MrsAngryDurham", "ReviewID": "UR23218297", "Content": "Having read several reviews of this hotel (unfortunately afterour return from London) had to let people know that this hotel is still in operation and to be avoided at all costs. General decor dirty,net curtains black, carpets thick with dust, bathrom filthy, live wires poking out of wall behind bed etc.etc.-and this was in two rooms. Having viewed the second one we walked out-woman at desk didnt protest and tore up my resevation form (Id better not have been charged)so I guess she was used to it happening? A disgrace this place is still running as the bad reviews seem to stretch back years so be warned- again and dont be taken in by the price-we wouldnt have stayed even for free!!!!!", "Date": "January 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "hastings", "Title": "“some one should phone the RSPCA!!!!!”", "Author": "kazza_deep", "ReviewID": "UR7828108", "Content": "this place is not fit for dogs!!!my friend and i booked this hotel through active hotels. the photos on the web site look light and airy. on approach to the hotel we could see this was not going to be good as the net curtains were black! on entering the hotel we were hit by the smell of greasy cooking and nicotine, NICE!!, the room was worse......the paint was peeling, the carpet was dirty the bedspreads had ciggarette burns in them and the shower was mouldy!! how this place has never been condemmed is beyond me, it's a health hazard!! we only stayed five minutes. when we checked out and said why we were leaving she said no-one had ever complained before!!!!!! as for other hotels, we got into the holiday inn just around the corner for the same price!!", "Date": "June 10, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Brighton", "Title": "“Agree with other reviews”", "Author": "Westwinds3", "ReviewID": "UR7329606", "Content": "Booked this hotel because it was AA-listed, which is normally a reliable guide. Agree with other reviews, shabby, minimal breakfast. Beds OK & convenient location. You probably need to pay a lot more for even an adequate London hotel.", "Date": "April 11, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Suffolk Traveller", "Title": "“To be avoided.”", "Author": "Tideway", "ReviewID": "UR7268815", "Content": "20 Bentinck St. London W1 is to be avoided. The hotel bears no relationship to the facilities, service and food advertised on their website. No coffee/tea in rooms, only toast or cereal for breakfast. Dingy rooms and scruffy - mould in the tiles - bathrooms with no soap and only handtowels. The only saving grace was that the beds were clean.", "Date": "April 2, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "North East", "Title": "“Wouldn't let a dog stay there!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5305026", "Content": "Absolutely disgusting, unfriendly, unhelpful staff, filthy rooms, facilities definitely not as advertised! Avoid!", "Date": "June 5, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Poole Dorset England", "Title": "“It was disgusting”", "Author": "A TripAdvisor Member", "ReviewID": "UR4024317", "Content": "We booked the Bentinck House Hotel, 20 Bentinck Street, London over the telephone because it was close to The Heart Hospital which we had to go to. The hotels own web page said there were tea and coffee facilities and hairdryer in the rooms. There were none. We requested a non smoking room. It stank of smoke and there was an ash tray in the room. The worst of all was that it was disgusting. It did not look as if it had been cleaned in months. There were broken electrical sockets that were showing live wires. There was an oil filled heater in the room but the power to it was turned off. The carpets were so dirty we could only walk on them in our shoes. We arrived at 9.45pm and when we went back to the front desk on complain it was closed and the whole of the downstairs area was in darkness. We slept in our clothes on top of the bed. We had to be at the Hospital at 7.30am the next morning, there was still no one about at that time. We had to stay two nights and it was the worst hotel I have ever seen. Do not consider this Hotel!", "Date": "October 15, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "orange county", "Title": "“2 different hotel Bentincks- one is great”", "Author": "A TripAdvisor Member", "ReviewID": "UR2355495", "Content": "There is a Hotel Bentinck(aka bedstink) and the very pleasant Bentinck House hotel. Do not confuse the two- the one by Oxford Street is very nice.", "Date": "August 2, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Manchester, UK", "Title": "“Bed Stink”", "Author": "AbbyReid", "ReviewID": "UR813141", "Content": "We stayed in a hotel that was oppodite the main train station in Nottingham. It was called Hotel Bentinck- we renamed it hotel Bedstink! It was awful! Four single beds crammed into a dbl room and a charge of Â£96. The brochure looks magnificent - the reality is a huge disappointment. The 'en-suite' bathroom looked like a prefab built into a shabby bedroom and I was afraid of what may be sharing the bed with me. (Be he alive or be he dead!) The bar below was the kind of watering hole you wouldn't dare to frequent even if DYING of thirst. Everything looked discoloured, dirty and dishevelled. Stay there at your own risk.", "Date": "November 28, 2002"}], "HotelInfo": {"Name": "Bentinck House Hotel", "HotelURL": "/ShowUserReviews-g186338-d192092-Reviews-Bentinck_House_Hotel-London_England.html", "Price": "$108 - $187*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">20 Bentinck St</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">W1M 5RL</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "192092", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/73/39/73398d8792dab3a2dfc6f9078fef24615large.jpg"}}