{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ryde, United Kingdom", "Title": "“Overnight Stay”", "Author": "William W", "ReviewID": "UR124804068", "Content": "Staff are great - greet you pleasantly you are in a room in no time. The rooms are rather large by London standards. I certainly had room to move about (although the en-suite can be quite small). The location is absolutely ideal - near two tube stations and within a brisk 2 minute walk of Hyde Park. I would recommend this hotel for anyone making a quick trip to London for a theater visit or just to see the sites.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lancaster, United Kingdom", "Title": "“Enjoyable stay”", "Author": "JAFFA_56", "ReviewID": "UR120624146", "Content": "Stayed at the Kingsway for one night and would have no hesitation in recommending the hotel or returning there for a repeat visit. The Manager did offer us a room in their sister hotel, but after a long day, we preferred a room in the above. We were shown the double room available.-112, and were more than happy with this for the one night. The large double bed was exceptionally comfortable and touches such as chocolates on the pillow were welcomed. The bathroom was small and reminded us of an aeroplane cubicle with shower, but was more than adequate for a short stay and the shower was lovely. Breakfast next morning was a welcome surprise. Freshly cooked and delicious. The room was a good size with excellent wall mounted flatscreen tv. Liked the balcony access. All in all, a very pleasant stay.The Manager , Kin, was very well mannered and obliging.", "Date": "November 15, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "2.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“If you are on a really tight budget and can't find anywhere else, then give it a go... you could get much worse.”", "Author": "GloriafromBristol", "ReviewID": "UR115994749", "Content": "It's difficult to get a London hotel for under £100, and this hotel just manages to keep below that amount. However, if you pay an extra £20 more per night you can get much better than this. The rooms are tiny! My room literally just had 10 inches of space round each side of the bed and a tiny en-suite shower-room. Whilst not spanking clean, it’s not too bad and they seem to be starting to renovate it. They were laying new hallway carpets when I was there. It’s big plus is the location! There are a number of tube stations within very easy walking distance and there are plenty of busses to hop on to as well. Paddington is a vibrant location with loads of restaurants, pubs and you have the lovely Hyde Park just a few minutes’ walk away too. We walked over to Little Venice and Notting Hill and had some lovely meals there too. I doubt that I would stay there again, it’s not awful, but I wouldn’t make a point of recommending it to anyone. However, if you are on a really tight budget and can't find anywhere else, then give it a go... you could get much worse.", "Date": "July 29, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Wales, UK", "Title": "“Great location almost makes up for disappointing hotel”", "Author": "Cookie3020", "ReviewID": "UR104952690", "Content": "Booked this hotel for it's proximity to the US Embassy and Harrords (had a very enjoyable walk from the hotel across Hyde Park to Harrods ). Originally booked a triple room for one night as both my children were being interviewed at the Embassy for Camp America Visa's. We subsequently found out that one of their very close friends also had an interview on the same day, so I telephoned the hotel and asked if they could put an additional bed in the room (in line with their own policy advsertised on their internet page) which they agreed to after some reluctance. When we arrived at the hotel to check in, we were told that in fact we would be staying in their \"other wing\" - two doors down. We found ourselves going down some narrow stairs, along a shabby corridor, to our room. I expect it to be a bit cramped due to the extra bed, but was disappointed to find that in fact it was a dedicated double room with an addition TWO beds squeezed in. The bathroom was less than basic, the shower leaked (the floor was soaked by the morning) and the sink was not as clean as it might have been. All night the hairdryer made a \"popping\" sound, and although the beds were comfortable enough, I slept very little. The following morning, we headed upstairs for the \"full english breakfast\" which was included in the price of our room. Having helped ourselves to tea/coffee and a glass of orange juice (choice of juice was orange or orange), we each ordered our \"full english\". This turned out to be one tinned plum tomato, a spoonful of baked beans, a fried egg (no choice how you liked it cooked) and one rasher of bacon. Sliced white bread was stacked on a plate by the toaster which took forever to brown - hence a queue of hungry customers quickly built up. All in all, I wouldn't stay here again.", "Date": "April 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Golden Valley, Minnesota", "Title": "“Good location but another hotel in the area would be a much better choice.”", "Author": "trock001", "ReviewID": "UR86012287", "Content": "We were promised a ground level room but was assigned a 3rd floor room with no lift being available. The stairs were very steep and narrow. The only telephone in the room was in a drawer and had no connections. The shower pressure was almost nonexistent. The mattress was terrible and the manager refused to do anything about it. Each description about the hotel said they had wi-fi but we had no signal, the clerk suggested that we pirate the signal from the next door hotel. The manager said that a technician was working on the wi-fi but over a period of 6 days there never was a signal nor any indication of a technician. While there was coffee and tea in the room the hot water pot did not work. There are many similar priced hotels in the Paddington area and I suggest that you find another choice. The hotel has been recently painted and the flat screen TV had a good signal. There are many ethnic restaurants in the area that are reasonably priced for London. It is very easy to get to Heathrow airport from this hotel via Paddington Station.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "perak", "Title": "“Unpleasant stay only thing good is the location.”", "Author": "cheahtravel", "ReviewID": "UR83287908", "Content": "We stayed here for 2 nights. There's no lift in this hotel and we were thankful that we were given a room on the groundfloor as we had quite a fair bit of luggage. The room was very cramped with 2 double beds and with our luggage parked at whatever space we could find, there was hardly any walking space. There were 4 of us but there were only 3 cups and saucers for tea making and tea and coffee were not replenished the next day. The toilet was very small, a big burly person will need to squeeze in through the doorway, sideways! English breakfast was mediocre and the staff there was very unpleasant, no smiles, no greetings, especially the Asian lady who was sulky and aloof. She definitely should not be in the hospitality and service industry. The only plus point is the location as it's near Paddington station and you can easily take the tube to go anywhere in London.", "Date": "October 13, 2010"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Location": "1"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Would like to rate it zero”", "Author": "beckysnan", "ReviewID": "UR65952548", "Content": "Sent email in February requesting 1 double room for 6 nights - as their web page stated they had ground floor accommodation I emailed - \"ground floor preferred unless there is a lift available\". When we arrived at the hotel on 15 May we were told the only ground floor room was booked before our email and they had given us a room on the 4th floor but there was no lift. I specifically requested a ground floor room as because of recent illness I cannot \"do\" stairs, They made a few adjustments and told us we could have a 2nd floor room in a hotel two doors away but would have to come back to the main hotel for breakfast. I tried to get up the stairs but it was impossible for me. We told them we could not possibly stay there and left to find another hotel in the area which took us a while but we eventually found one with a vacancy. I was very surprised two days later to find my credit card had been debited for a day's stay. When I went back to the hotel to question them about this the two male clowns at reception said the owner was away and they would bring it up with her when she returned after the weekend. I am still waiting to hear from them.", "Date": "May 31, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Devon", "Title": "“Not Recommended”", "Author": "ZeniaDevon", "ReviewID": "UR51508246", "Content": "Booked 'The Kingsway Park Hotel' for 2 nights but on arrival found that our accommodation was next door but one in 'The Admiral'. This is definitely NOT 3 star. Not sure if it even rates as 2 star. The room was very cramped with a third bed squashed in the corner. There were no fixings on the toilet seat which we were promised by reception would be sorted but it was still the same when we left. Door hanging off dressing table which housed fridge. Shabby shower room with poor shower curtain hanging off. Shower tray filled up with water so to prevent overflowing we had to keep turning the water off. No plug in washbasin so unable to have quick freshen up. No catch or lock on shower room door. Day 1 bed neatly made and tea bags/coffee/milk available for early morning cuppa. Day 2 bed appeared neatly made until we pulled back top cover to find the bed was unmade. No tea bags/coffee/milk replenished and dirty cups still on tray from day before. Long queue for dining room as dining room in main hotel was closed although I must say very slim lady dressed in black worked very hard to keep on top of things. Day 2 even longer queue with tables piled high and waiting to be cleared and a different lady pottering around trying to look busy but achieving nothing. Thankfully lady from previous day arrived just as complete chaos loomed and got everything going but it was a real struggle to catch up. Other lady did nothing to help. Full english breakfast very scanty on cold plate and everyone had to keep asking for cutlery, refill of coffee etc. Dining room seriously undermanned for so many guests. Foreign guests very unhappy, some skipped breakfast and we were embarrassed. On the positive side good location not far from Paddington Station and the bed was clean and comfortable. Can't comment on the main hotel rooms but we certainly would not consider risking it again!", "Date": "December 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Hedmark", "Title": "“Not that bad”", "Author": "Lexidh", "ReviewID": "UR35000302", "Content": "We where supposed to stay at a B&B next door, but because of some plumbing problems there we were sent to the Kingsway, and we did not have to pay any extra. The room we got was OK, the bed not too bad, carpet ugly but clean, toilet paper horrible, bathroom clean but worn down and ugly. Soft towels, and REAL PRESSURE in the shower! No water saving stuff here, I loved it! You could really hose yourself off here, not just get wet and scrub yourself. It's the best hotel shower ever. I see there is a lot of bad reviews of this hotel, but we did not hate it, it was just what we wanted, a place to sleep, relax, watch some TV and read, in between our shopping sprees and tourist stuff. The breakfast was... I'm no fan of English breakfasts, but it was food, and it did not taste foul. In the reception there was some clueless people, but we had no use for them, just getting in and out. Leaving the key card every time we left the hotel was a bit tiresome, but it was not too bad. Free high speed internet is also a big plus for us. The location was great, close to Paddington Station, lots of restaurants that we visited, some shopping and the train to Heathrow. We will stay in the same area when/if we go back to London. Perhaps not this hotel, but if the price is right; why not. It suited us.", "Date": "July 17, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Northern Ireland", "Title": "“basic, but fine”", "Author": "iliketoswoosh", "ReviewID": "UR34377290", "Content": "We arrived a bit early than the check in time which was 1pm (or so we were told), however when we got there they told us it was 2pm. Annoying, but we didn't mind that much. There was a computer in the hotel we could use in the mean time, and I asked could I use it and the receptionist just nodded, and she mumbled a 'yes' very rudely. We got to our room finally and it was basic, but very clean and comfortable. The only set back was that we had booked a triple room however there was a double bed instead. Yet in no time, we got an extra bed set up in the room which was fine. The breakfast was average (you get what you pay for). The only thing wrong with it was that the room was small, and you had to wait a while to get a table. The location is perfect. You couldn't ask for a handier location. It's a 3 minute walk to Paddington Station and you can get any tube to basically anywhere in London from there, so so handy. The area is very plush and nice too. Also there's a few bars and pubs around the corner, not to mention burger king, mcds, kfc etc and restaurants. The only problem we had with our stay was that after our first night, the manager asked us to find somewhere else to stay that night as he had overbooked the hotel. We were a bit taken aback, as we'd booked the room for 2 nights. Nonetheless we attempted to get another room in the area, however there was no rooms available. So we just explained we couldn't get a room and the manager was fine about it. That was the only small thing wrong with our stay. If your looking for somewhere cheap and comfortable, but basic this is the right stay.", "Date": "July 10, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Zurich", "Title": "“Worst experience ever”", "Author": "corkyzrh", "ReviewID": "UR29430699", "Content": "Screwed up reservations We booked three double rooms, the hotel had only reserved one. There were no other hotels available so the hotel promised us three en suite rooms in the owner's house north of the centre. We ended up sharing bathrooms with several other guests whose reservations had also been screwed up. What is the sense of booking a hotel in the centre when you end up 20 driving minutes outside? Hotel experience The second night we stayed at the hotel in tiny rooms with in-room bathrooms like in an airplane. Some staff was friendly but the managers were either incompetent or just money hungry. If you still decide to give that hotel a chance, make sure to confirm your rooms just before your trip and request for a room above ground level.", "Date": "May 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Japan", "Title": "“full of trouble”", "Author": "hamamatsu", "ReviewID": "UR17252954", "Content": "This hotel is the worst service that I have ever stayed with in my past experience. Before booking, I read some reviews on this hotel. One told me that rooms are so narrow and service is not fine but considering the price and location, they are barely accepted. So I did not expect so much. But they have fallen short of my moderate expectations. This time our group of 12 Japanese people booked 4 rooms(3 people a room) for 4 days. Bed type problem: requested 3 single beds a each room,but actually 1 single and 1 double. And no service staff to work for bed exchange at night. Two people of each room had to share a double bed , they are not couples, though. Tight shower valve: Some shower valves are too tight to be able to move by some women. They cannot bathe. Sudden room change without our previous consent:Returning hotel at night, All of our luggage were put outside the door on the passageway.A hotel's night worker just asked us to change the room, because our room had been already occupied with another guests by hotel's arbitrary decision. This is not a normal business. Even though this hotel is the 2nd. or 3rd.class, I can not allow this now. So I could not enter our booked room that night, I had to sleep without my pajamas which I left in the room. by", "Date": "June 26, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Grubby & Smelly - Not The Admiral Hotel Which We Had Booked!!”", "Author": "merseycat", "ReviewID": "UR13435777", "Content": "My partner booked this hotel aftering seeing it online, and calling up the owner. It was my birthday so we wanted a nice weekend away in London, something basic, not too far away from the main attractions and not too expensive. The hotel we booked was called the Admiral Hotel. It says on the website that you have to check in at the Kingsway Park hotel, which was situted a few steps away. This was fine. The Admiral looked nice on the website pictures, showing a nice modern bar, and clean rooms. It was this hotel we had booked! Once into the Kingsway Park hotel, we where then told thats where we would be staying. It seems that's where everyone stays! It appeared the nice clean Admiral Hotel was not having guests! This was indeed empty! We checked in early, and where told where our rooms where. As other reviews say, the stairs where very steep and there was no lift or warning which didnt help someone in my party that had a knee complaint, but i havent let that interfere with the review, as i could of enquired upon booking. My room had a terrible smell as soon as i walked in. I wasnt expecting anything less though, as the hotel upon entry was tired, shabby, had a smell to it, and had dirty woodwork and walls, and frayed carpets. The divan bed was 2 singles together, with a badly stained base. The lamps had stained and burnt lampshades. The furniture was dated and didnt fit in the room. There was no fancy chairs and furniture like the i've just seen on the Kingsway Park Hotel website! We kepting hurting ourselves when walking around the crammed room on the furniture. The portable tv did work, but the picture wasnt quite viewable, i felt like i had double vision after looking at it. The main critisim is aimed at the toilet which was a portocabin shower and loo in one type of thing, which was placed in the room, but then was incorporated into the paintwork. It smelt, had mould on the shower, and when sitting on the loo, your foot was in the shower area, which was very small. The bottom of the door was also covered in rust. I did not use the shower at all, as it was very off putting. My partner did, and he was fine with it. The other room we booked, for other parties, was very similar but they had a bath, and a more normal bathroom, which had a terrible smell of damp in it. I didnt sleep well during my two night stay. The bedding was a sheet, and then an extremely 'itchy' blanket, with a floral throw over the top. This was covered in stains. Me and my partner had one small pillow each, there was no other bedding to use. Breakfast was included in the price described as a 'full english' we went down for breakfast which was served in small room crammed with tables in the basement. Two ladies, whom we saw cleaning rooms served breakfast. The option was cereal, toast and the cooked breakfast was a boiled slice of bacon, egg (scrambled,fried or boiled) plum tomato and a sausage. I did not recieve what i ordered for breakfast on both mornings, and didnt rectify it as the person serving breakfast could not fully understand my english. Our bed was made while we where out, and there where towels left in the room. The manager/owner was around for most of the time, and there seemed to be approx 6-7 other guest there, excluding my party. There was no problem returning. The front door was unlocked and there was a gentleman on the desk. The latest we returned was around 11pm. The area of this hotel sussex gardens, has a whole host of hotels similar to this one. They all had vacancies in there window, but did look a lot cleaner and friendlier. I do not recommend this hotel to anyone. It did us for the weekend, because we had no choice once we got there. Location was great for us, lots of restuarants, and paddington station near by, but for the price, which can seem cheap, im sure there are others for the same price in better condition. In my opinion, it wasnt clean, wasnt comfortable, the food wasnt good, so it was a huge let down for me. Luckily the great company i had, and London being so fantastic didnt make my weekend a complete let down. I have written this review within 7 hours of returning as i would hate anyone to have a weekend ruined, and this hotel would do that! Don't be fooled thinking they put you up in the Admiral hotel, when infact your staying at the Kingsway Park. The website for the Kingsway Park Hotel says it has recently been refurbished! Id of hated to of seen what it was like before! Both the Kingsway Park and The Admiral Hotel have individual websites, the pictures on both are extremely different to what you get, so there not worth looking at!", "Date": "February 10, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Bit run down, but not that bad”", "Author": "adventurer86", "ReviewID": "UR10992197", "Content": "Stayed here for a few nights a couple of years ago. Rooms were small and one we had booked had a built in bathroom - kind of reminded me of a bathroom you'd find in a campervan. Breakfast was good. Great Location - walking distance to many attractions. Was happy with our stay but weren't expecting too much.", "Date": "November 22, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Location": "2"}, "AuthorLocation": "Swindon", "Title": "“Disorganised & Unhelpful”", "Author": "OzTravel68", "ReviewID": "UR10570295", "Content": "After booking 3 months in advance, we asked to leave our luggage with the hotel until the evening. On return, we were led away from the hotel to another hotel, that did not offer the same standard of accomodation. When trying to seek resolution of this with the staff, we were fobbed off with \"the manager is not available\". I would not book or prepay at this hotel.", "Date": "November 3, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Germany", "Title": "“Good area, bad hotel”", "Author": "123_Hoteltester", "ReviewID": "UR8535628", "Content": "I booked this Hotel for a group of 8. None of us liked it! The location is very good, but the hotel is not. Some had to stay in a room downstairs, next to the kitchen and breakfast room. They had a very narrow and dark room and were waken up in the mornings by everyone who passed there to have breakfast. The rooms were very narrow in general and had a moldy smell. We could only sleep with the windows open! Breakfast is served by to women. They are grumpy when you come around half an hour before the end of breakfast time. They even threw us out of the breakfast room one day. They seemed to be bothered just by anyones presence. I wonder why they don't choose another job, if they don't like this one! The narrow and dirty bathrooms (more a plastic cabine than a bath room) with moldy shower courtains have already been mentioned!", "Date": "August 29, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Perth,West Australia", "Title": "“Small Rooms, Plain Breakfast, but good location and kept clean”", "Author": "PerthPhotographer", "ReviewID": "UR7827852", "Content": "Stayed here in May for 10 days. Chose it because it was close to Paddington Station (2 min walk) which I used frequently for sight-seeing around London. Yes- Rooms are small. I had an ensuite double bed (basement level) , but it's still small. There is however a little table to put your stuff/laptop/write letters on (Plus a small wall mounted TV) The ensuite is a small porta-plastic kit type, simply installed in the room. It is really tiny, but I wanted an ensuite instead of shared showers, so again, it did the job, and was kept clean. The room was kept clean - very clean - Fresh towels daily, and sheets changed, so although very small, it was comfortable, and the room never felt grotty. Breakfast was, ummm, \"average\". It served it's purpose in filling you up for the morning, but being mass produced by only 1 or 2 people, it's more in line with what you'd cook for yourself at home if you were in a hurry. The food standard is not fantastic, but it fills you up.. After day 5, it got a bit blah for me to stomach, so I'd eat out at places around the corner (which you can find for a good price... just look for specials) Staff are helpful, and I had no problems. Stairs were painful, but really only for getting your suitcase up and down.. Apart from that I didn't mind - Walked all over London so an extra set of steps made no difference. If you have bone/hip/joint problems you might think twice. Location is great - Close to Paddongton Tube, 2 mins walk (which has the Heathrow Express Link) and there's a whole bunch of places to eat at within 1 minutes walk. Plus some shops 5-10 minutes walk up the road and around the corner for groceries. Wireless Internet was available, thought from the basement room, my laptop needed to be right near the window to get reception. Central heating worked ok, and you could control it, and also open the windows for fresh air (Well at least in my room on the basement you could) In summary - It served its purpose in that it was close to Paddington Station, and handy as food was close by, and grocery shops were around the corner. The staff were friendly and answered any inquiries. It is small, but I was by myself so it didn't bother me - If you're sharing, you might get in the way of each other a fair bit. Ensuite is tiny, so dont expect to spread out all your toiletries ! I can't really think of anything I \"hated\". I slightly bigger room would have been nicer - But looks like all the hotels on the block would be similar. Talking of which, the street has MANY (many!) hotels along it, so if it's the location that's attracting you, review these hotels, on the same side of the road as the Kingsway: Europa House, Adare, Balmoral House, Alexandra Hotel, Columbus, Admiral (Admiral seems to be the sister hotel) Across the road from the Kingsway you have: Springfield Hotel, Days Hotel, Royal Cambridge, Picton House, Olympic Hotel, PS - Try contacting the hotel directly via email, you might find you get a better rate if dealing direct, and paying cash. kingswaypark-hotel.com I would stay there again if travelling alone and wanting Paddington as a base. For a couple, I'd ask for a bigger room. But it was clean, safe, and I had all my camera gear and laptop stuff, and never had any problems with anything going \"missing\". My goal was to visit London and sightsee, and I found the Hotel, while on the small side, suited this.", "Date": "June 10, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Kinsale", "Title": "“Hated it. Breakfast reminded me of Fawlty Towers”", "Author": "coco0", "ReviewID": "UR7430415", "Content": "While we understood it had recently being refurbished .... our room had been painted yes, but the furniture could have done with some updating. While sitting on one of the beds (camp bed style) it collapsed underneath, because they had not fixed the stand on one side properly and had it facing the wrong direction. Luckily enough we discovered the problem before someone was sleeping in it!! When we went to see if there was ice in the fridge, we were greeted by an ice-cube tray with black spots/mould. While waiting in the \"set-up\" breakfast room and wondering why there was no-one to serve us, one of the other guests made enquiries. We were told that breakfast was being served in another hotel close by. We went there to be met by a girl who was taking orders, clearing + setting tables, serving food and doing the washing up. Not the girls fault that the management expected her to be taking care of 20+ guests alone. While we were there, a second person came to assist. We had to ask for our table to be cleaned after the previous occupants, because the girl was just setting it up again. People were buttering their toast with spoons because of lack of cutlery. My sister would not trust the meat ..... because she did not have enough faith in their hygiene throughout the establishment. The kids asked for sausages for breakfast instead of a full English and got two sausages each, served on a saucer. When we asked for ketchup, we were told that they did not have any and looked at me strangely as if I had asked for something way out ...... after all the English have ketchup with chips, etc.", "Date": "April 24, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Hummelstown, PA", "Title": "“Great area, not so great hotel”", "Author": "djoann958", "ReviewID": "UR7352090", "Content": "It was our first trip to London and we booked this hotel through AAA. As we arrived we went into the lobby that was full of cigarette smoke. Our room (1 queen bed and 2 twin beds) was actually in the hotel 2 doors down (The Admiral) and was in the basement next to a kitchen. The room was so small that the 3 beds took up the entire room. We had nowhere to put our luggage! They promised us a larger room in the morning. The next day, they said they didn't have any larger rooms, but they did give us an additional single room down the hall for free! It was the size of a closet and the bathroom was the size of a phone booth, but our 20 yr old daughter was thrilled. The bathroom in our room was updated and very clean. Never enough toilet paper or towels and the pillows were 2 very thin ones inside a pillowcase. Our non-smoking room also smelled like smoke. Thank goodness I brought Febreeze. The breakfast was good and made to order. As our room was in the basement and a bar/restaurant above us (not carpeted), we were awoken 2 or 3 times during our stay by the noise of people walking around. One time was at 3 am. We reported it and the people were quickly asked to leave the bar. Our telephone never worked our entire stay. The internet access did not work in either of our rooms. My kids used the lobby. The staff was helpful though, but the accomodations were not what I expected from a AAA approved hotel. The location however could not be better. 2 short blocks to Paddington station which is a major tube stop and train station. There was even shopping there and 2 grocery stores. Lots of pubs and reasonably priced restaurants in the area.", "Date": "April 14, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Fareham, Hants", "Title": "“Lots of Stairs”", "Author": "blueskilamb", "ReviewID": "UR6917367", "Content": "We booked the hotel through one of the many on line booking agencies. When we checked in we were shown to another building next door but one. Our rooms happened to beon the top floor (4th Floor). There was no lift & the stairs were very narrow & steep in places making it very difficult for unfit people or people with difficulty climbing stairs. It was also difficult carrying luggage. The rooms were clean with a double & a twin bed - rooms 15 & 16. Although the gap between the bed & the wall nearest the window was raher cramped. The bathroom was also rather cramped & the shower was a bit feeble but at least it did work. The loo was OK if you could fit your knees under the basin. One of the rooms had a nice gesture being supplied a couple of Ferot Rochet chocalates but this did not apply to both rooms. Went to use the kettle the first morning but it did not work. I reported it to the reception & they promised to replace. We subsequently tried swapping the kettles between rooms & found it was not the kettle but the base unit it sits on. Also reported this to the reception. Arrived back late the next night after seeing a show but the kettle was just the same. Next morning our friends brought us a kettle full of hot water so that we could have a drink. We then found that the cleaner only left one bath & one hand towel so one of us had to dry ourselves on the hand towel. Just one guess who took priority. Reported Kettle problem again & also towel issue. They promised to resolve & told me to call reception if any problems. There was & I did. The reception brought up a kettle & some towels fairly quickly. But the kettle still did not work. After a bit of fiddling we managed to find that if you wiggled the kettle & put some pressure at a certain point & kept it there it was possible to make the kettle work. Not ideal but at least we could have a drink in the morning. Our friends did not have this problem. Guess who had to hold the kettle until it boiled?. We had a bit of a concern at the wiring underneath the kettle which consisted of a couple of multi plug adaptors pushed together to cope with the number of plugs although this was not the cause of the problems with the kettle. I even tried swapping the fuses in desperation. These were not the problem. It was definately the base unit. It was difficult removing or returning the kettle to its place anyway due to the close proximity of the hairdryer. The breakfast was not too bad considering the prices for London. It consisted of Orange juice, tea or coffee, Toast & jam, Muesli and/or cornflakes plus a cooked breakfast of egg, sausage, bacon, tomato & beans. The location was pretty good, just a short walk to Paddington Underground. we bought a daily travel card which gave us unlimited travel on the tube or buses for the day which was excellent. Despite the problems we would probably go back as it was so convenient & it was a reasonable base at a reasonable price. I would make sure I took my own kettle though.", "Date": "March 5, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Boston, MA", "Title": "“overpriced, run-down place”", "Author": "A TripAdvisor Member", "ReviewID": "UR1792434", "Content": "This hotel in no way resembled what is advertised on websites. It doesn't appear to have been renovated within the last 30 years.When we walked in we were almost choked by the thick smoke in the lobby 'room'. When I asked about a non smoking room, the man behind the counter laughed and said \"its up to you whether the room is non smoking or not\".The \"mattress\" was a hard box spring that had already sprung. There were big stains, peeling wall paint. Little heat. We almost froze the first night. No hot water the next morning... etc.The hotel must be family run because there were always random men sitting about in the lobby and they all appeared to be related. My sister found them 'creepy' sometimes because they would always stare at us (females) when we came in or went out. One of the men winked at my sister. That's not the kind of attention we want from hotel staff or random and everpresent family/friends of hotel staff.This placed is extremely overpriced and run-down. We paid an extra $20 or so a night under the impression that we would get a slightly better hotel. That was not the case and we feel doubly ripped off. With the horrible exchange rate, basically $175/night for a dumpy room. We will not be staying there again! Avoid!Paddington area seemed a bit rougher than I remember from a trip a couple of years back. Hostile homeless men and regular crazies on the street sometimes. Stay in Westminster or Belgravia. There is nothing to see or do in Paddington area.", "Date": "April 19, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Germany", "Title": "“Good location, Good breakfast !”", "Author": "A TripAdvisor Member", "ReviewID": "UR1525760", "Content": "Nice little hotel, located near Paddington Station and Hyde Park. Pubs nearby. Clean rooms, quiet place to stay. (Although last renovation did not happen in the younger past.) Room rates include full english breakfast - the right thing to start a busy day in London.", "Date": "December 21, 2003"}], "HotelInfo": {"Name": "Kingsway Park Hotel", "HotelURL": "/ShowUserReviews-g186338-d192101-Reviews-Kingsway_Park_Hotel-London_England.html", "Price": "$122 - $1,582*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">139 Sussex Gardens</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">W2 2RX</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "192101", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/78/dc/78dc4eac3fa4de048eb0f62f044f7d675large.jpg"}}