{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Excellent hotel”", "Author": "Braveheart4622", "ReviewID": "UR125761905", "Content": "I have just checked out of the hotel after a great nights sleep. The room was large and clean and quite well equipt. Shower bath and towels. The breakfast in the morning was good and had a lot of choice. Close to the tube an staff very helpfully excellent", "Date": "March 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Don't stay here”", "Author": "Tess14344", "ReviewID": "UR124771894", "Content": "Negatives: Don’t take the single room – it’s too cramped - the smallest hotel I have ever stayed in! Very thin walls, you can hear everything above and underneath and beside you so avoid this hotel if you are a light sleeper. No lounge area. Breakfast room is quite depressing. Positives Reception very helpful Acceptable breakfast 10-min walk from King’s Cross/St. Pancras train stations 5-min walk from Russell Square underground station Reasonable number of restaurant and pub choices within the vicinity of the hotel All in all, if you are in London for a holiday, this place would be quite depressing.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Leeds", "Title": "“Never again”", "Author": "O2BADon", "ReviewID": "UR120681797", "Content": "I booked this hotel through booking.com and it read ok on their review system. Nothing could be further from the truth. Our room was clean, but very very basic, the shower room was unbelievably small and there was no shower gel or hand towels on offer. No bath mat was provided. The worst part of the stay was the quality of the sleep, down t o the fact that we were on the first floor and a couple came to the room above us at about midnight. The floorboards creaked and we could hear them talking and then worse.... for hours, they left at about 3am, I can only imagine what the room was actually being used for, but it appeared very odd!! To say I hated the stay was an understatement, I stay away over 100 nights a year and it has been about 10 years since I had such a bad experience. To charge £130 for this room was a complete rip off.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Tamworth, United Kingdom", "Title": "“We chose not to stop here”", "Author": "Alana_J_30", "ReviewID": "UR120615513", "Content": "My parents booked this hotel for my boyfriend and I for a weekend away. After viewing the hotel on the website, it seemed a good standard 3 star that represented value for money. However, when we arrived it was a different story. We were in a double room on the second floor. The hotel in general is in need of a good clean and updating. Our room was damp with mould all over the walls and ceiling. The bathroom was covered in mould and mildew, the curtains were hanging off (as were several light fittings and, quite worryingly, a plug socket). After we'd seen the room, we decided not to stay. My boyfriend went to the reception to explain. While the lady on reception was friendly, she asked us what we expected from a 3 star. We expect there to be less facilities and luxury than a 4 or 5 star, but the same standard of cleanliness and comfort. at £100 per night, I don't think that they can justify the state of the room, which was further confirmed when we found a hotel for the weekend just around the corner in Earl's Park (a couple of miles away) that was clean and modern for £70 a night! It's worth mentioning that we didn't get charged for the second night, but the hotel still charged £100 for the first night that we were supposed to stay but didn't. Unless you are paying rock bottom prices, don't stay here. I totally agree with other reviewers - it needs serious updating or needs to reduce prices to about £40 or £50 a night.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "", "Title": "“There seems to be a lack of caring for the building.”", "Author": "1mysticcat", "ReviewID": "UR117048808", "Content": "The breakfasts were great but the neighborhood was not a comfortable area for walking at night. The hotel had an overall air of neglect. It has great potential if it got a good scrubbing, a paint job, and a bit of bleach for the mildew.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "2.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“Needs some serious updating”", "Author": "Sophie3777", "ReviewID": "UR117039168", "Content": "We arrived at this hotel for a family weekend away, and after booking a family room we were given a room with a dodgy shower and the curtains falling were off the windows. The member of staff on duty at the time was helpful and offered us two rooms instead of the one. These rooms were a big improvement, but the ceiling in the bathroom was covered in black mould and there was a bit of tape covering a hole in the bathroom door. The staff were nice, and the breakfast was fairly decent, but the hotel is in need of some serious improvement, as the wallpaper was hanging off the walls. The rates of this hotel are not cheap, so they either need to improve or lower their prices!", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Weymouth, United Kingdom", "Title": "“dirty hole”", "Author": "clarecross1961", "ReviewID": "UR117039139", "Content": "on arriving at the place (not hotel) i was so disapointed as soon as i got out of the taxi it hit me so dirty then checking in we had to carry are bags up 4 floors to a room with curtains hanging off mould on the bathroom shower room. after complaing to the staff who were friendly he moved us to 2 other rooms which were better but still not what is says on the tin.The breakfast was ok i cant say anything else except i would not put my dog in there!!!!!", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "5", "Overall": "2.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Hotel? I don't think so............”", "Author": "Lizzielooloo", "ReviewID": "UR116102903", "Content": "How this 'place' can be called a hotel I do not know. Outside there is even an AA sign with a 3 star rating. Unbelievable. I had booked late, searching for a single room in South or West London and this was all I could find that was affordable, 100 GBP for a double room without breakfast in West Kensington. Single rooms were booked out everywhere. Location was handy for me but that was it. Two old houses side by side, dirty hallway, narrow steep stairs, bedroom was clean enough but overpriced and hadn't realised but had to share a bathroom. The shower curtain was absolutely filthy, needing to be steeped in bleach at least, or thrown out. Bedroom was ok, double bed with new bed clothes, laminate floor and what appeared to be new sliding aluminium door in front of window to block noise from trains, which it did. So slept very well. Following day went to check out, the 'reception' is in breakfast room so sat down and had my breakfast! This was good actually and though on the booking it was not included in price, I felt justified in having it when shown to a table by the receptionist as the bedroom was totally overpriced, no reduction for one person in a double room and shared bathroom. Close enough to West Ken tube station, buses and quiet road but will not be back. Far better, cleaner and better value 'actual hotels' if I had booked earlier. Be careful, it appears that there are two Avonmore Hotels in London...........", "Date": "August 1, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Tours, France", "Title": "“dirty, no star hotel !”", "Author": "fanette-11", "ReviewID": "UR105299229", "Content": "I was shocked ,the pictures are not showing luxury but they show clean hotel !!! it was really dirty, bad smell, due to very old decoration (curtain ,bed cover ,wall & floor particularly dirty) the rooms were small, noisy from mid night until 6 a.m. heard train move very close, when i complained for noise the young lady at reception told me with smile we can't stop the train!. the only advantage of this hotel was a good english breakfast , which is served quiclkly with smile, the foreign personel were kind and helpful but not really care of., the location is good too, walk 10-15 min to west kensigton underground but many buses. london is very expensive city but to pay 110Â£ per day! for such a quality, this hotel should not be classifed by star sorry but itravelled so many time and this is my comparison. fortunately it was sunny weather and we left every day the hotel after breakfast and back to hte hotel just for sleeping with train noise !!!!", "Date": "April 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "", "Title": "“Awful!”", "Author": "femc8215", "ReviewID": "UR104620565", "Content": "The room was really unclean and tiny. The staff were unhelpful. The room smelt of smoke and the plastic flowers in the window box were disgusting.", "Date": "April 19, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Wijchen, The Netherlands", "Title": "“never more Avonmore”", "Author": "djiban", "ReviewID": "UR104012008", "Content": "according to their website - a winner of the AA National Awards for the Best Private Hotel in London. Well, even a qualification as B&B would be too much honour. Absolutely outdated and too expensive. The pictures on the website give a wrong impression. - personnel not really interested in their guests - room and bathroom not clean (windows and carpet) - too warm (fan available !!) - too noisy (close to underground) - bathroom: tap leaking, sink dirty, not curtain for window - bedroom: bedlights not working, TV not working - room for breakfast: small, table linnen torn as well as the covers on the chairs. cutlery dirty. our tip: please stay away from this place !!", "Date": "April 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Belfast", "Title": "“Once was enough!”", "Author": "BelfastNicola", "ReviewID": "UR100861398", "Content": "I stayed there for one night with my mum as we were visiting London for a craft show at the Olympia 2 which is only five minutes away on foot. It is described as \"award winning\" but we were very disappointed as the room was in need of decoration, the en-suite was no bigger than a broom cupboard,and the sparks came out of the tv! When I mentioned it next morning, the owner seemed to think it quite funny. I wasnt very amused as I thought it very unsafe. One night was definitely enough for us!", "Date": "March 20, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Los Gatos, California", "Title": "“A Huge Disappointment”", "Author": "AlyBerk", "ReviewID": "UR89177987", "Content": "On the plus side, The Avonmore is in a good location and they did let me check in very early (I arrived at Heathrow before 8am and was at the hotel around 10, after stopping for breakfast). Also, the room was clean and the beds and bedding were comfortable. On the minus side, despite being clean, the room was extremely shabby. The walls were paper thin and it was difficult to fall asleep with the noise from the room next to mine. I would say at least half the lightbulbs were out, including several in the bathroom and the reading lamps over the beds (there were two-bulb fixtures over each bed - one bulb of the four worked). The proprietor was mean - my daughter and I came down at the late end of the scheduled breakfast time (but within the times we were told breakfast would be served) and we were scolded for being late and given only toast, tea and coffee rather then the full english breakfast we were expecting. AND DON'T LET ME FORGET THE STAIRS...I was aware there was not a lift, but the stairs were very narrow and it was difficult to maneuver luggage up and down.", "Date": "December 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Milan, Italy", "Title": "“Keep yourself away from there!!!!!!!”", "Author": "Stonesquezeer", "ReviewID": "UR84311968", "Content": "I think one of the worst places I've ever been. Many reasons for this: - we reserved a \"Double/twin room ensuite\". When I arrived the owner said she was not able to give me this kind of room because they were already fully booked and she would have been able to provide just a double room without bathroom inside (!!!). I complained and showed her my reservation but she just said she would be able to make a 10 pounds discount... please, com'on!!! - it is really expensive (finally around 100â‚¬ per night in a B&B for a double room without bathroom inside is really too much, even in London) - the room was quite large, but moderately dirty (especially the bedcover: I think they haven't washed it for years). Really far from the picture they provide on their website, especially for the bathroom! - the place is quite far from the center (ok... we have the tube...): it is less than 10 minutes walking from the \"West Kensington\" stop on the District Line (probably one of the few stations without direct access to the Piccadilly Line) They say they received some reward as \"excellent B&B\"... I really can't understand who's the guy who judged them (or, probably, they received the recognition 10 years ago...) Keep yourself away from there!", "Date": "October 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Monmouth, Oregon", "Title": "“My husband and adult daughter and I enjoyed a very pleasant two-night stay at the Avonmore.”", "Author": "Gary093", "ReviewID": "UR78139973", "Content": "Because we thought we had already indicated we would be arriving late at night, it was discouraging after a long, tiring trip when the person on duty looked at us blankly on our arrival. I had to produce proof of registration and show him on his book where our names were written. Things went up from there, and we had a comfortable stay that included two delicious full breakfasts. We liked staying in this quiet neighborhood, so close to the tube which gave us quick access to all parts of London.", "Date": "September 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Mildenhall, UK", "Title": "“Disappointing”", "Author": "iMtrippinUK", "ReviewID": "UR68186098", "Content": "We stayed for one night while visiting some friends who were passing through London. If it had been any more than one night, we would have left. The hotel was cheaply decorated (Christmas decorations still out in June) and the photos on the site are not a good representation of what you will get. The window in our room was cracked. The bedspread was stained. The cable input for the tv was frayed and therefore messed up the signal to the TV. The shower door on the bathtub wouldn't slide and there was mold in the bathroom. After reading the reviews of this hotel, I was prepared for a less than fabulous room. However, I have to admit that the staff was very friendly and the breakfast was indeed good. There were soaps and coffee in the room, which was above my expectations. If you're passing through town and just want a place to sleep, this place is alright. However, you can probably find a better room for cheaper. The price was definately not comensurate with the quality ... and I think this place is not worth 3 stars.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "2", "Location": "4"}, "AuthorLocation": "holywood, co down", "Title": "“comfortable, great breakfast, good location, 3 good beds in one room”", "Author": "jess1960", "ReviewID": "UR63152759", "Content": "We stayed here on the May Day weekend. We are 3 girl friends and wanted 3 separate beds in the sam room - Avonmore is one of the few we could find at a very reasonable price - Â£40 per head per night B&B.. The website really makes the hotel look much prettier than it is but if you can put up with the shabby chic decor, steep stairs to small rooms and pretty dated bathroom then you will love it. We had a great stay mostly down to the staff, who looked after us really well. The rooms are clean and cosy and the beds are really comfortable. Breakfast was one of the best we have ever had, cooked to order and beautifully served. The area is quite quiet but we had the windows open as the room was warm and earplugs cut out any noise. It is only 5 minutes walk to West Kensington underground station. We would definitely stay there again. Staff are great and will help you with anything. Needs a facelift though!", "Date": "May 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London", "Title": "“for the price i paid, awful”", "Author": "looloobell", "ReviewID": "UR56837691", "Content": "The hotel is very small, with steep stairs. When i booked the room, i booked a double room and i asked for a late checkout. i was told the late checkout was fine and when we booked in I asked again just to be sure. He said it was fine. The next morning we got a phone call at 11.45 telling us we had to leave in 10 mins and we had rush out the room. the lady said she had no record of my request and they booked the room for someone else. I also booked a double room but got 2 single beds. I felt the staff did not understand me when i pointed this out so we just left it. I didnt feel very safe as the fire alarm was hanging of the wall and there was no fire escape. we has to climb 8 flights to get to our room aswell. We got up for breakfast which was also awful.", "Date": "February 23, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Vancouver", "Title": "“A very bad experience”", "Author": "Happycamperman", "ReviewID": "UR39696075", "Content": "We selected this hotel because it received a good writeup in the guidebook I consulted and because it looked and sounded wonderful on the hotel's web site. If the photos and reviews were ever accurate they are certainly not so any more. When we arrived at the hotel we discovered that we could not use the main entrance and had to enter via the basement door which was down a narrow flight of stairs. We then had to carry our suitcases up several flights of very narrow and steep stairs because there is no elevator. The first room we were shown had twin beds when we had ordered a double bed. In addition it looked out over a \"garden\" that was overgrown and filled with rubbish, and also overlooked a railway track that appeared to in constant use and was very noisy. There was a patio door that was completely insecure as it did not lock properly. We asked for a room with a double bed as had been originally requested and at first we were told that there were no rooms available. After a while however we were given a different room which was up several more flights of stairs. It did not have a double bed but rather had two single beds pushed together. The room was very small and cramped and was filthy. It looked like the carpets had not been vacuumed in quite some time, and the blankets and bedspreads were dubious as well. The wallpaper was peeling off the walls. The bathroom was dirty and there was mould on the tiling. There were dirty dusty plastic plants in the window boxes. We were very unhappy but decided to stay and make the best of it because we were only staying one night. I could not have stayed in that hotel more than one night, and in fact found staying there even one night an ordeal. We asked the manager for a wake up call and he agreed to this, then later came to our room and informed us that he could not do this for us as the system was not working. We had to get up early the following morning and so we did not have a chance to sample the breakfast but I would have been very reluctant to do so in any event given our overall experience. All in all this was one of the worst experiences I have ever had hotel wise and I would recommend that this hotel be avoided.", "Date": "September 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "manchester", "Title": "“A hidden gem”", "Author": "laurenlewis7", "ReviewID": "UR35546908", "Content": "Just stayed here this past weekend. and what can I say? It was lovely! My only regret is sleeping through the free breakfast! It is within walk-able distance of 2 tube stations and its a lovely area. Rooms are small but very clean and just enough space is provided - I didnt feel cramped or anything -its very good value for Â£ (Â£50 for one night) I only needed a bed this one was more than sufficient and basic hotel amenities were present in the room. It was quaint - very English - although I believe it was Chines folks that own it - the staff were very friendly. There are a million stairs and NO lift so if you have extra baggage be aware you will have to carry it up 5 flights of stairs... also the walls are paper thin so again if you are a light sleeper bring ear plugs! haha Altho when I went , I think I may have been the last guest to get in so no one kept me up! I REALLY LIKE THIS PLACE AND WILL BE STAYING THERE AGAIN IF I HAVE A MINI WEEKEND IN London. 9/10!!!", "Date": "July 23, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "York, Maine", "Title": "“Very Rundown”", "Author": "yorkgirl28", "ReviewID": "UR27309602", "Content": "After reading glowing reviews in 2 guidebooks, we booked a room at the Avonmore unfortunately before reading reviews on Trip Advisor. Then it was too late because of their 3 week cancellation policy. So we decided we'd make the best of it. The pictures on the web site are terribly outdated. I'm sure the hotel was a lovely place at one time...a long time ago. I don't thing they've touched the place in 10 years. The carpet is stained. The wallpaper is peeling. The drapes are ancient and dirty. The towels, although clean, are frayed. And the place is in a rundown, but safe and quiet, neighborhood. There really aren't many restaurants or pubs withing a decent walking distance. And West Kensington is pretty far outside of London. No way can you walk to the city. You have to take the tube or a bus. But the sheets were clean and the staff was very accomodating. and the breakfast was good. The maddening thing was we paid the same as we would have paid to stay in a much better and more conveniently located place. Only stay here if you get a really good deal!!", "Date": "April 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Southampton", "Title": "“Perfectly nice hotel”", "Author": "Barry_and_Anna", "ReviewID": "UR24034117", "Content": "I stayed at the Avonmore while attending a conference at Olympia. I much preffered the experience to that of staying in the large chain hotels nearby as I have done in previous years. The hotel isn't luxurious, but it's clean, comfortable and the staff are polite and helpful. Breakfast was very good.", "Date": "January 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "USA", "Title": "“Reasonably pleasant stay”", "Author": "UStraveller1234", "ReviewID": "UR23180364", "Content": "Just returned from a stay at the Avonmore Hotel. I'd give it a bit of a mixed review - the hotel is somewhat shabby; the rooms are small and the staircases quite steep going up to small rooms. The toilet took a long time to refill, so sometimes didn't flush consistently. The website definitely makes it look more luxurious than the reality. The staff, however, was very lovely and helpful, the breakfast was good, the hotel was clean, the rooms made up promptly, and the single beds were comfortable. West Kensington is a residential neighborhood a little outside central London, the hotel is a 5 -7 minute walk to both the undeground and buses that go directly into the center of the city. (Need to figure on about 30 minutes on the Tube or bus). There is a very good Turkish restaurant nearby, as well as several local pubs, but otherwise not a big restaurant or shopping area.", "Date": "January 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "derby", "Title": "“Rubbish!!!”", "Author": "derbyboy82", "ReviewID": "UR20849401", "Content": "After looking at numerous hotels on the internet we stumbled across the Avonmore hotel, which to be fair from its websites discriptoin and photographs looked exactly what we were looking for!! So we booked. I though the prices were a bit steep but i thought i would be staying in a nice luxury hotel, so i was happy to pay. When we arrived and got off the tube, i was quite dissopointed about the area which we were in, to me it looked a bit run down to be honest. However we proceeded towards the hotel. As soon as we found the street where the hotel was situated i wanted to walk straight back on the train and go home!!! \"up market town\" was how the hotels website discribed the area!!! more like down market!! Anyway i was going to give it the benifit of the doubt. We were welcomed by a front door that was locked so had to use the lower entrance,good start!!. After checking in we made the massive trek up 3 flights of steep staircases, luggage in tow, to our room.We opened the door and i my heart sank, it was awful!!, The beds had seen better days, carpets were dirty, wallpaper peeling of the walls, cobwebs on the light fitting, a huge green sink situated in a corner which was full of limescale and virtually impossible to get to as there was a chest of draws right infront of it!! The only modern thing about the room was the card swipe door entry system!!!!! Then comes the shared bathroom!!! which i have always hated. It was disgusting!!! there was still a towel on the floor which was wet through and obviously had been there for some time!! The toilet didnt flush properly and the shower was a trailining hose off the hot and cold taps!! the water just trickled out! All this after the first 30 mins of arrival.We all agreed not to have the breakfast even though they were included in the price. Luckilly we were out most of the time and only used the room to shower and sleep. There is only one positive thing to say about the hotel, it is close to the tube!! I would'nt recommend this hotel to anyone!!!", "Date": "October 13, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "WILTSHIRE", "Title": "“living in the past.”", "Author": "MEANDERINGDUCK", "ReviewID": "UR17230453", "Content": "Regarding the 4 star status this expired in 2003 We arrived after check in time (as per website)to be told website was wrong and the room would be ready in 20 minutes. Went out for lunch returned to be shown to our room. Room was just about large enough for 2 (not 3 as there was a 3rd bed in the room and we were then told it was a triple)floor appeared to have not been vacuumed,stool had brown mark on where someone had sat on it undressed,soap dish in shower had not been washed and had soap scum from previous occupant stuck to it,Then the worst breakfast experience I have ever encountered.The (cook) was also the waiter/receptionist.we were asked to share our table with total strangers.I did not order any cooked food as the (cook)was wearing no apron or other protective items. he did not attempt to wash his hands between handling raw food and other items.Teapot arrived with ONE teabag between FOUR people. When cereal was ordered it arrived with milk already in the bowl (not everybody likes a lot of milk).Do not use the mini-bar unless there is a price list. (there wasn't) Website stated that nearest tube station was Gloucester Rd.Not true, there are 3 nearer. (closest is West Kensington).", "Date": "June 25, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Idaho, USA", "Title": "“Terrible and filthy”", "Author": "IdahoTrekker", "ReviewID": "UR16377933", "Content": "By the time we carried the luggage with significant difficulty up four flights of stairs, last of which was in the dark, to enter a poorly furnished, very musty-smelling room, we phoned another hotel, secured a room, and immediately left. There was hair in the bed and it appeared the sheets had not been changed. There was significant mildew in the bathroom, and noisy trains just outside the window. This is advertised as a four star hotel awarded by AA UK, but in fact it had some years earlier been awarded a four diamond rating, and the diamond ratings have not been in use for at least two years...meaning it has not received a new AA UK rating. Their cancellation policy is being contested with the credit card vendor for a refund of the because the accomodations were totally unacceptable, and the photos and advertising are incorrect and misleading at the least.", "Date": "May 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Quirky little gem of a hotel”", "Author": "hismissusNewYork", "ReviewID": "UR14379186", "Content": "This place has its quirks - the rooms are VERY basic, the queen sized bed was actually two singles pushed together and was a bit lumpy, the staff is ragtag, and the bar is a story unto itself! We loved the location. It is situated on a quiet street in Kensington. If you are looking to actually relax after a day of touring around and/or a night of pub crawling, the Avonmore is perfect for you. Yes, the tube runs through the backyard, but the windows are double glazed and we never found it to be an issue; our sleep was never distrubed by the noise. There is a small selection of restaurants in the area - Persian, Chinese, greasy burger shop, &c. There are a few cute pubs that also serve meals. The tube station is a quick walk from the hotel, making it easy to get to any attraction you may be interested in seeing. The staff is adorable. Someone should base a sitcom around this place! There is \"Helga\" (we nicknamed her that), the Amazon Angelica Huston lookalike who seems to be the maid and the cook (and a fine cook! we enjoyed breakfast each day!). She walks around barefoot quite a bit. Then there is the tiny Asian night bartender, who measures out shots in a bottle cap! The proprietress is very chatty and sweet. She also has an affection towards skintight jeans - meow!! Overall, a great experience. Loved the quiet location. The place could use a bit of TLC, but is kept clean. The rates are cheap as chips, so one cannot expect luxury. When looking to stay outside of the noise of touristy spots, yet have easy access to attractions/restaurants/nightlife, pick the Avonmore!", "Date": "March 19, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Cape Town, South Africa", "Title": "“Cheap and not so cheerful”", "Author": "Mini69", "ReviewID": "UR13247318", "Content": "Price and location, especially for Olympia and Earls Court, are great, but the hotel is very tired. Everything is poorly maintained, carpets are warn, blankets on beds are old, building itself needs a lot of TLC and problems with water pressure in top rooms, i.e. no water coming out of shower. Staff are overall friendly and helpful, but there are just not enough of them. In the morning one girl does all the cooking and serving leading to rather Faulty Towers situations and delays - do NOT be in a hurry in the morning and do not expect to be served at the same time. Hotel is certainly not appropriate for anybody who is not fully mobile, as there are several stairs to get anywhere in the hotel.", "Date": "February 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Westcliff-on-Sea, Essex", "Title": "“very pleasant experience”", "Author": "Hook_7", "ReviewID": "UR10867084", "Content": "Room was small and basic. but sufficient for needs. Overall it was clean Staff more than made up for lack of luxury. They were extremely pleasant and courteous at all times. Good for anyone needing bed and breakfast in town.Breakfast menu could be expanded but I understand this is being addressed in the near future", "Date": "November 17, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Somerset", "Title": "“Be wary”", "Author": "Basil2869", "ReviewID": "UR10294379", "Content": "We booked 3 rooms with this hotel. It was probably the poorest accommodation we have stayed in for the price paid. Good points: 1. Staff friendly and helpful 2. Beds comfortable 3. Well placed for access to buses and tube Bad points: 1. On arrival, the main door was out of use due to a broken lock and was to remain so for our stay, so we had to access via the basement door! 2. One room was on the first floor, with the two remaining on the 4th. The stairway was extremely narrow, with glass fire doors, one of which was consistently wedged open (this was done by the owner right in front of me), presenting an extreme fire hazard as there was no other way out other than to jump from the 4th floor! 3. The rooms appeared clean on first sight, and indeed the sheets and pillow cases were, but the blankets and bedspreads were stained and appeared not to have been washed for some time. 4. Some of our beds were made on the second day, but one was left unmade, only 2 milk capsules left on arrival for 3 people, but 9 on 2nd day! There was no hot water on the 2nd day but this was fixed quickly after speaking to the person on duty. 5. The breakfast was disappointing. Cereal was either museli or cornflakes of which we ordered the latter - they were clearly cheap alternatives and tasted awful. We then had cooked breakfast which was actually quite tasty, but the sausages were poor quality and there were no tomatoes (as advertised), and no veggie option. The food is prepared and cooked to a small kitchen right next to the dining room, with the door wide open which is a little off putting. 6. On checking out we were asked to pay by cash (something I notice other guests have been asked to do). We didn't have the Â£200 plus required in cash so the Visa was accepted in the end. Very odd.... 8. One of my party was in a 4th floor room and was kept awake for over 2 hours by the noise of a TV coming from a neighbouring house, in addition to the trains to the rear of the hotel and traffic noise to the front. 7. Generally the decor was very dated and shabby, towels frayed and old, bathrooms contained mould and needed more attention paid to the cleaning of them Overall, I would say that the websited is quite misleading, and guests should be warned that the tube runs directly behind the hotel, and the road is fairly busy to the front. It should also be noted that there is no lift, and therefore is not suitable for elderly (or unfit/infirm) people. The staff, however were very polite, and did remedy any immediate problems we had. I do think the hotel would benefit from a visit from an hotel inspector very soon - I would not stay here again", "Date": "October 24, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Cheap and cheerful”", "Author": "rye1967", "ReviewID": "UR8719441", "Content": "Location: Within walking distance of Kings Cross or Euston Squre tube as I required. Most of nearby buildings in Cartwright gardens are also hotels. Staff: Friendly and welcoming. Ownership has recently changed, according to the manager on duty. Room: Small but clean. There were some renovation works going on in other parts of the hotel. Security: Although I had no problems, I was concerned about leaving valuables in the room, I got a warning from the manager on duty not to allow strangers into the building. Value: Good, as expected for 45 GBP.", "Date": "September 15, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cardiff", "Title": "“Awful breakfast!”", "Author": "KrazyKCardiff", "ReviewID": "UR8536700", "Content": "I feel a real need to comment on this bed and breakfast/. I will start with the positive. The room was clean and large. The location is close to west kensignton tube station. The negative- for Â£95 a night it was rather expensive and the breakfast wasn't worth it. Firstly we went down to breakfast in the morning and there wasn't a table avaliable. We had to wait as there were only 3 tables (and nine guest rooms!). We were told we would have to share a table. My mums coffee was like sludge- it was undrinkable and had grounded beans at the bottom. The breakfast took 35 minutes to appear. The musesli was way too sweet and the scrambled egg was rock hard (it had been left in the pan for ages). The girl informed my mum that they didn't do mushrooms! There was no vege option instead of sausage and bacon. There was one girl serving, cooking and keeping an eye on reception! They should definitely employ more staff. I have stayed in many b and b's and hotels on my travels around the world but none as bad as this.", "Date": "August 29, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Hong Kong", "Title": "“disgusting”", "Author": "StephenHongKong", "ReviewID": "UR8264007", "Content": "Date : 29.6.2007 I have reserved and confirmed a triple bed room with en-suite. When I arrived, the room is fully occupied. We are then re-located to another room with train rail outside. Every few minutes, there should be a train going through - very noise and can't sleep. Since we arrive at night and are very tired, we entered the room and felt asleep. In the next morning, we find that the bed sheets are very dirty and the blanket, the cover are very dirty. They seem no be washed for years. I am very disappointed with this hotel and leave as quickly as I can. Stephen Tang", "Date": "July 31, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "boston", "Title": "“Little gem of a hotel”", "Author": "wimbledonBoston", "ReviewID": "UR8122655", "Content": "I wanted a clean and well located B&B with a private bath near a subway station. Avonmore was all of that and more, because the persons who staffed the front desk and the dining room were very personable and always helpful. The price of the room was very fair in the middle of the summer tourist season. I would stay there again.", "Date": "July 15, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "California", "Title": "“Horrible hotel experience - Avonmore Hotel”", "Author": "PeanutTree", "ReviewID": "UR8112150", "Content": "We booked a reservation for the Avonmore hotel stay from viewing their personal website reservations@avonmore hotel.co.uk. for 5 nights from 7/7 to 7/11. The website was very attractive and we were looking forward to our stay based on this. We are looking for a hotel to stay in Kensington for a family of 4. The Avonmore was described on the website as a 4 diamond hotel, on a quite street in close to local sites and transportation. The description of the hotel mentioned privately owed, mentioned that it had won an award , great care and attention has been dedicated to the furnishings and accessories. One of the most pleasant affordable hotels in central London. We experienced the following issues at the hotel: 1. Bed bug bites 2. Dirty blankets, bedspreads and overall bedding 3. Pillows were well used, and uncomfortable beds 4. Old rotting food in the mini bar from previous client 5. Floor / sink area visible dirt 6. Carpeting - evidence of dirt and objects from previous clients on the floor 7. Noise level high from train tracks located right outside of our window. 8. dead bugs in the walls 9. dirty curtains and windows 10. stained upholstered furniture Overall, we found the housekeeping conditions of this hotel to be completely unsatisfactory and to be a health hazard. We could not sleep with the bedding and had to strip bedding off of the beds down to the top sheets. We still ended up with visible bed bugs bites all over our bodies. We met a hotel keeper who was basically in charge of the reception desk, the breakfast prep and running the hotel. She mentioned to me that Sunday was a long day for her...7 a.m to 12 midmight. We spend our first night in the hotel and the following morning, I worked to find another hotel and express my concerns to the hotel management. The hotel keeper on site was kind and understanding of my complaints about overall housekeeping nd offered to call the hotel owner who was not on duty on Sunday 7/8. She offered to talk to the maid ( who she said did not speak any English) and try to have her spend extra time in the rooms cleaning. I insisted on talking to the manager of the hotel. The hotel keeper told me that she did not like to be disturbed on a Sunday and that I could talk to her in person on Monday as she would be there serving the breakfast. I insisted that we needed other rooms or better accomodations immediately that we could not sleep another night in the hotel in this condition. She called the manager...and spoke with her to convey my frustrations about our accomodations...We did not mention bug bites to her. The manager refused to talk to me over the phone. She insisted on communicating through the hotel keeper. She offered to locate new blankets for the room and offered this up. She told the hotel keeper that if we left the hotel, she would charge us for all 5 nights unless she was able to rebook the rooms. I kept insisting to talk to her with no avail. After the phone call, the hotel keeper said that she was very sorry that we were not satisfied, she told me that she could do very little, only have the maid clean extra long in the rooms, that she understood my complaints, that the owner was Polish, that she was British and that she understood the standards we were expecting. My family and I checked out of the hotel...paid cash for the one night stay ( they had originally billed my Visa for this amount and refused to refund it once I paid the cash). We itched our way to our new hotel location. Upon checking in to my hotel, I found out that my Visa card had been billed for the entire 5 night stay. Please know that this hotel is unhealthy, untidy and unprofessional...overpriced and disgusting and should be inspected by the board of health. Execept for the receptionist, the experience was completely disappointing and the worst I have seen in all of my stays in Europe.", "Date": "July 13, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Toronto, Canada", "Title": "“Cute and Cosy”", "Author": "genius57", "ReviewID": "UR8000774", "Content": "We stayed here, after much trepidation, during the abnormal heat wave in early May. We were worried because of mixed reviews on this and other sites. But we had no cause for worry. The staff was extremely pleasant, the meals wonderful, and the facilities were large, clean and comfortable. We had the large bedroom in the front of the hotel, and if there were trains we never heard any. The only downside is the lack of elevators, so pack lightly if you have to go to the third floor! The location was brilliant - close to tube station and nearby main roads. Margaret was a warm and helpful hostess and we would certainly be willing to return there. Quiet and safe locale.", "Date": "June 26, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Durham, NC", "Title": "“Excellent Staff Enjoyed the stay”", "Author": "MagyarNC", "ReviewID": "UR6543268", "Content": "The staff and attention to detail are simply wonderful. This was my first visit to London and Margaret is an excellent source of information about the city and surrounding area especially transportation options including the underground or tube. She is an outstanding cook and breakfast is top-notch experience. This was a business trip and my meetings took place at the nearby Olympia Exhibition Centre. It was truly a delight to stay here and avoid the typical cookie cutter hotel chains. The hotel is very clean and I enjoyed the neighborhood atmosphere. The hotel does not have an elevator or lift so pack lightly. I would stay here again for business or vacation. Margaret and the staff make the difference and go the extra mile for customer service. R. Vargha, Durham, North Carolina, USA", "Date": "January 2, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Tyler, Texas", "Title": "“Reservation not honored”", "Author": "TexasKBEE", "ReviewID": "UR6521311", "Content": "If you choose to book at Avonmore, be aware that a confirmed, deposit-paid reservation will not necessarily be honored. We had a twin room reserved for 5 nights, Dec. 1 - 6. When we arrived we were told that the room reserved for us had a plumbing problem that would require a week to repair so we were given another room that was available for only 3 of the 5 nights reserved. The room was well-equipped but had dirty seat covers and shabby, worn and faded drapes and bedspreads. One night we were without cold water (but had hot water that was too hot to bathe in and of course could not drink.) The owner does not live on the premises and her night and week-end help were inadequate. In addition, the neighborhood is borderline seedy. The owner booked us into another \"equivalent\" hotel for the last 2 nights. This hotel was not equivalent although it was more conveniently located. Although Avonmore's owner paid our cab fare, it did not make up for the lost time in re-packing and re-locating, resulting in our losing the better part of a day of our vacation. We have visited London at least a dozen times, staying in various small hotels and apartments. Our Avonmore experience was the worst we have encountered, and we certainly won't be staying there again.", "Date": "December 30, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "DK", "Title": "“Excellent stay - near Olympia”", "Author": "olympialondon", "ReviewID": "UR6342674", "Content": "I stayed here 3 nights. Warm welcome, excellent breakfast. All staff members did their best to help. Only one thing - the steps to the entrance. It was difficult with luggage. But I will come back", "Date": "December 7, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Naarden", "Title": "“Warm welcome, but”", "Author": "Catharina10", "ReviewID": "UR6333851", "Content": "Friendly staff, excellent breakfast, good location, room ok, but on 4th floor, no lift, very small staircases and just 1 way out. Never again.", "Date": "December 5, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Friendly Staff / Clean, Economic London Lodging”", "Author": "wrldtraveler2", "ReviewID": "UR5764982", "Content": "We were greeted upon our arrival at the Avonmore hotel by Aggie a very helpful and friendly member of the hotel's staff. Aggie provided excellent service throughout our 4 day stay in August. Our room was located up many stairs but was a clean and reasonably sized room for Europe. The hotel is located direcly on a tube/train line so you will hear train activity into the night and starting early in the morning if you have a room in the back of the hotel. The noise was loud but could be adequately blocked with the windows closed. The hotel is located within an easy walk to the West Kensington tube station and/or the Olympic bus stop. My friend and I were able to walk all the way to Kensington Palace but it is a haul. The neighborhood appeared safe and we felt comfortable walking alone both day and night. The English breakfast was hearty and filling and a great way to start the day. Overall, I felt that the Avonmore hotel provided a reasonably priced room with easy access to London and a friendly, accommodating staff. I would stay at the Avonmore on a future trip to London.", "Date": "September 3, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Charlotte, NC", "Title": "“Adequate but not great place to stay in London”", "Author": "phiggmart", "ReviewID": "UR5501299", "Content": "Much of our visit to Avonmore was fine. The staff was helpful - arranging for a cab, keeping our luggage and going to the extra steps to double check the status of our bill in terms of our correct balance. Location is off the beaten track - but we knew that and found the tube station a quick 5 minute walk and that you were just stops away from most of what you want to see. (West Kensington is on the District line). Neighborhood is not fancy - but we actually kind of liked that. Rooms were fine - but not as lovely as the photography on the website. So, it feels a bit dated - probably time for new fabrics, carpets and draperies. So, from that aspect, we were perhaps a little disappointed. But, for a reasonably priced place in London - we could recommend it. But, clearly a 3 star average place - not four star. Go in with your eyes open in terms of location etc.", "Date": "July 23, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Highly Recommend the Avonmore Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR5338838", "Content": "We were six travelers. With a family of four, including two younger daughters, and two grandmothers, we had perfect accommodations: a three-room suite. That is, three separate rooms separated from the main hallway by a door. We could leave our doors opened and float freely from room to room without the fear of disturbing or being disturbed by neighbors. The room my husband and I were in had its own in-room bathroom, and the other bathroom was outside the suite but was only available to our party and to noone else. The rooms were only slightly smaller than what you'd find in the States but were by no means cramped. It did feel like we were in a Holiday Inn or Sheraton, just a bit smaller. It is not cheap, just as any decent accommodations in the UK are not cheap. With the exceptional warmth and considerate spirit of the employees, the great breakfasts, and the superb arrangement of our rooms, the price was worth it completely. This will be the first place we call if and when we return to London. We will be disappointed if they are full.", "Date": "June 13, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Ojai, CA", "Title": "“Charming Little Band B”", "Author": "A TripAdvisor Member", "ReviewID": "UR5293229", "Content": "My husband and I spent two weeks at the Avonmore Hotel in London. We were given a quiet and nicely decorated room (#2) on the first floor. The owner, Margaret, and her staff were very friendly and helpful. The full English breakfast was generous: eggs, Canadian bacon, sausage, cereal, toast, juice, coffee and tea. The only inconveniences were the stairs with no lift and the required \"cash only\" payment at the conclusion of our stay. May 18 - May 30, 2006", "Date": "June 2, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Beijing, China", "Title": "“Great for the Older Crowd!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5044302", "Content": "We enjoyed our stay at the Avonmore. The staff was excellent and very accomodating to our needs. The breakfast was very good! We did find the accomodations a little older than we expected and further from the heart of things. It was located in a neighborhood with few restaurants or pubs close by. Probably a better location for the 'older crowd' and not those who stay out later into the evening.", "Date": "May 9, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Seal Beach, California", "Title": "“A Big Fat Resounding No!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4141006", "Content": "Arrived at the Avonmore to find that it was nothing like described on the Internet. Checked into room #2. Shower head was totally clogged with limescale and the hose was kinked so that hardly any water would come out (see photo), and the shower door wouldn't close. Tried to make tea - a black lump of something fell out of the kettle. Hair dryer didn't work. Worst of all, the bedspreads, decorative pillows and draperies were gray with dirt (see photo). Seat covers were stained (see photo). My girlfriend and I had made a reservation for 8 nights but I checked out the next morning, before my friend arrived, because I knew she would hate it. That's when it got really ugly. The young girl at the desk told me she would have to charge us for the full 8 nights or she would lose her job. She said there is a 21 day cancellation policy. This was news to me. This policy is NOT stated on the website, nor was it communicated to us when the reservation was made via e-mail. I politely told her to go ahead and charge it, but that I would pay for one night and contest the following 7 nights. She called the owner and handed the phone to me. The owner started yelling - very unprofessional. I left and checked into another hotel. When I returned to the U.S., our credit card company disputed the credit card charge. The hotel owner then produced an e-mail advising us of the cancellation policy. Here's the thing - that e-mail was never received. Not only that, it did not follow the 'thread' of the e-mail conversation, AND it was written in perfect English whereas the other e-mails were written in broken English. This e-mail was a fabrication. The hotel owner's bank, however, refused to bend because of the production of the said e-mail, and we were charged for the full 8 nights. It still makes me sick to my stomach. I lived in Britain for 30 years - I know what to expect from a London hotel. This is not it. Traveller beware!", "Date": "November 23, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Rooms": "3", "Value": "3"}, "AuthorLocation": "Hershey, PA", "Title": "“Disappointed!”", "Author": "ucallmekat", "ReviewID": "UR3621330", "Content": "After a long trip from the states, we finally arrived at the Avonmore to be informed that shower in our room was broken and we would have to stay one night in a neighboring hotel. That hotel was run down and dirty. We finally checked into the Avonmore the next day. Our room was on the 4th floor and it was very warm! There was no air conditioning or elevators. They did manage to bring us a fan. The shower wasn't quite fixed, as you had to turn on the sink faucet to get the shower to work. (Weird!) The breakfast was good and made to order. Others commented about the neighborhood being \"seedy\". We didn't think it was that bad and the location was very convenient. All in all, next time we would choose someplace else.", "Date": "June 29, 2005"}], "HotelInfo": {"Name": "Avonmore Hotel", "HotelURL": "/ShowUserReviews-g186338-d192160-Reviews-Avonmore_Hotel-London_England.html", "Price": "$119 - $190*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">66 Avonmore Road</span> | <span class=\"extended-address\">Kensington</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">W14 8RS</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "192160", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/df/bc/dfbc0b90e4cc43c457cf65876a7d76541large.jpg"}}