{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Tiny room but great location”", "Author": "Trev81", "ReviewID": "UR75208863", "Content": "Location was perfect, we stayed here for 7 days, nice neighbourhood. Very close to Earls Court Subway. The front desk person was helpful, booked some tours through him. The room and bathroom were tiny but perfectly workable and clean. Breakfast was included, wasn't anything special, cereal, some toast with jam.", "Date": "August 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "ON", "Title": "“good location to subway but thats about it”", "Author": "staryk5", "ReviewID": "UR20536798", "Content": "nothing really too great about this hotel other than the location. Looks are really deceiving - from the outside it looks like it would be really fancy, but no way! It's a very dreary hotel that really needs a makeover. Positive - staff was really nice. They had a library at the front desk and I was able to borrow a travel london book. Very nice of them Super good location only for the subway. Really close to Earls Court station. 5- 10 mins on that and you are in the center of things. London is a really expensive city to find a place, but there has got to be a better place than this hotel. Keep looking in my opinion", "Date": "October 1, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Hastings, East Sussex", "Title": "“Rude staff, pokey rooms, PANTS!”", "Author": "killakellers", "ReviewID": "UR15166999", "Content": "The hotel location is FAB, and Kensington is a great place to stay, however the staff are very rude and unfriendly and the rooms are pokey and limited. The bathroom was a little grubby too. How this hotel got 3 stars I have no idea. Its also massively overpriced. You can find a much better deal elsewhere.", "Date": "April 20, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Cannock Staffs UK", "Title": "“More like a Hostel not a Hotel!”", "Author": "DJM1", "ReviewID": "UR12291735", "Content": "We stayed here 30th Dec 2007-03rd Jan 2008. I cant believe its called a hotel it was more like staying at a hostel.....! The best thing was the location like other people say its ideal for going in and out for your sightseeing trips.Earls court tube is 2mins away,and all you have to purchase is a zone 1-2 oyster card for the transport. The bad things..... 1.loose tiles on bathroom floor 2.Lights not working plus Dangerous. 3.Bedroom Carpet/Hotel Carpet Dirty...Bedroom didnt appear to get vacuumed. 4.Toilet space and shower space very small,if you are of larger build you will have no chance of sitting down on the toilet. 5.Breakfast very basic,toast always undercooked.Warm Bread!!! 6.Handrails leading up to the hotel entrance very insecure. How this Hostel/Hotel Passes the Health and Safety Checks required is beyond belief........ We only spent 1 hour a day maximum in the room to get changed thank god for that. So if you want location its not bad..... otherwise if you want a decent standard hotel forget this one.", "Date": "January 3, 2008"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Romania", "Title": "“sooo tiny...”", "Author": "GiaRomania", "ReviewID": "UR10115506", "Content": "First of all, I must admit I didn't check any comments on the hotel before booking. It was planned in a hurry this trip and I trusted the booking company when they oferred us this 4 stars hotel (this is the category of the hotel on our booking mail). Seeing the other comments, I alredy consider myself a lucky traveler as I didn't have problems with the shower and the room wasn't in the basement! But still, this was the tiniest room I have ever been with the perfect match in the shower. There were max 30 cm between the bed and the front wall and of course, to take advantage of all space, they had to place the tea cup's support on the same wall. In order to pass sideways and also hunchbacked through that area. Yes, the sheets were clean, but I took a look before leaving under the bed and I was horrified to see rests of food, wrapping of candies and the dust floating like they didn't passed the vacuum cleaner for 2 months at least! Anyway, disgusting to see that after spending 3 nights in that room. We also had the fire alarm on Sun morning at 6 am and when we asked at the reception what was that they said it's normal to test it from time to time! Breakfast was very simple: coffee, milk, cereals and toast. It's good that is close to bus station streight to Marble Arch and metro. Overall, I wouldn't repeat the experience. I should have imagined why their website is so cheap and they don't have any photos of the rooms.", "Date": "October 18, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sussex", "Title": "“the pits!”", "Author": "bean184", "ReviewID": "UR8864545", "Content": "The bathroom was tiny, too small to swing a cat! had to turn sideways to get in to the shower as the toilet was blocking the door from opening fully. The water pressure/temperataure was dodgy to say the least, was scalding hot one minute, freezing cold the next, and more like standing under a tap as opposed to a shower. The bathroom could have also done with a good clean, the hair dryer was so ancient i was too scared to use it. Only plus point was the bed sheets were clean and the bed comfortable, Would not recommend and would never ever stay there again, if you paid me. The hotel had not been refurbished, to any degree and i certainly would not class it a a luxury hotel.", "Date": "September 23, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Great Location”", "Author": "adenny", "ReviewID": "UR8268038", "Content": "A short walk from the Earl's Court TUBE stop. It was easy to get to every major attraction from this location and it was all in zone 1 which saves you $. The front desk staff was not cheery and not a good first impression. The room was small but not uncomfortable (unless you bring tons of luggage.) There was no AC in our room but the window cooled it off nicely and its not like London gets that hot anyway. The breakfast staff/cleaning staff was much more polite. Breakfast was toast cereal, juice, and fruit cocktail from a can with tea. Internet access was great if you have wireless they give you the password and you can us it in the dining room. The hallways and elevator get stuffy because there aren't any windows and the elevator often stops at every floor even if no one pushed the button. I would stay there again for the great location.", "Date": "July 31, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "spain", "Title": "“Small room, small breakfast”", "Author": "newbie74", "ReviewID": "UR8117708", "Content": "small room, i was in the fifth floor, the room was clean and the service well. the breakfast was very simple: coffee, cereals, toast in the photos you have a vision of the room.", "Date": "July 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Montreal", "Title": "“Conveniently located”", "Author": "DCMontreal", "ReviewID": "UR6542277", "Content": "Good location - few minutes walk from Earls Court tube station. Small room, but comfortable and clean. Nice breakfast room with complimentary breakfast and good service.", "Date": "January 2, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "istanbul,turkiye", "Title": "“Avoid it”", "Author": "bluelemon", "ReviewID": "UR6353461", "Content": "I stayed in this hotel for three nights, and I hope that this would be the last. My room was on the ground floor, with the tiniest bathroom I ever seen. Photos are attached. The total width of the bathroom is what you see in the picture of the closet. You may also see the sink, which is again the smallest sink I have ever seen in a hotel room. I could not wash my hands, since they did not fit under the tap. Please pay attention to the worn out hair dryer, which I hesitated for a while before handling, since it looked very dirty and dangerous. The room itself was small and worn out, except the bedsheets, sheets were ok. The worst part is yet to come. On the second night I woke up with the fire alarm at 4 a.m., which happened to be a false alarm! We all get out of our rooms, and sent back by the staff saying it went out by mistake. After some sleepless hours, I woke up with a false fire alarm again at 7:30 a.m.!!! So, if you want to spend 100 GBP a night and your style of comfort is waking up with fire alarms, that is the place for you, enjoy your stay...", "Date": "December 9, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "1", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Well everyone below me sums it up”", "Author": "Ausyuppy", "ReviewID": "UR5880345", "Content": "Booked the hotel on Wotif after research here. The hotel lived up to my expectations, which as you can see in the comments below, there isnt too much to expect. Honestly though, the hotel room was fine. It was small, it was in the basement, BUT we had windows which also let in natural light from the street. One warning though, there is NO airconditioning, so I wouldnt recommend staying there in the summer heat. They provide FREE wireless internet for some floors. I beleive it is in the lobby, and you can get it below in the basement. I doubt you would get it on maybe level 2, but you can always take your laptop to the lobby. The rooms look like they have been renovated and modernised. Its a shame they forgot to renovate the bathrooms at the same time. The chick they have on the front desk is useless. No customer service skills whatsoever. The luggage ticket system is fine, if they enforced it. When you drop your luggage off for storage, they leave it in the lobby, attach a ticket to the bag, and give you the corresponding ticket number. When you arrive back, theoretically speaking, you should have to give the ticket back to get your bag. Nup not here, just walk on it and take it. The guy running the show with the Corgie, he is helpful, can book tours around london for you and provide tourism information. About the bathroom, the people below are NOT exaggerating. The room is tiny. The room we had, the toilet was squashed in a corner, that no person over 100kg could possibly get into. The room we had, had a bad case of wood rot around the bathroom door. Due to the shower recess being so small, the water ends up on the floor outside the bathroom, which is carpet over timber. There was one spot where my foot could go through the floor. There is one upside to the bathroom, the shower head was above my head (I am 185cm tall) and the water pressure was fantastic. Overall I would recommend, but dont expect too much. It is in an excellent location. A little pricey, but that is London for you.", "Date": "September 26, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Mission Viejo, California", "Title": "“Small outdated rooms/lobby furnishings looked like thrift store specials!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4771720", "Content": "Person in charge rude while checking in. Rooms very small and bathroom small. Furnace made loud noisies off and on all night. Electricity and water was off the last night of our stay.....elevator did not work and had to haul suitcases down three flights of stairs. Furnishings in lobby did not match and looked like something they purchased at a thrift store. The rooms were clean.", "Date": "March 29, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Good London B&B”", "Author": "A TripAdvisor Member", "ReviewID": "UR4570536", "Content": "My boyfriend and I stayed at this hotel in January for one night. I found it a pleasant, clean place with a receptionist who seemed to like Aussies. It wasn't full of people, as it was off season. The room was simple but clean. It does have a small bathroom but everything worked. They have a cute dog who was in the foyer. Best thing is the location to Earl's court station, which is a short tube ride to Heathrow Airport.", "Date": "March 3, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Leeds UK", "Title": "“Not impressed”", "Author": "A TripAdvisor Member", "ReviewID": "UR4346608", "Content": "The room and en suite bathroom were the tiniest I've ever been in, and the room was in the basement, down some stairs which seemed to have a tropical heat in december. Every time we walked down them we joked about our next expedition down the congo. The front desk staff were iffy, we were locked out one night as the person at the front desk disappeared and you aren't given a key to the front door. This means it's either open to everyone or locked with the desk unattended, which doesn't seem very secure. When it came to leaving your luggage there, they just give you a ticket and leave them in the front room, so it seems anyone with a raffle ticket can pick them up. The cleaning staff were friendly though. Overall, we will not be staying there again.", "Date": "January 11, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Edmonton, Alberta, Canada", "Title": "“A Luxury Hotel???”", "Author": "Clark52", "ReviewID": "UR4139228", "Content": "We stayed 3 nights (Oct 24-26, 2005). Fire alarms sounded in the early morning hours of the 25th (two times ) and the 26th (three times). No sleep on those nights nor on the third night, all because of a smoker! Management refused to oust the culprit and did not offer compensation. We were not the only ones to complain. What was supposed to be a pleasant stay left a bitter taste. Rooms are very small, but clean. \"Acting manager\" (the accountatnt) could use a course in dealing with clients.", "Date": "November 23, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "4", "Service": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“It may be Kensington, BUT...”", "Author": "A TripAdvisor Member", "ReviewID": "UR3513053", "Content": "Good rate (Â£ 47 including tax for a \"king size leisure\"), very disappointing guestroom - very dark, stuffy, old-fashioned - and terribly small bathroom. Staff OK, cleanliness OK-ish. Not a place I'd come back to if I can avoid it, even if the location is good: it's only a short walk from one of the underground stations and from the national museum of natural history. Workable internet cafe just across the road.", "Date": "May 31, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "melbourne", "Title": "“cheap and cheerless”", "Author": "phil_and_mary", "ReviewID": "UR3336346", "Content": "booked in for 2 nights in Feb 2005. but only stayed for 1 night as the noise from the room next door kept me awake with their partying through the paper thin walls. the manager did offer us a different room for the 2nd night (for a fee), but I was not willing to risk another sleepless night after a long flight from Tokyo. The room was small and pokey and the shower hardly worked. Good location, but next time, pay a bit more and get a better hotel.", "Date": "April 5, 2005"}], "HotelInfo": {"Name": "Kensington International Hotel", "HotelURL": "/ShowUserReviews-g186338-d192148-Reviews-Kensington_International_Hotel-London_England.html", "Price": "$206*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4 Templeton Place</span> | <span class=\"extended-address\">Earl's Court</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">SW5 9LZ</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "192148", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/ad/94/ad94fcc3cd4cc123392f37f5d9d6a3601large.jpg"}}