{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bijapur, Karnataka, India", "Title": "“Nice Hotel”", "Author": "kkdas", "ReviewID": "UR126725577", "Content": "I was in Best Western Corona on 17th and 19th March 2012. The front office is very cooperative & helpful. The single room where I was staying is small but descent. The breakfast was good and adequate. But there was no restaurant and bar. This is needed.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester, England", "Title": "“Basic but Good”", "Author": "PaulandJoanne_10", "ReviewID": "UR125544904", "Content": "Stayed one night, 28th Feb 2012. I am a user of Best Western hotels world wide and try to use them whenever possible, as I have always been satisfied (except once) with what they provide as trademark for quality. This hotel was what it sys it is, and just satisfied us for a small room, fairly decetly priced, with no frills. Not happy that all we had in room 306 was hot water in teh toilet sink, absolutly no cold water whatsoever. For cold drinking water one has to request a jug of it or buy in bottled water. mind you I am no lover of Londons 'hard' water anyway so try to avoid drinking it from a tap anyway. All in all, a good clean room, good service, a really decent breakfast the next morning with plenty of choice. Staff were friendly. Check in and check out was rapid, no problems whatsoever. If all you want is a room that provides a bed and roof over your head, this is the place.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“It does what it says on the tin.... It's a hotel room, just don't expect the ritz”", "Author": "PedroTiburon", "ReviewID": "UR125010354", "Content": "Arrives around 8pm last night Tuesday. Our company had messed up certain elements of the group booking but that wasn't the hotels fault. Got into my room and found it to be cheap and cheerful ..... That's not meant to be rude it's just that the hotel isn't the ritz and I wasn't expecting the ritz. The bathroom is clean the bed is basic but I slept well. Tea making facilities, hair dryer, working tv..... portable and no remote but it's got what I require for my viewing. Overall I'm glad to have a safe roof over my head for the night. There isn't a bar and they dont serve evening food but then we are based near to loads and loads of nearby amenities so you decide if that's okay for your personal needs", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maidstone, United Kingdom", "Title": "“A brilliant hotel right near the city centre and a very good price”", "Author": "Neese12", "ReviewID": "UR124700494", "Content": "all of our concerns/niggles picked up from reading other reviews were groundless. Friendly helpful staff, a lovely clean, quiet, smart and freshly decorated (small but nice) room, comfortable bed, plenty of hot water, large shower (bathroom in general maybe a tad cosy but what they hey), good breakfast and an easy walk to and from Victoria station and all at a VERY reasonable price.What more could you ask for? We would definitely stay at the Corona again", "Date": "February 17, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Colchester, United Kingdom", "Title": "“Extremely disappointing”", "Author": "Davie D", "ReviewID": "UR121800222", "Content": "There is no way to describe this hotel other than as substandard, and for £130 a night (for a double room in which you'd struggle to swing a cat) I expected at least to be able to have a nice cup of tea or glass of water in my room, but alas, in the 21st Century, we have an English hotel where you're not recommended to drink the water. Even boiling it produced rather grim tasting tea that didn't make me feel so good. In fact, in a bored moment, I read from the folder in the room that no one ever reads, and it is stated there that guests shouldn't drink the tap water and should either buy bottled water or ask reception to bring a jug of drinking water to their room! If this were the only problem here, it wouldn't be so bad. There is next to no tv reception on the next-to-knackered tiny portable televisions that were possibly bought 25 years ago, the shower (where you just about break your neck coming out of it as the shower, toilet and sink are all rammed into a tiny room) hardly worked, starting warm then cold then warm then cold then off, the heating wasn't working, you can hear just about any noise outside the room as the walls are thin, the bed just about had the springs coming out of the mattress, the breakfast was very basic, with the coffee unpalatable, and the whole place was soulless and more like a poor bed and breakfast place than a branded hotel. I haven't stayed in a Best Western hotel before, but I'll avoid them like the plague in future. I have to say that I stay in London on business on a regular basis and, although London hotels are variable in the extreme, you can do a lot better than this place, especially in this price range. I wasn't even paying the bill for this one and still felt ripped off!", "Date": "December 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Small but ok”", "Author": "abbymorgan", "ReviewID": "UR121062104", "Content": "i stayed here while on a recent work trip to london, i stayed in a double room alone and thank god i was alone no way a couple no matter how much they love each other could share a room that small. breakfast was ok - basic with bad coffee ( a serious issue to me) noise from road quite bad so request a room at the back!", "Date": "November 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Lancashire", "Title": "“ok for few nights”", "Author": "hellsbells57", "ReviewID": "UR121053239", "Content": "For location it was great walking distance of Victoria just over 5 mins walk. Good resturants in the area. Very small room, smallest room I have ever seen. Could not even open the bathroom door fully as it hit the toilet. Good for clean and nice bedding and towels. Cleanliness in general very good Breakfast room small and crampped, but continental breakfast very good.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Good enough for a few nights and very good value”", "Author": "thesaint01", "ReviewID": "UR120751165", "Content": "The Best Western Corona is located a few minutes walk from Pimlico tube station but it is also walkable from Victoria (around 7-10 minutes) so the location is not bad at all. Check-in was smooth and efficient when I was there.Two people behind the front desk so no wait at all. Was promptly given my room and I was also asked if I wanted to pay now so that I could check-out without a wait in the morning. Room was on top floor so used the elevator, it is a bit on the small side and fairly slow as often is the case in the hotels in rebuilt Victorian houses. The room was fairly small but still big enough to fit a bed and desk that was at least big enough to sit at. The TV was extremely small (most computers have bigger screens) but was working fine. Free wifi (was strong enough to reach my room, in reception they said it was not sure it would be strong enough there so received a cable as well) is included and it worked well. Bed was pretty comfortable so slept well. For those who are light sleepers do be aware that while the locations is pretty quiet the rooms have paper thin walls and doors so it is impossible not to hear people from other rooms or those moving around in the hallway. All in all still a good budget option for those who wish to stay close to Victoria. Bathroom was very small but was fresh and clean so no complaints there.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Colchester, United Kingdom", "Title": "“Pleasant stay”", "Author": "Jim W", "ReviewID": "UR120677546", "Content": "Stayed here while on business. It was nice and clean and I had a good sleep in the bed. I had breakast in the morning which was nice enough.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Good location”", "Author": "chanchan_11", "ReviewID": "UR119325070", "Content": "This was a decent hotel for the price we paid. It was in a good location...we could see the London eye from our room, it was just a few minutes from the Plimlico tube, and pretty close to other attractions. The hotel did provide breakfast which helped saved some money, however, their selection of breakfast items were slim pickings. The receptions were very helpful, the only negative thing I have to say is that the hotel rooms were tiny. Also, wifi is free at the hotel; however, we could never get signal from our room which was on the 4th floor, so we had to always go to the lobby since it had a stronger signal.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Crewe, United Kingdom", "Title": "“Convenient Location. Helpful Staff.”", "Author": "Greyfoodie", "ReviewID": "UR119212199", "Content": "I just needed a place to sleep and this place was ideally located for my meetings. Plimlico tube is only a few minutes walk. Room was small but clean. Staff very helpful. Breakfast OK.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Summerville, SC", "Title": "“No, thank you.”", "Author": "Scrivner", "ReviewID": "UR118963264", "Content": "While we expected the rooms to be small, we were shocked by all the other issues. The only positive was our location. The bathroom was extremely small, to the point where you would be doused with water when turning on the shower. The water temperature in the sink & shower ran hot. When we brought this to the attention of the manager, she came to the room explaining you need to let it run for several minutes until you get cold water . . . What a waste! Just when you think you have the right temperature, it turned hot again. Miserable! The room was also not clean. Someone left behind hair and there were dead bugs. If you think you can use the phone to call the front desk, think again. There was a \"reception desk\" button, but it just rang. I went in person to the front desk and was told you are not supposed to use that button, dial \"0\". Back to the room, dialed \"0\" and that did not work either. Don't believe the online information saying they are multilingual. An Italian gentleman staying there came to the front desk trying to ask questions, and the clerk shrugged his shoulders. While I don't speak Italian either, I did hear pizzeria in his question. With no knowledge of Italian, I was able to assist by saying \"Pizzeria\" and pointing in the direction down the street. On another occasion, I asked if there was a phone book so we could find a French or German restaurant. After checking around, he said they must have thrown out the phone books. He then proceeded to call friends so they could find one. He did tell me there was a French restaurant 3 blocks away, but said we would not want to do there because it is too expensive. Since we knew we could not depend on his advice, we went anyway and had a wonderful meal. And the price was reasonable. We will not plan a return trip to this hotel.", "Date": "October 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Southend-on-Sea, United Kingdom", "Title": "“Fantastic stay”", "Author": "DonnaH48", "ReviewID": "UR117764499", "Content": "I travelled with my Father and sister to visit Buckingham Palace. We got an excellent deal and a room for 3. There was little space in the room but it was clean and comfortable. The bathroom was clean and water hot. We slept well and had a very good breakfast. Particulalry nice staff brought frest toast and hot coffee to the table and a good continental spread was provided. The location is wonderful, just a short walk from Victoria with a bus stop opposite. This is not a luxury stay, nor are the rooms big but for a comfortable, good value stay its hard to beat. We will be back", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Hinckley, United Kingdom", "Title": "“Very good value”", "Author": "T0nyB", "ReviewID": "UR116719311", "Content": "This is a very reasonably priced hotel of a good standard for a short visit. I had a single room (407) at the front of the hotel. On the negative side, the room was very small, there is street and aircraft noise and it was too warm. However, they have made excellent use of the space available and the decor was good. The bathroom was newly fitted out and the shower was excellent. I found the staff efficient and friendly. Much better than the last place I stayed in London and cheaper. I didn't have breakfast but it was reasonably priced.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“Affordable, comfortable and convenient”", "Author": "fmw026", "ReviewID": "UR116676923", "Content": "Stayed for 3 nights in August. Location is excellent. Turn left outside the hotel and at the end of the road turn left and you will see Pimlico underground station. Its less than a 5 min walk and we felt a lot safer only having to walk that small amount on the way back at night after a show. Otherwise Victoria is about 10/15 min walk. There is a little shop at the end of the street, not too bad prices. Otherwise in Victoria there is tescos and sainsburys. There are also many places to eat in the area. Reception staff always welcoming and friendly. There is a small lift. In the rooms there is a hairdryer (found in a cupboard). You are supplied with toiletries i.e. soap, shampoo, shower gel, tissues etc. The towels are a bit on the small side. The double bed is also a bit small but comfy enough. You get hot drink facilities and we got two packs on biscuits when we arrived. Bathroom is also a good size in comparison with other hotels in the area. Shower has its own cubicle. Only one small complaint was the shower wasn't very powerful. The rooms are quite hot as well. There is a radiator in the rooms if it gets chilly. Old style TVs, not very good reception but you don't go to watch TV. You can also connect to their internet as they supply ethernet cables at reception. Room service is available, didn't try any so can't comment on the food, but it cost £1.50 to get it. Clean towels everyday, room spotless. There is street noise as it is a busy road and during the night there are a lot of sirens and road noise, but that shouldn't put you off. The breakfast room is much better than other hotels in Victoria. Usually they are so crammed in it is ridiculous, but this has two rooms for the space of about 25 people. The staff are very polite and attentive and pour your hot drinks and bring you toast. All the jams, butters and cutlery are already on the table which is convenient. The orange and cranberry juice tasted a little odd but bare able. There is fruit, cold meats, cereals, croissants etc. All expected of continental. Overall the price we paid for this hotel has proved good value. I would definitely stay here again and would recommend it to anyone. Do shop around for your stay though as it is not always cheapest booking direct!", "Date": "August 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Great location”", "Author": "Alimil", "ReviewID": "UR116454264", "Content": "Stayed one night for work,really easy to get to. Plenty of places nearby to grab food and drinks too. Don't expect luxury this provides clean base in very central location and no more. I have stayed at holiday inn over the road as well which is identical but on average 50% more expensive. Only big downside to corona is no a/c.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "4.0", "Value": "3"}, "AuthorLocation": "Kennesaw, Georgia", "Title": "“Very Small Room”", "Author": "gbbird", "ReviewID": "UR115212000", "Content": "This hotel is fairly close to the Pimlico tube stop and a fair walk to Victoria Station, although we usually chose to walk to Victoria. There is shopping district between the hotel and Victoria that has a Tesco, KFC and other small restaurants. The staff was friendly and helped us book a day tour to Stonehenge and Bath. The room was clean but one of the smallest we have stayed in. We asked for a double and should have requested a twin because we got a double bed that was uncomfortable for two people. The room had a/c that worked. Having stayed in several previous hotels and B&B's in London that were noticeably shabby, we were pleased that this hotel appeared better maintained, neat and clean. We did not eat breakfast at the hotel. It is within walking distance of the Tate Britain museum and Victoria Station.", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "3.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Baku, Azerbaijan", "Title": "“not coming back”", "Author": "Nikki_Elchin", "ReviewID": "UR115123531", "Content": "stayed in this hotel just few days ago. My room was so tiny and uncomfortable. The TV is from the 1980s. The location is ver good, but still one can find much better hotel for the price you pay for the Best Western Corona Hotel. The breakfast was not good, at all. However the reason why I am not coming back is that it was very loud there, the walls are very thin, you can hear everything going on outside of your room. I could not sleep properly because I could hear every car passing by, in one word, I wish I had stayed somewhere else", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Good i'll return”", "Author": "chipnic", "ReviewID": "UR114830153", "Content": "I had a single room, which was small, it was clean and all i needed for the 5 nights i stayed. Handy for Victoria and the tube.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Montgomery, Alabama", "Title": "“Two nights - two completely different experiences”", "Author": "susiewhite", "ReviewID": "UR114770400", "Content": "Stayed two nights at the Best Western Corona in London, and managed to have almost two completely different experiences. First night - incredibly loud (doors slamming well past midnight and the walls are very thin), followed by a forgotten wake-up call (no alarm clock in the room). Lucky we made it for our trip to Paris early the next morning. Front desk employee's response? \"Hmph\" Second night - much quieter, and we got our wake-up call. Another issue - the shower's hot water ran out each morning before the end of the first person's shower (we are a family of 3). Rooms were clean, and convenient location. However, would look elsewhere when we return to London.", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Brighton", "Title": "“Very, very small but clean and comfortable”", "Author": "CoolAllie", "ReviewID": "UR112559124", "Content": "We stayed here as we didn't want to travel home after a night at the theatre. It has to be the smallest hotel room I have ever stayed in. I think I could touch both sides of the bathroom if I stretched my arms out and there was not quite enough room for me to brush my teeth facing the corner sink. Saying that the room had everything you need for a one night stay, basic clothe hanging space, desk, chair, TV, shelf and tea/coffee etc. Also, the ceiling were tall and this meant the room didn't feel claustrophobic in any way. Everything was clean and comfortable, breakfast is continental but the service was good. Two mins from Victoria Station and Pimlico tube, so good location for us. It was a little pricey at £110 for the night but despite being small I would probably stay there again if we couldn't get similar brand for cheaper.", "Date": "June 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Kenai, Alaska", "Title": "“Small comfortable room with basic needs...Close to the Tube!”", "Author": "Homergruven", "ReviewID": "UR109885854", "Content": "It was close to the Tube & walking distance to everything! Not too many places to eat close by..But get on the Tube!", "Date": "May 25, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Great location, but overpriced for service you get”", "Author": "Okhrana", "ReviewID": "UR104128513", "Content": "I stayed here 3 nights. The location was good, within walking distance of Victoria Station, restaurants, and the tube. I had a single room, one of the smallest I have ever seen in my life. The room was clean, nice clean, bright bathroom. My room was on the 4th floor and overlooked the street which was very busy with traffic. The flight path to Heathrow south of the hotel makes it noisy with constant aircraft passing over. The breakfast was minimal: rolls, croissants, cheese, ham, cereals, coffee and tea. The staff at breakfast were very nice. My biggest complaint with this hotel would be the staff at the front desk, including the manager. They had adapted a simple \"I don't care\" attitude to pretty much any queries or concerns. When I checked out of the hotel I was served by a man who looked like he had just crawled out of bed. His hair was dirty and greasy, his shirt was in need of a good ironing. The manager was present also and when I paid my bill and left, I never got so much as a \"thank you for staying at our hotel\" or \"good-bye\". Based on the manager and her staff, I would not recommend this hotel.", "Date": "April 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "S Wales", "Title": "“A cheap but average experience”", "Author": "drc225", "ReviewID": "UR104025736", "Content": "I stayed for three night in mid-April booked through hotels.com for £250 inclusive for the three nights. It would be very easy to be negative about this hotel. My room (#407 I think) was tiny. The bed was 'OK' not comfortable but not uncomfortable, the shower was adequate. The hot water hotish. I had to wait ages for the cold water to come through (presumably the pipes run together and this makes both taps a sort of hotish temperature!) but it did come through. I needed a ironing board and iron on my first evening. The iron was fine but the board had seen better days. I think there are a couple of boards/irons which are shared so I guess I was lucky that there was one available. The free internet (they advertise wifi but apparently the signal is so bad on the 4th floor they have wired and issue you with an RJ45 cable) finally worked after they gave me a different username/password and was adequate. There was another guy at reception with a similar issue. Fine for browsing/email - don't expect to watch movie clips. I didn't really use anything else. My room had a tiny TV - didn't use it. Breakfast was an additional £5.95 - didn't buy it. Staff were pleasant enough in my limited dealings with them. So moving onto the positive. The room had a small kettle and tea/coffee and everything worked and was clean. Housekeeping did their stuff in the day. The location is good - about a 5 minute walk from Victoria station and within an easy 10-15 minute walk from the The Queen Elizabeth II Conference Centerer opposite Westminster Abbey which is where the conference was. The key thing, of course, is price. With anything decent being over £200 *per night* and even your travelodges and holiday Inn expresses being well over £100 per night, £250 for the 3 nights was stunning value. You get what you pay for and there is nothing wrong with this hotel - just don't expect the Ritz.", "Date": "April 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“Poor value for money”", "Author": "minimad66", "ReviewID": "UR94773378", "Content": "Where shall I start, well, no facilities for either meeting or relaxing no hot food available at breakfast just toast and cold meat, no bar or resturant. Room was clean enough but tatty. For a Best Western brand I would expect better. As for the price, I am just glad my company was footing the bill, I certainly wouldn't pay those prices for what is to be honest a glorified B&B. How the AA rate it as 4 star I will never know.", "Date": "January 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Skopje", "Title": "“Bad and small”", "Author": "LjupcoSkopje", "ReviewID": "UR89198954", "Content": "Small and not friendly. Breakfast is sharp to 9:30 if you came at 9:25 you must finished at 9:30 to avoid vacuming during breakfast", "Date": "December 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Way better than the Holiday Inn Express across the road”", "Author": "merchy20", "ReviewID": "UR89183559", "Content": "The hotel is on Belgrave Road, a great location awash with hotels competing on price. I found the Best Western Corona is only a few minutes’ walk from Pimlico station and was cheaper than the Holiday Inn Express across the street, which I had stayed at last year and vowed never to return to. The reception is sleek and modern, and the receptionist was a young, friendly and welcoming man who efficiently processed by reservation. The reception staff, on the whole, were very helpful. I spoke to a young lady one morning about something minor that needed fixing in my room and when I returned that afternoon, to my surprise, it was fixed. The single room I had booked had everything I needed (including cookies to go with the tea, coffee and kettle). The room was tastefully furnished and the bed comfortable. Free wireless internet is available (ask reception for a voucher which lasts for 24hrs). The bathroom had a great, powerful, shower that was easy to use. It was very roomy (2 people could get easily) and being over 6 feet tall, I had plenty of headroom. Breakfast is included in the price and when you sit down, you are immediately given 3 slices of toast each. Breakfast options included ham, cheese, Special K, Bran Flakes, yoghurts, fruit and pastries. You could fill up on any combination and it would keep you going. The area is marshalled a matron-like European lady who appeared overbearing and pushy at first, but once you know how to handle her, she’s not so bad as she is trying to provide attentive service. All in all, it was a good hotel to use as a base camp for a few days’ break and, a great location with a Sainsbury’s, Tesco and Boots not far, keeping food costs down if you choose not to eat out. I would definitely stay there again and also consider using other Best Westerns.", "Date": "December 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leicester", "Title": "“Good all around I would say”", "Author": "mam24", "ReviewID": "UR88919900", "Content": "I recently stayed at the Best Western Corona Hotel for a couple of nights. Location was great, breakfast was ok - limited choice but ok, room was on the small side but i was impressed on how clean the room was. Our room in particlar had a great view outside of the london eye and the big ben. The hotel is sitauted in a great location walking distance to all major places i.e buckingham palace, victoria theatre and main tube station. We brought this room from a travel agency in Swindon called Travel Indigo. www.travelindigo.co.uk. The customers advisors were very friendly and were very helpful to get us a good deal. I would highly recommend you try them for any of your travel needs.", "Date": "December 3, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Solihull", "Title": "“poor”", "Author": "Patricia99", "ReviewID": "UR88674128", "Content": "Was disappointed in this hotel. The rooms very small and very basic. there was no central heating it was out of order and clearly had been for a while and there were plug in electric heaters in various locations - I had one in my room, my colleague didn't. There was no cold water. The tap only gave you hot water whichever way you turned it so I had to clean my teeth in hot (not even warm) water! Breakfast was very basic - cereals and cold meats - no full english - although full breakfast advertised. In my view very overpriced even in central London you can get a better hotel with full breakfast cheaper.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“Good Value”", "Author": "Veggyplot", "ReviewID": "UR87562768", "Content": "Had a couple of nights here. Although the room was on the small side everything was clean and the bed comfy. There was some traffic noise in the morning but not that bad. Breakfast was a continental buffet and fine to get you started for the day. The tube is close by although we used the bus which is even closer. Overall, clean and good value with helpful staff.", "Date": "November 19, 2010"}, {"Ratings": {"Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Newcastle, UK", "Title": "“Rude, unhelpful staff and the worst coffee and tea ever!”", "Author": "Britishtraveller", "ReviewID": "UR86955970", "Content": "The selection at breakfast was extremely limited with no option for a full English breakfast. Apparently, fresh lemon for tea was not available - I quote \"not at this hotel\". I feel that the cost did not reflect the service and I will be very wary aout using a Best Western again.", "Date": "November 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Clean and efficient.”", "Author": "Fee L", "ReviewID": "UR86251605", "Content": "The hotel was clean and tidy. The rooms were small but that's to be expected in this part of London in townhouses. The staff were on the whole very helpful and breakfast- in the bizarrely themed Marilyn Monroe themed room- despite being listed as \"continental\", was very filling and tasty. The rooms had wi-fi but you had to get a daily access code from reception which was a bit of a pain. Drinks and biscuits were provided on day 1 but not renewed for other days- a tad mean I thought. All in all a good place to stay- great location, clean and friendly.I would go again.", "Date": "November 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Ibiza, Spain", "Title": "“Average basic hotel”", "Author": "fabmc", "ReviewID": "UR85527720", "Content": "Average hotel close to Plimco tube station. It is a three star hotel and I paid GBP110 per night, breakfast included. Booked via their web site: www.coronahotel.co.uk", "Date": "November 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "sunderland, united kingdom", "Title": "“Great Location, Clean & Comfortable !!!!Good value for money”", "Author": "flump16", "ReviewID": "UR85433482", "Content": "was concerned when reading reviews but pleasantly surprised with this hotel. Fantastic location for city centre 15mins walk to buckingham palace & 5 mins walk to nearest underground station. We came back late one evening after seeing a show & felt quite relaxed in the area we walked through. Loads of amenities near by ie coffee shops, restaraunts & local supermarkets.A must to visit is the Patisserie near by great coffee & the most amazing cakes. Hotel room was small but ideal for us as all we wanted was some where to sleep. We had a room at the front which was quite noisey as the road does get quite busy early in the mornings so if you are a light sleeper would suggest asking for a room at the back. Staff friendly & rooms cleaned everyday. Breakfast great, nothing warm but enough to fill you up for the start of your day.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Illinois", "Title": "“Once again this hotel didn't disappoint”", "Author": "PJMBE", "ReviewID": "UR84249721", "Content": "This was my second time staying at The Best Western Corona and it won't be my last. This time my stay was for 7 nights and it felt like my home away from home. Marya and Anna and the staff couldn't have been more helpful and friendly. I actually got to know the neighborhood this time due to the great restaurant recommendations. This hotel is in a perfect location...central London, but on a quiet street...walking distance to so many attractions. And most of all, it's still absolutely clean. Highly recommend this hidden gem of a hotel.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Vancouver", "Title": "“Well positioned for a couple of days”", "Author": "riev", "ReviewID": "UR83146112", "Content": "Small room and bath. Clean and hospitable. Close to the tube and easy to get to from Gatwick.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Belfast", "Title": "“Did the Job”", "Author": "iedpg", "ReviewID": "UR80690262", "Content": "I was moved here by another hotel near-by due to a mix up. The room was small but it was clean. My room faced the street, had to open window to cool down at night because the air-conditioning didn't work. The road was busy and noisy throughout the night. Breakfast was included and there was a decent enough selection of what to eat. Only stayed one night. For people on a budget it seems a good choice", "Date": "September 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Great location, small room”", "Author": "MalvolioBlanco", "ReviewID": "UR80279079", "Content": "Hotel is located in a very quite area few steps away from Pimlico tube station, within walking distance of Victoria Station. Typical Victorian style street of white houses, many of which are hotels as well. Very fast check-in and check-out, my room was very small, but that is what you expect at this kind of hotels. As most Best Western hotels, only basic equipment, i liked marble floor in the bathroom. Toiletries provided every day. The only thing that needs improving is their WLAN access system. Each day, you have to get a new printout with username/password for the network, which is pretty annoying if you stay from three days like I did (and always forgot to ask for a new one on my way back). Giving one code for your whole stay would be much better.", "Date": "September 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Portland, Oregon", "Title": "“A very poor value of a hotel.”", "Author": "thatoneguyinwa", "ReviewID": "UR80259888", "Content": "I had the misfortune of staying here for a week. Check In/Out was quick. Room was quite small for what I expected. It's located mid way in the block so when cars or emergency vehicles go passing by at night, the sound literally gets channeled down street. It quite literally sounds like you are sleeping on the street. The staff were less than helpful. I had issues with the internet connection several times. There were a fair number of people in the lobby complaining about it so it wasn't just me. The cleaning staff were very rude. I felt like I had to work around their schedules. All around a very poor value of a hotel.", "Date": "September 20, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Well it's better than a youth hostel....”", "Author": "186402Sarah1984", "ReviewID": "UR80164265", "Content": "I ended up running out of options when making a business trip and having to pay £120 for the privilage of staying here for one night; London Fashion Week meant everything was booked up. On initial glances it looked a bit rough around the edges but OK. On peeling back the duvet I found some suspicious looking hairs in the bed. It was late, and it struck me as the kind of hotel that would have this standard throughout the rooms anyway so I did the sensible thing - went out with a friend and had some drinks! Even with earplugs in the old sash windows meant that it was very noisy, and my curtains didn't cover the window fully so I woke with the light. What really upset me about my stay here was that there was no hot water in the morning. I ended up having a cold shower, as I was facing clients that day, it was miserable! I've stayed in youth hostels in London. If you were paying £50pn then this would be a great alternative as you have your own room. As an actual hotel, I hope I never have to go again.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "florida", "Title": "“Hotel is very clean but rooms small”", "Author": "Gin21", "ReviewID": "UR71941554", "Content": "The staff were very polite and courteous. The breakfast was pretty basic but filled a gap! The rooms are small but were spotlessly clean, however it was very hot. There is no air conditioning and the windows won't stay open. Having said all that it was in an ideal place to access the tube - it is very close to Pimlico tube. I would stay here again, but not in the summer!", "Date": "July 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Porto, Portugal", "Title": "“Good location and good price!”", "Author": "lucasousa", "ReviewID": "UR71794827", "Content": "I've been in this hotel for 3 nights on the beginning of June 2010 with my girlfriend. The room was small, as almost everyone in London but it was what we expected. Small, but clean and suficient for everything we needed. There was some noise during the night because our room was next to the elevator. We heard lot of noises coming from the floor of the room upstairs. The noise was really what we disliked more. The best was the location. We could go by foot to 2 metro stations (victoria and pimlico) and we could go by foot to central places like big ben or buckingham palace (20 minute walk). Belgrave road is full of hotels and it's a very good place to start your trip in London.", "Date": "July 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Blacksburg, Virginia", "Title": "“Good for the Price”", "Author": "GoVTHokieTraveler", "ReviewID": "UR70617723", "Content": "My daughter and I stayed at the Best Western Corona from July 1 - 3. It was clean, friendly and in a great location. It was only 2 blocks from the Pimlico tube station, and taking the #24 bus was even easier to Buckingham Palace, Westminster Abby, the Tower of London, and to the West End theatre district. The room was quite small, but my daughter and I could both put our suitcases and dress at the same time. As other reviews stated, there was no cold water (really odd). When you called the desk, the staff would quickly bring a pitcher of cold water. The TV was quite old, but the picture was OK (no satellite); if you're in London, how much time would you spend watching TV in a hotel room anyway?!", "Date": "July 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Renfrewshire", "Title": "“Pleasant comfortable hotel, nice staff good breakfast”", "Author": "pado21", "ReviewID": "UR70314372", "Content": "I would use this hotel again. Nice reasonably sized room. Big sash windows that you can open. My room was back facing, quiet with great view towards parliament over the roof tops.", "Date": "July 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne Australia", "Title": "“A well positioned hotel surrounded by restaurants and transport”", "Author": "jennyknight18", "ReviewID": "UR69527295", "Content": "This is your typical small hotel room in London as the building is a converted Victorian. The standard double room only allowed for one person to dress and get ready while the other person sat on the bed. Our luggage did take up some of the available space but the floor area was very small. The bathroom only allowed one person at a time. The furnishings and decor were of a good standard and as we were out during the day were not too concerned about lack of space. The position of the hotel is great being in Belgrave Street was very close to the Pimlico Tube station and buses. We walked to Westiminster and the London Eye along the Thames and explored most of London by foot. There were many varities of restaurants to choose from and an express Supermarket when you knew where to find them.", "Date": "July 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Heat wave made it uncomfortable--too hot and no cold water”", "Author": "MusicalMamaUSA", "ReviewID": "UR69339335", "Content": "Good location and quite clean. Breakfast was good and the staff was helpful. However: London was having an unusual heat wave (28C) and the water pipes are not insulated so we had NO cold water. We're not kidding! They need to upgrade that system and at least install ceiling fans. We were provided a tiny fan that didn't help much. With no air conditioning we couldn't sleep and were very uncomfortable.", "Date": "July 1, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Gurgaon, India", "Title": "“STAY HERE AT YOUR OWN RISK!”", "Author": "balan47", "ReviewID": "UR69071271", "Content": "The rooms here must be the smallest in all Europe! We were first assigned room no. G01. When we opened the toilet, it was smelly and blotted!! We were then moved to 401. The TV was a 12\" black box, born before the war!! My wife and I are still debating which was smaller--the table fan or the shower cubicle!! One small suitcase is all you can fit into this pigeon hole. The breakfast--or what goes by that name--is an insult to all England. Imagine, they don't serve eggs. That's fine by me. But they don't even keep pepper!! Worst of all, the staff was always grumpy. After this we have decided to blackball all Best Western hotels!", "Date": "June 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hamilton, Ontario", "Title": "“Wonderful time”", "Author": "Belgraveroad", "ReviewID": "UR68566807", "Content": "I have just returned to Canada, following my annual 8-nights visit to The Corona. As always, I had a wonderful time, and was made to feel so welcome. Special thanks to Mariya, Anna and Klara. Can't wait for next year. Patricia Bannon, Hamilton, Canada", "Date": "June 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Great location for exploring London”", "Author": "Cryjam", "ReviewID": "UR63455553", "Content": "We stayed for three nights on our first time to London. The hotel is located in Victoria which is just south of Buckingham Palace. The Victoria train/tube station is close with many very good restaurants on the way, the Pimilco tube station is also close which makes exploring London very easy. Buckingham Palace, Big Ben & Westminister Abbey are all a 15-20 min walk away. We had a standard room which had a queen size bed, desk, bathroom. The free internet which most hotels have is unreliable however the internet at this hotel was great. A complimentary breakfast is included and the breakfast room has ample room. This is ideal for tourist who are looking for a base. The hotel was also good when after checkout an ash cloud killed our flights by giving us the internet and an area to sit.", "Date": "May 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "kingsclere newbury berks", "Title": "“ideal location small room”", "Author": "jellyhead0", "ReviewID": "UR59263288", "Content": "my wife & i stayed here for 1 night on new years eve the location was excellent not to far from the houses of parliment the eye etc but far enough away to be not to noisy. when i booked in i asked the receptionist how far it was to westminster & the london eye she said that we would have to get a bus as it was to far to walk, we decided to walk anyway we got there in about 3/4 an hour along the thames (dont people ever walk in london) we had a great time watching the fireworks at the eye, we walked back but a word of warning make sure you know exactly where your hotel is as all the roads look the same especially if you have a load of beer inside you also if you are a bit of a bloater like me make sure you have a skinny wife cos the bed & the rooms are small lol", "Date": "March 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Preston", "Title": "“Convenient for Central London.”", "Author": "themelodyman Posted by an OctopusTravel traveler", "ReviewID": "UR52577560", "Content": "Pleasant location close to Victoria Station and Pimlico Underground Station. Spotlessly clean. Helpful staff. Reasonable selection of cold food for the buffet breakfast---no hot food other than toast and drinks. Our room was very small but included an excellent shower. Try walking into Westminster along the Thames rather than going back to Victoria.", "Date": "January 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "New York City, New York", "Title": "“A mixed bag that I wouldn't recommend”", "Author": "jwall915", "ReviewID": "UR50703987", "Content": "This hotel is really a mixed bag. First, the pros. The location could not be better. Absolutely superb. It's about a block away from the Pimlico Tube station, which is a few short stops from everything you'll want to see in London. It's in a nice, safe, residential neighborhood w/ several pubs and convenience stores, plus an internet cafe. The service is good too. The front desk staff is nice and helpful. They gave us a map that gave us discounts to lots of stuff, which they didn't have to do. The rooms are clean and the bathrooms are fine. A breakfast buffet is included w/ limited hours every morning. The food is standard fare, nothing fancy, but decent and nothing to complain about. Now, for the cons. This room is small. I mean, tiny! It's small by european hotel standards. There was literally no room for the suitcase on the floor. The double bed took up the entire room. There's no closet, just an open armoir. The bathroom door opens up toward the bed instead of near the doorway like most hotels. In fact, you cannot open the bathroom door all the way, b/c it hits the side of the bed. It's that small. Secondly, the amenities are quite lacking. They provided shampoo, but no conditioner. The hair dryer was not located in the bathroom, so it was two days before I found it. And when I did locate it, I found it to be damaged. There was no refrigerator or safe. There is also no room service. The bed in our room was very uncomfortable. Neither of us slept well the entire four nights we were there, and my spouse actually awoke in pain most mornings. But the biggest negative to this hotel for me would have to be that the walls in the rooms are painted ORANGE!!! I don't know what the management was thinking when they did that! It is nearly impossible to sleep well in a brightly painted orange room. I literally couldn't sleep w/o Benadryl. Overall, I wouldn't recommend this hotel. there are some positives, but they are unfortuantely outweighed by the negatives. I do recommend that you find this hotel on a map, research the area, and then book a different hotel in the same neighborhood, because the location is spectacular!", "Date": "December 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "USA", "Title": "“Adequate for most purposes”", "Author": "Ace50", "ReviewID": "UR49993942", "Content": "Given that all one needs is a comfortable bed and hot shower the fact that I could touch opposite walls at the same time (which means I have very long arms or the room is exceptionally small) has little bearing. It is given 4 stars, a push but again clearly the rating doesn't include the square footage of the room or the size of the TV screen. Clean yes, helpfulness at reception, mixed but generally ok. Squeeky floorboards from the room above and considering their room was no bigger than mine there was an awful lot of walking about being done! Continental breakfast - no sleeping in, breakfast finishes at 10am sharp!! For a business traveller with an entourage of paperwork, laptop, files, there is precious little room to work, but the internet was free, one just had to pick up a password from reception every 24 hours, no biggie. Handy, a range of pubs to choose from with reasonably priced food and good beer (if you like British beer). Everything within walking distance, Victoria Stn handy too. Stay there again, probably if I had business in that part of town... on the other hand the Grosvenor on Buckingham Palace Rd looked appealing...", "Date": "November 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "S.Korea", "Title": "“Very Clean & Nice Location”", "Author": "LucyYoon", "ReviewID": "UR49244329", "Content": "I stayed at Best Western Corona for 5 nights. The location was very good, near Pimlico tube station and bus stop. Staffs were very friendly and very helpful. Breakfast was just moderate. Room and bathroom are small but very clean and well kept. I would stay here again if I come to London next time. :)", "Date": "November 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "USA", "Title": "“Good value for the money”", "Author": "casey355", "ReviewID": "UR48988766", "Content": "My mom and I stayed here for 5 nights for under $900 with breakfast included. It was impeccably clean, but the room was very small with the smallest bathroom I have ever seen! The location was great-close to Pimlico station and if you're energetic, you can walk to Victoria station as well. (we did both). There was no cooked breakfast, but there was plenty of cereal, fruit, yogurt, meat, cheese, toast. The staff was very helpful with maps, directions, etc. I would stay here again-I would just try to get a bigger room.", "Date": "November 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Las Vegas, NV", "Title": "“Super location, clean small rooms, helpful staff”", "Author": "Cruzon68", "ReviewID": "UR46332468", "Content": "Ten minute walk from Victoria station...great location for central sightseeing. Hotel is small (no bar, restaurant, parking that I observed), elevator smaller and rooms tiny. Rooms had basic necessities, seemed like new and were exceptionally clean. Range of ree wireless internet limited - didn't extend to our 4th floor room. RJC cable provided by front desk (3 pound deposit) worked great. Staff courteous, helpful and gave us great tips on transportation, dining, etc. Numerous pubs and restaurants located about 3 blocks from hotel. Continental breakfast had great selection, fresh foods and meats and very filling.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "West Midlands", "Title": "“Clean, comfortable London hotel”", "Author": "SooziJane", "ReviewID": "UR41832894", "Content": "Good hotel, Room comfortable and clean. No drinking water available in room but reception provided jug of water. Had little extras in room such as Tea/Coffee, toiletries & hairdryer. Location is good, near Pimlico. Regular buses go towards Trafalgar Square. About 10mins from Victoria or 5 mins from Pimlico. Staff were very friendly & helpful. Only bad point is that they don't do a cooked breakfast.", "Date": "September 15, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "N.Ireland", "Title": "“nice location”", "Author": "DeeC80", "ReviewID": "UR36296953", "Content": "really good location, handy to victoria station. Nice pubs and restaurants in the vicinity. Rooms basic, quite small. We were beside the dining room which we found very noisy as we could hear the staff at 6.45am!!! As a group of 3 we always had a wait to get a table together at breakfast. But for al the time you spend in a hotel when you are sight seeing in london this was a grand choice and good value for money!", "Date": "July 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "auckland", "Title": "“handy to tourist sights”", "Author": "AucklandAlan", "ReviewID": "UR35992406", "Content": "Very handy to sights ,an 24 bus gets you into Traffalger square from right outside hotel,be aware although it says \"English breakfast \" this dosnt mean cooked breakfast ! basically its an continental breakfast with sliced ham and slices of cheese", "Date": "July 27, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Galway", "Title": "“Good value for money, great location”", "Author": "GalwayRuthGalway", "ReviewID": "UR35892538", "Content": "I travelled with two friends for three nights and paid £335 for B &B for that time for the three of us booking directly through the hotel website. We had a 'family' room - one double and one single bed. It was spotlessly clean and, as I requested a quiet room, we overlooked the internal courtyard. The only negative comment I have is that there is no ventilation in the bathroom and after three showers in the morning it became a bit of a sauna. For the money we paid, we definately didnt' expect as good as we got. Genuinely, I believe the more negative reviews on the website either expected too much or paid way too much! Admitadly breakfast can be a little nuts - the lady serving the tea/coffee and toast does walk around talking to herself and commenting on everyone but once again, for what we paid, we weren't going to complain. The hotel is about 2-3 minutes walk from Pemlico on the Victoria line and about 7-8 minutes from Victoria station which has 4 separate tube lines coming into it. Unfortunatley for us, the Victoria line was closed for maintenence the weekend we were there so we were grateful that Victoria station gave us other options.", "Date": "July 27, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "toronto, ontario, canada", "Title": "“no air conditioning, no screens on the windows”", "Author": "bnirving", "ReviewID": "UR35017288", "Content": "stayed here from july 2-8, right in the middle of a heat wave, no airconditioning, very small room, no screens on the windows and even though we had a 4th floor room, a cat almost jumped into our room (and on my head), in the middle of the night, so, had to keep the window almost shut during this heat wave. Wasn't very comfortable due to the heat. My teenage sons were not comfortable at all, the fan didn't cool off the room at all. Continental breakfast was not very good considering the price paid for the room. the floors in the room were slanted and everything squeezed in really tight. Almost not enough room to open your luggage and live out of it. staff in the lobby not very friendly nor knowledgeable. If you want just the basics, it's okay, but for two teenagers and their mom, certainly not very comfortable. Even the elevator is very small.", "Date": "July 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "cornwall", "Title": "“don't go when hot!”", "Author": "easterpromise", "ReviewID": "UR34243033", "Content": "I stayed for 2 nights as I was attending study days in London.Unfortunately it was on the 2 hottest days of the year so far.The airconditioning was broken so I arrived to the very small room equipped with a fan and with the window wide open (luckily I was on the 3rd floor).Later, on reading the hotel in-room guide it was suggested if I needed 'drinking' water a jug could be requested from reception.Puzzled by this I wondered \"is this a way of getting foreign travellers to buy bottled water?\"-the inference being tap water wasn't OK to drink. No,basically there was no cold water in the room the shower was hot water and whichever way you turned the tap hot water came out! The hotel was fine for what it was but still really expensive - it does concern me that unless you pay top dollar this sort of shoddiness is par for the course in London", "Date": "July 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Belfast", "Title": "“Very basic”", "Author": "Banjoburger", "ReviewID": "UR33631235", "Content": "I stayed at this hotel for one night in June as I was attending a conference in the City. My flight was delayed so I didn't arrive until quite late at night and I was away early in the morning so it was a fleeting visit but to be honest that was a blessing in disguise. The room was clean but was very small with a single bed that was fit for purpose but nothing more. There was a shower room rather than a bathroom which is fine, but the tiny wash basin was stuck in a corner beside the shower which made it almost impossible to use for the average sized person. When I arrived the room was also very warm and even with the window fully open didn't get any cooler. Having said all that the location was excellent. It's only 10 minutes walk from Victoria station and is close to Pimlico tube station so it would be perfect for folks wanting to see London and spend as little time as possible in the hotel. Breakfast was basic with no cooked food but more than adequate and although some other reviewers have had bad experiences with the staff I found them fairly anonymous (apart from them grumping about people pushing past them in their native tongue). All in all this would be fine as a place to get your head down if your sightseeing but won't be at the top of my list of places to stay should I be returning on business.", "Date": "July 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Illinois", "Title": "“Absolutely clean”", "Author": "PJMBE", "ReviewID": "UR31866105", "Content": "We stayed at the Best Western Corona in the middle of May and the reason why we stayed there is because of all the reviews on Trip Advisor. Yay for you! Anyway, the room is small, but very clean and I find that more important. The smallness of the room didn't matter, as we only used it to sleep in. I loved the location. We were very near to the sights, but it was in a quiet neighborhood. The bus stand was just down the street, so we could get to where we were going very easily. We will definitely stay there again!", "Date": "June 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Portugal", "Title": "“Better than expected”", "Author": "MrBluePorto", "ReviewID": "UR29317023", "Content": "Me and 2 friends stayed at Corona from 1 May to 3 May 2009. We booked a familiar room (1 single bed and a double bed) and the room we get was n.º 106, on the first floor. As many said before, there's not much space in the room but the cleanliness was very good and that, i think, is the most important thing. Talking about the service, i should say it was average. Personally i expected more welcoming staff...But, in the end, the hotel is just a place to sleep as London don't give you time for stay \"at home\" for too long. The room we stay in was on the first floor, on the back side of the hotel, very quiet at the night. Breakfast was a surprise as i expected something not so good. It's a Continental breakfast that includes, as far i remenber: bread, croissants, cereals, milk, coffe, tea, fruit, cheese, toasts, jam, butter, ham, juice. The breakfast room is not that big and you may need to wait a little before get a table. The location is great, walking distance from many places that one must see. Victoria Station (Train, Tube and Coach) is 10 min (max) walking distance, and you have also Pimlico Tube Station in the area. Finally i should talk about the value. We paid £260 for the 2 nights, and i think it's a good value according to the area. All in all if i have to go to London again in the next few days, i will not have any problem in choosing Corona as my hotel.", "Date": "May 4, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "The hague", "Title": "“Reasonably priced”", "Author": "Gerardthehague", "ReviewID": "UR27111901", "Content": "Reasonably priced hotel, rooms not big, the double bed rather small, bathroom very small, but all clean and acceptable. But the breakfast is served by two most unfriendly ladies, never heard of a smile, never heard of service, every question is one too many.", "Date": "March 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Guayaquil", "Title": "“Best Western Corona, central ,safe and clean”", "Author": "NanuGuayaquil", "ReviewID": "UR26629040", "Content": "I visit London early July2008. As I was travelling alone I want a good and safe hotel from a good hotel chain. I found this hotel on the internet . The price per night was 75 pounds ( average ) with breakfast, which was very good. I booked directly at Best Western site. My room was on the first floor with a very nice view of Belgrave Road. A very quiet zone with many hotels in victorian houses. I think it is a safe and quiet zone. There are several restaurants and pubs on the way from Victoria Station to the BW Corona.The bathroom was big with a cabin shower, very modern, and the toillet, all very clean. My bed was fine. The staff was very helpful. Keep in mind London is a very expensive city so it will not be easy to find an ensuite room for less on this excellent neighborhood. The hotel was in Pimlico, 5 blocks south of Victoria Station, excellect location, and 2 blocks north from Pimlico Station. I booked several tours with Golden Tours . Their office is in front of Victoria station so it was ideal for me. I recommend this hotel. It is not luxury , but it is safe and clean.", "Date": "March 22, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Dublin", "Title": "“Reasonable hotel - unreasonable staff.”", "Author": "Astja", "ReviewID": "UR26059567", "Content": "Overal clean and bright hotel with a tidy, if a bit worn, room that was cleaned daily. VERY small bathroom even for a size XS girl, but with plentiful hot water coming out of a power shower! Continental breakfast - no hot options. BEWARE: \"Breakfast bat\" - a mean rude housekeeping supervisor that gives out stink if you dare to arrive five minutes prior to the end of breakfast session - the reson for it \"no time for you, breakfast ladies need other work to do! \" That is to challenge those who claim the customer is the key to the hotel industry! Arrive in time to catch some milk and watever else otherwise you will have to fight for it at 9 something am on the morning of your not-so-cheap trip carefully planned in this uneasy for all times.", "Date": "March 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Worthing, United Kingdom", "Title": "“Very pleasant, ideal for short stay”", "Author": "neildoody", "ReviewID": "UR20803900", "Content": "10 minute casual walk from Victoria Station. Very clean, friendly staff and excellent breakfast. I shall stay here again.", "Date": "October 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oz", "Title": "“Value for money”", "Author": "GusCat", "ReviewID": "UR20491220", "Content": "Stayed at Corona back in August. Rooms are very small but were modern and clean. Hotel is in a great location and was perfect for a couple of days break in London over the weekend. Breakfast was great, couldnt have asked for better. Service was ok, only criticism would be the lack of an iron/ironing board in the rooms. But these were available from reception upon request.", "Date": "September 30, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Dortmund", "Title": "“A very very pleasant stay!”", "Author": "Italoluder", "ReviewID": "UR20447807", "Content": "We stayed in a triple room for 3 nights and we were very satisfied. The room and bath were very clean, the staff was friendly and helpful. A great location, one station away from Victoria Station. Little supermarkets and groceries around. The continental breakfast was not that good, but enough for the price. There was a nice Indian restaurant round the corner with a paparazzi-picture showing young lady di infront the restaurant, running away from the photographers! Thas was funny and a bit strange! Will book this hotel again when I will be back in my beloved London in April 2009!", "Date": "September 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Dundee, United Kingdom", "Title": "“Basic London Mid Price Hotel”", "Author": "Dundeetravellers_8", "ReviewID": "UR18986746", "Content": "We were just looking for a mid range priced hotel in London. Just somewhere to \"crash\" after a days sightseeing. We booked this hotel as it was extermely handy for Pimlico Tube Station & Victoria Train Station. The Tate, Buck Palace,Science /Nat History/ & the V & A Museums are also just a 20 minute walk away. As stated before we only wanted a basic room. The room was clean, BUT, the Air Con was broken & it was extermely hot. They had placed a fan in the room, but this was not much help. Also the TV was nowhere near suitable. Just a basic 18\" portable with every channel not set up properly. AGAIN, You get what you pay for & it was just a place to collapse in at night. Plenty of extermly good placed to eat around that area. Thia/Chinese/Indian, you name it it was there. If I had to choose again I would look elsewhere, but all in all it was OK.", "Date": "August 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Edinburgh", "Title": "“Good Location”", "Author": "CHabroad", "ReviewID": "UR18160300", "Content": "Myself and 2 freinds booked a family room to share for the weekend at this hotel. The location was great, just 5 minutes from Victoria and the 24 bus stops on the street that is on a very good route. Taxis to Leicester Square area are only about £12 so after a night out you don't have to worry about getting home. The room itself was a decent size, clean and airy. Only problem was it was very very warm, even with the window open for two days and the fan constantly on. Breakfast is your usual continental breakfast served in a busy breakfast room, but it's enough to set you up for the day. Staff we friendly and stored our luggage on our last day so we didn't have to drag them all over London. I'd definitely stay here again as it's also very good value for money in London.", "Date": "July 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Uppsala, Sweden", "Title": "“A nice hotel at a good location”", "Author": "Falling2", "ReviewID": "UR16851699", "Content": "My girlfriend and I was looking for a descent hotel close the city center and found the Corona while looking at different websites. The location is great, just a few minutes walk from the closest tube station (Pimlico) and with Victory within walking distance. The hotel is nothing special, but it offers good location, small but clean rooms combined with a good price. It was a great startingpoint for our weekend in London. Some other reviews mention \"thin walls\" but we didn't notice that at all, maybe because our room was at the lower ground floor and the neighbouring rooms was for staff and the breakfast room. Check out time is 11 am and the hotel offers a luggage room if you need to leave your bags there for a while (i.e. a late flight home like we had). I would definitely recomend a stay at the Corona if you are looking for a centrally located hotel with descent prices.", "Date": "June 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "", "Title": "“Single Room Very Small on Noisy Street”", "Author": "ChiWind", "ReviewID": "UR16838057", "Content": "Two nights at $136 including continental breakfast in uncomfortably small room. My single was in the middle of floor two, according to fire escape drawing perhaps the smallest room. I would guesstimate 7 by 6 feet. Little tv up on shelf. Bathroom for a dollhouse. The Good: Excellent front desk staff; white tablecloth breakfast room for the continental service in basement; close to Pimlico Tube station. HOWEVER, I chose this because of the name Victoria and thought it would be much closer to Victoria Coach Station. I was returning from a trip to Wales. What a long haul dragging suitcase from Victoria Coach Station, wondering where the hotel was going to be with block after block of white townhouses turned into hotels. Belgrave Road is LOUD! The single rooms face Belgrave Road. There was a musty single in the back without decent light due to tiny windows that I was offered since I complained about the noise from Belgrave. I couldn't breathe that air and had to live with the window open to Belgrave in the original room assignment. I will share picture of room here for your own decision. I saw a back room with a large bed when the maid was cleaning. Those people are probably satisfied but I don't know what price they have to pay. Yes, the decor is updated. Doors have been replaced and bathroom is fully tiled. Yes, it is clean. Never saw such a small sink. No grocery stores closeby - restaurants within walking distance too expensive for USD spenders. I was very miserable during this stay as the bed was also too soft!", "Date": "June 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Zealand", "Title": "“Great value for Central London”", "Author": "weezer-85", "ReviewID": "UR16781240", "Content": "Stayed here for 2 nights as emergency accomadation after our initial London accomadation plans fell through. Good service from check in staff, lovely warm comfy room with clean bathroom. Excellent location, close to Victoria station and walking distance to a lot of tourist attractions. Good basic breakfast. Price very good for central London. Would reccomend to anyone looking to stay in Central London for a couple of days.", "Date": "June 8, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Malmo, Sweden", "Title": "“Good neighbourhood”", "Author": "MarieMalmo", "ReviewID": "UR14482648", "Content": "Yes, the rooms are very small. But for a short stay if you want to stay in this area of London it is a good choice. Clean bathroom - but dont plan to wash anything else than your hands in the basin unless you want water all over the floor. An added electrical radiator was an unexpected and welcome bonus since english houses tend to be cold indoors in March. The breakfast was ok (nothing to write home about). I got what I paid for. (65 GBP/night)", "Date": "March 24, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stoke-on-Trent", "Title": "“Great triple room”", "Author": "dobo1", "ReviewID": "UR14336343", "Content": "Spent a girls weekend at this centrally located hotel. Triple room was very spacious and very good value for money. Hotel very clean and pleasent, and staff helpful and friendly. Short walk to Houses of Parliament or Buckingham Palace. We will definately use this hotel again.", "Date": "March 17, 2008"}, {"Ratings": {"Overall": "2.0", "Value": "2"}, "AuthorLocation": "London", "Title": "“Tiny tiny room”", "Author": "Daniel_Lon", "ReviewID": "UR13995198", "Content": "Hmmm, well all I was looking for was a cheap place close to Victoria station before an early morning flight from Gatwick. Price was £50 for the night which is cheap for London but outrageous for places like the USA. My room was very very small - more like a student room than a hotel. This is travelling at its most basic. However, location is pretty good for Victoria station which was a 10 min walk with suitcase. Main problem was that the hotel is on a noisy main road and there is little sound insulation. Similarly, I could hear my neighbours pretty intimately! Bathroom was also very small and basic. All in all - exceptionally basic but close to the station if all you want is a place to put your head.", "Date": "March 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“OK for Brief Stay”", "Author": "JasmineMarti", "ReviewID": "UR13265429", "Content": "I stayed at the Corona Hotel for one night. Having arrived early in the morning, the room was not ready yet, but the front desk gentleman was very kind, and invited me to eat breakfast compliments of the hotel. When I came back in the afternoon, the room was clean, but very small. The bathroom also was very clean, but again very small. It had the smallest corner sink I had ever seen, I did not know they were manufactured that small. Overall, for one night in London, if you are using the place to just sleep, it was just fine.", "Date": "February 4, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bath", "Title": "“Important Feedback”", "Author": "MortonBath", "ReviewID": "UR10853630", "Content": "Poor reception when I arrived, no customer care. Double room extremely small and facilities basic but clean. Decoration poor. Wash hand basin miniscule with no room around it. TV remote control did not work but was eventually provided with another. No bar or restaurant. I had to ask for advice on where to eat. Room cold and no central heating but had a heater that worked. Receptionist did not even say Good morning the next morning! Continental breakfast below average and customer care poor again. Had to pay for newspaper and was not advised of this Location pleasant. Altogether a disappointing stay and do not intend to stay at this hotal again.", "Date": "November 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Rochdale, United Kingdom", "Title": "“Better Than Expected”", "Author": "TABRochdale", "ReviewID": "UR10716053", "Content": "We stayed at the hotel for 4 nights and having read some of the reviews AFTER we booked we were a little concerned about the hotel. However, in the main we had a good stay and would stay there again if in the area. The staff were friendly on arrival and the rooms were compact (we booked a family room for three people) and you had to dodge round a bit sometimes. As we planned to spend most of our time seeing the sights of London this was ok. The bathroom was fine and as others have said, the shower had plenty of space and was fairly powerful. When we have stayed in a family room before we have had to ask for extra towels as they usualyy only leave two of everything. It was nice to find we had three of everything for a change. Everything was clean and we did not have any 'smells' that other guests reported. Our room was on the second floor at the front of the hotel and although there was some noise from the street it did not cause any real problems. The only problem was the breakfast room which is small for the number of rooms in the hotel. There are only 30 seats available and unless you get there for the start of breakfast or the end of serving there is uaually a queue to get a table. We also found that it is set for couples and if there are three or more people, it could be difficult to get seats together. We tried to move two tables together on the first morning and the restaurant manageress went a bit over the top and told us we could not move the tables (someone else made a comment about her in a previous review). We insisted and asked to bring the hotel manager if it was a problem and she backed away and was very pleasant with us for the rest of our stay. So stand your ground to get the seating you want. Oh and you only get complimentary biscuits for the first day of your stay which seemed a little on the mean side. If you booked in everyday you would get them! There is a little Italian restaurant just up the road ' SOLE MIO' which is reasonably priced and the food is top quality. The hotel is just 4-5 minutes walk from Pimlico Underground which is on the Victoria line which is handy for central London and also runs directly to Euston Station if you arrive by train. You can get a day rover ticket for £5.10 after 9.30am which lasts for the remainder of the day. generally a thumbs up and we would stay again.", "Date": "November 9, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Oakville", "Title": "“Not impressed”", "Author": "2103grand", "ReviewID": "UR10459852", "Content": "Hotel is not in a bad location, but is not nearly as close to the Victoria Station as advertised. Front desk staff were very weak and unhelpful. Eg. asked for advice on a bus tour and reply was to go to Victoria Station and look for the buses. Asked for directions to Wembley Stadium, yet the clerk didn't know how to get there. Calling the rooms tiny would be an understatement. When you bend over in the bathroom makes sure you have the door open or you'll be bumping into it. Breakfast was okay, but certainly not up to British standards and the staff were bored and disinterested. And the temperature in the room was impossible to control.......very hot and humid and we couldn't get the a/c to come on. The room and hotel were clean and a free newspaper was provided, but overall I couldn't recommend this place.", "Date": "October 30, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Canada.", "Title": "“Would not go back”", "Author": "ValpOntario", "ReviewID": "UR10197300", "Content": "The room was the smallest, smelliest and most expensive place we have ever been in. We were winding down our trip to England and looking forward to London after 45years since we went there. What a disappointment in the Hotel. We had to spray the room but still could not get rid of the smell. The bathroom was so small and the room was wedged inbetween the elevator and the cleaners room. Being an old building the floors creaked. On our last night we were to be up early for a flight out and the people above were so noisy. Could not wait to get out of there. As we were prebooked we could not leave, but the experience dampened our trip tremendously.", "Date": "October 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Vejle, Denmark", "Title": "“Basic, but clean”", "Author": "Mopa1009", "ReviewID": "UR10009995", "Content": "We chose Corona because of the reviews here, stating that the hotel was relatively clean. This turned out to be true, so we won't complain about that. In fact we won't complain about a lot; we got what we payed for which was a basic London budgetclass hotel. The breakfast was ok, but not any more than that. The room was small, placed on lower ground floor (I call that a cellar), but everything was clean, which was what we wanted in the first place.", "Date": "September 27, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Aberdeen", "Title": "“Give it a wide berth”", "Author": "TETAberdeen", "ReviewID": "UR8877631", "Content": "Small and cramped is the best way to describe this hotel. I must have stayed somewhere different compared to the 'small and luxurious' hotel being described by some of the writers. The Receptionist on arrival was friendly and helpful. The Receptionist on departure asked 'which room' and 'enter you PIN'. No other words. The breakfast staff, of which there appeared to be 2 were incredibly busy - more on the food later, but didn't appear to be welcoming guests. The room - I booked a single as I was travelling alone. There must be bigger cells in HM Prisons as to the room I stayed in. The room was about the width of two and a half single beds and depth of one and a half. There were 3 windows. Two were incredibly small and the third had been painted over with black paint. The curtains were matching but one piece of fabric which didn't fully cover the window (although there was a cream coloured fabric covering the glass. I had to stand on the bed or the chair to see out of the window. The desk had 3 drawers, one of which had been removed. The bottom drawer held the kettle and cup, some tea, coffee etc. The hairdryer which was fixed was adequate but you had to hold your hand on the button to keep it going. At the bottom of the bed there was a wardrobe, with no door and a tray stand inside with a 14\" portable on top of the wardrobe. The ensuite consisted of a shower, toilet and wash-hand basin. Again it was incredibly small, room only to stand between the loo and shower. The towels were quite hard and seemed to be fairly old. The shower was hot with good pressure. The room was tidied and bed made but the linen on the bed wasn't changed though I did receive fresh towels. The selection from room service was disgraceful. 3 hot meals consisting of Tomato Soup, Lasagne and Cannonilli. The rest was sandwiches. The breakfast room was located in the basement of the building. It was filled to over flowing when I went down. I hovered for a bit before I was given a table. The breakfast consisted of orange and apple juice (glasses were slow in coming), cereal (4 types), fruit (4 types - one was prunes and another grapefruit), hard small rolls, croissants, ham and cheese. Tea and coffee. Toast came as I was leaving but no butter or jam. Another guest was put at my table as she was on her own also. It would have been nice to have been asked. This is most definitely NOT a hotel I would recommend. If possible give it a wide berth - spend the extra £20 on something more adequate.", "Date": "September 24, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Pleasant little hotel in a good location”", "Author": "ElTarpo", "ReviewID": "UR8665275", "Content": "We spent a week in London at the Best Western Corona in late August and ultimately decided we had made an excellent choice. Americans used to the unlimited expanses of the great plains might find the compactness of the rooms at a moderately-priced big city hotel surprising, but as residents of New York City, we did not. If we were judging the Best Western Corona as a trendy luxury hotel for jetsetters, well...it's not, nor does it pretend to be. But by the typical and reasonable standards of this type of city hotel, the Corona came out well and gave us a pleasant stay. Here's our experience: We arrived late in the evening and at first were given a room on basement level -- this one *was* tiny, airless, and so close to the breakfast room that we feared excessive noise in the morning. Gentle reader, do remember: one doesn't have to accept the first room any hotel offers! We immediately asked for another room, which was cheerfully granted. The room we were given was on the 4th floor and actually had a lovely distant view of Big Ben, the London Eye and the Swiss Re building. It was small, but a bit bigger than the other one -- and those few extra square feet made all the difference. Like all hotels on Belgrave Road, the Best Western Corona is comprised of what were once Georgian houses, now connected as one structure. Although perfectly modernized, there's a bit of an old-timey hotel experience in staying in an antique building that is not made of concrete and steel. The neighborhood is wonderful; it's extremely safe, quiet, and pretty and mostly residential off Belgrave Road, yet has delightful restaurants and plenty of services tucked away nearby. (In our case, after two previous weeks of travel, we were happy to find the nearby laundrette!) The transportation options are excellent at all hours. The neighborhood is removed from the party crowd yet makes a lovely \"home base\" for touring London because the Pimlico tube stop is close by and you can easily zip to all the popular tourist sites of London very quickly. If you prefer to walk, you can even take a most pleasant stroll along the Thames to the Tate museum or to Westminster Abbey and Parliament. Buses too are frequent and taxis are easily hailed, or can be quickly called by the front desk. The hotel's rooms *are* small, but attractively furnished and well-maintained. Our room was spotlessly clean, and efficiently laid out: adequately comfortable for the typical needs of guests but definitely no standing room to host a crowd! Your luggage remains in view in a storage unit. There was a small desk that featured a free high speed internet connection (just ask at the front desk to switch it on). WiFi is available in the lobby. As is typical in the UK, there was also an electric kettle on a tray with coffee, tea, and biscuits. Our bed was comfortable -- we slept well -- and the linens were soft. The bathroom matched the small scale of the room, but was also comfortable -- we had enough towels and the shower was a nice size, with plenty of hot water too. There is no airconditioning, but the oscillating fan kept us comfortable, day or night, (and this was in August, with sunny warm days); our room faced the rear, which was absolutely quiet, so we kept the window open our entire stay and delighted in the view too. However, if there had been an outright heatwave, a fan alone might not have been enough. Breakfast was a simple delight. We never had to wait for a table, even when the hotel was full. On the buffet were peaches, stewed prunes, plain and strawberry yogurts, danish, croissants, wholewheat rolls, several cereals (including Special K), mueusli, ham, sliced cheese, cottage cheese, orange juice, apple juice, coffee and tea. Guests sit in an simple but attractive dining room at tables with tablecloths, and they then bring you a rack of warm toast (white or wholegrain) with butter and jams, plus they refill coffee and tea as you eat. We enjoyed meeting some of the other guests at breakfast too. The staff was friendly and helpful to us in all matters. There were complimentary newspapers and magazines (Men's Health, Reader's Digest, etc.) in the lobby too. We stored luggage for a few hours after we checked out, as we had some time before our flight, but I agree with another reviewer that it wasn't clear how much security was actually offered in doing this -- the closet seemed too accessible. There was no safe in the room, so we kept our passports on us at all times and we did take the precaution of deferring housekeeping services if our laptop had not been put away. But these precautions were based on our own travel smarts: there was nothing about the hotel staff that aroused any distrust. All in all, we left London congratulating ourselves on having made a wise hotel choice that, for London, was pleasant, clean, comfortable, and well-located without being tremendously costly. We'll be happy to stay here again on our next trip.", "Date": "September 6, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barcelona", "Title": "“Great hotel at a great location”", "Author": "Zyro", "ReviewID": "UR8660344", "Content": "I stayed in this hotel with my boyfriend a few years ago, in winter and I must say that it's a beautiful place to stay, the bedroom always was clean, the bathroom is big and everything seems new for each visitor. They have a free continental breakfast with cereals, juice, hot milk, coffe, cookies and many other things. The hotel is near Victoria Station (10 minutes by foot aprox.) and you have a tube station 2 minutes away from the hotel aprox. Although you can walk to many attractions like Big Ben, British London Eye or Trafalgar Square, I like walk by the cities I visit so if you like walk too, it's a great thing to do to visit in a different way the city.", "Date": "September 5, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "FL", "Title": "“A room, or a closet?”", "Author": "BeerinDaJacuzzi", "ReviewID": "UR8121731", "Content": "Living in the US spoils us all! The Corona, a 3-star? This would be considered a youth hostel in the US!! This place is SMALL! Be very careful and do not stay there during a London heatwave if you cannot take the heat. The fan in the room is tiny and barely adequate. Thank god no heatwave when I stayed (Jul8-10). The bathroom was just 1/2 the size of the tiny room. No room for a desk and chair, tiny single bed that was pretty lumpy. The place passes as adequate because it was clean with no sign of pests. Only 2 small towels provided NOT ENOUGH...one pillow (no room for anymore). Do not bring valuables! There is no hotel safe and I would not trust the front desk. One evening I returned and my valuables could not be located. It took threats and a confrontation before the receptionist located a bag OUTSIDE OF THE SAFE with my valuables. Sounds like a youth hostel! Breakfast: simple rolls, cereals, danishes. Nothing special. This hotel needs a room safe, more towels, and perhaps some air conditioning to be considered a 2-star in the US. In London? I say spend some money for a 4-star which would probably be a US 3-star.", "Date": "July 15, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "hampshire", "Title": "“Enjoyable stay!”", "Author": "ivahHampshire", "ReviewID": "UR7867599", "Content": "Best hotel bed I have experienced - normally it takes me two or three days to get accustomed. Polite and helpful staff. Excellent breakfast - absoloutely stuffed! Coffee, cerial, mixed fruits, yoghurt, rolls, croissants, cheese, ham and cottage cheese. Could not ask for more! The room was small but adequate, with a colour television and en suite shower - very clean! Personally, I found the rooms very quiet as the hotel is not on a busy road. I had the window open and it was very quiet, so I cannot understand the complaints about noise. I live in the country and any noise would certainly have disturbed me! Very enjoyable will definitely stay there again. Ivor Hobbins, Hampshire, England.", "Date": "June 17, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Southampton", "Title": "“Good location, comfortable hotel”", "Author": "Rob_Hampshire", "ReviewID": "UR7392827", "Content": "In Pimlico/Belgravia area, this is a comfortable hotel with fairly modern decor. From what I've read about other hotels, this is well above average and we didn't have any complaints. The road was noisy outside, so if you're a light sleeper ear plugs might be a good idea. A lot of London is noisy through the night and it wasn't that much of a problem. Breakfast was fine, a good selection (continental) with decent coffee. We only stayed for a night but I would definitely stay in this area again as you can walk to Waterloo (not with heavy luggage though) and avoid expensive taxis/underground. We walked everywhere. In the area there are nice resturants, shops and a few pubs and it was perfect for us.", "Date": "April 19, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edinburgh", "Title": "“A wee gem”", "Author": "Sapphoxxx", "ReviewID": "UR6838147", "Content": "We booked a two night stay in London to go and see a show and were lucky enough to get two nights for the price of one in this hotel. The room was comfortable enough. Some may see it as being a little cramped but lets face it, you don't go to London and spend time in your hotel room! There's plenty of storage and wardrobe space. The shower is brilliant, lots of room and really good power. I was really impressed with the bathroom all round. The only downside to this hotel is the breakfast. The dining room is small and cramped and if you go at the wrong time you'll have to queue for a seat. If you aren't up for breakfast when it begins then you are unlikely to ever see the selection of foods on offer. This hotel does continental breakfasts only and the variety of food available is poor. The pastries run out very quickly, the toast will be cold when it arrives and the restaurant staff are very unfriendly. In fact, the head waitress gets quite uppity if you don't hear her shouting across the room whether you would like tea or coffee! We didn't let this put us off though, for the price you are lucky to get breakfast included and there is no short supply of places in the vicinity where you can get a full english breakfast for next to nothing. We did this the second morning of our stay as we couldn't face the breakfast room again. I will definitely stay at this hotel again, although I won't be having breakfast there!", "Date": "February 25, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Derby", "Title": "“Don't expect to feel welcome.!!!”", "Author": "Frisco_del_toro", "ReviewID": "UR6354027", "Content": "Arrived early in the day and was almost trampled by a costumer who wanted help with a flooding room!! receptionist couldn't care less.! Rooms are small for the money. In the morning.. went to ask for a bit of tea in the kitchen as there was noone in the restaurant and no food worth eating avalable.. Met by polish girl who looked like she had a sour lemon stuck in her mouth and it had been in place for several years.. NO SERVICE WITH A SMILE HERE..!!! Was left feeling awful for asking the misserable sod for a cup of tea. She then proceeded to bring cold toast which she dumped unceremoniously on the table .. NO SMILES HERE..!! Wouldn't go back and wouldn't recommend. Go somewhere else for your hard-earned cash.", "Date": "December 9, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Winslow,Az", "Title": "“Nice hotel for the money”", "Author": "Amarquez2021", "ReviewID": "UR6135273", "Content": "The Best Western Corona is a nice hotel. The rooms are small by American standards but clean. The staff was very helpful (The two male night clerks were the best). The closest tub station is Palimico (not sure on the spelling). Maybe a three minute walk. There are several resturants in the area as well as a internet cafe. I would recommend this hotel for anyone.", "Date": "November 16, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Phoenixville, Pennsylvania", "Title": "“nice little hotel in a quiet neighborhood”", "Author": "tsl1965", "ReviewID": "UR5920607", "Content": "This is a 4 star hotel (supposedly) that is located amidst a row of cheap 1- to 3-star hotels. I booked this hotel because of a great weekend rate. My single room and bathroom were very small (typical of London), but the room looked like it had been recently refurbished, with nice clean faux cherry wood and bright colors. The breakfast room gets very crowded, and the continental breakfast was the usual blah British offering. The staff are competent if not very friendly. Belgrave Road is quiet, and you have to walk down to Victoria Station (10-12 min with luggage) if you want to eat. After staying at the Best Western Phoenix (which has good reviews but extremely worn furniture and decor), I was pleasantly surprised by the Corona. This is a very clean, nice, comfortable place to stay (by London standards), although you are a bit removed from the action.", "Date": "October 5, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“ok for budget hotel”", "Author": "stalig", "ReviewID": "UR5920157", "Content": "Stayed here for 2 nights due to being on a course nearby. I had booked a single room, which turned out to be a triple with a double and single bed in it, so plenty of space - although would have been very cramped with 3 or even 2 people in the room. The room was ok, basic and small, with a strange musty smell! There were tea and coffee making facilities along with a portable TV and useless hairdrier. The bathroom was very small, but clean with a decent shower. This hotel is on a busy main road, normally this wouldn't be too much of a problem, however, the hotel does not have double glazing, therefore it is very noisy - all night! The breakfast consists of fruit juice, tea/cofffee, toast, cereal, a bit of cheese and ham and stale croissants and bread buns. The best thing about this hotel is it's location, which for the price probably can't be beaten. It is a 10 minute walk to Victoria and 5 minute walk to Pimlico with plenty of bars and restaurants nearby. In all, this is a basic/budget hotel in a great location - you get what you pay for. I've stayed in worse but also stayed in a lot better!", "Date": "October 5, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wisconsin", "Title": "“great staff members”", "Author": "parjatak", "ReviewID": "UR5716671", "Content": "The hotel was pretty average by London standards - small rooms, basic amenities, etc. Two things worked really well for me: the excellent location near Victoria terminus made transportation very accessible. I was also very happy with the friendly staff members who went out of their way to make my stay pleasant. Would definitely recommend it if you are looking for a basic relatively inexpensive lodging in London. devarati Wisconsin, USA", "Date": "August 28, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Bristol, UK", "Title": "“Poor service”", "Author": "Torianna", "ReviewID": "UR5602422", "Content": "3 of us travelled here on business and I can safely say I will not be staying here next time. Check in was fine but the rooms although an acceptable size had an appalling smell, even with the window open all day. I requested a complimentary newspaper each day and only received one of 3 when i specifically told the receptionist I'd wanted one the night before, the 3rd never arrived. Breakfast is poor, and there are only a handful of tables so we had to wait 15 mins one morning. There's a small selection of stale rolls, ham, cheese, canned fruits and cereals and the tea and coffee is at the end of the self serve area - but do not try to serve yourself the hot drinks, the incredibly rude waitress runs out to take it from you! The location is quiet enough and just around the corner from Pimlico tube and there are a few nice eateries in easy reach. This said, with the staff generally rude and unhelpful, requests not fulfilled and the breakfast as it was, i wouldn't stay again even for a few nights on business.", "Date": "August 12, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "barcelona", "Title": "“Not for business tourism”", "Author": "bogarde", "ReviewID": "UR5516070", "Content": "Well, I stayed there some weeks ago. I came to London for business and the travel agency booked me this hotel. I did agree because I saw in its website that is close to Victoria station, and I though it would be good. Well, yeah, London is huge so the distance between the hotel and the station is not long if you check the map! But try to cover the distance carrying the suitcase and the suits on foot! I was really thinking on the mother of the one who drew the map! Anyway, for tourist is not bad. Nice room size, clean, confortable etc. but if you go to London to work don't choose that hotel. Too much walking distances, too many tube changes... And Victoria is a really boring zone!!! (except for the Pacha) With the money I spent in taxis and tubes, I could easily pay a hotel in the centre!", "Date": "July 27, 2006"}], "HotelInfo": {"Name": "BEST WESTERN Corona", "HotelURL": "/ShowUserReviews-g186338-d193153-Reviews-BEST_WESTERN_Corona-London_England.html", "Price": "$128 - $237*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">85 - 89 Belgrave Road</span> | <span class=\"extended-address\">Victoria</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">SW1V 2BQ</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "193153", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/f7/bd/f7bd9ef406280c56c7ce9dc7d8fb32734large.jpg"}}