{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Absolute Blissful Chic !”", "Author": "Indian T", "ReviewID": "UR128316776", "Content": "I decided to book this hotel after some extensive research to celebrate our 16th wedding anniversary. As it was the first time that my wife and I had travelled without our two boys in a while I had some strict criteria on making this memorable. Well I can say that Ohla did not disappoint !!! From the moment we arrived through the grand entrance we knew this was a special place. As you enter you are enveloped in a dark black chic hallway with the concierge desk to your right. There we were greeted by Fausto (according to my wife, a lush Italian). He was so helpful in settling us and led us to the small annex on the first floor where we checked in. The check in almost like a cool living room. Ultra smart white furnishings and homely book cases all around. My wife and I spoke in hushed tones as we really did feel like we were in someones home - very nice. I managed to get an early spring (March) deal on a junior suite. What an absolute treat ! Took the advice of others on TA and had a 5 floor suite overlooking the main street. The room was quite excellent with the same chic design and modern feel. The bathroom was a little confusing at first as it is actually in your room. Think of an open plan kitchen with dinning, instead you have an open plan bathroom with a bedroom. This makes the room very intimate for couples, but if you are planning on sharing with someone you don't know very well - perhaps this open plan design isn't a great idea - no bathroom door as such in other words !! There is of course a discrete loo so it's not all open plan. The bed was firm and comfortable and you can actually pick the scent of the pillows - very classy touch. We were greeted with a bottle of bubbly cava for our anniversary and our arrival was complete - fantastic start. We chose to eat in the adjoining Sauc Michelin starred restaurant. The restaurant is very small and off an annex by the reception room. You cross a little bridge over the main lobby and bar area - smart. My wife and I chose the 5 course tasting menu, as my wife doesn't eat meat the restaurant amended the tasting menu to be more seafood based. Cannot fault the service or the food, simply lush. I would say that you'll need to have an adventurous palette to enjoy the experience - not a burgers and chips place - and not ideal for children. Breakfast was in the brasserie area with a nice open selection. Plenty of cold and warm options. I chose a small cooked Sausages and Eggs breakfast - but I've never seen such a classy serving of the dish - again the word I'd use is Chic !!! The hotel is located right in the centre of old Barcelona - we were a 5 min walk from La Ramblas, 5 minute walk from Barcelona Cathedral and a 45 second walk from the tube station that is opposite! Because it was so close to the sights and transport, we were able to taste the best of everything in Barcelona without feeling rushed, no hassle of delays from cabs or traffic. We chose to use the underground as it was cheap and very convenient. I bought my wife and I a pair of traveller tickets for 2 days, about €29 - fantastic value. Overall I could not have wished for a better experience. Fabulous hotel that made the whole Barcelona experience unforgettable. Well done Ohla and the team - truly fantastic !!", "Date": "April 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Good but not great Central Hotel Experience”", "Author": "templeDublin", "ReviewID": "UR128276144", "Content": "This hotel is a class act - but it could do better. Its right in the middle of things and you never have to walk far to the best attractions. We didn't check out the Michelin star restaurant but dined on our first night in the casual restaurant which was a most pleasant experience. The Lady who acted as Maitre D was a superb polished act. The glass sided pool on the chill out roof terrace is nice but diminutive.Our room was good but not great. cosmetic products were not what you would like to expect from a hotel of this calibre. Breakfast again was good but not great. They produced croissants etc that to me had come straight from the freezer via the oven and were tasteless and tiny. in my book Spain produces great bread and pastry products - second only to France. it is not too big an ask to produce fresh products ! With a little extra effort this could be a great hotel. the design is fantastic, location superb, staff faultless but it is let down by the little things that were not just quite right.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Paris, France", "Title": "“Nice Hotel but not Fantastic”", "Author": "jeleconiac", "ReviewID": "UR128116124", "Content": "The hotel is well located but in a too noisy area and quite dirty. This is not a 5 star hotl but a 4 star to my opinion. The matress was much too hard and the rooms are too hot or too cold if you put the air con. The service depends on the people who helps you it can be really good or really cold and not friendly. I was really dispointed by this hotel and it did not make me want to come back to BCN which is a very agressive city. Please be friendly if you want people to visit your city and boost your economy!!!!", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Absolutely fantastic stay”", "Author": "hcgrainger", "ReviewID": "UR128011511", "Content": "We chose the Ohla Hotel for our honeymoon in part because of the reviews on here and we definitely weren't disappointed. They arranged for a car to pick us up from the airport and on arrival we were quickly shown to seats and given a glass of cava to enjoy whilst we were efficiently checked in. We'd chosen a junior suite and the fall in love package for our first night and wow - to find red rose petals in a heart on the bed, a rose petal arrow leading to the bath, which had candlelight and rose petals in the hot, bubbly bath water. A chilled bottle of cava on the side with chocolate truffles... welcome to Ohla - we were in heaven! We ate breakfast in our room every morning and although the room service charges were steep we found the breakfast filling and everything was well presented and cooked. The receptionist/concierge were also incredibly helpful booking restaurants for us (recommending great restaurants too!) and arranging taxis. Nothing was too much trouble and they were always delighted to be able to help. Each evening when we were in, a lady came to our room to check the service/cleanliness of our room was satisfactory and to provide chocolates for our pillows - I truly think it's these little touches which made our stay extra special. The final thing I should mention is the bar staff in the hotel - they are superb and I'd recommend popping in just for one of their amazing cocktails! Not only are they incredibly knowledgable about the drink industry but nothing is too much trouble and they take the time to talk to all guests and will make any drink you ask, even if you just say I'd like something involving whisky. Would absolutely recommend this hotel, and the area feels safe and is perfect walking distance to many great places including shopping and is a stones throw away from the metro for easy travel around Barcelona.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Stay was ok - but not worth the money”", "Author": "Brandie_in_Boston", "ReviewID": "UR127743619", "Content": "My husband and I were excited to stay at the Ohla Hotel but in the end we were not impressed. The location is excellent but in our opinion that is the only five star aspect of this hotel. When we arrived at the hotel to check in, the woman checking in the guest before us was snapping at her because the guest was asking for her beds to be arranged in a different way (the way she had requested). When it was our time to check-in we were barely greeted. We had reserved a junior suite for four nights. They only had us down for two nights and when I mentioned this the check-in woman demanded to see our reservation. We were given a room on the 3rd floor - which turned out - allowed for a significant amount of street noise at night when we were trying to sleep. The room was fine, but quite small for a \"suite\" even by European standards. In fact I feel that calling this room a suite is simply clever marketing tool. The room was just a room. I also noticed the same stale smell others have remarked on when we entered the room. The hotel had also sent us an email asking us what aromatherapy scent and pillow type we wanted upon check-in. Neither were present in our room. The bathroom was big but very dark. Maybe my eyesight is bad but I am not sure how you are supposed to apply make-up in a place that dark. The best light was in the closet with the toilet in it! I will say the shower was nice and free toiletries were good. Our breakfast experience was similar to others who posted reviews previously. The staff was really unhappy and they seemed quite put-off if you requested something cooked off the menu even though that was included. On our last morning for breakfast I had ordered scrambled eggs for myself with bacon and pancakes for my husband. My husband's pancakes came out and my eggs at least 10 minutes later with uncooked bacon. What a disappointment. This hotel is fine but it is not worth the money and the staff especially are not representative of someplace that claims to be five-star.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lausanne, Switzerland", "Title": "“Nice Hotel (but not a 5*) - well placed disapointing restaurant”", "Author": "hedocple69", "ReviewID": "UR127682532", "Content": "Very Nice boutique style hotel, well situated in the Middle of Barcelona near to all the shopping and Museums. For the price you pay you would expect a little better service. arrived at the hotel just after midday room not ready ok that life, bot no offer of a coffee or drink while I had to wait.. asked for a room with a large bed (Big boy) got one with 2 singles.... Not 5* style Very nice modern rooms, but you cannot open the windows, ok you do have A/C in the rooms. iT IS NICE TO TURN OFF THE a/c and have the window open.... The bathroom system is great wit a large shower in the middle of the room great.... really thought it was fun. Well equiped with aminaties and free wifi good connection. One of the reasons that I picked the hotel was that it has 1 Michelin star restaurant....I think the inspectors should go back..... The food was ok when you got served and they did not forget what you orderd..... service was realy bad more or less had to beg to be served.. Nice wine list and Menu but the service does not follow a pitty Breakfast was very good, Nice selection and served late. In Barecelona thesr is better for less.", "Date": "April 11, 2012"}, {"Ratings": {"Overall": "5.0", "Value": "4", "Service": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic restaurant and bar”", "Author": "Anon641", "ReviewID": "UR127647888", "Content": "We didn't stay here but had one of our standout meals of a trip here in the gastronomy bar. The tapas are heavenly; modern, fresh and very tasty. The orange curd and hibiscus pudding was out of this world! Staff are very friendly and helpful in explaining the unusual options, which sit alongside some more traditional dishes. So good we almost went back for a second dinner, in a city where there are many great options.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Great for Couples”", "Author": "houstonisraeli", "ReviewID": "UR127378332", "Content": "My husband and I stayed here on a mini vacation and decided to splurge a little. My only \"complaint\" was the price but I've learned european hotels get the best of your wallet. We stayed in a \"design\" (standard room) and loved the bathroom concept. It's an easy way for the Hotel to save space but it also something new than the standard hotel (if you don't mind the lack of privacy). The glass is not frosted so ask if you have kids staying with you (I've seen this concept at others where you can turn on the privacy glass - which was not an option in our room). We had plenty of room for 2 including all our luggage. Breakfast was great too and the locaiton is fabulous...hence the price. The night before our departure I blew a fuse out in the room not once but twice. And the seond time affected the entire floor. Blame it on those converters! The staff were great and quickly scrambled to fix it so we could get a few hours sleep before our morning flight back to the US. Their patience was much appreciated. The hairdryer didn't survive!", "Date": "April 6, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lancashire", "Title": "“Not a 5 star hotel”", "Author": "Doley31", "ReviewID": "UR126965420", "Content": "There is nothing fudamentally wrong with this hotel, but it just lacks any vibrancy or character. It takes itself too seriously and needs to seriously up it's game on the service front to truly be a 5 star hotel. Breakfast choice was poor and the location where breakfast is provided is very quiet - like having breakfast in a library (v. odd) Stayed in a junior suite and again nothing particularly wrong with it, but lacks the WOW factor - have stayed in better 4 star hotels than this. Commercially the staff are missing a trick when it comes to looking after guests and anticipating guest requirements, so they should work on this. I did enjoy the stay, but wouldn't stay again. Stayed for 4 days which was a gift from a family member, but if I had paid my own money I would have been seriously hacked off becuase it just wasn't worth it in the value for money stakes.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Nice Location nice price”", "Author": "erimleb", "ReviewID": "UR126766009", "Content": "When i book my Barcelona trip the Hotel was 2 months old, and it was brand new.I was there with my wife.The room that i stayed was normal small room, anywhere you go in europe rooms are small except than the 5 stay 500 euro per night hotels. The hotel location is great its the 2 parallel street from famous La Rambla, and one parallel street is great for shoppers.If you follow the main street to shout where the hotel is you can access the port in 15-20 mins walk Also hotel has a great boutique bar, one of the most talent bartenders in spain.Best cocktails and best presentation for the cocktail. I recommend the bar more than the hotel.But hotel by himself clean new and nice. Take advices from bartenders not from consierge, all the restaurants they suggested sucks", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Malmo, Sweden", "Title": "“Very Good Hotel in Barcelona”", "Author": "Rikki_Tikki_Tavi_43", "ReviewID": "UR126697536", "Content": "Very good hotel in Barcelona. Clean, fresh, nice room, and very good service. The location of the hotel in center of Barcelona is perfect. I will try to book this hotel again next time I go to Barcelona. The only negative was the taxi the hotel booked for us. It was expensive and we could not pay with VISA-card so it's much better to stop a taxi on the street!!!", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vienna", "Title": "“Excellent Hotel”", "Author": "Bargeror", "ReviewID": "UR126440679", "Content": "In contrast to the exterior the hotel inside is very modern and stylish in a very minimalistic way. The staff is always helpful and even though a mixup with our room lead to us receiving a smaller room during our first night - we arived around midnight - they discovered their mistake and took action immediately. Aside from the apology we were granted the lower room rate for all days. The bed was excellent with a variety of choices for pillows. All rooms have an iPhone - soundsystem and free wifi. The bar in the hotel is excellent with two bartenders making an art out of cocktails. Breakfast is also very nice. I can only recommend this hotel and will return for sure.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Perfect location - could do better”", "Author": "ginger_tulip2000", "ReviewID": "UR126230636", "Content": "I stayed with a friend for a weekend for my 40th birthday. The location is perfect. We were up-graded to the Junior Suite. The room is very contemporary as is the bathroom. However, there was no bath, only a rainfall-shower. The bathroom steams up very quickly if you are showering for anything longer than a quick shower and go. The mirrors are not steam-free. There is no other mirror in the main room at all. There didn't seem to be many channels on the tv, one or two british speaking channels. There is no tea and coffee facilities, you have to request these together with the fact that there are no ironing facilities in the room, which for a 5-star hotel I find surprising. The roof top pool area is lovely, although fairly small for a large hotel. They did organise a 'surprise' for my birthday which turned out only to be a bottle of wine - which unfortunately I don't drink. The breakfast is also a little disappointing for a 5-star hotel. We felt that we 'inconvenienced' the waiting staff for asking for something cooked. There is an internet facility which is by way of a notebook by the reception area. For the price and service, I would consider looking at other hotels in the area.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Full of style.. Exquisite taste..”", "Author": "3spots", "ReviewID": "UR126082526", "Content": "Stayed in junior suite. Spacious, great layout, simple and not over pretentious. Concierge was very helpful. Suggested few great restaurants nearby. Lovely experience. Location couldn't be better. 5 mins to la ramblas and plaza catalunya yet still located in quieter area of town. Enjoyed my stay.. Simple stylish vacation..!", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Somerset", "Title": "“Fantastic hotel, excellent location”", "Author": "LindsNick", "ReviewID": "UR125981148", "Content": "We have just returned from a 3 night stay at the Ohla Hotel and found it to be a wonderful Hotel in an excellent location. Walking distance from the Aerobus which drops off at Placa Catalunya. ALL the staff were very helpful and friendly and not at all stuffy as we expected from a 5 Star Hotel. The AirCon failed on the 5th floor on day 2 and we were moved, and upgraded, to another room within 20 minutes. The highlight of the Hotel for us was the food. We ate at their Bar Gastronomique which served delicious and reasonably priced Tapas style food AND at their Sauc Restaurant where we had their Taster Menu which was FANTASTIC. The roof terrace is amazing, and if the sun is shining an amazing place to chill. The Cocktail Bar is also an unmissable experience. We cannot recommend the Hotel enough. FABULOUS!!", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kent, England", "Title": "“Design and substance”", "Author": "cheryltheperil", "ReviewID": "UR125719707", "Content": "Ohla is a relative newcomer to Barcelona and it's easy to think that the last thing the city needs is another design over substance hotel. However, this one seems to have most things sussed and I won't be looking any further on my next visit. We picked a design deluxe room, and were very happy with the size and amenities. Everything you'd expect from a 5 star design hotel was present - ipod docks, check; free wifi, check; shower in the middle of the room; check. The only mildly irritating point was the poor performance of the hairdryer but hopefully that was just our room - and was reported. Breakfast was very well organised and had a good selection with a hot menu of items cooked to order. The restaurant in the evening was buzzy and offered an interesting selection of food and it's open on a Sunday evening, something of a minor miracle. The concierge staff were very helpful and keen to offer recommendations and when we arrived from the airport, they welcomed us by name. Clearly we were the last people that night to be arriving, but it was a very nice touch. A great addition to the Barcelona scene.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great design. Great location. Very pleasant stay.”", "Author": "vxcohaagen", "ReviewID": "UR124994097", "Content": "We spent 3 nights in a design room on the 5th floor. The room was very clean and comfortable, and just far enough from the noise on the busy street below. The location of the hotel is excellent - right across the street from a metro stop, and just a short walk away from a stylish neighborhood with many restaurants and cute shops. The cocktail bar on the ground floor was a little expensive but definitely worth it (try the boutique martini).", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“everything perfect but...”", "Author": "samanthagreece", "ReviewID": "UR124952464", "Content": "Everything was excellent, specially all the people in the reception were really polite, helpful and always with a smile. the only thing is that the service on the 1 star michelin restaurant wasnt the one i expected. the room, we had a suite, was exactelly what i was expecting, from the photos etc. very very nice, so modern and stylish, i felt really cosy. Finally the location is ideal, city centre, but not in the noisy places. Of course, ask for a higher floor, to avoid the trafiic noise.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ottawa", "Title": "“Treated like Royalty”", "Author": "Janetvdh", "ReviewID": "UR124878418", "Content": "From the moment we arrived until 3 days later we were treated like Royalty. Yves Vandekerckhove requires an honourable mention as he was so kind and always accommodated our needs. Hotel breakfast buffet has a good selection and was tasty. Chocolates on the bed in the evening a nice touch. Concierge service exceptional. Our favourite restaurant in close proximity was the 4CATS. Subway close by and easy to get around the City. We were on the 4th floor and had no problems. Beds and sheets were so comfy. Thanks to all the staff for a great STAY. Jvan den Heuvel, Canada", "Date": "February 20, 2012"}, {"Ratings": {"Overall": "3.0", "Value": "3", "Service": "1"}, "AuthorLocation": "", "Title": "“Restaurant and bar let down by terrible service”", "Author": "Guy_PerthAus", "ReviewID": "UR124777773", "Content": "We ate in the gastrobar twice and drank in the bar on two separate occasions    Let's start with the restaurant. The service was a terrible letdown. Only one waiter appeared to take orders, and he was far from attentive.  In fact, he was more concerned about arranging cutlery on unattended tables than waiting on the guests. We waited at least 15 minutes for our order to be taken, despite eating at a fairly quiet time of day on both occasions. We asked for a wine list, but the waiter never returned to take our wine order after giving us the list, and we had finished our meal before he bothered to come anywhere near our table again. Everyone in the restaurant appeared to be having the same problem, and the couple at the table next to us resorted to walking up to the bar to order a glass of wine because they couldn't get the sole waiter's attention.  The food (when it eventually arrived) was a bit hit and miss. It was basically a form of upmarket tapas. Some portions were very tasty, others were so-so and others (the more expensive dishes) were a complete let down. This level of inconsistency is not what we expected for a restaurant attaching these sorts of price tags to its menus. On our first visit, the boutique bar suffered the same problem in terms of service.  We waited a good 20 minutes for our order to be taken by the only guy working there, who appeared to be a trainee. Other people who arrived after us has their orders taken first.  Our drinks took an eternity to arrive, and only after a more experienced bar tender came on shift, took our order and whipped the place back into shape.  The quality of the drinks, however, cannot be faulted. The cocktails were of an international standard and are some of the best cocktails we have been served in the world. While this is to be expected given the accompanying price tag, it was a welcome reprieve from the generic cocktails on offer in other bars in Barcelona.  When we returned the following night, the service was much improved. While still a little slow, the drinks were again worth the wait.  If you have some time on your hands and some great company to spend it with, the cons of this place are definitely outweighed by the quality of the drinks and the surrounds.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Stylish intro to Barcelona”", "Author": "Thompsons-Abroad", "ReviewID": "UR124294022", "Content": "Location and staff - if those are good then you'll be forgiven almost anything. Not that the Ohla needs to be forgiven much. We had a good deal on a Junior Suite and were delighted to find it so quickly after getting off the airport bus. Smooth check in - and those reviewers thinking the mezzanine check-in is odd should try standing in the lobby in February. Hats off to the concierge staff for at least trying to look warm! Great breakfast (as previously reviewed) - there is a Starbucks directly opposite if you need an initial caffeine kick and don't have the same package. Lovely looking room with plenty of space, very good toiletries, linen and towels. Slightly firm bed, but not a big issue. Cheerful and efficient cleaning / turn down. All in all, very close to 5 star rating, but there are a couple of minor eccentricities that pull it down. The single sink was plugless (as far as we could see) and there was soap but no soaptray provided. Odd. Kettle, cups and tea provided, but no coffee. Unless you asked for a machine at extra cost. I'm guessing instant coffee would have been provided had we asked, but we usually travel with a small supply anyway. We were 2nd floor, front. There is some underground noise 7am-11pm ish that was only mildly disturbing, traffic/street noise was minimal. We didn't like the fact that the window was subjected to spotlights outside, without extra blackout curtains - standard ones really didn't work. These lights are turned off in the early hours so that it isn't an issue all night but light sensitive souls should bring along eye shades just in case. Too cold to use to roof/pool other than a brief photo trip, but it did look great for warmer days. Would wholeheartedly recommend the Ohla for a first visit to Barcelona and will certainly check it out next time we visit.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London UK", "Title": "“Ohla - Barcelona - Gatwick Cabs”", "Author": "tireddad", "ReviewID": "UR124206296", "Content": "Its a while since I wrote a review and following all the negative publicity regarding false reviews/reviewers I thought I should put pen to paper and support TA. Just been for a long weekend at Ohla in Barcelona. Situated on the Via Leteatia (sp?) which runs parallel to La Rambla - its a real gem. Very boutique - not many rooms but the best bar I have come across in Barcelona. If cocktails are your thing then this is a must to visit and not horribly expensive either. The rooms are minimal in decoration but very comfortable and of a very high standard. The staff are all very friendly and the conciege excellent. The cafe part is also a must visit. A real twist on Tapas - steak tartare, the best fried prawn balls etc etc. This is probably the besy hotel I have stayed in in Barcelona and certainly one of the best for a weekend away. It was -1 degrees when we were there but we did go to the roof which in the summer would be perfect. A small pool and lovely seating - a perfect way to waste an evening. Probably not ideal for children A small moan - due to the snow the flight was delayed and Gatwick Cabs which seem to run a 100% monopoly wanted £160 for a cab to SW6. Staggering - the sooner they allow black cabs the better and in the meantime use the Gatwick Express and hopefully Gatwick will stop this daylight robbery.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Pleasant Stay - Superb Location”", "Author": "rachel1372", "ReviewID": "UR123984735", "Content": "This hotel can't be faulted for design. The whole look and feel is chic, sophisticated and well laid out. The roof terrace is stunning and there was obviously a lot of thought in how the property could be made unique. Which is brilliant because in our minds, when we travel we want something different to experience. And the Ohla Hotel definitely offers something different. Like many reviewers we stayed in a junior suite. I wasn't overly impressed with the materials used in the room as although the design was 'cool' it seemed a bit like it was decorated from IKEA. Just a personal opinion; however, it was modern, clean and open planned - meaning the bath area is not separate from the rest of the room. Having stayed in hotels with similar open plans, this was not a problem for us and just added to the charm. I was slightly disappointed that our bath did not face out the window as one of the pictures had shown. Rather, it was in the middle wall of the bath area. Lovely, but just a small disappointment on my behalf as I probably spent too much time analyzing their website photos and building different expectations. We may have hit an 'off' weekend however we weren't too impressed with the catering facilities. Upon check in we were told that we could eat as the restaurant would stay open until 01:00 (we checked in at midnight). We trekked to the room and ran down the stairs just to be told that unfortunately they closed at one midnight. No problem - room service! The menu had a good selection and only a few things would be available after 01:00 so we rushed to order - only to be told that unfortunately the menu is not correct and they stop at midnight. Mini bar it was.... good thing there was a lovely half bottle to share. Breakfast was good and varied. Included in the menu are a few made to cook items which was a nice surprise to the otherwise (high quality) continental style breakfast. Moving on the bar downstairs the next evening - we had some of the best cocktails that we have ever had and I am not kidding. Well thought out, perfectly executed and excitedly different than just your average martini. With all the good, their seemed to be a bad however...Service was horrendously slow - so much so that after waiting nearly 30 minutes for a second round we decided to leave. There were only four other customers in the bar! Tucking into the last bit of crisps on our table we noticed something hard. A chewed olive pit was in the bottle of our crisp bowl. Not pleasant at all. The staff apologized however it didn't leave a good taste in the mouth - pun intended! We decided to eat down the street (recommended by the hotel) at a place called Neyra - about a two minute walk from the hotel. As my husband is Spanish he was longing for some decent tapas. We weren't disappointed (one star to the hotel for such a great recommendation!) Next morning before our departure, we had breakfast. Eggs cooked to order took 25 minutes and had bits of shell in them. Oh dear... You can see a slight pattern here. On the positive side - the location is unbeatable. Las Ramblas is a short stroll away as is the waterside leisure centre. We did have a fantastic time. It wasn't flawless by no means and perhaps all of the glowing reviews set expectations which just couldn't be met during our stay. Having said that, it was a very nice hotel indeed.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“excellent choice”", "Author": "Th0rnt0ns", "ReviewID": "UR123971134", "Content": "The hotel is located in a good place. The bed was really comfortable that I had never wanted to get up. The hotel is quite luxurious. The shower was transparent, which might not be appropriate for some lodgers! There was no kettle nor coffee maker.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“A fantastic hotel and location !”", "Author": "cx123", "ReviewID": "UR123730176", "Content": "A fantastic hotel and location,this is an amazing hotel, with great restaurants, bar to have a nice drink at night and an his great location makes it very very convenient.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Anniversary bliss”", "Author": "Tom Y", "ReviewID": "UR123506263", "Content": "To celebrate our 20th wedding anniversary, we travelled to Barcelona for a three-day break. The deal to stay at the Ohla Hotal was very good and though I read a couple of slightly negative reviews, the place was absolutely fantastic. The staff were lovely and we were treated to a complimentary bottle of cava when they discovered it was our anniversary. The hotel is central and just far (and close) enough away from La Rambla and there is a virtually limitless number of places to eat, drink and be merry. However the highlights of the hotel were; the tapas restaurant, which is just below street level and we were entertained on our first night by the hundreds of local football fans walking by, celebrating Barcelona's league title win that night; the rooftop bar and pool, though the latter is small and a bit revealing with a glass wall (however the views are great); and the cocktail bar, where the drinks are expensive but the barman put his heart and soul into making our drinks and they have some really funky chairs! All in all, a great time and a great place.", "Date": "January 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Gorgeous hotel, amazing honest staff”", "Author": "marboycie", "ReviewID": "UR123386862", "Content": "My partner and I stayed for 3nights in a junior suite, which was very contemporary, stylish and sexy. It suited us perfectly, as it was large and had all the amenities you need and was immaculately clean. We ate in the hotel one night as the concierge said they did the best tapas in town and we loved it. The kitchen is open in the restaurant and so you know standars are high Nd the staff were attentive and friendly. We drank in the hotel bar every night before going out and although small its a nice place to start and the bar staff are experts, telling you all about your drinks and watching them make them up is a great way to watch experts in this field at work, they are a credit to the hotel. Breakfast was lovely every morning and again staff lovely. Checking out I left diamond earrings, designer jewellery, cash and cards in the room as my partner had put them out of the safe so I assumed they had been packed. The hotel called immediately, but I had checked in at the airport so they sent everything back to me including cash I had left. I think this is lovely and amazing that cleaning staff on little wages would be so honest, but this is a reflection of the standards required by this hotel and demonstrates that their staff are employed for all the right reasons. We could not fault this hotel in any way, shape or form. It's strategically placed and is five minutes from anywhere you need to be and there is a train station around the corner, all the trip buses at Catalunya square are just five minutes away and you are in the gothic quarter, so you cannot get much better location wise. This hotel is geared towards couples or friends I feel, so if you want a nice hotel in a good area with excellent standards then this is for you.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Almost perfect”", "Author": "Yellow_Mzungu", "ReviewID": "UR123186229", "Content": "We studied this hotel carefully, and got a great deal on it for my 40th birthday. This is a classical modern boutique hotel, located centrally in the heart of the Gothic district and a major transport route with easy walking distance to many of the major sites, and 3 blocks down from the Hop-on, Hop-off Barcelona buses, which are a great way to see the city. Like others, it is a little weird that the check-in is half a floor up, but perhaps, that expands the boutique like feel to the location. I must say that they pay great attention to all the little things, from the concierge giving you directions, to the chocolates on your bed sheets. It was too bad that the roof top bar wasn't manned, and the roof top pool wasn't warmed. I would have loved to have taken a swim with that view of the city, especially looking at the Gothic Cathedral and the sea beyond. It's an absolutely stunning view. The one major negative of the trip was dinner at the Restaurant. For a Michelin star restaurant, the service was awful. The food was excellent, but when it takes 15 minutes to order a meal, and 20 minutes to respond to a request for a cheque, that's simply not acceptable. If I was giving away a Michelin star, I'd be taking it away just for the service in the restaurant. However, it doesn't take away from an excellent, incredibly well located hotel.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Central Scotland", "Title": "“Ultra modern rooms with welcoming service and a fantastic rooftop pool and bar”", "Author": "HighlandRacer", "ReviewID": "UR123039153", "Content": "I enjoyed a pleasant night staying in the Ohla Hotel. The reception on a mezzanine floor is a slightly strange set up on arrival but the concierge was extremely helpful pointing me in the right direction. Check in was very friendly and straightforward. The hotel room was very comfortable and modern with a helpful iPod dock/alarm and free wifi in the room. The toilet in the room was slightly difficult to find (push the 'cupboard' doors to find it. The glass walled shower in the middle of the room was hard to miss. All of the staff were friendly and I imagine the rooftop pool will be amazing in the summer. Recommended.", "Date": "January 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Geneva, New York", "Title": "“Not bad”", "Author": "marc w", "ReviewID": "UR123011907", "Content": "Nice boutique hotel where they give special attention and great attention to guests, enjoyed the city and it's atmosphere but didn't have a good night sleep not because of the hotel but because of our neighbors having some fun. Staff is really friendly and guest orientated. They would cut themselves into pieces to answer your requests. Great service, good location will be back for sure", "Date": "January 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UAE", "Title": "“stunning and sexy, I loved it”", "Author": "thunderdownunder", "ReviewID": "UR122442967", "Content": "From reception on a mezzanine, to chilled lime water, this was one sexy boutique hotel. It's Mr. and Mrs Smith, which are a fabulous collection of hotels, basically a referral program. Room was very funcky with all the mod cons, no bath my ONLY gripe. Breakfast was buffet and a la carte, and scrummy, the bacon was sensational. Service in concierge and front office and the Venezuelan Duty manager were fantastic, really really friendly. Internet included in the rate, I loved that. Location, couldn't be any better, so central. Housekeeping was exceptional, with different pillow chocolates every night. Overall I was uber impressed, praying for a bathtub upgrade next time I stay. Thank you Ohlaa", "Date": "January 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Antwerp, Belgium", "Title": "“Good location”", "Author": "Lierke", "ReviewID": "UR121826042", "Content": "We stayed for 4 nights in the junior-suit, a bit noisy at night but it was a beautiful room. The breakfast was very good. The pool was out of orde due to maintenance... The hotel opened this year in February, the service is at the moment of a 4 star hotel. Very good location!", "Date": "December 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wendover, England", "Title": "“Great location, very boutique”", "Author": "Dave_Ball2007", "ReviewID": "UR121336915", "Content": "Only stayed the one night so a flying visit. Check in as expected, lady said my bags would follow and true her word they appeared 3 mins after I got to my room and that never happens, very impressed. Standard room with a large bathroom and decent sized room nicely laid out with plasma tv and minibar. Beds are a little hard and actually seemed a little small (had twin bed). Bathroom was great, but I might have got a disabled room (no 114) as the shower was set for someone no taller than a dwarf! Had to stand with the shower head in my hand so not ideal and actually a little bit of a pain after a long day, I'm 5ft 7\". Generally nice room, shower a pain so worth checking with the hotel beforehand. Bar nice, but lacked atmosphere even with one of the best barmen in the world, so they told me. Max was great, but no one in the bar so felt I had to go to bed. Would stay again as great location, worth about £140 a night €150 i think and I work in the travel industry. Not sure its 5 star though, has a nice view from the terrace and a plunge pool so great for the summer.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great location, friendly staff, relaxing and quiet”", "Author": "Georgeksmith", "ReviewID": "UR121082447", "Content": "A great place for a relaxing stay in the ity centre", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bangalore", "Title": "“Beautiful Experience”", "Author": "Harsingar", "ReviewID": "UR120890961", "Content": "Stayed 2 nights in Nov 2011. Excellent service. Excellent Bar, both Max and Santamaria were welcoming and a treat to watch as they made exceptional cocktails and handled the whole place between just the 2 of them. Restaurant was great too (food and service). Excellent location. You can walk almost everywhere and for further places, connections to public transport is very good. Concierge was helpful and knowledgeable. Nice architecture. Overall an unforgettable and beautiful experience.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "huddersfield", "Title": "“perfect in every way”", "Author": "bizzybeeHuddersfield", "ReviewID": "UR120868230", "Content": "from arriving to departing the staff were impeccable.rooms were beatifully designed with great features.the hotel just made our visit so much more enjoyable.anybody who doesnt like the ohla hotel does not appreciate the word class,because i could not find fault.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "South San Francisco, California", "Title": "“Can't wait to stay here again!”", "Author": "apple_tini80", "ReviewID": "UR120484154", "Content": "Our company booked this hotel for MWC 2011. I was actually the very first guest to stay here. Yes.. I was #1 on the guest book! We checked in on the very first day it opened and every one was super nice and helpful. The restaurant and the bar had pretty good food. The rooms are spacious and swanky. I love the shower in the middle of the room! Overall the hotel was nice, modern, and clean. The staff was very nice and helpful. They even gave my co-worker and I a going away gift for being the first people to stay there! I can't wait until February of 2012 (MWC again!) to stay there again!", "Date": "November 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Five Star Hotel with Five Start Service”", "Author": "Phil B", "ReviewID": "UR120384720", "Content": "Stayed here for the last two nights of our honeymoon. Beautiful hotel with modern rooms and decor in a great location. The restaurants and bar in the hotel are both very high quality. The roof top pool and lounge is an added bonus. Only potential negative is the shower is all glass so if you're staying with someone that is not your partner, prepare to bare it all!", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Scotland", "Title": "“Loved it!”", "Author": "Traveller13Scotland", "ReviewID": "UR120248271", "Content": "Loved this hotel! Great location, excellent food at reasonable prices, fantasic cocktail bar. The room had a shower in the middle of the room - quirky and not as uncomfortable as you may think, given that it steamed up really quickly! Bed was incredibly comfy and both my husband and me really chilled out on our short, 3 night trip. Negatives would be that the staff in the bar area were sometimes inattentive. My main bug-bear was when we went to the tapas restaurant at 11.30 and the manager told us that it was soon to shut - it was advertised as open till 1am. He looked very perturbed by our 'late' arrival and told us that there were many things not on the menu - still that which we did order was unproblematic. I got the impression that he thought we had wandered in off the street and when we lay our room keys on the bar the service improved. Still, not what you expect from a 5* establishment. That said, I would definitely return to Hola on future trips. Very recommended.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Part Very Good. Part Bad.”", "Author": "Malcolm072", "ReviewID": "UR119759039", "Content": "The hotel is very mod. Possibly not a first choice for our age group. First the good. Excellent location, very close to Palau de la Musica and Cathedral. Stunning roof top terrace, guests only, with great mojitos. Groundfloor casual restaurant has very good food in tapas form. Unfortunately the night we wanted to dine in the main restaurant, Michelin 1 Star, it was closed. The junior suites are very comfortable and spacious enough for a modern hotel. Cocktail Bar impressive. Staff very good. The Bad You cannot open the windows to let fresh air in. Air conditioning only. The bathrooms are open plan to the living area emitting drain odours when the air conditioner is not running. So leave the air conditioner on even when not in the room.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Yorkshire", "Title": "“Nearly perfect!”", "Author": "Birdies_11", "ReviewID": "UR119328276", "Content": "Stayed 4 nights - so we had plenty of time to assess the hotel. Concierge - excellent - they will listen to your needs and advise well. Breakfast - very good, Tapas - absolutly excellent - sometimes it seems as though you are not venturing out but the food was outstanding and reasonably priced- don't waste the opportunity on your doorstep. Location - fantastic - next to metro - metro is very easy to understand and use. The Hotel is easy walking distance to beach, best restaurants, Ramblas, shopping, Gaudis architecture. Rooms were exceptionally clean, well finished and contemporary- we had a Design Room which was adequate in size , excellent shower in the middle of the room - people whom want privacy when showering need to request a different type of room. If you are new to Barcelona - we quickly got our bearings by going to the rooftop area to view the city. We highly recommend this Hotel and it has only been open since Feb this year. Very minor points against - cant believe they did not promote the michelin star restaurant. Sometimes contemporary is not the most practical - ie no plug for sink and little too dark to shave", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "long island, new york", "Title": "“Out of 10 I give it an 11.”", "Author": "rocketdog52", "ReviewID": "UR119138069", "Content": "We spent 2 nights at the hotel, Sept 30th and Oct 1st, everything was spot on fabulous, the decor elegant with a hip vibe, the food was excellent, best coffee in the world! Concierge Albert and his staff could not have been more friendly or better informed, an allover delightful experience.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Innsbruck", "Title": "“Great Hotel & Location”", "Author": "Brunogeniesser", "ReviewID": "UR119056050", "Content": "Really loved the room. Concierge Mattheu was very helpful. The bartender made drinks with such a precision and spectacle, I have never seen anybody ever. They were delicious too. The lobby is just ok, almost a little retro feeling. The check-in however was annoying as they only had one person taking care of several guests. The lady herself was nice though. Service altogether was great. My dad went to the pool and thought it was tiny. The location was very convenient. I would definitely go back, mostly because of the room and location.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Great Hotel!”", "Author": "Robert H", "ReviewID": "UR118977186", "Content": "We checked into the Ohla Hotel on September 23, 2011 for a good night's rest before we embarked on our Mediterranean cruise and we were not disappointed! The hotel is in a great location and not far from La Rambla (Barcelona's touristy street). The exterior of the hotel is beautifully done and the interior was interesting and funky. The staff were courteous, helpful and spoke English very well. The rooms are spacious, well decorated and well maintained. The in-room dining was well above average as was the restaurant and bar area. If you are looking for five star accommodations in a great location in Barcelona; look no further!", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Basel, Switzerland", "Title": "“Ohla was oh-my fantastico!”", "Author": "H2where", "ReviewID": "UR118567944", "Content": "My friends and I met here for a fabulous reunion weekend, and agreed the place is just delightful. Great location, outstanding restaurant, spacious rooms, swanky bathrooms, and a rooftop pool and bar / terrace that overlooks the Barcelona skyline, down to the sea. Bliss.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Go!!!!!”", "Author": "Jacobwilliam", "ReviewID": "UR118557271", "Content": "Great tapas, this place is a must go to, try the confit of lamb neck fillet, and steak tartare is just fantastic .can't wait to go again next year.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Rooms great, service great, public areas poor”", "Author": "Bayswatertravellers", "ReviewID": "UR118550814", "Content": "We stayed in Junior suite which is well appointed with seating area, extensive wardrobes, spacious and functional modern bathroom. The tub was deep and a big shower with overhead shower or hand held. Towels and bedding excellent and in room tea and coffee facilities. The television is fixed to the wall and not able to be angled for different viewing positions. The mini bar is extensive and very expensive. We turned right at the front corner of the hotel into a small foot traffic only street next to the hotel and found many eating options. We did not eat at the hotel. We missed having a comfortable communal seating/lobby area where you can sit and have coffee, read the paper, or be sociable. I found the hotel a little more like a serviced apartment building in this regard. The staff were really good, pleasant and a strong point of the hotel. Sound travels up to the rooms from the street, which is busy even through the night.", "Date": "September 25, 2011"}, {"Ratings": {"Overall": "5.0", "Value": "5", "Service": "5", "Location": "5"}, "AuthorLocation": "North Bucks", "Title": "“Excellent, chic restaraunt”", "Author": "grumpyguts", "ReviewID": "UR118316724", "Content": "We did not have the pleasure of staying at this hotel, but did enjoy wonderful Tapas for lunch today. The entire meal was beautiful Lly cooked and very plateful, staff were polite and courteous and the entire experience was a treat. The ambience at lunch is one of chic, stylish cool and our party of 10 was thoroughly impressed. The restaurant was air conditioned and gives the chance to watch the world go by while enjoying their finest fare. This one is recommended!", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Limpopo South Africa", "Title": "“Really feel the City vibe”", "Author": "Kevin W", "ReviewID": "UR117790858", "Content": "great hotel, service, rooms, staff, and a fabulous location to enjoy all of Barcelona's delights, great chill out roof terrace(even if the mojitos are way over priced) funky roof top pool, with glass sides, makes interesting viewing of some guests antics in it. Car parking is also too expensive at 30 euros a day, but overall a great place to base yourself and enjoy this incredible city, i would reccomend to avoid Las Ramblas, tacky dirty smelly full of pickpockets and hookers, instead hit Paeso El Born, very cool great bars, restaraunts and shops. If you like football it is worth every euro to see Barcelona play at Camp Nou, obtain ticktes from atourist info office, all very easy, cost determined by oppostion, so not cheap, but incredible., For a eating experience try Comerc 24....... Calle Comerc, ex El Bulli.", "Date": "September 7, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Waterloo, Canada", "Title": "“Perfect Location”", "Author": "Lester519", "ReviewID": "UR117500492", "Content": "This new hotel is situated right where you want to be. Walking distance to everything. Staff is very helpfull and friendly. Price is on the rich side but well worth it compared to other hotels in Barcelona.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent Service, Fantastic Room, Brilliant Location”", "Author": "IanH186338", "ReviewID": "UR117468930", "Content": "This was by far one of the best hotels we have ever stayed in. The location was perfect, walking distance to the Ramblas (5mins), seafront (15 mins) and enough shopping to tire anyone out (starts on your doorstep). The hotel staff were excellent. We had an issue with the lights in our room and this was sorted out quickly and efficiently and you could not fault the team for ensuring that our stay was not disrupted, this type of excellence is service is hard to come by and the Ohla hotel surpassed itself. The concierge was excellent helping us miss all the queues to the key sites, definitely speak to them before heading out. We would highly recommend hotel to friends, looking for a luxurious and relaxing break.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“The Best Possible location !”", "Author": "Sally_282", "ReviewID": "UR117003312", "Content": "Certainly a 5 star hotel. Nice designed rooms with minimalistic decoration. Loved the bathroom amenities. The service was very polite and willing to answer or find solutions to occurring problems. The location is IDEAL! Right next to metro station and within a walking distance to Barcelona downtown. We hope we'll come back again!", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Merion Station, Pennsylvania", "Title": "“Great Hotel!”", "Author": "Rona_33", "ReviewID": "UR116771048", "Content": "We recently vacationed in Barcelona at the Ohla Hotel at the end of July and truly enjoyed our stay. We booked the Design Deluxe room, and were given a room on the 1st floor which was not optimal due to the noise from the metro and the noise from the street. I immediately asked reception if they could switch the room, but was told they were completely sold out. But after being awoken the next morning at 8am from the noise I called reception and they were extremely accommodating moving us to the 6th floor and even let us look at the room to make sure we were happy before making the change. The hotel is in a great location in the Barri Gotic neighborhood with an extremely friendly staff. The decor is modern and clean with a fantastic roof top deck with incredible views. I would definitely stay at the Ohla Hotel on my next visit to Barcelona!", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Great Location, Great rooms!”", "Author": "Traceratio", "ReviewID": "UR116754919", "Content": "This is a great hotel. The rooms are really different from what you have seen. We stayed on the Junior suite room which had a great view of the road and was very sunny. The shower is exposed to the rest of the room and so is the bathtub. I believe that the room meets more the needs of a couple than a family's. Rooms were extremely clean and the cleaning staff did a really thorough job. I read some reviews saying that staff is not that good. I strongly disagree. Whatever we asked was delivered fast and the staff was very polite. Information was provided regarding restaurants in the town, bars, tickets for theaters and so on. Beds and pillows were really comfortable and felt great. Mini bar was very extensive but ridiculously overpriced. They charged 8 euros for an energy drink and 4,75 euros for 330 ml of still water. Cuisine was very good and atmosphere on the gastronomy restaurant was really fantastic. A bit overpriced again but it worths having a dinner. The terrace is unique with great panoramic view and nice lounge atmosphere at any time (day or night). Location is perfect because while you are in the center you are just a 5 minute walk from the main touristic street which is La Rambla. Also while it is on a main avenue the hotel is really quiet due to good insulation of the windows. Overall a great choice for Barcelona we were totally satisfied by our stay there.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bucks", "Title": "“It's a great hotel in a perfect location”", "Author": "RosieBucks", "ReviewID": "UR116629754", "Content": "I took my mother to Barcelona for a few days and stayed in Ohla Hotel. The location was perfect - it's on the edge of the old part of the city and only 20mins by taxi from the airport. It's a great area to walk around, particularly for the older generation as it's mostly flat. The hotel is only 10mins walk to the beach through small, winding and quaint streets which comprise lovely small boutique shops, cafes and bars. The main shopping streets are close by so if you want to shop for clothes you can go to bigger high street shops (Zara, H&M, Mango etc) although I preferred the smaller boutiques. Take care when walking around Barcelona - it's well sign posted in the guide books but there are pick pockets waiting to take advantage of the tourists - we saw it first hand in our first stroll out in the streets. Just be sensible when you're out and keeping bags close to you. The great thing about Ohla is it's bar and pool located on the 8th floor roof terrace. It's breezy, has stunning views across the city (including the port) and has lovely seating where you can relax to soft music. After a few hours walking the streets it was great to go to the pool and sunbathe with a glass of wine. It's open in the evening too, so pre dinner drinks are a must. It's also the perfect way to kill those last few hours waiting for your flight home. Breakfast was great if you don't want to try the local food. If you choose the hotel buffet then book in advance as it's a little cheaper than turning up on the day. The only down side to this hotel is that if you aren't travelling as a couple then there is very little privacy in the hotel rooms. As you would expect in a new boutique hotel, it's decoration is very stylish - and that means the lovely big shower is encased in a glass cubicle within the bedroom. If you're not travelling with your partner then you may not like the lack of privacy! I would recommend this hotel to anyone - service, location and facilities were perfect and even though we were on the first floor there was no noise from the street below.", "Date": "August 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Beautiful hotel, poor service”", "Author": "djcee", "ReviewID": "UR116479018", "Content": "We kicked off our honeymoon in this beautiful recently renovated hotel in our favorite city. The staff were lovely, the food in both the restaurants was excellent (one of them is one star Michelin) and the roof terrace was lovely. However their ability to answer the reception phone and to service rooms was poor. For me this is basic stuff. If I thought that this was just a one off issue I would happily say so but in fact my friends who were also staying there encountered the same issue. It is just not acceptable for a five star hotel not to answer the phone and then when you go down to reception to find it empty. It is also not acceptable to request a room to be cleaned and to come back three hours later and find it not done. When I raised the issue upon check out I received only an apology and was informed that \" we are only open 4 months\" Extremely poor response. I was so disappointed it's a really lovely space.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Very cool, excellent food, excellent position, excellent cocktail bar”", "Author": "Sedgemore1", "ReviewID": "UR115715086", "Content": "A brand new hotel with an excellent location and excellent facilities. They have headhunted the best restaurant and bar staff from around the World, (make sure you get Max to make you a Martini). It may be considered expensive, BUT, you do get what you pay for and therefore I would consider it excellent value for money. We will be back without hesitation.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Enjoyed our stay”", "Author": "electro", "ReviewID": "UR115432155", "Content": "As one other reviewer mentioned - the longer I stayed the more I liked it. The rooms were minimalist but had everything you needed. Comfortable beds, beautiful linen, great shower and shower products, very quiet, turn-down with a chocolate, free wi-fi. We used the rooftop pool and were lucky enough to be the only ones there as it is a small pool with not a lot of area around it to sit or sun-bake. The concierge service is what made our stay at the Ohla great as well. Mathieu and Albert were very helpful and delightful to deal with. The location was great. Close to Las Ramblas but without the chaos.", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "1", "Service": "3"}, "AuthorLocation": "London", "Title": "“Nice location, bad value, will not be back”", "Author": "tieler", "ReviewID": "UR115040122", "Content": "I think you have to take into account that this is a new hotel and they are trying very hard to be different. We made the mistake of not doing enough research and I we could have got much better value from a four star hotel in the same area. The location is great, right in the middle of the old town. The concierges were okay and tried hard but didn’t really know much about Barcelona and didn't have much advice by way of restaurants to eat in. The hotel is trying very hard to be minimalist and different but it really doesn’t work and makes for a very impersonal experience. We booked a junior suite but in reality it was just a small room with a shower and bath in the room! The mini bar and snacks are very overpriced and the room was noisy from the street despite being on the 4th floor. The roof chill out area with pool was very disappointing, very small pool and no atmosphere at all. Overall we were disappointed, I think it would be a good hotel for a business traveller. If you are paying, go elsewhere! Nice hotel but tried way too hard and cost far too much, sorry won’t be back...", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dubai", "Title": "“Fabulous modern funky hotel with great staff and great amenties”", "Author": "sgerull", "ReviewID": "UR114859737", "Content": "We had 4 nights at the Ohla and we were very impressed. The hotel is very clean and modern with everything you need to make a stay comfortable and enjoyable. One of the criteria for choosing the hotel was for the swimming pool...which is pretty small, but the pool deck is a lovely area..(they could do with a few more sun lounges though) The rooms have very comfortable king sized beds and are quiet and the hotel is within walking distance from most major attractions, or easy metro travelling. The hotel conceirge were very professional and helpful. Fabulous cocktails in the downstairs hotel bar The only thing I didnt personally \"like\" about the room we stayed in was the \"Open\" shower....its only a room for couples.... We would definitely return to this hotel!! Really enjoyed our stay", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "UK", "Title": "“What a find!”", "Author": "george_51", "ReviewID": "UR114057037", "Content": "Found this hotel via Trip Advisor and used it for three days after leaving a cruise ship in Barcelona; arrived at 0900 but the very helpful concierges were able to safely store our bags until we could check in. Great location about five minutes from La Rambla so is much quieter than hotels on that (noisy) road plus it is close to Plaza Catalunya for the hop on/off buses and there is a metro station almost outside the hotel front door. Ultra modern hotel with very high quality towels, bed linen, showers etc and spotlessly clean but best of all are the helpful staff who made our short stay so enjoyable. We were given help with where to go, where to eat and finding our way around plus the bar staff and restaurant staff were helpful too; even managed to get a late checkout which helped with our last day. Breakfast and a lunch we ate there were all good and by Barcelona standards very good value. Has a decent size gym for this size of hotel but best of all a roof top pool and area to chill out - not a large pool but ideal for a cool off and a haven of peace - great place to chill and it even has bar service! All in all faultless and cannot recommend highly enough.", "Date": "June 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Princeton, New Jersey", "Title": "“Interesting and different”", "Author": "ryanflyin", "ReviewID": "UR113819638", "Content": "My daughter and I spent four nights in the Ohla after traveling from Madrid. I had read previous reviews, so I was prepared for the 'interesting\" shower location!! My daughter had a puzzled look though! I love the fact that everything was new and had a bit hipflavor. This hotel was not my first choice, howevever the roof lounge area was my incentive for booking the Ohla. I did use it each day to relax and read for an hour. The concierge staff was very helpful. I too was not impressed with the check-in staff. We did have some difficulty with our hair dryer. It kept going out on us. Finally we were given another, however, it must have been more of an electrical issue. The bar and drinks were a real show!! Met interesting people and the mixologist's creations were impressive. Someone else mentioned the card-key being necessary for lights. For me this was not the first time I've experienced this in European hotels, so it was not an issue. To me the great thing about traveling to other countries is things can be a bit different. Chalk it up to a learning experience!!!The location of the hotel was perfect. We were able to walk everywhere. I love the winding,old streets. Barcelona is a lovely city and I feel as though I just touched the surface in four days. If I ever return I would try another hotel just to get another flavor, not because I was dissatisfied for the most part.", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Great hotel in the centre of Barcelona”", "Author": "DavidRebecca", "ReviewID": "UR113378579", "Content": "We have just returned from a week-end in Barcelona. We stayed at the Ohla and had a great time. The highlights included: - The great cocktail bar downstairs - the gold leaf topping was a real plus! - The brasserie restaurant - pop in for Tapas, a little pricey, but worth it - The hotel room. Well designed and well finished. - The pool bar - head for the roof - The central location - 5 mins walk and your on the Rambla, 10-15 mins walk at the beach - Friendly, professional service We'd stay there again for sure.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tallahassee, Florida", "Title": "“Service Needs Improvement”", "Author": "Conan8540", "ReviewID": "UR112887876", "Content": "Although they claim to be a 5 star hotel, I would say it is more of a 4 star property. I've never been to a 5 star hotel that does not offer turn down service in the evening. The design of the rooms are very modern and unique with the shower being located in the middle of the bedroom. However, this didn't work too well for our teenage daughter and son who each wanted their privacy. The shower also leaked all over the floor of the room. I found the concierge staff to be very friendly, but not very knowledgable and I found the reception staff to be somewhat rude. I understand the hotel just opened in February, but they will need to work out the kinks in both their service and rooms before I would stay there again.", "Date": "June 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "dublin irl", "Title": "“not such a positive experience!!”", "Author": "boyle4", "ReviewID": "UR109556627", "Content": "we have returned from a trip to barcelona which we split between the wonderful Neri hotel(amazing experience) and the Ohla..we were there to celebrate my husband's birthday..so,as it was my treat to him and wanting everything to be just right,I had phoned the hotel before booking on their site,explaining that I wanted a jnr suite with all of the trimmings as this was a birthday treat..(they did kindly leave a bottle of cava for my husband)however the room was not the jnr suite as seen in the photos,it was small and on the 1st floor and no matter how brightly the beautiful Barcelona sun was shining,it remained dark in room 106..rather than a view of the city,we could see only traffick and the rumble of the metro shook our foundations every few minutes..I returned to reception straight away with the very courteous concierge(who understood my issue),only to be told by the surly receptionist(who asked the concierge to tell us and barely looked up herself)that they were booked out and that we could not move tomorrow to another suite as she had grand prix visitors staying in them from the thurs(the day we were leaving)??this made little sense as we were there now! but she was not moving us..she said we could downgrade though(wouldn't that be nice!!!!}we were not happy,but it was hardly a third world problem and we returned to the room and got on with the holiday,though it left a very sour taste..I was awoken early on checkout day by the traffick and metro rumbling,so I decided to go and speak with the front of house mgr,who had left the obligatory\"we hope you enjoyed your stay\"note.she was a very polite girl who listened,but insisted she had not been informed of our complaint,and most annoyingly of all,told me had she known \"we could have moved you to a much nicer jnr suite,on your 2nd day\"thus proving all is not equal in this establishment..turns out ours was the smallest and darkest of rooms in its category..she said the general mgr would be interested in speaking with me as customer service is so important to them,but surprisingly!that did not happen,nor did the email/phone call I was promised from her..I don't enjoy writing such a negative review,but feel it necessary,it really seems that while we were there they had much more important guests on their minds,ie. the grand prix visitors whom the receptionist was saving the better rooms for!!!!..on the positive side the concierge team are really wonderful as are the cocktails..the rooftop pool is great(though I've seen better)..I'm sure we would have had a much more positive view of this hotel had we indeed been given \"one of their nicer jnr suites\"the one I'd booked ....", "Date": "May 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Knoxville, TN", "Title": "“Excellent service with comfortable surroundings!”", "Author": "susieqsnc", "ReviewID": "UR109337758", "Content": "My husband and I stayed at the Ohla hotel May 9th (the night before our cruise) and came back for one more night (22nd) before flying back home. We really enjoyed staying at this hotel. It's modern, VERY clean, comfortable, quiet,and in a good location. All of these things are important but what stood out about this hotel was the service! I was especially impressed with the concierge. The guys were exceptionally helpful and went way beyond their \"obligation\" to me as a guest. Besides giving advice about the area, they helped fix my computer when I was unable to get online. Even when things were busy they made time to help me out. Customer service is evidently a high priority with them. Albert Meier is over all the concierges and was helpful in setting up some sightseeing for us among other things. Daniele Abbate and Beltrand Greome helped me with my computer problems in addition to seeing that our luggage was brought immediately to our room. All three of these men were genuinely concerned, gracious, and did everything they could to make us feel at home as well as feeling special. We had a very nice room the first night, but we got a very different room on the second night. They put us in a beautiful suite with a great view, lots of room, and many \"extras\". I just can't say enough about the wonderful treatment we received and I highly recommend this hotel if you want to spend some time in Barcelona.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Wonderful service in a great location”", "Author": "raynes", "ReviewID": "UR108157469", "Content": "Our first time in Barcelona and we chose the new Ohla Hotel. They say new hotels have teething problems. Not this one - the welcome by both concierge and check in was friendly and very helpful. During our stay nothing was too much trouble. If the concierge desk didn't know the answer to our endless questions they found out (however their knowledge was excellent). The hotel is located in the beautiful gothic area - a short 5-8 minute walk to the Ramlas through beautiful cobblestones streets. The rooms are very functional, clean, free wifi and iPod docks - for some it may take a short time to get used to the open shower in the middle of the room but it's a great shower. Room was serviced beautifully daily. We could not fault this hotel. Food services excellent. If you are looking for old style rooms this is not for you but in saying that I would highly recommend hotel Ohla.", "Date": "May 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Magnificent facility, superb staff and unbeatable location - Seriously stop looking elsewhere...”", "Author": "Celticdancer", "ReviewID": "UR107157404", "Content": "From beginning to end the Ohla hotel superseded all (I must admit because of the pictures and website) my already high expectations! The staff was superb - welcoming, warm and overwhelmingly friendly yet genuine and gave us plenty of great to-do suggestions. The attention to details of the facilities, rooms and service gives you the warm fuzzy feeling and the location is simply unbeatable. Barcelona is a magnificent city and the Ohla hotel was like the cherry on the parfait and made our stay a wonderful experience. We didn't have breakfast at the hotel with the Ohla being located on Carrer Comtal there were so many wonderful breakfast bakeries and coffee shops to enjoy each morning. The room was clean lined zen-trendy, ridiculously spacious and we had a retina stretching view. I loved the hidden toilet. Finally a designer that understood a toilet bowl isn't really a feature...Barcelona has almost too much to offer and will require a swift encore. I can't imagine staying any were else but at the Ohla on my next visit. For such a new kid in the block I can see them swiftly carving a steady stream of success if they keep it up.", "Date": "May 6, 2011"}], "HotelInfo": {"Name": "Ohla Hotel", "HotelURL": "/ShowUserReviews-g187497-d1940950-Reviews-Ohla_Hotel-Barcelona_Catalonia.html", "Price": "$284 - $482*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Laietana 49</span>, <span class=\"locality\"><span property=\"v:postal-code\">08003</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "1940950", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/d4/17/fe/fachada.jpg"}}