{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Blackrock.Dundalk.Louth.Ireland", "Title": "“Very good hotel in excellent location”", "Author": "Bernie010", "ReviewID": "UR117600898", "Content": "Really enjoyed our stay here. Excellent breakfast. Very clean. Staff very helpful and friendly. Great location. We found the pillows very bad and couldn't sleep very well because of this. They were very poor. Too soft and had to use our robes folded up under the pillows to try to bolster them. Also not having access to the net was a huge drawback and most annoying.", "Date": "September 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Hong Kong, China", "Title": "“Affordable no-frills chic”", "Author": "leevidaga", "ReviewID": "UR115321733", "Content": "I love the location, it is on the route of the popular 100 bus, close enough to KaDeWe, the zoological garden, and a little further, Potsdamer Platz. The hotel is modern, affordable (the long stay rate is only €60+) but you should know what you are giving up. There is hardly any \"hospitality\" to speak of, and the only amenities in the bathroom is an all purpose soap/shampoo/conditioner dispenser. To include breakfast with the room, add €21 more! This hotel is used by airline crews, and tour groups. Very mid-priced chic.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hampshire England", "Title": "“Brilliant Service”", "Author": "Islandtwo", "ReviewID": "UR115206199", "Content": "This hotel might not win any awards for the beauty of the building, but it should for its level of service. Check-in was quick and hassle-free and although it was only 1130 am our room was ready and available. We even received an up-grade to the next available grade. The polite and efficient member of staff (Thorben Witt) could not have been more helpful and gave excellent advice on the surrounding area, trips/tours to take and restaurants. Nothing seemed to any trouble and this applied to all the staff including the room maid and restaurant. For such a large hotel you never felt crowded even at breakfast which had as good a buffet as many 5 star hotels. The smoked salmon/scrambled eggs a particular delight. Our room on the 5th floor was a decent size with a multi-channel (20 in English) flat screen TV. Our one small criticism was the shower, which was fairly weak and leaked under the screen. I was celebrating a signnificant birthday and I was most impressed to find a bottle of \"Bubbly\" and a birthday card in our room on returning from our afternoon walk on the first day. Very nice touch from this impressive hotel! We used the Express Train from Schonenfeld Airport to the Zoologircher Garten stop which took 35mins and cost 3 Euro each. A better bet would have been to buy 2 x Day tickets @ 12 Euro each as this gives you unlimited travel on trains (U & S Bahns) buses and trams for 24 hours from first use. There is a bus stop outside the hotel No 100 takes you into Alexander Platz and the M29 takes you to Checkpoint Charlie. We took the Hop-on Hop-off Circle bus tour which is valid for 24 hours and was excellent with a very good Audio commentary. Note: You cannot get entry to the Reichstag Building unless you give 3 DAYS notice. (Very annoying on a 2 Day break!!) There are a few good restaurants within walking distance from the hotel with the Ambrosius being very good value and friendly English speaking staff. We ate at the Rosada (Argentinian Steak Haus) on the 2nd night and although the steak was very good it was expensive and beware, the steak is all you get. Everything else eg salad, chips etc is extra and they don't accept credit cards which for an expensive place could prove embarrassing. Very happy to recommend this Hotel to anyone", "Date": "July 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Denver", "Title": "“Great value, friendly staff, excellent location”", "Author": "MileHiSteve", "ReviewID": "UR93459216", "Content": "Stayed at Hotel Berlin between Christmas and NY for seven nights. Requested early check in and asked hotel to make dinner reservations for Christmas dinner at off site restaurant via internet and they obliged. There is a nice gym w/sauna which I used frequently. We had double room which was just big enough for two. Room had all of the basic necessities. Skipped pricey breakfast for Cafe Einstein one block away. Many excellent restaurants for all meals within ten minute walk, especially around Nollendorfplatz (U-bahn running 4 separate lines). Excellent transporation at hotel or nearby. Room was very quiet even though on busy street allowing us to sleep late. Hotel was comfortable and good value, $120 per night. Staff was helpful and friendly. No hesitation about going back if I go back to Berlin. Paid to use computer at lobby to check e-mail since I had no device with me. Photos by other are accurate.", "Date": "January 17, 2011"}], "HotelInfo": {"Name": "Hotel Berlin Lutzowplatz", "HotelURL": "/ShowUserReviews-g187323-d1947917-Reviews-Hotel_Berlin_Lutzowplatz-Berlin.html", "Price": "0", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Lutzowplatz</span>, <span class=\"locality\"><span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "1947917", "ImgURL": ""}}