{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Absecon, New Jersey", "Title": "“What's to envy?”", "Author": "Todd N", "ReviewID": "UR127317439", "Content": "The best thing about this hotel is the staff, both of whom I met were very nice. Now, on to the serious problems. Cleanliness: the hallway outside my door was not vacuumed for the 4 days I stayed at the hotel. I know because there was trash of varying sizes -- from very small (pieces of paper and lint) to much larger (several entire tissues wadded up and containing God-knows-what) -- strewn across the hall. Additionally, the trash can outside the elevator on my floor was filled to overflowing and never once emptied during my 4-day stay. Inside the room, a long, dark hair was found within the bed sheets (clearly not mine, as I am bald); and more hair was found inside the tub. The elevator had a relatively large puddle of red soda-like liquid that stayed there as long as I was a guest. State of repair: in a word, the hotel's physical shape is deplorable. To properly close, the door to my room had to be either pushed from the outside to close or pulled from the inside. In either case, the deadbolt did not work as it did not align with the latchplate on the door jamb: that's a bit unnerving. Over the threshold leading into the bathroom there is a thin metal plate that, when stepped on, caused a loud pop. The bathroom door had some kind of trim work running down the length of both sides of the door; however, this trim was curling up at the bottom on both sides. The decorative caps that cover the bolts holding the grip bars in the bathtub would not stay in place and instead continually slid down to the bottom. The trash cans in the breakfast area, which had foot pedals that ostensibly opened the lid, did not work, thus requiring the user to bend down and manually lift the trash lid. The glass front door of the hotel never closes entirely, staying about 8\" open instead. In general: a friend of mine who was staying in another room on a different floor checked out a day early because he saw \"a critter\" scurry across his floor. It takes quite a bit to skeeve me out, but the Best Western Envy managed to do it. The name of the hotel makes me question what anone would envy about someone staying there. The price was reasonable, but certainly not worth the sacrifice of quality and cleanliness.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "New York City, New York", "Title": "“just terrible never again”", "Author": "tony s", "ReviewID": "UR126256878", "Content": "first issue is there is no parking at the hotel nearest pay parking is a block away . not the best area to be walking around with your luggage a block at night. homeless and pan handlers hanging around the front door. someone was smoking marajunia smoking in the staircase. The beds had a sheet a thin blanket and another sheet during a freezing windy 39 degree night. the heating system kicked in at 4 am as loud as jet engine. the bathroom door didn't lock or even stay closed. there was a metal plate on the floor going into bathroom that when u steped on sounded like thunder. wake up call was an hour late. The staff was nice. i find it a shame that Best Western would put thier name to this hotel", "Date": "March 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Wilkes Barre Pa", "Title": "“Spend the money on a better hotel.”", "Author": "lmmygirl102003", "ReviewID": "UR126010348", "Content": "First I would like to say, the staff was very friendly and helpful. As far as accomadations, that was a different story. 1. Inner Harbor is alot further tthen advertised on the website. 2. Only burger king is around as far as a restaurant, no toher restaurants in the area. 3. Our air conditioning would not turn on at all at night, the heat kept blowing out all night long, it was 82 degrees when we finally left. 4. We were never told about breakfast in the morning. Overall, the stay was a nightmare, I will never stay at this Best Western again.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Bronx, New York, United States", "Title": "“Decent Room, Never Again”", "Author": "Gail M", "ReviewID": "UR125962316", "Content": "I stayed two nights in the King bed room. The hotel environment was very nice, the room nicely decoratored and very clean. The price was right too. The hotel security features very good. The down side was the neighborhood. Next door there is a Burger King with an alley beside it and I was not happy to see large rats dancing around in the alley coming in at night. I did not feel safe walking in the neighborhood after dusk. A bus stop is in front of the hotel and many people are kind of hanging around talking loud. It's also very deserted, most of the businesses that are still in business were closed around 6 PM on a Friday night. I am a New Yorker who lives in the Bronx, so I'm not easily frightened. I drove into town and had to park in a lot that's 3 blocks away, carrying my luggage three blocks before I checked in, there's no space for car pull up where you can bring in your luggage. Saturday morning the elevator didn't work so I had to bring down my things down the stairs. It's a good thing I am able. Saturday night when I came in the Hotel desk clerk didn't have the keys for the towel closet, therefore I couldn't get extra towels for a late night shower.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Vancouver, Washington", "Title": "“Not a good choice”", "Author": "CJ J", "ReviewID": "UR124689134", "Content": "I got this hotel through hotels.com... I won't be coming back. The first room they tried to give me had a door that had literally been broken into-- and the repair to the door showed it would have easily been broken into again. The hotel is right by a bus stop (literally in front of the hotel) and you get to hear the busses and honking all day/night. The weirdest part of this hotel is the light above the bed... it is a constantly changing multi-colored strobe light. Honestly, I would get another hotel if I hadn't already paid and have to deal with the pain in the butt hotels.com people.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Louisville, Kentucky, United States", "Title": "“Pleasantly surprised!”", "Author": "LauraJayne3", "ReviewID": "UR123778100", "Content": "I stayed here with a co-worker for four nights while in town for a conference at the Hilton. The Hilton was far too expensive so I did my best to find a reasonably priced hotel that wasn't too far a walk away (we did not have a car during this trip.) The Best Western at Envy (BW) showed what turned out to be a very accurate 13 minute walk from the Hilton, stadium and inner harbor. The BW is a small hotel with small rooms. This has never bothered me at any hotel I've stayed in but if you're looking for a lot of space, be aware of that. The staff was polite and helpful and checkin was quick. Love the room keys - you just waved it in front of a panel on the door to unlock. Beware though - there is a small $3 charge for not returning them at the end of your visit. We had a desk, closet, small dresser -- all the typical furnishings of a hotel room. What surprised me was the mini fridge and coffee maker. Both were used on a daily basis! The sink and hairdryer were outside the bathroom -- something I always appreciate -- and we had a large flat screen TV on the wall with a nice selection of channels. Housekeeping came by everyday and we always returned to a tidy room. The breakfast was another surprise. I usually think of a continental breakfast as a smattering of bagels and some coffee. However, we were offered coffee, tea, orange juice, apple juice, yogurt, mini bagels, mini donuts, toast, english muffins, milk, three kinds of cereal, sausage patties and eggs. I was able to have a protein heavy vegetarian breakfast every morning without spending a penny! Even the dining area was pleasant. Loved the free wifi! There is a bus stop directly outside (sometimes leads to a huge crowd right outdoors) and Walgreens and a coffee shopt are right across the street. So - the downside: only one that I can think of and that was the bathroom. The door was a recycled room door (complete with a defunct keycard lock) and was difficult to latch closed. It also creaked and was situated about a metal panel that emitted a loud \"clunk\" when accidentally stepped on.... troublesome when you're sharing a room and trying not to wake the other person when getting up to shower or use the bathroom. But the bathroom door was just one small hangup at an otherwise lovely and affordable hotel; we both very much enjoyed the stay and I would certainly consider staying on a future visit!", "Date": "January 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester, New Hampshire", "Title": "“great deal”", "Author": "henry882", "ReviewID": "UR123299862", "Content": "I stay at the hotel for one night. This might be the cheapest rate we got in downtown Baltimore, however the service is very nice. Frontdesk is friendly and helpful, we got free breakfast and wifi which we didnot expect. the hotel is close to inner harbor, convention center. Great Experience! Definitely come back again.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Nice Hotel”", "Author": "Qnhu", "ReviewID": "UR123282063", "Content": "Very nice and good customer services! Will come back and recommended to others.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“OK..for a one night stay”", "Author": "rub41", "ReviewID": "UR123156102", "Content": "My room was pretty small, felt like a closet, had a little musty smell, the furnitures looked nice as did te amenities in the bathroom, but for something that was renovated in 2010, it had some marks around the switches and some on the walls. Breakfast was some eggs, sausages and english muffins. The staffs were friendly & courteous. Parking is a pain, although the hotel claims it has parking, it is actually a nearby (about 1/2 block) paid underground public parking.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newark, New Jersey", "Title": "“Great Baltimore Hotel”", "Author": "Brandon K", "ReviewID": "UR121770239", "Content": "I stayed here for the first 2 nights of my trip to Baltimore This hotel is new, and very modern. I really liked the rooms and the boutique feel to the place. This is not what I expected from a Best Western. Great staff, too. I would definately stay here again.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Dallas, Texas", "Title": "“charged for 4 nights, when I only stayed 2”", "Author": "s j", "ReviewID": "UR121424028", "Content": "Aside from the entire front desk staff being incredibly incompitent, rude, & unprofessional. I was charged for 2 additional nights 2 weeks after my stay. It took me 25 days to get a credit & I was repeatedly \"schooled\" by the staff as to what happened and that they were positive I had already recieved a credit. Never once an apology. Absolutely horrible.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hollywood, California, United States", "Title": "“Convenient location, Decent Rooms”", "Author": "MissFranberry", "ReviewID": "UR119845188", "Content": "I spent 3 nights at this hotel in July 2011 and I was surprised to see clean and modern accommodations in a vintage stone building. While the neighborhood can seem a little rough around the edges at night, safety wasn't a big issue for me (as a female travelling alone). WiFi was free, front desk was friendly, and prices were great. They do not offer parking, but there is a lot a block away. Breakfast wasn't anything special, but the location was ideal for walking to many bars and restaurants. For adventurous walkers, the Edgar Allan Poe grave, Mt. Vernon, and The Brewer's Art are all within walking distance as well as other Baltimore points of interest. There are bus stops right outside, too. The bed was comfortable and the writing desk was convenient. Bathrooms were okay, but could use a little update (low water pressure). Checking-in and out was very prompt. I'd stay here again. 3.5 out of 5.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Okay Hotel”", "Author": "Travel_Maverick182", "ReviewID": "UR119232689", "Content": "The location of this hotel is great with great restaurants nearby and accessible to everything else. The room was clean and nicely decorated. The hotel did not have a microwave which I found lacking. Otherwise decent value for the money", "Date": "October 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Brackley", "Title": "“Mixed opinions”", "Author": "gwinnBrackley", "ReviewID": "UR116883380", "Content": "The hotel was very central and there is a bus stop outside which was no problem ,although as in all big cities there was a need to be careful and there were some vagrants around.The room was a good size with a great kingsize bed. The lighting feature interesting caused me to smile. Some of the staff were helpful. The breakfast is on the lower floor and fairly basic but there was an option of hot sauage patties.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "1.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Torrington, Connecticut", "Title": "“If your mind is not made up, choose the OTHER hotel...”", "Author": "b3nster", "ReviewID": "UR116407765", "Content": "If you are looking at reviews for this place, odds are you are like me and weighing your options. When I read all the negative reviews, I figured I would still have an open mind, and that I generally give everyone the benefit of the doubt. That said, spend the extra money and stay somewhere else. There is no parking, and this description isn't very clear about it. The rooms are not clean. A previous guest (let's hope if was the one before me) left some food in the fridge and as a result, the entire room smelled. I politely asked the front desk to arrange for housekeeping to tackle it the next day, was told it would happen but it never did (over a several night stay). Finally, I bought some febreeze and cleaned it myself. Never heard a vacuum running. Fit and finish is what you would expect at the price. There is an odd metal piece of flooring near the bathroom which dents in and out when you walk on it. The rooms are very small, and the air conditioning is lackluster. The elevator was out of order for a good portion of my stay, which can get old when you are on the 6th floor. I see lots of concerns about the neighborhood on here. There are almost always people hanging out in front of the hotel, but they never bothered me or made me feel endangered. The bigger issue for me was that it wasn't really as close to what I came for (Inner harbor, ballgame) as the maps had led me to believe. The staff was never rude, but they always seemed like there was somewhere else they wanted to be (you get what you pay for to a point, but \"not rude\" and \"friendly\" are two completely different things). The front desk is really there to check you in and out, don't expect much else. Nobody books a room at a Best Western expecting the Ritz Carlton. However, with all the competition out there, I doubt I'll go to another Best Western in the future, and that stems directly from my experience here.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "", "Title": "“Comfy Chic and we'll be back”", "Author": "mikey2032", "ReviewID": "UR115921064", "Content": "Refurbished old hotel/boutique hotel feel but with nice amenities in a fairly central location (right near the hop on, hop off free busses). The bed was very comfortable, linens upscale and the shower was small but LOTS of hot water. Only \"issues\" were that there is a city bus stop right at the hotel's entrance and , if you are on a lower floor (we were on 2) you can hear the busses rev up early in the AM. The only other \"issue\" was that they ran out of many of the breakfast items about an hour earlier than the breakfast was scheduled to end (10 AM). I am not a big breakfast person but I would have liked a glass of juice and a fresh pot of coffee. When Staff was asked about the lack of food, he just shrugged as if to say \"you snooze, you lose.\". In all fairness, the hotel was packed with baseball fans and they probably didn't anticipate so many for breakfast. But still...I'll go back.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Haifa", "Title": "“To stay and to forget - nothing special”", "Author": "FighterPete", "ReviewID": "UR115766164", "Content": "Definitely not as many stars as stated. Basic breakfast with plastic cutlery and plates. Good location, but the street around is dirty. Safe deposit box promised, but doesn't exist. Room is clean and nicely organized, although not new. Noise may disturb your sleep if the room facing the street. AC is also very noisy. Bed is comfortable. Business center with the printer available as well as free WiFi.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Beaumont, California", "Title": "“Definitely won't stay here again!”", "Author": "Dragonfly_Wings_78", "ReviewID": "UR115507844", "Content": "So, I came to Baltimore for a conference and the hotel where the conference is being held was booked, so I found this hotel less than a block away from the conference site. My flight came in very late, and I ended up taking a cab to the hotel from the airport. As we drove up, we passed several cops telling a large mass of pedestrians (at about 1:30am) over the loud speakers on their cop cars, to GO HOME. I walked into this tiny lobby where the night clerk greeted me - by name - apparently I was the only person with reservations who had not checked in yet. He was nice enough, but I did not actually feel safe until up in my room. I laughed out loud when I opened the door though, because of the color changing wall/light fixture. It made me wonder if this was the kind of hotel that a person might rent by the hour, and if so, why was I paying so much! I spent today at another hotel for my conference, and when I came back after dinner (before dark, because I would definitely NOT recommend walking around this neighborhood after dark), I felt a drip on my head as I passed through the room. Looking up, I noticed a wet spot on the ceiling that had not been there earlier. I turned off the AC, and a stream of water poured from the ceiling. I called the front desk to let them know there was a leak, and was assured that someone from maintenance would be \"right up\". That was over 2 hours ago, and I am now going to try and sleep - even though, as someone else mentioned, the AC is incredibly LOUD!!! I would not recommend this hotel. There is no room service, and no restaurants I would feel safe walking to after dark. In fact, I don't feel safe stepping out the front door at night. I would probably not recommend ANY hotel in this area...though, the price here was way better than anything else nearby.", "Date": "July 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "4"}, "AuthorLocation": "Cali", "Title": "“Near inner harbor, in downtown. Rough looking neighborhood.”", "Author": "jay-yo", "ReviewID": "UR115506912", "Content": "Would not recommend taking ur fam here. Rough area. Nice hotel, big room, clean, good service otherwise.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "2.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Great price for the budget traveler but beware”", "Author": "acidrain", "ReviewID": "UR115012196", "Content": "This hotel is located within easy walking distance to the Inner harbor, Camden Yards and the Convention Center. The price compared to other hotels in this area was exceptional. The room, although somewhat smallish was very adequate. As mentioned in other reviews there is a bus stop right in front of this hotel. This made for people congregating on the benches and sidewalk just outside the door. I have to admit this worried my wife. She would not go down and out front without me accompanying her. I thought she was just being overly worried however there was one incident which proved her intuition may have been right. After walking 2 or 3 blocks to a nearby Dunkin' Donuts to get us coffee, I was about to reenter our hotel when a man confronted me. He yelled, \"Look at you with your coffee. You must think you are @#%!%@ special\". I just walked past him with out making eye contact when I felt him turning around towards me. By this time I had reached the front entrance of the hotel and just went on in without looking back. I am sure that this could happen anywhere but unfortunately it happened here and this taints my review. The staff was courteous but not overly friendly. They do provide a breakfast however we never ate it so I can't comment on that. There is a Business center on the bottom floor with 2 computers for visitor use and you can print documents for free. Parking was in a public garage located about 3/4 of a block from the hotel and ran about $24 a night.", "Date": "July 4, 2011"}, {"Ratings": {"Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Panama City", "Title": "“Never made it inside”", "Author": "CoachDub", "ReviewID": "UR114812450", "Content": "We never even made it inside this place. We went to DC, Gettysburg, and Baltimore for a trip and my graduation. I thought it would be great to stay in downtown Baltimore, so I checked on this place. The other reviews were so-so; therefore, I called and asked them about the safety and parking. I was assured that the area was safe and that parking was across the street. We passed it up the first time because the sign is so small and it is crammed next to a dry cleaner. As we drove past, we went into a very sketchy part of town that made us pretty nervous ( if we were only staying there it would not have been an issue, but the area was on our route to the harbor that we would have been walking). So we finally found it, and my wife jumped out only to meet the front desk clerk coming out of the door. My wife asked if we could check in, and the girl said, \"No, I have to run down the street for 15 minutes to get something from another hotel.\" Then my wife asked where to park, and the lady replied \" Over there somewhere but I have never parked there before so I am not sure.\" She then walked off. I kind of felt bad for her because she was clearly in over her head. We called and had our room canceled, after much wrangling, and went to a Hampton Inn near Camden Yards. There were a lot of people out front standing around, and the excuse that I have heard about a bus stop warrants no merit because I pulled up behind two buses and only a few people got on. It may have been okay, but based on the lack of customer service and the discovery of a sketchy area, I decided I was not going to take a risk with my family.", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Philadelphia", "Title": "“Great Location”", "Author": "CRaeC", "ReviewID": "UR113478661", "Content": "Our only problem was that it was dark by the time we got to Baltimore and we ended up circling the block four times trying to find the hotel. Once we did find it though, everything was great. We were able to walk to the harbor and restaurants which saved us a lot when trying to find parking. Our room was very modern and comfortable with really great amenities.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "NYC", "Title": "“Clean, close to all, incredible price.”", "Author": "LOCommishNY", "ReviewID": "UR109674511", "Content": "We had intended to be in Baltimore for a weekend to attend the Preakness. Wound up only staying Friday night but were very pleased with the hotel. True - there are people gathering in front, but as someone else pointed out, it's because it's a bus stop. We were in and out a few times, walked to and from Camden Yards & the Inner Harbor - no issues. The room was immaculate and by all appearances, brand new. While the layout was a little odd and the bathroom a little small, we were more than pleased. Very comfortable bed, nice wall mounted flat screen, free wi-fi, etc. Didn't get to try the breakfast so I can't speak to that. My only negative would be that the curtains stop just a little to short - letting lots of sunshine in a little earlier than I would have liked. Next time - because we definitely will stay here again - I'll just remember to put a towel on the sill before going to sleep. Staff on check in and check out were very friendly and helpful. When we were leaving, we asked if she knew how to get to another hotel where we were meeting friends. Within minutes she'd check it online and printed the directions for us. Definitely a good place to stay.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Newark, Delaware", "Title": "“Great choice when staying in the city”", "Author": "map22", "ReviewID": "UR106135874", "Content": "My boyfriend and I wanted something within walking distance of Camden Yards and Inner Harbor but we didnt want to pay a fortune. I was not expecting such a great hotel! Very modern inside, free continental breakfast and a simple walk to many of the best locations in Baltimore. I do want to address the previuous review that said \"people were loitering\" outside. The hotel entrace is right by a bus stop. There were people out front WAITING FOR A BUS! The previous review made it seem unsafe but that just wasnt the case. There is a 24 hour parking garage at the end of the block and a coffee shop right across the street. The location is ideal. I will definitely stay here again when visiting Baltimore.", "Date": "April 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Ranson, West Virginia", "Title": "“Too bad the location isn't better”", "Author": "MyHonestThoughts", "ReviewID": "UR91960019", "Content": "We stayed at this hotel to attend a show at a local club. I choose the hotel because it was in close to the Metro station. Upon arriving at the hotel it was dark. It is in the downtown streets of Baltimore, their were people loitering outside. We stopped in front so my husband could go in and ask where we were supposed to park. He found the desk clerk sitting in the lobby watching TV & talking on her phone. She told him we had to park down the block in the parking garage, we are not used to being in the city and were not overly comfortable with that. We checked in using a BW Travel Card. The desk clerk was confused by this, which was understandable as she said the hotel had only been open for a couple weeks. I was impressed with the room, EVERYTHING NEW. However, it looked like it had not been vacuumed. The bathroom door was strange, kind of like a vault door. We found out later that the building used to be a radio station. We decided to take a cab to the show because we weren't comfortable walking in this neighborhood so late at night. We got a good night sleep. I was disappointed with the breakfast. It looked like they had the set up for a Deluxe Continental, but there were only breads, a few pieces of fruit and enough cereal for maybe 2 bowls. I think it just wasn't stocked. We were delayed in checking out because they still hadn't straightened out the issue with the Travel Card. The desk clerk seemed inclined to just give it back to me and let me deal with it later. She finally figured it out and we were able to pay the balance and check out. The hotel is nice it's too bad it's not in a better location.", "Date": "January 6, 2011"}], "HotelInfo": {"Name": "BEST WESTERN Plus Envy Hotel", "HotelURL": "/ShowUserReviews-g60811-d1950129-Reviews-BEST_WESTERN_Plus_Envy_Hotel-Baltimore_Maryland.html", "Price": "$114 - $193*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">22 E Fayette Street</span>, <span class=\"locality\"><span property=\"v:locality\">Baltimore</span>, <span property=\"v:region\">MD</span> <span property=\"v:postal-code\">21202-6422</span></span> </span></span></address>", "HotelID": "1950129", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/2c/df/2cdfb4fc95651e3dfcf2fc670290a9db2large.jpg"}}