{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Quite good but could be greatly improved”", "Author": "JaneBR09", "ReviewID": "UR126689427", "Content": "My husband & I have just stayed at Citadines Bastille Marais for a week in March 2012. We had a studio apartment which was not bad but it could be greatly improved by having everyday necessities available in the kitchenette - salt, pepper, sugar, tea, coffee, storage containers, plastic wrap, more than 2 cups, paper towels and facial tissues in the bathroom. The position is pretty good, close to 3 Metro stops and a fabulous market just outside on Wednesdays & Sundays. There are plenty of restaurants in easy walking distance. The room was very warm even with the airconditioner off. We had to open windows when we got back in the afternoon but a bit noisy to keep them open at night. Would stay again if we couldn't find anything else.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Jeddah", "Title": "“Great location and comfortable”", "Author": "xxSushixx", "ReviewID": "UR124443105", "Content": "I'v stayed about 5 days in Citadines, it was really comfortable and compared to Paris rooms, the size of the room was really good the lobby was nice and the staff were really friendly I recommend this Hotel for large group", "Date": "February 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Quite good”", "Author": "eklipse1982", "ReviewID": "UR122800923", "Content": "Period: December 2011 / 3 weeks Hotel&Location: 6 story building, situated on Rue Richard Lenoir, 5 minutes walk from Plade de la Bastille. Room was OK with LCD TV, king size bed, very well equipped (iron &iron board, a small studio-desk) and kitchenette (fully equipped with disches, washing machine, knives and forks, etc). Lots of bars and restaurants in the Rue de Lappe and Bastille area. Facilities: has Internet via RJ45 cable in rooms (100KB max speed), but WiFi only in the lobby. Free coffee and tea in the lobby, the menu for the breakfast was everyday the same. Laundry machines are available 5 euro/wash, 4 euro/ dryer. Phone in room with direct number (not via reception); to call from it a credit card is required at the reception for deposit. The area is quite OK, especially if you are looking for some night life in the bars near by. Rue Richard Lenoir is a wide boulevard with a little green areas in the middle were you can walk or just relax. Sunday and Thursday open market 2 minutes away on this boulevard.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brisbane", "Title": "“Comfortable Stay in Paris”", "Author": "VulcanBrisbane", "ReviewID": "UR122799806", "Content": "The Citadines Bastille Marias was clean, comfortable and well positioned. My family and I (2 adults and 2 teenage kids aged 17 and 14) stayed there just before Christmas 2011 for 4 nights. It had good cooking facilities, close supermarket and metro stations. The staff on the front desk were also very helpful, and helped us translate some accommodation details and book a tour. Geoffery was particularly helpful. There was free wifi in the foyer and free cabled network in the room. The Eiffel tower was partly visible (top section only) from our room window, and Sacre Cceur was in full view.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Goderich, Canada", "Title": "“Good for the price”", "Author": "matthew a", "ReviewID": "UR122787258", "Content": "My girlfriend and I stayed for a week on December 27th to January 3rd. Room was spacious and comfortable. We were supposed to have a double bed but ended up getting two twins pushed together. The kitchen was nice to be able to make breakfasts and store things in the fridge but the lack of an actual oven was frustrating. However, there is a stove top and microwave as well as a dishwasher. There were plenty of dishes provided as well. Was close enough to walk to pretty much everything we wanted to see (about 30 mins to Louvre, over an hour to the Eiffel Tower, and about 20 mins to Ile de la Cite where Notre Dame and La Concierge are located). Bathrooms were big but there are no shower curtains or doors on the showers so be ready to clean up water off the floors when you're finished. Overall we found the hotel staff helpful and polite and we enjoyed our stay a lot.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "surrey england", "Title": "“Very comfortable and convenient”", "Author": "banstead", "ReviewID": "UR121163099", "Content": "Spent four nights in a 1 bed roomed apartment (long weekend). Really appreciated the space and comfort of the hotel. Made for a relaxing break - not being cramped in the usual small Paris hotel room. Well equipped, nice to be able to buy treats and go back for lunch (and to rest the feet!), what a shame the market isn't every day - doubt we'd ever eat out if it was! Very easy to access from Gare de Nord, and easy location to explore the local area. Very quiet, at the back on the top floor.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Good Location, Fine Rooms”", "Author": "catherinejoywilson", "ReviewID": "UR120970061", "Content": "Look, this was nothing special, but it ticked all the boxes for a good price. No lovely views but who goes to Paris to stay in a hotel room all day?", "Date": "November 23, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Southend-on-Sea, United Kingdom", "Title": "“Below Average - Avoid if on business”", "Author": "Edward J", "ReviewID": "UR120720280", "Content": "Shower - A dripping tap would be more effective. Mattresses - Almost went out to the streets to collect an upgrade. Wafer thin. Corridors - Stink of cigarette smoke. Decor - Eastern Bloc circa 1971. TV - Turns out this is an 'apartment hotel' so don't expect to watch the TV whilst relaxing in bed, it's in the sitting room. Internet - Wired connection only, welcome to 2011, expect to perch on hard wooden seat. Room Service - Non existent. Classic old - Get all the way to room after long journey and key card doesn't work and have to trek all the way back to reception bags in tow. Icing-on-cake - Images of clearly recently refurbished rooms on marketing posters all over hotel. Summary - Personally avoid, never again. You don't get what you pay for (which was a lot), if it wasn't for the fact that my company paid for the room I'd have cried.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Nice and pleasent stay...”", "Author": "rajisavailable", "ReviewID": "UR120147758", "Content": "It was a great experience to have a stay at Citadines. The staff is very well trained for great hospitality and I just had no complaints at all when exitting. I had a seamless and trouble less stay at Citadines France. Also to mention, the staff is very friendly and helpful.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Oakville, Ontario, Canada", "Title": "“Reasonable, Convenient Place to stay in central Paris”", "Author": "Value-Traveller", "ReviewID": "UR119756735", "Content": "This hotel was booked through Air Transat for a 2 day stay with three adults. The suite was composed of a living room with pull out double bed and adjoining small, well equipped kitchen, a bedroom with queen and a bathroom with separate toilet. Everything was clean and well maintained. Staff were friendly and helpful. Indoor, secure parking was available. The location was up the street from Place de la Bastille and near a lot of interesting shopping, restaurants and night life. We took a taxi from the hotel to the Arc de Triomphe, then walked back to the hotel via most of the sights worth seeing (Champs Elysees, Eiffel Tower, Louvre, Notre Dame, etc.). Lots of walking that took most of the day. Considering the location and size of the suite, price was good value.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Good Value!! Safe Neighbourhood, Clean, Close to Supermarkets, Great Stay overall!!”", "Author": "abellem", "ReviewID": "UR119451866", "Content": "I went to Paris with my husband for our First Year Wedding Anniversary. Our budget was limited but staying at this hotel saved us a lot of money because of the following reasons: 1. It had a fully-equiped kitchen which allowed us to make some of our meals. It was also close to a super market and the open-air market on Sundays. 2. It is within a reasonable walking distance to the major attractions like the Notre Dame and the Louvre, and also Jardine du Luxembourg. This apartment-hotel had a lot of positive apects: - very clean - very comfortable and cozy - really feels like home! - room is well-equipped with everything you need, including full kitchen with every basic appliance like fridge, microwave and dishwasher, cups, saucers, pots and pans, toaster, kettle, even a strainer for cooking pasta! - bed is firm and comfortable - bathroom is clean with working faucets and toilet, shower gel and shampoo, enough towels and toilet paper - room has a working safe - large windows that can be opened for fresh air - hotel is close to 2 metro stations: Breguet-Sabin and Richard Lenoir; if you want to go to a station that has more connections you can walk 2 mins south to Bastille Metro - at Bastille there are plenty of shops and restaurants, there are also two roadside crepe places at the corner - area is very safe - on Sundays there is an open-air market where you can find everything from fruit, meats, and pasta to snacks, clothes and even little knick knacks - the staff at Citadine Bastille is very friendly and speak sufficient English - free wi-fi access in the lobby - also in the lobby are free coffee and tea I only have one a couple of complaints: - the fact that the check-in is at 2pm, we arrived at noon from an exhausting flight and had to wait around before we could crash in our room - the area where the hotel is located is pretty dead at night, so around 8 p.m. you will see nothing but trees and the lonely road at night; if you would prefer a more robust and vibrant evening, then you may want to choose something more central Other than that, I'd give this hotel 4 stars! I would definitely return!", "Date": "October 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Good hotel, not too many english speakers on the Staff”", "Author": "AnnaO29", "ReviewID": "UR119309855", "Content": "Great location and very comfortable. 3 subway stations nearby, supermarkets and bakery. We were having fresh croissants every day. We asked for the appartments, it was the best idea we had, they provide you with all you with what you need to cook. Be aware there have only few people who can speak english, I was having difficulties with the security box, neither the person on the phone nor the maintenance person knew english, so I had to practice my french; they did help and fix the problem right away. We are no giving them 5 points because they make you wait too long to give you your room Other than that we for sure would stay there again", "Date": "October 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Yucaipa", "Title": "“\"No Maid Service *Means* NO SERVICE!\"”", "Author": "Julie1952", "ReviewID": "UR118662354", "Content": "We were recommended this apartment/hotel because our daughter was staying with us before she started her fall quarter at the Sorbonne, bringing our family total up to 4. The hotel is well located near the Bastille metro stop and Seinne. Nice neighborhood with a Thursday & Sunday farmer's market across the street. The apartment was small but adequate for 4 people. The internet worked most of the time. A market was nearby to stock our tiny kitchen with baguettes and fruit. However we were told \"no maid service\" for the duration of our 5 day stay. We assumed that no one would come in to clean and make up the beds. No problem. The next day when we tried to exchange two dirty towels that \"We told you No Maid Service!\" As in no change of towels included unless you want to pay 10 Euros/day extra. We hung damp towels off towel racks, door knobs, out windows.", "Date": "September 27, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "5"}, "AuthorLocation": "toron to", "Title": "“Great hotel if you know what to expect”", "Author": "siestatoronto", "ReviewID": "UR118087129", "Content": "My daughter and I spent 5 nights here in Aug and I can honestly recommend this hotel. The location is excellent, right next to Le Marais, a delightful part of Paris. The metro stop is very close by, the street market for fruit and bread etc is right outside the door practically, on Sunday and Thursday and supermarkets are very close by. The room was a nice size, clean and with a well equipped kitchen. We enjoyed having our breakfast there and wine and cheese in the afternoon. No WiFi in room but available in the lobby. My only objection was there was no change in towels in the 5 days and no room cleaning. We didn't mind taking out the garbage etc but the towel situation wasn't good. I have recommended this hotel to friends going this month and told them to take their own.Otherwise we got an excellent rate on the hotel by booking early and staying 5 nights and we loved our stay.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Loved!!!”", "Author": "bpenley", "ReviewID": "UR117285777", "Content": "Hello Everyone, My Husband I stayed at this hotel the first week of August for one week and it was much better than what I expected. I was extremely sceptical and even more so after reading the reviews on here. Let me start by saying the only thing that was true from the postings was that there was some mould in the bathtub in one corner and as long as you didn't plan on taking long baths, your fine. Everything else was sooooo clean, the staff were so friendly and helpful and spoke very good English. We loved having the kitchen and making our own breakfast and tea at night. The neighbourhood was safe and fun to explore and we loved the market that’s in front of the hotel on Sundays and Thursdays. It was close to the metro which was intimidating at first but was extremely easy to use. The rooms were awesome over all, when we went I was sooo afraid we would end up sleeping on a sofa bed, however we had a very comfortable double bed. I asked the receptionist if we would be sleeping on a sofa because we had to wait for our room and she said that only if they are full or booked for the week would they give you a room like that, so I'm assuming that person who posted about the sofa bed was a last minute type person. We also used the laundry machines which were really conveient. Anyways I hope this helps you feel better about the hotel from the other posts. I'm not sure why there experience was so bad but ours was amazing. Happy Travels!! :)", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Good basic apartment in non-touristy area”", "Author": "mamaroopanda", "ReviewID": "UR116875826", "Content": "I spent three nights at Citadines Bastille Marais with my children (aged 8 and 4). We had a one bedroom apartment with twin beds, which the kids used. I slept on the fold out lounge, which was comfortable and easy to set up. The room itself felt tired and there was noise from other apartments. However, it was a good basic apartment that suited our needs. There were plenty of supermarkets and other shops nearby and the metro was very close too. Kids were thrilled by the playground equipment along Richard Lenoir Blvd. The best part about this accommodation was free high-speed internet (cable). It was the best connection I had during my two-week stay in UK and France! I think there is also free wifi in the lobby. The worst part was lack of washing machine in the apartment. The communal facilities closed at 10pm, which they neglected to tell me when I inquired. The breakfast is overpriced if not included in your package. I had 'expected' views from our room after reading some of the other reviews. We looked into a courtyard so nothing spectacular like the Eiffel Tower.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Terrific apartment in a great location”", "Author": "Cynthia W", "ReviewID": "UR116547462", "Content": "Our one bedroom apartment was wonderful: two twin beds in the bedroom and a double-bed/sofa bed in the general living area for the 3 of us--the sofa bed was comfortable and easy to manage. Spacious for Paris standards: our 7th floor view was well situated, especially with the large windows that opened easily out to generally quiet tree-lined streets. The kitchen was small but completely adequate and well-furnished with dishwasher, microwave/grill oven, stovetop, and refrigerator, allowing us to have breakfast each morning in the comfort of our apartment (vs the rather expensive 13 euro breakfast downstairs). Casino market within easy walking distant and many wonderful shops--including boulangeries for croissants; lots of restaurants--made for a nice neighborhood experience. Don't miss the open markets on Richard Lenoir Blvd on Thursday and Sunday--you'll find anything you're looking for. Metro stations within walking distance (Breuget-Sabin stop recommended; Bastille stop for multiple transfers about 10 mins walk--we also had nice walks to Notre Dame and Pere LaChaise--get the \"Paris by Arondissment\" book so you have all of the streets on your map; the local tourist maps can omit important side streets). How nice to have a full Paris day and to come back to the peace and quiet of a nice, clean apartment. Warm and friendly staff (all speak English); if you have your own computer, you have access to wireless; if not, you can queue up for the 2 computers available, making it easy to check email, weather, print up airline tickets. Definitely would stay at a Citadines again.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Well equipped apartment ,clean and comfortable. Would happily return.”", "Author": "Wendy255103", "ReviewID": "UR115875033", "Content": "The hotel well placed in the Maris. Well worth buying a weekly Metro ticket and learning how to jump on and off the trains. However there are many wonderful places to visit nearby such as the new Opera De Paris Bastille, Place des Vosges , Cimetiere du Pere Lachaise, Musee Picasso.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Good location and good value”", "Author": "TeenyL", "ReviewID": "UR115784228", "Content": "Citadine Bastille Marais suited our family very well. Family of four in a one bedroom apartment. Just enough room really. Lovely views over to Eiffel Tower and to Sacre Coeur. Staff were friendly enough and the location was good. Overall good value for money.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Cedar Park, Texas", "Title": "“Good stay at Citadines Bastille Marais”", "Author": "bjr001_11", "ReviewID": "UR115205515", "Content": "Family of 4 with 2 kids. Our 1 bedroom room had 2 twin beds that could be joined together. Upon request, a crib was provided free for the baby. We skipped the \"light room cleaning\" option provided at an additional charge. We also did not buy the breakfast option -- the spread looked unimpressive for the price. All encountered front desk staff spoke English, and were courteous and helpful. In addition to the 2 nearby supermarkets Casino and Fran Prix , there is a Carrefour that is open later until 10 pm.", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Très bon”", "Author": "AirMartin", "ReviewID": "UR115127305", "Content": "My girlfriend and I enjoyed our stay at the Citadines Bastille Marias. This hotel is conveniently located in the heart of Bastille where you can find a slew of restaurants, cafes, and a great outside market on Thursdays and Sundays. The Casino supermarket is also close by. The subway station located across the street made it easy to get around to all the major attractions. We didn’t have any complaints about the pull sofa bed and found it comfortable. It’s a decent place to stay which I can honestly say was above our initial expectations. I would recommend staying at this hotel - especially if you can get a deal through your travel agency on the posted rate.", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Paris", "Title": "“Not worth it - know what you are getting yourself into”", "Author": "erikanderson", "ReviewID": "UR115007163", "Content": "I have never written a hotel review but felt compelled to after staying at the Citadines Bastille Marais. To call this a \"hotel\" is a vast overstatement. A complete and utter ripoff for 150 Euro a night. Pros: as advertised, the location is amazing. Great nightlife close by, stores within walking distance, and a metro station a minute away. also, the kitchenette is a nice bonus. Cons: close location to the metro unfortunately means you can feel the underground trains as they go by. It is very noticeable, the whole building shakes. The \"air conditioner\" is less effective than a small fan. The mattresses on the beds feel are about as comfortable as a military cot. In fact, I have taken to removing the comforter and sleeping on the ground, as the carpet is a vast improvement to the bed. Rooms are tiny and the \"balcony\" depends on your room - ours is just a large window. Breakfast is a joke and the little food available runs out quickly and does not get replaced. Other minor irritants include the lack of sufficient shelf and closet space, no curtain on the shower, and ineffective window curtains Overall, very depressing room. I would ask to see the rooms before you get one, at the very least.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Singapore", "Title": "“Awful, just awful. Can I add awful again?”", "Author": "Matt873", "ReviewID": "UR114968171", "Content": "As a Singapore resident, I have stayed in most of the Capitaland serviced apartment chains (Ascott, Somerset and now Citadines) across Asia. I had assumed a minimum standard from this chain, based upon my earlier stays. How wrong I was. First, the (only) positive. We arrived at 9.30AM after a long flight from Singapore and were told in typically brusque French fashion by the receptionist that there were no rooms available and that we should return at 2PM. Fair enough, that was the advertised check in time, albeit the message was delivered in an unnecessarily aggressive fashion. Fortunately for us, a rather charming blond Frenchwoman also on reception took pity on us and found us a room for an early check in. It was this action that attracted my one star in the rating, otherwise the stay was awful. The room had a pull-out sofa bed for two adults. I have never stayed in a hotel where the main/only bed was a pretty uncomfortable sofa bed. Sure, sofa beds can double for a second bed, but the only one? We stayed three nights. Not once was the room cleaned, towels or bedding changed or the garbage removed. Not once. Think of your own kitchen garbage piling up for three days! We were told we had a room with a balcony. The \"balcony\" consisted of access to the common paved area at the rear of the hotel by climbing up through the living room window. Getting back into the room involved jumping down three feet into the room. If this was a room at EUR 50 per night, I guess you could say you got what you paid for. For three times that, this was terrible value, even by European standards. The lack of cleaning of the room was inexcusable at any price. Capitaland come on, how do you think such an experience reflects on your brand?", "Date": "July 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“What a Great Place”", "Author": "RobbF", "ReviewID": "UR109376630", "Content": "Great place to stay. Metro station almost across street. Outdoor market sunday and thursday. Comfortable rooms. Friendly and helpful staff. Breakfast if you wanted it but bakery and food store very close. Two blocks from Bastille where ther is a Mac Donalds. metro hub and lots of bars and coffee shops. Going to stay there when I return to paris", "Date": "May 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Jacksonville, FL", "Title": "“Wonderful Stay”", "Author": "allenjax", "ReviewID": "UR108331498", "Content": "We had a wonderful stay at this apart-hotel. What a great concept. Loved the little well equipped kitchen. Was so relaxing to have our coffee and pastries in the room in the morning and a lite snack for dinner. We opted to have our big meal at around 1 or 2 in the afternoon. What wonderful prix fixe menus we found while out and about the city at the most delightful, outdoor cafes. The room was very large with twin beds and a table. In addition to the little, but comfortable, functional kitchen it had a sizable, well equipped bathroom. The twin beds were firm and comfortable. I slept like I was home. The staff all communicated well in English and were very, very helpful. The room was cleaned the fourth day into our seven night stay which was a good improvement as we had read that it used to be cleaned only once a week. We had a small balcony over looking Boulevard Richard Lenoir which was great for watching the people coming and going and hearing the fountain in the park across the street. Even had a view of the monument at the Bastille. With the windows closed we did not hear any street noise to disturb our sleep. The neighborhood was very pleasant with everything we needed nearby. The Casino market was very nice and I would certainly recommend it over the FranPrix Market. The metro stations were very close and we took the Metro to Musee D' Orsay and the Louvre and took the RER C to Versailles. We also took the Open Bus tours throughout the city and hopped on and off as we chose. Walking around the neighborhood was very nice including the Bastille, Boulevard Beaumarchais, Place des Vosges and the Marais. It was great having the free wi-fi in the lobby so I could use my smart phone to access my email and apps. There were also two computers for the guests to use. This was our first trip to Paris and it could not have gone better.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ontario", "Title": "“Magnifique”", "Author": "Marianne01", "ReviewID": "UR107265750", "Content": "The hotel had everything you could want. We could see the Eiffel Tower lit up at night. We had plenty of towels and amenities for 3 women. The kitchen was small but very well equipped. Casino market was close and had everything including beer and wine at excellent prices. Also the market across the road on Thurs and Sunday had fresh meat, fruit, vegetables so we cooked a gourmet meal on Sunday. We ate formula lunch as it was more reasonable than dinner. Also we enjoyed pastries and baguette sandwiches from small shops. We purchased the Museum Pass and saw Versailles, Louvres, Dorsay and Invalides over the two days. We packed a lot into 7 nights and have come home with sore feet but a trip to remember. Also Parisians were so helpful when they saw us looking at our map in a confused manner, they stopped to provide help. We would not have done anything differently.", "Date": "May 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Good value, great location, be sure not to pay extra for cleaning!”", "Author": "sunny_watson25", "ReviewID": "UR101269753", "Content": "Great location. Close to 3 Metro lines. Safe neighbourhood. Booked 1 bedroom apartment with twin sofa beds for family of four. Furnishings not spectacular, but handy to have a kitchen. Franprix nearby and market on Sundays/Thursdays. Dishwasher did not clean well, expect to handwash. Stayed for 10 days, apartment was to be cleaned after 4 days. They came and cleaned after 2, additional cleanings needed to paid for, including 10 Euros for towels (one towel/person). Would get cleaning day in writing in future. Booked airport shuttle through hotel and it didn't have enough working seatbelts. Too late to find another way to airport so had to ride without seatbelt.", "Date": "March 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Markham, ON", "Title": "“Excellent location at an affordable price”", "Author": "goujai2002", "ReviewID": "UR91350660", "Content": "Arrived on Christmas day and checked out on New Year's eve. We stayed in a one bedroom apartment where there was a small kitchen and we prepare our breakfast there. This hotel is located close to two Metro (subway) stations - Breguet-Sabin and Chemin Vert; and is within walking distance to a number of grocery stores where you can purchase your milk, water, and other supplies. Front desk staff were friendly, knowledgeable and able to communicate in English. Since we were out sight-seeing most of the day, we only needed a place to sleep for the night. As a result, we did not require a variety of amenities from the hotel. The breakfast offering was very good - had a good variety to choose from. Very happy and will highly recommend.", "Date": "January 1, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Boulder, Colorado", "Title": "“The Perfect Place for an Extended Stay in Paris!”", "Author": "Thompson_Boulder", "ReviewID": "UR90567103", "Content": "My teenage daughter and I recently spent 8 days in Paris at this hotel. It was the perfect home base for a visit to Paris with a great promotional rate! The ammenities were more than I've come to expect from a hotel in Europe - fully stocked kitchen, decent twin beds, spacious living area, great bathroom, free in room ethernet and lobby wireless internet, and very clean. We easily made our way around the metro system from the convenience of Bastille and enjoyed great, reasonably priced restaurants. We'd recommend the Cantouche Paname http://www.lacantochepaname.com/ for a hip, new Paris dining experience with great food, and Chez Oscar for excellent seafood and service, both on bd Beaumarche. For a great French traditional dining experience and the best coffee, try Chez Vosage, also on bd Beaumarche. The new Casino market, just across Richard Lenoir, makes it easy to get groceries also. We ended up stuck in Paris during a snow storm and, though we'd checked out, the front desk staff helped us get our room back for the unplanned extra night. This is truly a hidden gem in Paris hotels.", "Date": "December 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Studio Suites for 2”", "Author": "CanadianBoys", "ReviewID": "UR87627640", "Content": "We stayed 4 nights in a studio suite and enjoyed our stay. We booked 7-8 months in advance and got a GREAT rate on their booking site. Our room was large enough and included tables and chairs for 2 and small kitchen. Room was very clean, staff great and we liked the area. Our only issue was the metro line, which runs north south but at the 2 nearby stops there is no east west line meaning a connection somewhere to go west - which is where the tourist sites are (generally). That said a 20minute brisk walk will get you to Notre Dam. We visit Paris often but never stay in places with small kitchens - but we enjoyed the Citadines and we used the kitchen to make coffee etc.in the am.", "Date": "November 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Roseville, Minnesota", "Title": "“Perfect Place for an Extended Stay”", "Author": "dhiveley", "ReviewID": "UR83200677", "Content": "We loved staying at this hotel. It was very convenient to the Metro, restaurants, and small grocery stores. Since the room had a small kitchenette, we were able to have a simple breakfast every morning and some snacks in the evening. A newly opened nearby restaurant was a delight to discover. It is called Blues Bar-B-Q, and is actually owned and operated by a woman from Texas...... great Pulled Pork sandwches. We also liked the Attitudes cafe. The hotel was clean and the desk staff were always helpful. We would recommend this hotel.", "Date": "October 12, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Delhi", "Title": "“Very good facilities at excellent location”", "Author": "kamalg", "ReviewID": "UR82473808", "Content": "A Good hotel located at an excellent location. Room and facilities are excellent.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Comfortable and Convenient”", "Author": "Nhojo9", "ReviewID": "UR81143426", "Content": "We enjoyed our stay here in September 2010. The location was convenient to two Metro stations and there were also many restaurants within walking distance. The hotel itself didn't have any distinguishing features other than being quite modern and well presented. Staff were good though not all spoke decent English. The room was reasonably well equipped including a small kitchen. It had a balcony door opening onto a large common space enabling us to sit outside. Recommended overall as long as you aren't looking for 5 star.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "san jose", "Title": "“Great Location. Could be cleaner and service wasnt great”", "Author": "getafiz", "ReviewID": "UR80352350", "Content": "Stayed at the Citadines Marais location earlier this month. Pros: Great location. Steps away from the Breget Sabin metro stop and Bastille. Marais is great to walk around and explore like the other reviews say. Room was large.. kitchen is good and convenient. Get your own oil/butter salt/pepper etc for cooking though. We had a nice large balcony. - They have a computer/printer in the lobby that you can use for free and also wireless access for iphones/laptops etc. Wireless on the iPhone was faster than their desktop. Cons: Carpet was dirty.. corridors have a weird smell (sort of like a room that was cleaned after someone smoked in there). Staff wasnt very helpful. Our room had water leaking out of a recessed light in the ceiling! I talked to the staff about it and they didnt do anything about it for the next two days until we checked out.", "Date": "September 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "texas", "Title": "“A clean accessible location with good staff for an affordable price”", "Author": "Rojo2007", "ReviewID": "UR79464473", "Content": "My family stayed at this Citadines location for a few days in August. We primarily chose the Citadines brand because we were travelling with a young son with unique dietary needs and needed access to a kitchenette to prepare his meals daily. Overall - a clean accessible location with good staff for an affordable price. Cons: While we were there only one of the 4 or so front desk staff who we met spoke English well enough to assist us. However they were all as helpful as they could be given my poor French. The elevators are SLOW...I mean ridiculously slow especially during peak times in the morning Not really a con of the property....but I left by 2G SD camera card in my room (501) and tried unsuccessfuly to have it returned. I was told to make a formal lost request by email but the emails were never answered. I eneded up calling several times to get someone to acknowledge my quandry and was disappointed to learn that not only had the cleaning staff not found my disk but that even if they did they would have probably tossed it as trash (come on now, they can't be that clueless!) If you are a messy person your room will be messy for a week. I can't speak to the quality of the cleaning service since we left before a cleaning would have been due. Pros: Now the good stuff Very nice location. We got a room that overlooked the main Boulevard Renoir and it was a nice view. We could even see the Bastille monument. The hotel common areas are clean and well maintained. The kitchenette is well-stocked - plates, mugs, glasses, bowls, cutlery, kitchen knives and a range of other cooking implements (toaster, can opener, microwave, colander ect.). They provide detergent for the dishwasher but you will have to get your own dishwashing liquid Standard issue hotel toiletries and good toilet paper - bring or purchase your own soap, shampoo, toothpaste and lotion. They also provide hand towels and bath towels but no wash cloths. So if you are accustomed to showering with a wash cloth, bring/purchase your own. The pull out sofa bed is very comformable and large for a sofa bed (probably queen-sized). The arrangement of our room was such that we didn't even put it up everyday and we could still move around comfortably The staff was friendly and helpful especially the one front desk clerk who spoke english. Her name is Cecile and she helped us figure out the details for our day trips several times. Accessible to everywhere in Paris by train. There are at least 3 train stations within 10 minutes walk from the hotel. 2 well-stocked supermarkets not even 5 minutes walk away. Casino is the largest. Additionally there is a wonderful open air market (marche en plein air) on Sunday morning....make sure to brush up on your French as most vendors don't speak English well enough to help you negotiate your way through purchases. Your best bet is also to bring you own shopping bags not everyone has plastic/paper bags for free. The nearby Marais district is \"WONDERFUL\". Lots to eat and drink, endless people watching opportunities, and trendy boutiques, galleries and shops. We found the Frommers walking tour of the district to be a very nice if you have limited time to explore. There is a little breakfast area in the hotel and small concession area but you are better off getting something at the bakeries or supermarkest around. There is a \"Business center\" which really only consists of one computer int eh lobby. However they have free hi speed internet access. So if getting online at amoments notice is important to you bring your own computer. There is controlled card access to the property at all times which helps with the feeling of security. There are laundry facilities on site...we didn't use them", "Date": "September 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barrie, Ontario, Canada", "Title": "“Convenient location and excellent hotel”", "Author": "TonyinBarrie", "ReviewID": "UR74164817", "Content": "My family and I recently stayed at this hotel in July 2010 on our trip to Paris. In Paris, getting a single hotel room at a reasonable price to accommodate four family members can be a challenge at times. The hotel room was very clean and we found that all the amenities worked. The staff at the front desk were friendly and helpful and spoke english. We did not make use of the breakfast service since the hotel was located within walking distance of several Supermarche's and bakeries. We rented a car but parked it in Paris since the subway stop was conveniently located a few steps south from the hotel. We took the subway to all the major attractions we visited. The Wifi internet service was available only in the lobby and the kids had no dificulties connecting using their netbook, ipods and PSP's. There was tethered internet connection available in the room which worked. There were was quite a choice of several cafes and restaurants located close by the hotel and it was a short walk to the Bastille which offered an even wider selection of outdoor cafes and restaurants. We did not experience any problems walking around in the neighbourhood both during the day and at night. There was an outdoor market in the park opposite the hotel on Sundays which we enjoyed. All in all, our stay in Paris was excellent and our stay at the Citadines had a positive contribution to that.", "Date": "August 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Norway", "Title": "“Excellent stay”", "Author": "Jenta", "ReviewID": "UR71223657", "Content": "We have previously stayed at this place without the kids and since we remembered the playground right outside the hotel, this was a safe bet when we returned to for a Paris with the kids. This aparthotel is not anything like a typical Parisian apartment, but that's not what we wanted either. We were provided with a big apartment with one bedroom, and a combined kitchen- living room. There were also two balconies, and it was nice to sit outside and enjoy a glass of wine there. Some noice from the street though. The paratment is clean, the kitchen provides anything you need of utensisl for making breakfast or preparing a light meal. The staff is incredibly helpful and point out anything you ask for. There are local grocieries nearby, good restaurants and last but not least the fantastic Place des Vosges is just a short stroll away. Not to forget the very secure playgorund just opposite the hotel. You will find table tennis, places where the grown ups can sit and relax and other equipment typically for a playground. It was nice having breaks there during the day. Also, free Internet in the lobby.", "Date": "July 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Australia", "Title": "“Comfortable and good location for Paris sightseeing”", "Author": "ZebideeAustralia", "ReviewID": "UR67301076", "Content": "We spent three nights there and used it as a base for seeing Paris. The Bastille station is close by, there are heaps of eating places within walking distance and reception staff (one young woman in particular spoke excellent English and was exceptionally helpful) were knowledgeable about Paris and even organised a restaurant booking for us. It's modern, certainly not Paris-quaint, and it's on a busy street that feels a little industrial in places (motor scooter shops nearby). On the other hand, there's a supermarket around the corner, markets nearby and the nature strip in the middle of the street becomes party central for young Parisian picnickers on Friday night. Room was reasonable size, had kitchen with dishwasher and doors which opened onto shared patio, bathroom was clean. There was a pay-per-use laundromat near reception. One gripe was aircon in our room - didn't work, complained about it twice, and it wasn't fixed. If you want a base in Paris with modern conveniences and aren't looking for something quaint then it's fine. Lots of tour groups there during our visit. One tip: there's a Moroccan restaurant close by (not far from Bastille station) that was great - good food and really friendly.", "Date": "June 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "sydney", "Title": "“charmless”", "Author": "freddie67", "ReviewID": "UR51811649", "Content": "Minuses - A couple spending a fortnight in Paris don't want single beds. The once white towells are grey and threadbare, the sofa and chairs have stained fabric. The colour-scheme is a depressing puce mustard/yellow. Pluses - quiet, the plumbing works well (unusual for Paris apartments) close to Metro, Bastille, Marais and the Richard Lenoir markets are great and you will want to get bunches of flowers and fruit quickly to decorate the charmless apartment. Room was clean.", "Date": "December 24, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Philadelphia, PA", "Title": "“Not bad, but kind of a scary neighborhood”", "Author": "Scotchtea", "ReviewID": "UR44017292", "Content": "We stayed here for five days/nights in late August. We had never been in Paris before, so did not know what to expect. We were a bit taken aback by the neighborhood. It seemed very smelly (urine) and covered in graffiti, although we soon realize that much of Paris is the same. The neighborhood seemed fairly safe in the daytime, although I wasn't so comfortable there at night. It has many restaurants, shops and Metro stops nearby. One plus: there is a great open-air market at the park right across the street from the hotel on Sunday. We really enjoyed that! The hotel itself is fairly nice and clean. The desk staff was extremely friendly and very willing to speak English. Our room was very nice. We had a seperate bedroom for my husband and I; the kids slept on a sofa bed and trundle bed in the living room area. The kitchenette as fairly nice, too. Our windows looked out over the back courtyard. The air conditioning worked very well and we had free WiFi. It was very quiet there at night - very little street noise (we were in the back of the building). A few not-so-good items: There was no free breakfast available. There was a market nearby, though. It would have been nice to have at least some coffee available in the lobby in the morning. Also, there was no maid service at all. We didn't mind that so much, but would have liked some more towels during our stay. There were four of us and we only had three sets of towels. When I asked for another set, I was told I'd have to pay 10 Euros, which I thought was ridiculous. Overall, the place had some very nice features: the separate bedroom, the air conditioning, the free WiFi. However, no maid service for five days was not great and the neighborhood was iffy and not very close to the main points of interest in Paris. Luckily, we didn't mind walking and using the Metro.", "Date": "September 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Definately a Perfect place to stay”", "Author": "Spartan1900", "ReviewID": "UR39254676", "Content": "My wife and I had put plenty of research into our first Paris trip. The Citadine Bastille seemed too good to be true. Area: Although some reviews were correct i.e it seems a bit scary at night with the weirdos outside the park BUT we had no trouble at all. I would recommend my mum to visit and walk around at night with no concern. It is a residential area so it is quiet all the time. However if you turn right outside the hotel and take your 1st right again, you will see a lovely supermarket with everything you will require. Carry on further up the strett and you end up on a major road with several restaurants. Reception: 10/10. Pleasant, friendly and the lovely girls spoke English when you struggled with your French. Even free coffee and internet near the reception. Rooms: Bathroom and loo were perfect i.e clean, neat and no smells. Sleeping couch was okay. Hey this is 3 stars and we had no back pains or complaints each morning. We asked to face away from the road and we were given a perfect studio room on top floor. When we looked out of the window- Eiffel tower (top half) in the distant. My wife was thrilled. So was I. And on Sunday there was a lovely market just outside the hotel! Overall this is a perfect place to stay in PARIS", "Date": "August 30, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Beirut", "Title": "“Good location & value”", "Author": "MauriceC", "ReviewID": "UR38321835", "Content": "We have stayed at this Citadines for a few days each year for the past six years. The location is very convenient - the Metro stop is in front of the Hotel - and the Sunday market on the Boulevard Lenoir is one of the liveliest in Paris. The hotel is quiet, rooms are comfortable - each with fully equipped kitchenette - some are even spacious by Citadines standards. Best prices and specials are found by booking with Citadines on line - To my mind it represents the best value in Paris unless you are looking to be pampered and expect a concierge and room service.", "Date": "August 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Sneek, The Netherlands", "Title": "“Nice hotel, conveniently located”", "Author": "Bouwe", "ReviewID": "UR37392913", "Content": "I stayed at this hotel from August 8 to August 9 2009. The hotel has a very nice location on the Boulevard Richard Lenoir which leads to the Place the la Bastille (with the Opera de Paris Bastille and the Colonne de Juillet). The boulevard is not that busy so it caused no nuisance at all. About 300 metres from the hotel there is a subway (métro) stop Richard Lenoir and/or Chemin Vert. You can also walk to Bastille metrostation in about 5-10 minutes. This station has connections with several subwaylines. You can also walk through one of the nicest neighbourhoods of Paris, Le Marais with the beautiful Place des Vosges. The hotel itself is very nice, the rooms are spacious and have all the amenities, including a kitchen and a well-equipped bathroom. The hotel also has a (small) breakfastroom, a garage and very helpfull staff who provide you with maps and information. All in all a very pleasant hotel, I would certainly recommend this hotel for a stay in Paris. Also, the rates are very reasonable.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Philadelphia, PA", "Title": "“Pathetic for the price”", "Author": "DPEC", "ReviewID": "UR33433199", "Content": "We needed a place to stay for one night before leaving from CDG, so we chose Citadines Bastille because of its location. We are a family of 4, and an appropriately size Citadines rental was $320 for one night (two twin beds and a shared sofa-bed). Our typical Parisian stay is in a Marais apartment rental via an agency. This costs $200-$250 per night for something much larger (3 bedrooms, dining room, living room, kitchen, comfortable furniture--basically somebody else's home). For those of you contemplating a week's stay at the Citadines, I wouldn't considerate it. Rent something via an agency. A week at Citadines would be horrible and you could easily do much, much better. If your stay is a one night stay, then, you'll likely appreciate the location, but you'll feel like you got ripped off. Note: It was explained to us that there is no way to guaranty a non-smoking room at the Citadines. Technically the \"Apartments\" are private property when you are renting them, so the manager can't go in and tell you \"no smoking.\" Our first room smelled like the inside of an ashtray, and we would have had a miserable night had another room not been available. So, if you have non-smoking needs, or other similar requests, make sure you contact the hotel directly.", "Date": "June 29, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "New York", "Title": "“Tired and Unwelcoming”", "Author": "chefeileen", "ReviewID": "UR32601111", "Content": "I know Paris hotels well - from inexpensive 2 star pensions to 5 star luxury hotels. This hotel did not deliver good value. The room was very tattered. There were many stains on the upholstery of the chair and sofa. The bathtub was chipped and stained. The carpet was dirty. The comforter on the bed was dirty. We stayed a week which entitled us to only one cleaning. The cleaning did not include vacuuming or dusting - mearly a sheet change and a quick wipe up of the bathroom. There was a garbage shute for the entire floor to use. There was always garbage piled on the floor. There was only one extra roll of toilet tissue in the room. Everytime you needed more, you had to go downstairs and ask for another roll ... one roll at a time. There were no facial tissues. The staff at the front desk was helpful at times, but generally gave dismissive answers and acted annoyed that you asked a question. I have stayed in small hotels that cost 30% less and they were more comfortable.", "Date": "June 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "In Toronto", "Title": "“Want convenience, good amenities and flexibility in a great location? Stay at the Citadines Bastille Marais”", "Author": "WorkingOnIt", "ReviewID": "UR30067264", "Content": "The Back-Story: My mum (mid-60s) and I (mid-30s) travelled to Paris in May 2009 for her 65th birthday. We are both seasoned budget travellers who have been to Paris before. But if you've been to Paris before, you know that it's a tough one to stay away from! The Citadines made our trip even better. The Deal: We got an unbelievable package with Air Transat -- 1 week air+hotel+transfers from Toronto for under $800 CDN + taxes. What's the French term for 'no-brainer?' The price made our stay at the Citadines absolutely worth it, but I would have paid as much as $1200 + taxes for the same package, as you can make up some savings by taking advantage of the kitchen amenities. The Flight and Transfer: Good service from the Air Transat crew on our flight. The wait for luggage was lengthy. The transfer to the airport was seemless and efficient, and our driver was polite and courteous. No complaints there. The Location: If you like hip, energetic, beautiful neighbourhoods with loads of great bakeries, bistros, restaurants, galleries, museums, shopping, historical sights, and a busy nightlife strip, stay at the Citadines Bastille Marais or somewhere nearby in the Marais. It is by far one of my favourite neighbourhoods in Paris. The hotel is minutes from a Metro station and literally has everything within a few minutes walk. The Marais is a great neighbourhood for walking. The one caveat is that the park near the hotel has some sketchy folks hanging out at night. The Lobby and Staff: The lobby is clean and modern. The staff was friendly and helpful, and relatively comfortable in English. We spoke some French and they were most patient with us. The Room: We stayed in a studio room with kitchenette that was roomy enough for two, but two only. Some quick highlights: -Room was very clean and well-appointed, with a little balcony that made all the difference. Not a lot of character in the decor, but hey, prints of Van Gogh ain't half bad. -The roomy, clean, renovated bathroom had a deep tub, lots of hot water and good water pressure, hair dryer and good lighting. No fan though. -The tiny but well-equipped kitchen came with good dishware and utensils, fridge, microwave and even a mini-dishwasher! -Pullout couch was relatively comfortable and not hard to unfold. We rearranged the furniture a bit to make more space -A lot of closet space. Really. Not a lot of hangers though. But, an iron and board if needed. The Good-to-Knows: -Don't take the 10Eur/day breakfast they offer in the restaurant. That's a ridiculous price when you can buy a fresh pastry every day from one of the many bakeries in the area. Try them all! -Best time of day to get some time on the free computer with internet in the lobby: morning after breakfast, or during the day. There's an internet cafe close by on Ave. Beaumarchais -Bring dishwashing liquid, salt and pepper with you -They only clean the room once a week, but you can live with that, right? You're in Paris, cherie! -There's a Franprix grocery on the first cross-street near the hotel. Very handy -Enjoy the bustling open-air market on Thursday and Sunday mornings. -If you need some English telly, the TV shows BBC and CNN -Take care near the park by the hotel alone at night. The dodgy characters are out in full force. If you're a lady, walk with a friend - I overheard the concierge make this recommendation to a young woman in the lobby after an incident on the street. -If your room is smoky-smelling, just open the balcony doors and give it a good airing out. It will clear up. The Bottom Line: Citadines was a great home base for our trip. It was incredibly convenient and offered so much flexibility in terms of its location and amenities. I would definitely stay at the Citadines Bastille Marais again. Bon voyage, mes amis!", "Date": "May 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "philadelphia, pa", "Title": "“Great Location, Great Hotel, Great Value”", "Author": "travelinbeige", "ReviewID": "UR28086924", "Content": "We recently traveled as a party of four to Paris and had a difficult time finding a room that could accomodate all of us. We found the Citadine and thought it was very reasonablly priced for what it offered. We LOVED it, the room was very big and comfortable with all the amentities to make your stay as relaxing as possible. The kitchen was well equipped with a stove, microwave, toaster, dishwasher, refridgerator and all the pots pans and untensils you could need. The bedroom was a decent size with a HUGE closet that fit all of our clothes (4 girls so you know its big). The living room had a pullout couch that was comfortable enough for a few nights stay. Our room was on the first floor so we had glass doors that opened to a big patio area complete with tables and chairs. The hotel is very conveniently located across the street from the metro stop Richard Lenior which made EVERYTHING easily accessible. We were all very impressed with the metro system, its clean, cheap and easy to navigate. The area has many restaurants and shops but is still a quiet place to come home to at the end of the night. I would definitely stay here again.", "Date": "April 15, 2009"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "BRISBANE", "Title": "“Good - but beware the fold out beds”", "Author": "RAWISH", "ReviewID": "UR21218104", "Content": "Great apartment in interesting area - excellent food market SUN am accross the road but .. On check in we were \"warned\" the studio apartment (607) had a fold out bed - which turned out to have been bent to blazes by previous guests not knowing how to unfold it. We had to put the matress on the floor to get a flat bed instead of a rollercoaster with your mid section higher than your head and feet. Pity something so important isnt regularly checked for sleepability in what in every other way was an excellent place to stay.", "Date": "October 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Upstate NY", "Title": "“Splendid stay”", "Author": "pearson30", "ReviewID": "UR20602742", "Content": "This apartment hotel was well kept, clean and secure. It was located in a very convenient area and it was an easy walk to many attractions. The Bastille market and grocery stores were located nearby. We were able to make several meals in the kitchen and the dining room table was large enough for up to four persons. We were worried about sleeping on a sofa bed but it was very comfortable and not too difficult to set up. The hotel provided a list of instructions for all the appliances and the sofa-bed which was very helpful for non-Europeans. We did not take our laptop and were very pleased to find that they had a public computer to use in the lobby.", "Date": "October 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chesterfield", "Title": "“Fantastic!”", "Author": "Maryios", "ReviewID": "UR18466849", "Content": "booked this place at a great rate for Paris. Normally stay in the Marais and this was about 10 mins away from our previous hotels but is easy to find and near good Metros (Bregant Sabin is good for CDG airport and the next one is Bastille on the main line). I needed to amend my booking and Cecile was brilliant on reception dealing with my request. The room was small but great and even had a little balcony with chairs - all for less than £100 per night in Paris. The kitchen was a god send as we could keep our own water cold and have brekkie in if we wanted. There is a supermarket 5 mins away to stock up for picnic items and a bakery for the crossiant and breads. Cecile even gave me plastic cups for a picnic. All the locals seem to picnic down by the Seine so you can just turn up with bread, cheese and a bottle of vino and settle down for a cheap night by the river! Great, clean accommodation and really friendly staff - recommended!", "Date": "July 31, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“Really enjoable”", "Author": "AustraliaKatie", "ReviewID": "UR16428446", "Content": "We stayed at the Citadines for three nights, and enjoyed it. The staff at the front desk were all very helpful and happy to speak English with us. Our one-bedroom apartment was large enough for our purposes. The location was good, with a playground right outside the door - a hit with our toddler. Markets, boulangeries, and more are close by, and it's easy to walk to Marais for restaurants. Using the laundry was a bit expensive - Euro26 for two loads of washing and two loads of drying. Other than that, we enjoyed our stay and would stay there again.", "Date": "May 27, 2008"}, {"Ratings": {"Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Location": "3"}, "AuthorLocation": "melbourne", "Title": "“Awful”", "Author": "raysse", "ReviewID": "UR15489341", "Content": "We arrived at 7.30 am after a 24 hour trip and were told that our 2 rooms that had been fully paid for 2 months earlier had been given to other guests who decided to extend. The expedia number did not work out of hours. The receptionist who identified himself as M. Ezone was particularly unsympathetic. He informed us that he could not give us a refund. Nor could he contact the manager, M Mahmoudi's.. We were informed that Citadines managerial staff who made the decisions could not under any circumstances be disturbed on the weekends. ( this even included the assistant manager Mlle Masson who might ,we were told come in later that day) We we told we had to stay at a citadines on the left bank - and they would pay for the taxi. Awful way to start a holiday.", "Date": "April 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Great Place and Location”", "Author": "jorgef98", "ReviewID": "UR14865110", "Content": "My wife and I stayed at the Citadines Batille Marais in March 2008. We were very happy with the entire experience. We stayed in a 1 bedroom apartment for 1 week. The location was great with 3 different metro lines within a few blocks walking distance. There is a food market across the hotel on Sunday and Thursday which is a great way to stock up on fresh fruits and cheeses for breakfast every morning. The kitchenette was a perfect size (we only had breakfast in the room). There was internet connection which allowed us to stay connected. Also, the size of the rooms were great for European standards.", "Date": "April 7, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Not bad”", "Author": "Neverkissacactus", "ReviewID": "UR14310857", "Content": "5 min walk from Breguet-Sabin metro station, great location. Small but well-appointed apartment - but had some problems getting twin studio as booked, and then had an extremely dodgy fold-out bed. Also overpriced laundry and cleaning only once every seven days. Seems to have deteriorated a bit in recent years - stayed twice before, in 2001 and 2006, when it was much better.", "Date": "March 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "london, uk", "Title": "“clean convenient”", "Author": "colinebannon", "ReviewID": "UR13077218", "Content": "It's a great location - walkable to Oscar Wilde cemetery, La marais, etc. Would recommend even my parents to stay here. Supermarket around the corner so you can make meals in the compact kitchens if you want. Kitchens are well equipped with even a small dishwasher. I would stay here again and it is well priced.", "Date": "January 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Florida", "Title": "“Good location”", "Author": "enimar", "ReviewID": "UR11641379", "Content": "My gilfriend and I (early 30s) stayed at Citadines Marais for a week in August 2007. We were looking for a decently priced hotel that is located near the attractions and easily accessible. We were pleased with our choice. while this location is a 15 minute walk to the heart of Paris, it is located in a safe area. It also provides mini kitchens, which was important to us as we were on a budget and were staying in paris for a full week. we did a lot of food shopping at the street market next door which takes place twice a week. We loved having a refrigirator as we love cheese and cold white wine. We ate out several times but also used the kitchen many times which saved us a lot of money considering the exchange rate. They don't provide room service everyday which really didn't bother us at all. we were too busy exploring the city anyways. service is good overall. The area also has a number of good restaurants and bakeries. Citadines also has a location in 2nd, which should also be considered, as it is in the heart of it all. We would certainly stay with this chain again.", "Date": "December 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Surrey, Uk", "Title": "“Great location”", "Author": "PatriciaB_Surrey", "ReviewID": "UR11157419", "Content": "My girlfriends and I stayed here on our annual weekend in Paris. Having stayed in some very nice hotels in the past, we left it too late to book a room for 3 in a hotel that wasn't very expensive or had suspect reviews. So having read the reviews on tripadvisor we thought we would give it a shot. We didn't use any of the self catering facilities and found some lovely restaurants on Rue de Charonne. It was an easy journey from Gare Du Nord and a five minute walk to the Bastille (if you are travelling back by metro from somewhere and have to change lines at Bastille just get off at Bastille ) . The reception staff were very helpful and it was very clean and quiet. Will definitely stay here again and would also consider staying here with my husband and our little boy. We had a double bedroom and a sofa bed that become two separate single beds which were comfortable.", "Date": "November 30, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Scotland", "Title": "“No more hotels!”", "Author": "IandP", "ReviewID": "UR10090567", "Content": "Check in time was bang on 1500 as previously stated but staff were friendly, polite and courteous although during my stay I saw them having to deal with some of the rudest customers I have ever had the misfortune to overhear. Baggage storage is not a problem either. The small apartment we rented had everything we needed for our week long stay but I would recommend if you are one of those people who like a tea or coffee when you hit the room, bring your own. Only criticism or minor change I would make is swap the dishwasher for a small oven and we would be better able to use the kitchen. Not having a microwave at home it was all a bit too complicated to have to sit and read the instruction manual, although no such problem with the kettle or toaster. A manual for all electrical appliance is supplied in different languages. You don't really need to eat in as the area is surrounded by many reasonably priced, or, if you want to push the boat out, many not so reasonably priced restaurants! It is nice to get up and have breakfast though. The living space was bright and airy with air conditioning and the sofa bed was very comfy. The receptionist indicated some guests had been put off when told it was a sofa bed but that is clearly explained in the literature. Broadband connection, wi-fi and a telephone line makes this ideal if you need to work when you stay. The bathroom has a bath which is great if you need a soak after a long day or if you need waking up in the morning there is a power shower . The room was cleaned very thoroughly once during our stay as per agreement although you can pay to have this done as often as you wish. The location is fine and the market opposite is excellent for picking up bits and pieces of good quality and good value foodstuffs. Staff do however orientate you on arrival to supermarkets, pharmacies and the metro and bus services which is very helpful. There were no issues with noise from other guests or adjacent rooms during our stay which is often a complaint in hotels and the windows kept out any noise from the street. We are certainly converts now and will be returning to this particular aparthotel as it's location suited us perfectly.", "Date": "October 17, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Albany, NY", "Title": "“Second Visit”", "Author": "Chansie", "ReviewID": "UR8603444", "Content": "I have visited Paris at least a dozen times staying in a wide variety of hotels. This was the second time that I stayed at this Citadines in Paris -- and I will likely stay there again in the future. Location is great and for both visits I found good rates on the Citadines website. Bus stop that brings you through the Maris, past the lourvre, and to Champ du Mar/ Eiffel Tower is a 1 minute walk (Rick Steves mentions this bus route in his Paris book). Metro stop is less than a 2 minute walk from the hotel. within less than a five minute walk there are numerous cafes, small shops, grocery stores etc. The park accross the street from the hotel is lovely during the day and has a market on Sunday -- but avoid walking through it at night./after dark. Rooms are good sized. Double is a pull out sofa that is more comfortable than most pull out beds. The kitchenette is small but very efficient with all necessary items already there (knives, bottle opener, cutting board etc). Bathroom was well laid out and very clean. staff were friendly and tried to be helpful. they will not let anyone check in early even if rooms are ready, but they will let you store your bags.", "Date": "September 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Nice! Modern! Clean!”", "Author": "mickeytor", "ReviewID": "UR7975155", "Content": "I was pleasantly surprised by, and ultimately happy with, this apartment for several reasons. First and foremost, it was a nice sized space. Things were well laid out and there was plenty of breathing room for two people. It really was a great place to unwind. Futher, the room and the building were very clean, the bathroom and kitchen had modern fixtures, and the staff was courteous and helpful. The views from our sixth floor room were outstanding. We could see the Eifel Tower and Sacre Couer in the distance. Plenty a memorable evenings were spent just watching the lights. The location was perfect in that it was steps away from the Marias, and a block or two up from the Bastille. There is a Metro stop right outside the apartment, and a few others only a few blocks away. Night life was always nearby, but I didn't hear it when I was sleeping. The only complaint, and it is a small one, was the Internet. They had one computer in the main lobby that was free to guests. It was a nice touch, but it was constantly in use, with a line up of people waiting for it. Quite often it was kids playing games and whatnot. It didn't bother me in anyway, but then again, I never had a need to use it. All in all, this was my first experience with a Citadines, and it certainly left a good impression. I will consider them when I travel again to Europe.", "Date": "June 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Queensland", "Title": "“Fantastaic apartment with views”", "Author": "oztraveller2-TRIP", "ReviewID": "UR7831583", "Content": "We had an apartment on the sixth floor at the very end of the building looking towards La Bastille. We had a balcony from the bedroom and one from the living area so had wonderful views in two directions. The apartment was clean and very comfortable and plenty big enough for three adults. The appliances and crockery/cutlery and cooking utensils were excellent and quite ample for a long stay. The staff were extremely friendly and helpful. Guests also have free internet use of the computer in the foyer. It was convenient to the metro and close to supermarkets. The markets close by, held on Sundays and Thursdays, are a must and had an amazing array of wonderful foods. We will be back.", "Date": "June 11, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Oh what a room with aview!”", "Author": "ephemeral99", "ReviewID": "UR6336126", "Content": "We spent 14 nights here and almost cried when it was time to leave! I was 20 weeks pregnant at the time and found it very comfortable - it was great to be able to pick up some provisions and eat in when you liked as opposed to being in a smarter hotel that forces you to eat out all the time. I still miss the local boulangerie and the little supermarket that sold the most fantastic cheeses and yoghurt for budget travellers like us! The location was great if you like to walk and enjoy taking the Metro. The twice-weekly markets were an added highlight. If you can't afford to stay right in the heart of the Marais district then this is the next best thing. We'll be back for sure!", "Date": "December 5, 2006"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "world", "Title": "“Great Value, Greate Hotel!!”", "Author": "prere", "ReviewID": "UR6121093", "Content": "This is my favorite hotel in Paris without doubt. Among the pluses: -Incredible value (huge rooms, modern, nice). I paid US$100 per night in October. -Large rooms with kitchenette, fridge, etc. -Free broadband Internet in every room -Incredible location - it's on a beautiful street in the heart of the marais that has a fruit market on weekends, etc. -Very close to multiple metro stations The only minus I can think of is that it's not an old romantic building. If you're going with your girlfriend, wife, etc. or want an old worldish experience there are more appropriate hotels. For a family, business traveler or other travelers I haven't found anywhere that beats the Citadines Bastille Marais.", "Date": "November 13, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Virginia", "Title": "“Good all-around value”", "Author": "JessieVA", "ReviewID": "UR2859467", "Content": "I stayed for two weeks in November and this was my third visit. I had a small studio but perfect for one, would be cozy for two persons. Has pull out twin beds. Super modern kitchen and bath with housekeeping once a week. The hotels are modern and perfect for the business traveller; they just don't have the charm of older places. Free internet access in lobby and friendly staff. Breakfast available but expensive; recommend using local markets to buy your own fixins. Convient bus stop across the street and metro a block away. Easy walk to Bastille and marais restaurants. My husband and I have stayed in Citadines around France and they are all very similar and a very good value.", "Date": "December 2, 2004"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Miami", "Title": "“Great hotel, not so great location”", "Author": "fernelias", "ReviewID": "UR2523493", "Content": "The hotel was a good surprise in terms of appearence. Good things: nice staff,size of the room, nice and big balcony, lovely kitchen, modern bathroom, cool air conditioner, free internet and access to computer, free coffe and tea 24/7, nice breakfast for 8 euros. Bad things:location, far from major attractions, looked like a very unsafe neighbourhood but if you walked five minutes you could see nice restaurants and beautiful and young people, so maybe that was just a bad impression. I would reccomend staying in another citadine closer to the attractions.", "Date": "September 11, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Weston, FL", "Title": "“A great choice”", "Author": "wtmarks", "ReviewID": "UR1834615", "Content": "This is the second Citadines Hotel we have stayed in in Paris and will definitely go back. Having stayed at several three and four star hotels in Paris, we think the Citadines provides much more bang for the buck. We stayed at the Bastille Marais last year and really enjoyed it. The room was a one bedroom plus a small kitchen and living room. The bedroom was large by Paris standards and having the living room to stretch out in was a big plus. The kitchen had everything you need to be self-sufficient, although we used it mainly for the refrigerator to hold our wine, cheese and chocolate. Having a washer/dryer in the basement meant we only had to pack about half the clothing we normally would have. The neighborhood is very nice, about 6-7 blocks from the Bastille. There is a small market several blocks form the hotel and an outdoor market across the street which is open several days a week. The front desk staff was very pleasant whenever we had questions. Overall, this was an excellent choice.", "Date": "April 24, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Cheap Place for 4 Persons in Paris”", "Author": "suitraveller", "ReviewID": "UR1832508", "Content": "Stayed for 3 nights and I liked this type of hotel, especially when prices in Paris is so crazily expensive. The room looks very new with everything complete in the room. The most thing I like there is the PC in the lobby with a free internet access.", "Date": "April 23, 2004"}], "HotelInfo": {"Name": "Citadines Bastille Marais", "HotelURL": "/ShowUserReviews-g187147-d197440-Reviews-Citadines_Bastille_Marais-Paris_Ile_de_France.html", "Price": "$161 - $333*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">37, boulevard Richard Lenoir</span> | <span class=\"extended-address\">11th Arr.</span>, <span class=\"locality\"><span property=\"v:postal-code\">75011</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "197440", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/d7/4a/d74a1ddbf1d8ac5ffa7b2c585f4d00f96large.jpg"}}