{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bethesda, MD", "Title": "“Great location”", "Author": "NancyinMD", "ReviewID": "UR125200389", "Content": "I had problems trying to book at Hotel Le Clement when I was trying to do it on line so I ended up calling. I was very disappointed to find out that there were no vacancies available for the four days I was going to be in Paris. They did say that they had a very small room for one person but that they did not post information about those rooms on the website. I went ahead and reserved the room and afterwards several friends who were familiar with Paris told me that it was a bad idea, that the rooms would be minute, and I wouldn't be happy.I wasn't able to find anything else in the St. Germaine area that interested me so I went ahead and kept the reservation. I was very surprised to find that I liked the room. It was tiny but also was charming and comfortable. Since this was my first time in Paris the central location, within walking distance of the Luxembourg Gardens, the Sienne and Notre Dame, was perfect. It happened to be unseasonably warm in Paris the week I was there and I will say that it did get noisy with an open window at night but usually calmed down about 11 pm or so. The staff was helpful,and arranged for my very early Saturday morning trip to the airport. I had a great time.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boulder, CO", "Title": "“Best place to stay with a baby in Paris hands down!”", "Author": "twnewton", "ReviewID": "UR121318073", "Content": "This is an adorable little hotel in a great area of Paris. It is in walking distance of all major sights, and the hotel itself is quite charming. It is not super fancy by any means, but feels quite French and traditional. It was FABULOUS for us to have the room with two bedrooms (I think they call it a junior suite). Our two year old slept quite soundly in the very small bedroom (it had it's own door) and we were able to enjoy a glass of wine in the evening with the windows wide open. The room itself was interesting, when you walked in it was a tiny hallway with two very small bedrooms off of it. Our room (the larger one) was a decent size. I would not hesitate to stay here again and would recommend it to any family looking for reasonably priced Paris lodging.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Florianopolis, Santa Catarina, Brazil", "Title": "“A home away from home”", "Author": "RobPeixoto", "ReviewID": "UR121133085", "Content": "I stayed here for the second time last september. My first time was back in 2005. After trying unsuccessfully to book through their website, I wrote them an e-mail with a positive answer (there was one last room left after all). It's still the same nice place and very well located. It's not a modern hotel...very classic decor, but very confortable and cosy. I saw here some complaints about the noise from bars and restaurants if you get a street side room like I did, but I couldn't hear a thing. But I have to mention that I got a top floor room. The location is amazing: one block from Blvd Saint Germain and Rue de Buci, and less than 500 meter from Jardin du Luxembourg. Not to mention 2 very near subway stations from different lines to choose from. This time I stayed here after a bike tour around France with The Chain Gang (a cycle tour company), and for next year, they kindly offered to keep my bags while I'm touring again by bike, so I don't need to carry all my luggage with me during that week. You know, you might need some nicer clothes when in Paris, that you don't need while cycling in the country.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fort Lauderdale", "Title": "“What a find!”", "Author": "DrGFortLauderdale", "ReviewID": "UR119418522", "Content": "A reasonably priced hotel with quiet rooms in the heart of the Left Bank, steps from Saint Germain de Pres and Boulevard Saint Michel ... a dream, right? That would be Hotel le Clement. It is so perfectly located, we were able to walk everywhere. In four days, we never took the metro. There are certain things about Paris hotels that go without saying ... rooms will be small ... elevators will be tiny ... but we slept like babies and the staff was exceptionally helpful. Across the street is a converted station with shops and bakeries ... and the hotel is steps away from excellent shops, bars and restaurants. Hotel le Clement is going to be our first stop in France every time we go there.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, GA", "Title": "“Beautiful hotel, great stay”", "Author": "AthensFrancophile", "ReviewID": "UR118627073", "Content": "Just finished a three night stay with my mother. We had a room with two beds, one a twin and one a double. Old world charm with fabric on the walls, boutis bed coverlets, and matching bedskirts. bathroom was marble, recently re-done with a deep tub/shower combo. Classic french windows opening out to street with geranuims in window planter. Breakfast was abudnatn and well priced. They served pastries and baguettes from Gerard Mulot, one of the top bakeries in Paris and coveniently one block away. staff very polite and helpful. location could not be nay better or more convneient wihtexcelletn bus and metro access within a block or two. because of the recent smoking ban in Paris, everyone wnats to sit on teh terraces and smoke so the once dead marche St. Germain across the street is now quite lively with diners filling the terraces all the way aroudn the square. this may be too noisy for some though it is mostly the low rumble of dinner and not drunken partying. for 140 euros a night, it was a most pleasant value.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Loved it!!!”", "Author": "Jodie000", "ReviewID": "UR118577968", "Content": "We stayed here for 4 days in September at the start our our holidays--- it was delightful!! The room was big with a comfy bed- we upgraded to the delux room though so not sure what the other ones were like. Breakfast here was really good-- croissants, eggs , cereal, fruit and cheese--- with GREAT coffee! There is a lift but it's pretty small-- still better then hauling bags up the stairs. The staff were also really nice and helpful-- all spoke English well.", "Date": "September 25, 2011"}, {"Ratings": {"Overall": "4.0", "Rooms": "4", "Service": "4", "Location": "5"}, "AuthorLocation": "new york, ny", "Title": "“Beautiful hotel on a quaint street”", "Author": "wanderlustny", "ReviewID": "UR118042844", "Content": "A fantastic little hotel off of Blvd Saint Germaine. The rooms are comfortable and clean, and the staff is extremely nice. There's also a great wine bar across the street which is a great place to end the evening. The only downside was the bathroom. It was a \"sitting\" shower, with no curtain, so you really had to stay alert while showering to avoid spraying water all over the bathroom!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Ridiculously loud street, made sleep impossible”", "Author": "SB_in_NYC", "ReviewID": "UR117800578", "Content": "Great location, pleasant staff. Small rooms, with reasonable rates. However, it has to be the loudest hotel I have ever stayed in due to the noise on the street (shops/cafes across the street, general street noise and then garbage trucks starting up at 5:30am). My husband and I only were able to doze fitfully. Truly the loudest and worst hotel experience (even with the windows closed). I should also note that my husband and I live in Manhattan, just off Broadway, so we are used to an urban environment with plenty of street noise. I would never stay here again. This is not the place for a light sleeper.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bellevue WA", "Title": "“My second time at this hotel, will definitely return.”", "Author": "R_Laign", "ReviewID": "UR117180019", "Content": "I hoghly recommend staying at this charming hotel in perfect location in the 6th. Rooms typcically small for Paris but very pretty; a helpful staff, good breakfast at good price. Market and shopping mall across the street very convenient. Pre-booking rates very advantageous. My second stay there, will return again as soon as I can!", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Devon", "Title": "“Great value”", "Author": "HappytravelsDevon", "ReviewID": "UR116490002", "Content": "This hotel was in a perfect location-but a little too lively in the early hours at times. The staff could not have been more helpful, the room was clean and comfortable and it was within easy walking distance of all major attractions (and if not up to the walk, the nearest 'Metro' is only minutes away.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Denmark", "Title": "“Really nice and central”", "Author": "DalleJensen", "ReviewID": "UR116008762", "Content": "My wife and I stayed around Easter and had a nice room with a view to St Sulpice. The hotel is typically Parisian, small and compact (the typical one person-one suitcase elevator), but with a nice atmosphere and on a back street from the boulevard in the center of the St Germain district. A couple of nice wine bars just across the street, where you shouldn't mss the indoor market in the small shopping center. A plenty of excellent restaurants within two minutes walk.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Surfers Paradise, Australia", "Title": "“Great little hotel”", "Author": "Molly255072", "ReviewID": "UR115876341", "Content": "Spent 4 nights at this hotel. Great position at St Germain within walking distance of Paris sights and lots of restaurants and cafes. Hotel is in back street and many nearby cafes etc but we didnt hear any noise on the top floor. Lovely room-small but adequate. No shower in bathroom was the only complaint(husband's not mine as I enjoyed a good soak at the end of the day). Staff were reasonably helpful but not much English. Lift was very small so needed to make several trips to 6th floor with luggage but not really a problem. would recommend this great little hotel to anyone wanting a convenient reasonably cheap hotel in Paris.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great location, great value”", "Author": "magnolia88", "ReviewID": "UR113087859", "Content": "This is a very nice hotel for a 2*, and the location just steps from the Mabillon metro station cannot be beat. The mall across the street offers lots of dining and shopping options, including a cheap breakfast for less than 5 euros. We had room 104, the junior suite, and it sleeps 3. It's perfect for a couple traveling with a child because there is a second bedroom with a little space to spread out. The only downside was that the tiny elevator wasn't working, but we were only on the first floor (US second floor) so it was not a problem for us. Another negative might be that the street facing rooms can be a bit noisy but I thought the windows did a good job of blocking the noise. Otherwise, this place is great and I'd stay there again.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“location, location, location”", "Author": "cya", "ReviewID": "UR112446161", "Content": "This place couldn't be more convenient for exploring Paris and the 6th. It's near several different metro lines, shopping, restaurants, cafes. There is free high speed wi fi. Staff is friendly and helpful. The price is reasonable for Paris. There is a great little shopping arcade directly across the street. Do explore it fully, and you'll find a food market inside! Breakfast is worth the 11 Euro price. Nothing exceptional but you'd pay far more on the street for a similar petit dejeuner. Rooms are clean and typical size. Elevator tiny, mais c'est normal. The area can be a bit noisy at night, the bar across the street and early morning trucks could be a problem, especially in the warmer months when your windows are open. We found it to be just a minor issue. Highly recommended.", "Date": "June 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Nothing Wrong with this place”", "Author": "jobetim", "ReviewID": "UR92502957", "Content": "Excellent little 2* hotel, comfortable quiet room, decent breakfast, friendly staff, free internet access in the reception area. Recommended.", "Date": "January 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“The best way to experience Paris”", "Author": "Spinfamily", "ReviewID": "UR91743700", "Content": "Stayed during late December 2010 early 2011. Stayed in the family room and our daughter enjoyed the fact she had a small bedroom to herself. The hotel is well placed for walking to all major sites with Notre Dame a 10min walk away. Metro lines nearby (a 2 min walk) and the staff at the hotel were attentive and helpful - we arrived at 8am in the morning and were able to leave our luggage and return after 10.30am to our room. Would have no hesitation in recommending this hotel and would stay at Le Clement again. The only thing missing from the family room was a small fridge but then the weather was so cold we were able to put our drinks out on the small flower balcony to keep them chilled. Just around the corer from the hotel is an excellent bakery not to be missed.", "Date": "January 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bedford, Indiana", "Title": "“Great place to stay in a great location”", "Author": "Jim-Claudia", "ReviewID": "UR86901266", "Content": "Clean, comfortable and convenient. We have stayed in Hotel Le Clement on our yearly visit to Paris for the past two years and will stay here again on our next visit to Paris. Some rooms are small, but our room this past summer was very spacious and very nice. Staff was friendly and accommodating. Nice location in a very safe part of Paris, only about 2 blocks from Blvd St. Germaine. Close to Mabillion and Odean Metro stations. Close to some very good restaurants (such as Chez Fernand), bars (such as Coolin' Irish Pub), cafes and pastry shops. Very good shopping across the street and on nearby Blvd St. Germaine. Walking distance to the Seine, Notre Dame, the Louvre, Jardin de Luxemburg, etc. This hotel is great value for the money, especially considering the very nice accomodations and the great location.", "Date": "November 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rio de Janeiro, RJ", "Title": "“A very pleasant surprise”", "Author": "Luizjb", "ReviewID": "UR80380541", "Content": "The Hotel Le Clement was a very pleasant surprise! Our room (Superior Double Room, 210) had a very good size, the bathroom was great (even had a bathtub), not to mention the beautiful decor and the Paris style. The breakfast was very nice and worth the price. The location is very good, close to many bars and restaurants, two metro stations, and several large stores. The staff was not so receptive and did not speak English very well, but did not cause any problems. I recommend!", "Date": "September 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chester, United Kingdom", "Title": "“Lovely hotel in perfect location”", "Author": "therisks", "ReviewID": "UR76348017", "Content": "We travelled as a family of 4 (2 teenage children) and grandparents and stayed in 2 mini suites - one child with parents, one with grandparents. The suites were perfect as there was a door between the rooms giving the children (& adults) there own privacy. Size of rooms was adequate and not tiny as described in some reviews - maybe those comments relate to double rooms. The hotel staff were very friendly and helpful - I think a little attempt at speaking some French even if only bonjour, merci etc. works well when staying anywhere in France. The breakfasts were excellent if a little pricey. We ate in 2 mornings for convenience and out at local cafes the other 2 - certainly a cheaper option and there are many street cafes nearby serving croissant, french bread, orange juice & coffee/tea/chocolate for about half the hotel price. The location could not be better - metro station just around the corner, cafes and restaurants in all the local streets - we ate nearby every night and were spoilt for choice. Many sites are within walking distance including Notre Dame, Luxembourg Gardens, Musee Dorsay, River cruises etc. and all other sites just a short hop away on the metro or bus. Thoroughly recommend this hotel and plan to go back again some day. Yes, there can be some noise from the bars across the street but we fell asleep very well with a babble of voices in the distance. A couple of nights were quite cool and with the window shut we could here virtually nothing. Oh yes, and the fabric wall coverings are a fantastic feature of this hotel.", "Date": "August 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“Small boutique hotel well located and the smallest room ever!”", "Author": "Louis100", "ReviewID": "UR74852447", "Content": "Le Clement is located near the Luxemberg Gardens about a 10 minute casual walk. There are plenty of restaurants and cafes nearby and shops as well. It is also a 10 minute walk to the nearest hop-on hop-off bus ...if you are visiting Paris for the first time and have time limitations, this is a great way to get around and see the major tourist attractions. The hotel itself is small, friendly and provides a good breakfast. The lift fits 2 people and nothing else. The winding staircase is not surprisingly quite narrow. We were able to obtain cheap rates through a special deal they had advertised so I suppose I can't complain too much about the room, but it would have to qualify as the smallest hotel room in the world! ...a double bed and no room to move, in fact the bathroom door could not open fully because of the bed. The bathroom itself was very small and a very tight squeeze...beware if you are not of small stature! If all you are after is a bed, shower and access to breakfast, and don't suffer from claustrophobia, then this is ok. I would stay here again but only if I could get a larger room.", "Date": "August 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great location”", "Author": "CaillouSienna", "ReviewID": "UR71963322", "Content": "Excellent location, wonderful restaurants nearby, good breakfast, friendly and accommodating staff. Would definitely stay there again. Rooms are small but as expected for an old style French hotel. WE had a room at the front of the hotel but did not find it noisy AND it was really nice to have air conditioning considering the 35 degree weather.", "Date": "July 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Lovely hotel”", "Author": "LondonRuby", "ReviewID": "UR65789252", "Content": "I was very impressed by this hotel. It was very clean, nicely decorated (I loved the fabric wall coverings!) and the breakfast was fantastic. We stayed over a very hot weekend in a room facing the street, which did get a noisy on Saturday night - but then again it was the weekend of the Heineken cup so there were a lot of rugby fans celebrating / commiserating. I was pleasantly surprised by the size of the room after reading some of the reviews here. The front desk people were fine too - gave us ice when we wanted some and perfectly polite if not effusive. The situation is great as you can walk to the Ile de la Cite, Jardin du Luxembourg and Latin Quarter in minutes although it is an expensive area to eat in with the exception of Polidor (41 Rue Monsieur le Prince) which we loved. If you like hats A La Recherche de Jane at 41 Rue Dauphine is well worth visiting. Madame has an instinctive feel for the hat that will suit you and although they're not cheap they are beautiful, you can try on as many as you want to and the welcome is a million miles from posh hat shops in London!", "Date": "May 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oslo", "Title": "“Small but ok”", "Author": "trondbro", "ReviewID": "UR60749725", "Content": "This hotel is small and has quite old style rooms. But its kind of nice. The location is of course among the best. So all in all..ok.", "Date": "April 8, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Cramped but excellent location”", "Author": "junichiconundrum", "ReviewID": "UR52960125", "Content": "Stayed at Le Clement in December 2009. Tiny-tiny rooms but clean and well organized We did not have enough space for our bags and us and had to lay them awkardly across the floor and bed. The breakfast is awesome and well worth the 11 euros they charge for it. However, I think they need to do something about the quality of staff at the reception desks. They just seemed really unfriendly like they were doing us a favor. They also messed up a couple of times where we ended up over-paying for certain items yet the staff seemed completely unapologetic. I don't know if its just a french thing but the staff is really snooty and completely unaware of the basic principles of good customer service. Tiny elevator - size of a broom closet. That being said, the location is excellent, the facilities are well looked after and clean. Slightly overpriced for what we paid. Will try another hotel next time.", "Date": "January 8, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "pittsburgh", "Title": "“perfect location in our favorite city”", "Author": "supertraveler24", "ReviewID": "UR46279852", "Content": "This was our fourth stay at Le Hotel Clement, and we will return. The location is perfect for us, the rooms are very comfortable, clean, and cute with air conditioning ,and every room has a shower (hand-held) in the tub. There is very little help or recognition from the front desk, but they are willing to answer simple questions. There are many, many good and inexpensive (for Paris) restaurants in the immediate area, all within a short walking distance. Even th;e rooms facing the street are quiet, it's not a heavily trafficked street. The rooms are not large but are more than adequate in size. We have stayed in many hotels in Paris, but for price and location the Hotel Le Clement can't be beat.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Hudson, MI", "Title": "“Great location--clean rooms”", "Author": "jojos77", "ReviewID": "UR45732897", "Content": "Came back from 2 days in Paris and enjoyed ourselves immensely. The location of le clement made traveling around Paris a breeze. It is located one short block from the Mabillion stop on the Metro but we walked much of the time. It is about 1/2 mile from Notre Dame and all of the fun on the Left Bank. There are many bistros, cafes and restaurants within a few blocks which allow you to truly taste your way around Paris. The front desk was helpful and the cleaning staff friendly and efficient. We had a small suite with an in room bathroom. It was a good thing we had the extra small bedroom otherwise I am not sure where we would have put our luggage while in use. The bed was comfortable. We had a street view and kept our window partially open at night. There is construction nearby so there are noises but nothing that would deter me from asking for the street view again. It was nice to look out over a small part of Paris each morning. There were flowers in the windows that added to the charm of a small Parisian hotel which is what I was looking for when I found this place. I would definitely stay here again. The left bank area was my favorite part of Paris and this hotel was an easy walk or Metro ride to the middle of the action.", "Date": "October 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "AllerÃ¸d", "Title": "“The Best Location”", "Author": "MCAllerÃ¸d", "ReviewID": "UR33996401", "Content": "We have stayed in this hotel several times - and will come back. The location is perfect, the Mabillon metro station is a few steps away, and the street is quiet. We have had different rooms, and I would recommend that you ask for one view a view to St. Sulpice. We have been offered very good service and the price is very reasonable. There are many good restaurants within walking distance.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Superb location”", "Author": "painter2808", "ReviewID": "UR30788175", "Content": "The location of this small hotel is absolutely superb. The rooms are miniscule but beautifully decorated and clean. We were disappointed with the service however. It was at best indifferent, especially the weekend staff. Would go there again though because of the location.", "Date": "May 26, 2009"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "nevada", "Title": "“Great Location”", "Author": "kela2", "ReviewID": "UR20480322", "Content": "The location was great! Metro was just one block down and made it easy to get all around Paris. We loved the neighborhood as well, very lively at night with lots of restaurants and cafes.The staff was friendly and helpful for any questions that we had. Our room was small as expected but very clean. Our room faced the street and I didn't find a problem with noise after about 10pm. I thought this was a great find for the price and location and would stay here again!", "Date": "September 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "wellington", "Title": "“loved the hotel”", "Author": "joanWellington", "ReviewID": "UR20235306", "Content": "had a lovely 3 days at the Le clement with my family with 3 teenagers. Our room was small but clean and very quiet. The girls room was more spacious and lovely with a bath but they said it was a little noisy at night with the bar across the road. The breakfast was great with plenty to eat. The location was great as we had caught the Eurostar to paris and then took the metro to Mabbion which was a minutes walk from Le Clement. The staff were not overly helpful but that didnt really worry us too much. I will return to le Clement next time.", "Date": "September 20, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Sydney", "Title": "“Room at the bottom of a mine shaft”", "Author": "BluewrenSydney", "ReviewID": "UR16769777", "Content": "Staying there at the moment and I couldnt agree more: Horrible. We have to be in the worst room in the hotel. bottom floor over metro line; no light at all and scaffolding outside the window: dreading tomorrow when workmen return. rude staff who walked away from me when spoken to. never again and no chance of moving rooms = hotel full.", "Date": "June 8, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "chicago, IL", "Title": "“Terrible construciton problems at Hotel le Clement”", "Author": "cherikm", "ReviewID": "UR16698136", "Content": "Just returned from five nights at Hotel Le Clement in Paris. I had booked a \"courtyard\" room, which was supposedly much quieter than the streetside rooms. Unfortunately, the \"courtyard\" was really an airshaft between two buildings, and the city of Paris had decided to do construction on the adjacent street which necessitated completely blocking in the courtyard.. All the windows on the \"courtyard\" were covered with scaffolding, (we tried three of the six floors), which meant zero light, zero air flow and lots of noises during working hours. We figured it was probably a fire hazard as well, since there was no access to the outside from the room. It was totally eerie to stay in a room with absolutely no natural light, and we had to request that the air conditioning in our room be left on constantly to give us some air. (The air conditioning is controlled by the front desk, individually for each room.) Fortunately, we spent most of our day sightseeing, so the noise (giant hunks of flying cement crashing against the building) during working hours wasn't as much of a problem for us as it was for many others staying in the hotel. Everyone was complaining, and the only compensation offered was a ten percent discount for the inconvenience. One family with a baby was practically in tears, since they were planning on nap times, which were an obvious impossibility. The desk staff suggested they take the baby to the park to nap. Beyond this (major) problem with the room, we loved the location, the lobby was very nice, and the room, although not huge, was what we've come to expect in Paris at this price.. Rooms over the street would be fine during the day, but quite noisy at night, since the hotel is directly across from a large outdoor wine bar with people partying till late at night.", "Date": "June 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nailsworth, United Kingdom", "Title": "“top location”", "Author": "CheltenhamGeorge", "ReviewID": "UR14492725", "Content": "Fantastic Location in St Germain des Pres - 2 minutes from Metro. We stayed in a good sized room with double and single bed facing the street. Nice decor. There was a bit of noise from revellers late at night but not bad enough to put you off. We have been to St Germain three times now and found this the best combination of location, quality and price. Too many excellent restaurants, bars etc to choose from. The best restaurants are in this part of town rather than the latin quarter where they seem to be getting more tacky. Highly recommend the Brasserie Vagenende if you are planning to stretch the wallet, but avoid the Brasserrie Lipp at all costs (unpleasantly rude and aggressive waiters, high prices and poor value). We also loved Le 24 wine bar / restaurant on Rue St Andre Des Arts (a small street behind 130 Bd st Germain). Genuine Perigord specialities(coq-au- vin etc) and good wine in an informal amosphere. Also recommend the market opposite the hotel for beautiful displays of fresh fish, meat and fruit.", "Date": "March 24, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Clare, Ireland", "Title": "“great location”", "Author": "IrelandLaura", "ReviewID": "UR12189768", "Content": "We stayed in this hotel for a short break in Paris and the location is just perfect! It was my fourth time in Paris and I wouldn't say it was the best hotel I've stayed in. The rooms are tiny! I know that Paris rooms are not big but I really found our room to be smaller than any I've stayed in. We booked the room in Oct and having read previous reports i asked for a street side room but did not get one. I was disappointed about this gived our early booking. One problem I found with the room was the heat. The room was roasting when we arrived so we turned off the heater but still had to keep the window open to keep ourselves cool. This happened every night as the cleaners turned it on during the day so it was roasting when we came back! Also, the noise from the corridors was very load. There were people staying around our room who were talking to each other on the corridors and they may as well have been standing in our room. The cleaners would also start vacuuming outside our room at about 9 so there was no chance of a lie in. I don't think I'd stay in the hotel again but would try and find another close by as the location is great.", "Date": "January 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Falmouth, United Kingdom", "Title": "“small but perfectly formed!”", "Author": "housered", "ReviewID": "UR8749931", "Content": "Having seen some good reviews on Tripadvisor we were optimistic that our friends who had decided where our party was going to be based had made a good call. We were not disappointed - cosy, bijou and beautifully appointed this is a great place to base yourself while in Paris. Rooms are small - well the \"junior family suite\" (we had a daughter in tow) which we had was, but it didn't matter as all we needed it for was sleep. Heavily patterned fabric on the walls brought back re-assuring memories of post war French \"good taste\" in decor - wonderful in retrospect, ghastly at the time! Breakfasts were adequate - self service in the pretty little dining area at the back of the foyer. The foyer itself is a delight. Position is great - next door to a very posh market which helps give the hotel a feeling of light and space. I look forward to returning to Le Clement.", "Date": "September 18, 2007"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Israel", "Title": "“Quite and central location”", "Author": "RACA", "ReviewID": "UR7207770", "Content": "We were a mother with twin girls (12 years old). We needed a room for 3 in a safe and central location and had it all in Le Clement hotel. The room for 3 is lovely, spacious, perfectly clean and well equipped. The room has a window to a quite street (not all of the smaller rooms have this important feature). The hotel personel was kind and helpful. I recommend not to take the breakfast, even though we didn't try it, because they charge 10Euro per person, and just outside of the hotel, on St. Germain (the main street) there is large variaty of good cafe's in various of price levels. We had chocolat chaud in Les Deux Magots (170 blvd, St Germain, 6th ) that was lovely and comes with a very friendly service and foods. But this is quite expensive, there are cheaper and nice \"coffee and cake\" style of cafe's just near by.", "Date": "March 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Stuart, Florida", "Title": "“Lovely Little Hotel”", "Author": "EKL1124", "ReviewID": "UR6650403", "Content": "I had a great stay at the Hotel Le Clement. I stayed in a triple room. It was a great size for European standards. Room was clean and decorated beautifully. Staff was very friendly and accomadating. Hotel is in a great location within walking distance of great restaurants and good shopping. It is also close to many of the sights. I would definetly recommend the hotel to anybody and will be staying here again on my next visit to Paris.", "Date": "January 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paia, Hawaii", "Title": "“Intimate, small hotel with charm”", "Author": "chiot", "ReviewID": "UR5947812", "Content": "I stayed at Le Clement two separate times on a recent trip to France, both at the beginning and the end of my stay in France. I found the rooms small, but nicely furnished and very clean. The staffis friendly and accomodating. If i had been traveling with my husband, I would have requested a larger room on the street, as the rooms on the courtyard at very small, but quiet. For the price, this hotel is a tremendous value in the 6th and retains much French character and charm. JH Maui, Hawaii", "Date": "October 13, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "2"}, "AuthorLocation": "Vermont", "Title": "“Small rooms but charming”", "Author": "drslamb", "ReviewID": "UR5473827", "Content": "Fantastic area to stay in. We really recommend staying at some hotel in this district. However, staying at Hotel Le Clement has its problems unless you're two very thin people. Actually we are two pretty thin people and had trouble coping with the room. I've never stayed in a room that small. It would be okay for one person, but it's so small that the bathroom door hits the bed when you open it and there is no place to open a suitcase except on your bed. It's nicely decorated and our room overlooked a courtyard. It was fairly quiet except for people using the bathroom in the hallway. By the way -- it has air conditioning. You just need to know that you have to ask at the desk to turn it on. Also know that the breakfast is not included. The hotel lobby is nice and the staff is great. The restaurants in the area are teriffic.", "Date": "July 17, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "New York", "Title": "“Sweet Hotel in Heart of Trendy St. Germain”", "Author": "A TripAdvisor Member", "ReviewID": "UR4896412", "Content": "A close friend recommended this hotel and when I explored the streets around it, I understood why. It is very close to the Mabillon stop on the Paris subway. Restaurants, bars and trendy shops are just steps away from the hotel. The hotel itself is very clean and cozy. Do not expect extensive amenitites or spacious rooms. My room was very tiny, but clean and the bathroom looked new. I peeked into a street-side room and it was bigger. I faced into what they called a courtyard, which was maybe an 8x10 narrow space with plants and vegetation at the bottom - certainly not a place where people could sit. The room was very quiet. The front desk was very helpful. I would definitely recommend this hotel.", "Date": "April 4, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Great Hotel in the Heart of Paris”", "Author": "RobertMMiller", "ReviewID": "UR4084071", "Content": "We highly recommend the Hotel Le Clement on Rue Clement, in the heart of Paris in the St. Germain Des Pres district. We could not have asked for a better location - so close to all of the great restaurants and shops in the St. Germain Des Pres. A short walk to the famous cafes: Cafe Flore, Le Deux Magots, etc. Plus, it's only one block south of Boulevard St, Germain and four blocks south of the River Seine and the Louvre. The neighborhood is very safe too. My wife and I spent our 10 day honeymoon here and were impressed at how friendly and dedicated the staff was. Our Room was clean and had all of the comforts to make our stay very pleasant. We would definitely stay at Hotel Le Clement again.", "Date": "November 3, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“Great Location!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4018841", "Content": "My husband and I stayed at the Hotel Le Clement for 5 nights in Sept. We had the best time, the staff was great. Always friendly no matter how busy they were. The location for us was perfect. We will always stay here, it was so close to everything, restaurants and grocery store. The Mabillion metro stop is only 1 minute away. We had an exceptionally clean and quiet room on the courtyard side of the building. We never heard a single noise our entire stay. The room was nicely decorated and spacious enough for 2 people with 2 big bags. We did have a twin bed room and noticed that not all rooms were the same as far as size. I think it is luck of the draw and we happend to have a llittle bit larger unit. We had a tub/shower combo without a shower curtain, but got the hang of things really quick. The A/C worked great, never a problem. The elevator is very small, so only 1 person with bags could go at a time. We were very happy for the price we paid (111 Euros per night) and would definetly stay here again. This was an excellent choice for us.", "Date": "October 13, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Naperville, Illinois", "Title": "“Construction at Hotel Le Clement”", "Author": "psa", "ReviewID": "UR3678979", "Content": "Hotel Le Clement is in a great location for sightseeing Paris. There are lots of restaurants and shops in the area. The neighborhood is safe and busy all evening. The problem with the hotel was that when we visited in June, there was major construction around the lobby, the breakfast room, and the staircase. There were no allowances or apologies for the inconvenience we experienced. We did not have breakfast at the hotel but found good places nearby. The rooms were very small but clean. The airconditioning was controlled by the front desk and managed to cool the room. If the price seems right, and if the construction is finished, I might stay here again for the location. There was really nothing wrong with the hotel, but then nothing special about it either.", "Date": "July 18, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Miami", "Title": "“Great location”", "Author": "bayhomes", "ReviewID": "UR3618197", "Content": "Great location in the heart of St. Germain, one block from Odean Metro on St. Germain Blvd. and surrounded by nice restaurants and across the street from an upscale fruit and vegetable market. 2 blocks from great Rue Bucci and Rue du Seine. Had a triple which was very small, as is typical. Recommend a room overlooking street. No locks on bathroom doors. My problem with hotel is that there was major construction on first floor. No breakfast room, dust, construction all day long. They did not apologize for the inconvenience, and basically one just went right up to the room. Very disappointing. With that said, location is great and desk was polite. Quaint but simple. I would stay there again if there were no construction.", "Date": "June 28, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "San Francisco", "Title": "“Clement- Under construction/no air cond”", "Author": "A TripAdvisor Member", "ReviewID": "UR3547871", "Content": "Just returned. The room we arranged by phone was not assigned and the hotel was full when we arrived. The 6th floor middle attic room is even smaller than most Paris hotels in this category, especially small with slanted ceiling. Did not have bed arrangement we discussed by phone, but good news is that only on the 6th floor can you personally control the A/C. The corner rooms on 6th floor were bigger. The person I talked to a week before about room config no longer worked there. She had committed to a room arrangement that didn't exist. We moved to Room 318( third floor corner), which was larger and what we requested, much newer bathroom, more light. However, A/C for all floors below 6th floor are controlled by main desk. A/C is turned on only if you call reception to ask. The A/C is a fan; it is NOT air conditioning. We stayed in several other rooms in France with A/C, so we know this hotel was not providing AC. Room 318 is next to supply room, and is noisy. The front rooms on the street are NOISY. Hotel lobby/breakfast area is under construction (hammering), as well as building nearby (major truck noise). In addition, this hotel is next door to free soup kitchen, so crowds show up early. The hotel is across from a shopping center with restaurants setting up tables early mid-day, and a prime location for 30+ motocycle parking. Hotel staff pleasant; probably a good rate for small, noisy location. Suggest checking out Hotel Bonaparte instead; similar category but less congested area.", "Date": "June 13, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Santa Fe", "Title": "“A happy Find, good value!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3314022", "Content": "Wonderfully situated on the left bank in the 6th! Double room with two beds, upstairs in the back with fresh air but no view. Quiet! Clean, Clean! Nicely heated for mid February. Good size bathroom. Very nice, English speaking personnel at front desk who were most helpful. Good location for wandering the smaller streets. In the middle of good neighborhood restaurants. Every place in Paris is easy access with two Metro stops within a short walk of the hotel. The only way we traveled even from the airport was on the Metro.", "Date": "March 30, 2005"}], "HotelInfo": {"Name": "Hotel Le Clement", "HotelURL": "/ShowUserReviews-g187147-d197436-Reviews-Hotel_Le_Clement-Paris_Ile_de_France.html", "Price": "$140 - $221*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">6, Rue Clement</span> | <span class=\"extended-address\">6th Arr.</span>, <span class=\"locality\"><span property=\"v:postal-code\">75006</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "197436", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/92/f0/92f09f30fc6a71e7acd2bb1f369bdbdd3large.jpg"}}