{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St Albans", "Title": "“Excellent hotel!”", "Author": "spankman", "ReviewID": "UR125396850", "Content": "Staff are fluent in English and friendly. Facilities are second to none. Location is brilliant. Spa is first class (as is the gym) Couldn't recommend this place highly enough.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dumas, Arkansas", "Title": "“Jewel in the City of Light”", "Author": "H_K_Peacock", "ReviewID": "UR124893264", "Content": "We stayed an entire week at this hotel in late January 2012 with white tablecloth breakfast service included in the Sceptre Tour that left us on our own. It has a beautiful quiet lobby with complementary newspapers and 24 hour concierge. The staff was friendly and went above and beyond to help with our problems not associated with the hotel. The room on fifth floor overlooking courtyard was charming, and marble bathroom was immaculate. It is about 2 1/2 blocks from Champs Elysee, near a grocery, restaurants, several ATMs and St. Phillippe de Roule metro station. All in all, a lovely hotel experience we would repeat before chancing anyplace else. Highest recommentation.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Not to be missed”", "Author": "Apple C", "ReviewID": "UR124860515", "Content": "Brilliantly located near the Champs Elysee. Room was bright and spacious with separate sitting area and bedroom. Bathroom had powerful shower which is a rarerity in Paris. One small complain even though 4* did not have coffee making facility in the room, maybe it is a french thing! (am British). Coffee was 5euro a cup, so not that cheap but overall very happy with the hotel. Breakfast was also good", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“A very pleasant stay”", "Author": "PALMITO Y", "ReviewID": "UR124503454", "Content": "I have just ended a stay in the Rochester Hotel Champs-Elysees it was very pleasant stay. This hotel hotel is ideally located in the axis of the Champs Elysees. The staff is very helpful and compétant. I was warmly received at the reception. The Rooms are in e very modern style and spacious, and recently refurbished. The hotel propose a very pleasant and very comfortable SPA particularly after working day. This SPA services are included in the room price. It's really to be noted. The morning breakfasts are copious. The staff is really compétant and so nice. I go to Paris for business twice per month and this hotel is really one of my favorite adress to sleep when I go to this district.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Brilliant location”", "Author": "cotty76", "ReviewID": "UR124340897", "Content": "We have just got back from a 3 night bed and breakfast stay. The location in regard to the Champs Elysees, Louvre and Eiffel Tower is really good, all in walking distance (in the summer months you would certainly get the most of the location.. it was very cold in February!!!). The hotel was really nice, clean and tidy. Staff were polite and helpful. Our first night was spent on a fourth floor room overlooking the road to the front. The room was really hot and the road quite noisey (it didn't get much quieter even in the middle of the night). We went to the reception in the morning and they arranged for us to be moved straightaway to a room overlooking the courtyard on the 6th floor - it was bliss, really quiet! The staff were very helpful and obliging. The breakfast was good, but if it is not included in your rate, not the most economical. would recommend this hotel.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Peekskill, New York", "Title": "“Wonderful Hotel”", "Author": "wmthorpe", "ReviewID": "UR124207697", "Content": "The pricing included: Bottle of wine, breakfast for two each day, 2 tickets to River Seine Cruise. Very clean", "Date": "February 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bristol", "Title": "“Second Good Stay at this hotel”", "Author": "TheBristolJohns", "ReviewID": "UR124107157", "Content": "This hotel is well located close to public transport and the Champs Elysees, so good too for the main tourist / site seeing opportunities. The hotel is pleasantly decorated in a vaguely French / Parisian style. The rooms I have stayed in have been quite large by Paris standards and well equipped, very clean and warm with thick curtains and fabric clad walls. The staff can be friendly and helpful, equally they can be cold and unwelcoming and superior - so a bit French, really, in my experience! The breakfast is good but expensive at 25 euros - good breakfasts in local cafes can be had for less than 10 euros. Overall I'd say that this hotel is better than average, not quite as good as very good.", "Date": "February 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fairfield", "Title": "“Outstanding Stay”", "Author": "Pam W", "ReviewID": "UR123786615", "Content": "My trip to Paris was again made special by the staff at the Hotel Rochester. They had everything ready for my arrival (driver at the airport, room, and all requested reservations). Every time I needed something it was taken care of...directions, tickets, etc. I will definately contact Hotel Rochester the next time I am heading to Paris.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "london", "Title": "“Excellent hotel”", "Author": "pilou2", "ReviewID": "UR123552700", "Content": "Very nice location and super friendly staff. I was particulary impress by the Owner asking me if i enjoyed my stay in his hotel while i was having my excellent breakfast. The room are lovely, all newly renovated which for Paris standart is not very common. I would certainly go back and recommend it.... The spa was such a treat after my working day... excellent service overall.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Myers, Florida", "Title": "“Wonderful stay”", "Author": "kim550", "ReviewID": "UR123292773", "Content": "We booked this travel zoo hotel special at the last minute and were wonderfully surprised. The hotel did upgrade our room to a huge, courtyard view room (we celebrated our 30th wedding anniversary) and had our room ready after the long overnight flight to Paris.Our morning breakfast buffet( included in the price of the room) included omelets cooked to order and a great assortment of fresh french specialties(smoked salmon,cheeses,quiche,tarts).The staff was very hospitable and appreciative of our limited french, assisting us in english.Can't say enough about this hotel and location !!!!", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "uk", "Title": "“excellent hotel in a great location”", "Author": "rachieUk", "ReviewID": "UR123016097", "Content": "we stayed at this hotel for 3 nights during August. The Hotel is in an excellent location, there is a tube stop just a half minute walk away and the Champs elysees just a 5 minute walk. The mini bar prices were very expensive, but there is a supermarket across the road which was very useful. We had breakfast bought to our room every morning with a selection of croissants, rolls, yogurt and fruit. The room was bright, clean and nicely decorated and overlooked the small courtyard. All in all we had an excellent time and would recommend this hotel without hesitation.", "Date": "January 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Good choice in Paris”", "Author": "Camila A", "ReviewID": "UR122788116", "Content": "The rooms are classically decorated, always clen and confortable. Staff is always ready to help. Location is good for tourism. They've recently expanded the hotel and I didn't like the new room...seemed smaller and somewhat darker.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "limoges", "Title": "“Overall Very Good,particularly near Xmas”", "Author": "travellingthrough16", "ReviewID": "UR122221429", "Content": "We went to this hotel with the Travelzoo special offer- free room upgrade,free bottle of Chablis,free trip on the Seine (Bateaux Mouches) and free breakfasts. There was an initial glitch- i tried to book online for 2 nights, they had a site problem, and booked me in for 3 nights at an entirely different time under the name of the previous booker!.However,this was speedily and efficiently corrected by their staff within 24hours, my credit card refunded, the correct amount charged and fees waived. So far,so good.As we were going in the week preceding Xmas,by train,and arriving Paris just after 0800, I contacted concierge service re leaving our bags early,until check-in- again prompt positive reply.On our arrival,we were delighted to be told we could check in immediately (0920!) so we in effect gained an extra hassle free morning in Paris. The room we got was superior,front facing,4th floor-- very good, but no way would I ever pay the advertised 425euro room rate. The room was super-heated, and opening the windows lets in a LOT of noise from the road outside,a one-way street leading immediately onto the Champs Elysees.However, for what we paid on the offer,we were extremely pleased with everything about the room. The breakfast is expensive at 25euro, if you have to pay,but was excellent- not just continental buffet, but bacon,eggs,sausages,omelettes to order, and the breakfast room staff- like everyone else in the hotel- were excellent. We live in SW France where customer service is at best variable,and were not expecting great service in the Capital,so it was a pleasant surprise.. The only disappointment was that the bar was closed- due to Xmas week?!--as we had hoped to just pop down for an easy evening drink without needing to go back out after walking around all day. The hotel is ideally situated for restaurants/cafes /bars etc, ans 30 seconds from a Metro station and 3 mins walk from the fantastic Xmas market on Champs Elysees. The leisure facilities were a little claustrophobic for me,being below ground an d heated to a high temperature, but seemed very good- I suffered about 2mins in the hamam! In summary- great location,great service,very good price- we would return.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "N. Ireland", "Title": "“Excellent”", "Author": "Joannehan", "ReviewID": "UR121757778", "Content": "We stayed at this hotel only for one night in december. The hotel was beautiful and clean and very close to all the main attractions. The staff were very helpful and friendly. The rooms were lovely and very clean. I would definitely recommend this hotel and I plan to go back next year for a longer stay.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bakersfield, California", "Title": "“Excellent stay at Rochester Champs-Elysees”", "Author": "alastairdeacon", "ReviewID": "UR121725181", "Content": "We stayed here at the beginning of December for 3 nights. Wonderful, comfortable hotel just a few blocks from the Champs Elysees. We were upgraded to a suite, which was a nice surprise. We had the breakfast buffet every morning which had lots of variety. Fresh baked breads, the European style of breakfast with cold cuts, cheeses, yogurt. Also, a nod to the Americans/UK, by hot scrambled eggs, sausage and bacon. Plenty of food! We had 2 laptops and they gave us the wifi code for each so we could both be on at the same time. The hotel is just a block from a metro line the St Philippe du Roule. Just go out the front door turn to the left, and turn to the right at the light at the corner. The metro stop is right there. Being a few blocks from CE was nice as the prices go down as you get away from the main area, and you get a sense of discovering cute bistros and shops. We would definitely recommend this hotel and would be very happy to return.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“All around good hotel, well located for business or first Time visit”", "Author": "RobertzRo", "ReviewID": "UR121681902", "Content": "This hotel is close to all first time tourist attractions, very clean, staffs are friendly. I speak french but staff always willing to help out in english. Prices all depend on which deal you get. Close to subway for travel if on business. Woul recommend", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Calgary, Canada", "Title": "“Great weekend away”", "Author": "Abby D", "ReviewID": "UR121497244", "Content": "Couldn't have asked for a better location and hotel for our weekend away. Very close to subway system and easy walk to most tourist attractions! Highly recommend staying here. One suggestions is plan your restaurants ahead of time! Have fun!", "Date": "December 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Danbury, CT", "Title": "“So-so entrance, impressive foyer, decent rooms with nice furniture”", "Author": "sanevoice", "ReviewID": "UR121489991", "Content": "The pluses: Impressive gold-themed lobby. Decent rooms with good beds and furniture - a little small with narrower corridors compared to our typical US hotels, but good by Paris standards, I suppose. Helpful and polite concierge and desk staff. Free WiFi. Good location though it's not on Champs-Elysees itself as the name implies, but a couple of blocks away from it. Very clean, and the bathroom has nice toiletries. Minuses: The street it lies on (rue la Boetie) is narrow and congested, with little parking space while you're checking in, if you're coming by car (not such a concern if you're arriving by taxi or using the subway.) The extras like meals or coffee / drinks are over-priced so we avoided these. The room was over-heated and it was hard to adjust the temperature down, though we solved this by opening the window (in early December!) but then there was street and traffic noise as we overlooked la Boetie. The desk clerk charged E13 extra per day for the 2nd person (me), saying our company negotiated rate was for just one person (my wife) though the contract said nothing about extra charges and the hotel incurred no extra expenses (there was no complimentary breakfast, or extra bed or larger room involved.) Also, other desk staff said there was no charge but it ultimately appeared on the bill. Very strange. But the helpfulness of the concierge in pointing us to places to see and how to get there made up for this. The golden lobby was so impressive that we took pictures of it. Overall, we enjoyed our stay.", "Date": "December 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston MA", "Title": "“Fantastic service right off the Champs Elysees”", "Author": "WBird66", "ReviewID": "UR121396030", "Content": "This is a charming hotel, with great amenities. The rooms are not large, but I've seen smaller ones. But very comfortable, with a large bathroom. My window faced the courtyard so it was very quiet. A delicious breakfast buffet, which is expensive at 25 euros, but it was included in my rate, so I was very happy with it. They even have a workout room downstairs which is quite good, and I seemed to be the only one using it during my stay. Free wifi, and they even gave me a 2nd key so I could be online with my PC and my iPad both. But the nicest thing was the staff. They really bend over backward to help you with anything you need.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Absolutely wonderful!”", "Author": "Rebecca L", "ReviewID": "UR121052502", "Content": "We couldn't have asked for a better hotel for our stay in Paris. The staff went above and beyond to help us from the minute we arrived. Our room was spacious and immaculate. We booked our room through a special and recieved breakfast as part of our stay. Our son left his iPod in the room and they have been very helpful about finding it and working with us to get is mailed. The location cannot be beat. We were walking distance from two metro lines and the Christmas market on the Champs Elysees.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Annapolis, Maryland", "Title": "“3 Blocks of the Champs-Elysees”", "Author": "Winterstime", "ReviewID": "UR120753815", "Content": "This hotel is very close to american standards yet still very French. The sleeping rooms are larger, the bathroom very large and nice. Very much a business travel type hotel. The sleeping rooms has all the appointments of a US business hotel, desk, comfortable chair for reading.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cowdenbeath Fife", "Title": "“First Visit to Paris and Disney”", "Author": "Bluebrazilian", "ReviewID": "UR120293776", "Content": "Stayed at this fantastic hotel with my husband and our grandson. Just fell in love with this hotel. Accomodation spotless, Very large room with windows opening over a courtyard. Buffet breaksfast was served in a spotlessly clean dining room which was \"compact and bijout.\" Service andf friendliness of staff \"Excellente\". On leaving the hotel and turning right you have a very short walk to reach the \"Champs de Lysee and the \"Charles de Gaulle\" Metro station (for Disney). Turn and look to the right and you have the \"Arc de Triumph\" and then turn to the left you can see a huge ferris wheel which is located at the Tullerie Gardens (outside the Louvre). If you enjoy the history attached to the French Revolution you will lfall in ove this place as the past is absolutely palpable. Disney was good for a day trip.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santa Monica, California", "Title": "“Nice souvenirs”", "Author": "Jeff W", "ReviewID": "UR120233269", "Content": "We had passed by this hotel four times a year for the last 15 years, the only personn we looked forward to met was the chief concierge Louis who was always looking after us. Unfortunatly he has left for another destination and we are really sad not to have somebody with that smile to let us know and discover that little restaurant that would had openned between our visits. Now the concierge in the evening doesn't smile at all and the only yrestaurants he knows is \"boef sur toit\" or any other less interesting one. We will come back to this hotel since the owners have made the most effort to keep their rooms nicer we stay on 702 always but this time we tried 202 and it is really nice....", "Date": "November 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "St. Albans, United Kingdom", "Title": "“Nice Hotel, Good Location”", "Author": "garethstalb", "ReviewID": "UR119989173", "Content": "Nice hotel, staff were friendly and helpful during our stay. Minibar in room very over priced as normal but there is a supermarket just down the road from the hotel which is well stocked and good price so recommend going there and just using the minibar to cool the drinks! Breakfast was ok but expensive for what it is! Apart from those things would stay at the hotel again as was pleasant and very well located.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“Beware rip off breakfast charges”", "Author": "gggen400", "ReviewID": "UR119929000", "Content": "Beware the cost of breakfast at 25 euros per person. Much better to eat at a local cafe at a fraction of the price.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“B & B on the 10 and 11 September 2011”", "Author": "h279e276", "ReviewID": "UR118930655", "Content": "My wife and I thought this to be a very comfortable hotel within easy walking distance of most of the main Parisian attractions. Our stay was marred by our room (102) being subjected to irregular banging noises during the night - a noise similar to that made by a swing door - is room 102 over the kitchen? We complained in the morning and were immediately offered an alternative room. We did not accept as we were only staying one more night. We are unable to comment on breakfast as we found the delay for service unacceptable. We would stay at the Rochester again but not in a room on the first floor.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arlington, Virginia", "Title": "“Wonderful stay, fantastic location”", "Author": "JMP10910", "ReviewID": "UR118588253", "Content": "My husband and I were traveling with another couple through Europe this past August, and staying at the Hotel Rochester Champs-Elysees for 3 nights was the perfect way to end our trip! We chose the hotel when we found a great deal on TravelZoo, and we were so glad we found it. My husband and I were on the ground floor overlooking the interior courtyard and our room was clean, comfortable, stylish, and quiet. Our friends were on the 8th floor and had a great view of the top of the Eiffel Tower. Both were great rooms, so I don't think you can really go wrong! We had the breakfast buffet included with our room rate and it was delicious--great selection, and I still have the pain au chocolat on the brain! The staff was incredibly friendly and helpful. We made an attempt to speak with them in the little French we knew, but they were more than gracious about communicating to us in English as well! The location is perfect with multiple metro stops nearby and less than a 5 minute walk to the Champs Elysees. If we had been paying full price this hotel would have been outside of our budget, but look out for travel deals and if you can afford it, this is a fantastic place to stay!", "Date": "September 25, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Florida", "Title": "“great experience”", "Author": "jarnina", "ReviewID": "UR118197562", "Content": "My wife and I just returned from a 3 night stay following a river boat cruise.The hotel was beautiful,the staff friendly and helpful and the location has to be among the best in Paris for access to the various attractions in the city.It was just a few minutes walk from the Champs-Elysee and very close to the Metro,which is very easy to navigate. We had a special rate with breakfast included and were upgraded to a junior suite which was spacious and had a partial view of the Eiffel Tower.The breakfast was very good and the dining staff very courteous.I would highly recommend the hotel,particularly when a discounted rate is offered.", "Date": "September 16, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "kent", "Title": "“GREAT HOTEL, EXCELLENT LOCATION”", "Author": "holidaylover71", "ReviewID": "UR118100550", "Content": "I have just returned from a three day break in paris and stayed at the hotel rochester. The hotel is excellently located close to the metro and took around 20 mins to get to from Gare Du Nord where the Eurostar goes into. The hotel looks very impressive and the rooms are very smart and spacious. The staff spoke excellent english and were very helpful when we needed any assistance. The breakfast was very nice and you could have as much as you like, it catered for everyone and again the staff were very pleasant. The hotel is in a great location to get to all the main sites very easily and there are also several bars and restaurants along by the hotel which are worth a visit. Charlie Birdy is a nice bar/restaurant with good music and lovely cocktails and is just a couple of minutes walk from the hotel. I would highly recommend this hotel for anyone visiting paris and if you can get a room when its on special offer I would grab the opportunity to stay there.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Chicago, IL", "Title": "“Location + Soft Furnishing = A pleasant stay.”", "Author": "Carrie R", "ReviewID": "UR117671802", "Content": "My husband and I were in Paris on business and stayed in a double room at the Rochester for about $200 euros a night. The location can't be beat - so close to the underground and a ton of restaurants, shopping, cafes and bars at your doorstep. A little more commercial and a little less neighborhood feeling here, but great for business and pleasure. I really liked the furnishings at this hotel, it feels very parisian, with french doors. The room was small, but so are all Paris hotel rooms, so no surprises there. We had a room overlooking the street, which I think was preferable to overlooking the courtyard. Bathrooms are a little tired and small, but clean and adequate for just 2 nights. We appreciated having a few newspapers available gratis in the lobby. The included breakfast was so so. Standard continental fare and not sure I would've paid extra for it. However, it was included in our room rate, so we didn't pass it up. All in all, a fair price for a comfortable stay.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Bundaberg, Australia", "Title": "“Very nice hotel, great location.”", "Author": "Sandra M", "ReviewID": "UR117535496", "Content": "There was a family group of 11 people staying at this hotel for 3 nights. The location is very good as the street goes onto the Champs Elysees & is 5 minutes walk to the Arc D' Triomphe. There are a lot of good cafes & restaurants nearby. The hotel restaurant is quite expensive with breakfast at 25 euros but it was very nice. Rooms were clean & quite spacious.There is a spa at the hotel.The staff are very helpful.The metro is very close & the hop on hop off tourist bus can be boarded at Arc D' Triomphe.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Convenient location, great amenities for the price”", "Author": "BOSTravelHound", "ReviewID": "UR117366231", "Content": "Stayed here for the first 3 days of a week in Paris. We got a deal on Travelzoo for a great price that included an upgraded room, breakfast every morning, 2 tickets to the Seine river cruise and a bottle of wine–an amazing value for Paris. Our room was huge and very neat and clean. This hotel is close to several Metro stations and is in a good spot to see all the attractions on the right bank. The only drawback is the concierge wasn't very helpful making restaurant recommendations, but the staff was overall very accommodating, even letting us into our room hours before check-in after a long flight. The last 3 nights of our Paris trip we stayed in a hotel in the Latin Quarter and did not have a good experience for the same price.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great way to end the vacation.”", "Author": "Scouting_the_world", "ReviewID": "UR117129316", "Content": "I booked this hotel due to a Travelzoo deal that I found online. I was extremely and pleasantly surprised how nice it was. We stayed here the last 2 nights of our stay in France and it was wonderful. It was much bigger than the first place we stayed at, it was much cleaner and much more comfortable. The hotel is within a short walking distance to the metro and not far from Arc de Triomphe. Centrally located in the Champs-Elysees and all the shopping (beware shoppers, there is lots to lure you like Louis Vuitton, Hermes, Cartier and other wonderful eatery like Robouchon, Lauduree, and Pierre Herme). . The buffet breakfast was also good (though not worth 25Euro). The only downside was that I had to call the front desk for housekeeping to empty the trash in the bathroom. Would definitely like to stay here again if going back to Paris", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“A wonderful place to stay!”", "Author": "Mary S", "ReviewID": "UR116832561", "Content": "Hotel Rochester is not only beautiful, but the staff was wonderful! They were courteous and very attentive. Room service was very prompt and we never waited more than a few minutes for our order. The hotel was in a fabulous location with many shops. restaurants and main attractions very nearby. The breakfast buffet was great and it was nice that it stayed open until 2:00pm. Next time we will definitely get a larger room. There were 3 of us and we stayed in a \"standard triple\" room, which was way too small for 3 people. The 3 beds took up most of the floor space. Also, being from Texas, it would have been nice to have access to an ice machine, although room service did bring us ice every time we requested it. I would highly recommend Hotel Rochester to anyone! Staying here just enhanced our enjoyment of this amazing city!", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "East Retford, United Kingdom", "Title": "“Lovely. We shall return”", "Author": "Wynne70", "ReviewID": "UR116801435", "Content": "Just off the Champs Elysees. this comfortable hotel brings you to an attractive and vibrant area of paris. The Hop-on, Hop-off bus stops at the end of the road. The Arc de Triumph is a short walk away. There are many interesting bars and places to eat in th streets off the main boulevard. The hotel itself is beauifully appointed and the staff extremely helpful. Breakfast is available from 7am to 2pm!", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Calgary", "Title": "“adequate but pricy”", "Author": "firelaw", "ReviewID": "UR116318270", "Content": "Pleasantly appealing and nicely kept and serviced hotel but small rooms and pricy by north american standards. Try to get a king bed as the double beds are not all that great for size or comfort. These double beds seem to be the standard fare in the rooms. Best to book a room with breakfast included other wise it's 25 euros per person, and it's a nice breakfast but not worth 25 euros.", "Date": "August 5, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "London", "Title": "“Not worth the money”", "Author": "lauramaria36", "ReviewID": "UR116289581", "Content": "I was so disappointed in many ways with this hotel, especially since I booked the Hotel based on reviews here! We arrived at the hotel about lunchtime on the Friday. 3 concierge staff watched 3 women cart their bags in without an offer of assistance, which I thought was a bad start I have to say. I booked a triple room and especially emailed the hotel before we arrived to make sure the room was large enough and had 3 single beds. The room we entered was very small but European rooms are like this so I thought it was ok. Then I noticed the 3rd bed was actually a camp bed! With thick brown blankets on. Not good! When I spoke to the staff about this, they stated all they could do was upgrade us to a superior room with a double sofa bed for €40 each...we declined as we had already paid enough! The good points were that the breakfast which others found expensive was actually very good. The location was excellent too, just off the champs elysee...but in all honesty, you would likely find a finer 4 star for less money and greater service around any other corner.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Largo, Florida", "Title": "“Paris at your door”", "Author": "LoisJB", "ReviewID": "UR115967456", "Content": "From the moment we arrived at the Hotel Rochester to the day we left, we received wonderful service, lots of good information on places to eat, drink, and directions to get there. The hotel is ony a few blocks from the Champs Elysee, and within walking distance of fine restaurants, bistros,shopping, , the Metro, and the local bus lines. We found it very easy to get around Paris from this home base. The hotel accomodations are comfortable, and the addition of breakfast made the price of the room a bargain. We definitely would consider staying here again, if we are lucky enough to come back to Paris in the future.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "The Woodlands, TX", "Title": "“Lovely and comfortable in a great location”", "Author": "suitcasegirl61", "ReviewID": "UR115837717", "Content": "My friend and I shared a room which was ample enough for our luggage and purchases. It was clean and included everything we needed, although the hairdryer was antiquated and useless. Our room was on an upper floor facing the courtyard, which was nice and quiet and gave us a good view of the Eiffel Tower. The staff were accommodating and very pleasant. We left some of our luggage in the hotel's secure storage while we visited Provence for a few days and were happy to have an upgraded room waiting for us on our return! This hotel is conveniently located a couple of blocks off the Champs Elysees, with two metros and a bus just steps away. There are banks, boulangeries, restaurants, a washateria, dry cleaner and a grocery store just steps from the hotel. The breakfast is very overpriced - we suggest getting fresh pastries and coffee to go from the boulangerie around the corner instead. We recommend Hotel Rochester as a very good value and will definitely choose to stay there again on future trips to Paris.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "scotland", "Title": "“BEST HOTEL IN PARIS”", "Author": "caroledolly", "ReviewID": "UR115663295", "Content": "If you want perfection - this is your hotel. It's all creamy marble, mirrors and soft lighting and the staff, without exception, are amazing. Two minutes walk from the best shopping street in the world, I just didn't want to leave. My standard room was lovely and very comfortable and the breakfast each morning was superb (smoked salmon and scrambled eggs for instance!!) . I don't know how they train their staff to make guests feel they are the only person in the hotel - but they DO and every single aspect of this hotel is absolutely perfect. I have been to Paris often and stayed in various hotels - but I shall never book another hotel, as this one - as I said - is PERFECTION. Thank you Rochester - you made a wet and dreary Paris - SHINE. ----- Lady McLean-Smith.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "The leek", "Title": "“Spot on for location and an excellent hotel”", "Author": "Constructive", "ReviewID": "UR115329999", "Content": "We stayed here for 4 nights and can only say it's an excellent hotel, wonderful stay, lovely and clean and very comfortable. The only negative for us was that we had asked for a family room and the only place for a single bed was at the foot of the double bed which meant having to climb over the main bed if someone was at the dressing table. Breakfast was excellent and the staff were quick to clear a table. The selection was very good and always plentiful. It's only moments to walk to the Champs Elysee, there is a tube station literally round the corner from the hotel and eating places are plentiful. Would recommend to single/couples/family.", "Date": "July 13, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Houston, Texas", "Title": "“Wonderful Concierge Staff”", "Author": "TexasTraveler713", "ReviewID": "UR115166873", "Content": "The concierge staff was wonderful!! Thank you Dominic, Joel and the other wonderful men who helped us with everything from local maps and directions to confirming reservations and anything else we had questiond about. They made our trip so much easier - that kind of help in a country where you don't speak the language is priceless!!", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“Loved It! Perfect location”", "Author": "Mylo32", "ReviewID": "UR114809792", "Content": "Hotel staff very nice and helpful regarding day trips and restaurants. Location couldn't have been better. Was able to walk to the Arc, Notre Dame, Louvre, Eiffell Towere and many other museums.", "Date": "June 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hong Kong, China", "Title": "“Value for Money”", "Author": "davidkcm", "ReviewID": "UR110737076", "Content": "The room and bed are big. The breakfast starts from 7am to 2pm, although the selections are limited. The juice & pastries are most welcomed. The location is quite good & convenient to various attractions. A bottle of white wine is free from the hotel but the quality is not in high standard.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Budapest", "Title": "“Expected better for the price”", "Author": "J_A11", "ReviewID": "UR108678156", "Content": "The reception was poor. A new lady who did not seem to know what is happening in the hotel. For a hotel on that level un-acceptable. Training exists???? The bar keeper was professional and very kind. Breakfast organisation was not good. Too small room for so many guests. Guests who respect rules stay in the row waiting to be seated (for too long time) and some asian guests what do not respect anything just pass by as if nothing witholds them. No waiter organizes the all. 2 solutions: larger breakfast room or better organization. Excellent hotel for who likes a lot of mirors and a lot of copper and gold colored decoration. The rooms are quiet and employees are friendly. It is not their mistake if they do have not the required level. I do not understand why all hotels in the neighborhood are called Champs Elysees. ... You do not see them at all. Misleading web site (valid for all hotels around them)", "Date": "May 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "texas", "Title": "“Nice rooms but plumbing and walls need renovation”", "Author": "hb200805", "ReviewID": "UR107606119", "Content": "The hotel itself was a good value through tripadvisor. We found the room and bathroom to be quite large and clean. However, the walls are very thin. You can hear people using the bathroom and the plumbing was quite loud. Our room also had a strange smell similar to waste or sewer stench. Aside from that, the location to subway was less than a minute walk or three minutes if you use FDR entrance. It was very close to champs-élysées which was a huge plus for us.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Warsaw, Poland", "Title": "“nice hotel”", "Author": "ZosiaT", "ReviewID": "UR107250892", "Content": "I was staying in a standard room on the first floor. The room was very nice and clean, what I was missing was the coffee/tea making facilities. The hotel personnel were very nice and helpful- let me check in at noon even though check-in starts at 2 p.m. Breakfast was very good as well. At that time I thought it was good standard but nothing special for the prize and next time in Paris tried a cheaper hotel, which turned out to be a total disaster. Then I found out this neighborhood is just very expensive and the hotel was very extrmeley value actually!", "Date": "May 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Miami Beach, Florida", "Title": "“Not as good as you think”", "Author": "jpapl", "ReviewID": "UR106098731", "Content": "We stayed at this hotel for one day and we had mixed feelings about it. We got the travelzoo promotion and we were able to enjoy the cruise and the breakfast but we couldn't get the wine because they don't have room service at night. It was 23:00 and they couldn't deliver our wine(WHAT A JOKE) I tried to go and pick up the wine but no luck. The location is good and the room was ok. We had problems with the shower, it seems the glass curtain didn't prevent the water to reach the bathroom floor(what a mess) Breakfast was ok but what we really didn't like was the attitude of the receptionist Rude staff. I tried to request a late check out and the old grumpy old man said NO that the hotel was full and we couldn't do a late check out. My wife called later on and talked with a lady and she said YES, that we could leave at 1:00. Poor service. I bet you can find better hotels in Paris.", "Date": "April 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Good enough for the price we paid.”", "Author": "lazywill", "ReviewID": "UR103917904", "Content": "Extremely close to subway station \"Saint-Phillippe du-Roule\" which is a huge plus. We got our room rate of USD$421 for 2 nights through TravelZoo deal which included free breakfast, a bottle of wine upon arrival and 2 river cruise tickets. We were put into the standard room which is on the first floor, #53. Pretty roomy IMO but we are definitely not a big fan of the old classic decor. Walls are extremely thin since we could hear the kitchen staff preparing food every morning and also hear our neighbors \"getting it on\" at night (not a big deal since they only lasted about 3 minutes). Free wifi in the room, decent breakfast (absolutely not worth the 25 euro/person price if you have to pay out of your own pocket), and very friendly and helpful staff who spoke perfect English. We were a bit shocked at the end when we checked out that we were told to pay a 3 euro/night city tax. I asked if I could pay for it with my credit card instead of cash since I had only enough euro leftover for my wife and I to go to the airport. But the older gentleman (he's the only rude and grumpy one among all the staff) insisted that 6 euro was \"very small change\" and didn't let me put it on my card. It's not a big deal since it's only 6 euro but now my wife and I had to go to the bank again to get more money for us to go to the airport after leaving the hotel. Just wish that we knew about this beforehand so we could've prepared that money in advance.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pleasanton, California", "Title": "“Would stay here again! Pleasant stay!”", "Author": "themillers8020", "ReviewID": "UR102426575", "Content": "Rochester was in fantastic location, about a 10 min walk to the Arc and about a 20 min walk to the Eiffel Tower. All of which is reasonable to do in one day, however I suggest taking one of the hop-on-hop-off buses to really get around town. Champs de Elysees is an upscale area so expect nothing less. Restaurants are very close with lots of pastry shops, cafes and white table cloth dining but you can find more casual places as well. Breakfast at the hotel is basic but nice. Service staff inside the dining area were always very friendly and very accommodating. It was enjoyable to stop in and have a café and croissant and be on our way for the day… Hotel Front End staff were extremely helpful and spoke perfect English. For those who are nervous about the language barrier it never posed a problem for these Americans (not anywhere in Paris). I suggest brushing up on your manners in French, it goes along way! The hotel allowed us an early check-in which was great. Several times we had Concierge book us dinner reservation and call for a taxi upon departures. There was never problem and Concierge was always willing to help. Our room was on the 6th floor (7th in US standards) it faced inwards to the garden terrace below. We choose a Superior Room which had a well spaced living room area and a huge (by Paris standard) bedroom. It was nice having a desk area for free-easy-to-use wifi access. The bathroom was good sized and completely marbled. Housekeeping kept everything very tidy when asked. The room came equipped with two tv’s, dvd player, mini fridge, room safe and blow dryer. I would suggest bringing a little alarm clock as none of the hotel’s we went to in Europe had one! Soo odd! Overall I would completely recommend this Hotel and would definitely stay here again while in Paris.", "Date": "April 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent accommodation / location”", "Author": "Sophtuck", "ReviewID": "UR101272148", "Content": "We arrived at 1200, we waited 30 mins for room to be cleaned, once in room, very impressed, very clean spacious room. Excellent view, good bathroom, with fridge/mini bar. The location was best part of hotel, 30 secs walk to metro station which was brilliant for getting around a large city like paris, and 3 min walk to centre of champs elysee and arc de triumpe. We paid £420 for 3 nights thru cresta, well worth the price even though we only stayed for 2 nights because the 3rd night was free .", "Date": "March 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham, England", "Title": "“First Class Service in a Luxurious Hotel”", "Author": "RamblinBoy1", "ReviewID": "UR98665691", "Content": "My wife and I have just spent a very comfortable week at the Rochester. Everything was fine, from the moment we arrived straight through to our departure. The room, although only a standard, was very comfortable and the staff were all friendly, attentive and helpful. A huge choice at breakfast and it was always nicely prepared. A great location....Champs Elysees less than 5 minutes walk and a metro within 2 minutes. I knocked a point off the score for \"sleep quality\" because on our first night, a Saturday, we were disturbed, in our room on the second floor at the front of the hotel, by drivers honking their car horns in the street below and in the general vicinity until the early hours. Happily this only seems to occur on Saturdays as people try to get away form the local night clubs etc. We hardly heard a sound during the rest of the week as we slumbered peacefully in our huge king size plus bed. I have also knocked a point off for cleanliness, only because the cleaner seemed to have blind spot for the grime rim which formed around the bath. Otherwise, not a speck anywhere, the room always looking and smelling clean and fresh. We took advantage of the half price Travelzoo offer, which made it good value for money. Thoroughly recommended. Would love to return.", "Date": "March 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brussels", "Title": "“Nice hotêl, good situation.”", "Author": "svino", "ReviewID": "UR97936628", "Content": "I have now been a regular customer since years to that Hotel, mainly for business trip. The service is good; staff is very polite and competent. The rooms are decorated in an old classic style, beds are comfortable. The situation is very good (near the champs elysée). Breakfast is nice, although not amazing. I recommend this hotel for its good situation,nice rooms and friendly staff.", "Date": "February 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Lovely hotel, excellent location, wonderful staff!!”", "Author": "Finnatic1223", "ReviewID": "UR95582708", "Content": "Quick trip from NYC, we stayed over New Years. Lovely hotel, great staff, excellent location. Located about 2 blocks off the Champs Elysees. Walking distance to Arc de Triomphe. We walked over to Eiffel tower easily. The room was small but lovely, good bathroom over looked the garden below, great heating! The breakfast was excellent (it was included for us), great little bar. Metro stop close by. Very clean, quiet. Tiny 2 person elevator, which was hilarious but the hotel is building another one. Would definitely stay again! And don't be worried if you don't speak French, the staff is wonderful!", "Date": "February 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "bromley kent IK", "Title": "“Excellent location clean and quiet hotel”", "Author": "anne9837", "ReviewID": "UR95326407", "Content": "So close to the Metro; rund the corner from teh Champs Elysee; close ot the Grand Palais; fantastic location Very comfortable room, nice bathroom adn very quiet. Helpful staff, most enjoyable stay.", "Date": "February 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Great location with lovely room and great breakfast!”", "Author": "Fi0naP", "ReviewID": "UR95269685", "Content": "We were able to get a great package deal including breakfast, Seine cruise and a bottle of white wine. The room was lovely and spacious, and 5min walk to the Champs as well as close to a Metro station. Staff was lovely and must say the breakfast was great, lots of variety, fresh baguettes & croissants as well as hot food (bacon, scrambled eggs, sausage etc)!", "Date": "February 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“great hotel in a great location”", "Author": "jackk_11", "ReviewID": "UR94661349", "Content": "We stayed for 4 nights in a junior suite which was large by Paris standards. Very comfortable - good quality king size bed, nice pillows. Bathroom was large, modern and clean with plenty of towels. Nice lobby, helpful staff. Only drawbacks was the small elevator, as they were repairing the (I aaume bigger) main elevator as well as the cost of breakfastl.. Breakfast buffet or room service continental breakfas ( we didn't have either one) were both overpriced - an additional 25 Euros PP! Nice little health club. We'll go back.", "Date": "January 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Wonderful Hotel, Exemplary Service!”", "Author": "BagelCardiff", "ReviewID": "UR91108333", "Content": "I have to agree with the majority of reviews - the staff provided an excellent service and the hotel itself was luxurious and our room large and well appointed. Can't wait to stay here again!!", "Date": "December 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“Perfect location, massive room (for Paris) and breakfast until 2pm.”", "Author": "Andysevenoaks", "ReviewID": "UR90620623", "Content": "The hotel is centrally located, just minutes from the Champs-Élysées so perfect if you want to be near all the sites (If you'd prefer an area with cheap, good restaurants then you may wish to stay in the Latin Quarter on the left bank). The hotel is moments from a metro station, if you don’t fancy walking too far. Inside the hotel is nicely decorated and has polite, helpful staff. The rooms are genuinely large with big beds, plenty of room to walk around and a bathroom that actually contains a bath. Another highlight is the breakfast, which really does continue until 2pm. Its worth considering having breakfast out and returning for the hotel “breakfast” at lunchtime. As you are right in the centre of the city then this shouldn’t take much time. I’d recommend the hotel highly.", "Date": "December 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Excellent room overlooking garden, great breakfast and close to all the sites.”", "Author": "zographou", "ReviewID": "UR89358450", "Content": "Special offer with Travelzoo made this stay excellent value. Offering something extra such as a river trip, inclusive breakfast encourages people to stay in this hotel - which would then bring return business and recommendations.", "Date": "December 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Great stay at the Hotel Rochester”", "Author": "PIMPDADDY1120", "ReviewID": "UR88927023", "Content": "I stayed at teh Hotel Rochester for my 10th Anniversdary and it was very good. I read reviews prior to deciding and most of what is said is true. Clean rooms, great location, nice staff (spoke various languages- which is a plus in Paris). Expect a business type hotel look and feel. It is medium size, clean and fairly new. But, charm and family style it is not. Think Marriott or Hilton. Location is key here. Right acros the street from the St Phillipe Metro station. That track connects witht he main A track that runs along the Champs-Elysses, Rivoli stops which you will find is the centrl, most traveled line for tourist attractions. You csn also walk 3 blocks to the Champs. There you have 4 blocks to the Arc di Trumph one way and 4 blocks to the Place de Concorde the other way. Also, shopping on the Rue Fuasberg Honore is 5 minutes walking for world class shoppes and galleries. This location is great! We had a street view room on the 3rd floor. There is street noise as the street in front is a side street, but used heavily to get to the Champs Elysses. So lots of honking and noise at all hours, even late night. There are also 3 gentlements clubs/bars accross the street which provide lots of noise to the street. I guess since the narrow street with tall building encloses the noise it amplifies and is heard. The windows do keep out most of it, but it is not a quiet place. Since we were out mostly sightseeing and came back so tired we knocked out and the noise did really get to us. I want to specifically thank the concierge, Luis, who was very helpful and truly went out of his way to make our stay fantastic. he arrange ticket to the museum, river baot rides, reservations, taxis, airport transfers, etc. All with a smile and with true professionalism. He is an asset to this establishment. Thank you Luis. We got a real value booking a special I received thru Travellzoo.com. We receive 50% off the rack rate, plus, free upgrade AND free breakfast for two. The breakfast alone saved us 25Euro per person per day. I highly recommend it.", "Date": "December 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great service and location!”", "Author": "I3ping", "ReviewID": "UR88837530", "Content": "This hotel is in a great location close to Metro and easy to get around. Staff are nice and friendly.", "Date": "December 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hampshire, UK", "Title": "“Good hotel in great location”", "Author": "ImATravelJunkie", "ReviewID": "UR88337589", "Content": "I stayed in this hotel for 2 nights, booked through a Travelzoo offer. I think my room was recently refurbished,, but don't know if they all have been. Room was a spacious double with a very comfortable bed. It's in a great safe and quiet location just 200m off the centre of the Champs Elysees.I would be happy to stay again at the price I paid, but that was a lot less than the rack rate.", "Date": "November 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Solihull", "Title": "“Really good hotel”", "Author": "YolandaBonilla", "ReviewID": "UR88216590", "Content": "My husband and I been in this hotel for two nights. We only have nice things to say about the staff and facilities. Spotless room and helpful and polite staff. The only thing we would improve would be the bed size, we are used to a king size at home, so a double was quite small for us. We thought the breakfast was expensive at 25 euros, but we had it included in the reservation. Great location, two minutes from Champs Elysees and Montaigne Av., so if your intention is a shopping trip is perfect, but close to the Eiffel Tower and Triumph Arc too. We thougth restaurants around the hotel were expensive, but always depend of your pocket. Over all, really good hotel.", "Date": "November 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Great location, very good standard of hotel, friendly helpful staff.”", "Author": "Nigee65", "ReviewID": "UR88094171", "Content": "The hotel is in a very good location and of a very good standard. I would recomend it. But dont drink in the bar its very expensive!! The staff at the hotel are both friendley and helpfull. The hotel is situated 5 mins walk from the champs elysees. We walked most places but took the red bus on the first day to get our bearings. Lots to do and see all within easy reach by foot of the hotel. We had a great long weekend with nothing to complain about.", "Date": "November 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santa Barbara, California", "Title": "“Wonderful visit to Paris, loved the location and hotel.”", "Author": "jlp651", "ReviewID": "UR86748806", "Content": "A wonderful visit to Paris. The Rochester Champs-Elysees Hotel was great. In a good location close to restaurants and shopping and sight-seeing. Staff was very helpful and friendly.", "Date": "November 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Valinhos, SP", "Title": "“Great time in Paris”", "Author": "rmandl", "ReviewID": "UR84564684", "Content": "I and my wife spent a lovely time in Rochester hotel in last September/October. We checked several hotel before in tripadvisor I did the right choice to book it. The location is really great, very close to Champs-Elysses and with a subway station in the corner, what makes easier to go thorugh any part of Paris. Walking distance to Arc of Triumph, Grand and Petit Palais, Madellaine.... The staff was incredible, always very kind, helpfull and with special attention to all our needs, since get directions, suggestions, help to book hotels in other cities and so on. The room has a good size, with all basic requirements for a good stay. Our room had a view to internal garden with a font, and sleep was a pleasure with no noise to bother. It is necessary to say that the street has some moviment at night, as there are some restaurants and pubs close. There are grocery stores close to hotel what helps to urgent needs, and water. The negative think, it is that the breakfast is too expensive, 25 euros, what not encouraged us to try, as we have several close options in charming brasseries. The hotel has wi-fi access and the business center had computers for the guests. Certainly I recommend this hotel and will be there is the future. Ricardo Mandl (Brazil)", "Date": "October 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Great hotel !! ... Great location !! ... Great stay !!”", "Author": "Valycris", "ReviewID": "UR84144578", "Content": "What a nice hotel !! ... The location was wonderful, 2 blocks away from the Champs-Elysees, and there is a metro station right across the street. Buy the \"Paris Visite\" metro ticket and you will have no problem getting places. The hotel staff were all very friendly and helpful, they gave us great tips for good restaurants in the area. Wi-fi was free, the room itself was very clean and nicely decorated, very simple and modern, not too big and not too small, just perfect for me and my husband. Good bathroom, the toilette was leaking but it wasn't a big deal. The breakfast was great, American style with eggs, bacon, and lots of pastries, juices and great coffee ! ... all in all ... I would definitely go back to this hotel !", "Date": "October 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Beautifully appointed, fantastic staff, super location!”", "Author": "brettsmommy", "ReviewID": "UR84106380", "Content": "My father and mother (in their late 60s) took us (two daughters with our two sons, aged 5 and 7) to Paris and London recently. We stayed at the Hotel Rochester and were so extremely pleased with our experience! It was our first time in Paris and didn't know what to expect. The staff at Hotel Rochester were so helpful, kind, and welcoming! From the moment we stepped out of our cab, they grabbed our bags and wouldn't let us schelp anymore! The lobby was impeccable and the staff didn't mind our little ones being noisy for a bit. We got in quite early and asked if they could try and have our rooms ready (check in isn't until late afternoon). We were stunned when they had both our rooms ready and perfect by 11am! The rooms are lovely and well appointed. The location cannot be beat! The Champs Elysses is about a block away and the Arc du Triomphe is a five minute walk. There's a Metro just around the corner, along with patisseries, shops, pharmacies, a grocery store, etc. But who needs a grocery store when you've got breakfast at Hotel Rochester? What a wonderful breakfast---lots of lovely pastries, meats, eggs, cereal, toast...everything! And the staff is superb. The waiters found out it was our last day and performed magic tricks for the boys. Most importantly----they alerted us to an upcoming transportation strike. They knew we were checking out the day the strike was supposed to occur and asked us if they could help us make back-up arrangements for getting to the Gard du Nord train station for the Eurostar since most taxis would also be on strike. They thought of everything and took care of us very well. It was a bit more money than some other hotels we were considering but well worth it for the pleasant staff, beautiful rooms, and location. Only drawback: the street is a bit noisy at night, but hey, it's right in the heart of Paris! If you don't want the noise, ask for a interior room.", "Date": "October 19, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Excellent hotel at convenient location for Paris tourism”", "Author": "GPrakash", "ReviewID": "UR83314131", "Content": "We stayed at this hotel for one night and two days in the beginning of October 2010. We had gone to Paris to have an overview of the city and wanted to have the hotel located central to all major spots of sightseeing. We also wanted the hotel to be nice, clean with courteous service. To our great satisfaction, the hotel and staff fully met our expectations. The Bell Captain was very helpful in guiding us through the city and arranged some nice tours - an evening cruise on river Sienne showing illuminated Paris on it's banks (very good) and a 4 hrs familiarisation guided tour (not so good). The breakfast spread was not so lavish but acceptable. They did make a nice ommelette for me. But a vegetarian person (my wife) did not have many options. The room was nice clean and the wash-room was well equipped. Housekeeping failed to give a Coffee-maker in the room though it was listed in Brochure. But they did make up by serving complimentary Tea once. Overall a satisfying experience and recommended. Gyan Prakash", "Date": "October 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Location, location, location...”", "Author": "Tremblantski", "ReviewID": "UR82174079", "Content": "Great place to stay if you plan on walking Paris or using the metro. We did not eat there (breakfast was available) because we prefer to venture out for food and try different places. It is a little pricey but considering the location and the suite we had (although paid for a room) it was very much worth it.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Lovely...and comfortable - largest rooms in Paris!”", "Author": "scarlett_atom", "ReviewID": "UR82119061", "Content": "Stayed here for 5 nights in September. Found staff very helpful. Room was largest I have ever had in Paris - and very clean and comfortable! HIGHLY recommend - while it is close to the Champs Elysee, if you walk in the opposite direction, lots of off the beaten path shops and restaurants (i.e. affordable); and many markets within walking distance.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Oxford, England", "Title": "“Good 4 Star Hotel in the Centre of Paris”", "Author": "traveller125", "ReviewID": "UR82023563", "Content": "very nice, comfortable hotel close to all the sights - good sized rooms for Paris.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Italy", "Title": "“Third time and still charming!”", "Author": "Mis_Adventurous", "ReviewID": "UR81817828", "Content": "This was my 3rd stay at this hotel. To begin, we reached the hotel later than expected due to an air traffic controller strike. The staff were efficient and the room was nicely appointed with two single beds. In previous trips, I had stayed in a double suite since my family was in tow. However, this room was perfect for two ladies on a shopping extravaganza! The hotel is easily accessible to major shopping areas and some excellent restaurants. Paris is the kind of place that reservations are a necessity. I am going to mark this hotel down one notch on the sleep quality and room this time because of the fact that the maid's supply room was located right next door and it sounded like someone was trying to come into our room every time the maid went into the next door room for more supplies. This was a luxury week of shopping and there really was no need to be awakened at 6am. Also, the air conditioning seemed to be a little \"off;\" the weather was unexpectedly HOT during our stay and even with the AC on fan speed of 3 and 15 celsius the room was still too hot . . . we would have opened the window, but the courtyard below was where all the smokers congregated and that made for a nice cigarette odor in the room. All to say, that this was the wrong room, but the right hotel. The concierge, Luis, should be commended and given a raise for his expert advice on how to get the best view of the Eiffel Tower (the Trocadero' exit off of the Metro), and securing us a private driver for shopping when ours didn't show up. Finally, he arranged for a private car to take us to the airport upon check out because . . . there was a NATIONAL transportation strike on the day we were leaving . . . no rail, taxi, or bus service. I would definitely stay at this hotel again, but the caveat would be away from the maid's supply room and a room high enough to escape the cigarette smoke should the need arise to open the window.", "Date": "October 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leeds. UK.", "Title": "“A really lovely hotel and such friendly staff!”", "Author": "Juliacarling", "ReviewID": "UR77334494", "Content": "We have just returned from a four night stay here and we cannot recommend it highly enough.. Our room was lovely ..very spacious indeed and very quiet at night ..we faced the inner courtyard. Breakfast was not just continental as others had said ..there were dishes of eggs , bacon and sausages every morning and you could also order any sort of eggs cooked exactly as you wished . However the best thing about the Rochester is the staff . They were ..without exception ..very friendly and welcoming and very patient when asked about directions or anything .I was visiting with my mother ...her first time in Paris and they were absolutely charming . The situation is perfect as it is so near to all the best places .The concierge was excellent and looked after our bags in his room the day of departure..no question of leaving them outside our room .I don't know how anyone can find anything to criticise at this hotel as it was easily the best of my many stays in Paris and certainly not the dearest ! I am planning to return as soon as possible !", "Date": "August 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dallas", "Title": "“Great location, friendly staff”", "Author": "markjdv", "ReviewID": "UR76834163", "Content": "We loved our stay at the Rochester Champs Elysees. We booked thru easyclicktravel.com (I dont work for them but I thought you would like to know where I got the best price) and got the standard room + breakfast buffet for less than any other website. Cheaptickets.com was the next cheapest (about $100 more) but without free breakfast. Check the rates too directly on the hotel's website - hrochester.com. The hotel was a stone throw away from a metro station (St Philippe du-Roule), a 3 minute walk to the Champs Elysees, a 10 minute walk to the Arc de Triomph, a 15 minute walk to the Seine (where you can take a river cruise - but avoid the dinner cruise!). The concierge spoke good english and was very friendly and helpful. The breakfast buffet was very good and the staff were friendly. The standard room was big enough in my opinion (check my pics), but there was no bedside clock or any clock for that matter. In-room safe was not big enough to store our 14\" laptop. The TV channels were limited and had just about 3 english channels - news channels like CNN & BBC. There was a DVD player so if you must have your fix of movies, bring your own DVDs. Then again, you dont really visit Paris to be holed up in your hotel room watching TV/DVD, right?", "Date": "August 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "札幌", "Title": "“Exllent hotel”", "Author": "Amy札幌", "ReviewID": "UR76642452", "Content": "I really enjoyed staying at this hotel,hotel stuffs is all very kindness and heve a nice smile. I was comfortable to stay, because room is clean, rocation is very nice to go to city trip. I can recommend this hotel Thank you for your kindness, next time I'll stay", "Date": "August 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Queensland", "Title": "“Ooh la la”", "Author": "Gerlande", "ReviewID": "UR71560491", "Content": "Before leaving for France we spotted a special deal on a travel site. We booked the Rochester for two nights which included a cruise on the Seine and a bottle of wine. The hotel is in a great location for sight-seeing, it is possible to walk down to the river in ten minutes and see the Eiffel tower and other landmarks. There are lots of small economical bar/restaurants in the area and of course the Champs-Elysee. The metro is opposite the hotel. (St Phillipe du Roule) The hotel is beautifully finished and maintained, it has a very French feeling in the lovely marble lined and mirrored lobby. The rooms are soundproofed and also have a very French feel with rich fabric lining the walls and a very comfortable bed. Our room was amazingly spacious for the centre of Paris, with a big entrance hall and it looked out on to a lovely courtyard with a fountain. The staff were extremely helpful and professional. The only downside to our stay was that a taxi we had ordered did not turn up and we were told at reception that it has been canceled five minutes before we were due to leave! Needless to say this caused panic as we had to make a connection. The hotel did all they could to right the situation, they sent out a an employee on to the street with us to find us another taxi in rush hour. This proved impossible but this employee left no stone unturned in finding us transport to the station. He ran to another hotel and organized transport which due to the skills of the driver got us to the Gare Du Nord with 4 minutes to spare before our train departed. I would highly recommend this hotel for a very comfortable short stay in Paris.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Herfordshire/Kingston", "Title": "“Traditional hotel, comfortable rooms, fabulous location.”", "Author": "pywacket4", "ReviewID": "UR70300208", "Content": "My boyfriend and I literally just got back from a trip to Paris where we stayed at Rochester Champs Elysees. What a lovely hotel. The room was absolutely perfect - very Parisian, with just enough space for all my clothes! I read other reviews before we left and was a little worried about what we would find - the hotel is 4 star but other reviews had described it as much lower. I do not agree with them. Others have said that the beds were old and uncomfortable. I checked - new matresses! They must have recently updated them. It's true that they are quite soft - personally I like a firm matress, but for a short stay it's no problem - especially with the lovely fluffy pillows and duvet. One of the best things about the room is that there's a balcony window. The large windows open out onto a small - not walkable - but perfectly formed balcony. We had a view of the courtyard so that was lovely. When the windows are shut you can't hear what's happening in the courtyard which was good as there was some sort of work going on the first day we arrived. But the thing we appreciated most was the DVD player and high-tech tv. I've experienced ancient tv sets in hotel rooms before, so this was great. Unfortunately if you're from England - the only channels available from home are BBC worldwide (not bad) and Sky News. The latter is atrocious, too American. But it gave us some laughs. Bring DVDS. It plays english ones (and I reckon European ones too). When you're tired after a day of sightseeing there's nothing better than a warm bath and a nice film. Which brings me onto the bathroom - great, everything you need - with clean surfaces etc. The bath is excellent - tap is really fast and the water is lovely and hot and the shower is so powerful! I found that since I had to wash my feet after walking about Paris every evening (If you wear flip flops be prepared for this - Parisian streets are filthy!) the hot water was very welcome. Other good things about this hotel included that they allowed us to check in 2 hours early - we'd been told 2pm for check-in. Otherwise we were just going to leave our bags with them and come back. A bad point about this was that when we did leave our bags with them in the morning after we checked out (our train was not until 7pm) they simply left them in the corridor by the doors. We felt this was a little bad for a 4* hotel, since we were told most had a room where they could be stored. So, make sure no valuables are left there whilst you see the last of the city. We found the staff to be helpful, if not overly friendly. The buffet breakfast was alright, certainly not the best I've had, but adequate. Certainly not worth 25 euros though. (Ours was included in our room and eurostar deal.) The location of the hotel was fantastic! It was a short walk from the middle of the Champs Elysees...and then a minute from Franklin D Roosevelt metro station. Make sure you shop around for a place to eat along the avenue, some are more expensive than others for the same thing. We went to a place called Vesuvio on the first night - i had a (very very cheesy) magerita and my boyfriend had carbonara. Decent food - expensive considering what it was, but that's the euro for you. Just a tip - check the prices of the coca cola at each restaurant, that should give you an idea of how much they think they can charge you for the basics. I've seen one resturant along there charge 6 euros for it, and another only 4. Strange. There's also a mini supermarket and a sort of small department store down the road from the hotel for you to stock up on things for your room - instead of the mini bar which is always expensive!", "Date": "July 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Beautiful hotel, excellent location”", "Author": "VandyMance", "ReviewID": "UR68792176", "Content": "Hotel Rochester is in a fabulous location, within walking distance to many Paris landmarks including the Eiffel Tower. We stayed at this hotel for our honeymoon and found it the perfect place to stay. The rooms were clean and the hotel and spa were beautiful. The staff were extremely friendly, helpful, and fluent in English. We were lucky enough to get our room at a 60% discount, if we hadn't I would consider it overpriced but then again it's Paris and most things in the tourist areas are.", "Date": "June 27, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "London", "Title": "“Overpriced with no restaurant at all”", "Author": "AandTLondon", "ReviewID": "UR67114534", "Content": "We travelled in May for a family reunion. Hotel is overpriced, rooms extremely small, our double room had one bedside table. Hotel does not have a restaurant, so impossible to go for dinner. Concierge service efficient, but too much overpriced. I would rate this hotel at 3* as service is non-existent. Location is central, but on the wrong side of a good street. Champes Elysee are 5 minutes away on foot, but street where hotel is situated looks dodgy and not very safe. if they were charing 50 Euro per night, it would have being a great value, at the rates hotel is charging - stay away from it. There are many branded hotels around at a fraction of a price. Breakfast was full, but very limited in quantities and space.", "Date": "June 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Not Bad!”", "Author": "Travelboi2010", "ReviewID": "UR66991944", "Content": "In general the hotel is very good, specially the location. Most of the staff are kind and courteous (except the the mature gentleman in the front desk). Some of ther services require a bit of fine tuning: at the reception, On Pre-auth auth, the receptionist accidentally charged the credit card, she genuine appoligised but uttered some foul words. There was no offer of wake-up call or newspaper, but help with luggage was offered which is good. Housekeeping was took awhile, I asked for for iron and ironing board, it was delivered but had to wait. Room service was also very efficient. Breakfast staff are good but the choices are bit less. On check out concierge was very helpful in storing our luggage and has good knowledge about Paris. I asked for early check in, which was given, very thankful for that! If you decided to stay on this hotel, ensure that you don't get the street side as it is very noisy. The bed that was given to us was broken so it made noise everytime we move. I hope housekeeping would check it before giving it to a guest.", "Date": "June 9, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Coventry, UK", "Title": "“Great location, good hotel”", "Author": "C0vgirl", "ReviewID": "UR66854882", "Content": "A lovely little hotel - ideal location for sightseeing in Paris. Calm and elegant inside - a real find!", "Date": "June 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“This is the one!”", "Author": "PSMaka", "ReviewID": "UR66107461", "Content": "We got a good deal for Hotel Rochester via Travelzoo- and when we booked my husband made a note that the trip was for our 1st anniversary. When we got othe hotel the guy at the front desk informed us that we got a free upgrade, consisting of a bigger room w/ a balcony, free breakfast, a bottle of wine, and free boat tour tickets. The room was marvelous! You hear about how hotel rooms in Paris are small and dinky- but not this one! Even the entry way and lobby are luxious and cozy- definately a 5 star feel. The location was also marvelous. Just two blocks off Champ Elysees and close to many metro stops. You can also walk to various other attractions but we chose to take the metro often ( to Louvre, Notre Dame, and Eiffel Tower). I have nothing negative to say about htis hotel as we had a very comfortable stay! I did notice that it's quite expensive if you don't strike a good deal- but it may be well worth it if you are willing to splurge!", "Date": "June 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "orlando", "Title": "“Great hotel is a Great location”", "Author": "justin1207", "ReviewID": "UR65855375", "Content": "i was in paris for spring break with my family. I was having a hard time finding a hotel which would accomdate 3 adults and 1 child and finnally found Hotel Rochester and what a great choice. It is in a great location. We were in paris for 4 days and the location of the hotel helped us to visit all the main attractions. It is 3 blocks away from the metro and champ elysees. The hotel was very clean and kept up. I stayed in a jr suite and it was perfect for my family. The hotel staff in very helpful. The only this is that i found on the down side is that the hotel breakfast is very expensive for what it is basically a continental breakfast. Other wise i highly recommended.", "Date": "May 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Ok hotel, but definitely not worthy of 4-stars.”", "Author": "BrooklynWino", "ReviewID": "UR65009244", "Content": "I received an offer from Travelzoo, for this four star hotel, for only $200 a night. After reading some reviews of the Hotel Rochester, I thought it sounded like a good deal. We got a king size room with breakfast included. The lobby and rooms seemed slightly outdated, but clean. The bedroom and bathroom were quite spacious, for Paris. We could see the Eiffel Tower from our window. The hotel staff spoke English, but were a little snippy. After putting all of my valuables in the room's safe, I came to find it would not open. I called the front desk, and asked someone to come open the safe. We caught some attitude from the person at the front desk, as well as from the guy who came to open it. There is a fridge in the room, stocked with ridiculously priced items. I recommend you take advantage of the grocery store across the street, to stock up on wine, bottled water, and snacks for your room. The breakfast was convenient, since it was included in the price of our room. We came to find out that if it's not included, it costs $25 per person. The breakfast consists of cereal, hard boiled eggs, some breads, pastries and cheeses, but it is definitely not worth $25. Skip it if it's not included. The location of the hotel is convenient to the Metro and is a short walk to the Champs-Elysees, which is a super-commercial area. The hotel and neighborhood are not overly charming. Overall, it is a very business-oriented hotel.", "Date": "May 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "White Plains, NY", "Title": "“Tiny rooms but clean and in good location”", "Author": "Diskette66", "ReviewID": "UR63431126", "Content": "My husband and I went to Paris last September and stayed here for 4 nights. The hotel staff is very friendly and glad to assist (if you ask them). Hotel is about 2-3 blocks walk from the Champs-Elysses. Very convenient location - especially since Le Bus (a wonderful tourist bus program - you pay 1 price and can get on and off at your leisure - they hit all the tourist spots and do a big loop in the city, stops everywhere you could imagine. Highly recommend and super convenient). You also can walk (about 4-5 blocks) to the Arc de Triomphe. Hotel rooms were clean and adequate but quite tiny. Not so much so that it will ruin your stay or anything but smaller than what you most likely are used to in a hotel. There is a garden courtyard, which is quite pretty. There is a bar in the hotel but it's somewhat quiet and prices a bit steep. Probably better to do your drinking elsewhere. All in all was a nice stay.", "Date": "May 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Excellent Hotel & Location”", "Author": "ladyg17", "ReviewID": "UR62845820", "Content": "We have just returned from staying in Paris, The Rochester Champs-Elysees hotel was an excellent place to stay. Only 30 steps to the Metro Saint Phillippe du Roule and approx 10 min walk to the Champs Elysees. The hotel was very clean, staff friendly and beautiful room. We stayed in room 65 (junior suite) as this was my Christmas present from my husband. The room was lovely, very newly decorated and extremely clean.Lovely big bed with bright white linen. Bathroom was good with nice toiletries. The staff were very polite and helpful. Breakfast was as you would expect in Europe but the breakfast room opened from 7.30am until 2.00pm (this was very good as you did not have to rush at all). The bar was cosy but nice (drinks were expensive but no different than other hotels) A supermarket is only a few steps away so you can go there to get water etc. The bar staff were very helpful when we were looking over our guide books and even rushed off to get us another Metro map. The only slight down side like all Paris hotels is that the road noise is annoying, but as I have read in so many other trip advisor reports all the hotels seem to suffer with this. This said we could not fault the hotel at all and would definitely return.", "Date": "April 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Clean , Pretty place , very nice stay”", "Author": "Lydiaaltman", "ReviewID": "UR62760788", "Content": "The Rochester Hotel is a great hotel based on la Boetie road down from the Champs - Elysees .The drive from the station to the hotel only took about 15 - 20 minutes ! The location is great . On the first day we got there and then straight after unpacking visited the Arc de Triumph which was just on the Champs Elysees. The hotel is very clean and pleasant . Whenever we wanted an extra pillow or something was wrong our problem was seen to within seconds ! Great service . The only thing is that the air conditioning is only on through out the WHOLE hotel within the summer . So when we were staying there in April it was very hot in Paris and the rooms were baking hot ! The hotel has a lovely new gym and no swimming pool but a very nice sauna and steam room . The hotel is SO close to The Eiffel Tower ! I recommend getting there very early because we had to queue for 1 hour ! Another great thing about the hotel is that breakfast runs from 7 - 2pm ! So you can sleep in for a long time . The food is also amazing the hotel only serve breakfast but the breakfast is amazing and HUGE ! I recommend the restaurant called Villa Spicy and another called La ' Duree which sells the famous macaroons as well . The beds are very comfy.The hotel also has a computer and free WiFi so you can get internet access for free on your iphone or phone ! Altogether a very enjoyable stay If I have not mentioned something you would like to know about please do contact me.", "Date": "April 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Reasonable value but nothing out of the ordinary”", "Author": "PlainSong", "ReviewID": "UR62220122", "Content": "The hotel is well placed - close by the metro and an easy walk to the Champs-Elysees and its highlights. However, the hotel is in a fairly quiet street away from the bustle. There are a number of bars and restaurants in the surrounding area for food and drink. My room was comfortable and clean if not especially spacious. There was a DVD player attached to the TV although I had no DVDs with me to try. The breakfast room is very small and cannot cope if the hotel is close to full. At €25 for an indifferent buffer breakfast, I would suggest you look at some of the options just outside the hotel (unless it is included in your room rate or charge you can charge the cost to expenses). Internet access is free (despite what the hotel guide in the room states) and my connection was fast.", "Date": "April 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“Average hotel but great location.”", "Author": "WanderingScotty", "ReviewID": "UR62134471", "Content": "Stayed here with husband who was doing the Paris Marathon, which started from L'Etoile, hence our choice of hotel. It was fine, but nothing special. Breakfast didn't start until 7.00am and so my poor hubby who needed to start early didn't get a hot meal, but they were accomodating in giving us bread and a flask the night before. Room was small but clean. Tiny little scary lift, and if you had a lot of luggage you'd need to go up in several trips, but nice wide carpeted stairs to all floors. Staff polite but not especially helpful. They forgot to book our cab to the airport, but at least worked hard to find one when they realised their mistake. ( helped, I think, by a big tip to the concierge for keeping our bags for the day after check out.) Nice restaurants near by and a little supermarket across the road if you want snacks etc. Would recommend it for location, but not for someone wanting a really special Paris stay. No parking, so don't even think of bringing a car, but lots of good transport links.", "Date": "April 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vicenza, Italy", "Title": "“Very good, but not excellent”", "Author": "doctorjon", "ReviewID": "UR61644811", "Content": "Room and hotel are dated in their furnishings, but clean. Concierge staff were excellent and very helpful. Bar was small but nice. Gym virtually unused, in mint condition. Elevators tight and small but quick. Breakfast was expensive, we went around the corner to a patisserie instead. Excellent location, and near a metro station added convenience. Do not drive there - tight and congested roads. Sleep was very good, but had noisy children and heavy-footed adults upstairs from us. Would consider using again, but with so many hotels in Paris I'd like to visit others first.", "Date": "April 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Italy", "Title": "“Second stay at this FABU hotel!”", "Author": "Mis_Adventurous", "ReviewID": "UR61173397", "Content": "This was our second stay at the hotel Rochester. Although the staff are not \"overly\" friendly, they are accommodating nonetheless. We booked the double suite and were very comfortable . . . our two boys in one-half and my husband and I in the other half. The beds are extremely comfortable and our room had an excellent view of the Eiffel Tower . . . which had a magnificent light show for Easter. The only detractor was the leaky shower! The connector for the shower hose squirted water everywhere! A hotel of this caliber (and price point) should not have a leaky shower. In all, we would definitely stay in this hotel again. Access to the Metro and the Champs-Elysees is fantastic.", "Date": "April 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lebanon", "Title": "“Excellent hotel in all aspects”", "Author": "Naddoune", "ReviewID": "UR60126126", "Content": "I stayed in Rochester for my first time visit to Paris with my husband and my 2 children aged 7 years and 1 year old. Staff at reception were nice. Thr room was just perfect for our family, spacious, with a seating area. When we entered the room, they had already provided the crib for our baby and prepared the sofa bed for our son. We appreciated that we didn't have to ask. The location of the hotel is just perfect especially for a first time visit to Paris. The metro station is a minute away, the Chaps Elysees is at a 10 minutes walk. You can easily have access to a pharmacy,and a supermarket if you need something for the kids. The room and the breaksfast area were very clean, breakfast was very good for not-a- five-star hotel. Staff were very nice and helpful, especially the concierge. We visited Disney Land for 2 days, and we left our luggage at Rochester. When we came back we were given a room similar to what we had, and everything was again settled for our children to sleep. We found Rochester to be much much better then the hotel in Disney. When we came back to Rochester, we felt like coming back home. In summary, excellent hotel, very good value for money, very good location. We would definitely stay there again,", "Date": "April 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great service, in a fabulous location with OK value for money”", "Author": "GlobeTrotteress_10", "ReviewID": "UR58157531", "Content": "A recently renowated small hotel on Rue de Boetie, literally 100 meters of the Champs Elysees and a 10 minute walk off the Hausmann. In addition both George V and Franklin Roosevelt metro stations are a 5 minute walk away. There are plenty of restaurants, shops and minimarkets nearby. The rooms are very clean, recently renowated and relatively well sized for Paris. The bathrooms are new. The mattresses unfortunately are not up to the sma standard and clearly were not part of the recent updates. Still Ok to sleep on, but not up to the same standard as the rest of the hotel. Also would advise to ask for a room that is not directly next to the lifts, as they make noice as the lift carriage travels in the shaft. The service from the concierge was fantastic- restaurant recommendations, reservations and organisation of tickets to theater were done smoothly, professionally and without mistakes. Overall- it is a fabulous hotel with a great decor, location and service. However the rather steep prices, below average mattresses and noicy lifts deserve it 4 stars rather than 5. Still highly recommended it!", "Date": "March 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Liverpool England", "Title": "“Lovely hotel”", "Author": "Shirley50", "ReviewID": "UR57797892", "Content": "The reception area of this hotel was really nice as were the staff. We arrived earlier then our 2pm check in which was no problem at all. Our package included a free upgrade, trip on the river and bottle of chablis. The upgrade room had two single beds which was not what we had booked so asked for a double bed wasn't a problem but we lost our upgrade and ended up in a smaller room but still very pleasant room, however I had expected more from a four star hotel room. Mini bar in the room was abit expensive but on the whole I couldn't fault this hotel. The location was excellent and although myself and my partner are far from fit we walked to all the tourist sites i,e tower,Notre dam. louvre , I would definately stay here. again.", "Date": "March 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "la mola", "Title": "“Well Placed”", "Author": "varial", "ReviewID": "UR57775812", "Content": "Medium size hotel, well placed, clean, but with old beds. I like the hall of the hotel, so nice for business meetings.", "Date": "March 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "strathaven", "Title": "“Excellent location”", "Author": "bigglesStrathaven", "ReviewID": "UR56963279", "Content": "Great value, service excellent,off the main boulevard but only by 300 yards or so ST PHILIPE DE ROULE METRO within 50 yards of the hotel made it so easy to cross Paris and see the sights.Breakfast was usual buffet well served in choice.Take SAS busfrom CDG AIRPORT to etoile THEN a lovely walk down the CHAMPS ELYSEE AND DOWN RUE BOETIE TO HOTEL.", "Date": "February 24, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London", "Title": "“Fantastic”", "Author": "Cavendish6", "ReviewID": "UR55812292", "Content": "This is a great hotel Superb location near the champs elysees and wonderful shopping. The staff are very friendly and provide excellent service - nothing is too much trouble! The room are well furnished and very comfortable I would have no hesitation in recommending this hotel.", "Date": "February 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Spain", "Title": "“Enjoy the Champs Elysees”", "Author": "delfing", "ReviewID": "UR53552992", "Content": "Good hotel in a very good location, just steps away from the Champs Elysees. Room was comfortable and spacious for Paris standards, although in the ground floor without views. Breakfast was good continental quality although limited choice.", "Date": "January 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "s yorkshire", "Title": "“excellant hotel with the personal touch.”", "Author": "football1945", "ReviewID": "UR49634966", "Content": "A most enjoyable experience.We last visited the hotel 20years ago for our silver wedding and returned for our 45 years of marriage anniversary.It would be nice if we can come back for our 50 years celebration.Which god willing we will achieve.Many thanks to the staff and especially Vincent in the bar .", "Date": "November 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New-York", "Title": "“Excellent hotel, high service and very good location”", "Author": "Hem45", "ReviewID": "UR49185884", "Content": "This hotel has got a fantastic location, next to the Champ-Elysee. Quiet place with exemplary service. Like the cosy bar and enjoy the gym. I strongly recommend this hotel.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Middlesex", "Title": "“Fantastic Hotel in Great Location”", "Author": "Pandcal", "ReviewID": "UR48694695", "Content": "Chosse this hotel based on (the positive) Trip Advisor reviews and was not disappointed. The hotel certainly lives up to its 4 star rating. Our room was fantastic very clean and spacious (particularly for Paris), we even had a balcony/terrace to sit outside on a remarkably warm September evening. We were located at the front of the hotel and did not experience any of the noise issues otheres have mentioned. We booked through Cresta and the deal including Eurostar was very good value, particularly when we saw the rack rate !. We had breakfast included in the price which was fortunate as the menu price is 25 Euro per person which whilst a very nice breakfast is quite steep. The staff were very friendly and helpful. The location is also fantastic being a mere 200 yards down a side street off the Champs Elysees.", "Date": "November 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "san francisco bay area", "Title": "“wonderful 4 star hotel in Paris”", "Author": "creekside9", "ReviewID": "UR46418473", "Content": "Recently stayed at the Hotel Rochester in Paris. We had the pleasant surprise of an upgrade to a suite. It was beautiful The staff is very friendly and helpful. All spoke English. The bartender, Vincent, was very friendly and professional. The Hotel is in an ideal location just steps from the Metro. I will absolutely recommend it to my friends.", "Date": "October 9, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Grand Rapids, MI", "Title": "“Not impresssed at all.”", "Author": "Milangel", "ReviewID": "UR38884682", "Content": "I am a bit dismayed by all the great Trip Advisor reviews for this hotel. I just got back and for the most part wasn't impressed. There is definitely a different star system rating in France than in the US. This hotel was rated a 4 star in France, I would give it about 2 or 3. The pictures posted ARE misleading. I stayed in a standard room and it was not nearly as large as the ones posted for standard rooms on their website. The rooms on the website that are spacious are actually triple rooms. The hotel is located across the street from a bar or restaurant where patrons get into fights until 4 am. I asked to have a room on the courtyard for some quiet. That was even worse. If your room faces the courtyard you will have to deal with the noise of other occupants who don't close their windows and talk very loudly. I had to complain about the noise level of some loud upstairs neighbors and some conventioneers who thought it was okay to blast, and I do mean blast their music with the windows open. Sound echoes in the courtyard and even closing the windows doesn't drown it out. Another occupant had to threaten to call the police on the noise makers to get them to quiet down. The hotel management, who could obviously hear the noise from the front desk because the courtyard opens onto the lobby, took forever to act on the noise, that is if they acted on it at all. Another bad thing about the rooms are the sheets and towels. I swear the sheets are only 50 thread count. They are very rough to the touch. The towels absolutely felt like sand paper. The decor was even more plain and uninviting than a Holiday Inn. There is one picture on the wall in the corner. It's not a very welcoming place to come back to after a long day of sightseeing. The TV gets 3 English channels; CNN, Sky News, and some sports channel. The bathrooms are kept very clean, but depending on the configuration of the room they can be very tiny. The first room we had was very narrow with a glass half-door instead of a shower curtain. It also had no exhaust. The second room had a larger bathroom, a shower curtain, and a small window that could be opened to let the steam escape. The elevator can only fit one person with luggage or two people without. You do get a card key which is good because some hotels in Paris give you a regular key and confiscate it when you are going out on the town . The reception area is open 24 hours. The staff is polite. We did not consult them for anything other than issues about the room. The room has an in closet safe, a mini-bar, and an Iron/ironing board only on request. The courtyard is actually very tiny and only has two tables out there. We did not bother with the breakfast.There is a supermarket up the street and a metro less than a block away, both of which came in handy. We were charged for some items from the mini-bar when we never even opened the mini-bar. The charges were removed from our bill at check-out. We were actually able to take the Air-France bus to the Arc de Triomphe from the airport and walk to the hotel to keep our expenses down. All in all this isn't a BAD hotel, it's just so incredibly blah. I don't think I would stay here again if I returned.", "Date": "August 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Lovely hotel after unpromising approach”", "Author": "FrequentTraveler333", "ReviewID": "UR37081854", "Content": "We feared the worst as we walked down a narrow unttractive sidestreet from the Champs Elysees, wondering where the hotel was. Small unassuming entrance hardly recognizable as hotel until you are right upon it, but were pleasantly surprised once we entered the attractive marble and mirrors lobby with modern furniture and attractive little patio with fountain. Staff very accomodating. Room spacious and no road noise as it looked out on courtyard. Nice modern marble type bathroom, brocade curtains, nice room. Sofa in room a bit odd - looked more like a hideaway bed with a brocade cover over it than a sofa. Convenient location off of Champs Elysees for shopping but not near Louvre, Notre Dame, etc. But close to FDR Metro #1 stop on Champs Elysees which makes it easy to reach attractions. Hotel has breakfast in not very attractive breakfast room - looked like smallish buffet, not very appetizing for 25Euro so we skipped it. FREE INTERNET available at laptop in lobby. Also, on lower level very new looking small spa consisting of excercise equipment and tv, several showers, nice clean modern locker room, steam room, a massage room and soothing fountain. Looked like no one had ever used it and no one was in it.", "Date": "August 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Antonio, TX USA", "Title": "“Most remarkable service at an excellent hotel!”", "Author": "njcser", "ReviewID": "UR36780533", "Content": "Nevermind what anyone says about the French. We were a group on 5 nonFrench speaking Americans yet the staff at this magnificent hotel went above and beyond what was required of them. And always with a generous spirit and a smile. Among other great things at the hotel, we were there during the ending of La Tour de France. Once the race was over we found ourselves not able to get to the tran station to get back to London because all the streets were closed. One of the excellent concierges offered to contract a car for us. That did not work because the car could not get through to the hotel. The gentleman then carried our luggage 2 blocks down to an intersection and attempted to hail two cabs - there is a limit of 4 persons in one cab. This did not work so he then carried our bags to the metro where he then proceeded to purchase tickets for us so we would not have to wait in the incredibly long line (and none of us spoke French). After that he gave my 16 yr old son explicit written directions on how to navigate the metro and get us to the train station. It all went beautifully thanks to that gentleman. After traveling to England, Scotland, Italy, Greece, and France, this was by far the best hotel, and hotel staff, experience. I highly recommend this hotel to everyone.", "Date": "August 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Washington DC", "Title": "“Great Location - comfortable stay”", "Author": "EmMcD", "ReviewID": "UR36572227", "Content": "The hotel was very nice and clean. The rooms were nice sized. The only main issue was we got charged for some items from the mini-bar we didn't take... odd ... but the hotel did fix it after we asked", "Date": "August 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "OKC, OK", "Title": "“Great Stay!”", "Author": "OklahomaOKC", "ReviewID": "UR36442483", "Content": "We found the hotel staff very friendly and helpful. Our room was well-appointed, clean and quiet. The hotel is only 1/2 a block from a Metro stop, and five minutes walk from the Champs-Elysees. Fantastic location!", "Date": "August 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Texas", "Title": "“Great location, big rooms, very comfortable!”", "Author": "TXRunnerGirl", "ReviewID": "UR35921952", "Content": "This hotel had a great location. Located only about two blocks off the Champs Elysees, you escape the noise, hustle and bustle of the crowds. Not overly difficult to get to by the metro either. The staff was very pleasant and always helpful. Our room was good size--much bigger than most Parisan hotel rooms--and the bathroom was large as well. Our I would pass on the breakfast--it is 25 Euro for nothing spectacular. Instead, hop over to Franklin Roosevelt avenue and enjoy one of the cafes. The breakfast is much cheaper, and the outdoor seating affords a great people-watching spot of the morning commuters.", "Date": "July 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Aarhus, Denmark", "Title": "“Superb hotel in great location !”", "Author": "EdDenmark", "ReviewID": "UR35710331", "Content": "Great location, terrific breakfast, many good cafes and restaurants in the area, near 2 metro lines... Very elegant hotel, good service, etc. We got a great deal on Travelzoo.com at approx. half the normal rate. We definitely go back again. Only complaint were the air-conditioning didn't cool the room sufficiently, and the wifi internet in the room waas much too expensive.", "Date": "July 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Austin, Texas, USA", "Title": "“Great hotel with BIG rooms in the middle of it all!”", "Author": "Waleilia", "ReviewID": "UR35106221", "Content": "I stayed at the Rochester in June for three nights. It's just a block and half from the Champs Elysees, on a quiet street. The hotel is lovely, with elegant common areas and all you need from a hotel--bar, restaurant, spa and indoor and outdoor sitting areas. The hotel staff were all friendly and helpful, and the concierge made excellent suggestions for everything I asked of him. After looking at hundreds of Paris hotels online, I can authoritatively say that this hotel's rooms are WAY above average in size and amenities in the $200 range. The room was large enough to fit a desk, table and chair, and a very comfortable bed with tables on both sides. There was a minibar, safe and flat screen tv as well. The marble-clad bathroom was immaculate, with plush towels and robe, big tub and shower, and at least ten nice-quality toiletry items. A well-stocked patisserie was right around the corner, with outside seating that offered inexpensive and delicious pastries and the best quiche I've ever had. Just a few doors down was a shop where a STUFFED sandwich of lovely, crusty French bread, fresh meats and vegetables could be had for under 4 euros. A walk in the other direction brings you to the Champs Elysees, where it's all happenin'! In either direction, metro stops are close by. If you're looking for a comfortable, attractive,spacious hotel in a great location for an excellent price, the Rochester is your hotel. You won't be sorry!", "Date": "July 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Perfect Location - Great service”", "Author": "MCT672", "ReviewID": "UR34748096", "Content": "I stayed at the Hotel Rochester for a long weekend with my sister. I go tin very early in the am and well before check in. They checked my bags and I did a little exploring. On return at 12:00 - still before check-in my room was not ready but within the hour I was in my room and upgraded to a suite. I was also offered a free bottle of wine for the inconvenience of waiting. The staff was very accommodating and all spoke English. They made reservations for us, called taxi's etc. The room was perfect for us. I was with my sister and it was very large. I had been travelling over 20 days through other locations and the fact that my luggage could be accommodated easily in the room was great. The location is superb. There is a metro stop right on the corner and the Champs is down the street. We thought the breakfast was great. There have been other comments on its being limited. The room is small but I thought the selection was great, there were eggs, sausage, yogurt cheeses, cereals, and of course croissants and other breads. What more do you want? Also the staff at breakfast was great. Also this was a great value we got a discount through Travelzoo for about $190 which we think was a good price for the area. We stayed in room 801 which required going to the 7th floor and up a small flight of stairs but it was not an issue for us but could be if you had mobility issues. I would definitely come back and recommend to any of my friends", "Date": "July 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Seattle, WA", "Title": "“Very nice hotel”", "Author": "sasafrass77", "ReviewID": "UR31718856", "Content": "We were lucky and upgraded to a Jr. suite which was fantastic. I didn't know rooms could be that big in Paris. The staff were excellent and of course the room was fantastic. The Champs-Elysees is a bit too touristy and chaotic for my taste but the hotel was a really good deal and a nice way to close our trip.", "Date": "June 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Arizona", "Title": "“This was a perfect spot with attentive staff and good location.”", "Author": "kmjm", "ReviewID": "UR31338139", "Content": "Good location Comfortable, clean room Excellent staff", "Date": "June 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Wales", "Title": "“Wonderful hotel - wouldn't change a thing!”", "Author": "garetha77", "ReviewID": "UR31086063", "Content": "Lovely hotel, extremely friendly staff. We were staying with a small child (20 months) and the staff were great with him. The hotel was extremely clean, the rooms were a good size, air con was needed and worked great and the bathroom was fully stocked with goodies! There was no noise from other guests so I assume the sound proofing was good. Breakfast was wonderful with lots to choose from - bacon, eggs, croissant, cheese, meat etc. The nearest metro is 1 minute walk away and the Champs Elysees is about five minutes walk. All in all a thoroughly enjoyable stay in a lovely hotel.", "Date": "May 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Philippines", "Title": "“A great hotel with good rooms and location for vacationers in lovely Paris.”", "Author": "Eelos", "ReviewID": "UR30718646", "Content": "One of the great things about this hotel is its location. It's a 5 minute walk to Champ Elysees and I like that it's not directly found in Champ Elysees since that might cause some noise from all the people walking around. When you relax in your room, you can really feel the peace and serenity with the quiet atmosphere. The room and bathroom are quite clean with the beds comfortable to sleep on. I found the breakfast selection a bit limited yet fulfilling and delectable nonetheless. A nice place to stay in to enjoy lovely Paris.", "Date": "May 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Alaska", "Title": "“Quiet, lovely hotel in good location, and free upgrade! Four Star bargain”", "Author": "CastleStone", "ReviewID": "UR28077419", "Content": "We booked this hotel through Expedia, just a couple blocks off the Champs Elysees it was a great place to stay. Metro station around the corner. The staff offered us a free upgrade to a suite as we were traveling with our college age daughter. Two rooms of spaciousness and a little privacy was a plus. Room was clean and spacious, (even it it's a tad bit dated) windows out to the courtyard which made it nice and quiet at night. Desk staff were pleasant and very helpful, we enjoyed our stay. The breakfast was 25 Euros per person so we never ate at the hotel but other than that we enjoyed! There is a Starbucks up the street for coffee. Eat pizza at Pizza Pino, delicious! Internet in the room was very expensive so we used the business center for free. Our daughter used the fitness center which was pretty bare bones but they had one.", "Date": "April 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ireland", "Title": "“Great hotel, great location bit expensive for dinner but you are very close to the Champs-Elysees !”", "Author": "Ger89", "ReviewID": "UR27565674", "Content": "Hi, We stayed recently at the Rochester Hotel, rue la Boetie and thought it was a wonderful hotel. Brilliant location - come out the front door of hotel, turn right and 3 minutes walking will bring you onto the Champs Elysees. Hotel rooms really nice and spotlessly clean. We booked a deal that included breakfast - otherwise breakfast is €25 per person - a bit pricey but I suppose you pay for the location of the hotel. We didnt eat dinner at the hotel as again it was a bit pricey - loads of places to eat - there is a Starbucks coffee shop very close - come out of hotel, turn left and take next left - you will see the Starbucks sign - fab coffee shop called Julien in that area too. We ate in restaurant called Montechristo on the Champs Elysees - very reasonable - its on the right hand side as you turn onto the Champs Elysees from rue la Boetie. If you need any help at the hotel just ask the Concierge called Rochan - I hope he is on duty when you stay at the Rochester - he is soooooo helpful and always has a smile. G & F", "Date": "April 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "birmingham", "Title": "“great hotel! good location”", "Author": "ch0c0late_yum", "ReviewID": "UR24679806", "Content": "my fiance decided to take me to paris as a birthday present, we chose the rochester as it looked nice in the photos and it was central, on arrival we was not dissapointed the hotel was far nicer in person than the photos and was in the heart of the city but down a nice quite back street. we arrived at 11.am and working in a hotel myself was not expecting to be given our room at this time, but to our suprise the receptionist gave us the key and our cases were taken to our room immediately, lifts were small so max 3 people to a lift, when we went into the room being in housekeeping my-self i immediately checked the room, the standards where excellent and were through the 3 day stay! there was a flat screen tv in the bedroom with a mini-bar and a kingsize bed with a table and chairs, bathroom was marble and had dressing gowns. the breakfast wasnt what i would choose there was bacon eggs, etc but not the same as in england but there was cereal fruit and pastries to choose from too. Reception were really friendly and kindly arranged taxi's and xcursions for us and kept our bags for us on the last day whilst we waited to go to the airport. Overall a great hotel you couldnt fault it at all. few tips to be aware of in paris- there are alot of beggers and alot of people pulling scams on the streets so becarefull of bags belongings etc.. if you are having steak and you normally have it medium ask for it well done!! our steaks came out practically still moo-ing! and if you are going in the winter deffintly take warm clothes and flat shoes, and an umbrella!! and make-sure you have time to go to disney land no matter what your age you will love it, best bit!!", "Date": "February 17, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "intheshuck", "Title": "“Not my cup of tea”", "Author": "intheshuck", "ReviewID": "UR24263982", "Content": "Got of to a bad start when we went to check in. The rooms weren't ready which is perfectly reasonable. So we decided to go for something to eat and come back later. I asked the receptionist to look after our bags. When we came back the bags were sitting in the reception area near the seats and could have been easily stolen. Once we checked in I was delayed getting to the room. My wife tipped the porter and I met him in the corridor and also tipped him. The decent thing for him to do would have been to refuse the money. I was fuming when my wife told me that she had already tipped him. On our second night we came in to the hotel and one of the staff was having a furious argument with a hotel guest and was yelling at him at the top of his voice. It was no way to treat anybody. Other than that the rooms were fine and the breakfast staff were particularly friendly.", "Date": "February 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Guildford, Surrey", "Title": "“A good choice for a family”", "Author": "KirksOnTour", "ReviewID": "UR23151756", "Content": "We are a family with 3 young children who were looking for a break from the Xmas mayhem in the UK and we struck lucky! For those of you with +2 young children you will know how hard it is to find somewhere suitable to stay and Paris is particularly challenging. Having searched numerous hotels from guide books in Trip Advisor the Rochester looked a consistently good choice and it was. It's very well located 2 mins from the Metro and 2 mins from the Champs Elysees. You can walk to the Eiffel Tower in about 30 mins, the Louvre is about the same and the Notre Dame is about an hour away. Cross the Champs Elysees and you soon come to the Avenue Montaigne with its very exclusive fashion houses - Chanel, Hermes etc. You won't be able to go in to these shops unless you are ultra rich but its good fun to look and imagine. The hotel was smart, very tastefully decorated and the reception staff were always helpful. This is not a big gltzy hotel but if you want that in Paris you will need to pay a lot more money. We had 2 rooms next to each other which worked well, high up on the 7th floor. Everything was very comparable with a 4 star hotel in the UK. You don't get drinks making facilties in the room but you do get a minibar (an expensve option as always) but there is a supermarket across the road if you want to buy some drinks to have on hand. We emailed the hotel direct after booking through an agent to ensure we got suitable rooms for our needs and they were very obliging. Our deal included breakfast (23 euros if extra) which is a great plus when many hotels in Paris won't include breakfaats in the price. It was the usual mixture of european cuisines - meats, fruits, cereals, a small selection of hot food - and whilst the breakfast room was small we only had to wait a few times for a short while. A few top tips if you are going to Paris, especially with children. Pre-book your tickets for the Eiffel Tower because the queues are nearly always several hours long. The Batobus, a circular ferry service (Eiffel, Musee Orsay, St Germain, Notre Dame, Jardin des Plantes, Hotel de Ville, Champes Elysees) is a good way to get around. The Metro is easy to use and the Mobilisi ticket (1 to 5 days unlimited travel) is a good bet and you purchase it in the station from the automated machines (NB - you can choose English and scroll down for the 'Other Tickets' options. You can pay with your debit card.) So in summary, the Rochester is a good choice for families if you want an authentic Parisian hotel, which is very comfortable, affordable and well located.", "Date": "January 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "UK", "Title": "“This Hotel is Fantastique!”", "Author": "by_golly", "ReviewID": "UR22853082", "Content": "I recently stayed at the Rochester with two girl friends to celebrate my birthday. As it was my 21st I wanted something a bit special from my Parisian hotel and knew I'd found the perfect one in the Rochester, after weeks of hunting. When we arrived I was delighted with the location of the hotel, just off the champs élysées really close to metro station \"Franklin Roosevelt\" which had good connections to both the right and left bank. The reception staff were helpful and spoke in english when my french failed me. We arrived a little early but after waiting for a coule of minutes in the beautiful lobby, were taken to our room with no problems. I had had real difficulty finding a nice triple room in Paris, so I was thrilled with our huge room with a king sized bed for 2 of us and an extra single that had been wheeled in and added to the foot of the bed. Both beds were really comfortable and offered plenty of room, to be fair we all could have slept in the king sized bed it was so big. The bathroom was also a delight and a good size, for a Parisian hotel it was a huge bathroom! With plenty of fresh towels, soaps, shampoo etc. We had a bath with a shower above it which was perfect with plenty of hot water. Everything about the room and bathroom was clean, I have no complaints and we had air conditioning which meant our room was always a comfortable temperature. In the booking I had made breakfast was included, otherwise I think it's and extra 23euros each, which I personally wouldn't pay. The breakfast was really good. The hotel offer a selection of bread, pastries, fruit, yoghurts, cold meats and cheese and smoked salmon. They also have hot breakfasts of egg, bacon and sausage. Overall The trip was fantastique we had no problems with our room, the service or the food and checking out was just as easy as checking in. A brilliant stay.", "Date": "December 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Safat", "Title": "“Just Loved it”", "Author": "Odeh12345", "ReviewID": "UR22753742", "Content": "Rochester and its staff were just outstanding in every aspect", "Date": "December 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "usa", "Title": "“Rochesters was an excellent choice!!”", "Author": "snikoo", "ReviewID": "UR22746089", "Content": "The Rochester Champs-Elysees hotel was a delightful little hotel in the heart of Paris. The staff was so helpful especially the concierge, Roshan, who was extremely responsive to all my needs...and always with a smile! The hotel is ideally located in the middle of all the attractions! The Champs-Elysees is a couple of blocks away and the shopping is wonderful!!!", "Date": "December 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "2", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Great Hotel & Location”", "Author": "Dublin7", "ReviewID": "UR22601103", "Content": "This hotel has a great location just 2 minutes walk from Champs Elysees. Room was a junior suite, loads of space and well maintained. Breakfast fairly typical for a paris hotel with a great selection and the breakfast room was well staffed. The concierge was very helpful on the morning of departure but the male receptionist on both evenings was not at all welcoming. The check in experience was borderline rude. The checkout on sunday morning was the complete opposite efficient and polite. I would highly recommend this hotel as a base for visiting Paris.", "Date": "December 10, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Elmhurst,IL", "Title": "“Overall 4 star BUT . . .”", "Author": "ndsmc", "ReviewID": "UR20728358", "Content": "Location great, 3 blocks from Champs Elysee. Close enough for convenience, far enough to be quiet at night. Literally steps from a metro stop. Patisserie, Starbucks and supermarket 1 block away and far enough from Champs Elysee to be uncrowded. Hotel rooms (we had 2 junior suites for a family of 5 with adult children) were as advertised. Nice beds (firm), crisp linens, furniture in good condition. Now for the BUT . . .This hotel was acceptable for the price (ie. location and all above) but the desk staff and especiallly the concierge were inadequate for the price we paid. They were sometimes put out by our simple requests and could rarely complete the tasks for a lack of knowledge or initiative (eg. could not telll us how long it would take to get to certain common locations) and when we left the hotel to load our luggage into the van, not a single one of the 4 staff present helped us. They simply said \"Au revoir\". Bottom line, if you have traveled frequently and can map out your own schedule and route, you would find the advantages outweigh the drawbacks and the hotel is worth the cost. If you rely heavily on the concierge, I would pick a different hotel to feel that you got what you paid for.", "Date": "October 8, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Rochester, NY", "Title": "“we liked it at the Rochester”", "Author": "LoveParis16", "ReviewID": "UR20702775", "Content": "We enjoyed staying at this hotel: the best feature of it is its location practically on Faubourg St Honore, within easy walking distance from Champs Elysees, The Elysee Palace. The room was good size (especially for Paris!), well appointed, the bath facilities, although slightly narrow, excellent. Service (of the room) was very good, the concierge services though need improving (the wake up call was never made, the taxis came either too early - 1o min - with the meter running, or too late - 25 min.) The registration staff was very prompt and courteous. The common areas, the lobby , the exterior of the hotel look quite impressive and very pleasant.", "Date": "October 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Short Business Trip”", "Author": "mhcooper", "ReviewID": "UR20698631", "Content": "Great Location - hotel is very close to my office, shopping and the metro (great little bakery around the corner that is open early as well as a Starbucks!); Rooms are not the fanciest but has everything you want on a business trip or an active site seeing trip to the city; Very easy to book with their online system and staff is very responsive to letting you know if there is availability; No surprises at check-in and room was ready early;", "Date": "October 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sofia, bg", "Title": "“Nice hotel”", "Author": "IamJay", "ReviewID": "UR20643485", "Content": "rooms are on the small side, service is good, non personal though. Location is okay. We will come back", "Date": "October 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Motherwell Scotland", "Title": "“Excellent service, perfect location”", "Author": "travelguy5266", "ReviewID": "UR17990267", "Content": "We stayed at the hotel as part of our 25 year wedding anniversary and found it to be welcoming and friendly. The concierge was particularly helpful and friendly and greatly assisted us with arrangements and in finding our way round Paris. Food was excellent and the breakfast buffet offered excellent choice. The Resturaunt was very clean and the service friendly and efficient. The rooms were of good size, well furnished and decorated and spotlessly clean. The hotel is ideally situated about 4 minutes walk from the centre of the Champs Elleyse. There is a Metro station 2 minutes from the hotel entrance. We would certainly recommend the hotel to friends and will use it again on our next visit to Paris.", "Date": "July 17, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "England", "Title": "“Nostalgic trip to Paris”", "Author": "JaneN60", "ReviewID": "UR17807284", "Content": "My husbandand and I have just returned from a nostalgic trip to Paris (we used to live on the outskirts of Paris 20 years ago). Paris is wonderful and your hotel was splendid. We did not expect such a good standard of cleanliness, luxury and romatric charm from a 3 night city break trip. Wonderful rooms (clean linen and towels every day), very friendly staff, and so near the heart of Paris. We will return. Jane and Paul Neale", "Date": "July 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cornwall", "Title": "“Good central location”", "Author": "Tresc0", "ReviewID": "UR17381470", "Content": "This is the fourth time of staying at this hotel. Its clean and tidy, but rooms can vary in size. Its in a good location with many restaurants, cafes in close proximity. Reception staff not so friendly this time as on previous occasions though.", "Date": "June 30, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Hertfordshire", "Title": "“Excellent hotel!”", "Author": "jennaainge", "ReviewID": "UR16665427", "Content": "This was a lovely hotel. From the moment we checked in the staff couldn't be more friendly. Hotel was to a good standard and even had laptops you could use in the lobby to arrange your sightseeing! Our room was facing the road so we asked to be moved and they moved us to a lovely room. The first room facing the road was very noisy so best to ask for a room facing the courtyard! From our room there was a nice view of the Eiffel Tower! Perfect! Breakfast was really nice too. Buffet brakfast was included in our trip. It was the normal continental style but also on the buffet table was hot bacon, sausages and scrambled egg, incase you're wanting something hot! There's a metro station just around the corner, about 20-30 seconds walk so that made getting around very easy. Concierge are on hand to help with most things from booking taxi's, Helping you with directions and trains etc! Would stay there if we went again!", "Date": "June 4, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "istanbul", "Title": "“relaxing”", "Author": "marinali", "ReviewID": "UR15497204", "Content": "staff was friendly, room clean and neat a bit small size, very good location, reasonable rates.", "Date": "April 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Loved the Rochester”", "Author": "qbranch", "ReviewID": "UR14914187", "Content": "Wow what a suprise, a hotel in Paris with BIG rooms, ask for the rooms overlooking the courtyard as this will ensure that the din of the Taxis picking people up at 5 in the morning cannot be heard. Breakfast (23 euros unless part of your package) is excellent and lasts till 2pm!! Hotel staff can't do enough for you and they make it all worthwhile. All in all a very pleasant suprise and one I would recommend.", "Date": "April 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Connectict", "Title": "“Loved this hotel”", "Author": "dd1121", "ReviewID": "UR14658951", "Content": "Found this hotel on Trip Advisor last year when my son and I went to Paris for 5 days. It was all I had hoped for - the room was lovely, a small suite with no view but still charming. It's a walk from the Arc de Triumphe and I don't think any of the rooms have a great view but it really is a great little hotel and close to the Metro which made travel very easy.", "Date": "March 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Clean, Central, Spot on!”", "Author": "LynneUK_8", "ReviewID": "UR13576265", "Content": "My husband and I spent 3 nights in Paris as part of a trip to combine Paris and London. We arrived on the Eurostar at Sunday lunchtime and the taxi to the hotel from the Gare du Nord cost around 10 Euros. As a tip, give Paris a miss on a Sunday - it's dead. My first impression was that the hotel is very gold! Reception is gleaming brass and marble, and I reckon they put yellow lightbulbs in! The hotel is spotlessly clean and has lovely room amenities. The minibar is of course expensive! The bathroom has everything you need and the TV in the room has lots of channels including a movie channel that showed occasional movies in English! To my surprise I discovered that American movies are right - you can see the Eiffel Tower from the hotel room! You had to lean out and twist a bit, but there it was... My French is rusty to say the least but this was not a problem in the Rochester. There were people from lots of different countries staying at the hotel and the staff communicated well with them all. Shops and cashpoints are very close and convenient, and there is a bar or a restaurant every few doors! There is also a 24 hour pharmacy on the opposite end of the street (closer to the Champs-Elysses). General points about our trip to Paris: Everywhere was close and within walking distance. We walked to the Eiffel Tower on the first day, and on the second day we bought a 2-day bus ticket with Les Cars Rouge. It takes you round the main sights in about 2 1/2 hours, or you can get on and off as you like. The ticket was around 20 Euros and lasts 2 days, so we used it a lot for the rest of our visit! Sometimes the driving was a little exhilarating but I have a feeling it's all part of the Paris experience. 2 days was not enough to see everything we wanted to see, and we will definitely return. I would not hesitate to go back to the Rochester again.", "Date": "February 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Lovely Hotel Excellent Location”", "Author": "alexia_a", "ReviewID": "UR12322153", "Content": "I booked this hotel for my finacee and I for 30/12/2007-01/01/2008 I thought I got an excellent deal with lastminute.com the accommodation (room only basis) and BA flights for just under £500GBP for both of us because of this my friend and her boyfriend joined us. I looked the hotel on trip advisor before booking and was happy to see all of the great reviews and when I arrived it was even better! We arrived at CDG airport and decided before hand that we would take the metro to the hotel as a taxi transfer was 140EUR. It took about 2 hours from the airport to the hotel you have to change lines twice. After the long journey to the nearest station to the hotel (St Phillipe de Roue) once we came out we could see the hotel right in front of us which was a relief after the long journey. When we arrived at the hotel we were very impressed inside and out the decor was lovely. The check in was quick and we were escorted to our room. As soon as I went in the room it did smell a bit of stale smoke (I am a non smoker) but after a minute I didnt notice it. The room decor was of a very high standard and spotless. You could tell it had been recently renovated. If staying at this hotel you should request a room facing the court yard as my friend'd room was not and she could hear the noise from the street. The hotel had two laptops in the lobbby area where you could have free internet access which I thought was great, but they should really have a time limit as people do stay n it for hours. The location of the hotel was excellent! 5 minute walk to the Champs Elysee. The staff at all times were very helpful and even let us check out at 2pm instead of 12pm. The only down side of the trip which has nothing to do with the accommodation is how expensive everything was. a can of coke in a cafe on the Champs Elysee was 6 EUR!!! Overall I was extreamely impressed with the hotel and I would 100% go back there again.", "Date": "January 4, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "new orleans", "Title": "“Not great...Not terrible”", "Author": "plumNewOrleans", "ReviewID": "UR11965255", "Content": "The Rochester Champs Elysees is a decent enough hotel, but for the price and its star rating, you could definitely do much, much better. Its sister hotel, the Franklin Roosevelt is only 5 or six blocks away, costs the same and is far superior. The photos of the rooms that other reviewers have posted are pretty accurate of how the hotel looks. The Good: The hotel is on the Rue la Boetie, which is only two blocks from the Champs Elysees, near the rond point FDR. Decent sized rooms. There is free internet and the staff is helpful, if not overly competent. (After paying, I asked a question about my bill and watched as the desk attendant fished a copy of my bill out of the trash with my credit card number, expiration date and name written across the top...eek!) The Bad: Pancake-like pillows, one extra blanket for a twin room, not-too-comfortable beds and a general worn-out and tired look to the rooms. And, of course, that credit card issue... One night at the Rochester isn't going to be unbearable, but I wouldn't stay any longer than that.", "Date": "December 26, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Wales", "Title": "“Good 4 star - central location”", "Author": "Bobs-big-vacation", "ReviewID": "UR11694162", "Content": "This is a well located easy to find 4 star just off the Champs-Elysees and steps away from the St Phillippe du roule metro. On arrival, there was a problem with the room. The room smelled fausty from cigarette smoke and despite the claim from reception that this could not be, as it's against the law to smoke in rooms ...(or something similar...so why are there ashtrays left in rooms and outside every lift?) ...we were given the choice of 4 other rooms to view (and smell!) Removed to a far larger and more sweetly smelling room, the weekend recovered from a shaky start by such helpful service. The room itself was clean, well appointed, and equipped with a large bathroom. Breakfast had excellent choice for a continental / French breakfast with attentive service.", "Date": "December 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ontario", "Title": "“SPOTLESSLY CLEAN, EXCELLENT LOCATION!”", "Author": "Lumsa", "ReviewID": "UR10759625", "Content": "I took my 22-year-old daughter to Paris as a graduation present this year and we stayed at the Rochester. We have both travelled extensively throughout N.A. and Europe and this hotel was EXCELLENT VALUE for the money. We are both \"clean freaks\" and the hotel was spotless!! Our room was thoroughly cleaned each day...the bed linens were crisp and clean, the bathroom was always sparkling clean with lots of fresh towels available. The bathroom was done in marble...we had one king-sized bed and it was HUGE...more like a California King..and soooo comfortable. The location was superb. You walk about 2 blocks to the Champs Elysee..(we walked day & nite..lots of people around). The cabfare you save by staying at this location is considerable. From here, we walked everywhere, which is the way to see Paris! The Rochester is just blocks from L'arc de triumphe where you can catch the subway to just about anywhere.....or walk to Bato Bus which is the BEST mode of transportation to see all the of tourist sites if you don't want to walk. I would definitely stay at the Rochester again. The other hotels in the same general location are not worth spending more for. The only thing I would say about staying here or at any other hotel in Paris is that the price for including breakfast is not worth it ( for us anyway) ...we only wanted pastry and coffe in the morning and you can just walk up to the Champs and buy it for a fraction of the cost; sit down outside the cafe and \"people watch\"", "Date": "November 11, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arkansas", "Title": "“Great Hotel, Perfect Location”", "Author": "bddoughty", "ReviewID": "UR10647135", "Content": "October 23, 2007 for eight nights Though check-in was a bit disorienting as French TV was filming in the Lobby making it difficult for me to locate the lift through the bright lights and what seemed like a sea of people, the Rochester Champs Elysees could not have been a better choice. The staff are efficient, though certainly not overly friendly, it is France after all; nonetheless, they were most responsive, particularly to my needs relating to an urgent need to check email and follow up with several phone calls to home due to an emergency. I was most grateful. The Hotel Lobby is very tasteful, the breakfast room small but nice, the breakfast was wonderfully plentiful with a wide variety of choices, healthy and not so healthy. Though my first room was larger than the second, I choose to move to a quieter location overlooking the inner courtyard and away from the lift as the noise from the lift produced an overwhelmingly annoying low level scratching sound that just about drove me insane. I believe it was #609. I moved to #311 which as noted was smaller but it was blissfully quiet. A large double French window that fully opened onto the courtyard. Flat Screen TV, Desk, Chair and lots of closet space with a safety box. The bath was a bit small though polished. Shower/tub with lots of bath soaps and gels supplied. Housekeeping Great, though a bit loud in the morning. Location is truly minutes from the Champs Elysees in one direction and Rue du Faubourg Saint-Honore in the other direction. Most everything you need within a very short distance. Overall, this is a well managed property, tasteful with aspects of elegance here and there. Acquired the room through United Vacations at a very good rate. Wouldn’t think anyone would be disappointed with this hotel.", "Date": "November 6, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "new york", "Title": "“Wonderful hotel”", "Author": "grangster", "ReviewID": "UR8052918", "Content": "Just returned from a second honeymoon in Paris. Hotel was clean; modern and in the center of the Champs. The room we stayed in was spacious and clean. The only thing we will tell all travelers is that if you are seeking to spend a great deal of time on the left bank (especially in the evening and late evening hours) then this hotel may not be in the ideal location for you. Notwithstanding the above, the hotel is adjacent to the Champs and near two metro stops. We could not be any happier with our selection.", "Date": "July 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“LOVED THIS HOTEL!”", "Author": "slcSF", "ReviewID": "UR8039777", "Content": "The jr. suite was perfect for my 16 and 11 yr old daughters and me on our first visit to Paris during the last week of June '07. The rooms and the hotel were exactly as they appeared on the hotel website. The rooms and bath were clean and spacious -- very comfortable for 3. The daybed (not pullout) in the outer room was very comfortable. We had 2 flat-screen TVs and nice robes and towels. The hotel staff was friendly and accommodating. I needed milk to take with some medication just as the restaurant staff was setting up for breakfast. Although I was more than hapy to pay for the milk, it was given to me generously and graciously. As others have noted, the location is quiet and very convenient to the Metro. The major line to the Louvre is a 5 minute walk away on the Champs Elysees, and another line to the Eiffel Tower and Boulevard Haussmann is steps away. Other neighborhood amenities include a boulangerie and grocery store within a few yards of the hotel . Dalloyau teahouse and pastries is a couple of blocks away on the elegant Faubourg Saint-Honore. Their chocolates and pastries are not to be believed, and they offer gourmet food to go that rivals anything we've had in San Francisco, although it does not come cheap. B of A customers will find a no-fee Paribas branch with ATMs half a block away. The proximity to Champs Elysees allowed my daughters to have some independence in a safe environment. In short, I can't say enough good things about this wonderful hotel. We would come back in an instant.", "Date": "July 2, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Ft. Lauderdale, FL", "Title": "“Not a four star experience”", "Author": "Baskaat", "ReviewID": "UR5701108", "Content": "We spent a week at the Rochester in August and I cannot recommend it as a four star experience. The room's carpeting was stained, there was mold in the shower and the towels were horrible. Most of the staff were nice amd spoke excellent English. There is a metro stop a few steps away, but you need to change trains at the next station to get anywhere near the major tourist destinations. As described in previous reviews, the internet hardly ever worked. We did get a courtyard room and it was pretty quiet. I would not stay there again.", "Date": "August 23, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "sussex Eng", "Title": "“excellent hotel”", "Author": "rachie-m-2004", "ReviewID": "UR5563377", "Content": "We stayed at this hotel for 3 nights during August. The Hotel is in an excellent location, there is a tube stop just a half minute walk away and the Champs elysees just a 5 minute walk. The mini bar prices were very expensive, but there is a supermarket across the road which was very useful. We had breakfast bought to our room every morning with a selection of croissants, rolls, yogurt and fruit. The room was bright, clean and nicely decorated and overlooked the small courtyard. All in all we had an excellent time and would recommend this hotel without hesitation.", "Date": "August 7, 2006"}], "HotelInfo": {"Name": "Rochester Champs-Elysees Hotel", "HotelURL": "/ShowUserReviews-g187147-d197539-Reviews-Rochester_Champs_Elysees_Hotel-Paris_Ile_de_France.html", "Price": "$276 - $445*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">92 rue la Boetie</span>, <span class=\"locality\"><span property=\"v:postal-code\">75008</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "197539", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/26/4e/264ebae6c57e52e3c67062300da90ba85large.jpg"}}