{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Jeddah, Saudi Arabia", "Title": "“not as expected”", "Author": "sam s", "ReviewID": "UR124203160", "Content": "for six days i suffered a terrible experience , my room was in 4th floor as i requested before, but the elevator was out of order and it will be for atleast 2 weeks as reciption said, terrible noise all day long such as hammering,banging,drilling and cuting with machin saw.due to renovation was going on 5th floor(reciption lady said renovation was finished but this was not true) rooms were too small and lights are soo gloomy not good for reading. a few good things about this hotel are an honest man at reciption mr.sayed,tea and coffee facilities in the room and good house keeping lady.(very good location)", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Beautiful, central with kind staff but tiny rooms”", "Author": "Efaki", "ReviewID": "UR123685309", "Content": "It is situated in a very good position and it is very beatiful. However, the rooms are tiny, we had a double room and our two medium size suitcases could not fit. It almost does not have wardrobe, there was a place without door that could fit 4-5 pieces, but we had many more given that we travelled for 10 days. Also, the water could not be adjusted. Whether it was getting hotter or colder but you could not fix the temperature. We asked to change room but the first day they told we would do it the second, the second they told we do it the next and so on. In addition, the internet was not working properly. Nevertheless, the staff was very polite and professional that they made us leave happy despite the inconvenience. Last but not least, we paid far too much for it because it was booked through a greek agency but you can find better prices online.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“Wonderful break in Paris”", "Author": "Cassie17-46", "ReviewID": "UR123402602", "Content": "Perfect Hotel clean and very comfortable. Charming staff, all were very helpful, ideally placed for sightseeing. We throughly enjoyed our stay.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cleveland, OH", "Title": "“Served the Purpose”", "Author": "TakeMeAwayFromItAll", "ReviewID": "UR122976520", "Content": "I recently stayed at the Best Western Plaza Elysees for business. Here is my opinion of the property: The Good: The hotel's location is terrific. Literally 2 minutes to walk to my office, and within 10 minutes walk up Rue d' Washington you emerge on the Champs Elysees, somewhat in the middle across from Louis Vuitton. I met at least 6 different front desk persons, and all spoke English well and were friendly and helpful. The room was very small--but I know Americans are used to much larger. I was alone; it would have been challenging for there to be more than one person and suitcase in the room. Not sure where they got the pictures on the website-- my room was nothing like those! The bathroom was good sized, updated, and very clean. Nice quality towels, no washcloths. There is a decent hair dryer but is the kind where you must constantly depress a button to make it work. Is there really a problem with people leaving hair dryers running while they are out of the room? I don't understand the need for those. I didn't sit and eat breakfast, I just grabbed a chocolate croissant each morning to munch while I walked. They were excellent! Another plus was the number of power outlets in the room. There is a mini bar, which is just a small refrigerator, which is good if you wish to buy water or soda and keep in your room. There are several little shops to purchase drinks and snacks up both Rue d' Artois, Rue d' Washington, and the boulanger next door. The Not-So-Good: As a business person traveling many time zones away, WiFi access is crucial to communicate with home, and to keep up with my work. I did not have good luck with the hotel wifi. It would literally disconnect every couple of minutes, and became very frustrating. My iPhone was never able to connect. I went down to the front desk for help, and another guest also commented that it was quite tricky to connect and quite finicky once connected. The last night there the internet was not functioning at all, not even for the front desk. This must be addressed, it is a big problem. The room was also very hot-- I even turned the radiator off (no wall thermostat control) but still had to open the window in the mornings after my shower. Speaking of showers, there is no shampoo and conditioner provided, only lotion and \"hair/body gel\" in a dispenser on the shower wall and by the sink. I would not use this on my hair, fortunately I had brought my own. Also, the shower water temperature would not stay steady, rather fluctuating between cold and scalding. I was constantly trying to adjust it. Took some of the fastest showers of my life because of this! The hallways are very small and very dark. There is a light you can turn on as you enter the hall (took me 2 days to find) but it is still very very dim and, as a female alone, I was scared at first. It was difficult to even find my room it was so dark. The television only got a couple of English speaking channels, CNN and Bloomberg. Because of the WiFi issue I couldn't download anything to my iTunes to watch. Worth advising is that there is a card in the lobby offering a shuttle to the airport at a reasonable price. I asked them to make a reservation for me, but the shuttle would not accommodate my time-- either 30 minutes earlier, or 20 minutes later than I felt comfortable with, given that I would be the \"last stop\" and therefore wasn't confident that it would make it on time. I then asked for a taxi, and they said that if they call a taxi it may be 10 Euro more because they travel to come to the hotel to pick you up. Rip off, but did it anyway. Fortunately I didn't notice that it was more expensive than my trip from the airport to the hotel. None of these transportation issues were the fault of the hotel, but thought I'd make everyone aware.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Michigan", "Title": "“Will definitely return”", "Author": "francetraveltrekker", "ReviewID": "UR121872617", "Content": "The hotel is in a decent location and truly is easily within 10 minutes walk to the Champs Elysees. Rooms were exceptionally clean and the staff very helpful. Breakfast was the typical European breakfast, but well staff and supported. The only complaint would be that the walls were a bit thinly insulated which meant you did hear some noise from other rooms. No problem with noise from the street. Even with this slight problem it was not terribly bothersome and I would definitely return.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Ankara, Turkey", "Title": "“Not a Champ Elysee Hotel”", "Author": "doliche", "ReviewID": "UR119233632", "Content": "Do not think that it is close to Champ Elysee, you should have a 10-15 min. walk. However, pricing is like it is located on Champ Elysee. Rooms must be renovated. Elevator is problematic, it had difficulties to go upstairs. It needs some care too. Besides even I was at the fourt floor my room was noisy both due the cars and sounds coming from other rooms. Breakfast was the best side of my staying.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Good Location”", "Author": "KamaDog", "ReviewID": "UR118701510", "Content": "This Hotel was is a great location. Clean but small. The staff was mixed. Met three different people at the front desk, one was really nice, the other two were really no help and seemed to be bothered when asking them questions. But the room was nice and had beautiful large windows that opened which gave me some fresh night air! Bathroom was ok, not great. I am not 100% sure I would stay here again, not because it was bad, but because it did not wow me. Would have liked better service. Would of been nice if they offered to get us a cab going to the train station instead of watching us lug out 3 huge suite cases.", "Date": "September 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Fantastic hotel in great location”", "Author": "CathyPerth_Australia", "ReviewID": "UR116602134", "Content": "The Best Western Plaza Elysees is a beautifully kept hotel in a fabulous location. Our welcome to the hotel set the tone from the moment we arrived. The staff were so friendly, efficient and welcoming. Our room was ready on arrival as was a lovely bottle of wine and a cheese platter. While the room wasn't large (but then none are in Paris), everything was spotlessly clean, well made up and VERY comfortable. I wont go on about the amenities except to say that nothing was lacking. The breakfast/sitting room had the Parisian charm and the mornings offerings of a traditional breakfast was great, the hot chocolate was to die for. Out the front of the hotel is a taxi rank, bus stop just around the corner and a metro station a few metres away. Champs Elyse one short street away (5 mins walk) and loads of great restaurants & bars close by. It doesn't get any better than this.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“An average hotel in a very good location”", "Author": "Pammie21", "ReviewID": "UR115049231", "Content": "My boyfriend surprised me with a trip to Paris for our 9 year anniversary, the only thing that was left to do was book a hotel. We wanted a 4 star hotel a great location and found the Plaza Elysees, clicked onto their website looked at the photos we were very impressed so decided to go ahead and book it. It was slightly more expensive than other hotels but we thought it'll be worth it. We got there and my first question to the taxi driver, where is it, he pointed at a door with a small sign beside it, i replied is that it. We went in and the receptionist couldnt speak English, i had to point to our booking on her computer screen, she gave us a map and pointed us on our way. Went we went to the room which was on the first floor near the breakfast room, opened the door of the room and it was NOT how it was on their website, very small and pokey, you couldnt swing a cat. I was highly dissappointed, though it was clean enough and had a bed which was all we needed. We were 5 mins work from the arc de triomphe which was brilliant. The breakfast the next few mornings was nice enough, everything you'd expect, with plenty of variety. I can only say the location of this hotel helped it otherwise it would have nothing going for it, very expensive for what you get. Would definely not book again.", "Date": "July 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Sleights, Whitby, North Yorkshire, England.", "Title": "“You get what you pay for.”", "Author": "WanderingYorkies", "ReviewID": "UR92760025", "Content": "We stayed here overnight to visit the Monet exhibition on 12.01.11 and I would describe the hotel as only average. Good points; The hotel is centrally located and 5-10 mins walk to the Champs Elysees and has a number of bars and cafes nearby to choose from. The room itself was clean and tidy and the price we paid for a central Paris hotel bedroom was not expensive at 129 Euros for the night with breakfast included. We found the receptionists helpful and we were able to store our luggage with the reception after we booked out so that we could wander around Paris without suitcases, we picked the luggage up at around 4.30pm with no problem. Bad points; The hotel is located off Boulevard Haussman which is a busy main road with noisy traffic starting at 7am. Although the double glazed windows shielded most of the noise it was still loud when closed. Our double bedroom was located on the first floor near to dining room and I was woken by staff at around 4.30am preparing the room loudly. I am a pretty sound sleeper and they must have crashed about a bit to wake me! Although the room was clean and tidy the bathroom and toilet were divided up which rendered the toilet being the smallest that I have encountered in a hotel. I just about squeezed into the room and although I'm tall, I'm not a lardy! Then there was the bath, if you're over 5ft it's small, my wife is of average height and she felt cramped, I looked plain mad in there. I appreciate that continental baths are conventionally small but this was bijou to say the least! The wall between our room and next door was pretty thin to the extent that we could almost make out what our neighbour was saying during his phone calls. We also had a strange wardrobe which had thin white string instead of wardrobe doors! Lastly, breakfast was ok but no better than that. All in all, the hotel is ok for a quick visit staying two nights at the most. If the hotel had been just a few doors down into the nearby side street attracting less noisy traffic and the staff didn't clatter about making as much noise as a Salvation Army band in the early hours then I could have overlooked the other minor negative points. In the end, you get what you pay for.....", "Date": "January 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Riga", "Title": "“Nice hotel, better for business than holiday”", "Author": "LatvianTraveller", "ReviewID": "UR86834945", "Content": "I stayed in this hotel for 3 nights from Nov 8 till Nov 11. I chose it mainly because its location - close to the Hilton hotel, where my business venue took place. Hilton is basically almost around the corner. The RER station is conveniently located near by - 5-7 minutes walk, so easy to take red and then blue train line to the airport - CDG in my case. Champs Elysees are also very very close. I had a room on the first floor, next door to the breakfast room. It was quite small - although ok for me alone, but since it has a double bed, it is obviously used as a double room as well. If I were with my husband, we would be short of space a little. But the room was nice, cosy, clean, with big TV, nice small closet for clothes, good sized bathroom. Everything quite new, tastefully decorated. Breakfast was quite disappointment, very little choice, almost nothing available besides pastry. I don't eat musli, so it doesn't count for me. It is good that we had coffee breaks during seminar :-) But coffee was very tasty and the lady servicing the breakfast room was nice, friendly and welcoming. My employeer paid 150 euro per night for this hotel, although in the room there was information that the tariff is actually 300... If I paid 300 per night myself and we would stay there with my husband, I wouldn't be too happy. But all in all I liked this hotel and for business purposes would go there again.", "Date": "November 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Not for vacation travel - strictly business”", "Author": "TorontoOntario1", "ReviewID": "UR84101514", "Content": "We booked this for our holiday 9 nights, a package that included breakfast. Good location. But clearly this is business hotel, for one-two nights only. Rooms are very small - no bureaus for clothes so you live out of your suitcase the whole time. Very tiny toilets. Staff are nice but not concierge-variety. You're on your own.", "Date": "October 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“beyond my expectations”", "Author": "regisigr", "ReviewID": "UR80923702", "Content": "The hotel was recommended by an old friend who travels a lot around Europe and I trust his opinion. My experience there was beyond my expectations! A nice elegant hotel in the heart of Paris, so beautifuly decorated. The most important was the fabulous staff who helped me at anytime. All of them with a smile and so friendly, made me feel home at once! delicious breakfast in a real French ambience. I hope to come back soon for leisure, as the location is ideal and so easy to visit the rest of the city within minutes. a great hotel with personality and great people! Thank you all for everything", "Date": "September 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Very nice hotel, great location”", "Author": "WarwickHotels", "ReviewID": "UR70266869", "Content": "I went to this hotel in order to see one of my colleague and I found it vezry nice and well decorated. The location is very good.", "Date": "July 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "durham", "Title": "“excellent service and staff”", "Author": "wispaDurham", "ReviewID": "UR62134013", "Content": "Was supposed to stay here for 4 nights only, but due to volcano in Iceland had to stay another 5 days. Staff were very helpful and moved bookings around so we could stay. Receptionist even helped me book Euro star. All staff were very friendly and helpful. Hotel itself was lovely, very quaint. Rooms were lovely and always clean, maid came every day. Breakfast was continental, bread, pastries, fruit, yoghurts etc and lady was very friendly there too. Hotel was located in an excellent spot. about 5 mins walk to Champs Elysees. You could even walk around most of sights if you were feeling fit. would definately stay here again", "Date": "April 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sweden", "Title": "“A very pleasant, friendly place! Highly recommend!”", "Author": "divique", "ReviewID": "UR56885758", "Content": "My husband and I stayed at this hotel for 5 days and we enjoyed it very much! The staff was pleasant, the service was great as well as the location. Our room was beautiful and we were told it had been designed by the head of the hotel! We were very impressed by it all.", "Date": "February 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Vancouver, BC", "Title": "“Friendly staff, great location.”", "Author": "dtengineering", "ReviewID": "UR38666640", "Content": "We spent four nights here while enjoying the sights of Paris. The location, just a few blocks from the Champs Elysses, was great... although it would have been nice to be a bit closer to a metro station (closest to George V on the Yellow Line or Charles de Gaulle Etoille on the Blue) when we arrived with our luggage. The front desk staff were very friendly and helpful in arranging a bus ride to the airport for us so that we didn't have to lug our bags back into the metro on our way home. The room was fine, it appeared to have been recently renovated (renovations were continuing on the second floor) and was the first room we stayed at in our three weeks in Europe that had both a large flat screen TV with a good selection of channels AND a minibar fridge. The air conditioning worked great, too. Breakfasts were very good, and continued to impress upon us that a \"continental breakfast\" in North America is most often a cheap, shoddy and pale imitation of the true delight of a continental breakfast on \"the continent\". The room design was a little weird... with a narrow hallway with a door at each end leading past the bathroom to the bedroom, and there definitely wasn't much spare space in the room, but we were comfortable and cosy. Although THIS Best Western doesn't offer free wifi, we were able to stand on the balcony and pick up a free wifi signal from a neighbouring Best Western just down the road. We had a good stay here and would stay here again.", "Date": "August 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“very nice”", "Author": "Tenny-Two", "ReviewID": "UR31412390", "Content": "Clean, comfomtable and so close to Champs Elysees. very helpful staff . great restaurants in the area and near public transport.", "Date": "June 2, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "dublin", "Title": "“Hated this Hotel - Do not stay here!!”", "Author": "nuala07", "ReviewID": "UR20757925", "Content": "I booked this hotel online for 2 nights as I was taking my boyfriend to Paris, his first time there. I booked the hotel based on their website and the photos of the rooms there. When we got to the hotel the room was not ready at the time they had said. There was nowhere to sit and wait only the cold breakfast room. When we did finally get into our room it was disgraceful for the price. It was very old - only one power socket in an extremely awkward place. Bathroom was clean but very old. We were that tired from all the waiting around that we just went to bed and to our annoyance the following morning at 7.30am builders started to work right outside our room. We ordered room service one of the nights which took 2 hours to arrive. We did not eat breakfast in the hotel as it didnt look to nice but they did try to charge us for it on the end bill. I unfortunately had my bag with my credit card stolen and so wanted to try and arrange an alternative way of payment. The staff practically ignored me and my boyfriend ended up having to pay them with his card which I didnt want as the trip was meant to be on me. Found the whole experience a joke for the price of the hotel and would definately not recommend to anyone. Location is great but doesnt make up for the bad facilities", "Date": "October 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Great value, excellent location”", "Author": "ethnographer2k3", "ReviewID": "UR18145951", "Content": "I stayed at this hotel while attending a conference - the conference organizer had worked out a 100 euro/night charge for a queen bed. I found it perfectly fine, and the location was incredible. - The room was rather small and had very few electric outlets - I had to reach up on top of the television to charge my cellphone. - For some reason the room had a tiny (3X3 foot) entryway. There was no light in the entry, so it wasn't too pleasant to go through it. - The bathroom had been recently renovated - it was clean, bright and modern. Very nice. - Bed was reasonably comfortable, queen sized. Room looked like it hadn't been renovated recently, but wasn't dirty or run-down. Nice desk. I think there was a tiny safe in the closet, but I didn't use it. - The description on the website claimed it had free wireless internet - it had fast wireless internet, but it sure wasn't free. -The room was a little hot (yes, even in March!), and with the window open it was very noisy. - Breakfast area was very cute, and the included breakfast was pretty good; totally typical for a Paris hotel, but nonetheless very nice. - Ten minute walk to the Metro. About five minutes from the Champs Elysees. Plenty of interesting restaurants and stores around. Clearly a high-rent area; it felt totally safe day and night. You can walk a few miles down St.-Honore to the Tuilleries and the Louvre if the weather's nice and you're not in a hurry. - The front desk staff were very friendly and helpful and spoke perfect English. They were happy to arrange transit to the airport, and I'm sure they'd be helpful with tourism information. You can probably get an equivalent hotel for cheaper in Paris, but this seems to be a good option if you want to be in this area. Not a lot of character, but why would you visit Paris to hang around your hotel?", "Date": "July 22, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "U.K", "Title": "“Good position.”", "Author": "Anonymous47", "ReviewID": "UR15655896", "Content": "Friendly staff. Very small room but adequate. Good position for sightseeing.", "Date": "May 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "paris", "Title": "“nice hotel with friendly staff,would stay here again”", "Author": "ParisTravelgirl07", "ReviewID": "UR8695756", "Content": "We stayed in this hotel for a weekend for our wedding anniversary. The hotel is clean, well run and the staff are very friendly and helpful. The building is old but the rooms are nicely decorated and clean. They are not damp or musty which was my main concern. The bedroom is average size and the bathroom is very clean and not too small. Location is very good, walking distance from Champs Elysee and we got the red bus tour and found it very good. No iron in room. Flat screen TV - good reception. Small lift - will take 4 people max. Mini fridge in room stocked with drinks, water and chocolate. Check prices before you eat or drink.", "Date": "September 11, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Reading", "Title": "“Location the only redeeming feature”", "Author": "RJH5566", "ReviewID": "UR8256234", "Content": "My girlfriend and I wanted a slightly better quality hotel for our visit to Paris, and so looked for a four star. We were worried that this would be a slightly higher rate hotel because of its good location and not because of quality, but we thought that the 4 star rating would mean that both the location and hotel would be good. Unfortunately we were very wrong. The hotel is nowhere near the standard I would expect for a 4 star: The rooms are only slightly bigger than the bed The bathroom facilities were reasonably good, but not clean - our toilet was stained beyond cleaning for example. Also, we found the staff difficult and rude - for example, we had booked a non smoking room and got allocated to a smoking room and they were difficult about moving us - it took us 20 minutes to persuade them to change the room we were in. Also, there was building decorating work going on which meant that there was no running water for whole days. We have no discount for this. The only positives I have are: 1. The air conditioning was very effective 2. The location was good - 10 min walk to champs elysee. However, all metro stations were also around 10 mins walk, so not that quick to get somewhere else. Overall - don't book here - you can get a much better hotel for a lower room rate if you are willing to have a slightly less prestigious location. I have stayed in Paris before and had a much better time staying further out and taking a 15 minute journey in.", "Date": "July 30, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London, England", "Title": "“Horrible hotel within close proximity to Arc de Triomphe”", "Author": "Euro_critic", "ReviewID": "UR5561700", "Content": "Stayed there last week for 4 days and have got only one positive thing to report, hotel's location. Breakfast is alright and can be delivered to the room in the morning but don't expect fresh bread. Staff members were polite enough but were useless when I needed them the most. Around 12 at night myself and my wife reported loud banging from our neighbours and this went on till 6:30 in the morning. Had no sleep and staff didn't look bothered and didn't even apologised. Rooms are made of toilet paper material and you can hear your neighbours breathing in their room. Toilets and rooms are pokey. Good enough for kids but not for adults. Worth mentioning is the incident when I ran out of toilet roll, the morning we were departing and I requested a staff member for a new roll. The lady who was working there offered me a half used toilet roll from another guest's room. This hotel is only worth staying if you are going to Paris on a low-low-low-low budget and with equally low expectations.", "Date": "August 6, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Verona, New Jersey", "Title": "“Beat-up, not-so-nice Parisian hotel”", "Author": "BenjaB", "ReviewID": "UR5545186", "Content": "I stayed here for 5 nights on a business trip, and was not impressed. No lobby to speak of, a front desk that was NOT helpful (forgot wake-up calls, for example), a tiny room with a stringy curtain over the closet rather than a door, a broken light fixture in the room, and located on a rather noisy street. I have been to Paris on business many times, and usually stay in a Best Western Parisian hotel, but compared to the others I cannot recommend this one. The only reason it gets a \"neutral\" rating is because I got a good rate on the room -- this was a business trip, after all, not a vacation.", "Date": "August 2, 2006"}], "HotelInfo": {"Name": "BEST WESTERN Plaza Elysees", "HotelURL": "/ShowUserReviews-g187147-d197964-Reviews-BEST_WESTERN_Plaza_Elysees-Paris_Ile_de_France.html", "Price": "$171 - $450*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">177 Boulevard Haussmann</span>, <span class=\"locality\"><span property=\"v:postal-code\">75008</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "197964", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/3a/b2/8f/best-western-plaza-elysees.jpg"}}