{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, Canada", "Title": "“Nice Hotel”", "Author": "jerome_in_london", "ReviewID": "UR139498522", "Content": "Best breakfast we had in Spain. Not a lot of amenities close by. Local restaurants are across the river. 10 minute walk to subway, but stop is hard to find even when you are almost on top of it. Nice big bathrooms. Room was very clean. Bar fridge was so fully stocked we had to take stuff out to put ours in. Very modern looking hotel, but not real close to anything. 30 Euro cab fare back to airport", "Date": "September 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Good stay”", "Author": "StPolo", "ReviewID": "UR133992254", "Content": "Stayed here in June 2012 at the end of a tour of Spain and Portugal. This is a very comfortable and modern hotel finished to a high standard with very capable and friendly customer focused staff, best air con in 2 weeks. Set just outside of City centre 25 minute walk in or 1.50 euro single bus ride on number 50 circular bus route, 7-8 euro taxi fare. Some local bars and resurants close by and Althletico Madrid football staduim close as well. It felt safe. Enjoyed Madrid very much, so much to see and enjoy and it was a great bonus that the European 2012 football tournament was at it's final stages whilst we where here. Would stay here again. Can't comment on value as it was part of a package.", "Date": "July 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "El Cairo, Egipto", "Title": "“best in madrid”", "Author": "Posted by a NH Hoteles traveler", "ReviewID": "UR132952598", "Content": "Perfect location, stay and accessebility. Easy from an d to airport. Helpfull staff. Clean and comfortable.", "Date": "June 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Houston, Texas", "Title": "“Pleasant stay”", "Author": "scenic2010", "ReviewID": "UR132763247", "Content": "On the southwest side of Madrid, only one bus line to Plaza mayor and the royal palace from which there were many public bus lines and subway stations and a lot of popular tapas bars, night life activities and you can buy excursion tour tickets there. There were always taxis in front of the hotel. It was right on the 10km. long river bank recreation and jogging, walking strips playground for children. The area was safe. the hotel staff were friendly. the hotel was modern and brand new and it was fully booked when we're there. It looked like there was nothing much but about 2 blocks on the west side there was a north-south roads where the locals from numerous apts. shopped and ate.", "Date": "June 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Newcastle upon Tyne", "Title": "“Good hotel”", "Author": "Pinchy", "ReviewID": "UR130235928", "Content": "Spent 4 nights at this hotel, room was quite big with extra large very comfy bed (which is unusual in spain for some reason, normally twins) flat screen TV on wall, free safe, lovely shower room. The room was air conditioned which was needed. I normally don't sleep well when away, but I had the best nights sleep here. We weren't disturbed by doors clashing or the cleaners. We prepaid the breakfast which was good, you made your own coffee out of the machines, but it was proper coffee beans, really good coffee. There was a very large pastry selection, with fresh fruit, yoghurt, dried fruits, cooked meats and scrambled eggs, fresh juice. The area is very nice, we walked to the left of the hotel along the river, passing parks and cafes on the way. There is a bus stop outside to the left, no 50 to the centre which is 1 euro 50 or 3 euros return. We bought a 3 day pass which worked out cheaper, as you could also use the underground. The bus took about 15 minutes to get to Plaza Mayor, 1 night the road was closed going to the Royal Palace as there was a parade on, so we ended up walking, but it only took about 25-30 minutes. The weather was really hot when we were there, went to the Sorello museum which was very interesting, spent a day at the zoo and a day in the Retiro Park. Taxi was 30 euros back to the airport (which was considerably cheaper than getting one to the hotel, it cost 43 euros!) All in all a very good time.", "Date": "May 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "UK", "Title": "“Business hotel”", "Author": "SEAUKtraveller", "ReviewID": "UR129523437", "Content": "Pros: Nice, Clean, big spacious beds, beautiful rooms, 25 mins walk to puerta del sol, 10 mins walk to closest metro, but 5 mins walk to nearest bus station to town centre. Very quiet location by the river. Great value for money Cons: a bit further out than expected but otherwise really good", "Date": "May 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great hotel, location has pros and cons”", "Author": "cqfp123", "ReviewID": "UR129468805", "Content": "Stayed for 4 nights. Pros: Reasonable price, stylish building and decor, spacious room and bathroom, excellent wifi (included), on site gym, safe in room, quiet location on the banks of a river, perfect if you are a runner. Good buffet breakfast for 9 euros (if pre-booked the night before). Friendly staff. Cons: Difficult to reach from the airport using public transportation, multiple connections necessary. Keep in mind that the Madrid metro is NOT traveler-friendly due to lack of escalators at several stations. Within walking distance of the city center but it's a 30-min uphill walk. Although there is a bus station nearby, the closest metro station is at least 15 min away on foot. Noisy housekeeping (slamming doors, etc.).", "Date": "May 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "wexford", "Title": "“Nice hotel, great location”", "Author": "eamonn4711", "ReviewID": "UR128511031", "Content": "This is a great hotel with a great price. The hotel really stands out in the area because of its stylish build. The location is great too, especially for football fans, the Atletico Madrid stadium is only a few metres away. Also if you're into football, many away teams that play in madrid stay there, FC Espanyol were there when i was there. A taxi to the city centre only costs roughly about 7 euro, the bus stops right outside and the metro is about 10-15 minute walk. There are only a couple of bad points about the place. 1. There is no bar in the hotel, they serve alcohol in the restaurant but if you want a relaxing drink for the evening you will have to go elsewhere. 2. There is no iron in the room, I know this is only a small thing but if you have all your clothes crammed into a suitcase you don't want to be walking around madrid in wrinkly clothes and 3. The housekeeping can be noisy. I put this down to the fact all the rooms have wooden floors. Those 3 things i mentioned are very minor, I would stay here again and again if I was going back.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Work”", "Author": "gerry k", "ReviewID": "UR128135988", "Content": "Lovely place, staff friendly but under staffed. Too long to wait for things, the Spanish people are fantastic but this is beyond that, if there are too many people even us English have to wait too long!! Rooms fantastic, great location. Management problem and all would be tops!!", "Date": "April 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Excellent Hotel with easy access”", "Author": "KeiraJayne", "ReviewID": "UR127343047", "Content": "I am always a little nervous about booking a cheap hotel over the Internet in a place I've never stayed before but this was a very pleasant surprise. I arrived at 4am on my first night due to massive airport delays but check-in was expecting me and were very fast. When I arrived in the room, it was very spacious with a beautiful bathroom and shower. There are windows down one entire side which is nice but there are blackout curtains so the sunlight is not a problem. The food is great in the hotel I ordered room service which was plentiful and delicious and the Restaraunt does a great buffet with wine and water for €15pp for dinner which is excellent. In terms of location it is not very central but accessible, it's a 15min walk to the royal palace and surronding squares/ parks. There is also a tourist bus stop just 3 mins walk away. A taxi from most of the tourist areas is around €10 and the airport €30. The hotel also hires out bikes and mopeds. I have really enjoyed my time here and would definitely recommend the NH Ribera at £35pppn.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“Wow what a Hotel”", "Author": "Billy E", "ReviewID": "UR127046333", "Content": "Can't speak highly enough of this hotel, absolutely magnificent. We got excellent value although some may not be as lucky, and checked in with no problems straight away. After seeing pictures beforehand I didn't think it could live up to it but it did completely. The staff spoke good English and let us choose a room, including one allowing smoking although I am not a smoker myself. Excellent facilities in the room, nice on-the-wall TV with all the channels, also probably the best shower I have ever used, plenty of room for storage and nice single beds. From our window we could even see the royal palace. The location was very pleasant and literally 2 minutes from the Vicente Calderón stadium, where we went to watch a match on the Sunday morning. Also not far from the centre and also Principe Pío shopping centre, which we really enjoyed. The walk there is a very pleasant one, with lots of runners, cyclists and dog walkers. Great atmosphere. During the trip we encountered a problem with a stolen passport but at the reception they gave us all the help we needed and we can't thank them enough. We never went for breakfast as we didn't buy it included and went elsewhere, but there seemed to be a great choice. Wi-Fi also wasn't used by us but they gave us the instructions if we wanted it for phone use straight away. Room cleaned every day as you would expect and to a perfect standard. I am hoping to come back to Madrid next year and will make sure to stay here again, highly recommendable to anybody travelling!! Loved it", "Date": "March 31, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Average hotel - okay for tourist groups”", "Author": "Werder1", "ReviewID": "UR126720194", "Content": "On arriving late, I was inclined to give this hotel the benefit of the doubt. However, several shortcomings made me unhappy: 1) non-smoking room smelling moderately of old smoke / air freshener 2) room cold & heater off on arrival 3) dusty cobweb blowing in the wind off the celing above the desk 4) hotel room floor in need of a wet wipe: dirty spots of dried liquid in a corner, small piece of broken glass I stepped in to, bits of human hair 5) the most recent annoyance: no ironing board or irons available - only as part of the laundry service (at EURO 8.05 per dress shirt, ironing only) On the plus side, the internet works well, the bathroom & shower are spacious, the decor is modern & in-offensive, the breakfast reasonable. The hotel is very functionally & rationally designed overall, with small public spaces, no grand gestures. Given that the urban freeway is now running in a tunnel, the hotel is placed very quietly on the banks of a river.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Kent, England", "Title": "“Very comfortable stay in this hotel”", "Author": "AuntSally81", "ReviewID": "UR124575289", "Content": "A very modern hotel only 10 mins bus ride to the city centre, and easy to find from Barajas Airport, you can either get the metro having to change or the overground train direct to Piramedes. The tourist travel pass is very good value for money to use both on the trains and buses. The hotel is stiuated by the river, our room was on the top floor giving a lovely view up the river towards the mountains. It was lovely to have a bath with shower and the queen size bed was very comfortable. The staff were very helpful giving directions and catering to mine and my husbands evening cup of tea in the bar. The only downside was not having tea making facilities in our room, but overall a very nice stay.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Exellent stay in NH Ribera de Manzanares”", "Author": "Echo168", "ReviewID": "UR121227417", "Content": "Hotel, although not exactly central, is easily accessable by public transport. On arriving Barajas International Airport, we bought a Tourist Travel Pass, hopped on Line 8 to \"Nuevos Ministerios\", changed to Cercanias (Light Rail) C7 to \"Piramides\", then Bus 36 to hotel. Bus 36 stop is on the same side of the street when you exit the Cercanias/Metro Station and stops almost in front of hotel. Bus ride is about 10 minutes. Ask the driver to let you off at the NH Hotel if not sure where to get off. Other buses you can take to get around is Bus 50 to Sol (stop is further up Virgen del Puerto), Bus 62 and 36 behind the hotel to \"Piramides\" for the metro. Hotel is new and clean. Breakfast is good, and if you reserve the night before, you get a discount. WiFi is complimentary. There are small local groceries and restaurants nearby where you get value for money. Room is modern, clean and comfortable. WiFi is complimentary, which is a big plus. The minus is there is no coffee/tea maker, or electric kettle in the room for boiling water. You could however request a thermos of hot water to be sent up from the restaurant (free). When there's a game at the Estadio Vicente Calderon, the area was very congested, and buses were re-routed. We were therefore late for the bullfight at Las Ventas. Overall, an excellent hotel to base when in Madrid, highly recommended.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Orleans, Massachusetts", "Title": "“Excellent hotel and experience”", "Author": "Andy O", "ReviewID": "UR120925347", "Content": "I stayed here for four nights as part of a group business tour, so the agency made the reservation, the rate was fantastic for a new hotel in-town Madrid. The WiFi worked very well throughout the hotel and was included in the room rate, as well as a very nice spread for breakfast. I arrived off a US flight at 8:00 AM and they let me in the room that early which was a great accommodation. There is a new bike path and esplanade along the canal out front, and they have bicycles for rent, which I did, and rode to city center and back, so a nice way to explore. I rate it excellent, based on price, services and overall satisfaction.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "ireland", "Title": "“Very good”", "Author": "neilevan", "ReviewID": "UR119220476", "Content": "Stayed here for three nights in early October and we were blessed with terrific Madrid sunshine, the room was fine if a little stark but this is in common with the style of the hotel. The bathroom had a wet room style shower which unlike some modern hotels was a doddle to use with simple left/right for temperature and pull out for pressure controls, the room and bathroom were kept immaculately clean. There was an inroom safe which we didn't use and plenty of storage and drawer space, there was a fair selection of english speaking programmes on the tv and we didn't need the wifi so can't comment on that. Breakfast was a great spread with a wide choice of cheeses, meats, cereals, fruit and pastries along with juices and hot drinks including, most unusually, a big selection of loose leafed teas for those of that persuasion. Distance from Plaza Mayor was approx 25 miutes walking, but there was a bus service every 10 minutes or so, for anyone interested in football this hotel is just a couple of minutes stroll from the Athletico Madrid stadium. Overall a very enjoyable stay and for our first time in Madrid a very pleasant experience.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Fairfax, Virginia", "Title": "“It was an interesting experience...you get what you pay for..”", "Author": "maritez", "ReviewID": "UR96427779", "Content": "I ask the hotel how to get there from the airport and couldn't find the bus, ended up taking the taxi. The check in process was so long, the man at the reception was multitasking and attending to the clients that was checking out instead of attending the one checking in first. Poor customer service. We had asked for two single beds, and guess what we ended up with a king size bed. I then go downstairs and they couldn't accomodate us with the better hotel room so we ended up with the king size bed. We had paid for the continental breakfast and that one was pretty good until my friend wanted two scrambled eggs and the waitress comes back and says \" we cannot get the gas stove to start.\" Enough said The rooms has hardwood floors, the bed is fixed nicely, big windows, however, the room is plain looking. The hotel looks like its an office building. The cab driver even asked us if we are sure that this is the hotel. The hotel is approximately 15 minutes away from Puerta del sol which is the center of Madrid. The back of the hotel is still in construction, it has a lot of potentional however, that will take time. If you need more information, i can help.", "Date": "February 13, 2011"}], "HotelInfo": {"Name": "NH Ribera del Manzanares", "HotelURL": "/ShowUserReviews-g187514-d1985902-Reviews-NH_Ribera_del_Manzanares-Madrid.html", "Price": "$65 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">C/ Virgen del Puerto 57</span>, <span class=\"locality\"><span property=\"v:postal-code\">28005</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "1985902", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/e3/2d/e32d5a6c2acc4ca17d4224001ad006502large.jpg"}}