{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Istanbul", "Title": "“A great deal - Highly recommended”", "Author": "gatortail", "ReviewID": "UR128056079", "Content": "A very good hotel with nice rooms. Shower was nice. Our room was not very small, I can not complain. The hotel in centrally located, however I would have liked to be a little closer to the Spanish Steps. Breakfast was included in our deal and was great. The drinks in the small fridge of the room were also included. We were welcomed to the hotel with great-tasting espresso and cappuccino. My wife and I are walkers, therefore we hardly used any motorized transportation. We were able to walk everywhere and back most of the time. But what made the difference and made this review five stars is the customer-centric staff of the hotel. Hospitality Manager Simona Rongione was very helpful in every phase of our stay. She was very patient and offered a lot of helpful information and recommendations.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Southampton, United Kingdom", "Title": "“Couldn't ask for better”", "Author": "kevinw1957", "ReviewID": "UR127736325", "Content": "Sometimes when you are looking for a hotel to stay in, you sit and look at pages and pages of places on the Internet and sometimes, one just jumps off the page. Such was the case with the Hotel Britannia. Some of the reviews mention that the rooms are small and that is undeniably true, but they are extremely comfortable, clean and everything works just as it should. Our bed was a little on the hard side of firm, but that seems to be usual for Italy. The hotel arranged a transfer from the airport for us and our driver was there waiting for us (collar and tie job) with a Mercedes E300 for just 10 euros more than the standard taxi fare - and a lot less hassle. Reception at the hotel was like we were old time friends - offered a drink while our bags were taken to our room - the sort of small detail that is just so rare. It is very obvious that this is a family run business that takes a pride in what it does and cares for its customers. All the staff spoke fluent English (and from what we overheard, plenty of other languages as well). Other than an Italian accent, some of them you would think were native English speakers. Recommendations for dinner were freely available and good - even a phone call to check there would be room and to expect us. Breakfast was a huge spread - hot eggs and bacon, cold meat, cheese, cereals, breads, etc and fresh fruit. Really nice coffee too and (shock, horror!) English tea. Location is pretty good too, an easy walk to Termini station or Piazza Republicca (metro at both) and all the tour buses start nearby. We were very pleased with our choice, having booked and prepaid for a week it could have gone badly wrong, but worked out perfectly. If you are looking for a friendly and characterful hotel, you won't go far wrong. We thoroughly enjoyed our week and would have no hesitation in recommending and our first choice if we go back to Rome.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“A perfect Hotel in a good location with excellent staff”", "Author": "Mad-dog-71", "ReviewID": "UR126949961", "Content": "Hotel Britannia is a great hotel ideally located for anyone wishing to visit Rome. It's location is excellent down a small quite street less than a minutes walk to the main road Via Nationale where you can catch a bus or metro. It's only a 10 min walk from Rome' s Termini main train and bus station so it's easy to get to from the airport. The hotel is well within easy walking distance of all the main sites in Rome and even the Vatican is only 15 mins by metro. As for the hotel you could not ask for more. The room we had was furnished with everything you need and expect from a 4 star hotel including a free mini bar that was re-stocked every day with water, beer and soft drinks. Our ensuite bathroom was all marble and clean and the shower was excellent. The decor of the room was in a grand style with a large chandelier hanging from the high ceiling. The breakfast is superb with a wide choice of all the usual fresh fruits, cereal, pastries and yogurts. Also there is bacon, eggs and sausage and various other hot options as well as the usual tea coffee and various fruit juices. You won't be hungry this is a well appointed breakfast. The other great point about this hotel is the fantastic staff, a special thank you to Simona who took the time to speak to all her guests with advice and help on Rome. This hotel makes you feel like your at home, safe and comfortable and would certainly recommend it to anyone wishing to have a fantastic time in Rome.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Top class hotel, great location”", "Author": "Deirdre E", "ReviewID": "UR126381885", "Content": "Home away from home with very friendly staff. All spoke excellent English and helped us pick up a tiny bit of Italian. Great breakfasts - including good selection of lovely hot food. Very close to the main terminal for metro, bus and rail but in a quiet side street with a truely Roman feel. Your first stop to make friends in Rome! John E and family", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Superb location and excellent service”", "Author": "Susan T", "ReviewID": "UR126181455", "Content": "Our recent stay in this very comfortable and well-appointed hotel was made particlularly memorable thanks to the extremely helpful, hospitable and efficient staff. When we experienced a baggage mix-up at the bus station (nothing to do with the hotel) the hotel staff went out of their way to sort out the problem for us, while insisting that we carry on as normal with our sight-seeing. We can't thank them enough for their warmth and generosity. Over and above the service, the hotel is ideally located for getting around Rome (by metro or on foot) - and the breakfast was great too!", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ennis, Ireland", "Title": "“A fantastic hotel”", "Author": "Jane L", "ReviewID": "UR126064812", "Content": "We never normally write reviews but we had to recommend this particular hotel. We would like to compliment Simona and the staff of Hotel Britannia for their excellent hospitality and service during our recent trip to Rome. The hotel was beautiful and the staff were so helpful and kind. They went over and above to ensure we had a fantastic holiday. This was an extra special holiday for us as we got engaged they ensured the small details were looked after, We could not recommend this hotel enough and we will be back. Thanks again for making it such a memorable holiday in Rome. Jane and Keith", "Date": "March 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Charming hotel, delightful staff!”", "Author": "Hazerella", "ReviewID": "UR125748132", "Content": "We were extremely impressed with all aspects of the hotel. The staff were delightful, friendly and so helpful (especially Simona and Marco), they really made the stay so enjoyable, The room was very tastefully decorated, really clean and there were nice touches like a free soft drinks minibar, a sweet on your pillow at night and a rubber duck as a gift in the bathroom! The breakfast was excellent and great choice of pastries, fruit, cereal and some hot options- eggs and toast etc. The location was very near to the metro and Termini train station. We would go back there without question.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fredrikstad, Norway", "Title": "“Very nice hotel!”", "Author": "Arild54", "ReviewID": "UR125696860", "Content": "We stayed at this hotel for three nights in the beginning of March. The hotel has a very good situation few steps from the bus stop and a short walk from Termini. The room was very nice with a free mini bar. The cleaning of the room was perfect. When we where out eating in the evening the room was cleaned up again. The breakfast was perfect. Simona and the rest of the staff was very helpful.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Nice small hotel and neat”", "Author": "Shutterloose", "ReviewID": "UR125533883", "Content": "Good location and easy access to public transportation. Friendly and helpful staff. They provide sumptuos breakfast. Excellent for a short stay", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "york", "Title": "“a real gem...”", "Author": "lovespainYork", "ReviewID": "UR124770510", "Content": "Spent 5 nights staying at this lovely little hotel.Very clean room. with comfy beds. Enjoyed the little touches like the well-stocked free mini-bar, kettle(with earl grey t-bags).The balcony was great and would be fantastic for breakfast in warmer weather. All the staff were pleasant and helpful especially Simona who was keen to get feedback on service to make sure standards are kept up.They are! The location was perfect-easy to walk to main sites and getting buses was simple too.I would use this hotel on any further visits to the wonderful city of Rome and will reccommend it to family and friends. if you are coming before April 29th- ask Simona about the Steve McCurry photography exhibition and make an effort to go and see it NOT TO BE MISSED.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“perfect”", "Author": "george d", "ReviewID": "UR124713360", "Content": "- Very ''warm'' hotel with the best crew! Everyone who was working for this hotel was kind and polite . The receptionists were always helpfull . The room was perfect and extremely clean and the bathroom was very big and always warm (it also had tv) . P.S. the breakfast was awesome .. it had everything .. - It has no restaurant .", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chelmsford", "Title": "“A wonderful find”", "Author": "Giovanna H", "ReviewID": "UR124585680", "Content": "It is a lovely hotel, very close to Termini, so travelling around Rome is very easy and cheap; the staff is very friendly and nothing is too much trouble. The rooms are not huge but good value for a capital city given its location, very clean and well equiped. Some good 'local' restaurants in the area, I would certainly recommend this to any of my friends staying in Rome.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "boston", "Title": "“A wonderful hotel and a unique and lovely experience”", "Author": "easytrav2010", "ReviewID": "UR122771225", "Content": "Recently spent two nights at Hotel Britannia in Rome. Our room was lovely (not huge but charming and preferable to a large unattractive room), the location is fabulous, and the bath/shower was the best we found in Italy - and it included a rubber ducky. The staff is helpful and friendly, the hotel is clean and very well-maintained, and I would highly recommend it.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Katerini, Greece", "Title": "“Great hotel”", "Author": "Rose M", "ReviewID": "UR122069559", "Content": "A small, beautiful hotel with good service. Its location is very good as it is close to the metro, and is in walking distance to many important sites.", "Date": "December 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tallinn, Estonia", "Title": "“Great hotel :)))))”", "Author": "Julia L", "ReviewID": "UR121931963", "Content": "The hotel staff (a special receptionist MARIO and hospitality service manager Simona) were just AMAZING, helpful, friendly and very nice rooms!!! Breakfast was tasty and wide assortiment. Julia and Leif ......", "Date": "December 20, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Toulouse, France", "Title": "“A super hotel”", "Author": "Samuel382", "ReviewID": "UR121874780", "Content": "A very reasonably priced, four star hotel 15 minutes' walk from the historic centre of Rome. The staff are welcoming and helpful and the attention to detail, both in the communal areas and in the rooms, is impressive. The buffet breakfast is another strong point. In short, this is a hotel which wants to make its guests happy - not something one can always say!", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Perth, Western Australia, Australia", "Title": "“Very comfortable stay :)”", "Author": "Shannon H", "ReviewID": "UR121278253", "Content": "The hotel staff were just lovely and very welcoming and the rooms were very nice! The bathroom had a solar lamp in it, which was cool :) Breakfast was delicious every morning (very nice pastries). Only complaint (and it didn't even bother us that much) was that there was only 3 english channels on the TV, with 2 of them being news and one being movies (and only if the orginal move was in English!), and no choice for anything but the tv channels. But like I said, it didn't bother us that much as we were mostly exploring Rome :)", "Date": "December 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Heraklion, Greece", "Title": "“Perfect staff, they run the hotel in perfection..”", "Author": "zuiveld", "ReviewID": "UR120777317", "Content": "As you enter the hotel you receive a warm welcome by Simona who is polite, beautiful and very knowledgeable and makes you feel home immediately! All the staff is.. better than perfect!  As the hotel name suggests the decoration is very British, the rooms are small but they have everything, repeat *everything* you might want! Good breakfast with very friendly service. Mario also deserves a Particular ment.. If you run into any kind of trouble he is the man to contact!", "Date": "November 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Columbus, Georgia", "Title": "“Cozy hotel in Rome LarPaws”", "Author": "Robert C", "ReviewID": "UR120138805", "Content": "Hotel Britannia is centerally located in Rome and very clean. Very good breakfast in the morning...wide variety. Carmen was wonderful. Mario was very accomodating and worked with us on transportation needs. These two people made the experience such that we will go back to this hotel on our next trip to Rome.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "india", "Title": "“Small hotel at a convinient location”", "Author": "sandeep70", "ReviewID": "UR120001564", "Content": "The hotel was good.it was close to the metro stations as well as central to various sightseeing locations. We had a non-smoking room but the room smelled. i brought it to the notice of the manager but he said that perhaps someone has smoked in the room before. they could not change the room for me which wasn't really helpful. other than that the rooms were good, the street peaceful and the decor good.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Sheila C”", "Author": "Sheila C", "ReviewID": "UR119676133", "Content": "Thoroughly enjoyed our stay of four nights. Hotel is so convenient for the Termini station, still in walking distance of all the main sights in Rome, but is situated in a quieter side street. The hotel is very comfortable and the breakfasts are very good. The Manager and staff are very friendly and all spoke English. Mario, at reception, was extremely helpful and sorted out trips and timings for us. We would certainly stay there again.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dorchester, United Kingdom", "Title": "“Small hotel next to the English Church”", "Author": "William M", "ReviewID": "UR119573624", "Content": "Very good service at this small hotel within walking distance of the main train station. Concierge was unusually good in recommending places to visit and eat.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“Almost ticked all boxes!”", "Author": "JChua", "ReviewID": "UR119541943", "Content": "Having been to Rome more than 6 times, and staying at a B & B, various 4 and 5 star hotels, this 4 star hotel near the Termini had ticked almost all boxes for us. I usually would avoid staying around the train station area, but wanting to join a tour of the Tivoli & Hadrian's Villa the next day, prompted me to stay near the Termini. Upon a short 38 minutes train ride from Orte, we simply stroll in front of the Termini station, turning on the 3rd left turn, ie on Via Viminale. Then, its walking straight on, turning on our 4th right, ie Via Napoli. The charming boutique Hotel Britannia is on our right. Having reserved the roof top Junior suite, room 403, purportedly the largest room in the Hotel, we were offered cookies, tea and drinks as complimentary from the charming, Carmen. As it was 9am, our suite wasn't ready, so off we go to shop for handicrafts. Taxi ranks are nearby on the Piazza della Republicca or check if they are queueing for customers at the nearby Hotel Quirinale (esp. after siesta, at around 3-4pm). Fortunately, we did our shopping on a Friday as the next day, Rome was paralyzed by strikes - roads were closed and there were lots of policemen standing guard. Back to our suite, on first look, I was a tad disappointed by its size as online pictures had made it look bigger. However, once in it for sometime, you will realize that it is indeed quite spacious and very comfortable. The icing on the cake has to be its private terrace (with furniture) as well as a fully marble bathroom with jacuzzi tub. Even in mid October, there were two air-con units in the suite, both functioning quite well! Everything in the suite worked - bed was comfy but its left side (facing the terrace) is a little sagged, not too bad though; lots of storage space; medium sized flat screen TV with English channels; ironing board (iron must be requested from Reception and we didn't bother); ironing press; water boiler with free tea and coffee bags; safe; free Wifi near the door (great as we have our Ipad with us); free Wine from our package; fruits in the corridor; turn down service with next day's weather forecast etc. And what amazes me was, the breakfast next morning. Served in a frescoed area as well as the charming English bar area, food was both varied and delicious! You not only get scrambled eggs, bacon, lots of melon and pineapple, you also get the rarely seen Italian ommelete and fresh mushrooms - YUMMY! The 3 staff that we had encountered was all genuinely helpful and nice, Carmen, Maddalena and Enrico. Even the housekeeping and an old gentleman who helps with our luggage were all super friendly Though there was slight renovation works at an ancient palazzo next door (October, 2011) we were not bothered by noise as the suite was set back a little from the front and onto the side of the Hotel's small parking lot. Needless to say, we slept blissfully well during our two nights there. Two small glitches here - the interior sound proofing between rooms and its corridors leaves much to be desired! Parents, if you are travelling with your kids, please ask them not to sing at 10.30pm! Another would be an Italian thingy - pillows are hopelessly flat! Always have to add one or two layers of bath towels underneath it. Overall, if not for its location further away from what Rome has to offer, this charming Hotel actually would be our frequent place to stay in Rome. But fret not, as a walk to the Spanish steps via a short cut is only about 15-20 minutes, or simply 6.50 euros by cab. Enjoy this charming and good value Boutique hotel near the Termini in Rome. It is indeed a solid 4 stars, no doubt about it, but do book at least a Superior room here as they might come with small terraces, eg room 402. Taxi transfer to the airport in a large van like vehicle was 50 euros. Arranged through the Hotel's Signore Enrico, it was both on time and efficient. Cheers!", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Excellent value for money”", "Author": "Muffinyvonne", "ReviewID": "UR119537902", "Content": "I booked Hotel Britannia based on the reviews in Tripadvisor and it was a wonderful choice. The hotel is within walking distance from most of the major attraction, Roman Forum, Colosseum, the Pantheon. It is located just off the main road in a quite alley which was surprisingly quite during night time. The hotel staff were helpful and friendly. We arrived early in the morning and had to drop off our luggage at the hotel first. We were offered a fresh glass of juice and some very strong italian coffee. Although the lobby is a bit small for the 6 of us to open our luggage and change gears for our city tour, the staff was very accommodating and had arranged to store our luggage safely before our rooms were ready. Francesca, of the reservation department is friendly and professional. She offered tips for our city tour although we had done most of the research. It was still genuinely appreciated as it could be a problem in Italy when most of the population still don't speak English. Wifi is a bit of challenge because each log-in password provided can be used by one machine (but we later found out it is quite common in Europe), however, the hotel had no issue providing more log-in to us. I will definitely recommend the hotel again and will also stay there again in future.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "new york", "Title": "“small and smokey”", "Author": "doctorj6", "ReviewID": "UR119482615", "Content": "My wife and I just returned from Rome and had booked 4 nights at the Britannia. The hotel has some steps down to reception not handicapped friendly. The elevator is the smallest I have ever seen anbd in the morning it is very hard to get down from the room to the breakfast area. The real problem was the smoke. Thay claim to have no smoking rooms but this is not true. The no smoking rooms have ashtrays and signs askong that you not smoke in bed. The halls reeked of smoke and the rooms smelled as well. We were told that the ashtrays were for paper waste. Really? They think we are really stupid to believe that. This is a 4 star hotel but I think it is on a scale of 10. The rooms are so small we could not open our 2 suitcases. This is a place to avoid especially considering the number of hotels in the immediate area that are superior", "Date": "October 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Dallas, Texas", "Title": "“Not worth the money”", "Author": "DESHS", "ReviewID": "UR119288316", "Content": "The hotel list may services and gimmes , however they are inconsistently provided. Turn down 2 out of 5 mights, New (computer print out) 2 out of 5 nights. As other travelers have noted, their breakfast offering was the best we had on our trip. The beds where board like hard and where only fully made the day we arrived , they removed the spread and throw pillows evening one never to return, Rooms where about 8 x 10, bathroom so small only one person could be in it at a time Over all not worth the money", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hillsborough, New Jersey", "Title": "“Great staff”", "Author": "TobyK123", "ReviewID": "UR119255229", "Content": "We stayed at the Britannia in September, 2011. The staff was excellent. Very polite, friendly and helpful. None of us knew any Italian. The rooms were small, but comfortable. We had verandas with a table and chairs. The TV had BBC and CNN. Location is excellent. Breakfast was excellent and the food staff were extremely attentive.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oakville, Canada", "Title": "“Hotel Britannia,Rome”", "Author": "Joyce M", "ReviewID": "UR119172358", "Content": "This hotel is located within a good walking distance of ruins,collision,monuments,and some shopping. Rooms are nicely decorated, clean,and comfortable. Breakfast was very good and fresh fruit is available on each floor. Good value. Helpful staff.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "HK", "Title": "“Nice Hotel”", "Author": "Leung B", "ReviewID": "UR119100933", "Content": "The staff are very friendly, helpful and warm. The breakfast are very good. The room are not big but have everything we need.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Tiny room, nice people, good location, hidden costs”", "Author": "Maryam M", "ReviewID": "UR119000388", "Content": "The staff were very friendly, and the breakfast was good. The location was also quite central. Our room was quiet but had no view and was tiny. We had to put our suitcases under the sink the bathroom because in the bedroom, there was no room for them. The thing about queen beds in Italy is that they are usually two small beds pushed together. Our beds and pillows were not comfortable, unfortunately. The room was clean, however. And Internet was I think one euro (or included in the room), which is good. We asked the front desk if they could make printouts for us, and they said yes, but they did not mention that we would have to pay for each page, and when we checked out, we had to pay a 20-euro bill for the printouts. Not quite the service we were hoping for. Also it was super expensive for such a tiny room.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris, Ontario, Canada", "Title": "“Felt like Home...”", "Author": "Frank C", "ReviewID": "UR118909866", "Content": "After a 8 hour flight from Canada, Mario, the concierge, made us feel very welcome upon our arrival offering us coffee, juice etc. He was very helpful in providing us with a map of the area as wll as assisting us with local laundry services, restaurants and arranging for airport shuttle service to and from the airport. When we left for a week to another location, we made arrangements to return here and Mario again greeted us warmly. We stayed here for a week in September/2011 and look forward to conquering Rome! Thanks again Mario for all your help and we will see you soon again! Ciao from Frank and Tracy!", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Encino, CA", "Title": "“Beautiful location! Great Service!”", "Author": "Manny M", "ReviewID": "UR118497676", "Content": "My wife and I stayed here for 5 nights late August 2011. We arrived early so they expedited our room cleaning and got it ready way before they needed to. Because of the tripadvisor reviews I requested the largest room on the top floor....which I highly recommend! It was on the top floor, with a large bedroom, whirlpool tub and a great wrap-around terrace (with small outdoor eating area)...exquisite. My wife brought candles and lit up the outdoor area where hung out and looked down on the quiet street below. The breakfast was fabulous! Hot scrambled eggs, ham, fresh deli meats, baguettes, sausage, juices, breads, cereals, muffins. We would graze for about an hour and not be hungry till late afternoon. Saved us some cash and kept us satisfied for sure. Everyone was helpful, especially concierge. She gave us suggestions of sites to see, and was quite personable (The Italian way!)....Within five minutes of arriving she was showing us pictures of her kids! The whirlpool was great, worked well, a bit loud, but perfect. All the sites were within walking distance. It was hot when we went so we avoided the midday stroll, but were able to see Spanish Steps, Trevi Fountain and others within a 15 minute walk in different directions. We also took a day trip up to Florence from Station Termini, which was only about a 5 min walk away from us.", "Date": "September 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Just okay”", "Author": "xvi0letx", "ReviewID": "UR117953225", "Content": "We stayed at this hotel in August, 2011 for three nights. We are a couple in our early 30s from North America. Overall, the room was tiny but the stay was comfortable. I think there are a range of room sizes in the hotel and so I am sure experiences will vary. Location: Was very close to Termini station and to the metro, however if you are looking for a hotel \"in the heart of rome\" this would not be your choice. You had to take transit/have a long walk if you wanted to get to any of the major sites. It was not romantic, quaint or charming, It was just a comfortable place to sleep and eat breakfast. Food: Breakfast was comprehensive and good. Hot and cold choices. WiFi: The hotel has free wifi available, however neither my husband and I were able to access the networks on our smart phones. Service: We don't have any comments about the service, it was adequate. Nothing remarkable. Simply based on the location, I don't think I would stay here again if I return to Rome.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "England", "Title": "“Loved this hotel, no buts!”", "Author": "Moy62", "ReviewID": "UR117768308", "Content": "Good location, lovely room, very helpful staff, especially Maddelena on the reception, refreshments on arrival, even though we were very early we were able to check in and use our room, comfortable bed, everything clean, no noise,complimentary half bottle of wine, facilities to make your own hot drinks in the room, no fee for parking our car, what more can I say! Perfect! (Loved the fish tank and the rubber duck!)", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Loved the Hotel”", "Author": "LOveditaly9090", "ReviewID": "UR117251696", "Content": "We had a great time. The staff was very nice the room was clean and we liked the breakfast. And great Air conditioning. We stayed in room 404 for two nights.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "sheppey kent", "Title": "“Fantastic hotel”", "Author": "grasue", "ReviewID": "UR116960157", "Content": "This lovely little gem that is in the heart of Rome. Close to most of the attractions some about a 10 to 15 min walk. The staff are friendly and ever so helpful, good advice on where to go and where to eat. Our room had just been renovated and was beautifuly decorated and clean. The room had kettle for tea and coffee which is unusual in European hotels. Breakfast had lots of choice from fruits and yogurts, cold meats,cheese to cooked breakfast good coffee. The whole hotel decor throughout was rich and lavish for such a small hotel. This ideal for a trip to Rome would stay again without a doubt.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“Enjoyable and Firendly Hotel”", "Author": "Travelalot2000", "ReviewID": "UR116407418", "Content": "We spent 3 nights at the Hotel Britannia as the last stop on a two month trip to Europe. It was a very pleasant way to end the trip. We booked it sometime before our visit and we wondered if it would live up to the reviews. It did. It is a really pleasant hotel and reasonably priced (for Rome). The hotel is located just off the Via Nazionale and is a relatively easy walk to the main tourist attractions: The Forum and the Colosseum, the Spanish Steps, Trevi Fountain and the Piazza Navona. The main station is close by. The rooms are relatively small but well designed and the bathroom was good. The beds are very comfortable and we were lucky enough to get a balcony with a table and chairs – perfect on a warm summer night. The hotel serves a very good breakfast with some hot dishes as well as the traditional continental breakfast. The staff were helpful. There is limited parking but it is free if you book this ahead. There are some good restaurants nearby but if you like people watching settle in to one of the restaurants in Piazza Navona, have a nice meal and bottle of wine and enjoy the scene. Can recommend the hotel and we will use it again next time in Rome.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Hong Kong", "Title": "“Nice small hotel with good staff (most of them) !”", "Author": "Lolofans", "ReviewID": "UR116329274", "Content": "Britannia is a nice small hotel and offers relatively good value for money (given that all hotels in Rome are expensive anyway). The hotel is located in a quiet street and the main street (Nationale) is just round the corner. It is in the middle of everything - but also mean it is close to nothing - all tour sites are at least 15 mins away on foot. One bad thing - restaurants recommended by one of the front desk staff are real bad !! Share your review:", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Canton, Ohio", "Title": "“Fantastic in every respect.”", "Author": "Paulettte", "ReviewID": "UR115905196", "Content": "We stayed 3 nights in this excellent hotel - lovely room, great breakfasts, super location - short walk from teh train station, close to all the sites. Best of all was ur concierge, Mario. He arranged everything to perfection, including placing a phone call for me and translating my conversation to my Italian relatives - top notch service makes all the difference!", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great Location, Cute and Quaint Hotel”", "Author": "torontoguy2222", "ReviewID": "UR115610793", "Content": "My partner and I stayed here for 3 nights before a Med. cruise. At the end of our cruise we also stayed 1 night at a different hotel, so this review is based on a comparison between both. Without a doubt Britannia was the better of the two. Both were supposedly 4* hotels, but Britannia felt more like a 3.5* one rather than a 2* one (like the other hotel did). The room we had was small, but the bed was big, there was closet space to hang your shirts/jackets, and washroom was decently sized with more counter space than we expected. The staff were always friendly and efficient, and those at the front desk were able to speak English very well. The hotel is centrally located about a 10m walk west of Termini station, which makes it closer to the main tourist sites to the west of the downtown. One of the highlights of this hotel was its breakfast: It put any breakfast I've had in a North American hotel to shame. The breakfast was more of a brunch than anything. You had the usual toast, coffee/espresso, eggs, bacon, but you also had some amazing fresh fruit, tonnes of pastries, cookies and cakes, prosciutto, cheeses, etc., even some sort of rice and mushroom dish which I didn't try. The dining room looked rather fancy and neat as well for such a small hotel. The waiters were always quick too. Overall, this hotel was excellent. I wouldn't hesitate to stay here again. If you're looking for a solid 3* hotel for a reasonable price in central Rome, this is the perfect place. Grazie tante!", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Destin, Florida", "Title": "“We loved it and we will be back”", "Author": "ccbinfla", "ReviewID": "UR115395348", "Content": "Not only was the hotel absolutely lovely, but the staff, (namely Mario and Jean Franco). They took such good care of us, from helping us with luggage, dinner plans, sites to see. Everything we needed they were right there with a smile. They really made our trip special and we have the best memories because of them.....The breakfast was included and it was wonderful. It always had fresh fruit and a wide selection of choices of food.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Modena, Italy", "Title": "“Unique hotel with many peculiarities in room”", "Author": "squizz20", "ReviewID": "UR114993586", "Content": "I appreciated this hotel not just for its central location, but I remember it after many other hotels because of its specially decorated rooms. Apart from an old fashioned basis, there were many peculiarities in the room. There was a very simple fish tank with little fish in it. There was a \"bath duck\", although there was only a shower. There was a seventies style infrared lamp in the bathroom to \"get a tan\". There was fruit in the hall, which was great. There were many many (fake plants) around the hotel. All in all there were many things to discover, the owner seems to have an eye for detail (not necessarily for style, but that was fine with me). Very friendly staff willing to explain more about the hotel. I really enjoyed my stay here and will not forget it.", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Ipswich, United Kingdom", "Title": "“Pleasant staff and hotel does the job”", "Author": "mt69", "ReviewID": "UR114855494", "Content": "Very pleasant staff went out of their way to be helpful and for the money you probably can't expect much more in Rome, particularly in such a convenient area. The decor looks somewhat dated and the room seemed a tad dingy - if enlivened by the presence of a tank full of small fish. The big bed was comfortable and we got a good night's sleep. Breakfast was included and acceptable.", "Date": "June 29, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Vancouver, Washington", "Title": "“Small room but very nice.”", "Author": "1Rubicon1", "ReviewID": "UR114791795", "Content": "Stayed at hotel for 2 nights prior to Med. Cruise. The hotel was very nice. Staff friendly and helpful. The room was a little small, but I believe most in Rome are small. The breakfast was very good. Close to everything. All in all, I would definitely stay here again!", "Date": "June 27, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Duisburg, Germany", "Title": "“4 star”", "Author": "hgaur", "ReviewID": "UR114730362", "Content": "The hotel is centrally located, close to Termini, the Metro and the bus lines. We were offered great advice on where to eat and what places to visit during our short stay in Rome.The premises are well taken care of and carefully planned. The breakfast in the morning was also nice. I will surely recommend this hotel to anyone who wishes to visit Rome.", "Date": "June 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Middlebury, Vermont", "Title": "“Realistic expectations make for a great travel experience.\"”", "Author": "Legnan0", "ReviewID": "UR112156971", "Content": "We chose the Britannia because of its proximity to the Opera House. It quickly proved itself agreeable on many other counts: a friendly, helpful staff, firm mattress, quiet side-street location, generous breakfast choices, large bathroom. The room, as advertised, was comfortable if a bit small; but we weren't in Rome to hang out in the room. We stayed six nights and enjoyed every one of them.", "Date": "June 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“A Small, Delightful Intimate Hotel”", "Author": "Willowoodltd", "ReviewID": "UR110340014", "Content": "We have just returned from staying in this delightful hotel. The staff were very friendly especially Mario on reception. Our room was very nice, it was clean & well presented. The Breakfast was wonderful, something for everyone. The location was not far from the main station but not too close. The hotel is tucked down a nice road off a very busy main road with lots of shops, easy for getting buses over to the Vatican. We were able to walk from the hotel to a lot of the main attractions.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Great location”", "Author": "Sabbycat12", "ReviewID": "UR110289761", "Content": "We stayed at this hotel four 5 nights on our recent trip to Rome. We chose it because of the great location, the fact it was rated four stars, and it was not too crazy expensive. (Approx. 200 euro a night). We arrived from a cruise ship, so we were there at 11am. To our astonishment, we were given a room right away. (We figured we would have to just leave our bags and come back later.) The front desk staff was efficient and polite. They have a good command of the English language. The room was quite large for Rome. The bathroom had a bathtub! The tub was quite narrow, but I am a small person, 5 foot 2 inches and only 120 lbs, so I fit fine. One tip for a shower here is to leave the curtain half way open otherwise it will keep flying back on you! Hot water was NEVER an issue here. (We have had issues in the past while in Italy, so this was good). The room only has approx. 7 hangers, not much for two people. You may be able to get more, but I never asked. The fish tank in the bedroom is a great feature! My biggest problem with this hotel, and the only reason I did not give it a higher overall rating was the bed and pillows; mainly the pillows really. The bed was hard, and if your partner moves, you will feel it. The pillows are WORTHLESS. I ended up with a stiff neck on the third night that never went away until I got home and to my own pillow and heating pad. (And by stiff, I mean stiff.) It is important to know that this hotel is across the street from an Irish pub. The pub while a good place to eat and drink, especially at lunch when their prices are competitive, gets VERY noisy some nights. We had to close our window several nights. With that said, the hotel windows are very good at keeping out the sound. The breakfast is okay. The eggs were runny, and the breakfast sausage is a wiener! The bacon is good, but salty. The mushrooms and rice at breakfast is weird, but quite tasty!!! The croissants were yummy. The fresh fruit is very good. I loved the coffee, it was very strong. They serve it with warm milk! Overall, I would recommend this hotel, but I would give the warning about the pillow - the biggest issue.", "Date": "May 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nutley, New Jersey", "Title": "“Delivered as promised”", "Author": "SEAPOINTER", "ReviewID": "UR109937455", "Content": "As Roman hotels go, this one provides a bit more than most in its price category. Service is friendly, rooms are adequate by US standards but large by those in Rome. Typical room gives you a queen bed, chair, desk, closet with shelves, and good sized bathroom. Free wireless internet service is available. Breakfast is excellent with usual pastries, juices, bread and fruit but also hot selections (scrambled eggs, bacon and hot cereal). Tip: ask your waiter for cappuccino instead of the standard coffee.", "Date": "May 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Shrivenham", "Title": "“A hidden gem”", "Author": "JUDIShrivenham", "ReviewID": "UR108851413", "Content": "We have just returned from a five night break at the Britannia hotel Rome. Without any hesitation we would recommend this hotel. We had booked using the internet, but prior to making a reservation we asked pertient questions which were answered via email promptly. The hotel arranged a transfer from the airport which was friendly and efficient. On arrival , we were welcomed by Mario one of the receptionists. We were given liquid refreshments and biscuits whilst our luggage was delivered to our rooms. The rooms are adequate but have to admit the bathroom was small. The whole room is cleverly lined with mirrors ( these are scarey first thing in the morning, and we are on a diet now!! The hotel only offers Band B but the breakfasts are excellent, suiting all nationalities and plenty of it. It ranges from cold meats and cheeses, fresh fruit salad to hot choices. The location is brilliant -once we had our bearings we could walk to most of the popular attractions. However we did use the hop on hop off bus and the metro. There are local eating places very close and a supermarket 50 yds away. Mario is a mine of information and speaks perfect English.He could answer all of our questions and requests and will also arrange tours for you. WE were fortunate to enjoy to enjoy clear blue skies and sunshine for our visit. Three top tips; Rome is no place for your Jimmy Choos!!!! Most of the roads are cobbled and very uneven, so pack comfortable shoes. If you have time take the local transport to the Tivoli Gardens. We escaped the heat of the city and travelled approx an hour and a half into the countryside and up into the mountains. It was breathtaking,with endless waterfalls and fountains, as well as the views back towards Rome.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“A small great hotel in the perfect location”", "Author": "Fillone", "ReviewID": "UR101969747", "Content": "Hotel Britannia is a very small hotel located in the heart of Rome: the Colosseum, Piazza Venezia, the Fora and many other attractions are close by, 10 minutes on feet. The Rooms are medium sized, but very well adorned: big bathroom (tv in it) and safe are in the rooms. The staff were extremely kind to us. Interesting, they have a small parking lot that you can have for 10 euros a day (about 14 dollars, really good!). Overall, we had a great stay.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "london", "Title": "“Charming , cosy, conveniant location on a quiet road, friendly staff”", "Author": "dudders86", "ReviewID": "UR100158752", "Content": "I stayed here with my boyfriend for a 4 night trip to Rome. We booked a double superior room and requested a balcony and jacuzzi room. Our room was cosy, not massively spacious, but very happy with it. The balcony was actually a patio area with two chairs and a table. When we arrived we were greeted with a welcome coffee/iced tea. The staff are friendly and attentive. The breakfast was fulfilling offering almost everything - eggs, bacon, cereals, fruit salads, toast, tomatoes, coissants. The location is walking distance from the colloseium (about 15 min walk) and the Spanish Steps. Because this is a converted old mansion, it's not a hustling hotel, so the bar is very quiet (it could do with a bit of back ground music). but we got everything we wanted out of the hotel. The hotel was extremely clean. Everytime we left the hotel (and left our key with the receptionist) our rooms would be tidied and the bed made up, whatever time of day. That was a great extra touch. The bed we had was actually two singles pushed together to make 1 double, but that was the only down side. Our room also had a cute little fish in a fish bowl! I'd definitely recommend this hotel. The hotel has lots of character and has a very cosy feel about it.", "Date": "March 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "La Hulpe, Belgium", "Title": "“Choose this hotel if you value quality of service over the quality of their rooms”", "Author": "Ike_fedas", "ReviewID": "UR98041532", "Content": "This is a strange hotel. It is a four star hotel with very good service, friendly staff, an excellent breakfast e.g. Fresh fruit. The rooms are minute, we asked for their biggest room (3 persons) and it really felt crowded. The bathroom is so small that when you sit on tge toilet you have your right leg under the washbasin (apologies for the detail but it gives you a good reference of how small it is). The rooms also need refurbushing, e.g. A very old carpet. The rooms do look like in an old London hotel. By the way we had A fishbowl in our room (nice) but also ants (not so nice). overall it seems that the hotel is trying hard but spending its budget where it doesn't count e.g. They have two cleaning lady rounds, one to open your bed. For us the price ranged from EUR 170 to EUR 200 depending on the day. From my point of view, clearly too expensive for the quality. The prroof we moved to Hotel Canada at EUR 140 (3 stars) but so much better.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Old Bar", "Title": "“Great location, great service”", "Author": "GeoffandPamOldBar", "ReviewID": "UR90759599", "Content": "We stayed at this hotel twice: at the start of our visit to Italy and again before we flew home. It was great on both occasions. Walking distance from termini and a comfortable walk from many sights and attractions. Rooms smallish (naturally) but comfortable and clean. The front desk was always very helpful and the breakfasts were superb. Even an internet cafe across the street. Could not have asked for a better place to stay in Rome.", "Date": "December 27, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Matosinhos, Portugal", "Title": "“Great Hotel”", "Author": "rpribeiro", "ReviewID": "UR90581303", "Content": "Very good hotel. Comfortable, clean and cosy rooms Excelent service. Very nice staff", "Date": "December 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "DC", "Title": "“DEFINITELY NOT 4-STAR!!”", "Author": "ssmosley", "ReviewID": "UR88761688", "Content": "We booked this hotel based on their photos and Tripadvisor reviews. But arriving there from Paris, we were surprised to find a totally different Hotel Britannia than illustrated or advertised! This is a very old and rather dingy hotel with the tiniest rooms I've ever seen (our triple-bed room measures merely 15x15feet or roughly 5.5x5.5 meters); the bathroom was not more than 6x6 feet and its door frame was rotting; the paint on the heater was peeling off and rusted; the elevator measured about 3x4 feet and was so small that the three of us could barely fit in it. The furnishings in the room were very dated (old) and looked more like the furnishing from a very low-class hotel; the carpeting was worn out and faded. We were told we had free Satellite TV in the room, but our TV (a very old thing the size of a 12x12 inch computer monitor) did not have more than a French news channel, a commercials-laden RTL station in German (luckily I understand German but was sick of watching commercials and infomercials all day long). I asked for help and the staff member who came to our room couldn't find anything more than a BBC station, the rest was PAY TV. etc... The staff was at all times very polite and helpful. From the Breakfast servers (good breakfast buffet) to front desk and the porters, everyone was very nice and pleasant. The only exception was the day of departure. Upon arrival, we were asked if we'd pay with credit card or with cash in exchange for a 10% discount, and we said we'd probably pay cash, the receptionist told us it really didn't matter that much to nail it down. On the day of departure, we did not have enough cash and I offered to pay a part in cash and the balance with a credit card. The receptionist, Cesare, refused and was quite upset and kept repeating that we had promised to pay in cash! He made no effort to conceal his disdain and anger over that issue. Britannia is situated in a good area with easy access to Termini train station and many of the attractions, but I would not give this hotel any more than a 2-star rating, particularly after finding other 4-star hotels nearby, such as the IQ hotel, Stendhal Hotel etc that were truly 4-star hotels at a lower nightly rate.", "Date": "December 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kent", "Title": "“Great hotel and within walking distance to all attractions.”", "Author": "rebecca11767", "ReviewID": "UR87579345", "Content": "Stayed at the Hotel Britannia between15th and 17th November, travelling with my mum, sister and 18 month old son. After a short walk from the Termini, we arrived at the hotel early were grateful they checked us in as soon as possible. The hotel is clean and had a traditional Italian feel to it, the staff were friendly and helpful. It is set back on a side street so you dont hear the noise of the traffic. We stayed in a triple room 102 and my son had a cot. The room wasnt large, but completely adequate for our short break. The decor was very traditional, beds comfortable. Bathroom lovely, even had a tv and a fish bowl. Breakfast was very nice, great continential varitey to choose from and service was excellent. The hotel was in close walking distance to all the attraction it took about 15 mins to walk to the trevi fountain, but its a pleasant walk with lots to see on the way. The colloseum is spectacular and again about 15 mins walk. We took a bus to the Vactican as it is a bit further out of the town, there are buses everywhere so you dont have too wait long. The hotel was very pleasant and I would definately recommend staying there and would return. There are so many amazing sights to see in Rome, a stunning historic city I would recommend visiting.", "Date": "November 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lilburn, Georgia", "Title": "“Fantastic hotel in a fantastic city”", "Author": "jpost99", "ReviewID": "UR85480921", "Content": "We spent four days in this high quality hotel and enjoyed every minute. The rooms are clean, well appointed, and cozy. The breakfast is outstanding in the beatuful room off the lobby. The location is excellent with a short walk to the train station, restaurants, and shops of all kinds. Mario is the man behind the desk that knows what you need before you ask. His personality and knowledge of the city set the pace for the staff. He knows all the best places to eat and shop. The Hotel Britannia is an excellent choice. John & Pat Post Atlanta, Ga", "Date": "October 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oxford England", "Title": "“A very good and friendly hotel”", "Author": "BishopLatimer", "ReviewID": "UR85480186", "Content": "We stayed here for three nights on the basis of recommendations of others on Trip Advisor. The hotel is in a side street just of Via Nacionale. It is quiet (for Rome) with just a background hum of traffic noise. The two rooms we had were clean (about 14 feet by 10 feet) with cotton bed sheets and reasonable built in storage for bags and clothes. The bathrooms had a biggish bath with shower and were clean and reasonably large. Breakfast is very generous and the staff are very helpful. There is a small lounge. I would stay here again. It is convenient for the Forum, for Trevi, and for Via Veneto. A longish walk to Navona, and quite a hike to St Peters and Trastevere. But the buses to these places are cheap and easy to use and run from just along from the hotel.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "NZ", "Title": "“Never Again - Rome Must Have Something Better To Offer”", "Author": "JJnzNz", "ReviewID": "UR84692316", "Content": "Similar experience to Rup22000 dated 29th June 2010 The good first our concerige was fantastic organised parking & our bags to our room in the rain. Location was assessable to tour buses, shopping & restraunts. We did get another 10% discount if we payed cash & we had already recieved an online early booking discount. Parking on site good but only space for half dozen cars. However; $520.00EUR (2nights) - 1 x Classic double room, 1xSun lamp in the room (dusty shade in the corner), 1xFruit basket (not in the room outside the lift for everyone), 1x up grade (From what?), 2xWireless connection free, 2xwelcome drink (If you ask for it), 2xAmerican Buffet Breakfast (Average quality), 1xParking. Far too expence for the experience we recieved. The Room let itself down the safe malfunctioned & was open when we got back from the day, there was a white powder all over the floor because it caked my socks, the walls were paper thin I could hear everything including the kids next door playing & yelling for 2 days including the door bell & the light shone through the vent all night. Bathroom was average but clean but the shower a nightmare to use & maintain temp. It must of backed onto the bathroom of the room next door because you could hear everything going on next door. Breakfast atmosphere non existent it had half a spread but the quality was poor. I had a yoghurt & just about lost it because it was off I tried complaining but english was not there strengths. The bacon I think micowaved it tasted looked plastic & the mushrooms were just slimy & tasted like the day before. I noticed no one had touched it. No music in the dinning room I might as well been eating in my basement. The waiter looked really aggitated every time I got up to get something or used another utensil or plate. He just wasnt friendly. Probably the sadest breakfast experience we had. Getting to the hotel do not do in a car. To get there you have to drive up a one way street with traffic going in the opposite direction. You have to drive in the taxi/bus only lane. Miss the turn off & you lose another 20mins. The hotel is located down a lonely dark alleyway you would never guess. Overall not a experience of a lifetime. I would like to say the review that Rup22000 dated 29th June 2010 did had alot of substance & a shame we read it after we got back from our trip", "Date": "October 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Molto bene”", "Author": "cm9720", "ReviewID": "UR84647889", "Content": "We stayed at the Britannia for four nights. The reception staff are friendly and very welcoming. The location of the hotel is ideal for all the main attractions of Rome and is only a 10 minute walk from the Train Station. By the end of our stay we had also worked out the Trevi fountain was only a 15 minute walk. The breakfast is a buffet - a selection of cereals and pastries as well as scambled eggs, sausages and bacon. The bacon was nothing special but the coffee is fantastic! Rooms were very clean and a decent size - we were slightly amused to find a small goldfish in the bathroom. The bath is quite small but I actually found it was just the write size for me and I enjoyed a good soak after a day spent walking around Rome. A little expensive maybe but is anywhere in Rome cheap?", "Date": "October 24, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Denver, Colorado", "Title": "“Elegance with friendly service”", "Author": "denverretiree", "ReviewID": "UR83652855", "Content": "The hotel has a first rate location near some very good restaurants. Breakfast was lavish and service was outstanding. Worth the price. The hotel gives a 10% discount if you pay in cash or euros.", "Date": "October 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Missoula", "Title": "“Convenient, unpretentious and accommodating”", "Author": "Clo_MT", "ReviewID": "UR83044046", "Content": "Located in a good shopping area within a reasonable walking distance to the Piazza della Repubblica and the colosseum about equal distance further. This is an old mansion converted into a hotel and has the charm that goes with such a history. We found our room and bathroom clean and a nice size by European standards. Free internet. Adequate continental breakfast, good coffee. A very accommodating and helpful staff. Mario made an excellent suggestion for us for a dinner restaurant.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, Canada", "Title": "“Great Location, Excellent service!”", "Author": "EndlessSummer29", "ReviewID": "UR82857707", "Content": "My wife and I recently returned from a fabulous stay in Italy, and the Hotel Britannia was the perfect choice for our time in Rome. Believe the reviews! The location is a hop, skip and a jump from the main train station (Stazione Termini), and gives easy access to all major points of interest in the city. We didn't spend a dime on taxis, and walked, walked, walked everywhere. The Forum, Colesseum, Spanish Steps, and Pantheon were all a short trek away. For the less fit seeking more remote attractions, there was a Metro station a couple of blocks away. Internet access is provided free of charge, and there is a small room, complete with computer, just off the lounge, near the reception area. The Hotel has a couple of neat, little amenities, including a pair of live goldfish in each bathroom (we named ours Fred & Wilma in honour of the Flintstones' 50th anniversary) and rubber duckies in the bath. We celebrated a wedding anniversary during our stay, and the management sent up complimentary champagne, which was a very nice touch. The Britannia is a boutique style hotel tucked away just off the Via Nazionale. The rooms are bright and clean, with high ceilings and comfortable beds but, as with any older hotel, the bathrooms could use a little updating. The rooms are small by North American standards but, hey, it's just a place to sleep. We weren't expecting to be able to play tennis in there! My wife and I stayed in room 203 during our first week in Rome, and then again in room 102 on our final night before flying home, after spending a week in Positano. Room 102 was the better of the two, but the bathroom was not a nice. A full breakfast each morning is included. As mentioned by another review, the Britannia provided a relatively quiet stay in noisy Roma, although nothing could mask the sirens from those Italian ambulances, which seem to rule the streets in Rome. Our new best friend, Mario, who worked the early evenings at the desk, was terrific when it came to steering us in the right direction. We were looking for a quick dinner one evening, and he directed us to a little hole in the wall at the end of Via Napoli, minutes from the hotel. It didn't look like much at first, but it was great!! Mario always had a smile, and a funny story, whenever we stopped to chat. Both he, Maddelena the day receptionist, and Emilio and Lee John in the breakfast room, made our stay warm and enjoyable. Don't hesitate to make the Britannia your choice for a memorable stay in beautiful Rome!", "Date": "October 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Warsaw, Poland", "Title": "“nice hotel”", "Author": "meexxx", "ReviewID": "UR82829036", "Content": "We enjoyed our stay very much. The staff were friendly and very helpful. The location is excellent - in walking distance (20 minutes) to the Forum and Colosseum, 10 minutes to the train station. 5 minutes to the bus and metro stops. Nice breakfast. he welcome drink. The actual room was lovely with nice touches such as the fish bowl and plastic toy in the bathroom. The bathroom was spotless and I appreciated the private balcony The person who took me through the room was excellent. He showed me all the facilities, how everything worked etc.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“What a great hotel”", "Author": "rsowah", "ReviewID": "UR82469442", "Content": "We booked this hotel last minute while in London and we were extremely happy with our selection. The reviews from tripadvisor helped greatly. The hotel was wonderfully presented, clean and most importantly, in a city as busy as Rome, very quiet. I would recommend this hotel to anyone going to Rome.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Location, location, location .. and value and a great breakfast and...”", "Author": "Malone2", "ReviewID": "UR81946240", "Content": "From Hotel Britannia, take a walk and in ten or twenty minutes you can be at the Coliseum or at Spanish Steps in the opposite direction. And between the two are countless churches and sites that date up to 2000 years old. The hotel desk staff were always helpful. Superb Italian Pizza (wood oven baked) right on Via Nationale only a couple blocks towards the train station. Great shopping in the area (not Louis V or Gucci . Armani and that crowd - and not junk from asia). Hotel rooms were very comfortable - obviously very old but simple and clean. The breakfast was the best I had in three weeks in Italy for variety and fresh food. This hotel is not the Ritz Carlton but it is great value. Be sure to check out Basilica di Santa Maria Maggiore right around the corner. As well as the church at the end of Via Nationale - very interesting artwork. Also within a very interesting and short walk is the Santa Maria della Concezione dei Cappuccini - truly one of Romes most unique , macabre and interesting sites. Internet across the street was very well priced. Groceria within a block.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Moscow", "Title": "“Amazing weekend”", "Author": "Chuk_I_Gek", "ReviewID": "UR81478056", "Content": "It was sudden decision to go to Rome.. We choose Britannia relying recommendations on this site and have to say - its pretty much what is written here. Hotel is situated relatively far from the main tourist roads so we walked back twice, and afterwards took taxi every time we wanted to go to the hotel. Room was really small. Probably the smallest room we ever been to. However very clean and comfortable.. Breakfast was good and stuff friendly and not annoying. And indeed there were mosquitoes... We liked this hotel a lot, however will try to find something closer to the centre if not too over expensive next time in Rome", "Date": "September 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Boise, Idaho", "Title": "“Nice, clean, quiet, convenient”", "Author": "athain", "ReviewID": "UR80853710", "Content": "Enjoyed our stay. Tasty breakfast buffet. Front Desk very helpful. Junior Suite we stayed in was roomy, had decent King bed. Would definitely stay there again!", "Date": "September 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Colorado Springs, Colorado", "Title": "“Great Hotel...Awesome Location”", "Author": "StuMacAndrews", "ReviewID": "UR80203764", "Content": "When planning for our trip to Rome, my wife and I really struggled to choose a hotel. We finally chose the Hotel Britannia, based mainly on online reviews, and we were very happy with our selection. Everything about the hotel was very good, but the two best things were the hotel staff and the location. As you can see on the map, the hotel is located on Napoli just off National. National is a major and very busy (read noisy) street but Napoli is narrow and very quite. From the hotel we were easily able to walk to most of the major sites with the exception of the Vatican and the Pantheon was a bit far (but we did walk). It is also only a couple blocks from the main train/subway station so it is possible to walk to or a cheap cab ride when checking in/out. The other thing we were happiest with was the entire hotel staff. They were extremely helpful in recommending restaurants (even making reservations for us, Thanks Mario!), times and sites to visit, and answering/addressing every additional question. The all speak English, but we found them and other locals in general, to be much more responsive when we at least tried to speak Italian. On the only slightly down side, we were were a little surprised at the size of the actual room. The king size bed took up nearly all the room and the closet was a little small, but the bathroom was surprisingly large and extremely nice. The room really wasn't a huge issue, because we spent most of the time site-seeing and exploring all that Rome has to offer. Additionally, there was only one English speaking TV channel. A few more would have been nice at the end of the day. The Internet access was also included and was nice to have, but by no means was it super fast. The breakfast was also included and very nice, plus it was available until 10 a.m. which was nice on the mornings after the late nights when we had too much vino. Overall, we were very happy with our hotel choice and would stay there again without a second thought.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Solid Hotel Stay -Recommend!”", "Author": "P_G_Welsh", "ReviewID": "UR79930024", "Content": "We stayed at the Britannia after reading some other solid reviews from tripadvisor. It's location is great. It is in the hub of everything and we managed to walk everywhere from the hotel. It is also close to the Central train station..... but not too close. Rome is a city that has to be walked because around every corner is a new surprise. By North American standards the rooms are small but by European standards the room size is ample (I've stayed in smaller hotels elsewhere). Other reviewers mentioned that the TV is old and small.... but you're in Rome!!!! what are you doing watching television!? Rome is such a vibrant, buzzing city with so much happening all day and through the night. The hotel offers a good buffet breakfast. A good assortment of cold and hot options and a server to bring a fresh pot of coffee. I would highly recommend including the breakfast with your stay. You can leave the hotel with a full belly and plenty of energy to see you through to supper. The front desk is very friendly and helpful with any advice or guidance you may need. The hotel is in a charming older building. It is a 4 storey structure with a small elevator and a narrow winding staircase. The age and character of the building made the stay more interesting. The hot water was very hot, the water pressure was good and the rooms were spotless. WIFI is also available through the hotel (you need to ask front desk for username and password) Another nice touch is the fruit bowls to be found on every floor; filled with pears, apples peaches & plums. There MAY be more affordable hotels in the area (there also may not be). The Britannia is not the Hilton but it's a uniquely Roman hotel with a solid reputation. Thank you Mario for a great stay. If we return to Rome we will see you again.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“4 stars...really?”", "Author": "scintillater", "ReviewID": "UR78658203", "Content": "The hotel is in a pretty decent location, and I suppose for the price it isn't bad. But I'd rate it a 3 star hotel, not a 4 star. When we first got in, the sink was leaking profusely all over the bathroom floor. Second, the toilet is terrible. We had to use a 'special technique' just to get it to flush down two squares of toilet paper. By the way, they have those individually dispensed toilet paper squares rather than a roll. The beds are quite small as is the room, and rather hard and you only get a small flat pillow. We had a triple room so I know the selection is rather limited. Service was pretty friendly, though we did ask for ice a couple times and it never came. The best part of this hotel is the breakfast: it's a surprisingly good buffet with good selection, coffee, juices, etc. MUCH better than a continental breakfast you'd get in North America. We stayed here for our first half of our Italy trip, and we also stayed at Hotel IQ. They cost the same pretty much, and Hotel IQ is MUCH better. I'd stay there instead if you can get the rate.", "Date": "September 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "pacific palisades, CA", "Title": "“comfortable stay”", "Author": "bearwald", "ReviewID": "UR78495273", "Content": "We stayed here 3 nights in April. We called direct to the hotel and they were able to slide a 4th bed into one of the large front rooms. This makes it a very crowded room, but we travel very light and don't need a lot of floor space. The bathroom had a pair of goldfish and plenty of room. They sent a car to the airport to pick us up (70Euro) and when we got in around 10AM they stored our luggage, gave us a some orange juice and a map and off we went with the promise that our room would be ready in an hour. Sure enough, when we came back around noon, the room was ready. The hotel is comfortable, the breakfasts are wonderful and everything we needed was in walking distance. Termini is just a few short blocks away, as is a metro entrance.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Solid choice in Rome”", "Author": "santos71", "ReviewID": "UR77246253", "Content": "Hotel is a block off Via Nazionalle and gets no traffic noise from the street in the morning or during the day. THere is no bar or restaurant to disturb you at night. We had stayed three nights on arrival to Italy and two nights before the departure and had superior rooms on the third floor. Rooms ar on smaller size but that is what was expected. Bathrooms are marble, clean and really spacious . One room had a window in the bathroom which was very nice. Airconditioning could be regulated in the room and worked well. Staff was helpful and non intrusive. You can only hear your next door neighboors a little, otherwise no noise from upstairs or any other rooms. Breakfast can not be described in no other way than fantastic. Three eggs choices, good quality proscuito, nice cheese, sauteed forest mushrooms!, strawberies, variety of bread.... . Espresso great too. Really close to subway - two blocks, 3 min to take you to see Forum and museum or elsewhere. Far enough from the crowds of the Main Railroad Station. Do not get a rental car there, quite a hassle to drive around Rome - you are not even supposed to pick your luggage from the hotel as you do not have permit to drive around. take a train and get it wherever you go. If yo do not order GPS in advance they do not have any. Buses run on Via Nazionalle to get you closer to downtown if you do not feel like walking. It is 10 min walk to the big fountain and 15 to Pantheon. Many restaurants on the way or further north if you walk that direction. Taxi takes you back for less than 10 euros. A grocery store and a liquer store 100 yards down. Overall a good solid choice if you do not look for romantic neighborhood but convenience/.", "Date": "August 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Andover, United Kingdom", "Title": "“Just returned from a 4 night stay at this...”", "Author": "SteveS1971", "ReviewID": "UR76632214", "Content": "Just returned from a 4 night stay at this hotel. The location is easy to plan days out from and a not far from Termini station. The front reception stairs look impressive upon arrival and the reception staff were always helpful (Mario in particular always went out of his way to help). We upgraded from the standard room and had an impressive and relaxing balcony right at the front of the hotel, the room was clean, well appointed and presented. The only let down on the room was the bathroom and the minibar. The brass plates around the light switches in the bathroom were damaged and kept falling off, the plug was too big for the plug hole in the bath (had to hold in place until the water pressure held it there) and the sun lamp as advertised on their website was missing the bulb so could not be used despite the instructions still being in the bathroom. The minibar had seen better days, did not chill the drinks and was extremely rusty on the bottom. As other reviewers have stated the breakfast was outstanding, great food and very efficient service. Overall a great hotel let down by a couple of little niggles.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Culemborg", "Title": "“Great hotel to explore Rome”", "Author": "tfbooij", "ReviewID": "UR75955694", "Content": "Excellent hotel and professional and friendly staff. Centrally located to shops and the Roma MetreBus that will take you conveniently to all the major sites. Close to the main Roma trainstation.", "Date": "August 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Angelo, Texas", "Title": "“This hotel was beautiful and was close to main attractions, very gracious.”", "Author": "reeves65", "ReviewID": "UR75535780", "Content": "We stayed at the Hotel Britannia, July 2010 and was very impressed with the service and the breakfast. We arrived at night (9:30 pm) and there are stairs to go down in the hotel and we had to carry heavy lugggage down stairs, guess valet was gone for the day; that night the night clerk was not friendly and we thought ...hope everyone else is not this way and to our pleasure they were not; the rest of the staff was cordial, helpful and professional. Our room was fairly small and so was the bathroom, it was very nice, clean and beautiful. We obtained this reservation through Hotels.com which I like to do business with; however, our room was not like in the pictures, so when you make reservations you might ask what size room you are getting. We also traveled with another couple, their room was also small but a great bathroom with fish tank and extra dressing area...just be sure and ask. The breakfast is $12 Euros each. I would recvommend staying here and I would stary there again if we ever get to go back. Ask for Mario he is the greatest; works at the receptionist desk but help us with tours and a great place to eat just down the street. The hotel is accessible to places to eat. We actually walked from the Coliseum back to the hotel...just get their map and go.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "suffolk", "Title": "“Very good hotel for a short break in Rome”", "Author": "tydur", "ReviewID": "UR74139165", "Content": "This hotel is located in a quiet street some 600 metres from the railway station with good access to the two underground lines as well as a number of bus routes for the city centre. Whilst the bedrooms are a little on the small side, doubtless this is a common feature of hotels in the centre of Rome rather dictated by the restrictions imposed by the original design of the buildings for other purposes. We were comfortable enough and went to Rome to see the city, not to spend much time in the bedroom. The hotel is also located in an area where there are restaurants a plenty so you are spoilt for choice as to where to eat. The hotel staff were always first class in their responses to our various requests and provided clear directions as to which buses to take to go to the various attractions. If we were to visit Rome again for a couple of nights, I wouldn`t bother looking for anywhere else.", "Date": "August 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wisconsin Rapids, Wisconsin", "Title": "“Excellent Location with a Great Staff!”", "Author": "our-time-around", "ReviewID": "UR74073443", "Content": "The Britannia is within walking to distance to most major sites in Rome. Staff was friendly and helpful with information. The hotel breakfast was excellent! Although the rooms were a bit small, (who needs a big room when you are touring?) the amenities included a safe, hair dryer and refrigerator. Little touches like an aquarium and a rubber duck were fun! A very clean hotel!", "Date": "August 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Lake Charles, Louisiana", "Title": "“Stay Here When In Rome !!!!”", "Author": "maxemoto", "ReviewID": "UR73730649", "Content": "I cannot say enough about how much we enjoyed our stay at Hotel Britannia. The room we stayed was a little smaller than we would have liked and we didn't have much of a view,but it's location more than made up for that.We we're only a few steps from the Metro and Termini Station.The hotel was really in walking distance to many landmarks ( maps can be deceiving ) yet was on a quiet side street only one block off a main avenue.The staff was more than helpful ! Everyone spoke excellent English and gave us directions,exchanged Dollars for Euros at the main desk and in general we're Pleasant,Friendly and Helpful. Oh they also has a nice breakfast laid out to start the day ( make sure you get it included when booking your room ) ! Definitely stay here !", "Date": "August 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Saint Julian's, Malta", "Title": "“Nice hotel within easy walking of main station”", "Author": "MagellansTours", "ReviewID": "UR72538245", "Content": "We had a pleasant welcome and were offered a drink upon arrival. We had booked a superior room which turned out to be at the top of the hotel (#42), included a small aquarium complete with two fish and a small very bright private terrace – good for pre-dinner prosecco! The room itself was comfortable and had tea and coffee making facilities which was great. The bathroom was small but adequate. It had a Jacuzzi bath that didn’t work, a good shower and a bidet which took up too much space. Linen/towels were fresh and the room was clean. Nice to have free WiFi in the bedroom. The buffet breakfast was probably one of the best that we have ever had in a small private hotel. There was a good choice of bread, cereals, fruit and cold meats. In addition, there was an excellent cooked breakfast on offer – no dry and rubbery scrambled eggs here!", "Date": "July 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Meridian, Idaho", "Title": "“Excellent service and did I mention, excellent service!!!”", "Author": "IdahoFamily_10", "ReviewID": "UR69625012", "Content": "We stayed here on our last night in Italy (whirlwind trip began in Rome, then Sorrento, then Florence and back to Rome to fly out next day). Mario Teti greeted us with a great smile and gave us fantastic service. I asked Mario about when we should arrive at the airport the next morning so we could plan when to catch the train and he asked me if €50 is a better deal than €56 (€14 per person) and which would I choose. Instead of hiking back to the train the next morning, he arranged a private minivan for my family that picked us up in the lobby (boy, do they know how to drive in Italy - what a great ride). We had a great stay and would recommend this hotel.", "Date": "July 4, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "England", "Title": "“The location is very good, but...staff, service & room were not!”", "Author": "Janice51", "ReviewID": "UR69346405", "Content": "I recently stayed at this hotel with a friend and two family members. I had done the booking after being referred by another hotel which was full. The location was very good as it was close to train station (Termini) and within walking distance of the hop on/hop off tour bus and a few other main attractions in the city. My first disappointment was with our room and the increased cost in comparison to my two family members' room...they were given an 'upgrade' and ours was a low grade for more money...40 Euros per night more for basically the same room. The TVs which were supposedly upgrades did not work properly, nor did the internet in our room. We did not get the 'turn down service' both nights (only one night) but the other room did! When we went to the bar in the hotel lobby at 10 min. to 11 pm. no one asked if we might like anything, and when I enquired after 11 pm. they told me it was closed! Three people were on staff at the front desk and no one asked if we might like anything from the bar when we arrived, nor 'just before it was supposedly closed'. When we inquired about our room, we were told it was 'the luck of the draw'...they were fully booked and if we were to move we might get a lower grade room for the same price my family were paying for their room....Just did not seem logical let alone fair. To top it off, on check out, we were told we had a laundry bill! We did not do any laundry as we were only in Rome for two days...they did credit this, but I think they thought we were mistaken!!! Breakfast was the only other good thing about the hotel. It was very ample and the breakfast staff were very cordial....Unfortunately I will not stay here again, nor would I recommend it to any one else to stay here, unless they were guaranteed a better class of room for less money!", "Date": "July 1, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Rup22000", "Title": "“If this is a 4-star hotel, I'm really Elvis Presley”", "Author": "Rup22000", "ReviewID": "UR69137464", "Content": "My wife and I stayed at Hotel Britannia for the last night of our honeymoon. I must say that I'm disappointed after my stay. When I researched hotels, I thought I was getting a deal for a 4-star hotel for under 200 Euro a night! I figured it must be that price because it was near Termini, which is not necessarily the prime area to stay in Rome. I also thought I was staying in a place that was going to be romantic, modern, and clean. I'm likely to offend the hotel owners/staff with my comments, but this is not a 4-star hotel. I've had better accommodations at 2-star hotels in the U.S. than this place. We stayed in room 402 (the room with the Rose painting and terrace on the hotel's website). On the website, the hotel and accommodations looked sheik, modern and romantic. Upon arrival, my wife and I saw that it was nothing like the pictures. Instead, it was going to be a no-frills place to just lay a head before shipping off to the airport. We in fact went out to dinner that night and drank an excessive amount to ensure that we would just pass out once we got back to the hotel. I would not stay here again because of the reasons listed below. Furthermore, if you are a U.S. resident and on a honeymoon, I would definitely not stay here because it is not romantic, it's in a lackluster area of Rome, and there are nicer places for the same price range or less in the same area. My reasons why this is not a 4-star hotel (which in my mind would be one star below at St. Regis): -The last time the hotel was renovated had to have been in the late 1980's or early 1990's; the website shows one awesome looking room with shelves above the bed. That room must be the best room in the place because the others don't look like that. The breakfast area has the same story. -No wash cloths in the bathroom -The room was infested with ants. The ants had free reign of the bathroom (toilet, sink, tub, door), the carpet and the bed. -The safe was from 1980 and was malfunctioning. -The car service arranged through the hotel was a run down Kia minivan. We could have caught a taxi to the airport for less than 50 Euro and at least rode in a run down Mercedes. Seems like a 4-star hotel would have better managed that aspect. -The breakfast spread is pretty basic with limited selection compared to other 4-star hotels where we stayed. -The wooden head board on the bed had what appeared to be termite damage (or some other type of wood eating organism). -The mattress was hard. Honestly, the other hotel we stayed in for the first part of our trip in Rome, Hotel Madrid, which is a 3-star hotel, had nicer accommodations. It was at least clean. If I had to rate this hotel, I'd say it would be a 3-star hotel on it's best day.", "Date": "June 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "England", "Title": "“Excellent hotel, great service & good central location”", "Author": "HerculeP", "ReviewID": "UR67457711", "Content": "From the moment that we arrived we knew that we had made the right choice. Although it was only 10am we were shown straight away to our room (which was smallish but perfectly acceptable), and which was spotlessly clean. The bed was very comfortable and although the room was at the 'front' of the hotel there was absolutely no noise. A wide range of complimentary fruit was available in the hall, and we were amazed to find tea/coffee making facility in the room (rare in an Italian hotel). The air condition worked perfectly but our only slight criticism was that the hot water could have been warmer. As other reports have stated, the breakfast was very good with a very wide choice (pastries and cakes were too sweet, but it is Italy afterall). Vast choice of local restaurants providing everything from fast food to very upmarket meals, and prices were quite reasonable. The location couldn't be better, where you can stroll to all the major attaractions within 15 minutes. In addition it's less than 5 minutes from the main railway station (we used the hotel's own transfer back to the airport which was excellent for a reasonable 50euros). There is a supermarket just 50m way and another 200m in the other direction. We booked via the hotel's own website, and if you pay by cash on check-out we were also offered a generous 10% discount. Overall excellent value in a good hotel which is in a great location.", "Date": "June 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Utah", "Title": "“Fine Hotel”", "Author": "smd22", "ReviewID": "UR66982206", "Content": "We stayed at the Hotel Britannia for three nights at the end of a cruise. This is the fourth time we have stayed at this hotel. It is a very comfortable small hotel. The rooms are small but adequate in size and quiet. The beds are comfortable and the staff is very helpful. The breakfasts are outstanding. The price is reasonable for Rome. It is located near Termini Station.", "Date": "June 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Comfortable and Great location”", "Author": "zzzusa", "ReviewID": "UR66655792", "Content": "The location was wonderful and the staff were very helpful. The room was not large but quite comfortable.", "Date": "June 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "cheshire", "Title": "“Good hotel in good location”", "Author": "mike_pope40", "ReviewID": "UR65501615", "Content": "We chose this hotel for it's location, being within walking distance of the main station and still close to Rome's main tourist attractions. The rooms are average size for Roman hotels, clean and comfortable. Good breakfast, superb coffee. The only negative point is the fish bowl with a couple of forlorn guppies in in the rooms, described in the hotel brochure as tropical aquariums! The main advantage with this hotel is the Mario factor. Mario is the night manager and nothing is too much trouble for him. He's a mine of information, even knows train times by memory. We will certainly stay there again and hopefully the fish bowls will have gone.", "Date": "May 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Woodbridge, New Jersey", "Title": "“A pleasant Roman holiday.”", "Author": "Madmarz", "ReviewID": "UR65405728", "Content": "Found wonderful reviews about the hotel and chose it based on them and the location, photos, rate and staff responses to my questions. Rooms were very clean and bed was comfortable. Breakfast was more than many larger hotels and always fresh, especially the fruit. Maddalena and Mario were very helpful to any questions/needs we had. They made arrangemets for pick-up and return to airport, which went very smoothly. Also had a small breakfast packed for our very early departure. They even allowed us free use of a computer so that we were able to check-in for our flight the day before.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Templeton, California", "Title": "“Elegant yet simple, this hotel is a comfortable refuge from the busy city.”", "Author": "jmefishin", "ReviewID": "UR64928643", "Content": "From the time we got there the hotel staff at the Britannia made us feel welcome. Small but elegant the Britannia is well located to the places you want to go. They serve a nice breakfast to start your day. I would recomend Britannia to my friends and family absolutely... Jon and Stephanie", "Date": "May 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Texas-USA", "Title": "“Charming hotel, Fantastic Service and good location”", "Author": "mao70", "ReviewID": "UR64732310", "Content": "I stayed at this hotel for 3 days with my mother. The hotel entrance is a little tricky if you have problems going down stairs., but once inside the hotel there is an elevator that works well and fits 2 people and small laugage. Nevertheless, the location was good, just a few blocks from train station and half a block from bus stop, and close to shopping area and local restaurants and small cafes. The service was Fantastic. They were always helpful in giving you information (on places to go, eat and transportation) and in providing anything that we needed at any time of the day. When we arrived the room that we had reserved did not have the shower that we had asked for, so they switched us to a room that had a shower without any trouble at all. The room with the bathtub was bigger than the one with the shower. But the bathroom with the shower was bigger than the other, which was good as my mother has knee problems and that was more accessible. The rooms were very clean, very well kept. It was the nicest room we stayed in Italy in our whole trip. The decoration has features from England in the19th century. We realized that is just afew blocks from the Great Britain Embassy. THe only thing is that the temperature of the rooms is standard for all the building (you ca not change it), we found it a little hot some days (since it was November they had the heater on and they do not turn the air conditioner on during that time) so we openned the windows a few minutes and it was comfortable afterwards. We stayed in a higher floor which made the room quiet. The night shift and early morning staff were the best. Two wonderful and very polite gentleman. The breakfast was good standard italian breakfast: bread, toast, slices of meat, slices of cheese, they had eggs too, cereals, great coffee (the capuccino were a delight/ you have to ask for it though), juice, milk, and a lot of fruits, mermelades and chocolate. I would recommend this lovely hotel to any adult looking for good service, comfort and location.", "Date": "May 19, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Mississauga, Canada", "Title": "“amazing vacation”", "Author": "dargo17", "ReviewID": "UR62578311", "Content": "my husband and I stayed at britannia hotel for 8 days for a romantic trip, this hotel is absolutelly wonderful, clean, service excellent , breakfast very good and the staff was great and very helpfull. a must and we will return.", "Date": "April 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "NW London", "Title": "“Good value hotel”", "Author": "Eastlighter", "ReviewID": "UR62571404", "Content": "As a result of the April 2010 volcanic ash crisis and resultant flight cancellation we could not return to our original Rome hotel, but that hotel arranged for us to transfer to the Hotel Britannia for 2 nights. It has a good location, near Termini rail station. This hotel was less spacious than the first, but the reception staff were extremely helpful and gave free internet access to allow us to check out alternative ways to travel. They also translated the recorded messages on the Alitalia Helpline which, as time progressed, were totally in Italian (even the 'English option'!). The hotel breakfast was good, with a wide selection. Overall a hotel that provides very good value for money.", "Date": "April 27, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Hotel Britannia”", "Author": "BarbraB", "ReviewID": "UR57035408", "Content": "Our stay was awesome! The views from the rooftop bar were spectacular.", "Date": "February 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Ireland", "Title": "“Requires attention”", "Author": "Visitorsireland", "ReviewID": "UR55734651", "Content": "Booked this hotel for husbands 50th Birthday and advised hotel in advance of celebration and requested nice room!. On arrival -no mention of Birthday and given an average room - very disappointed. Plus points Reception - Curteous Breakfast - adequate with curteous staff Location - close to Via Nationale Negatives Room - Small Bathroom - Shower controller was not working and advised reception - next day only cold water - following day no control over very hot water. Ants in bathroom. Bedroom - small. Not cleaned properly as evidence of previous occupants found under bed!! and on carpet. TV - non existant only english channel CNN.", "Date": "February 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "athens greece", "Title": "“very good hotel”", "Author": "goggietheo", "ReviewID": "UR55457264", "Content": "friendly personnel good breakfast clean rooms close to attractions", "Date": "February 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "USA", "Title": "“Awesome”", "Author": "map831", "ReviewID": "UR50631578", "Content": "We stayed here 5 nighte before a cruise and all I can say is it was a Great Hotel. Our room was great, we had our own little balcony (which we did not use as much as we would have liked to - only because there is so much to see and do in Rome) . Mario was awesome. Mario at the front desk gave us suggestions for restaurants in the area and everyone of them were great. Bed was very comfortable and room was clean and spacious since we had a little living room area as well. Would go back there again and recommend it to anyone who goes to Rome. Centrally located", "Date": "December 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Hampshire, UK", "Title": "“Very nice hotel - one or two minor changes needed”", "Author": "happy_hobbit", "ReviewID": "UR49975077", "Content": "The Britannia is a nice, characterful hotel, very conveniently located near Repubblica metro station just off the Via Nazionale. (However, DON'T try to get there by Metro from Termini - you're better off walking or - probably - getting a cab, though these are expensive in Rome). We stayed for 5 nights in November and it was a perfect spot for exploring the city. The hotel is quiet, even though it's only around 100 metres from a busy main road. The Anglican church of St Pauls Within the Walls is next door, and is beautiful inside (especially the mosaics and marble pulpits), and hosts lots of classical music concerts. The rooms are not spacious, but perfectly adequate for a city break to Rome. Our 'view' was of a quiet, private side alley - OK, not overly pretty, but then you don't need a view with the whole of Rome on your doorstep. Our room was reasonably well appointed with TV (if you need one), mini-bar, tea & coffee-making facilities, a safe, a chair, a stool, bedside cabinets with a single drawer each and a moderate-sized wardrobe/closet. (There's nowhere to stow suitcases, so take a bag that'll squash pretty flat and slide it uder the bed). There's an OK bathroom with a bidet, and a small fish-tank with 3 fish in it ! The bath has a fixed (rather weak) shower and a separate spray nozzle. Beware, the taps are confusing - the red one fills the bath, the blue ones control the pressure of the 2 showers. Oh, and every bathroom has a complimentary rubber duck! There's free wireless internet - with good service - in the rooms and public areas. The lift is tiny - room for 3 people max or 1 person and 2 suitcases. The stairs are also very narrow, so if you're very large, you may have problems getting to your room! (If you're that big, you'll have problems getting to the hotel - Rome makes few allowances for anyone with mobility issues. Even getting on and off the Leonardo Express between the airport and the city with a suitcase is tricky if you're not reasonably fit and slim!) Breakfasts are excellent. Fresh fruit, a good selection of cereals, fresh walnuts and delicious prunes, a nice range of cold meats & cheeses, bakery goods, plus cooked food including crispy bacon, herby tomatoes and mushrooms, and of course very good coffee. (The only problem is the lack of spoons for cereals, etc - a small but slightly irritating oversight). There's also a bowl of fruit on the landing, so you can take an apple, orange or plum back to your room. We found the service to be very good and friendly from all the staff. They were obliging in printing our boarding passes for the return trip and giving us advice and directions. There were just a couple of things that would improve the hotel. We found the cleaning of the bathrooms somewhat haphazard - soap marks around the basin were still there when we returned after a day's sightseeing, the towels we had elected to re-use were exactly as we'd left them, not re-folded and tidied, etc. (We mentioned this to the guy on reception, and it did improve on our last day - but not much). Also, we'd rather have a shower cap in the bathroom than a rubber duck! Overall, we found the Britannia to be a very good hotel, conveniently located and with nice, attentive service. A couple of minor tweaks would improve it still further. A couple of points - if you want to vivit the Villa Borghese, book in advance. Even though the gallery was almost empty (certainly by UK standards), they wouldn't sell us tickets on the day. The 'Roma Pass' may help, but we didn't think it was worth the money. The Metro is good for the Colosseum and sort of alright for the Vatican (a long walk), but useless for (say) the Pantheon, the Castell Saint Angelo, and (if you've heard of it and can be bothered to make the trek up there), the Tempietto in Gianicolo. Check carefully when everything is open - we saw the Sistene Chapel on the Thursday, but it was (apparently) closed on the Friday, Saturday and Sunday. If you're going this time of year, don't listen to the touts selling you expensive guided tours of the Vatican The lines were non-existent, it closed at 5:30 (NOT 1:45 as advertised) and we spent 5 hours inside - not the 2.5 hours the tours offer. What's more, we found the Sistene Chapel fascinating, but you don't need an hour there. The Map Gallery was, for us, even more spectacular. So save your money, and spend €7 each on an audio guide, and another €7 on the exhausting but amazing climb up the dome of St Peter's.", "Date": "November 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "PHILADELPHIA", "Title": "“good location, clean, very nice breakfast”", "Author": "FLYERS49", "ReviewID": "UR49193832", "Content": "We stayed here on a vacation to Rome. The staff was very pleasant and accomodating. Location was very good; walkable to all sites in the city. The room was small, minimalist, clean. The bathroom was very nice and modern. Breakfast was very good - eggs, sweets, meats, good service.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "2"}, "AuthorLocation": "London", "Title": "“Nice, clean hotel . . but VERY compact”", "Author": "Nodnoltravel", "ReviewID": "UR48448608", "Content": "The Hotel Britannia is a nice clean hotel, with a central location of teh main road. The rooms are very, very compact, but if you've out most of the time as we were, then it's not a problem. The bathroom is a good size. The internet room is tiny, I'm not joking, it's the size of broom cupboard. When you open the door, it hits the chair ! ! ! Still it's free ,so no complaints. The breakfast is a good continental spread of hot and cold foods. Overall the hotel is in a good location, is clean and the staff helpful. There is a local supermarket nearby also & lots of restaurants to suit all pockets.", "Date": "November 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Broxburn, Scotland", "Title": "“Sleep easy knowing you have booked a good hotel”", "Author": "Paulandjoan", "ReviewID": "UR47757714", "Content": "First trip to Rome , travelled with wife and 20 something son and daughter and first holiday as 'family' in many years so wanted everything to be right. Love it or hate it Trip Advisor is useful in making sure you are going to get a good hotel but sometimes the reviews for same hotel are so varied that it looks like a bit of a gamble to book one. Hotel Britannia had constantly good reviews - booking was quick and easy and hotel pre trip response etc was excellent - opted for pick up at airport - well worth it , hassle free and straight to the door. Welcome was great, courtesy drink and very quick check in as a result we settled in quickly and were on the open top bus tour around 2 hrs of arriving at the airport! Rooms were good size , well equipped, comfortable and very clean and well maintained. Breakfast was superb - a well needed early energy boost for the day ahead! Hotel well located - easy walk to main sites of interest - taxi to vatican was 20 minutes and cost 10 Euros (4 people). Staff helpful and friendly - on leaving found that the Italy wide credit card authorisation system had crashed - issue was dealt with efficiently and pro-actively by Enrico at front desk. Definitely recommend this hotel.", "Date": "October 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Roswell, GA", "Title": "“A gem atop one of the 7 hills of Rome”", "Author": "PaperBoy1", "ReviewID": "UR45439343", "Content": "What a great visit. Three days in Rome staying at the Britannia before jumping on a cruise ship. The staff was very helpful. The breakfasts were outstanding. We liked the fact that everything we wanted to see was a downhill walk from the hotel. Well, the Vatican was a taxi, but easy walk to Trevi Fountain, Pantheon, Coliseum, and loads of churches and basilicas. Rooms are small but that is typical in Rome. I would highly recommend the Britannia. Surrounded by restaurants, shopping and sites.", "Date": "September 29, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Atlanta, GA", "Title": "“Great stay/Great value”", "Author": "JoyAtlanta_GA", "ReviewID": "UR42661852", "Content": "My husband and I stayed at the Hotel Britannia for three nights during our 25th wedding anniversary trip. The hotel was quiet, a great value, and the breakfasts were fabulous! The staff was friendly and helpful and I would highly recommend this hotel. Either walk or take the metro to all the sights as it is also in a great location.", "Date": "September 18, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Francisco", "Title": "“Perfect place in Roma!”", "Author": "PackRules", "ReviewID": "UR41109713", "Content": "Awesome. Front desk staff, e.g., Steffania, is super. Nice that they have a few suites so the family can be all together (hard to find in Rome). Rooms are clean, updated and cozy. Breakfast is fantastic, among best we've ever had (and it's included). 10 to 15 min cab ride to all major destinations.", "Date": "September 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Munich", "Title": "“Fntastic Hotel in Rome!”", "Author": "Lella1981", "ReviewID": "UR40606329", "Content": "The Hotel Britannia is a wonderful Hotel in Rome. It is elegant, quiet, the staff is very friendly and you can reach the center in just 5 Minutes.", "Date": "September 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Bristol", "Title": "“Fabulous location and great welcome from all staff”", "Author": "Ziggurat0", "ReviewID": "UR37071057", "Content": "We stayed here having worked out that the first hotel we had booked was too far out of the centre. Enrico was our initial point of contact and was extremely helpful & courteous. The hotel is small but charming and really well located just off the Via Nazionale - perfect for less noise but still in the centre of everything. Rooms are not large but perfectly adequate & well furnished and finished - this is a city centre hotel after all and is a converted noble residence. Wonderful buffet breakfast with a wide choice of both hot and cold dishes, cereals, juices, tea & coffee. Apart from Enrico, we were also well looked after by Francesca and Mario - these three rotate on front of house and are all helpful, charming and polite. So pleasant to be looked after by people like this in a city where there is plenty of scope to be ripped off. We all loved our stay here and will not need to look any further for other hotels when we next visit Rome - we will stay here again.", "Date": "August 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Oslo", "Title": "“Solarium in the bathroom”", "Author": "OsloArne", "ReviewID": "UR36923481", "Content": "This hotel was a bit different. Especially the bathroom. They had a little plastic duck. And solarium in the ceiling. Believe it or not. The breakfast was was very good. But I stayed in one of the cheapest rooms, and that was an unbeviable small room. Big bed, but almost no floorspace. Free wire-less internet, though.", "Date": "August 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Massachusetts", "Title": "“Excellent location with thoughtful and kind staff, esp. Mario and Enrico.”", "Author": "Delgrey", "ReviewID": "UR36394425", "Content": "This small lovely hotel is off a main street and is centrally located, making it within walking distance to all of the main attractions. If public transportation is needed that, too, is quite convenient to the hotel. The hotel has old world charm with modern amenities. Very quiet. The breakfast that is offered has quite a variety of items. Beds are comfortable and the ac is super! We had 4 in our room which was a bit tight but manageable for 1 week. The staff is very kind, thoughtful, informative, patient, and accommodating always making you feel special. Not having a restaurant on the premises can be a tad inconvenient for those late evenings when you just want to grab something quick and just eat in your room.", "Date": "August 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Illinois City, Illinois", "Title": "“Truly above and beyond”", "Author": "fphaynes", "ReviewID": "UR35233688", "Content": "We just got back from our trip to Rome. We just had to tell everyone how pleased we were with the Britannia Hotel. They were very helpful throughout our entire trip. We had lovely rooms (small by US standards) with beautiful patios outside our rooms. They also have a nice breakfast buffet that consisted of fresh fruits deli meats, chesses, yogurts, cereal, and juices. The location of this hotel was also very nice it is centrally located and only several blocks from the Republica metro stop. The Front desk was very helpful in the booking and giving of directions to the various sites in Rome. The highlight of their suggestions was a wonderful little family owed restaurant near the coliseum. My father had his birthday while we were staying at the Britannia Hotel and the sent up a nice complimentary bottle of wine for him; I thought that was a lovely gesture. The point that I really want to stress about this hotel was after we checked out. We went on a cruise and inquired to the cruise line about shuttles to take us to the airport. The cruise line wanted a ridiculous price, so we e-mailed the Britannia Hotel and they were kind enough to book and transfer for the ship for us at a much lower price.", "Date": "July 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Suburban Chicago, Illinois", "Title": "“Great location, very helpful staff, nice facilities, GREAT breakfast!”", "Author": "D0N623", "ReviewID": "UR33809843", "Content": "I researched many hotels online and settled on Britannia Hotel. We're glad we did. During my research, I emailed the staff about the hotel, the area, safety, proximity to major sites, etc. They were very, very helpful and I could not be happier. When you look at the hotel picture, our room was the one with the little balcony on the front corner of the building. While the modern room and bath were small, the balcony more than made up for it. Our only complaint was that the TV in the room was rather small! Ha! A very minor consideration since we only watched while getting ready to go out or to bed!!!! The location was great. We walked about 2 blocks to the subway and could go anywhere in a few minutes. The hotel is on a small and narrow side street just off a major shopping area. It was great area to stroll in the early evening to get gelatto! We can't say enough about the staff. Very, very helpful and accommodating. You can buy tours, bus tickets, etc from them. Breakfast was incredible.", "Date": "July 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“small rooms, loved the breakfast, helpful staff, good location”", "Author": "Lynee", "ReviewID": "UR32638865", "Content": "stayed last year (so a bit late in reviewing!) but can still remember it - so must be OK! Room on the small side (with fish tank!) but comfy bed and good bathroom (with little rubber duck!). Breakfast was great - the scrambled eggs and porcini mushrooms - yum! Staff very friendly and helpful. Lift is TINY!!! Quite funny trying to fit luggage and people...may have to wait your turn. Location good... we pretty much walked everywhere but metro is close by anyway and can grab a bus easily. Good stuff!", "Date": "June 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "New Hampshire", "Title": "“We loved it!”", "Author": "Barrypaul", "ReviewID": "UR32175558", "Content": "Great location, warm friendly staff (they let us check in early which was a major plus after flying all night). Room was small, typical from other feedback, but it was quiet and very clean. We walked to all the sights including the train station when we departed, location was a plus. Breakfast was outstanding. If your tipping the scales over 300, you might not fit in the elevator but that may be the least of your worries!", "Date": "June 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Lafayette, CA", "Title": "“Great Staff, Good Value, Amazing Buffet, Smallish Room”", "Author": "Gaetano_007", "ReviewID": "UR31984471", "Content": "Also, the location is perfect if you need to be near Termini Station. A good value at under 200 euros.", "Date": "June 9, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Leamington Spa, UK", "Title": "“Good location and very helpful staff!”", "Author": "Kenfaisey", "ReviewID": "UR29707421", "Content": "Just returned from a three night stay at the Britannia which proved a good base for exploring Rome, Plus points were good access to transport, Termini etc, convenient walking distance to many of the main attractions and friendly and helpful staff. Negatives which have all been commented on by others were the smallish size of the rooms and the cost for the facilities available. Rome is now a very expensive city and the hotel is right in the centre but nevertheless 200 Euros a night for a hotel that is no more than 3 star is a bit steep. Reception staff though were unfailingly helpful including arranging a room move for us to a higher floor with more natural light and the hotel tries hard with fish tanks in each room, plastic ducks and bamboo plants to create an individual atmosphere which mainly succeeds. We all made use of the Irish Bar on the opposite side of the road which runs a happy hour from 7-8 each evening. This reduces the price of a pint from 6 to 4.8 Euro. Handy supermarket as well at the other end of Via Napoli which has a wide range of food and drinks at reasonable prices.", "Date": "May 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "California", "Title": "“Wonderful Hotel”", "Author": "afrancisco", "ReviewID": "UR28015999", "Content": "I stayed at this hotel with my husband for 1 week in March 2009. We arrived very early on a sunday and were brought straight to an available room with no wait. The room was a perfect size for us, and the sound proof walls made it feel as if we were the only ones on the floor the whole week. The breakfast was perfect for our needs, and as we were usually the first ones to arrive we never had to wait for a seat. We filled up on breakfast and usually had a very light lunch in the afternoon. Staff was always courteous and provided us with everything we needed during our stay. If we stayed out late, they would leave mints on our pillows and a note of the weather forecast for the next day. The location of the hotel was wonderful, down via viminale are at least 7 restaurants that serve high quality dinner, a gelateria, a supermarket, and a coffee bar that served fresh pizza and pasta at all hours (even on a sunday). Before our trip we utilized google maps and could view street view pictures of the location and easily navigated the area upon arrival. Local attractions less than a few blocks away include the roman opera house (wonderful experience), national museum of rome (palazzo massimo), and the baths of diocletian. We never used a taxi or the subway during our entire trip, and utlized a hop-on hop off bus to get a tour on our way to St. Peters Square. Overall it was a wonderful week and I would stay at Hotel Britannia again.", "Date": "April 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London, UK", "Title": "“Very good value...good location.”", "Author": "RCH3", "ReviewID": "UR27848971", "Content": "Good location within walking distance of Termini. Hotel is on a quiet street near Republica. We were on the first floor facing the street, but we couldn't hear a thing at night courtesy of the double-paned windows. Quite unexpected. The hotel was very family friendly, and they had made up a special bed for our 2-year-old daughter before we arrived. There was even a little rubber ducky waiting in the bathtub--nice touch. There was also a free breakfast buffet that was quite extensive (meats, cheeses, pastries, cereals, fresh fruits, eggs, bacon, etc).", "Date": "April 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Norfolk UK", "Title": "“Like everything else in Rome, not value for money (except public transport)”", "Author": "Nev1947", "ReviewID": "UR27840294", "Content": "The best feature of this hotel is its location in a quiet side-street off Via Natzionale. Room was extremely compact (less than 4 metres square plus bathroom). No drawers, just hanging cupboards but staff pleasant. On arrival we were offered 10% off the agreed terms if we paid in cash! Nothing like a UK 4 star hotel, breakfast boringly average.", "Date": "April 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "NH", "Title": "“Great Hotel that makes you feel at home.”", "Author": "plove1948", "ReviewID": "UR27118945", "Content": "We recently returned from yet another trip to Rome this time staying at the Hotel Britannia. It is located a short walk from Termini and Via Nazionale. It is centrally located for the person that wants to use the busses, trains or walk. The people are wonderful . As you are checking in they bring you fresh juice and cookies. In each room there is a fishbowl on the desk that make you feel like you are in a home not a hotel.They also turn down your bed at night and leasve not only chocolate but a card with the weather for the next day .There is also fresh fruit on every floor for your taking. It is the little extra touch that makes this hotel a gem We had an early departure and would not be there for breakfast and they graciously told us to take some items with us for the trip. I highly recommend this hotel.", "Date": "March 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "san diego", "Title": "“Pretty and clean, personable and safe local... and big free breakfast too!”", "Author": "tumbleweedman", "ReviewID": "UR25577862", "Content": "I first heard about this hotel through Rick Steves' Italy guide book and it was right on the mark in terms of being extra welcoming to English speaking guests. Mario Teti, the receptionist, was incredibly helpful and caring... something you won't always find in Roma. Another thing you rarely find in Roma is large rooms... but this hotel has great size rooms. I loved it! I felt like I was staying with friends. I would definitely stay again and recommend to anyone. Absolutely, without a doubt. Thanx again Hotel Britannia.", "Date": "March 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Tel Aviv", "Title": "“excellent location, excellent breakfast!”", "Author": "ViviTelAviv", "ReviewID": "UR25199677", "Content": "Stayed 4 nights, enjoyed the wonderful breakfast served in the nicest dishes, the roon (thogh rather small) was elegentelly furnished and very clean, the stuff was attentive and the location excellant. we'll recommand this hotel to all our freinds.", "Date": "February 26, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "manchester", "Title": "“rome was amazing”", "Author": "muttibolton", "ReviewID": "UR23673896", "Content": "Hotel britannia was quite good, the room was small but adequate for our needs, as we were out most of the day sightseeing. Dissappointed to say the least after reading the reviews on trip advisor, I found the reception staff to be quite aloof and not at all interested in our needs, at no point were we asked if we needed any advise on tours, places to visit, resteraunts etc. In actual fact the most we got out of them was an answer to our \"good Morning or Good Evening\". Breakfast was excellent, a really good choice of everything, the room was kept clean and the chambermaid was most friendly, in actual fact more friendly than the reception staff. I would suggest you do not use anything from the mini bar in the room, it costs an absolute fortune, go to the local supermarket at the end of via napoli and buy your beers and wine there. Maybe we would stay at this hotel again (the breakfast swung it for us). But I think a little more thought in advising guests who are on a city sightseeing tour of places to see and eat would help enormously.", "Date": "January 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Jerusalem, ISRAEL", "Title": "“Nice centrally-located small hotel in Rome”", "Author": "YJScq", "ReviewID": "UR23157038", "Content": "I booked the Britannia based on its location, the fact that it included a full breakfast, and that it had free WiFi in the rooms. The hotel is near the intersection of Via Napoli with Via Nazionale, 2 minutes by foot from the Piazza Della Repubblica, and 5 minutes from the Termini station. If you like walking you can easily get to many of the standard attractions by foot, otherwise it is easy to catch a bus nearby. Next door is an Anglican church which holds concerts. Upon checking in you are treated to a complimentary hot drink - I took a Cappuccino and my wife had a hot chocolate - just what we needed considering the cold outside. I had asked for an early checkin (nominal time 13:00), and indeed a room was available for us at 10:00. Our room was one of the few with a balcony, which was definitely a plus despite the cold weather. The room was relatively small but comfortable and with plenty of light. There is a minibar refrigerator and an electric kettle, and the coffee and teabags (including my wife's favorite - Earl Gray) are provided daily. We had to ask for the sheets not to be changed daily, and if you are out late the room is checked again and hard candies placed on the pillows. Every morning a printed 1-page world-news review is slipped under the door, and in the evening a handwritten card with the next day's weather and sunset time. There is essentially no lobby, just the 8-table breakfast room, the 4 table bar area, and a small niche. On each floor there is a corner with a sofa and a small table with fresh fruit. The WiFi coverage was less than satisfactory. The entrance floor has a WPA-secured network which worked well, but the other floors were covered by a single access point with a limited number of IP-address leases. In our room the signal strength was often very low, and the connection would drop after 10 minutes use. After such a drop I frequently could not reconnect due to there no longer being available leases. My wife was quite happy that this restricted my email browsing time, but less so that Skype to family was not reliable. The staff was courteous and friendly. We stayed 10 days and completely enjoyed our stay.", "Date": "January 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Iowa", "Title": "“Wonderful Boutique Hotel”", "Author": "IowaChocolatier", "ReviewID": "UR22853718", "Content": "This lovely boutique hotel is close to the train station and within walking distance of many of the tourist sites and great restaurants and shopping. The receptionists were very helpful. The breakfast was great and the room was well appointed. This was my first trip to Europe and I loved the craziness of Rome!", "Date": "December 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“Nice hotel”", "Author": "jetlagdori", "ReviewID": "UR22596757", "Content": "Spent 6 days in Rome and this hotel staff was not only friendly but helpful in securing same day reservations to Galleria Borghese and restaurants. Mario and Magdalena were great !The buffet breakfast is surperb that has to appeal to all tastes. Hotel is a ten minute walk to Termini and 5 minutes to Republicca train stations. Hotel is on a quiet street and despite being fully occupied never heard any other guests.There's an internet cafe across the street and cost 2 dollars for half hour access.", "Date": "December 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "LLoret de Mar", "Title": "“Truely a home away from home”", "Author": "MichelleLLoretdeMar", "ReviewID": "UR22182556", "Content": "My husband, daughter 14 and I travelled to Rome and stayed at this litlle hotel having had one of the best impressions on accomodation, we felt at all times welcome, taken care of, expectant of the next detail the hotel staff would have in stock for us... Britannia is an elegant and comfortable Hotel where space is intelligently conceived and detail shows the love for the profession and towartds the wellbeing of the client. Congratulations to the management and staff and also to future guests, the best choice without a doubt. Location is excellent 2 to 8 minutes in any direction by foot to get main streets or transports, (8 minutes walk to Termini, 4 to bus stop, 15 walking to Trevi, or to Colosseum...) Breakfast complete and good quality, fruit, eggs, yogurts, cereals, breads, pastrys, cheeses, sausages, italian ham, coffee EXCELLENT! Bedrooms well structured, small cosy, extremely cofortable beds. Bathroom totally equiped, even with fish, staff at your service always with a smile...what else can one ask for when away from home for any reason? I wish I can one day go back...must be possible....I throwed sooo many coins in the Trevi Foutain!!!", "Date": "November 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Berlin", "Title": "“Perfect litlle place in Rome”", "Author": "bellucciBerlin", "ReviewID": "UR21447958", "Content": "I had the pleasure to stay at the Britannia six days during a two week stay in Rome. It's a wonderful little hotel. I was there on business and know Rome rather well, so I did not need much help or advice, but another hotel guest told me: \"they do everything for you. Everything!\". That prooved to be true when the car of a guest broke down in front of the hotel. The staff is very friendly, especially Mario is the perfect receptionist to have around. Breakfast is good, the minibar is not too pricy. There's a bowl with fresh fruit on every floor. Rooms are small, but clean and pretty, the fish in the tiny aquarium keep good company... I hope they forgive me for taking the little rubber ducky home! After six days I had to move to 5 star hotel near Via Veneto that had been booked for me - but I honestly would rather have stayed here.", "Date": "November 1, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "baton rouge", "Title": "“Excellent small hotel with outstanding staff & facilities”", "Author": "martin9040", "ReviewID": "UR21349837", "Content": "We stayed at the Hotel Britannia for 3 nights during the middle of October in 2008. Rooms were very clean and maintained in that manner on a daily basis. In fact, several times, after returing to our room from a short excursion, we found that the staff had noticed our absense and \"re-straightened\" the room while we were exploring nearby. The morning breakfast was excellent with both American and European styles to choose from. Served between 0730-1030, it was, by far, the best offered by any of the hotels we stayed in during our 9 day journey through Italy. The American coffee was also a blessing. The bathrooms were small, but very clean and maintained throughout our stay. Hot water was never in short supply Everyone on the staff went out of there way to accomodate our every request during the 3 days. One of the members in our group was utilizing a combination of crutches and wheelchair for mobility - not an easy task in a city like Rome. The staff were gracious enough to accomodate her every need during our stay. The area around the hotel appeared to be safe at all times of the day and night. Never once did we observe anything that would counter those feelings relative to the safety of the neighborhood. The hotel was very close to and within reasonable walking distance of the Metro, the train station, and nearby taxi stands. We would definitely stay at the hotel Britannia on any return trips to Rome.", "Date": "October 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "johannesburg", "Title": "“What a lovely hotel”", "Author": "italylover29", "ReviewID": "UR21029303", "Content": "We stayed at Hotel Britannia for three nigths in October. It is a lovely hotel with friendly and knowledgeable staff. They provided us with excellent advice and are clealry proud of their beautiful city. The rooms arer small but perfectly proportioned and there is everything that one would need to be very comfortable. The great extras were appreciated. This is excellent value for money and I would recommend it highly.", "Date": "October 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "miami", "Title": "“Excellent Hotel”", "Author": "mmmiami", "ReviewID": "UR20591319", "Content": "I enjoy my stay at this hotel , my friend and I stay there for 3 days and we felt like home, Mario the receptionist was super kind, they took well care of us, the breakfast was very nice, exellent capuccino,. the location is perfect. I will recomend this hotel ...", "Date": "October 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "California", "Title": "“Charm in Rome”", "Author": "Good2Go_8", "ReviewID": "UR19249142", "Content": "A charming hotel. A little off the beaten bath with regards to the top tourist attractions but convenient to the train station (too far to walk unless you are packing lite). Helpful front desk, a little british flavor in Rome. Rooms are snug but with nice amenities and decor.", "Date": "August 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "State College, PA, USA", "Title": "“Rome Britania staff is delightful”", "Author": "pmb436", "ReviewID": "UR17872216", "Content": "I highly recommend the Hotel Brittania if you are looking for a lovely, small hotel with a staff that will take excellent care of your every need while in Rome. We were greeted warmly in the charming lobby with a tray full of iced drinks, invaluable on this hot day. The hotel is air conditioned, the rooms are well appointed, comfortable and charming. Most importantly, not only had the staff taken care of all of our requests prior to arriving, they gently suggested improvements to our itinerary and dining choices that made our experience even better than we had planned for. If you visit, be sure to ask Mario to set up a dining experience for you at his favorite restaurant, we had a great meal and special attention was paid to us as if we were regular customers and old friends.", "Date": "July 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Somerset", "Title": "“Recommended Hotel”", "Author": "cbailward", "ReviewID": "UR16924533", "Content": "Small double room with no view but comfortable bed and, unusually, a bathtub with shower over. The staff were all very friendly and helpful from our arrival from the airport via Termini station at about 11pm until we left after 3 nights stay. The breakfast is a real plus, catering for all tastes from fruit , yoghurt and muesli to eggs and bacon: the scrambled egg was particularly good. The hotel is easy to find, down a side street and, in our experience, quiet, though there is a popular Irish Bar just across the road. There are bus-stops within 200 yards and Termini station is about 5 minutes walk. The neighbourhood is quite salubrious and we did not feel at all threatened when returning late at night. Like all cities Rome has its fair share of vagrants but it semed no worse than central London. I did a lot of research before leaving the UK and, although the hotel is not cheap it seems to be reasonable value for money in Rome. Anyone travelling to Rome is well advised to take advantage of the Roma Pass which can be bought from most tobacconists. It gives you unlimited travel on public transport for 3 days and free entry into 2 museums with discounted entry thereafter. Entry to the Colosseum/Forum and the Villa Borghese is more than the cost of the Roma Pass so all your transport is free!", "Date": "June 14, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "California", "Title": "“The Britannia Hotel is Great!”", "Author": "wrgCalifornia", "ReviewID": "UR16790631", "Content": "We thoroughly enjoyed our stay at the Britannia Hotel. We were greeted upon arrival with refreshments and very pleasant staff at the reception desk. The hotel is ideally located on a quiet side street within walking distance of the train station, the Roman Forum and the metro line. The rooms are attractive and adequately sized and the included breakfast was the most generous and attractive of all those we were offered in Italy. The hotel desk staff was fluent in English and most accommodating in helping us arrange for tours, a car and driver to take us back and forth to our cruise ship in Civitivecchia and to the airport, and recommending excellent restaurants for dinner. I would have no hesitation in recommending this hotel to our friends.", "Date": "June 9, 2008"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Memphis, Tennessee", "Title": "“Convenient location, Would stay again”", "Author": "NoNameTrvlr", "ReviewID": "UR15100413", "Content": "Britannia Hotel is a nice hotel on a quiet side street (via Napoli) near the main train station and metro line and within walking distance to the Colosseum and Roman ruins. My husband and I stayed in a junior suite, Room 403. Mario at reception was extremely helpful in making airport transfer arrangements and restaurant recommendations. The room was very clean but the furnishings are a bit dated. The bed was very firm - good for my husband's bad back. Because it was a suite it was large by european standards with enough storage space. The marble bathroom was a nice size with a sun lamp in the shower but the tub/shower was rather narrow. The nice sized terrace was a real plus. We even got the NCAA Final Four on the satellite TV. Breakfast included bacon/eggs/sausage along with the typical italian meats, fruit, pastries. The only negative was an odor in the room occasionally but we opened the window and it quickly aired out. Although not my first choice of hotels originally, I would definitely go back because we really enjoyed our stay.", "Date": "April 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City", "Title": "“A Wonderful Place to Stay in Rome”", "Author": "italytraveler13", "ReviewID": "UR14842347", "Content": "The Britannia hotel is very well situated, one block off of the via Nationale, near the Piazza Republica and the Termini train station. So, access to buses and subways is excellent. The best reason for staying at the Britannia, however, is the excellent staff and the genuine concern that they have for the comfort of their guests. Every request for assistance was met with a smile and an efficient response. The rooms are very clean and relatively spacious. The breakfast buffet was wonderful, with a selection that is second to none. I would not hesitate to stay here again on our next trip to Rome.", "Date": "April 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Albany, NY", "Title": "“lovely, small hotel”", "Author": "johnbachel", "ReviewID": "UR14102057", "Content": "We enjoyed our stay at the Hotel Britannia. Although the room was not large, but it was clean and had a good bathroom. The staff was helpful and the continental breakfast had many good options.", "Date": "March 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Derbyshire", "Title": "“Please go to this Hotel.”", "Author": "Jet_Setter_0", "ReviewID": "UR14098550", "Content": "We stayed at the Hotel Britannia for 3 nights from 26th Jan 2008. Before booking our trip I researched the internet to find the best hotel in the most convenient location. After a long long search I booked this hotel and all I can say is that we found our stay fantastic. The hotel is very close to the main train station, very close to the nearest metro station and close enough to walk to all the sights and back again each day. The room was spacious, spotless and the bathroom had a Jacuzzi – which was very welcome after a day of sightseeing. As with all my holidays, I scour tripadvisor before I travel to any hotel to get a feel of the place – I particually look for anything bad that is said about the Hotel to get a true picture of the Hotel – But I cannot say anything bad about our experiance (and I have thought about it!!). You do not need to hear my comments regarding Rome – it is simply breathtaking!! In Summary Rooms - Clean Breakfast - Fantastic Bed - Comfy For 3 Nights what more do you need?? One last point, it was my birthday whilst we were there and on our return to our room there was a bottle of Champagne awaiting us and a card wishing me well – I though that was such a nice touch. Even if they did not do this my review would still be the same. So thank you to all the staff and the Britannia for making our stay even more enjoyable.", "Date": "March 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“best hotel staff”", "Author": "LovTaTravelNY", "ReviewID": "UR11986236", "Content": "As soon as we arrived we were greeted by the friendly staff of this wonderful hotel. Travelling in Italy in July can be very tiring and exhausting. As soon as we went to check in, we were handed cold drinks and biscotti. The front desk booked our day tours of Rome and made reservations at local restaurants for us. The room was great and yes there will be a fish waiting for you in the room. Breakfast was good. Hotel A+.", "Date": "December 27, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "surrey", "Title": "“Don't be fooled”", "Author": "thewwanderer", "ReviewID": "UR10768849", "Content": "I have just returned from a weekend in Rome and have never been bothered about writing a review before, but I was so horrified by the fact that my experience bore no relation to many of the reviews that I wanted to share them. The hotel is in a central location, the staff are helpful and friendly and the rooms are clean but that really is where the good stuff stops. Our room was miniscule, there was a double bed and only really enough room to walk around it. The bathroom was a good size but the shower was pretty ineffective (although plenty of hot water). The fish are a bit of a gimmick really, nice but frankly for 300 Euro a room I would prefer more space. The bed was diabolical, you rolled into the middle as the mattress was pretty old and the décor is very tired. They claim the rooms are soundproofed, but we could literally hear our neighbours farting! Breakfast was nice enough but nothing out of the ordinary. We tried to have a drink in the bar one night, no presecco (it was only Italy after all) and the alternatives were served with some seriously out of date peanuts……. Suffice it to say that the Brittania is fine, nothing special and seriously overpriced for what you get.", "Date": "November 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "england", "Title": "“Great for a city break”", "Author": "jayjaygee", "ReviewID": "UR10382092", "Content": "We arrived at the hotel early and checked straight in. We were offered juice and cookies and our case was taken up to our room. Our room, 307, was small but had a huge comfy bed and a good size bathroom with plenty of hot water. We had a tank of fish and a rubber duck!! Tea and coffee making facilities. The location was ideal for us. We only had 2 nights and three days and found it easy to get to the Colisseum, Forum,Vatican, Trevi Fountain,Pantheon,Palitone and used the number 64 bus which ran along the via Nazionale at the end of the street.The staff were very helpful and we appreciated the big bowls of fruit. The Irish pub on the corner was good and we found a super little pizzeria a couple of roads away called Riccis-excellent . Cheap wine and great atmosphere and pizzas.. We managed to see a lot of the sights and were not disappointed at all. I recommend this hotel for a great city break. Oh I almost forgot, breakfast was very good with lovely melon, hams, eggs etc etc etc.", "Date": "October 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Swansea", "Title": "“Rome”", "Author": "ShawBristol", "ReviewID": "UR10349348", "Content": "Very good hotel. Some of the standard rooms are a bit small so worth getting a superior room for a little bit more as these are big. Got one of the smaller rooms when booked through expedia so upgraded and was much better. Good hotel all round otherwise.", "Date": "October 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Wonderful stay at Britannia Hotel”", "Author": "rimma1924", "ReviewID": "UR10012415", "Content": "My husband and I stayed at Britannia early September, 07. It was a very pleasant stay. Hotel has a very convenient location: walking to Termini, walking or taking a bus down via Nazionale to Forum and Coliseum. Subway is around the corner and takes you to Vatican or wherever else you want to go. Staff is excellent. Breakfast - the best! Can't forget those sauted porchinies. Great variety of cold cuts, cereals, you name it. Very tasty. If we come back to Rome, will stay here again. Have to mention - we got a rate of USD 168/night through Expedia. I don't think you can beat that for early September in Rome. We also requested early arrival. We arrived to Britannia at Noon and got our room right away. Also - our room was exactly as on the pictures. It was not huge, but convenient with nice decour.", "Date": "September 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Canada", "Title": "“Very pleasant stay at the Britannia”", "Author": "wolfman613", "ReviewID": "UR8690790", "Content": "We just returned from four days in Rome. We stayed at the Britannia Hotel and were very pleased with the location, service and cleanliness at this hotel. It was very hot in Rome in August and as a result the air conditioning was not cooling off our room sufficiently on our first night. We mentioned this to the concierge in the morning and he immediately offered to move us to another room, where the air conditioning worked just fine. The breakfasts were great and the presence of a basket of fresh fruit on each floor (constantly refilled) added a very nice touch. There is a computer with high speed access that is available for use by the guests of the hotel at no additoonal fee. I found the concierge (who has been at this hotel for 30 years) to be very helpful and knowledgeable. I would definitely recommend this hotel.", "Date": "September 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newport Beach, CA", "Title": "“A well kept, charming and convenient place to stay in Rome”", "Author": "piggyinthemiddle1961", "ReviewID": "UR8489268", "Content": "We stayed here with our two teenagers for 4 nights in early July and loved it. This place is well located and has class. The furnishings are very nice, marble bathroom, thick towels, nice linens. Wonderful buffet for breakfast with something for everybody and good coffee, Management extremely helpful an friendly. Many places within easy walking distance and the subway and trainstation are a short walk for day trips. Airconditioning was a lifesaver in the heat. Quiet rooms good for getting over jet lag. Our room for four had a wonderful little terrace with potted plants that seemed like it was not in the middle of a busy city. I would stay here again and recommend it to anyone.", "Date": "August 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Milwaukee", "Title": "“Wonderful Stay”", "Author": "onwis", "ReviewID": "UR8379472", "Content": "I have to say that I was one of those people who worried about staying in a bad location in Rome or being too far away from the sites but my extensive research led me to Hotel Britannia, where we had a wonderful stay. I really couldn't have asked for much more. The hotel was well-kept and clean. The bed was comfortable and we had air conditioning which was a plus in the July heat. The staff was helpful guiding us to some great restaurants within walking distance of the hotel. We were able to walk easily to all of the sites (including the Vatican). Plus it is one block off of Nationale which is a wonderful shopping area. I would definitely recommend this hotel.", "Date": "August 9, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York City, New York", "Title": "“Fantastic service”", "Author": "rosyko", "ReviewID": "UR8038170", "Content": "The service is simply wonderful at Britannia. When we first arrive, we were greeted with some fresh juices and cookies. Each room, although slightly small, is nevertheless nicely decorated. The hotel also provides fresh seasonal fruits throughout the day for guests (not just your ordinary oranges, apples and bananas). The breakfast has a great quality food. The hotel is located right off Via Nationale and is just minutes away from the Termini train station. During our stay in Rome, we took a short trip to Bologna, and staying at the hotel makes life a lot easier", "Date": "July 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Well Recommended”", "Author": "Bishbj", "ReviewID": "UR7715871", "Content": "We were warmly welcomed by friendly reception staff and were offered a glass of juice whilst checking in, which was a nice touch after a longs days traveling. Our room was a good size for European standards, our bed was firm and almost if not king size. There was a small area with a writing desk and mini bar. We also had a little friend, a fish that kept us company. As stated in other reviews the bathroom was quite big, with a shower over bath set up. Breakfast was plentiful, but basic. There was a selection of pastries, cold cuts, breakfast cereals, fruit and a few hot dishes. It was nice to see that the hotel website was accurate with its description about the rooms and services. When we have the opportunity to come back to Rome, we will return back to this quaint hotel.", "Date": "May 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sevenoaks, United Kingdom", "Title": "“Great hotel, highly recommended”", "Author": "Hel5London", "ReviewID": "UR7665098", "Content": "Hotel is situated about 5 mins walk from Termini. Termini is like every other city mainline station. Not very pleasant. But as soon as you leave the immediate vicinity everything is fine. The hotel's location was not a problem. Rome is not a big city. We walked to the Vatican City in 45 minutes. All sites easily reached on foot. Bus service also excellent. The hotel itself is clean, very comfortable and well maintained. The staff are polite and helpful. The travellers' candid photos already posted on this site are accurate. Rooms are spacious (unusual for Rome). We even had a little terrrace adjoining our room which would be fantastic for summer evenings. This hotel is highly recommended. We would definitely stay here again when we return to Rome (which we will).", "Date": "May 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "2"}, "AuthorLocation": "New York, NY", "Title": "“Thin walls, nice staff”", "Author": "RoyNYC", "ReviewID": "UR7363726", "Content": "Overall, a fine hotel with great service and nice ammenities for its price range. The location may not be convenient for many tourists and the rooms are not for light sleepers. Location: The hotel is very close to Termini Station, Rome's main train station. That makes it convenient for arriving and departing by train or air. However, very few of the attractions, quality restaurants or worthwhile streets are in this area. The neighborhood near the station is also known to be the only area of questionable safety in the city. So while the block of the hotel may be OK, know that you dont want to go exploring the area at night. - Do stay here if your trip to Rome will be for only one day, and therefore worth staying somewhere that is easy for arriving and departing the city. - Do not stay here if your trip is longer than a day and you plan on doing plenty of walking around and exploring. The hotel is not a convenient 'home base.' Rooms: The hotel offers nicely appointed rooms for its price range. The bathroom was large for Europe. However, the walls are very thin. You can hear other people talking and I kept hearing the water running through pipes in the walls. I tried going to sleep early, but kept getting woken up by the pipes and neighbors' talking. - Do not stay here if you are a light sleeper. Service: The service was great. The hotel has a very professional staff that was courteous and proper. For example, while I checked in someone from the breakfast room came by and brought me a glass of juice and a cookie. In fact, everyone I encountered working there was extremely friendly and polite.", "Date": "April 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Britannia - Great !”", "Author": "lostalot", "ReviewID": "UR7300012", "Content": "The hotel is situated approximately five minutes walk from the Termini Railway station and bus drop-off point from the airport and in a quiet side street 50 yards off the main Via Nationale - central for walking to the sights, shopping, restaurants and travel to and from the airport/rail system. I read in previous reviews that the area in which the hotel was situated was less than ideal, especially at night - my wife and I walked throughout the district at most times and met no difficulties whatsoever. Staff are polite and helpful, the premises beautifully appointed, clean and quiet with a convenient small bar and breakfast room available next to reception. The double room which we booked was pefect for two people with a large comfy double bed, TV, AC and mirrored/granite bathroom. Housekeeping ensured that the room was kept at a very high standard every day. The pillow \"packages\" left daily were also a very nice touch. The hotel is not the cheapest (are there any cheap hotels in Rome!?) but good value for money. I have no criticism of the hotel at all - we enjoyed our stay very much indeed and the location (it is almost directly opposite the best Irish pub in Rome, if this is what you want) was ideal for our break in this fascinating city.", "Date": "April 9, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Great Hotel”", "Author": "drisky1", "ReviewID": "UR7192859", "Content": "We spent two nights at this hotel when we were in Rome for the Italy v Ireland six nations match. The hotel is fantastically located being only a 10 minute walk from the Termini and only a 5 minute walk from the nearest underground station. Being situated down a side street, the hotel was very quiet and we both slept very soundly. I can't fault the hotel in anyway - the decor was really nice, the staff were very pleasant and spoke very good English, breakfast was good and the rooms were clean and certainly large enough. As far as site seeing went, the Forum and the Coloseum were only a leisurely 25 minute walk away. There's a good Irish Bar just across the road and plenty of bars, restaurants and shops nearby. I'll definitely stay at the Britannia on our next visit to Rome.", "Date": "March 20, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "HERTFORDSHIRE", "Title": "“Stay here....a great city center hotel”", "Author": "RUBE", "ReviewID": "UR7172726", "Content": "My partner and I stayed here for 4 nights along with two friends of ours. I am dubious of city center hotels as previous experience indicates they are shabby and small, this is not the case at The Britannia. I would rate this as a 4 star hotel. Following a 10 minute walk from Termini Station we were very warmly welcomed with drinks and biscuits. Booking in was straight forward and quick and our luggage quickly appeared in our room. Our friends were given a room with a balcony but we requested a quiet room and were given a lovely room at the back of the hotel. I can understand others describing these rooms as small, ours was fine with a almost separate 'dressing' area and the bathroom was huge, including the fish bowl. I have never slept so well at a hotel, it was a quiet location (apart from our female American neighbour!). Breakfast was lovely, just enough choice for us and no complaints about the quality except the toaster needed a couple of goes to produce proper toast. Coffee and tea are plentiful with a large pot per person. Generally it was extremely clean, quiet and some very good luxury touches. You cannot beat the location....especially if you enjoy Irish bars (one within 40 metres). All staff were very helpful and friendly. Highly recommended.", "Date": "March 16, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Idaho", "Title": "“Can't say enough nice things about the Britannia!”", "Author": "RomeFirstTimer", "ReviewID": "UR6803488", "Content": "My husband and I stayed at the Hotel Britannia for 7 nights in February, 2007. Having been burned in the past by making reservations online for hotels we were unfamiliar with, I was really crossing my fingers that it would be as nice as it looked. I'm happy to say that the Britannia was an excellent choice. The room was very comfortable (yes, small by American standards, but that's to be expected), and the bathroom was the most comfortable I've experienced in a European hotel. The room had everything we could have needed, and the bed was surprisingly large (almost king size), and firm, and the pillows were even nice (not those thin feather ones you sink right through). We were also pleasantly surprised by the evening turndown service. The breakfast was always fresh, and there were plenty of choices. The only noise we ever heard was other guests in the hall as they came or went, but you'll hear that anywhere. We didn't even hear the elevator, and our room was more or less right behind it. The location was also great, right by a subway station and Termini, the big train station. By looking at a map of Rome, I had thought we would need to use buses to get to some of the sites such as Trevi Fountain or the Pantheon, but that turned out not to be the case - both are an easy walk from the Britannia (Rome is much more compact than I realized). But by far, the aspect we appreciated the most, was the helpfulness of the front desk staff. They were attentive and friendly, and very willing to help with tours, reservations, phone calls, and restaurant recommendations. Knowing we could rely on them made our stay in Rome so much easier and less stressful. I'll say it again - I can't say enough nice things about this hotel!", "Date": "February 17, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Hudson, New Hampshire", "Title": "“Great Experience”", "Author": "ScottNewHampshire", "ReviewID": "UR6774746", "Content": "My wife and I spent six nights at the Hotel Britannia in January 2007. We found the hotel to be very safe and clean. The staff were friendly, helpful and more than happy to assist with dinner plans, transportation to the airport, tours and information. Our room was surprisingly large with private bathroom. Cost $130 euros a night was more than reasonable considering other hotels I researched in Rome. The location of the hotel was perfect, close to many sights withing walkig distance such as Trevi Fountain, Spanish Steps, Forum, Coliseum, Via Nazionale and Metro. We rode the subway all over the city, felt safe but also very aware of our surroundings at all times.", "Date": "February 9, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Very disappointing”", "Author": "FrequentDeltaFlyer", "ReviewID": "UR6759393", "Content": "I booked this hotel based on complimentary reviews on Trip Advisor and was very disappointed. My room was extremely small - so small, I could hardly find a spot on the floor large enough to open my suitcase. Unlike the other descriptions of bathrooms that I read here, which sounded very nice, mine was ugly, old, chipped gray tile and had no hair dryer, something I've not come across before in a hotel of this category. The walls are very thin. The head of my bed was against a wall and apparently on the other side of the wall was my neighbor's bathroom. I was jet-lagged and wanted to sleep late but had no choice but to wake when my neighbors did and then listen to them shower. On the positive side, the staff are lovely, bowls of fresh fruit in the hallway is a nice touch and the breakfast was adequate but I have seen much nicer breakfasts at other four-star hotels. I would not choose to stay here again and would not recommend it to others.", "Date": "February 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City", "Title": "“Great stay at lovely hotel”", "Author": "margaretlb", "ReviewID": "UR6107817", "Content": "My sister and I spent a very comfortable 5 nights at the Britannia Hotel in mid October. The location right off of via Nazioanale and 4 blocks from Termini was convenient for us. The hotel has old world charm and a very friendly staff. The room (215) was large with very comfortable beds and a private terrace with table and two chairs. The room decor is also lovely with heavy satin drapes and art photos that are attractive. Also, a little fish \"to keep you company\". The bathroom is modern with good hot water. Really good lighting in both the room and bathroom. Spotlessly clean and freshly pressed sheets daily. The included breakfast is first class with many hot and cold options: eggs, frittata, bacon, sausage, beans, cheeses, cold meats, fresh fruit salads, many fresh baked goods, the best coffee I've had in Europe. Twice, because of early morning appointments, we had breakfast in our room and there was only a E2.50 sucharge for the room service (no charge for the breakfast). I used a phone card for calls and there was no charge, not even a connection charge. You also can control both the air and heat. I highly recommend this hotel.", "Date": "November 11, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Haven, CT", "Title": "“Very nice”", "Author": "CeeGee", "ReviewID": "UR6079237", "Content": "We were pleasantly surprised by the rooms, breakfast and staff. Initially we choose this hotel because we needed to be closer to the train station but we also enjoyed the area's great shopping and proximity to Quirinale and Via Veneto. We were able to walk to Ancient Rome and the Forum.", "Date": "November 6, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“loved Hotel Britania”", "Author": "stevegolf", "ReviewID": "UR5924789", "Content": "We stayed at the Britania for 2 nights. Great location-central to all of Rome, walking distance to the train station. Lots of great stores and restaurants within walking distance. I agree the Hotel's street is not so beautiful but the general area is very nice- you're in the shopping/business district of downtown Rome. However there are nicer areas of Rome - near the spanish steps and trevi fountain. Hotels in these areas would probably be more expensive. The staff of the Britania could not have been nicer or more helpful. Breakfasts were excellent much more than the usual hotel fair- full buffet including hot entrees such as eggs, waffles, veggies, pasta. The breakfast area was very pleasant and comfortable. There is a cosy small bar/lounge opposite the breakfast room. The Rooms were very nice but small like most european hotels. They were very quiet because the Hotel is on a side street and there are double windows. The baths were clean and very nice-marble of course. I believe this hotel is a great value- if you like small charming hotels this is a great place. Because it was not in a charming area, I could not give it five stars.", "Date": "October 7, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Jose, CA", "Title": "“OK, but no more”", "Author": "kutzsche", "ReviewID": "UR5881258", "Content": "The hotel is generally nice with two expceptions: The rooms are small (we had a standard double) and the hotel is too pricey for what it offers. It's looked centrally but down a small ugly side street, and you can see the wear and tear of the hotel everywhere, from the rooms to the lobby, the elevator etc. On the positive side the breakfast was excellent and the service was very good as well. Overall, we enjoyed our stay.", "Date": "September 27, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Wirral, England", "Title": "“Nice hotel but some bedrooms are extremely small!”", "Author": "AnnaD", "ReviewID": "UR5717239", "Content": "A nice enough hotel in a central location. I was just a bit dissapointed as I had booked a double room but was given a twin one, and simply told that all of the doubles were booked up. The room was nicely furnished with comfortable beds but was very, very small! We were probably just unlucky though as by looking at the rooms on the website, most of them look a good size. On the whole, we had a pleasant stay here.", "Date": "August 28, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Lovely hotel”", "Author": "Little Jenny", "ReviewID": "UR5715543", "Content": "I have just returned from this hotel. It is within easy reach of Rome's main station and the Coloseum and is a good base for exploring the city. On arrival at the hotel we were given a drink and biscuits which was a nice touch and we were shown to our room and given an explanation of where everything was and how it all worked. We had a nice room with a balcony and my son loved the pet fish in the room. The breakfasts here are excellent and they have a particularly good selection for making your own cereal with lots of different nuts and dried friuts - although one word of caution - the dining room is small and so sometimes you have to wait for a table and if you still are eating your breakfast at 10am when it officially finishes the lights over the food go out! The area around the hotel seemed fine - especially the Via Nationale end where there are some good shops and restaurants. If you are staying at this hotel I would not advise eating at the Irish pub on the corner - we had a meal there on our first night and I had a beef dish - the meat was inedible - had I been in the UK I would have refused to pay for it! Also beware of prices at restaurants in key locations such as Piazza Navona - the prices of the main dishes are reasonable but they over charge for drinks and ice creams and you can end up with an extortionate bill for a mediocre meal - albeit in great surroundings. Finally I would like to add that I last stayed in Rome on my honeymoon in 1987 and the city has greatly improved over the last 19 years. It is much cleaner with less grafiti and there seemed to be less evidence of pickpockets and crime in general and a more visable police presence. A particular area that has improved is Termini station which used to be beset by pickpockets and is now much improved although still has a few beggers. Others improvements include Piazza Del Popolo which is no longer used as a car park and Rome zoo which has had a major facelift.", "Date": "August 28, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Lovely hotel”", "Author": "CharEms", "ReviewID": "UR5525105", "Content": "A really lovely hotel, we booked through easyhotels(--) and had no problems at all. It's near to a tube station which is useful, although they stop quite early and only cover some of Rome, so you end up walking most places. The room was fairly small, but did us fine, (we're two female friends) and there's a small fish in every room which is sweet. The staff were all very friendly and breakfast was yummy, plenty to choose from. I'd definitely stay there again.", "Date": "July 29, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Washington, DC", "Title": "“Overlooked little gem”", "Author": "abettel", "ReviewID": "UR5463847", "Content": "This is a smart, reasonably priced, well-situated choice for a 1-2 night stay. Courteous staff, nice breakfast buffet and handy to the central train station and many of the city's sights.", "Date": "July 13, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New Jersey", "Title": "“An Enjoyable Overnight Stay”", "Author": "luv2travel023", "ReviewID": "UR5447050", "Content": "I spent one night here in late June, 2006. I arrived around 10:30 p.m. and found Maddalena the receptionist and the night receptionist waiting to welcome me, concerned that I should have been there a few hours prior. A porter was available to carry my bags down the five or so stairs to the desk and up to street level the next day after checkout. My single room was small but quite lovely and accommodating to a single female traveler. The high ceilings helped. The bathroom was great - all mirrors, and had the wonderful added touch of a fish tank with a lone fish to keep me company. Breakfast was more like lunch, with eggs, bacon, assorted cold meats, fruit, rolls, and salads. Very good, and all in all a great experience - I wish I could have spent more time there. The hotel is approximately 10-15 minutes walking distance from Stazione Termini. I walked from the station (since the airport ATMs would not accept my bank card & I had a very limited amount of Euros for a cab). Although it was around 10 p.m. and the streets did not have many pedestrians, I felt relatively safe. I had to stop twice to ask directions because I couldn't find the street signs I was looking for. Everyone I asked was extremely kind and helpful, with one hotel desk clerk watching me until I got to the end of his street and an Internet store clerk walking me around the block to Via Napoli & offering to walk me down the end of it to the hotel. However, I suggest taking a cab from the station at night. The hotel is few blocks from the Piazza de la Repubblica, with shops & other conveniences close by. I had a good pasta meal with wine at the Irish pub on the corner of Via Napoli for less than 18 Euro. Yes, no Irish food there, just the pub atmosphere & good Italian fare.", "Date": "July 10, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Madison, NJ", "Title": "“Convenience and Service in Rome”", "Author": "cindybelm", "ReviewID": "UR5393228", "Content": "Stayed here with my family June 7-9, 2006. The rooms weren't very large but the hotel is in a good location. We were one block off the Via Nazionale- convenient to the Metro and buses. The rooms were a little small but ours had a balcony. On nice days you can sit out and enjoy The breakfast was very good and the service also was good. The staff was accommodating. They were nice enough to hold some clothes I had left in the room, until we returned a few days later.", "Date": "June 26, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Bonita, California", "Title": "“Boutique Hotel”", "Author": "Msjaguar", "ReviewID": "UR4956948", "Content": "Great Place to stay within 5 min. of train station. The hotel is sound proofed and on a quiet street. Though rooms aren't huge they're adequate with marble bathrooms complete with fishbowl. Breakfast was excellent including hot food. They even give turndown service with candy. The hotel is clean and staff very helpful. Don't look anywhere else this is perfect and the price is right, though cheaper through expedia, then their website.", "Date": "April 10, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Stay here!!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4717796", "Content": "I loved this hotel! We walked in as weary travelers and they gave us juice and cookies. The room was smaller then I expected but it was quaint, they even have fish in the bathroom for a pet during your stay. The staff was multi-lingual and you can't beat the location...we walked everywhere from the hotel.", "Date": "March 20, 2006"}], "HotelInfo": {"Name": "Hotel Britannia", "HotelURL": "/ShowUserReviews-g187791-d198735-Reviews-Hotel_Britannia-Rome_Lazio.html", "Price": "$199 - $383*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Napoli 64</span>, <span class=\"locality\"><span property=\"v:postal-code\">00184</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "198735", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/56/73/c2/hotel-britannia.jpg"}}