{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great hotel in an awesome location!”", "Author": "Hotel_Snob_reviewer", "ReviewID": "UR126193374", "Content": "Great European Hotel with great service, good location and value based hotel.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bregenz", "Title": "“incredible comfortable in central location”", "Author": "Michael_N_Austria", "ReviewID": "UR125976552", "Content": "This was my 2nd stay in this Hotel. The warm welcome through the GM Antje Last gives you the feeling to come back home, the hotel is hidden because the reception and the the rooms begin in the 2nd floor. Because there are only 29 rooms, you feel the family atmosphere everywhere: at the reception, in the salon (smoking room divided) and in the breakfast room. Very good breakfast. The room No. 32 was fabulous, very spacy, about 4m hight, new bathroom with elegant black floor, flatscreen, sofabed, and everything in a typical old-berlin-style. If I go to Berlin I will stay in this lovely 3-star hotel or in top-luxury-6-star-hotel Hyatt, not somewhere between.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Espoo, Finland", "Title": "“Clean city hotel with calm rooms”", "Author": "henri_s", "ReviewID": "UR125937109", "Content": "I stayed here with my partner for a weekend city break and had a good experience. The hotel is small and situated close to shopping and bars in Berlin. Our room was on the 4th floor. The room was clean but small, with windows toward KaDeWe rooftop. In the room there was a large LCD TV and the free wifi worked well in the room. There was no fridge or ice machine but we could get some ice cubes from reception upon request. Shower/WC was very small but clean and no mold here. Breakfast was a bit of a disappointment. The breakfast area is lovely and the lady working there very friendly but the selection was not of a high quality. We have had much better bread rolls in other hotels in Berlin earlier, and the cold cuts were poor quality. Juices and fruit salad were good. I would definitely recommend this hotel as the location is great but it's weakest point is the quality of breakfast. It might be a good idea to book it without breakfast and eat out at one of the coffee shops nearby.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Sweet place central located perfect for business and leisure”", "Author": "Sabinagiese", "ReviewID": "UR125816335", "Content": "I was in Berlin for a conference and choose this hotel because of the perfect location at the KaDeWe in the Bayreuter Str. The manager and her staff are very professional and welcomed me in an excellent way. I had to move into different rooms because they were fully booked and so I had the great opportunity in experiencing the different room categories. The breakfast room Is so nice and the cake is home made... Lucky me! Thanks team I will be back soon", "Date": "March 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Krakow, Poland", "Title": "“Good location, bit old fashion, breakfast just average”", "Author": "Etienne_RICHARD", "ReviewID": "UR120538343", "Content": "Nice hotel location. Heating not properly regulated an dslight smell in room (nothing to incommodate). Lovely personal taking nice care of customers. Limited TV programs if not in german. Very close to U12 metroline.", "Date": "November 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Good Hotel, Good Location”", "Author": "Hanter2512", "ReviewID": "UR117610880", "Content": "This is a good value hotel with some character. Booked via lastminute.com and there was a bit of confusion as our booking stated a family of four but at the hotel it was for a couple. The hotel quickly resolved the problem. The room was great, old high ceilings with a balcony. The staff were very friendly and the hotel is in a safe area, close to the tube and bars/resturants/shops. I would reccommend the hotel for couples or familys. One tip - avoid the breakfeast - expensive for what you get and you can pick up a coffee and snack at the tube station for a third of the cost.", "Date": "September 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chennai, India", "Title": "“Location, Value, Convenience”", "Author": "Gayathri_Iyer", "ReviewID": "UR106363491", "Content": "We stayed at the Comfort Hotel Auberge for one night in April 2011. Very centrally located, this hotel is very comfortable for couple and family tourists alike. We arrived from Berlin Tegel airport and took the directions from their website; the X9 to the Zoo and then the U2 from the Zoo Bahn to Witenberg platz. From there, it’s barely a 2 min walk down to the hotel. We arrived early 9:30 am, with reservations, but unannounced about our early arrival. At first the receptionist said that we couldn’t check-in until 12:00 noon so we were going to proceed with the check-in process and leave our luggage with them. She then asked us to wait at the small breakfast area and offered us coffee while she said that she would check on the availability of our room. By the time we were done with our coffees, in 30 mins our room was ready in one of the upper floors. The building is very old but the rooms are refurbished. Some of the architecture can still be seen inside the room on the roof etc. The room itself was small but we expected that it would be the case by European standards. The bathroom was small but spotless which is very important to my husband. Happy husband, happy me. We got a rate without breakfast when we booked it but later changed our mind to have breakfast at the hotel. The breakfast was EUR 9 and not too elaborate. With the exception of the eggs, there wasn’t any hot breakfast. The receptionist also booked the city tour for us on the BBS hop-on-hop-off tour which was very good (very good and working-condition personal headphones); as well as personally took care of all our needs (including free plug adaptor for our stay). The TV does not have any English channels with the exception of BBC and CNN. Note to those with heavy luggage, the lift runs at the mezzanine levels and not to the actual floors; but this is definitely not a show-stopper. The hotel is within walking distance to several restaurants and very centrally located for tourists and for those interested in shopping. Practically every attraction is accessible via the underground network and one can get a day-fare or sorts to cover everything on bus and U-bahn. Berlin is a city with plenty of history and we would have loved to stay here longer and enjoy the local attraction. I would gladly recommend this hotel to anyone; the biggest advantage is their helpful and smiling staff and the fact that it is located in the centre but still away from the hustle and bustle. Centrally located and good for short-term stay and tourism only.", "Date": "May 1, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Over family friendly but not gay friendly”", "Author": "operamuso", "ReviewID": "UR105778095", "Content": "I chose this hotel for the gay Easter Leather meeting in Berlin for it's perfect location, reasonable prices and free WiFi. When I tried to log on I found that all the gay social networking websites I needed to use to stay in touch with friends were blocked - Gaydar, Recon, Eurowoof, even the websites of some of the Berlin gay clubs. The owner was unsympathetic and unhelpful and claimed that she needed to 'protect' any children staying there - which is surely the job of their parents. If that is her attitude she should make it clear on the hotel's website - but no doubt she doesn't want to lose the Pink Pound, Dollar or Euro which from which she probably does very nicely, given the hotel's location. Otherwise the room was large, though the bathroom was little more than a cupboard, and the bed very comfortable. It was annoying that though the room was a non-smoking one there was a persistent smell of smoking coming from somewhere. Breakfast was adequate, though someone needs to teach them how to scramble eggs. The staff apart from Madame was friendly and helpful.", "Date": "April 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Wilmington, DE", "Title": "“Around the corner from Ku-Damm and Ka De We”", "Author": "MooreaLover", "ReviewID": "UR89739638", "Content": "We arrived in Berlin for the last 2 nights of our fabulous vacation. Got off the train and decided it would be fine to walk to the hotel. It was pretty far! We should have taken the train's welcome rep's advice and gotten on the U-Bahn. The U-Bahn stop for the hotel is just across the Ku-Damm! The hotel is very quiet and our room was pretty large and very accomodating. Not so for the bathroom, however. It was very, very small. The room was clean and the bed was really comfortable. The receptionist was the friendliest we had on the whole trip. He couldn't help us enough. The night before we had to leave for the airport he called a taxi to make sure we had one early. We went to the Italian restaurant just up the street (one block up on the right on the same street as the hotel) and had a wonderful farewell dinner. We were the first ones at breakfast the next morning and it was a really good spread. The receptionist from the previous evening sat us on the balcony - really a nice way to end our trip. Thanks to all of the Trip Advisor reviewers - all of the hotels we stayed in were wonderful during our trip through Italy, Austria and Germany!", "Date": "December 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Delightful stay”", "Author": "LuckyBlue__7", "ReviewID": "UR87684189", "Content": "This is a great little hotel, very close to the underground, right next door to KaDeWa. Staff are friendly and the included breakfast is great. Has the feel of a B&B. I will definitely stay here again", "Date": "November 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Excelent relation between price and quality. You could't get better!”", "Author": "edutoa", "ReviewID": "UR84659092", "Content": "The location for shopping is very good because its just on the side of KaDeWe the biggest department store in Europe. For sightseeing is great, the hotel is 100meters from the U-Bahn station that has the 4 lines leading to the berlin center. It is also very confortable, the beds are soft enough and the room is nice and big. The breakfast is also a highlight. Everything fresh and lots of choice. Tipical food is also a plus. The hospitality really makes a differece, because germans are not known to be friendly, but in this case you feel part of a family. They speak english and french. Also very practical. In about 5min you have your room clean and towels changed. Amazing! I trully reccomend for someone looking for a quiet hotel to go with the family, traveling alone or in couple. Mybe for business travelling is a bit too much familiar and not so many internet connections. For sure is not for teenagers or trouble-seekers.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Wonderful stay”", "Author": "manika24", "ReviewID": "UR82687827", "Content": "Stayed at the hotel for 4 nights in a room 308 using choicehotels points. It was considered a smaller room facing the coutyard, but it was OK for us. The room was very clean. The location of the hotel was great for sightseeing The hotel itself is very charming and cozy. They offer free breakfast which was adequate. We took the express bus from the airport to Tiergarten and took taxi to the hotel for 7 euros. On the trip back we just walked to Tiergarten - it took about 15 min. Hotel staff recommended a wonderful restaurant. We took a free walking tour and went on 1 hour river tour. Both were very enjoyable. The audio guide on the river tour was wonderful in both English and Russian languages. Also took a trip to Potsdam on our own and got a bus tour in town. After travelling to many countries, I have to say that Berlin is on top of my list. I would certainly recommend it.", "Date": "October 9, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "York", "Title": "“As good as other reviewers suggest”", "Author": "SBusiness", "ReviewID": "UR77938206", "Content": "Stayed here from a recommendation of a Danish Colleague of mine and found Staff incredibly friendly and helpful, rooms very large and clean and Breakfast had everything you would want. Cannot fault location (handy for tour busses and Wittenbergplatz U Bahn) and allowed bags to be left in Reception on day of check out. Enjoyed strolling up to the Kaiser Whilhelm Church where a market was organised - very impressed with Berlin although weather was cold and showery for August", "Date": "September 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vilnius", "Title": "“PERFECT PLACE”", "Author": "Ervis555", "ReviewID": "UR73369462", "Content": "Superb place to stay, KaDeWe is just around the corner :) bars and restaurants also just around the corner! you have got everything in one place! parking is also 5meters away, 13euro per day. Rooms are ok, everything you need is there, breakfast is perfect fills u up for the start of the day! I stayed in room 17, large and clean room. For the travellers who like to stay in modern hotels this might not suit, the hotel has its own style, and is not so modern inside! One thing I did not like, that there was no bar in the hotel, but anyways, I had everything what i wanted around the corner, there I could enjoy my double JD with coke with my g/f . P.S I recommend you to take a taxi and go for a meal to a restaurant called ENTRACOTE, very close to checkpoint charlie. best french cuisine in Berlin.", "Date": "August 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Pompano Beach Florida", "Title": "“great Location, NO AC!”", "Author": "barbuhomme", "ReviewID": "UR71381528", "Content": "I stayed in this hotel for 3 nights July 2010. The temps in Berlin were 94 degrees. With No AC. Not a lot of other things matter. The location was great, the rooms were clean. But after waking up with the sun baking thru the window & not being able to stay in the room again until after the sun went down. It goes to the bottom on my list for summer stays. If I go to Berlin in the winter I would stay here again. The window did open up wide & there is a fan in the room. But we were not able to get an extra fan. Also, the beds were comfortable to me, but just box springs with comforters on top. No mattresses. And the elevator does not go to each floor. It goes between the floors, on the staircase landing. So, if you cannot manage 15 steps up to get to the elevater then 15 steps down to your room this is not the hotel for you. Lastly, the attached bathroom is very small, but functional. US branded chain should have the basic USA hotel standards & AC is a basic standard.", "Date": "July 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Faial", "Title": "“Location, location, location...and very helpful staff”", "Author": "DesiTunes", "ReviewID": "UR66087268", "Content": "Very friendly staff. Excellent location near the KaDeWe. Rooms are comfortable but basic. Very small bathroom in my room but I think that there are larger rooms. Very clean. Excellent breakfast for a 3 star hotel. Negativ: the lift that stays between floors, you have to carry your bags up or down the stairs. Value for money. Free WiFi in rooms and one computer in public area", "Date": "June 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Really nice”", "Author": "Palmary", "ReviewID": "UR62561969", "Content": "If you do not like big fancy modern hotels and prefer small family quite places - this hotel is your choice. I stayed in this hotel for a shopping weekend. I couldn't have wished a better location for shopping! KaDeWe was just around the corner, several big shops and a plenty of small ones around. The hotel was old fashioned, but really nice. The staff was helpful, breakfast realy astonishing with all the fresh fruits and self made curd, I enjoyed it very much! The rose in the bathroom made this stay very spacial. There's really one BUT: if you like big modern, well furnished hotels - like Swissotel sutuated nearby, for example - you may not like this one for its old fashioned mood.", "Date": "April 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Orange County, California", "Title": "“Best hotel value and location”", "Author": "travelviewer1", "ReviewID": "UR54047304", "Content": "We stayed 3 days at this charming small hotel on a side street and were given a balcony room facing the quiet street for permit parking only. The hotel garage nextdoor is manageable traveling up to the second floor for tight parking, but when in Berlin, walk bus or tram! Having a coffee maker was ideal, bathroom shower small but lots of hot water, our computer was useful and the staff is very friendly and helpful, definitely a great place to start your touring as nearby is KaDeVe, a gorgeous and expensive department store a block away along with the Wittenburg U-Bahn which we didn't use but took Bus #100 a block away to the Reichstag and Brandenburg Gate. Fortunately no heavy rain.100 yards away is a supermarket to pick up cold cuts and cheese for snacking. This was my 3rd trip in the past 35 years and definitely the best hotel. Better than the Crowne Plaza which is closer to the Kaiser-Wilhelm church but more fun to walk along Kurfurstendam, the most enjoyable boulevard with shops, people and plenty of Starbucks every other corner! A return visit is in store for 2011 and hope to book the balconied room again.", "Date": "January 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Windsor", "Title": "“Wonderful Staff and a Great Location”", "Author": "petal_f", "ReviewID": "UR53275177", "Content": "The staff make this hotel worth reviewing. They were consistently kind, polite and helpful, spoke excellent English and were happy to help us whenever we had problems or enquiries. Very nice people. The hotel itself is situated around the corner from the \"hop on, hop off\" tourist bus stop (get your tickets from hotel reception), public transport bus stops, right near a U-Bahn station (on the same line as the Zoo and Olympic Stadium), and around the corner from KaDeWe, other shops, and a selection of restaurants and bars. My only gripe is the size of the bathrooms, even in the three-berth room, they are pokey and awkward. The breakfast buffet is ok but nothing to get excited about. Other than that you can't go wrong here.", "Date": "January 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Sweden", "Title": "“Great location”", "Author": "patton2", "ReviewID": "UR49392579", "Content": "and value. Close to the metro and shopping. Internet was not that stable....", "Date": "November 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Vietnam", "Title": "“A real find”", "Author": "TravelbugVietnam", "ReviewID": "UR38429060", "Content": "We were not sure which part of Berlin would be the best to stay in, but we were thrilled at the location of the Comfort Hotel Auberge. It was around the corner from Kirfurstenstrasse with all its wonderful shops, cafes and restaurants. The sightseeing buses departed from nearby and there was an underground station opposite. The rooms were comfortable but the bathroom was a bit small. But we really appreciated being in the heart of things so we could walk everywhere.", "Date": "August 22, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Portsmouth, UK", "Title": "“Great location and price - recommend”", "Author": "norrismj", "ReviewID": "UR38043139", "Content": "My wife and I travelled to Berlin with our two teenage children (17 and 15 years old). We had a four bedroom room which was of a good size with on-suite facilites. The room was spacious, clean and in good decorative order. There was an excellent breakfast buffet available. The staff were friendly and spoke relatively good English. The hotel is located in central Berling about a 15 minute taxi ride from Tegel airport (it cost us 17 Euro per trip) and is about a five minute walk from the nearest U-Bahn. I would stay at this hotel again and have no hesitation in recommending it to you.", "Date": "August 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "USA", "Title": "“Charming”", "Author": "Traveller111Usa", "ReviewID": "UR34872050", "Content": "This was our first hotel in Europe. We stayed 2 nights. I thought the room was charming. I liked the high ceilings, the geraniums around the balcony, and fresh flowers in the bathroom. The teenagers were intrigued that you could buy a beer in the soda machine downstairs. I found the room comfortable for 4 people...a little tight...but not bad.", "Date": "July 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Oost van Rotterdam", "Title": "“almost perfect..”", "Author": "rotjeknor", "ReviewID": "UR29638858", "Content": "We stayed on the 5 th floor, in a 5 bed room. More than enough space, everything was clean, beds were good, but the pillows much too soft. Bathroom was very clean, but small and the showerhead too low. But these were the only remarks, the rest is perfect: friendly, helpful staff, good breakfast, all fresh and plentiful. You can book a space in the parking garage, U-bahn station is only a 2 minute walk, plenty restaurants in direct vicinity. Next time in Berlin, without a doubt again in this hotel.", "Date": "May 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Santa Rosa, California", "Title": "“Terrific for Families”", "Author": "tlbkwb", "ReviewID": "UR19092301", "Content": "Fabulous location, easy, quick walk to the U-Bahn station; even quicker to Wurtenburgplatz, with restaurants, ice cream (!), bier garten. KaDaWe department store is right around the corner. Kaiser Wilhelm cathedral within easy walking distance. They were installing the elevator while we were there, and it was almost completed. Difficult to walk up 4 flights, but I managed (knee issues). Room was huge--family of 4 slept very comfortably. Bathroom was tiny, but not a deterrent. Big high ceilings, molding, huge windows. Breakfast was substantial, and the kids loved the scrambled eggs. We were able to check in early (thank you!) as we were exhausted from the train ride. And at checkout, they accommodated our luggage for several hours while we continued to roam about.", "Date": "August 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edmonton Canada", "Title": "“Excellent Hotel”", "Author": "McDocEdmontonCanada", "ReviewID": "UR18365233", "Content": "We stayed at this hotel for 3 nights in July 2008, with our two young-adult children in a family room for four. The location is excellent, on a fairly quiet street only a block from the subway. Many restaurants are nearby, and there are some excellent shops within easy walking distance. The hotel is old but in excellent repair, and refurbishing is underway with a new lift just installed. The breakfast was excellent and the staff were friendly and helpful. The only negative was lack of air conditioning in 31C weather, as our upper-floor room was very hot. Overall, an excellent choice for a visit to Berlin.", "Date": "July 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens", "Title": "“Lovely!!!”", "Author": "e_athens", "ReviewID": "UR15653743", "Content": "We stayed 3 nights- the hotel is very centrally located, just 2mins walking from KaDeWe mall, 1min walking to metro station. Rooms are very spacy reminding of an old German mansion. Very clean. Breakfast was amazing!!!in our next visit to Berlin, we will definately choose the same hotel!", "Date": "May 5, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Natick, MA", "Title": "“Location, Location, Location”", "Author": "momskier", "ReviewID": "UR12521457", "Content": "My daughter lives in Germany. We went to visit her recently and the 3 of us went to Berlin for a weekend. We are Choice Hotel members and used our points to stay at Comfort Hotel Auberge. We loved the hotel it was so centrally located. The hotel has a fabulous breakfast included in price of room. The room the 3 of us got was unbelieveable. There were 3 bedrooms, 2 baths, and a very nice living area. I'm guessing it was at one point a manager/owner apartment. We were able to park our car on the street with a special tag the hotel gave us for 5 E. I was expecting to pay more. The hotel is right next to the famous department store KaDeWe. KaDeWe is an experience not to be missed. The store was decorated for Xmas and just beautiful. The hotel was also near the metro at a major stop so very easy to get around. We took a sightseeing bus the first day to get aclimated to the city. Turned out to be a great idea. That was also right near hotel. If you are in Germany near XMAS don't miss the xmas markets in most cities.", "Date": "January 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bridgnorth, Shropshire, UK", "Title": "“Peaceful setting”", "Author": "JerryO'R", "ReviewID": "UR10006304", "Content": "Had a great four days at this hotel. No prior knowledge of location or hotel and what a great surprise on both parts when we got there. Great location for eating, U bahn (Wittenberger Platz) and nice walk to S bahn (Zoologischer Garten). Load of shops around: Ka De We (expensive), designer, Nike, Adidas, Wertheim (affordable) and nice eateries (especially 'Paydos' just around corner in Platz from hotel - steak great!). Checked in at 23.30 without any problem. Friendly welcome - better mood than mine. Room on 1st floor very comfortable, spotlessly clean, tea/coffee supplies adequate. Smallish bathroom but ideal for two. Shower lovely and hot. Towels changed daily and room kept very clean. Airconditioning unit very useful. Breakfast plentiful with good coffee. Lovely ambience, especially as the four days we were there the sun never seemed to stop shining. Free use of PC and Wireless network (charge) available. Overall we could not have wished for a nicer and friendlier place to stay and would not hesitate to return.", "Date": "September 26, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Ft. Stewart, GA", "Title": "“Spacious room and perfect location”", "Author": "crawfishbelle", "ReviewID": "UR4306946", "Content": "The location of this hotel is fantastic! This is the famous shopping area of Berlin with the KaDeWe right next door, so there is plenty to do after the other attractions close for the day. Plus, with a metro stop right outside the hotel, you can easily be anywhere in the city in just a matter of minutes. We were also pleased with the size of the room and that they provided a crib for our baby daughter. Our favorite part was the beautiful breakfast room where we had a relaxing start to every morning. This hotel is the perfect blend of old charm and modern rooms. We were very pleased with our experience and highly recommend this hotel.", "Date": "December 28, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Great location for shopping”", "Author": "TravellingCat", "ReviewID": "UR4219527", "Content": "I stayed here with my boyfriend 3 nights in December, 2005. We reserved double room through Internet and the reservation was ok. Room was large and spacious. I especially loved the high ceiling. Very simple equipments, there was only tv and couple of tables and beds, bathroom and safe. I think the rating was 3 stars. The hotel has no lift. Breakfast was free and there was plenty to choose from. Coffee especially was excellent! I think the best part was the location. Department store KaDeWe and the biggest shopping street was just right around the corner. Metro station was also very near. The staff was friendly and when we checked out, they let us storage our luggage there for a couple of hours. The lady at the reception was very friendly and she spoke very good english. They also call you a cab if you need one. This was appr. 110 euros per night, so it isn't the cheapest one, but if you plan to do some heavy shopping, then this hotel would be a very good choice.", "Date": "December 8, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“great don't pay double the price for less”", "Author": "ebarav", "ReviewID": "UR3936977", "Content": "Great hotel , clean friendly great location. I love the position and my room , well wanted to take it home with me ( room 43) . Staff very friendly , breakfast great, great connections to travelling and sightseeing all over berlin. One little problem no lift, but was good to get exercise after great breakfast. I tried to get there for an extra two nights on the second part of my hotliday, but there was not room, paid twice and got half at another hotel. Would definitly go back", "Date": "September 25, 2005"}], "HotelInfo": {"Name": "Comfort Hotel Auberge", "HotelURL": "/ShowUserReviews-g187323-d199370-Reviews-Comfort_Hotel_Auberge-Berlin.html", "Price": "$81 - $188*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Bayreuther Strasse 10</span>, <span class=\"locality\"><span property=\"v:postal-code\">10789</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "199370", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/99/0c/990ce4fa80c0db6d6930796f3f7bc27b5large.jpg"}}