{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“School trips ? Never!! Find another hotel.”", "Author": "Teacher B", "ReviewID": "UR126782385", "Content": "Our school travel agent booked this hotel on our behalf and we raised concerns about the review by another school from April 2011. We were told that it had been a mis-understanding and all problems had been cleared up. I wish I had trusted my instinct. I have taken many school trips abroad and travel personally to many countries. Never have I come across a situation like this. The first days were okay. The food was very nice and the restaurant staff were polite and accommodating. Our pupils were described as lovely, and all seemed okay. During breakfast on our last day, we found out that a member of the hotel staff was taking pictures of the children's rooms without our consent or knowledge. We went immediately to ask the person to stop, and we were met by a torrent of loud comments with an aggressive body language. I was amazed to learn that the Manager was not there, and, apparently, the person in charge of the whole hotel was the receptionist. This person continued to take photos and shouted at the teachers about the state of the rooms. She seemed to think we should be responsible for the general wear and tear. What a joke. The female members of staff would not be intimated by this person, and stood our ground, but I have never been shouted at in such a manner. To say she needs a course in customer care is an under statement. Things did go missing from our rooms, I lost one earring. The children reported missing biscuits and shower gel, which at first I thought was teenage untidiness. However, the number of people who reported this can not be considered a co-incidence.But the way the person yelled at our teachers, talking to us like we were children, is totally unacceptable. I believe that they are pulling a scam. Avoid this hotel. I shall be writing to the overall Manager of Comfort Hotels and I have my own video evidence.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“No good for school trips!”", "Author": "Grace B", "ReviewID": "UR126643523", "Content": "I stayed as part of a school group for 3 nights. For the first few days we couldn't fault anything apart from choice of dinner on the night and the behaviour of some maids. The English speaking staff were friendly and the rooms were large and clean. There we no major issues until check out. Several times staff took photographs of student rooms and pointed out what they were not happy with. This inspection was not expected but we accepted that they were worried about the slight untidiness. the real problems started at breakfast on the last day. Staff rushed to our rooms to take last minute pictures while we were eating and managed to find several issues with the rooms. They accused students of breaking things which they didn't. A cigarette end was even placed in a year 8 room, none of whom smoked. several other things were also set up. one other issue was behaviour of some of the maids. some unusual things went missing. Several children reported bags of crisps and biscuits missing, along with deodorants and other items. Usually things like that could be ignored but it happened to a lot of children. Apart from all this the staff were very rude on checkout with one woman shouting and another calling us pigs. Overall the hotel itself was okay but the staff make it difficult for large groups. I would no recommend this hotel for schools.", "Date": "March 25, 2012"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Ludwigshafen", "Title": "“One night in Berlin”", "Author": "LudwigshafenGarb Posted by an OctopusTravel traveler", "ReviewID": "UR117734596", "Content": "Nice hotel with a good breakfirst. We have slept to the front side of the hotel - which is a liitle bit noisy in the night. But the price was very good and the hotel is clean and the rooms are fine.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Newcastle, England", "Title": "“Excellent. I hope to be back”", "Author": "nilocpro Posted by an OctopusTravel traveler", "ReviewID": "UR114977624", "Content": "I was here at the hotel in October 2010 for eight nights in a twin room for sole use. I enjoyed the hotel. It was comfortable, clean and cheap as 3 star hotels go. A few months ago I booked another eight nights for June 2011 in a twin room for sole use. To my surprise I was given a huge en-suite room with balcony. The room also had numerous tilt-turn windows, so it was a light room. My single bed was comfortable; I had a writing desk with chair, a television on top of the desk and a mini fridge beneath it; I also had a settee, as well as a small table with 2 small armchairs and a sizeable wardrobe. The tiled bathroom had a wash basin, w.c., and shower, and I had plenty of towels. Before the sumptuous buffet Continental breakfast (5 star quality), which also included scrambled eggs and bacon, I was able to pick up one or two complimentary German quality newspapers. The restaurant also served good quality evening meals at reasonable prices. All in all, the room service, restaurant service and the service provided at reception could not be faulted and the cost of my room with breakfast was well below what I would have to pay in the U.K.", "Date": "July 3, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Dissaponting service and treatment of guests.”", "Author": "JulieAWright", "ReviewID": "UR103644952", "Content": "2 nights spent here as part of a school trip. 64 students and 7 staff. Food, service and rooms were comfortable but all pretty basic. Bathrooms are tatty but clean enough. Sadly, hotel staff tried to rip us off when we came to check out by accusing us of damage that was either clearly already there or had been made to look worse by hotel staff. In between the time of us checking the rooms and the hotel staff entering them, things were broken and our students blamed. We refused to pay a cent. Would never go there again.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Newcastle, England", "Title": "“Outstanding value”", "Author": "nilocpro Posted by an OctopusTravel traveler", "ReviewID": "UR86118071", "Content": "The staff were helpful and very professional. I had an en-suite twin room for sole use for 8 nights; it was very comfortable and warm; there were two armchairs and a table, as well a writing desk with chair and an old fashioned crt tv with limited number of channels. There was a small fridge and a complimentary bottle of water was provided on the first day. The buffet breakfast was 5 star standard, with choice of cereals, fruit, fruit drinks, cooked meats, cheese, rolls, boiled and scrambled eggs, bacon, coffee and different teas. (I might have missed some things.) I had one evening meal, which I paid for with a British visa card. The meal was well presented and served very professionally. I have some suggestions, which would make this good hotel even better: a small electric kettle with sachets of coffee, tea bags, as well as biscuits. Either connect a digi. box to the crt tv, for more channels with better reception, or replace the old tvs with flat screen digital tvs. The only disadvantage of this hotel, is that it is some way from the centre. I usually walked about 1/2 hour to Berlinerstrasse and caught public transport: tram or S-Bahn.", "Date": "November 5, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Billerica, Massachusetts", "Title": "“Very noisy, far from attractions, but not bad.”", "Author": "FrequentFlyer055", "ReviewID": "UR73379793", "Content": "I stayed for 4 nights in a huge, clean room. Unfortunately, it was extremely loud. The hotel has no A/C, so I tried to leave the window open a little, but the traffic was way too loud. Make sure to ask for a room out back, not facing the busy street. The breakfast and shower were great, the staff so-so, not very motivated, but will help you if prompted. It is quite far from the touristy parts of Berlin, you have to take several busses. I probably would not stay there again, even though it turned out fine, mainly because of the noise and the location. I noticed that another reviewer praised the sauna and pool, the hotel actually has neither.", "Date": "August 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New Zealand", "Title": "“Excellent large room!”", "Author": "bobinthebottle", "ReviewID": "UR70314549", "Content": "We arrived at the hotel and checked in quickly, went to the room, and it was massive! A 1 bedroom room was a great find for what we paid for it (which wasnt much). Have to pay 5 Euro for parking a night, but not too bad as it is locked up in an underground carpark. Wireless internet (8 Euro per 24 hours) wasnt working on the first night, but was on the second night. Dont know if that happens often. Restaurant was good - was a bit slow getting our drinks, but the food was good. No English speaking TV channels, so make sure you have a DVD or movie to watch if you wanna relax after a day in Berlin. A little noisy sometimes as a casino/bar is next door, but I wasnt woken up by any noise. Quite warm at night - but not the hotels fault! All in all, a pretty good hotel.", "Date": "July 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "london", "Title": "“APPRECIATION OF STAFF & FACILITIES HOTEL COMFORT-BERLIN”", "Author": "amerLondon", "ReviewID": "UR45016575", "Content": "It was a wonderful place to be with familywith hospitablestaff extending all possible help to make you feel at home.I would especially mention here the name of Melanie Koball with cheerful personality together with professional devotation.Reasonable cost despite peak season.The location is a little bit far from thr capital center.Fully Recommended. Dr Amer Fakhr London [--] amer_fakhr@yahoo.co.uk", "Date": "September 27, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "2"}, "AuthorLocation": "Helsinki", "Title": "“Never again!”", "Author": "AnnikaHelsini", "ReviewID": "UR37546223", "Content": "Service (girls at reception desk) was terrible. They really need to think again about occupation. They work at wrong place. Hotel is marketing itself as been near center, but it is far away, in the suburbs. If you want to stay at hotel, where you would feel you are welcome, don't take this hotel! The name \"comfort\" is a big joke.", "Date": "August 13, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“Very good hotel, but too far from centre”", "Author": "TimAtRedBee", "ReviewID": "UR37450790", "Content": "Very good for a 3 star, nice rooms (a bit noisy by road), no kettle in room but good breakfast.. Bus stop outside, (4 per hour) - 12 mins to PANKOW tube line (5 per hour) - 20 mins to centre (Add waiting and connection times) = 45 mins (€7 for unlimited day ticket) Taxi = €14 each way.", "Date": "August 12, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "3"}, "AuthorLocation": "uk", "Title": "“:(”", "Author": "thomasn14", "ReviewID": "UR28679575", "Content": "i thought this hotel was going to be a great chance for relaxation hence the name comfort im afraid it isnt and the service was terrible", "Date": "April 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Moscow, Russia", "Title": "“A pleasant stay”", "Author": "katri0na", "ReviewID": "UR23571954", "Content": "We stayed at this hotel for a week over the new year holidays. It was the chepest option we could find for that period, and I was a bit put off by its location. But it turned out not to be so bad - you need to take the 151 bus (the bus stop is right across the street form the hotel) to Pankow, where there are both U-bahn and S-bahn stations. It's a straight line to Alexanderplatz, about five or six stops. So travelling to the centre took about half an hour, depends on how long we waited for the bus. If you stay out late, or just don't want to wait for the bus, there's a taxi stand at the station, getting to the hotel costs just under 10 euro. The rooms are spacious, simple and clean. A double bed was actually two beds pushed together. There's a fridge, but no mini bar. No safe in the room, but they have deposit boxes at reception free of charge. All in all it's exactly what you'd expect from a three star hotel. The staff at reception is helpful in answering any questions, all of them speak good english. You can buy Berlin welcome cards at reception, there are free maps of the city, and an information stand with brochures, etc., but most of them are in German. Breakfast is nothing to write home about and not really worth getting up for if you'e a late sleeper. A pretty limited choice, the only hot options beeing scrambled eggs and bacon, but you won't go hungry (if you do, you can buy any imaginable kind of junk food at Pankow station). The only problem we came across while staying at the hotel, was when our electronic key card stopped opening the door. For some reason they couldn't recharge it or something, the actually had to change the lock to our room and give us an ordinary key. The problem was handled efficiently, but it took about an hour. Overall, staying at the Comfort Weissensee hotel was a plesant enough experience, especially taking into account the price. However, if I ever visit Berlin again, I'd preffer to stay somewhere closer to the centre of the city.", "Date": "January 15, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Denmark", "Title": "“Value for money in Weissensee”", "Author": "Zfinks", "ReviewID": "UR18145237", "Content": "We stayed at the Comfort Hotel Weissensee for 5 nights. We lived 4 adults in a family room including breakfast for 375 euro totally. That was very cheap, and the room was large and great for 4 adults. The people in the reception were helpfull, but some of theme were not so great at talking english. All in all, they were very friendly and nice. The breakfast buffet was ok, different kinds of cereal, tea and coffea and bread with cheese and jelly. Also eggs and bacon and different kinds of ham and sausage. One could miss some fresh fruit or a sweet treat, but it was ok. The hotel is nice and clean, but not very cosy in our opninion. There are no green areas, and that is definently a shame. It is located about 20 min. from Alexanderplatz, if you go by bus and U-bahn, witch is very easy. You just have to change in Pankow. We would recommend a stay in this hotel if you are travelling budget, but if you want comfort and a cosy hotel with personality we would recommend another one.", "Date": "July 22, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Alta", "Title": "“Ok hotel, bad service in reception”", "Author": "gaute", "ReviewID": "UR10873494", "Content": "Rooms are big, clean and quite recent refurbished. Bathrooms are nice and clean. Cold floors. It may be som noice from the hallways and nearest rooms... The personell in the reception needs to take a course in hospitality and service. In my case there was a misunderstanding between Hotwire and the hotel, so i could not get the complimentary breakfast as promised. The hotel did nothing to help me...They where just stubborn and not helpful. The hotel itself are quite far for the city senter, so it is not especially good if you are staying out late.......Public transport is so and so on the location. You have to change from bus to Tram before you get to Alexander Platz.", "Date": "November 17, 2007"}], "HotelInfo": {"Name": "Comfort Hotel Weissensee", "HotelURL": "/ShowUserReviews-g187323-d199388-Reviews-Comfort_Hotel_Weissensee-Berlin.html", "Price": "$59 - $328*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Rennbahnstrasse 87 - 88</span>, <span class=\"locality\"><span property=\"v:postal-code\">13086</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "199388", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/3d/1d/3d/aussenansicht-des-hotels.jpg"}}