{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "netherlands", "Title": "“excellent headquarters for Berlin exploration”", "Author": "NetherlandsBacchus", "ReviewID": "UR127073856", "Content": "We stayed 3 nights in hotel Kronprinz following Tripadvisor reviews. No need to add much. The hotel is very pleasant, clean, has comfortable rooms, excellent beds, friendly and helpful staff. The location is great, near the S bahn station from where you can travel all over Berlin in a couple of minutes. The Ku'damm avenue is just around the corner and has everything for a drink and a meal, but if you go a bit further to the Savigny station (s bahn to Westkreuz, then 2 more stations only - or take a cheap cab) you will be in the middle of a bohemian district with plenty of bars and resto's. In particular the Bleibtreu street is to be recommended. And make use of the hotel facility to rent a bike for only 5 euro a day. The bikes are quite ok but ask the hotel reception to see the bikes the evening before to make sure the tyres are well filled and the chain oiled (in our case this was not well done - it was the only weak point in an otherwise very correct and service minded hotel). The great moment is when you get back your hotel, coming out of a city with lots of beton and modern buildings, it is a treat to see the romantic shape of the hotel, the nice garden with a terasse before it, and the wunderful lounge full of books indside. Excellent headquarters!", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Brussels", "Title": "“Nice and quiet”", "Author": "Mark_from_Brussels", "ReviewID": "UR126197588", "Content": "No complaints...stayed here 2 nights in Feb. Nice staff, clean, good breakfast. I just wasn't huge on the location, in a quiet part of Berlin. I was there for work though. I would stay again....", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ghent, Belgium", "Title": "“An oasis of quitness”", "Author": "mihaela p", "ReviewID": "UR121654730", "Content": "We were looking for a cosy, quiet hotel in Berlin, preferably located in a nice old building, full of character ( mission almost impossible in Berlin, which is full of new buildings and hotels all decorated in aluminium and plastic).Fortunately, we discovered this hotel on internet and it fulfilled our wishes! The area is very quiet, yet only2 min walk from the most famous shopping street in Berlin- Kurfurstendamm. , the hotel was charming and the staff was very friendly and helpful. I found the lobby very warm, decorated as a library, full of books and nice furniture. The rooms are not perfect, they still have to renovate the building and to improve the insulation, but our general impression was positive. What touched me very much was that, because last day we had to leave very early to catch the train, the staff waited for us with wrapped breakfast, so we had something with us for the road! That was really nice and unexpected.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“Friendly, comfortable and convenient”", "Author": "willafoster", "ReviewID": "UR121549500", "Content": "Situated several miles away from the city centre in a nice quiet area we found the Kronprinz to be the perfect place to stay to see Berlin. With a bus stop just minutes away from the hotel, we followed the advice of the receptionist and we travelled into and around the whole city by bus which we soon found to be a very easy and reliable way to see all of the sights. This small friendly hotel was exactly what we were looking for - clean, comfortable and well furnished, with very helpful staff who made us feel welcome at all times.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“Stonegunnar”", "Author": "Stonegunner", "ReviewID": "UR121497049", "Content": "Perfect lokated in the beginning of Kurfurstendamm. Easy to find if you come with car from west or north. Free parkingzone around the hotel. 3 minutes walking to bus or trainstation. Only Romantic Hotel in Berlin. Very good breakfast. 4 o`clook tea whith a glas of sherry for free.", "Date": "December 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chester, United Kingdom", "Title": "“City Break Late Nov 2011 - Excellent.”", "Author": "SpikeWright", "ReviewID": "UR121262864", "Content": "We wanted a good hotel that wasn't all chrome and neon, something original and with character, and the Kronprinz was perfect. Easily reached by bus from Tegel (Buy a Berlin Welcome card at the airport, the onto bus 109 into Berlin, off at Adenauerplatz at the junction, then any bus down the Ku-Dam to S Halensee, walk over the bridge and turn right to the hotel set back off the main road). Likewise we could get anywhere in berlin by bus or train right close to the hotel, so it was really convenient for getting about. Hotel very welcoming and helpful, excellent buffet breakfast, and a wireless lan available in our room so glad of that. Some reviews comment on trains nearby, well we stayed in room 265 at the front of the hotel, and yes we could hear a train now and again but it was not a disturbance in any way, and the surrounding street were very quiet throughout. Taxi in the early hours back to Tegel was 12 Euros which the hotel booked for us no problem, just a short 10 minute hop to get there, but the driver said Berlin is getting a new bigger airport soon so a longer taxi run due when that cuts over. When we got the bus from Tegel we took a moment at Adenauerplatz to orientate ourselves which bus to get next, and spotted an imbiss called ‘Curry mit Bis’ by the bus stop – we had excellent schnitzel and chips there sat at the street tables, and followed by an excellent coffee before crossing the road to get the bus to Halensee, and an excellent snack and start to out break there. When we go back to Berlin, and we will, we’ll have no hesitation staying here, and wish we’d found this place for our previous visits. Next time we’ll go for a suite to get an adjoining room, but the standard rooms are fine – high ceilings, quiet, good mini bar (not horrendous prices), good sized bath, very hot water, things like bathrobes and slippers available on request, etc, so a good place that really looks after its guests – even English language papers for free in the rack by the lift in the lobby. Thanks for a lovely stay Kronprinz!", "Date": "November 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "la rippe", "Title": "“small gem hidden near the Kurfürstendamm”", "Author": "ittagub", "ReviewID": "UR120220627", "Content": "The hotel Kronprinz was an eye opener. Not only was it within easy walking distance of all the shopping you might wish for on the K-damm,it is right opposite the S Bahn. It is a Romantik hotel since October 1st which means it is in a quiet location with character. We paid 109 Euros for a double room. The room was very quiet,not on the S Bahn side of the hotel and perfectly clean with good beds and a good bathroom with a bath and shower. The reception was very helpful. The entrance is a small sitting room with books and a samovar with tea and behind this room is a bar which was open until late.It has a lot of atmosphere. In the entrance is free internet but no printer. But the hotel could not have been more helpful to print my boarding pass and help with sightseeing and excursions. It is a well run small hotel and with 5 stops and one change on the S Bahn you are in the heart of the city. The breakfast was excellent with lots of fruit and fresh cheese and kind service.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“If only more hotels were like this”", "Author": "Roy H", "ReviewID": "UR119603139", "Content": "We wanted a hotel convenient for Tegel airport &within easy reach of the main city.It was a simple&inexpensive bus& U.Bahn transfer to the hotel,which was a 5 min walk from the station & an equally simple bus,train or walk to shops& attractions.The attractive hotel is in a quiet leafy area.It is very well equipped,very comfortable with very friendly&helpful staff. The included breakfast was excellent in quantity&quality &served by friendly& helpful staff. The reception staff were extremely helpful, with advice, instruction& suggestions on what to see & how to get there. It was altogether a pleasure to stay. We are very widely travelled & considered this hotel to be very good value & would certainly stay again if in Berlin.", "Date": "October 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "St. Petersburg, Russia", "Title": "“Next to Messe and to Ku-damm”", "Author": "Abyrvalg_SPB", "ReviewID": "UR115952622", "Content": "Really great location: 10 minutes by feet to The Messe and same distance to the Luxury shops at Kudamm. Attractive historical hotel with real charme. Nice rooms. Rich breakfast. Clean & safe. Value for money.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Great hotel!”", "Author": "tonibologna14", "ReviewID": "UR115444498", "Content": "We were really happy with this hotel. It was very nice and the room was big compared to how rooms usually are in Europe. The breakfast was also great! The only reason I didn't give it five stars is because it did not have AC, which during the night was not a big deal, but the room got pretty toasty during the day. One other reason for the 4 stars is because the internet costs a nice chunk of change and only one person can be logged in at a time for each individual room. Besides that, it was really a great hotel and in a wonderful location!", "Date": "July 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great Spot. Great Breakfast”", "Author": "2NCaliftravelers", "ReviewID": "UR115005080", "Content": "Excellent price, friendly & professional staff. Showers a bit small & hard to manage. Breakfast buffet could sustain you all day!", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Saffron Walden, United Kingdom", "Title": "“Nice business hotel, walking distance to Messe Berlin”", "Author": "Orchytech", "ReviewID": "UR113592918", "Content": "Nice clean room and friendly staff. No air-con in the room but quite enough area to sleep with the windows open.", "Date": "June 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Blackburn Lancs", "Title": "“Character & service”", "Author": "roverbiff", "ReviewID": "UR98251411", "Content": "Stayed here from Monday to Friday and found the hotel to be very good for us,plentiful breakfast,decent size room and a friendly and helpful staff.The room would have been better had it offered tea & coffee making facilities but otherwise it was a very pleasant place to be. The location was good for us as we like to walk to get a feel for the city and it took us a 30 min stroll to get to the zoo from the hotel,it could be done in 5 mins on the train and the station is just over the road. The reception has free internet use and the bar prices are quite reasonable,all in all a good hotel with character.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“dont stay here”", "Author": "francesca27", "ReviewID": "UR73243906", "Content": "stayed here 3 nights. its too far out, too near the railway line so very noisy, no air conditioning,and drains or bad smell nearby. no shampoo, shower head kept falling off the wall. Safe in room which didn't work, no tea or coffee, very small room.... this is supposed to be a 4star hotel. also room stank of smoke , but guess what, when we complained they were sorry but couldn't do anything about it ,all full.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Charmful hotel”", "Author": "Basilia", "ReviewID": "UR69646863", "Content": "This is a hotel with personality and a homely atmosphere. The reception area is library-like with bookshelves, and free tea is served (self-service) in the afternoon (ice-tea in our case, as it was hot outside). You get a real key (not a card), and the furniture is old style - sometimes a bit worn, but for me it was part of the atmosphere. We stayed two nights in one of the romantic rooms on the fourth floor. This room had A/C, which made the room cool and fresh without noise. The room faced the S-bahn, and it was heard but it did not disturb us much. Perhaps bring earplugs if you are a light sleeper. Our room had a balcony, which was very nice, but it could have been better furnished (had only two chairs and no table). The balcony did not have much of a view, but there was a huge tree just outside with birds singing, so it was a nice place to take a drink in the evening. Both the room and the bathroom were of a good size, and the bathroom was modern-looking, tiled with a bathtub and decent water pressure. Amenities (soap, nail kit, shower cap, shower gel, body lotion) are provided, and a range of other amenities are provided free upon request. There is information in the room about the services and amenities available, and they are quite generous, but, importantly, you may have to ask for things that happen or are given automatically in other hotels (such as shampoo and change of linen). Check this information or you may be frustrated. The minibar is very decently priced (for example, 0.5 l beer is 2 euros), and so is the internet (24 hours for 5 euros, worked very well). Free internet is available (one computer) in the reception area. The breakfast is fine, but not excessive (four kinds of bread, scrambled eggs, sausage, one type of cheese, two types of ham, salami, fruit salad, two types of yoghurt, salmon, cereal bars, fruit juices etc). Coffee, tea and hot chocolate is served at the table and the coffee was very good. Staff (both in reception and breakfast area) was very friendly and helpful. The hotel has a small garden and a few tables and chairs where you can sit outside. The area where the hotel is located is rather charmless, but there are a few shops, cafes and restaurants. The hotel is not within reasonable walking distance of any of the areas that tourists normally visit, but S-bahn Halensee, and buses 19 and 29 that take you to Gedächtniskirche/Zoo in less than 10 minutes are less than five minutes away.", "Date": "July 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "mumbai", "Title": "“Ideal only for Messe”", "Author": "satana66", "ReviewID": "UR68792007", "Content": "From Dortmund proceeded to Berlin for ITB event. Since I wanted a hotel close to the Messe (as u get tired visiting any trade fair and also in March its vvvv cold), The Hotel Kronprinz was suggested. From Hauptbahnhof u have to change twice to reach the hotel. But once you reach the hotel its conveniently locted - just 200 mts from the Halensee S-Bahn (city rail) station. Though the hotel is beautiful and was told very old the rooms are very small. The lobby is quite decent (and they have one computer with free wi-fi). In the evening they offer free Tea and Sherry. The only advantage that i found was that the ICC-Internationales Congress Center and MESSE BERLIN are within walking distance (15 minutes).", "Date": "June 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Quietly efficient”", "Author": "Cobh18", "ReviewID": "UR65454312", "Content": "We found the hotel, surrounded by horse-chestnut trees in bloom, to be pleasant. Handy for S-bahn and bus. Clean, and tidy although a little old-fashioned in the bathroom. Very good buffet breakfast: cheese, cereals, scrambled and boiled eggs, smoked salmon, ham, assorted bread, fruit salad, yoghurt etc. Staff were friendly and helpful. The room we had was 2nd floor, over the front garden. Downsides were light pollution from external facade lights, so curtains had to be kept closed at night, and lack of air-con. It might have been noisy from guests on the little bar terrace, but not a problem for us.", "Date": "May 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great price and value--mediocre location though.”", "Author": "moolie_loo", "ReviewID": "UR65417746", "Content": "For €42/night (breakfast buffet included) I thought I was in heaven when I arrived at Kronprinz. Although no 4 star, the hotel itself is a solid 3 star. Everything was clean and although the room was small, it had everything that you would expect: table and chair, tv, safe, small fridge, closet, phones, etc. For a single traveller, the room size did not bother me but I can see how it can be a tight squeeze for couples. The staff and breakfast buffet was also fantastic. There is a complimentary computer in the lobby for guest use too. I thought this was a great feature for me. My only complaint would be the location. Although it is close to S-Bahn Halensee, you would always need to transfer at least once to get to the main sights in Berlin. This was kind of annoying after a long day of sightseeing. But then again, for €42/night I thought it was still a good deal and the advantage of staying so far away from downtown Berlin would be that it is super quiet at night.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Germany", "Title": "“Fantastic location, friendly staff!”", "Author": "Julie509", "ReviewID": "UR58033573", "Content": "A small, charming hotel. Very centrally located, just a 3 min walk from a main bus stop and an S-Bahn station, with easy links to everything! The staff were very friendly and nothing was too much trouble. We'd asked for adjoining rooms to be near our teenage children and that was easily arranged. Afternoon tea and sherry in the lobby was a quirky touch which we thoroughly enjoyed! Would definately recommend it if you like a quiet, family atmosphere.", "Date": "March 8, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Montreal", "Title": "“Beware of misleading star ratings!”", "Author": "MontrealSheila", "ReviewID": "UR47237925", "Content": "2 stars, probably, 3 - on a dare - 4- no way!! Uncomfortable beds with poor quality linen, lumpy pillows, bathroom built for lilliputians, bar closed most evenings in spite of posted hours, this hotel really did not reflect its website description.", "Date": "October 19, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "England", "Title": "“Should not be a 4 star hotel”", "Author": "traveller_lf", "ReviewID": "UR36486304", "Content": "I stayed here for three nights in July. The hotel is far below the standards of any four star hotel I have stayed in. I would describe it as a basic three star hotel, at best. The rooms are very basics, although the bathrooms are somewhat better. Almost all of the facilities one would expect from a four star hotel are missing. There is no room service, no porter and no restaurant. The breakfast buffet is also very simple. The staff was friendly enough. You can get much better for your money in Berlin.", "Date": "August 2, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Arnhem, Holland", "Title": "“Where is the Kron of this little prinz?”", "Author": "Basawake", "ReviewID": "UR23899314", "Content": "Me and my girlfriend stayed in this hotel for 2 nights to spend some time in Berlin. From outsite the hotel looks very adorable and romantic. A parking place can be found in the street of the hotel. There were not enough parking places when we arrived. The lobby is pretty simple end the staff was okay, but nothing special. We booked a room via a hotel website. We saw on the website of the hotel that a couple of rooms had a (romantic) theme. We, however, had a 'standard' room. I wich we didn't!!! It was a poor room, with old furniture, a poor bed and a crappy bathroom. For a 4**** star hotel, with rooms that (on pictures on the website) looks marvelous the diffrence to the standard room was to big! Our remote control (of the TV) broke during our stay. We did get an other one..... the next day! Poor service. The breakfast was okay, but nothing special and for a 4**** hotel not even average. The city Berlin is worth a visit. You can take the subway, just 200 meters from the hotel, witch is a big plus! I recomment to hire a bike if the weather is nice.", "Date": "January 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“Charming hotel with friendly staff”", "Author": "S1088815", "ReviewID": "UR23499931", "Content": "Very friendly staff, good location (the s-bahn station Hallensee is within 2 mins walking distance), good breakfast + other nice extras (eg donut on New Year's Eve after we came back from the city centre, glass of Buck's Fizz with our breakfast on the morning of 1 January), beautiful characteristic building and rooms. I would have liked it if the rooms would have had tea/coffee facilities, but the rooms didn't have these facilities. I read on Tripadvisor that some people commented on the noise of the nearby s-bahn. Although you can hear this, it's not constant and if you do hear it it's very much in the background.", "Date": "January 12, 2009"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "ayr scotland", "Title": "“Prinz turns out to be a frog”", "Author": "Muirpik", "ReviewID": "UR20215876", "Content": "my wife and I searched this hotels website and it looke lovely. On arrival we were given a small pokey rom with a smell of drains right next to a main railwy junction. I was awakened by trains at four am and a train went over the points every two minuites after that. We complained and were moved to a smaller room above the bins. The shower room was about five feet by five with an even more smelly drain in the floor. there was one lamp on the wall above the bed suggesting it was realy a single room. It was quieter but nothing like the rooms on the hotels own website. I brought this to the hotel manager who said that these rooms did exist! He did offer a second move but I thought three moves with no guarantee of improvement was a waste of time. We liked Berlin but I would be wary of the star rating system. This four star room would not be acceptable in a half decent bed and breakfast in my opinion. I had paid in full at the time of booking in May which is the only reason we stayed. So beware of this too.", "Date": "September 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bristol", "Title": "“Had a lovely stay”", "Author": "Densley", "ReviewID": "UR13731094", "Content": "Have just spent four nights at the Kronprinz and really enjoyed it. Would echo much of what has already been said, although a little out of Berlin it is served by several u and S Bahn lines including the S41 and S42 which are circle lines covering a hugh area of Berlin, travel from the hotel is extremly easy making its quite location no problem and something of an asseet. On arrive at the hotel we were greated by name, all staff were very friendly and what was nice was we saw the same faces over all of our stay. Most staff had good levels of English, perhaps a problem as we really wanted our eldest daughter to practice her German!!! The hotel was extremely clean and comfortable, it is furnished in an older style so may not be to the liking of some travellers, this reflects the age of the building having been built in the 19th Century. Our room did not have A/C but would note that the area is quite so windows can be opened. One note of caution which has not been whooly made clear in previous posts, the hotel only serves breakfast - which was very pleasant, and no other meals. There are many eating places locally and eating out is not that expensive in Berlin. Also if you enjoy sitting in hotel bars, especially at weekends, this hotel may not be the one for you as its bar is only open on weekdays, although drinks can be purchased via the night staff. Please read the hotels website, it reflects accurately what the hotel has to offer. We had a lovely stay in Berlin, it is truly an interesting city and one well worth visiting, our stay was enhanced by a pleasant hotel. If we were to return to Berlin we would happily stay in this hotel again. If you would like to contact me for further details my email address is christaylor@blueyonder.co.uk. Chris Taylor Bristol England", "Date": "February 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stamford, Connecticut", "Title": "“Enjoyed the stay”", "Author": "pragueresident", "ReviewID": "UR7728657", "Content": "Stayed there for a weekend trip. We drove to Berlin. Ample free parking outside the hotel. he hotel is in a quiet street but very close to public transportations. We didnt drive around, we took the bus to explore the city. The staff is friendly and helpful. Nice breakfast. Clean room and really nice and spacious bathroom. Only note of caution, the room did not have any ac. So in summer months might be a problem. Otherwise highly recommended.", "Date": "June 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Trinidad", "Title": "“Great Hotel”", "Author": "TT-Traveller", "ReviewID": "UR5495385", "Content": "We stayed here for two nights during the World Cup last month. I was a bit worried about some online comments I had read about this hotel being out of the way. While it is located in a quiet neighborhood on the Ku'damn the great German public transport system (Die Bahn) makes this a non-issue. Its practically across the street from Halansee station so you can get around quite easily. There was also regular bus service right outside the hotel on the Ku'damn. There are many restaurants and bakeries close-by in walking distance. I would recommend ArayaThai-excellent Thai food just down/across the street and there was also a Greek restaurant that opened late and served huge portions (Sorry I forget the name now). Lots of little bars and shops around as well. The hotel itself was very cozy. The rooms were a little larger than in other European countries but still not large as in the US. The neighborhood was indeed very quiet. The staff all spoke fairly good English and was helpful and very accommodating. I don't recall the rooms being air-conditioned. We slept with the windows open and that was fine. The breakfast was quite assorted-sliced meats, bread, eggs, cereal, sausages (of course) & fresh fruit. No complaints here. I would definitely stay here again or recommend this to someone looking for a quiet hotel in Berlin with some \"old world\" charm.", "Date": "July 22, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Milwaukee, WI", "Title": "“A very pleasant place to stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR3445914", "Content": "I'm late in comenting on our stay at the Kronprinz since I have just discovered TripAdvisor. But we were so pleased with our stay there last summer that I want to encourage others to try this hotel even though it may seem out of the way. This was our first trip to Berlin, and I nearly cancelled our reservations when I realized how far from the main sites it is; that would have been a bad mistake. With Berlin's great user friendly transport system nothing is far away; the Kronprinz is less than 5 mins from the U-Bahn station and from a bus stop where busses to all parts of the city stop every few minutes. Though cabs seemed readily available, we travelled everywhere, night and day, by bus or train. So don't let the location deter you. It is actually an advantage to be away from the more hectic areas, and there were a number of restaurants within easy walking distance. As for the hotel itself, we had an very pleasant room -- adequate size PLUS a sunny alcove with chaise, table and chairs. Bath was smallish, but modern and clean. The staff was very helpful and friendly.", "Date": "May 6, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "netherlands", "Title": "“nice and cozy hotel”", "Author": "paul_nl", "ReviewID": "UR1134341", "Content": "This hotel is located at the end of Kurfurstendam in a quiet neighborhood. Public transport and expressway are nearby. Excelent, friendly service. Comfortable rooms, clean and tidy with all the needed amendities. Good but not to extensive breakfast buffet.", "Date": "July 10, 2003"}], "HotelInfo": {"Name": "Romantik Hotel Kronprinz Berlin", "HotelURL": "/ShowUserReviews-g187323-d199391-Reviews-Romantik_Hotel_Kronprinz_Berlin-Berlin.html", "Price": "$96 - $261*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Kronprinzendamm 1</span>, <span class=\"locality\"><span property=\"v:postal-code\">10711</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "199391", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/c2/6a/d7/aussenansicht.jpg"}}