{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gothenburg, Sweden", "Title": "“A friendly hotel with great location”", "Author": "Larzon67", "ReviewID": "UR127531687", "Content": "Castor The Vine might not look too impressive from the outside, but we never wanna stay somewhere else in Berlin. The value for money is excellent, rooms are clean, beds are comfortable, bathrooms are modern etc. But the best thing about Castro The Vine is the very friendly and efficient staff. Always serviceminded and greeting you with a smile. The hotel is perfectly situated in wonderful Schöneberg, probably the best part of Berlin. Definitely coming back!!!", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Super choice for a budget hotel in Berlin”", "Author": "Nelsontouch", "ReviewID": "UR127156813", "Content": "My room was nicely decorated in modern style. Staff friendly and helpful. Breakfast better than in a much more expensive hotel in Zurich the night before. Excellent location both for sights within walking distance and bus/subway. Handy to a variety of good restaurants. Gay friendly, but mostly straight clientele -- neither team should be scared away. And very reasonably priced.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "bristol, uk", "Title": "“Good location, average hotel.”", "Author": "quinnmedicineman", "ReviewID": "UR126623074", "Content": "A reasonably priced, basic 3 star close to the Ku'dam. Rooms are basic but clean (superior room). The beds are uncomfortable. Breakfast was ok. Staff were efficient but certainly not friendly. Our request for a late checkout was refused which was very irritating.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellently sited Hotel”", "Author": "Nash29London", "ReviewID": "UR126456387", "Content": "I usually stay at a well known 5 star hotel when in Berlin, but this time opted to stay at the Castor at the beginning of March for 4 nights; I was more than pleasantly surprised! The location is excellent, only a short walk to the KaDeWe department store and the rest of the Ku'dam. The rooms were well appointed, clean and more than adequate. The bar doubles up as a breakfast room /restaurant and is a beautifully warm and cosy meeting place. Breakfast is generous and more importantly, the selection is broad and all products of 1st class quality. A wide selection of wines and drinks is available in the evening. The real bonus, however, is the staff - rarely have I had the pleasure to deal with such genuinely dedicated and educated staff - nothing is too much trouble for them. I even had the pleasure of meeting the Hotel's Manager and it is obvious that the whole tonality of the service is emanating from her! Definitely a firm favourite for me in Berlin from now on! I would also highly recommend a visit to an excellent Italian restaurant just up the same street (approx 200metres) called the \"Trattoria a' Muntagnola\" - a genuine Italian restaurant.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sao Paulo", "Title": "“Nice hotel, close to bars in Schonenberg”", "Author": "docarva", "ReviewID": "UR124719266", "Content": "I stayed there just one night and seemed to be a nice hotel, well located near Motz Strasse, close to the bars in that area. It is a good option.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Well worth it!”", "Author": "Markiebhoy", "ReviewID": "UR123077888", "Content": "Very pleasant hotel. Clean, friendly, modern and quiet. Lovely breakfasts with friendly staff. Very good selection of surrounding restaurants. Only thing missing is a kettle in the room for some tea, minor detail. Do try Maharadscha(Indian) 2nd oldest Indian in Berlin and on the same street!! 179m away! Brilliant. Definately worth the stay! :->", "Date": "January 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Good location, loud heating”", "Author": "Mark L", "ReviewID": "UR121510128", "Content": "We booked this hotel online because it seemed like a good deal - good location and very cheap parking. However, we did not like our room - it was very plain and cheaply decorated. The worst thing about the room was the heating - when you turned it on, it made very loud sounds non-stop: we had to use the earplugs to sleep in order to filter out a sound that was not coming from the outside, but from the inside of the room! I don't think that is befitting of a four-star hotel. The bed and the bathroom were the highlights of the room. We did not have the breakfast. Overall, we would not book this hotel again, especially in the winter when you need to turn the heating on.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stoke-on-Trent", "Title": "“Christmas Markets”", "Author": "KeithandMeg", "ReviewID": "UR121450907", "Content": "We have just returned from a short visit to the markets and had a very comfortable stay at Castor the Vine. The breakfast was excellent with a good choice and served in their bar area. We used our Air Miles for this trip so don't know the actual cost of staying but would consider returning and paying ourselves if the price was right", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“A great hotel in a very good location”", "Author": "MogirlLondon", "ReviewID": "UR121059060", "Content": "A really good hotel within about 7 or 8 minutes slow walk to KanDeWe [which is also, by the way, where you can catch one of the several hop-on/hop-off sightseeing bus tours] as well as the U-bahn. Many public transport buses stop at the end of the road. The hotel also has several good restaurants close by. The Hotel Castor the Vine feels incredibly comfy, safe & very very friendly, plus it has free wi-fi in all the rooms - can't be sneezed at :) We had a twin room which was more than big enough for us & the 'wet room' type bathroom was lovely. The room was cleaned daily & was always spotless for us returning. All the staff were friendly & professional and we couldn't recommend this hotel highly enough.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wigan, United Kingdom", "Title": "“Excellent Value”", "Author": "davidcalderbank", "ReviewID": "UR120012908", "Content": "Nice hotel rooms were clean, free wifi which is always a bonus, I only booked room only but was asked if I wanted breakfast for €11 the breakfast was first class the staff always friendly with a smile.... the hotel is only a few minutes from the bars and the shop would definitely stay there again", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Good value and location”", "Author": "Toronto_Frank", "ReviewID": "UR119621226", "Content": "Nice hotel, the staff was pleasant and helpful. Close to one of Berlin's Gay districts so convenient to bars and restaurants. Within a 10 minute walk of KaDeWa department store as well. Rooms were clean and even if a bit on the small side a good value for the price. WiFi worked well for our whole trip, just had to ask for a new password after two days. The only issue was there is only a duvet on the bed which was way to hot even for the cooler evening in early September.", "Date": "October 23, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Nice place, great location”", "Author": "Robdo020", "ReviewID": "UR118082842", "Content": "Castor the Vine, centrally located in one of the gay areas in Berlin. Close to nice bars and restaurants, close to the underground station Nolldendorfplatz. Tolerant atmosphere, nice staff, nicely decorated rooms. The only disadvantage is the size. Rooms are ok, but could be a little more spacious, bathroom is small. Good breakfast, we will definitely come back!", "Date": "September 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "", "Title": "“A disappointment”", "Author": "Joolsey", "ReviewID": "UR108759777", "Content": "This was a return visit to the Hotel Castor. We had enjoyed our first visit a few years ago but this time I was really disappointed. It started with the brusque rude non-welcome we received when we arrived. No receptionist at any time in our three day stay was in any way helpful. In fact on one day we had our door key thrown at us when we returned. they tried to charge us for breakfasts we didn't have.(One day we couldn't even get a seat in the breakfast room it was so crowded). We were so disappointed.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Stupid name ~ Great Hotel”", "Author": "Ezpez", "ReviewID": "UR106827397", "Content": "Excellent reception staff, helpful and cheerful. Free German newsapers in reception. Room was spotlessly clean, as if I was moving in fresh everyday. Although on my own always had two fresh hand and bath towels everyday. Excellent mattress but would have appreciated more space to move around the bed. No air-conditioning so room was stuffy unless window left open, fortunately excellent warm weather during the whole stay. Bathroom - excellent. Walk in shower, no annoying cabinets or bath to cope with. Water VERY hot. Plenty of shelving for toiletries. Good sized wardrobe with folding doors. Window gave good view up street which was generally quiet. Excellent location for trains and shops. Problems with internet access but eventually sorted out. Would stay again", "Date": "May 4, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "dublin", "Title": "“MUSTY”", "Author": "GenuineJudge", "ReviewID": "UR98136644", "Content": "This hotel is located centrally for the wittenberg and nollendorfplatz stations however be aware that the rooms are very musty ,, lack of ventilation and a no no for anyone with a breathing or chest problem..Each morning we woke with dry throats as if the room was full of stagnant smoke ..i guess the rooms vents are linked. Reception was ok..efficient apart from one staff member who appeared rude and bothered with every dealing with keys etc.Manager please have a talk with your staff on people skills.Its very dated and the rooms especailly the beds are very hard and the pillows uncomfortable. The cleaning staff are excellent and the rooms are immaculate..The hotel is also quiet howvwe it needs a total overhall. Its cheap to stay in but health is more important. Oh and i was shocked literally so many times by static within the building,,,maybe its all the carpet!!!.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "scotland", "Title": "“Good Budget Hotel”", "Author": "eoireitum", "ReviewID": "UR97612240", "Content": "This Hotel is a good base to use for exploring Berlin, it is near to two U Bahn (underground) stations which are only one or two stops from the S Bahn (overground) trains. The Hotel is on a quiet street so very little traffic noise. The rooms are on the small side but i do expect this in a city Hotel anyway. I never used the restaurant or bar so cannot comment on that.", "Date": "February 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oxford", "Title": "“Clean, stylish,central, and quiet”", "Author": "Wenters", "ReviewID": "UR92592923", "Content": "A good location for sightseeing, only a short walk from the underground, and in a quiet street, not far from the zoo and the Tiergarten. Good breakfasts and pleasant bedrooms.", "Date": "January 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Constanta", "Title": "“Quiet”", "Author": "latalay", "ReviewID": "UR73304048", "Content": "It was a clean, and quite hotel. Close to one of Berlin city centers (as we figured there is more than one). Breakfast was good. They had wifi. Payed extra for parking. It was okay for its price. Only in this hotel among ten other hotels in other countries we were asked to pay in advance for the stay.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tucson", "Title": "“Wonderful hotel!”", "Author": "Larry 69", "ReviewID": "UR72560333", "Content": "Although the rooms are small, the hotel is a delight in every other way. The buffet breakfasts were literally gourmet; the staff were helpful to say the least; the location is superb, near bus stops and the U-Bahn, as well as KaDeWe the famous shopping and gourmet food emporium.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "East Sussex", "Title": "“Great budget choice”", "Author": "EastSussexToad", "ReviewID": "UR55725479", "Content": "A nice, small hotel, well located for the public transport network (as Berlin is so huge you have to use public transport just to get about). Helpful staff. Good breakfast with plenty of choice, but only worth the 10 Euro if you want to \"fill up\", otherwise there are plenty of places for a coffee and something to eat for less. Extremely reasonable room rates for a big city - we paid just 50 Euro/night, excluding breakfast. Based on our experience, recommended.", "Date": "February 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Leicester, England", "Title": "“Excellent all round as a short break hotel”", "Author": "suliz", "ReviewID": "UR52684912", "Content": "Position, service, cleanliness - all round excellent. Short walk from KaDeWe, Berlin's premier dept store on West side of Berlin, 2 mins from buses and 5 from UBahn (Wittenberg Platz). Can walk to Zoo and catch bus 100 that takes in all the big sights on its way over to the East side at Alexander Platz. Piece de resistance - the breakfast, 4* including smoked salmon and caviare on two days out of the four we were there. Only downside, WiFi bit temperamental in our room on 3rd floor but excellent in Reception. Highly recommended for City Break.", "Date": "January 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“great value for money”", "Author": "JintyLondon", "ReviewID": "UR47584656", "Content": "we stayed here during the athlectics world championships and the hotel was ideal for us. Facilities good and clean, staff friendly and helpful, excellent transport links and walking distance to the Tiergarten and to the main city sights.We didn't have breakfast as there are so many cafes so close by. Great location in an interesting part of the city. Highly recommended.", "Date": "October 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Liverpool", "Title": "“Well run - Very clean hotel”", "Author": "alwaysowen", "ReviewID": "UR38560024", "Content": "We spent three nights at the castor and could find very little fault. Its a fairly small hotel situated in a side street about a ten minute walk from the town centre. Everything is scrupulously clean and well run. Our room was very clean, neat and tidy, slightly on the small side but perfectly adequate for our stay. The reception area is quite small but very well run, the reception staff speak exceptional English. The breakfast was the usual continental style, but there was a reasonable choice which included sausages and scrambled eggs. The dining room is really cosy, we went just before Christmas and it looked lovely with its Christmas decorations. It gets quite busy at certain times, you may have a short wait for a table. Houskeeping is extremely efficient as is everything else here, its all run like clockwork. The hotel does have a bar which which closed around midnight. There is a number of bars in the vicinity, there is a really nice one just opposite where the prices of the drinks are really reasonable and it stays open into the small hours which is useful to know as the prices of drinks can be quite expensive in Berlin. We found the best way to see Berlin was on a 'Viator' Walking Tour - definatley NOT recommended however if you're bad on your feet.. We booked online just before we went the prices are really reasonable. Just Google Viator to find the site. The guide was first class, we saw everything there was to see, it was the highlight of our holiday. To sum up, we loved Berlin and we loved the Castor and we will definatley be returning soon The Castor is ideally situated for the Christmas market at the Kaiser Willhelm Memorial Church and also the main shopping area. The Irish Bar in the main shopping mall seems to be where everyone goes, they have bands on every night, the ones we saw all sang popular English and American hits, particularly the Beatles.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Somerset", "Title": "“Nice place, a little out of town”", "Author": "rhcoleman", "ReviewID": "UR36960295", "Content": "Nice clean hotel. Good value for money. Helpful staff, good facilities. Only slight downside is that it was a little way from the tourist parts of Berlin although a underground station is just up the road. It should also be noted that it seems to be in an area that has bars etc that are aimed towards same sex couples.", "Date": "August 7, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "berlin", "Title": "“disgrace”", "Author": "legaltraveller1", "ReviewID": "UR20417951", "Content": "We reserved four months in advance and the hotel still managed to double book us. They refused to find us a replacement hotel in the neighbourhood; the replacement hotel they found us was on the outskirts of town. They did not make any real effort either to try and resolve the situation and found the situation quite amusing and worthy of laughter. They also lied about the availability in our hotels claiming there was no free rooms anywhere in the whole of Berlin because of a trade fair, clearly this is nonsense. They manager was also threatening and curt and lied that they tried to contact us prior to our arrival We do not recommend staying here and suffering the same ordeal as we did. Totally unprofessional and untrustworthy.", "Date": "September 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ayr, United Kingdom", "Title": "“luxury basic”", "Author": "looney45", "ReviewID": "UR16959119", "Content": "Stayed for a week in this hotel and found it one the best that i have stayed in. All the staff are very friendly and their English is very good, with the rooms being very well maintained The location was good with the main shopping area a 5-10min walk away, would recommend this hotel for a shopping trip to berlin!", "Date": "June 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“A good stay”", "Author": "JulesmoLondon", "ReviewID": "UR16403422", "Content": "This was a small clean hotel with helpful friendly staff. The rooms were not huge or glamorous but had all that you would expect from a three star hotel. Everything was clean. The breakfasts had a good choice of foods. The location was in a quiet area but near enough to everything. I would stay here again.", "Date": "May 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Minneapolis", "Title": "“Ok hotel”", "Author": "DanielMinneapolis", "ReviewID": "UR14506875", "Content": "Very nicely located. Nothing really special about this hotel. I arrived about 1 hour early than check in time. waited in lobby for my room. Wanted to use my laptop found without US power adaptor, Front desk lady first says no more adaptor. Asked repeatedly and played miserable, she came up with one (sigh!). And maybe, just maybe it's coincident, right after I tip her, she told me that my room is ready (hmmmmm) Hotel doesn' allow un-registered guest coming at late night, even with your company. I have no proble with that rule and actually apprecite it's effort for security. But wish they publish their policy somewhere for traveler. Decided to check out earlier. was acommodated without panelty. Thanks. Special thanks to Victor, the blond 20s front desk person tried to help me find point of interest . Very nice Breakfast. Will consider stay again only if hotel allow bring guest in. (for security, hotel can have that person's ID documented, you can't just flatly say no without warning)", "Date": "March 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "guernsey", "Title": "“Fantastic stay”", "Author": "GuernseyCharlie", "ReviewID": "UR11708054", "Content": "We booked the Scandotel Castor for a weekend away to see the xmas markets in Berlin, and the trip turned out to be one of the best weekends way we've ever had. In particular, the hotel was extremely good value for money, clean, well furnished, excellent (english speaking) ever helpful staff, good food and located 5 minutes from the main shopping area and city parks and only 10 minutes by taxi from the Brandenburg gate and other historical attractions. I thoroughly recommend this hotel.", "Date": "December 20, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Epsom, England", "Title": "“Warm and quiet”", "Author": "craftyketley", "ReviewID": "UR11669573", "Content": "Completely agree with most of the other reviews. Room wasn`t huge but perfectly adequate and very quiet. Charming staff on reception and in the dining room for breakfast which had a good selection of cold meats and cheese and a small selection of hot food. Strangely only coffee was offered, you had to ask for tea but it wasn`t a problem. Rather than take a more expensive bus tour we used the 100 and 200 public buses which visit most of the tourist attractions. The hotel sells a small leaflet which gives details. There are several reasonably priced restaurants nearby of different ethnic origins. Altogether a really good place to stay and not too costly.", "Date": "December 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Basingstoke, England", "Title": "“Great Hotel & Location”", "Author": "Maxie_7", "ReviewID": "UR11202665", "Content": "We booked our 3 night stay with direct line city breaks on line. The Airline was Easyjet. The Hotel doesn't look much from outside but what a gem! rooms were clean and comfortable all recently refurbished. Breakfast was good as well alot of choice and you can eat as much as you can, sets you up for the day! The only thing the rooms could do with is tea and coffee facilities, but it has a mini bar to put your own drinks in. There is a hairdryer in the bathroom which is really good so don't take your own like i did. We got the train from Shonefield airport which took an Hour i think it was the S9 train cost 5 euros for 2. Also you can buy a 3 day travel card for 20 euros (2 people) that covers the underground (U-Bahn) and the overland trains the S-Bahn so a real bargin. They fine you 40 euros if you get caught with no ticket so worth gertting one. We had over meals at a place called the 60's diner near the Nollendorf U station and very cheap at 8 euros for a good dinner. We did most of the sites but be ready to que for about an hour for the The Reichstag and the TV Tower, we went to the tower on the monday morning so it was less busy and went straight in at 10am and what a view over the city, be prepared to pay 8 euro's for 2 coffee's in the cafe at the top!! Very expensive but enjoyable as it turns twice an hour and you get a great view of the city. The main shops are closed on sundays so don't' plan to go shopping on that day like we did!! I would suggest to buy a good guide book as this helped us to lcoate what we wanted to visit and see. Have a great time.", "Date": "December 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“great location, a fine hotel”", "Author": "GraemeA", "ReviewID": "UR8521020", "Content": "central location at a reasonable price was what we wanted and that's exactly what we got, a very good hotel in an excellent spot. Fuggerstrasse itself is a quiet residential street (apart from a small number of bars & restaurants, most sporting rainbow flags) in two halves, off on a diagonal, we found the hotel easier to get back to by walking along Ku'damm & Tauentzienstrasse past Wittenbergplatz into Kleiststrasse - so all one continuous street, you'll never need to remember the names! - then turning right into Eisenacherstrasse, just past the easy-to-spot Conrad Electronics building. the handful of bars & clubs along Fuggerstrasse are far away enough from the hotel you'd really not know they were there, there's no overspill of people and absolutely no noise, but if they are your thing you're in an excellent place to enjoy. Wittenbergplatz is the nearest subway, less than 5 minutes walk away, and the 7 day market there is opposite the very swish KaDeWe department store - this felt like the start of Ku'Damm, it's shops all the way as far as they eye can see and the legs can walk. hotel was small but perfectly formed, rooms compact but very clean & functional, the breakfast buffet was excellent and the bar cosy. I wouldn't hesitate to recommend this place, or to return, the staff are as friendly & helpful as the area is a joy to walk around.", "Date": "August 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“An Excellent Hotel”", "Author": "PaulaTScotland", "ReviewID": "UR6917893", "Content": "I can't add much more to the previous reviews. Being an avid TripAdvisor reader, I check all the relevant reviews in hotels I'm intending to visit. The Scandotel really is a gem. We stayed for 3 nights 1/3-4/3. It's 5 minutes from KaDeWe store, which is a joyous shopping experience. Go to the 6th floor have a glass of bubbly and people watch for a while. The hotel is in the gay sector and there are lot's of gay bars and shops. We are 3 (straight) ladies and felt completely safe and happy to explore the streets at night. As for the hotel itself, it's very clean and comfortable. Non-smoking rooms are available on 3 floors and yes, the breakfasts are good. Every staff member was extremely helpful, we made good use of them asking for dinner reservations and recommendations. There's a very good trad German restaurant about 10 mins walk away by the name of 1885. The food was excellent and very reasonably priced. I would absolutely recommend the hotel as centrally located, clean and well run. I booked through the hotel website and got 2 doubles plus breakfast for 60 Euros per night. Enjoy your trip to Berlin!", "Date": "March 5, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "St Ives UK", "Title": "“Just the job!”", "Author": "ChrisBStIvesUK", "ReviewID": "UR6730847", "Content": "Stayed in this hotel for 6 nights. Found it to be ideal for our requirements. Generous breakfast, room clean/tidy and well located for public transport links. It is in the middle of a gay area but this caused no problems for us, plenty of restaurants/bars within walking distance. Used train to get to hotel from Schonefeld Airport and then a walk from the local U bahn station. Could have caught a taxi for 32 Euros from hotel to airport.", "Date": "February 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kent", "Title": "“Friendly, Well-presented and Very Good Indeed.”", "Author": "mistressofthekeys", "ReviewID": "UR6448196", "Content": "We read the reviews on Trip Advisor before going to the Scandotel Castor Berlin, so we hoped it would be good, and we weren't disappointed. It's a great hotel with great staff - five stars. It's fair to say that my partner and I are both pretty discerning customers, and whilst the Scandotel Castor isn't on the same scale as the Adlon or Radisson, neither are its prices. The hotel and rooms are clean, modern and well-presented, the breakfasts are plentiful and (more importantly) of very high quality. It's worth looking on the hotel's own website to book, as we booked a Christmas Special offer which included breakfasts, evening meal, welcome gifts & drinks and public transport passes all included in the room rate. The staff speak great English and are very helpful, and don't be put off if the hotel offer (under the 'arrangements' section of the hotel's own website) can only be booked direct with the hotel - I booked over the phone in English, and all my instructions (quiet room, twin beds, non-smoking room) were carried out to the letter. The rooms, whilst not being the biggest, have very comfortable beds and are clean. Internet access is free, the hotel location is very central (especially to the marvellous KaDeWe department store, U-Bahn and S-Bahn), and yet the road where the hotel is has little traffic and so is very quiet. Would we stay there again - you bet. A great little hotel for that city break", "Date": "December 16, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Berlin Delight”", "Author": "Joolsey", "ReviewID": "UR5959752", "Content": "Our three day stay at the Scandotel Castor in Berlin was one of the highlights of a seven week European trip. We had travelled all day by train from Paris then negotiated the new Berlin Haupbahnhof and the Metro system. So we were most impressed by the friendly welcome we received from the staff. The room whilst not huge was more than adequate: the beds soft and comfortable and the bathroom very clean and well supplied with all the necessities. I think the highlight of the stay was the breakfast. An amazing variety of food: cereals, fruit, yoghurt, ham, salami, cheese, a variety of breads etc. etc. Amount and quality outstanding. The hotel is reasonably well situated for Kufurstdam, Zoo station and the amazing KaDeWe department store where I recommend a meal in the top floor Wintergarden Cafeteria.", "Date": "October 16, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“Great, wonderful hotel, staff, location Highly recomended!”", "Author": "RandT", "ReviewID": "UR4725849", "Content": "This was my third stay at the Scandotel in Berlin, I go for the film festival in February and it's so convenient, the U-bahn is a short 3 blocks away and all around me are wonderful restaurants and great gay nightlife. The staff at the front desk who speak good English and very helpful with everything from directions, laundry, sightseeing and tickets for the subway, I could not ask for more. The rooms are very well maintained and kept clean daily by a wonderful housekeeping staff. Rooms are medium size and nice for one or two persons, the shower is a little on the small side for someone over 6 foot with long arms but I managed. Rooms have mini-bars (prices are reasonable compared to most), free wireless internet throughout the hotel. I looked around and for the price I could not find a better value, I paid 60 Euro on the hotels website which did not include breakfast, which is 10 Euro. Enjoy the Scandotel.", "Date": "March 22, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Finland", "Title": "“Great hotel and a location”", "Author": "A TripAdvisor Member", "ReviewID": "UR4563635", "Content": "The hotel is situated very near Bahnhof Zoo -station. It is easy to take a local bus X9 from Tegel Airport. The taxi costs only about 6 euros to the hotel from Zoo and after settled down you can use easily metro/tube and buses near the hotel. The hotel is clean, nice and the stuff in the reception is very friendly. Even the cleaning ladys and janitors were nice and honest: I forgot 50 euros to my bed in a hurry and it was on the table when I got back. I was so happy because for instance In New York somedoby stole one of my jackets from a hotel room. So I have very warm feelings and I surely book Scandotel Castor again. Great hotel & reasonable rates! I almost would have wanted to keep this hotel as a secret, but however, I want to share my nice experience.", "Date": "February 28, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“great little hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4350423", "Content": "stayed at this hotel mid-december 2005,staff very helpfull and friendly,rooms and ensuite bathrooms spotless,good choice of food for breakfast.a short walk brings you to the main shopping area which has a great range of shops,bars and restaurants.my friend celebrated his birthday on the 2nd day of our stay in the hotel and when he went to collect his room key that evening he was presented with a voucher for free drinks at the hotel bar for his party(4),which we all thought was a lovely gesture. i would recommend this hotel to anyone,we all hope to go back to it soon michael and noreen michael and maureen belfast northern ireland", "Date": "January 13, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "co down", "Title": "“enjoyable citybreak”", "Author": "dottydot", "ReviewID": "UR3905780", "Content": "Hotel central to shopping area. Rooms small but clean. Staff very helpful and friendly. Eating out very reasonable.", "Date": "September 15, 2005"}], "HotelInfo": {"Name": "Hotel Castor the Vine", "HotelURL": "/ShowUserReviews-g187323-d199384-Reviews-Hotel_Castor_the_Vine-Berlin.html", "Price": "$91 - $169*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Fuggerstr. 8</span>, <span class=\"locality\"><span property=\"v:postal-code\">10777</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> (Formerly Scandotel Castor Berlin Hotel)</span></span></address>", "HotelID": "199384", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/d3/b8/78/check-in.jpg"}}