{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Waregem", "Title": "“Very good hotel for family with kids”", "Author": "stevawin", "ReviewID": "UR128099755", "Content": "We stayed in a large family room (duplex). This was perfect for us and our 2 kids. Hotel is clean and breakfast is perfect with a lot of choice. Spa area is small but clean Quiet area with a very good German restaurant (Paulaner) nearby. Good location !", "Date": "April 18, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Scotland", "Title": "“Superb hotel”", "Author": "Marcus9000", "ReviewID": "UR127736556", "Content": "Stayed here for 3 nights after a European tour, and it was thrust the thing for all of those creature comforts one misses. Hired bikes from the hotel to go see the Olympicstadion and this was very cheap. Hotel a short walk (10 mins max) to the metro and not far form the zoo (tier garden). Really would recommend this hotel to any visitor in Berlin.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zwolle, The Netherlands", "Title": "“Excellen stay in Berlin along the Spree”", "Author": "chrissassen", "ReviewID": "UR126478893", "Content": "We stayed there with our family in a family room (duplex situated in the basement, not a fantastic view, but very quiet), having already been there for a seminar (in a room with view on the river, which is wonderful). The hotel is nicely situated in a quiet environment along the Spree, not too far from a tube station or if you want to walk it's in walking distance (one hour) to the Reichstag or the park. Good breakfast buffet, restaurant of the hotel is also nice, has good German wines, funny crooner singer (second degree), nice Gym too (well don't expect a 1000 sqm hall). Quite enjoyable to relax on the terrasse along the river, savour a coffee in the morning or a good beer at night.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "yorkshire", "Title": "“Stay There !!!”", "Author": "sideburnsdave", "ReviewID": "UR124752765", "Content": "A superb hotel situated on the waterfront. Only 5 mins walk from S bahn Belle Vue and one stop from Berlin hbf. All the hotel staff that i spoke to were really helpfull and friendly. The hotel is on the site of the original city dairy and reminders of this can be seen throughout the hotel with some really interesting photographs. The breakfast room was a great setting to enjoy an excellent breakfast, this was really well organised by the attentive staff. The room itself was very good and you could hear no noise from any of the other rooms or the corridor outside. I would recommend this hotel. From the hotel you can walk to the market hall (markt halle) on Arminiusstrasse in about 10 mins. This is a small artisan based market, including Brewbaker Hausbrauerei, in a gem of a building and is open til 20.00.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Hotel on Spree River near Brandenburg Gate”", "Author": "john_mcp_10", "ReviewID": "UR120950558", "Content": "This was an excellant hotel in terms of the room, breakfast and location. Room - We stayed in a triple standard room which was actually on two floors with a spiral stair case leading from one room to the other. This gave a nice spacious feel. Clean, comfortable and modern. Breakfast - This was first class and went beyond the usual continental arrangement. There were cold meats, rolls, cheeses, etc, however in addition there were hot foods including scrambled egg, sausages, bacon, etc all included in our B&B room rate. Location - Attractive location on Spree River, about 20-25 mins walk from the Brandenburg Gate, Reichstag. Very nice local retsaurant/bar, Paulaner's im Spreebogen, just along from the hotel, 10-12 euro's for main course in large portions.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Best hotel breakfast ever!”", "Author": "coby3", "ReviewID": "UR119208395", "Content": "There are many good things you can tell about this hotel, but the choice of breakfast exceeds any 5* hotel I've been to. You must try it before you can believe your eyes. The price is reasonable, especially for groups and pre-booked business travel. The location isn't all that central, but it's well linked by public transport and not far from Tegel airport (taxi about EUR12). The rooms are spacious and most of them fully equipped and furnished. Some don't have a proper shower, but a curtained bathroom area, like in Holland. It's great for joggers, as there's a lovely train running by the hotel. It's peaceful and quiet and the Spree river provides some nice views, especially at sunset. The staff is helpful and generally no problems whatsoever. But their breakfast...!", "Date": "October 12, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Schwetzingen, Germany", "Title": "“nice business conference location”", "Author": "KarlPopp", "ReviewID": "UR118168558", "Content": "i stayed here for a business conference. staff was friendly and helpful, conference facilities were perfect. also a stunning view from the gym.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Slovakia", "Title": "“Very pleasant. Recommended”", "Author": "Miauova", "ReviewID": "UR117800209", "Content": "We were two couples, staying in August 2011. We booked the hotel at the hotel web site (89 eur). The price was the same as any other sites, but we got a bonus - you can pick from a 'special coffee' or a sparkling wine. We went for wine and drank it in the evening at the hotel bar. It is a very 'warm', pleasant bar, great service, we got all kinds of nuts with the wine as well. It has a nice atmosphere, you feel like coming home from a day of sightseeing. I think that the hotel is advertised as a business hotel, but I believe that it is great for any purpose. There is also fitness and sauna which we didn't try and we had a view of the river even though we did not book it. The room and the bathroom were perfectly clean, very comfortable - 4 stars level, spacious and with everything you expect to have in your hotel room. The location is fine, not right in the center (unter den linden), but not too far either. 10 minutes by bus to the brandenburger tor/unter den linden and 5 minutes from the main railway station (hauptbanhof). The bus stop is right next to the hotel. We did not take the breakfast at the hotel but had a coffee with cakes in a coffee place which is basically in the same building as the hotel. There is also a supermarket and a bistro next door. reasonable price (value for money), good location, great service, very nice rooms and interior. recommended!", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "kinna", "Title": "“solid and quiet”", "Author": "ojeem", "ReviewID": "UR116047669", "Content": "our reservation was made through the net. a waterside room with view on the Spree river. though the view was nice. our first room had a single double matras, giving only little comfort. we were changed to a room with 2 single beds. which we can`recommend. the rooms with .08 have a small balcony and are by far the largest and the best. So if you wish a spacious room see to it that you reserve a room of the x08 ( x being the floor level) the hotel is well situated, but not as near to Berlins centre as some of the largest chain hotels. taxi however are no prblem and are readily available in Berlin. All in all recommandeable if you wish some tranquillity and don't want to pay more than necessary.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Suffolk", "Title": "“Our second stay, good hotel, quiet location and lovely view of the Spree”", "Author": "CandBSuffolk", "ReviewID": "UR115857824", "Content": "The Abion is described as a business hotel but provides a great base situated by the river and not far from Bellevue S Bahn station so perfect for tourists wanting to explore Berlin and Potsdam. Comfortable rooms, excellent choice of breakfast. Overall Berlin is a great city with such an array of different things to see and do. Can recommend AnToBena, Kirchstrasse which is just around the corner for an excellent and reasonably priced lunch venue.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Still great value for a clean, modern Berlin hotel.”", "Author": "okazon69", "ReviewID": "UR114988827", "Content": "I've been back probably ten times or so since my first review. The hotel is still a great value for a quality hotel close to the center of Berlin. The breakfast buffet is excellent, with a great variety. They could definitely get around to changing the beds and bedding, however. The beds are relatively narrow (with two pushed together to make a \"king\") and the comforters are far too small to cover you properly. Coming from a North American perspective, this is a serious minus. Depending on the time of year, the hotel also suffers a bit from the weather. In December last year, the room was absolutely freezing and they had to provide an extra heater; this past June I was happy that the air conditioning was working properly, but fearful of it breaking. The staff are helpful as always, and I am happy to return here several times each year.", "Date": "July 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“brilliant location and quality”", "Author": "gemmell1961", "ReviewID": "UR104822576", "Content": "great for getting around berlin, the quality of the hotel was excellent. breakfast was a treat. But pillows were too soft, ask for a replacement and sadly no tea/coffee maker in the room", "Date": "April 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Nice Hotel, Good Warm-Weather Location”", "Author": "mkhollis1", "ReviewID": "UR88830203", "Content": "Since my husband & I stayed here for 2 nights in late November, it was terribly cold and we did not get a chance to enjoy the riverwalk. I'm sure it was lovely and made a nice walk, but -2C is too cold for enjoying a riverwalk. I would have preferred to have stayed near the TV tower as it seemed much more convenient (restaurants & shops as well as sights, transportation, and tours). There was 1 restaurant in the strip with the hotel, and it was quite good. Our room was the 2-story one pictured online with the spiral staircase going up to a living area with hidden bed and seating area. Since we weren't traveling with our child, it was kind of spooky having another floor open to your room, and especially the extra large windows you had to drop 3 curtains over to block out the street lights. If you don't need the extra space, just get a regular room as these were in a wing away from the reception area. The bath was modern and nice, but the shower curtain was a pain as it kept blowing onto your legs, which it quite a gross feeling. There was no way to attach the shower curtain to the wall, and opening or closing the bath door did not help. The towel warmer was a nice touch, though, and the water pressure was good. We made the mistake of asking a dry cleaners near by to launder our clothes for 4 EUR per 1kg. We basically got back wet, unclean clothes for over 40EUR! The hotel was gracious enough to take all our wet clothes and put them in their dryer for us (no fee!), which was VERY nice!! To use an iron was quite odd as they had me go to reception, pick up an iron, then go to another floor to a small closet where an ironing board was located (something about a fire code, but it seemed inconvenient for a business traveler not wanting to pay 5EUR and wait 24 hours to have a shirt pressed). Also rather inconvenient was the fact that you had to go to reception and get a key in order to use the spa area. We didn't bother. So, if it is warm weather when you go, by all means stay here and enjoy the riverwalk. If not, stay near the TV tower where all the \"action\" is.", "Date": "December 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Austria", "Title": "“great river view, surrealistic location”", "Author": "anna_austrian", "ReviewID": "UR85255706", "Content": "Overall the hotel is very nice, and not a standard typical hotel. The windows of the room look out directly at the river (it just flows below), with the tourist boats bassing by - so rather special. The area around the hotel is somewhat dull - looks like a former industrial ground with some new restaurants nearby. The rooms are made a bit in Japanese/Asian style and with a great taste and care, very well furnished, with many amenities, large in size. The room itself and services (e.g. breakfast) are very expensive.", "Date": "October 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Malta", "Title": "“Excellent accommodation - great breakfast”", "Author": "NevilleCalleja", "ReviewID": "UR84254701", "Content": "The Abion Waterside is a nice upmarket hotel sitting on the bank of the River Spree. Distances may appear to be deceptively short on a map. In fact, it took me around half an hour to get to Siegessäule on foot but the surroundings are beautiful and, if one has time, a walk along the river and then on through the Tiergarten is beautiful. Breakfast is plentiful - bordering on the stressful with the wide choice available. For dinner, consider the humungous plates at Paulaner just a few doors down.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fife, Scotland", "Title": "“great location - please sort out the beds”", "Author": "Buggles72", "ReviewID": "UR83504946", "Content": "The hotel is immaculately clean and well run by friendly and helpful staff. Breakfast could not be faulted and really set us up for the day. Superb location for many of the key tourist sites and use the S trains from Bellevue [5minutes walk from the hotel] to get you anywhere you want. We flew in to Schönefeld and if you get the timing right the RE7 train and then S7 or 3 will get you to the hotel in under an hour! [remember to authorise your ticket on the platform] The only criticism I have of the Abion was the bed - it was booked as a double room and yet the bed was 2 singles pushed together!! drives me mad. Shower room was ideal and, again, very clean. Bar area is lovely and live singer on Friday night was better than average - a g&t will set you back a hefty 10 euros.....no need for that. The local restaurant Paulaners just along the road is excellent and worth a visit. all in all we really enjoyed our stay and would certainly return.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Pisa, Italy", "Title": "“Not bad”", "Author": "RosannaT", "ReviewID": "UR80072725", "Content": "I stayed here with my SO and colleagues for 5 nights. The location is central and very tranquil. There are a couple of train stations nearby and it's 15 minutes from the Berlin Tegel airport. The housekeeping trashes your toiletry items (happened both to me and my significant others, plus our colleagues), such as soap bar, conditioner and such. At the same time, if you ask for 3 towels they will give you 2 because they have a rule in place about it (???). Their coffee is awful (trust me!) however the room service has a limited amount of items but are pretty good and not that expensive. The rooms are kept very cool and when you ask for additional blankets there might be some problems... but somehow they have no problem giving you an electric heater. Overall it's a so so hotel but not bad.", "Date": "September 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“So Very Nearly An 'Excellent' Rating!”", "Author": "lovetravelling012", "ReviewID": "UR79918051", "Content": "We stayed here for two nights to sight see in Berlin. The location is excellent being a five minute walk from Bellevue S Bahn station which has trains every few minutes. The walk from the station felt very safe as the Interior Ministry building is next door to the hotel so there are quite a few police patrols about day and night and the area appears to be very pleasant anyway. The hotel itself is in a converted dairy on the banks of the River Spree and seems very well set up for business travellers (at least mid week when we were there). The Lanninger Bar and Restaurant in the hotel is great with a huge selection of whisky and cocktails and the staff are very friendly and helpful. The cigar room was also very welcome with a huge selection of good cigars at reasonable prices if that's your thing. The only reason we didn't give this hotel an 'excellent' rating was the slightly underwhelming food menu available in the evening. The food we did have was perfectly acceptable but a little more variation would have been nice. Having said that it meant you'll be forced out to eat elsewhere and that isn't a bad thing! Breakfast is the standard German combination of cold meats, cheeses, fruit and various other options and is a great way to start the day. Overall we had a great stay and we would thoroughly recommend a stay here if you want a quiet location near to the centre of Berlin.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "1", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Everything was perfect except ...”", "Author": "042111b", "ReviewID": "UR76827872", "Content": "... for the beds. It's a shame, because otherwise the hotel was amazing in every way. The location, the decor, the cleanliness and the staff all were wonderful. But the beds were hard and made my back ache. Sidebar: While I do have a history of back troubles, I did not experience any other problems at any other hotels during my European tour. My friend also had trouble sleeping in her bed.", "Date": "August 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Honolulu, Hawaii", "Title": "“Really cool for the kids”", "Author": "MalekV", "ReviewID": "UR75968817", "Content": "Finishing our Trek Through Europe in Berlin we were fortunate enough to stay here. The kids loved the two-story room with the spiral staircase. We were in the \"afterthought\" section of the hotel, a second building connected underground (I think) but it was very comfortable and roomy. The upstairs was it's own area with it's own exit but there was a foldout bed that was comfortable enough for a 12 year old. The room wasn't luxurious by any means but it was high end enough to be satisfying. Comfortable beds and climate made it nice to go back to after a day of walking. Front staff was very friendly from checkin through checkout and even seemed happy to give directions and make recommendations. The provided us a street map and marked the stops and train changes we would need to make to get where we wanted to go. Breakfast was good and the staff there was friendly. Even their simple acts of smiling and greeting us went a long way to making our stay more pleasant. There were cafes and restaurants nearby and the riverwalk was nice too. Very nice was to end our trip.", "Date": "August 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Southern California", "Title": "“Restful summer place”", "Author": "Euro_hopper19", "ReviewID": "UR74096618", "Content": "On the banks of the Spree River, next to the Ministry of Interior, is the Abion Hotel. Rooms are spacious, bathrooms immaculate, service excellent. On a summer's eve, there are boats along the river, and a path for walking and biking along the river, and a an anchored river boat serving a glass of wine or a pizza depending on your mood. Although apparently isolated, the hotel sits at the end of a long block with a decent South German fish restaurant and a grocery, open on Saturdays. The only trick is finding the hotel, which is not easy even with the help of internet maps. But many taxi drivers know the place--less than a ten euro ride from the central train station. The hotel is also used to host conferences held by the Ministry of Interior,.", "Date": "August 6, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Confirm in writing”", "Author": "Bellebutton", "ReviewID": "UR73107209", "Content": "We stayed at the hotel which was booked for us by family on a special rate..3 nights for 2. Unfortunately our family member didn't get an email confirming the price. The hotel didn't honour it which lead to an unfortunate confrontation at departure. Apparently this practice is not uncommon in Europe. Otherwise the hotel was comfortable and clean. More of a business hotel, not enough facilities for kids. I would recommend it, but confirm everything in writing. It was extraordinary that they were unaware of an advertised special.", "Date": "July 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Comfortable, quietly located hotel - with a great breakfast!”", "Author": "Lasse1973", "ReviewID": "UR64454651", "Content": "We stayed at Abion for 3 nights this May, having booked the stay through a travelling agent. The hotel is located in a quiet neighbourhood north of Tiergarten at some distance from the centres of Berlin (Potsdamer Platz, KuDamm, Friedrichsstrasse), but close to S- and Ubahn stops. We had a standard room at the first floor and it was, well, pretty standard. An old picture tube set, for instance, adorned the room. The room could do with an update. We didn't use much of the hotel facilities, but took breakfast there every morning - very recommendable: Fresh, well stocked and delicious.", "Date": "May 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rockville, Maryland", "Title": "“Excellent Stay”", "Author": "spicnspan320", "ReviewID": "UR63266965", "Content": "I arrived a bit culture shocked as it was my first time in Germany but the front desk was extremely helpful and spoke excellent English (was afraid to use my German). Our room was not ready (I arrived a few hours early) but they took my bags and when I returned they had taken them up to the room for me. I had a wonderful river-side view with great big windows and a comfortable King bed. Maid service was excellent everyday and they even left me new chocolates every night during my 3 week stay. I enjoyed the breakfast, which was included in the room price, whenever possible. Someone at the front desk recommended an excellent late night Italian restaurant for me and my gf and it was much appreciated. Will definitely stay here next time I'm in Berlin.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Scotland", "Title": "“Excellent Stay at Abion Spreebogen”", "Author": "DerekM47", "ReviewID": "UR61808168", "Content": "Had a very enjoyable week's stay at this hotel. Location is nice on the banks of the Spree and in a pedestrian zone (no traffic noise) within a business area. Hotel and room were spotless and freshly decorated. Reception staff were friendly, polite and helpful. Vast selection of fresh food at breakfast. Room was very quiet, no noise heard from adjoining rooms. It's a short stroll to nearest station (Belle Vue) from where all attractions can be easily reached on Berlin's superb transport system. There are good restaurants in the immediate vicinity and others within easy walking distance. Paulanders adjacent hotel and Marjan Grill at Belle Vue station were very good. Food at the basic Thai restaurant at Belle Vue station was also very good and extremely cheap.", "Date": "April 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Greece", "Title": "“thanks for a wonderful stay!”", "Author": "roudi48", "ReviewID": "UR60930777", "Content": "I never forget the view from our room ........ it was realy a wonderful stay....Only one thing ....which was incredible. I paid 8 euro per hour for using internet point in the reception. Too much..without reason..", "Date": "April 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Galway", "Title": "“lovely staff and one of the best breakfasts”", "Author": "ZoeGalway", "ReviewID": "UR59405666", "Content": "I travelled to Berlin to attend the ITB show and stayed 4 nights at the Abion Hotel. It was a great location, close to the SBahn and a very peaceful location. The staff were so welcoming and more than helpful. They have excellent English (I have no German) and had great local insights on how to get around. I loved the book cases opposite reception area as it gave a warmth to the lobby area. The bedroom was great, very clean and comfortable. The breakfasts were just superb, a great selection of cold and hot and once again all staff were helpful and welcoming. I didn't try the restaurant as we were meeting in other places with colleagues, but would definitely try it next time.", "Date": "March 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Durham", "Title": "“A holiday saviour”", "Author": "dandwDurham", "ReviewID": "UR56667741", "Content": "We stayed here for 4 nights in Early February 2010, having chosen it from the Octopus Travel website. Fortunately we were given an upgrade to a superior Zimmer, I suppose because at this time of year they were not too busy. Well the weather in Berlin was awful: the temperature was well below freezing the whole time, the pavements were thick with ice and snow (though thankfully well gritted) and we had more snow showers almost daily. Consequently we didn't get out as much as we had planned. We went to the opera and the Berlin Phil, which we had booked in advenace, but other than that, we were restricted to short trips out. The hotel was therefore a large part of our break. Fortunately, it was excellent.Our room was spacious on the eighth floor with great views over the river Spree, which was frozen solid except when the ice breaker sailed through each day opening some clear water for the poor flying swans to settle on briefly. We had comfortable armchairs by the window. The food was excellent too. Breakfast had a good selection and twice we ate in Lannigan's bar, the hotel Restaurant, with good service and lovely food, though the portions were rather large. Once we bought food at KaDe We and had a picnic in the room, watching the passing views. The staff were friendly and unfailingly helpful. In an inferior hotel, the weather conditions would have really ruined our break, as it was we had a great time. The hotel saved our holiday. One slight caveat... we would have preferred a bath as well as ashower.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Surrey", "Title": "“ideal hotel for a city break”", "Author": "Derek34", "ReviewID": "UR29454003", "Content": "quiet location overlooking the river spree, but only 300m from an S bahn station . Rooms were spotless and on two levels. The downstairs was a double bedroom with bathroom, upstairs had a single bed, desk sofa and tabel. With televisions upstairs and down. Breakfast was excellant and all for 99euro a night. The staff very friendly. The only minor downside was the the bar and restuarant which were expensive but there are plently of other places to eat and drink with not only the local area but the rest of the city", "Date": "May 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York", "Title": "“The Waterfront Rooms are Worth the Few Extra Bucks”", "Author": "ttt85008", "ReviewID": "UR25829502", "Content": "We loved this hotel so much we were almost tearfully sad to leave. The staff was professional and made suggestions of things to do, places to eat, transportation, etc. The breakfast was off-the charts excellent. We had rooms facing the water with small balconies. You could sit out and enjoy the boats passing by and the beautiful views along the Spree. Location was great- walking distance to the U and S bahns, both of which had frequent service. There is pay parking available, however I found free parking on the street in this very safe neighborhood. I typically like to try new places when I return to a city, however I enjoyed my stay here so much that I will return to this hotel next time I'm in Berlin.", "Date": "March 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cheshire, UK", "Title": "“Great hotel”", "Author": "Keemer54", "ReviewID": "UR18668439", "Content": "This is a lovely hotel with very helpful, professional, friendly staff. It's slightly off the main road in an area that seems to be mostly offices (and the German Interior Ministry building, complete with police presence), so felt very safe indeed. There are a couple of lovely restaurants on the same block, which is great for when you've just arrived or if you don't feel like venturing into the city of an evening. The 'Lanninger' bar looks out onto the Spree and some lovely buildings opposite, with seating on the riverbank for warm evenings. The hotel does cycle hire, which I'd recommend; Berlin is as flat as a pancake and with the cycle paths you can't go wrong. Riding around the Tiergarten on a sunny day was just great. The hotel is also handy for bus and U-bahn stops. The room was clean, modern and spacious, and had air conditioning. The beds were comfortable and there was plenty of room for hanging clothes. I would definitely go back to this hotel.", "Date": "August 6, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Northern", "Title": "“Freat Location, Nice rooms,who can ask for more?”", "Author": "db0204", "ReviewID": "UR17148031", "Content": "Exelent location , quite, on the peacefull river bank. 500 meters away from Bellvue S-Bhan station. Large modern room. very nice breakfest hall.", "Date": "June 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bree", "Title": "“Good Stay”", "Author": "JohBe", "ReviewID": "UR13029544", "Content": "Visited the Spreebogen Hotel from 26/12/2007 till 01/01/2008 for sightseeing, the Christmas markets and offcourse New Year! The location of the Spreebogen Hotel besides the Spree river is in a quiet location in the Moabit district, in walking distance to the tiergarten, the S-bahn station \"Bellevue\" is a 5 minute walk from the hotel! Check-in was fast and friendly, the hotelstaff (reception, restaurant, housekeeping) was overall very helpful and friendly! My room #619 was ok, good size, many storage spaces, mini-bar, air-conditioning, tv. The bed had 2 seperate matrasses, like other reviewers before posted it's still a bouncy bed! The view from my room was on the roofs of the buildings besides the hotel, the better rooms have a view on the Spree river. The room was on the end of the hallway so it was mostly quiet during my stay, also no street noise here! The bathroom/wc was very clean with a standard decoration and the usual bathroom amenities. The breakfastbuffet was good, large selection of cold and hot items but no cook to order! Items where fresh and frequently added, good selection of breads! Didn't have to wait for a table on the days of my stay, staff was very fast with cleaning tables and serving! Hadn't got the time to use the fitness/sauna facilities! Overall the Spreebogen Hotel is highly recommended, good service and all around good prices here! Not right in the middle of the city but with the S-bahn station close by that isn't a problem! I had a nice stay and would surely stay here again!", "Date": "January 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Prague", "Title": "“Nice hotel, BUT be aware of the beds”", "Author": "Eliska_1", "ReviewID": "UR11064982", "Content": "We stayed in the Spreebogen Berlin for two nights. The hotel is very nice, clean, staff is very friendly, the breakfast is one of the better ones I had. The only thing which doesn't make this hotel top is their beds. They're absolutely dreadful. Very bouncy so if it's two of you on double/king bed every time one person moves the other one does as well... If you travel to Berlin via car, the hotel is quite close to the Main train station and it's well hidden on the Alt Moabit Street. It's by a river, but in a courtyard!! So we drove past couple of times before we found it. The hotel doesn't have own parking lot, so you have to use a public parking (which is underneath the hotel) and will cost you 1.20EUR per hour or 17.50 EUR per 24 hours. This hotel is about 25 minutes walk from the Brandenburg gate; about 40 minutes walk from the Check point Charlie so I recommend you use the public transport. But overall Berlin is a great city and I'm sure you all will have a good time!", "Date": "November 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Vic. Australia", "Title": "“Fantastic”", "Author": "Blossom55", "ReviewID": "UR8353545", "Content": "Of all the hotels we stayed in during our two month trip, we rate this hotel most highly. Check in was handled seamlessly, the staff were helpful and informative. We paid a rate of Euro 80 per night and could not get over the value for money. It was excellent. The total experience was very positive. Excellent room, bathroom, facilities, cleanliness, location, price. It scored full marks on all counts. Breakfast was amazing. Wall to wall food choices with every taste catered for. The bus directly to the (TXL) airport departs from the road (lt Moabit) directly behing the hotel. When we go back to Berlin, that is where we shall stay. Highly recommended.", "Date": "August 5, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Grand Prairie, TX", "Title": "“Comfortably adequate”", "Author": "ritesdfred", "ReviewID": "UR6122507", "Content": "I too have stayed in a number of hotels throughout Europe. I feel it was moderately priced. The hotel was certainly clean, well situated and convenient and I felt very safe. The breakfast was pretty outstanding as hotel buffets go. All of the help spoke English and were very helpful with directions etc. I have to agree with some of the other reviews however. The bed left a lot to be desired. It was in essence a box with about an inch or so of foam padding. The pillows were horrible. Folded in half it might be about as thick as an airline pillow. Overall, I was very pleased and would definitely consider staying there again if the price were right.", "Date": "November 13, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Montreal, Canada", "Title": "“Nice modern hotel, convenient location, fantastic breakfast”", "Author": "okazon69", "ReviewID": "UR5702261", "Content": "The hotel is a 10-minute taxi ride from Tegel airport, and a 5-minute walk from the nearest S-Bahn station, from where you can get to many places in Berlin within a short time. The \"standard\" rooms are average in size, but very clean and comfortable. The bathrooms have the typical German efficiency to them - no luxurious touches here. The breakfast buffet is fantastic - choices galore, though the typical North American traveller will miss some items. Live a little, and go the European way! The staff are very helpful, and will gladly try to help with any extra requests you may have. The price for the hotel is usually quite decent, given the quality and location.", "Date": "August 23, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "2"}, "AuthorLocation": "germany", "Title": "“agree with others but......”", "Author": "frankfurtcdn", "ReviewID": "UR5334099", "Content": "most of the other postings are accurate in terms of location, style, etc,etc. the one item worth noting about this hotel though are the beds. Having stayed a large number of hotels of equvalent to 4 star ratings in germany, I was surprised to see the total in adequate beds in this hotel. Basically the bed is a box spring set that appears to by 20+ plus years old with a 1 inch thick piece of foam covering it. Stay away from this place if you have back problems like I do. Spend the extra money and stay at the Ritz. oh, my aching back.....................", "Date": "June 12, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Great Hotel”", "Author": "sirius99", "ReviewID": "UR5289391", "Content": "I can only agree with the others reviews. It's a great Hotel in a beatiful setting, very quiet, and thanks to the S- bahn very convenient for most important sites. We were lucky to stay (for 5 nights) in a huge room with beautiful view on Spree. All the pros that have been described are accurate (nice decoration, very friendly staff, excellent breakfast). The only disantavantage is that the neighbourhood of the hotel is too quite, you can't find restaurants or bars close to the hotel. The only restaurant which is very close is an italian one called Scusi, which I am not recommending. Btw Berlin is beautifull, perhaps the most interesting and nice modern city of Europe.", "Date": "June 1, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Minnesota", "Title": "“Great stay at the Spree”", "Author": "Scott47", "ReviewID": "UR5027110", "Content": "My wife and I stayed at the Spree-Bogen at the end of March and would heartily recommend this hotel to anyone staying in Berlin. We don't spend much time in our hotels while we are on a trip, but when we do we enjoy a nice friendly atmosphere and the Spree-Bogen has that and more. The staff was always friendly and helpful. The hotel was clean and tastefully decorated. Breakfast was included as part of our package and we enjoyed their breakfast buffet more than any of the hotels we stayed at in Europe after leaving Berlin. The small bar near the front desk was a great place to wind down before retiring. They make the most spectacular Apfel Strudel with pistachio sauce. The hotel is also located very close to the Bellvue S-Bahn station and made travel throughout Berlin extremely easy and enjoyable. I know that when my wife and I return to Berlin we will be making reservations at this fine hotel.", "Date": "May 2, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Karlsruhe, Germany", "Title": "“Hidden Treasure”", "Author": "LtColG", "ReviewID": "UR3213798", "Content": "We stayed at the Sorat last December and all I can say is that it was a great deal. We stayed three nights and spent ~100 Euro per night. The Hotel is located right on the Spree River in a part of town used by the Interior Ministry. The Interior Ministry is right next door. It's all new construction next to a warehouse district that has been refurbished into chic bars, restaurants and office buildings for the Interior Ministry. Although not in a real touristy area, it's location only added to the appeal in my opinion. Because it was out of the way, prices in the restaurants, shops and bars were much more reasonable. The Hotel is well maintained and the room was standard size for Europe. All the amenities (wet bar, shower, TV, etc..). Breakfast buffet in the morning was excellent with omlettes made to order and the full range of other items (fruits, breads, cereals, daishes, etc...). Hotel staff was friendly, curteous and multi-lingual. We were a little concerned about the lcation since we wanted to \"see the sights\", but an S-Bahn station was a 5 min walk down the river from the hotel and 10-15 minutes later we were at the Brandenburg gate. Bottom line, a very nice hotel in an out of the way location made this a great deal.", "Date": "February 21, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Beautifully Situated on the River”", "Author": "A TripAdvisor Member", "ReviewID": "UR2526200", "Content": "Just north of the main action in central Berlin but in a beautiful location on the river. A pleasant walk away from the Charolottenburg Palace and an easy bus ride from everywhere else. A train station is nearby as well. My room was a corner one high up and had wonderful views of the river and the attractive art nouveau houses on the opposit bank. Lots of trees. The bathroom was the ultimate in luxury and the room was light and airy (you could actually open the windows) and a great breakfast buffet to start the day.", "Date": "September 13, 2004"}], "HotelInfo": {"Name": "Abion Spreebogen Waterside Hotel", "HotelURL": "/ShowUserReviews-g187323-d199422-Reviews-Abion_Spreebogen_Waterside_Hotel-Berlin.html", "Price": "$95 - $278*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Alt-Moabit 99</span>, <span class=\"locality\"><span property=\"v:postal-code\">10559</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "199422", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/8d/ba/8dbaf1c588dca103584b882fa58d283f4large.jpg"}}