{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Palm Beach, Florida", "Title": "“Last minute resort turned Great!”", "Author": "Majlis R", "ReviewID": "UR128201770", "Content": "WE had booked at another hotel; which we had a terrible experience. We arrived late at NH and they went out of their way to find us a room. I had my 7 month old with us and they brought up a playpen in minutes. very friendly staff and comfortable room. Wifi wasn't free, but was very reasonably priced. Excellent breakfast to start the day. The hotel is nearby several attractions; and located in between two s-bahn stations should you not want to walk.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Turin, Italy", "Title": "“Long w-e in Berlin”", "Author": "Fonst", "ReviewID": "UR125658539", "Content": "The NH Hotel in Kudamm has been very satisfactory.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paisley, United Kingdom", "Title": "“Excellent hotel for the weekend break”", "Author": "stephenr67", "ReviewID": "UR124948410", "Content": "Stayed here Friday 17th - Sunday 19th February. We walked from the S-bahn station at the zoo, no more than 10 mins and that was because we were already window shopping. The main shopping street - the Ku'damm, is no more than a few steps from the hotel and its beside an underground station too. There's plenty of shopping in this area, as well as dining. Tour buses all stop around this area too, so you are never far away from getting to all the sites. The room was spotless, very modern and good amount of space. Bathroom was a bit small, but again, modern and clean. Nice touch in the room was underfloor heating for the tiled floor. The deal included use of the mini bar (couple of beers, some wine, fruit juice, soft drinks, water, chocolate, snacks - about 40 euros worth) and a late checkout on the sunday.Breakfast was also included and this was great - hot foods (eggs, sausages, bacon, etc), cold (meats, cheeses, cereals, yogurts), breads, juices, teas & coffee - and fresh waffles which were perfect with some chocolate spread! I checked out the fitness site but didn't use it - a small areawith 3 or 4 machines, but there was also a sauna, steamroom and hot beds which friends used and they loved it. Word of warning for anyone going to Berlin for the weekend - dont leave shopping until the Sunday, because 99% of stores are closed. Only the gift stores are open - so you may want to go to the museums on the Sunday.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dundee", "Title": "“Comfort and style in a great location”", "Author": "GolfGirlDundee", "ReviewID": "UR122463750", "Content": "We stayed in this hotel in December 2011/January 2012 to celebrate New Year. The hotel is a stylish, modern place which is very comfortable and clean. The location could not be better with several excellent restaurants and bars at its doorstep. We really appreciated the spa and gym on the 7th floor which was a great place to relax after walking Berlin all day. The public transport is just round the corner – U-Bahn at Uhlandstrasse and S-Bahn at Savigny Platz. If you like shopping, it is just two minutes away from a great Berlin´s shopping Street at Kurfuerstendamm. The only downside is that they charge for the wi-fi which is not so good if you like to be using the Internet on your travels.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Good location, pleasant hotel”", "Author": "looptail", "ReviewID": "UR120395674", "Content": "The hotel is easy to get to by bus or S-Bahn; the reception staff were friendly, helpful and spoke excellent English. We had a room on the fourth floor overlooking Grolmanstrasse - the street isn't that busy anyway and there was very little noise. Clean, comfy and otherwise welcoming. No restaurant, which was a little annoying; Internet terminals were not particularly cheap either. We'd stay there again though - the location, comfort and helpful staff were great.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Loved the location; Great rooms and breakfast”", "Author": "Yana_Sh", "ReviewID": "UR118974090", "Content": "Great rooms, very clean. Super comfortable bed!!! Great breakfast. We had a Weekend Extender deal, which was great (breakfast included, LATE CHECK-OUT up until 17:00h on Sunday and one FREE MINIBAR). Recommended! Very good location, close to a lovely square - Savignyplatz - full of lovely restaurants!Close to public transportation - U and S (although the U1 lain is now under construction so there are some changes that made it not so convenient... ) Yana", "Date": "October 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Australia", "Title": "“Rudest front desk staff”", "Author": "SShahin", "ReviewID": "UR117314658", "Content": "Great location just off Ku'Damm and a very nice breakfast buffett. But other than that it was a dreadful hotel. Front desk staff was snobby and rude. Nobody made us feel welcome nor was anybody interested at all in giving any service to paying customers. No Premium channels in room, no WiFi, 5Euro charge per 15mins for using the 2 computers downstairs...say what! The inhouse bar was dead and the barman a joke. He kept disappearing and not give any service. 4 star rating seems exaggerated as it pretty much just provides you with a place to sleep. Would not go back!", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Zagreb, Croatia", "Title": "“Great location, big spacious rooms”", "Author": "LadyGoga", "ReviewID": "UR117176131", "Content": "NH Hotels provide quality service for reasonable price, and this was also the case. The hotel is located on one of the most favorite Berlin's streets - Kudamm, and just 3 minutes away from Savigny Platz train station, which makes an excellent starting point if you want to visit any part of Berlin. But, being close to a train station also means there is a lot of noise, as the trains pass by every 5 minutes, so you need to have your windows closed all the time to minimize the noise if your room is in Building 2 (the hotel has two buildings, with a garage pass betseen them). We had a 3-bed room, which was big enough to dance a waltz, equipped with modern and functional furniture, a plasma TV, mini bar and an excellent bathroom. Breakfast was excellent with a great choice of food and beverages. Would definitely choose it again.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Groningen, The Netherlands", "Title": "“Very nice hotel on a perfect location”", "Author": "Holland5857", "ReviewID": "UR116099522", "Content": "For sightseeing in and around Berlin and for shopping at the Kurfurstendam is this a great hotel. Nice and clean rooms. A very nice breakfastbuttet to start your day.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Oslo, Norway", "Title": "“Very good location”", "Author": "jdjd74", "ReviewID": "UR116092402", "Content": "Stayed her from 28-31 july for a weekendtour. Very good location, 50m from the shoppingstreet, 2 min walk to U-Bahn and bus stop. Lots of good places to eat nearby. Comfortable hotel with nice rooms, coffemaking facilities in the room. The double bed was not a double bed but two twin beds put together, this was not so good because at night the beds slipped away from eachother. Apart from that the room was of good standard with a nice bathroom and everythinh else you would expekt from a 4 star hotel. Quite a lot of tvchannels to choose from, although 90% were in German. But we were not there to watch tv so that wasn't a problem for us :) The personell at reception was polite, serviceminded and helpful. We booked our stay via hotels.com , but when we arrived at the hotel the booking had not come through, don't know if this was hotels.com or NH hotels fault. Anyway the woman at the desk fixed it for us and we got the room without any discussion. We didn't have breakfast at the hotel because of the cost of it, I think it was 18 euros for breakfast. Much better then to walk outside and eat breakfast at one of the nearby cafees. Can recommend the one 250 m from hotel (don't remember the name of it), but take right out of hotel, then next right, and then right again, about 4 min walk. They serve breakfast for under half the price at the hotel. Would also recommend the Vietnamese restaurant Mr.Hai ,a 2 min walk from the hotel. We had dinner there 2 out of 3 days , great food at great prices. From the hotel turn right, walk to the end of the road and then at the right hand side corner Mr.Hai is. Also it was very easy to reach the hotel from Tegel Airport. From the airport take bus number 109 to Uhlandstrasse, from there it is a 2 min walk to the hotel. The bus runs every 10 mins both from and to the airport, cost 2,30 euro. All in all we were happy with the hotel and could certainly recommend it to others, espescially because of its location.", "Date": "August 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Great location for a very comfortable hotel”", "Author": "Portcred", "ReviewID": "UR103661138", "Content": "A quiet (ish) location for this very well situated hotel. Rooms are fresh, clean and in our case, very spacious. Hospitable staff, who respond with charm to every request, manage to make it seem far more intimate than any other large Berlin hotel I've visited. This is the third NH hotel I have booked and this standard of service and quality has been consistent throughout - yet each property has been unique, it is not a bland chain hotel experience. I return to Berlin in June and will stay a little longer this time, possibly sample a few more of the excellent restaurants in the area.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“A hotel in a great location”", "Author": "Gary488", "ReviewID": "UR95733703", "Content": "The hotel is ideally placed for shopping and sight seeing. Its close to the Metro. When we were there the charge for breakfast and the internet was very expensive. If you can get a deal for breakfast then I would strongly recommend that you should. I think it was 18 euros each so we didnt bother. We went out locally there are plenty of places about. At the time all hotels were busy in Berlin for the New Year holiday so this was more, all there was at a sensible price. Its not cheap but the location helps.", "Date": "February 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "haarlemmermeer", "Title": "“highly recommended”", "Author": "griswolds09", "ReviewID": "UR91574907", "Content": "good 4star hotel a few steps from one of berlin's main avenue. one may not expect such fine hotel from the outside, but once you step in it all looks new and bright, although basic. our room was huge with a comfy kingsize bed and an extra rollaway for the teenager. minibar, safe and coffeemaker available. rather small flat screen tv with some 35 channels. as we stayed in the main building train noise was there, but bearable. fine fitness- and sauna area on the 7th floor connecting to a large outdoor roof terrace. turn right on kurfuerstendamm for maredo steakhouse and netto supermarket, both just a few minutes walk from the hotel. would always stay here again.", "Date": "January 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Heidelberg", "Title": "“Excellent Choice”", "Author": "haaspw", "ReviewID": "UR86523980", "Content": "The hotel, recommneded by our travel agent, was an excellent choice. The personnel at the reception, bar, breakfast room, as well as housekeeping were all friendly and helpful. The hotel is has a pleasant modern decor with a nice Bar near reception. The room was quiet, large and Comfortable with a great Bed and well appointed bathroom. The breakfast buffet was generous and varied - friendly personnel and great coffee as well. The location was great - close to both S- and U-bahn and the bus. To recommend.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toulouse, France", "Title": "“Good for a city trip to Berlin”", "Author": "anjab82", "ReviewID": "UR84313337", "Content": "The hotel is very well located. Just next to the Kurfuerstendamm with many public transport connection. The Airport shuttle is also just stopping in front of it. I liked that it was possible to have the breakfast in bed (paid only a little bit extra for it). We also had a special with a late check-out possibility which was very convenient.", "Date": "October 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Excellent Hotel”", "Author": "Bruceyuk21", "ReviewID": "UR75077354", "Content": "Stayed here for 4 nights last week and found the experience to be very enjoyable.", "Date": "August 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gjovik", "Title": "“Very good for it´s price”", "Author": "Ketil67", "ReviewID": "UR60113609", "Content": "Friendly staff, clean rooms, but some of them faces the railway. Indeed centrally situated.", "Date": "April 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fredericton, Canada", "Title": "“Perfect location and price”", "Author": "jensatravellin", "ReviewID": "UR55147349", "Content": "I thought the location was perfect. Walking distance to a city bus stop. Easy to use the city buses to and from Airport. The hotel was very affordable, clean and centrally located. The hop-on, hop-off bus is just around the corner on Kurfurstendamm. The Hard Rock Cafe is within walking distance as the church (forget the name) that was damaged during the war. The are plenty of restaurants on Kurfurstendamm and shopping. Beside the church there is an underground shopping center and an Irish pub (forget the name). It didn't serve food in the evening but there was a live band playing. Alright spot for a Sunday night.", "Date": "February 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Amsterdam", "Title": "“hotel ok, but quite expensive at new year and noisy because of trains”", "Author": "ArtistheP", "ReviewID": "UR52768850", "Content": "We stayed at the hotel for 4 nights in dec 2009/jan 2010. The location is great, in a quiet street, and only a 5 minute walk to a s-bahn station and about 10 minutes to the u-bahn, with a lot of nice restaurants, shops and some grocery stores nearby. Our room was in the new part of the hotel, which is located just next to the railwaytrack, with trains and metro's running 24 hours a day. All rooms in this part of the building are next to the tracks. We didn't sleep bad because of the trains, but because of a strange loud sound (best described as someone sending morse-codes....) at several times during the night. The room is quite large and very clean. There's a minibar (with extremely expensive stuff in it, but quite handy for your own Beck's Beers), a quite large flatscreen tv, one normal chair and one relaxing chair and a big bed. The bathroom is quite large as well, with a nice shower, shampoo and bodywash provided (if you like a strong apple-smell). The sink, however, smelled very badly after using it, which was noticed by housekeeping because they closed the discharge the first morning but took no action to fix the problem. We 'fixed' it ourselves by keeping it closed until we went to sleep or left the room, but is was quite horrible. There was no bathtub in the room, and no coffeemakingfacilities, as said in other reviews and like said in other reviews the pillows are tiny. The computers in the lobby were out of service and wireless internet costs 9 euros per hour, which is pretty ridiculous. Breakfast costs about 18 euros, so we skipped it and enjoyed a lot of cheap and nice sandwiches, sausages and other nice stuff at the little kiosks on the street and stations. While we stayed in the hotel around new year's eve, the costs were pretty high (around 120 euros per night at the 30th and 31st of december, and 'only' 80 euros the night before and after,booked at booking.com, on the hotelwebsite itself it was much more expensive), but this is the case in all of Berlin hotels during this time of the year. However, the party at the Brandenburger Tor was great, and our Savignyplatz s-bahn took us there right away and back without any struggle, how great! Staff is polite, but we only saw them when we checked in and out, because of the fact guests staying in the new building can use the entrance in the parking garage and do not pass the reception. Overall, we had a good stay in this hotel, and would recommend it to others, but you should ask for a room in the main building and look for a nice offer on booking.com.", "Date": "January 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, UK", "Title": "“Good Value”", "Author": "traveltobrussels", "ReviewID": "UR51770919", "Content": "The rate was quite sweepy, with only 45 euro pn in the Lastminute.com bargain. Yet the hotel would be worth 70 euro or so. Good location, with a walkable distance to K'damm (10-15 min), many restaurants nearby. I recommend Marjellchen. What I liked most with this hotel was that, on the contrary to German standard, there was a coffee making facility in a room. There also was a bathtub. One mistake of the hotel was that we could not check-in until 15:10, as cleaning staff were taking a break in a guest room and did not answer to the inquiry from the reception. Further, next morning we were disturbed by them, even though we were still in the room. Their cleaning was not bad, though.", "Date": "December 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Netherlands", "Title": "“Absolutely perfect”", "Author": "AnitWolko", "ReviewID": "UR46014653", "Content": "Couldn't fault this hotel. Close to transport, restaurants, shopping. Also in a very nice area which is quite upmarket with excellent restaurants. Breakfast to die for, and seating area had a very trendy decor. We had a standard room on the 6th floor but it was very nice, not huge, but the bed was a real king-size. And everything was clean, clean, clean! I loved the laminate floor, very hygienic. Will certainly return.", "Date": "October 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "gold coast australia", "Title": "“great position”", "Author": "beachlady6", "ReviewID": "UR42110268", "Content": "This hotel is well situated to the Kudamm shopping district, plenty of transport and easy pick-up place for tours. The hotel is new and the rooms well appointed. The breakfast was excellent, and many restaurants nearby. The hotel staff efficient and helpful.", "Date": "September 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Brazil", "Title": "“Great Hotel at a GREAT location”", "Author": "ViajandoBr", "ReviewID": "UR35475249", "Content": "The Nh hotel is a new hotel, with new furniture and excelent beds. The people who work there were very nice and helpful , even we were in a big group. Most of the hotel staff speak english, and at the front desk there is always someone who does. The Hotel is very well located , close by at least 6 restaurant in a walking distance, 2 min. walking!!! spanish, vietanmisse, italian, german and the great DICKIE WIRTEN pub! All at the Savynplatz! Great at summer. If you are in group/business, or with your spouse for leisure this is a great hotel, for it walking distance to bus lines, metro station and restaurants. Pretyy near for kufurstendammstrasse major shopping district. From airport you can take the BUS 109 and stop in the corner of Hotel at Uhlanstrasse.", "Date": "July 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Milano", "Title": "“Excellent in all ways!”", "Author": "Antonio101", "ReviewID": "UR27508737", "Content": "The Hotel is recent (was told 2 years), very well maintained and clean. The rooms are spotless and overlook for half of them a sidestreet of Kurfursterdamm which means good location.The rooms are very nicely decorated NH style, fair in size (had a standard room) bathroom a little small, mirror lighting poor and needs definitely improvement. Fitness is small but well kept with 3 cardio equipments. WIFI available + free internet for guests at internet point. Breakfast is very generous in variety and very good in quality. The staff are all very nice, attentive, professional and ready to serve with a smile. They helped me to rent a bike for a couple of days to move around Berlin which I suggest to everyone if the weather is nice.", "Date": "April 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Wyoming", "Title": "“Good value, good location, good experience . . .”", "Author": "Bill31", "ReviewID": "UR25708012", "Content": "A very good experience and would definitely return. Stayed in one of the basic rooms with the included breakfast. Well appointed room, but compact. For more than one person, you'll need more space. Bed is excellent and room was quiet. Service was mostly good . . but sometimes they forgot to replenish the coffee. Excellent front desk and very helpful with directions and advice. You're very close to the U-Bahn . . about a two-minute walk Breakfast was excellent and worth the expense . .", "Date": "March 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ontario", "Title": "“Excellent Reception Staff!”", "Author": "thewizardofwords", "ReviewID": "UR22301121", "Content": "My 84 year old father and I recently stayed 10 days at the NH Hotel Kurfurstendamm. Our initial room was a little small and not very handicap friendly. The staff was kind enough to allow us to switch rooms after 2 days into a handicap room at no charge, which I wanted in the 1st place because my father requires the use of a walker but he originally refused. The handicap room was much roomier with a huge walk-in washroom/shower, good-sized flat screen TV, small fridge, and comfy beds. Our room was cleaned every day and they never failed to refresh our towels. Check-in and check-out time was super schnell. I was very impressed by the reception staff who always smiled with a friendly greeting and were very professional. They seemed to know the answers to your questions before you asked them in German or English. The brunette at the front desk was especially courteous & cute with a sweet guten morgen. Breakfast is a little on the pricey side at 18 Euros per person but on the plus side there is no lineup, the food was all bio, plentiful and delicious-Especially the pancakes. Kudos once again to the staff. The price averaged out to about 87 Euros per night because we ordered early and paid up front. That’s not bad for a modern 4 star hotel in an excellent safe location close to transit, shopping, and some major sites. You get 5% of your bill back if you join NH World, which you can use towards future stays at the very large NH Hotel chain. I normally don’t like large corporate chains but this one made me feel at home.", "Date": "November 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bath", "Title": "“Good location, great hotel”", "Author": "DinkyDonk", "ReviewID": "UR20388897", "Content": "Rooms; clean and modern. Good shower and you can get CNN. The bedding was nice and fluffy and you can't hear train if your room faces the street. Hotel itself; breakfast is good, if a little on the pricey side. Worth doing one morning for the waffles alone. The buffet is extensive, and if you're hungry, you can get your moneys worth. There is no pool but there is a sauna and a steam room, and a couple of running machines. The roof terrace is very good too. Location; excellent. 1 minute walk away from the S-Bahn station. Its also close to the starting stop of the city bus tour. Pretty direct (if a little long) transport to the airport. The weather was fantastic (we were there for the first week in June). There are lots of cool bars in the area, and really good sushi restaurant close-by too Overall I'd recommend this hotel.", "Date": "September 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nottingham", "Title": "“Good boutique style hptel”", "Author": "737av8tor", "ReviewID": "UR20109583", "Content": "Just returned from a 2 night stay at the NH Ku'damm. Taxi from Schonefeld was €37.50, which was worth it as our flight landed after 9pm. The train is much cheaper from the station at the airport and conveniently runs to SavignyPlatz, about a 10 minute walk from the hotel. The Turkish-German male receptionist couldn't find the reservation to begin with and was easily distracted by the telephone, which was irritating and hardly and a good start, nevertheless, our room on the second floor, down the hall from the breakfast salon was clean, spacious and light. Flatscreen TV, large king bed, AC and tea and coffee. The glass door to the shower WC is novel: you certainly need to be close if you stay here! Noise from the S Bahn line was only evident with the window open, although some of the rooms are much closer, overlooking the line. Breakfast was a good selection of hot and cold food served until 11am. The location on Grolmanstrasse is ideal for the Ku'damm and Zoo and with SavignyPlatz just a few metres away there plenty of bars and restaurants around: crossing Savigny and carrying on along the extension to Grolmanstrasse we found several excellent restaurants and ate at Florian, €106 for 2 with wine. All in all a great place to stay: one very small complaint was that the tea and coffee in the room weren't replenished.", "Date": "September 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new brighton,wirral", "Title": "“fantastic value.fantastic hotel”", "Author": "shellyshoo", "ReviewID": "UR18526790", "Content": "We have very recently returned from a 5 night stay in this hotel.When we booked the rooms were only 79 euro'a a night.Upon arrival they asked us if we wanted breakfast at 18 euro's each.We thought that was a little expensive but agreed anyway. The staff here are very friendly and efficient.The hotel is spotlessly clean.It is very modern and decorated to a high standard. Our room was lovely with very very comfortable beds.It had a flatscreen tv and kettle and a mini bar and a free safe. There is a very regular train service that runs past the hotel but you don't really hear it, especially with the windows closed and at night it is very quiet. Breakfasts were really good with a huge selection and it catered for all tastes.The breads were lovely.The hot selection was hot , not luke warm compared to some other hotels we have stayed in.In fact , even though we originally thought they were a little expensive it actually saved us money as we never ate again all day until night time ! The roof top terrace was nice but possibly wouldn't cater for more than 6 people.The fitness area and sauna etc was brilliant. The location of the hotel is good it is very close to the main road and there are lovely bars and restaurants nearby.It is also ideal for people with walking difficulties as the area is flat.The hotel does have disabled rooms too. The bar in the hotel was surprisngly inexpensive too. Last year I stayed in the swissotel and this hotel beats it hands down and it is a third of the price. I cannot recommend this hotel and fab city highly enough.You will not be dissappointed.", "Date": "August 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Location": "5"}, "AuthorLocation": "Switzerland", "Title": "“LOVED IT AND WILL DEFINITELY RETURN!!”", "Author": "Travel_Lover80", "ReviewID": "UR17069025", "Content": "Loved it the minute I walked in. The service was excellent, staff friendly and helpful, breakfast perfect, and my room was what I wanted! Had a single room and for one person this was more than I expected...I'd definitely go back next time I'm in town...it made me feel like home!", "Date": "June 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wirral", "Title": "“Fantastic Modern Hotel”", "Author": "WirralMark", "ReviewID": "UR10470347", "Content": "We stayed here for 3 nights & were very impressed with the access, hotel & location. A nice residential street near to a few bars, cafe's and all the main shops on the Ku'damm. Easy cheap access on the trains to East Berlin/ Brandenburg Gate/Checkpoint Charlie etc. Other attractions close by to walk to-Berlin Story/Nuclear bunker tour. Zoo/ Kaiser Wilhelm church. As we had never been to Berlin before we decided at £260 for 3 nights this was a decent gamble on a modern 4 star hotel. Glad to say it was worth every penny. I almost booked the Heckers hotel over the road for a lot more!! so am very glad we didn't! I would definitely reccomend the S-bahn if you fly into Schonefeld as the Taxi will set you back at least 35 euros. Get the Spandau line to Savignyplatz, it cost about 2 euros and takes 40 mins. Good views on the train of suurounding areas to East Berlin! The hotel was obviously new, very spacious room- Flat Screen Phillips TV, Well stocked Mini Bar, Good clean bathroom. Only let down in the room was that the double was 2 beds pushed together so make sure you specify a \"King\" or \"double\" when checking in. Staff were friendly and helpful- especially as the S-Bahn workers went on strike the night before we were due to travel home at 6am the following day. Always worth asking at reception for advice the night before!! All in a great hotel & would definitely go back to Berlin & this hotel!", "Date": "October 31, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Good hotel, but questionable value for money”", "Author": "Bear73", "ReviewID": "UR10295145", "Content": "The hotel is in a good location, just off Ku'damm which has all of the shops which you could ever wish for. The hotel looked as if it had been recently renovated and because of this was clean and fresh looking. The staff were friendly and attentive. The room had a flat screen LCD TV and a great shower. The main problem was that my room overlooked the street outside and the S-Bahn runs pretty much right next to the hotel. While it's convenient (about 2 minutes walk from Savingyplatz, which is 1 stop from Zoo Station) you do get quite a lot of train noise. There are a number of good restaurants and bars in the area. This hotel was a great base for exploring the city", "Date": "October 24, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Marbella", "Title": "“Good Facilities”", "Author": "AlexCollins", "ReviewID": "UR8589693", "Content": "Booked a standard double room for 4 nights. Was impressed by the size of the room and the fact that it had an HD flat-screen etc. Best thing about the hotel is the wellness centre on the top floor, with a gym, sauna, Turkish bath and relaxation rooms. Good location on a good street. Best meal we had in Berlin was \"Eisbein\" in a place called \"Schildkröte\" which had typical local food, walk out of hotel, turn left and cross over the Kurfürstendamm, about 1 min from hotel. Taxi from Schönefeld airport is more like €40 than the €20 most places claim. Recommendations: 1. Beer Gardens in the Tiergarten. 2. Schildkröte restaurant.", "Date": "August 31, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tromso, Norway", "Title": "“Great hotel for our needs”", "Author": "FrederickAlexander", "ReviewID": "UR5631255", "Content": "It's right by Ku'Dam, one of the best shopping-streets in Berlin. ex. Tommy Hilfinger's store is one minute walking. That's also the S-Bahn at Savignyplatz (with lots of cozy cafè's and restaurants), and U-Bahn station. So you got all of Berlin in easy reach. We got a huge room with lots of space to our luggage. We didn't got a room with A/C, but it was not a problem with comfortable temparatures at nights.", "Date": "August 21, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Averill Park, New York", "Title": "“Good value”", "Author": "NewYorkKaren44", "ReviewID": "UR3598870", "Content": "We stayed at this hotel in the midst of a \"heat wave\" in Europe, but found the room quite comfortable despite not having a/c. Windows opened fully in the European tradition, onto a lovely courtyard where the complimentary breakfast was also served. Room was small but adequate. Friendly staff. Quite conveniently located, within easy walking distance of the K-damm. Available on-street parking. One note--the back of the hotel is adjacent to the train, with a frequent commuter schedule, and can be noisy with the windows open, although with soft ear plugs, completely manageable! An overall excellent value.", "Date": "June 21, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Bristol, England", "Title": "“No-one mentioned the S-bahn”", "Author": "A TripAdvisor Member", "ReviewID": "UR2799121", "Content": "Good location. The old main building is getting a bit dated and the breakfast room and breakfasts were average. The new annexe around the corner is very nice, with spacious rooms and glazed inner courtyard. However, no one mentioned that it fronts onto the main S-bahn line. We had rooms at the back and with windows well closed and earplugs (light sleeper) it was OK. If you get rooms at the front of the annexe, I hope you're a heavy sleeper as the trains are incessant. Good couple of restaurants locally and bar in hotel OK if barman a bit surly. Receptionists seemed friendlier in the annexe than the main building. Overall I would go there again.", "Date": "November 1, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Grenoble France", "Title": "“very good experience, friendly staff”", "Author": "A TripAdvisor Member", "ReviewID": "UR993510", "Content": "excellent location, at walking distance to public transportation, restaurants and shops. Brand new rooms in House #2, the recent extension. Excellent breakfast buffet, with a wide variety of fresh cut fruits, various reads, etc.. Friendly staff, mostly all fluent in english (one exception has been a night concierge at House 2 reception).", "Date": "May 10, 2003"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Worthing, Uk", "Title": "“Great location, great facilities”", "Author": "A TripAdvisor Member", "ReviewID": "UR838257", "Content": "Booked 4 nights at this hotel for 200 pounds for two people inc breakfast. Great location, in the centre, lots of shop eating places near by. A S-Bahn and a U-bahn within 2 min walk which connects you to the the main lines. Also bus stop very near with direct bus to airport every 2 mins!!!!! The area and hotel felt very safe and i would definetly recommend as the place to stay in Berlin!", "Date": "January 18, 2003"}], "HotelInfo": {"Name": "NH Berlin-Kurfurstendamm", "HotelURL": "/ShowUserReviews-g187323-d199401-Reviews-NH_Berlin_Kurfurstendamm-Berlin.html", "Price": "$104 - $197*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Grolmanstrasse 41-43</span>, <span class=\"locality\"><span property=\"v:postal-code\">10623</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> (Formerly TOP Concept Hotel)</span></span></address>", "HotelID": "199401", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/21/37/06/fassade.jpg"}}