{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Big Room, Nice Staff, Very fast Internet Free Access”", "Author": "Sergio A", "ReviewID": "UR128041920", "Content": "Stayed in this Hotel with my Family during recent Easter Holidays. First of all, Value for money is excellent. Great localization with Bus Stop, S-Bahn and U-Bahn stations just in front or around the corner. You can be in Berlin downtown (Postdamerplatz or Brandeburg Tor in about 14-16 Minutes. You can also go from Hotel to Postdam using Line S1 from there in about 25 Minutes. The Staff was very friendly and Breakfast was really great.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "San Diego, California", "Title": "“Big Rooms, Great Breakfast”", "Author": "daldelmar", "ReviewID": "UR127157721", "Content": "This hotel is near the University, my reason for being there. It has some mundane features, but for the traveler there are some things that really make a difference. The first is the size of the rooms-incredibly large. My experience in Europe is that of small rooms. Like you can touch opposite walls while laying in bed. Definitely not the case here; bigger \"normal\" rooms than I have ever seen in Europe or anywhere else. For me, that counts special. The second huge positive was the breakfast. Have things changed everywhere from that hard-boiled egg, dry croissant world or just at this hotel? Just an amazing selection--makes you want to stay a couple of weeks just to try everything. Delish! This place is not near the center, but if you're in the area or like to take the public transit to get to the center, or have business near the Free University, you're in for great comfort", "Date": "April 2, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Convenient, inexpensive, but they could learn about good customer service”", "Author": "okazon69", "ReviewID": "UR123901869", "Content": "I arrived here after almost 24 hours of travel, late in the evening. I had reserved a room over two months in advance, queen, non-smoking. Was I ever surprised to be told that not only did they not have my room, but that I was lucky to get any room at all, in this case a smoking room with two single beds. Despite the fact that my reservation was guaranteed by my credit card, the front desk staff insisted that anything above and beyond a bed was \"optional\" and I could take it or leave it. The breakfast, which they immediately offered as a complimentary add on, ended up being charged one of the two nights. It seems they do not place much importance on acknowledging higher tier members of their own loyalty program, and that their front desk staff simply could not be bothered to properly allocate the reserved rooms. Perhaps they were counting on me not showing up at all? This total lack of organization and extremely poor attitude toward the customer are unfortunate, to say the least, as they detract from an otherwise good hotel. The next day, the hotel manager did sort things out, provided me with a non-smoking junior suite (really, just a slightly larger room with a sofa and chairs) and a bowl of fruit. Nice touch, but it should never have come to this. That being said, if you get what you reserve, the hotel is very decent for the price. It was, in this case, less than half of what my usual place would have charged, and is no more than 15 minutes away by U Bahn from Zoologischer Garten. The U Bahn is directly next to the hotel, and costs only 2.30€. The rooms are newly renovated, with nice, clean bathrooms (shower only, no tub), though the rest of the building shows its early '70s look. The breakfast buffet is very nice indeed, and at 13€, not a bad deal for what you are getting. Note that there are a bakery and a small supermarket right outside the front door, too. For an inexpensive and conveniently located place to stay a few days in Berlin, this is certainly a decent choice.", "Date": "January 31, 2012"}, {"Ratings": {"Location": "3", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Rovaniemi, Finland", "Title": "“Good hotel in a quiet neighbourhood”", "Author": "LPekkala", "ReviewID": "UR118183493", "Content": "Dahlem is a quiet and beautiful part of southern Berlin. The hotel is located just on top of a metro station and S-Bahn station is 200 m away. Everything works, although the hotel is a bit worn-out. Rooms are clean, quite spacious and the wireless internet works well. Breakfast is good with a chef making omelets to your taste. If you don't want to stay in central Berlin, this could be a good choice. There is a shopping mall just across the street and some nice restaurants close by.", "Date": "September 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Malmo, Sweden", "Title": "“A very pleasant hotel”", "Author": "Amiando", "ReviewID": "UR104537343", "Content": "Great service, cosy rooms with a comfy bed. Never slept so good in a long time. I love that they only had an shower in my room and no tub. The cleaning was just superb. I'm already planing my next stay here :)", "Date": "April 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Palm Beach Gardens, Florida", "Title": "“Don't go there in the summer heat!”", "Author": "rwolf51", "ReviewID": "UR71897046", "Content": "While the hotel is centrally located, service and breakfast buffet are excellent, you won't get much sleep in a hot summer's night, as the rooms lack air conditioning. You don't notice at first, since the lobby and common areas are all air conditioned. When we opened the windows in the room, it barely made a difference, except for the noise level from the surrounding streets, which by itself kept us awake. The lady at the reception desk tried hard, but with limited success, to find us another room with a bearable temperature, as we refused the first one assigned to us, which felt like a sauna. Room temperatures were approx. 88 - 90 degrees Fahrenheit. With the windows open, it \"cooled down\" to around 83 in the morning. When we questioned how a hotel that belongs to Best Western and calls itself \"Premier\" can do without a/c in the guest rooms, the answer was that it was considered by management, but deemed to be too expensive! Therefore, my recommendation is \"No\" for stays during summertime.", "Date": "July 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Taunton", "Title": "“Quality Hotel and Friendly, Helpful Staff.”", "Author": "BigBlueBlackbird", "ReviewID": "UR63684880", "Content": "The Hotel is situated within a block of shopping outlets with covered, multi-storey car parking within the same block. Directly outside you will find the U-Bahn station that will take you directly to the city centre, a 15 min journey. Accross the road you can find a large shopping mall and to the right from the hotel entrance as you exit is a supermarket and a 100m stroll to the S-Bahn that can take you directly to Wannsee and Potsdam. Don't let the commercial looking exterior view of the hotel put you off, on entering the hotel you will find a clean, comfortable and relaxed atmosphere beginning at reception and mirrored throughout the entire hotel. The ground floor has a bar that opens in the evening and rather grand stairs that lead up to the first floor where you will find a large open area with a lovely cocktail bar in one corner. Alongside the bar you will find a glass partitioned smokers room with wide screen TV and comfortable seating. The 4 elevators accessed from all floors are spacious and clean and as you step out onto the level that your room is situated you are greeted by large seating areas and beverage rooms where you can grab a free coffee or tea 24 hour per day. The rooms are very clean and well decorated, we were offered a room with a waterbed as I was told at reception that I could have a smoking room if I prefered, I did and was upgraded. The bathroom was a good size and the shower cubicle was spacious with a good shower. Plenty of towels are provided and you will find a cabinet on the wall where you can purchase any toiletries that you may have forgotten alongside the standard free soaps and gels that you would expect from a 4 star. The TV was a 22\" flat panel and offers the standard local and film channels along with CNN for those of us that need the occasional English/American language fix. Throughout the room you feel that care and thought has been applied to ensure comfort and warmth, even the minibar is blended well into the furniture. Luggage and clothes storage is good and the bed was very comfortable. Another family member had a single room with a double bed and same size bathroom and their thoughts are reflected in this review. Other reviews have mentioned the high quality of the staff here and I have to agree, polite, helpful, friendly and personal. Nothing seems to be a bother and we were recomended to a local eatery called \"Hoppegarten\" that offer classic Berlin/German dishes and good beer just 5 minutes stroll from the hotel, what a fantastic place to spend an evening (Reviewed Seperately). In Summary, a good quality, clean hotel with excellent staff and very spacious and comfortable rooms, perfectly situated just outside Berlin city center serviced by on-the-doorstep public transport. Add to that the free WiFi throughout the hotel and the local shopping, it has to be a winner. Hard to beat this one for an all rounder.", "Date": "May 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Basic Hotel with Great Staff”", "Author": "pauljer", "ReviewID": "UR58599816", "Content": "This is a very simple hotel, a stone’s throw from Bahnhof Rathaus Steglitz Station. This is the railway station served by the Berlin S-Bahn, and U-Bahn. The rooms are basic and have coffee and tea making facilities and wifi. The hotel has a restaurant but no gym. But customer service here is NOT basic. On the contrary, it is exceptional. Repairs, callbacks, orders are all handled with a sense of urgency. There’s always immediate resolution for any requests or problems. A fellow traveller, BeRt was given the same room he had two years ago. It was dejavu when he stepped into the room and all the nostalgia of him and Sophia came flooding in. The staff here not only make sales….they make customers. Customers will will give them repeat business all because they are attentive to details. Good customer service is the lifeblood of any business. You can offer promotions and slash prices to bring in as many new customers as you want, but unless you can get some of those customers to come back, your business won’t be profitable for long. Good customer service is all about bringing customers back. And about sending them away happy – happy enough to pass positive feedback about your business along to others, who may then try the product or service you offer for themselves and in their turn become repeat customers. That’s exactly what I’m doing now with Best Western Steglitz, Berlin (www.perfyi.wordpress.com)", "Date": "March 15, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Houston, Texas", "Title": "“no charm..just a place to sleep”", "Author": "kajadu", "ReviewID": "UR22117951", "Content": "Were given a room w/the view of a wall, so changed to street view. Not much better. No charm at this hotel. Utilitarian. No tub, just shower stall w/squeeze soap. Do they have to do that? A cake of soap is a small thing to ask..Large room. uncomfortabel,lumpy bed, TERRIBLE pillows. Good breakfast,full buffet w/omelettes made to order.", "Date": "November 23, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Ramat Gan", "Title": "“Very Good chioce!!!”", "Author": "EdiMeir", "ReviewID": "UR20602048", "Content": "Been there 3 night's with my wife and baby boy (1.2 year old), got the junior suite upgrading free of charge. and i got to choose regular bed or water bed, took the second one again free of charge. the location is far from the center of berlin but not so far with urban train that locate 5 steps from the hotel, only 15 min away. easy to use and with a baby too. There 3 min walk to a great shopping mall and a cheap supermarket in the hotel building. Next time in berlin we will be there again.", "Date": "October 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“OK but no A/C in the summer is hard”", "Author": "gemmellian", "ReviewID": "UR8017430", "Content": "Pros: - This hotel is very conveninently located to our Berlin site (within 5 mins walk) and makes for a very pleasant walk on the way to work - and back - everyday. - The breakfast buffet is excellent for the price (9 euros) and better if you could get it included in your room pricing. - Had dinner in the restaurant downstairs and the herrings were just superbly done (they are now in season). Say Hi! to Herr Schmidt - he will take great care of you as your waiting staff. - Super conveninent location of the Ubanh (subway) to anywhere else in Berlin and using a day pass if sightseeing (only 6 euros) - There is a mall right across from the hotel where you can purchase almost everything that you might need - There is a grocery shop next to the hotel where you can get snacks and drinks during your stay Cons: - No A/C. I was there when it was over 30C and while there is a small portable fan in the room, it was clearly not enough. A revamp of the rooms with A/C unit would be most appreciated or even if there were some suites (I would pay the extra $$) with such amenities. - The snack vending machines in the hotel are rather lacking in variety so plan ahead and just go to the grocery store - No TV5 French Channel!! Almost everywhere else I go in Germany, I am able to catch my favourite French channel but not at this hotel - Wireless internet access is available through pay cards in installments of a number of hours. I found it rather expensive. - No easy access for ice cubes. I had to go fetch downstairs in the restaurant where they gave me a full bucket (yes, the one that you put the bottles in the ice) so not very convenient. - Room service menu is very limited. I tend to eat in the first night I arrive (jet-lagged and all) Due to its location and pricing, I will go back there but I just hope that it will be in the spring or fall and not the summer.", "Date": "June 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Alabama", "Title": "“Great Hotel, Good location”", "Author": "OldDog58", "ReviewID": "UR6045580", "Content": "I stayed a week at the HSI in August as part of a Berlin Veterans reunion. Reservations were a snap on the hotel's website, and check-in was a breeze. The hotel is an older facility but is very well maintained with renovation since my last stay there four years ago and, most importantly to me, it is clean. Anything I needed was provided immediately. The rooms are not airconditioned but fans were in the rooms for use if needed. Being from the deep South, the cool low-humidity days and nights were a welcome break and air conditioning was not an issue. The windows open wide and allow for plenty of ventilation. The restaurant is a little pricey but there are all kinds of food options available within easy walking distance, from a grocery store and bakery next door to the new Schloss Mall with a wide variety of restaurants. The hotel is located in an area with many shops and stores. Several banks with ATM machines are within 200 yards. Transportation is a snap with the U-bahn and S-bahn stations within 100 yards, and bus stops in front of the hotel. Downtown (Ku'dam area) is about 10-15 minutes by subway. The staff, from desk personnel to housekeeping were very professional, efficient and eager to assist with everything from giving change for large Euro bills to advise on getting around town. Would I stay there again? Absolutely and already have plans to do so.", "Date": "November 2, 2006"}], "HotelInfo": {"Name": "BEST WESTERN Premier Hotel Steglitz International Berlin", "HotelURL": "/ShowUserReviews-g187323-d199403-Reviews-BEST_WESTERN_Premier_Hotel_Steglitz_International_Berlin-Berlin.html", "Price": "$84 - $1,310*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Schlossstrasse/Albrechtstrasse 2</span>, <span class=\"locality\"><span property=\"v:postal-code\">12165</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "199403", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/e9/df/e9df4c93b504342c72b57a93af74ebcc8large.jpg"}}