{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "croxley green", "Title": "“Great Hotel”", "Author": "hehoodares", "ReviewID": "UR127577173", "Content": "The Berlin Mark is in a great location approx 3 minutes walk from the main shopping road in Berlin in the Charlottenburg area. The hotel is very near to lots of restaurants and bars and U Bahn stations (Tube) we did not have a breakfast included but have stayed here before with breakfast which was very substancial. The hotels comfort rooms are very good & clean and quite spacious, but no tea/coffee making facilities in the room. The staff are very friendly & helpful. I would thouroughly recommend the Berlin Mark", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dunbar", "Title": "“Location,Location,Location !!!!!”", "Author": "Cerirp", "ReviewID": "UR127192701", "Content": "This hotel is in the ideal base for exploring the city of Berlin. Only 20mins by bus or underground from Tegel Airport, and just ten mins walk from the train/bus terninus. The hotel is surrounded by a host of wonderful eating and drinking establishments manned by lovely friendly people. There is even a Hard Rock Cafe at the bottom of the street!!! The Zoo is a brisk ten minute walk away and a must see attraction. The hotel staff are friendly and welcoming, the room was fine but beware if you book room only the breakfast is 16 euros each (ouch) for a continental breakfast. We ate at the Imbiss down the street for a third of the price and the food was excellent. Overall an excellent base which we will use again.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Zwolle, The Netherlands", "Title": "“Nice hotel to stay for city trip”", "Author": "HelloHelloNL", "ReviewID": "UR126617148", "Content": "Nice, clean and comfortable rooms. Due to its location next to the Kurfurstendamm, the hotel is very good accessible by public transport. Breakfast was not included in our booking ( we found it overpriced), so we went for breakfast in Kaufhaus or other options in the neighbourhood. The only thing that was missing, to my opinion, was a small water kettle in your room to make yourself a cup of tea or coffee.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Huddersfield, UK", "Title": "“Good enough for us”", "Author": "Alan_Joanna", "ReviewID": "UR126189358", "Content": "Stayed here for 4 nts from 12-15 March. Room was a little small and at the back of hotel but otherwise comfy enough. Didn't spend too much time in the room so it was fine. Bathroom had bath and shower. Take your own travel kettle and tea/coffee as most rooms don't have facilities. There is a great supermarket called Ulrichts under the bridge at Zoo station where you can everything you need at very cheap prices 500ml of Berliner Pils for 69 cents. Hotel easy to get to by train from Schonefeld airport. From Zoo station only a 10 min walk - cost 3 euros per person. There are also 2 U-Bahn stops close to the hotel (5 mins walk). In summary a good base in the West of the city for exploring Berlin. If we go again would probably stay in theEast of the city as we preferred the nightlife there.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vienna, Austria", "Title": "“good value for money”", "Author": "OF665", "ReviewID": "UR125546100", "Content": "I stayed in this Hotel several times and for the price its worth it. clean room central location next to Kudam good breakfast", "Date": "March 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vicenza", "Title": "“Great Bargain”", "Author": "Jpp1981", "ReviewID": "UR125065221", "Content": "We stayed at the Berlin Mark for 4 nights in February 2012, I booked the 1st Class Room on Hotels dot com because I noticed this great offer: 66 euro per room per night with breakfast included + free usage of the business lounge ( a little room where we had breakfast served until 11am and with free soft drinks all day long). Our room was nice, not small neither big, but clean and with a nice bathroom. The hotel is very close to Kufurstendamstrasse, and the U service (metro) is a 5 minutes walk (Uhulandstrasse) I would suggest this hotel, but have a look at the internet offers in order to obtain a great bargain!", "Date": "February 23, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Reggio Emilia, Italy", "Title": "“Modern hotel”", "Author": "ITA_And_RE_a", "ReviewID": "UR124716840", "Content": "Location is fabulous - close to the zoo and the major West Berlin boulevard and tons of shopping, restaurants etc. The sushi bar in the hotel is trendy with loud Euro-house music, but there are lots of good restaurants in the area", "Date": "February 17, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Eindhoven, The Netherlands", "Title": "“Good location, clean hotel, good breakfast”", "Author": "bowie89", "ReviewID": "UR124248703", "Content": "The hotel has a great location in the side street of the Kurfurstendam and a few minute walk to the Zoologischer garten. Also the metrostration is a one minute walk from the hotel. Around the corner are a few clubs where you can go out and at the Kurfurstendam you can take a touringcar for sightseeing in Berlin! The hotel itself was good. Some corridors were a bit stale and the carpet was a bit dirty and old. But the rooms were good and clean. Breakfast was great because it was very extensive. The only small disadvantage I experienced was that the service desk wasn't very helpful and the wifi is very expensive.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Venice, Italy", "Title": "“Clean central hotel, with convenient business lounge”", "Author": "thearabsmith", "ReviewID": "UR123614775", "Content": "Modern hotel in a great location. The decor is a wee bit passed it's best, but nevertheless, this is a clean hotel with adequately serviced rooms. We booked a business double room, which came with free access to the well stocked business lounge and free wifi - worth the upgrade, for drinks alone (non-alcoholic). True test-we'll probably be back:)", "Date": "January 25, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Framingham, Massachusetts", "Title": "“Good location and adequate”", "Author": "eshaw388", "ReviewID": "UR123261475", "Content": "The best thing about this hotel is the location, close to shops and public transportation as it is near Kurfurstendam. The accomodations are simple and adequate, just fine if you plan on touring the city instead of spending lots of time at the hotel. The service at the front desk was mostly unfriendly and unhelpful though so don't expect four star service there.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Estonia", "Title": "“Central but quiet...”", "Author": "TravelEst", "ReviewID": "UR122507370", "Content": "The location of the hotel is great because of proximity (300 m) to one of the most central parts of Berlin (Zoologischer Garten). The lobby and the restaurant are nice and look posh on the pictures, but the rooms are quite simple and a bit tired. Our shower stand (no bath tub) was leaking and hotel's carpeting was rather dirty (especially in the hallways). We took a business-deal room with WiFi included in the price, with breakfasts in a separate room (same food though), and coffee-tea and fruits free of charge all day long. The staff was helpful although there was nothing special - we didn't get the feeling we were welcome at the hotel. At some point they said that our room wasn't going to be ready by 3 PM in order to check in, but they were still able to provide a room a few minutes before (we arrived at 7 AM and really needed a room already - everywhere else in Berlin we have been able to get a room way before the check-in hour). Overall - nothing especially positive, but nothing particularly bad either.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Well located, clean and perfectly adequate. Helpful staff.”", "Author": "Runlollyrun", "ReviewID": "UR118714207", "Content": "Near to shops and stations. Room small but comfy and shower good.", "Date": "September 28, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Borris, Ireland", "Title": "“Ideal for Berlin stay !”", "Author": "toberdaly", "ReviewID": "UR118263732", "Content": "We have used this hotel about six times and always found it most satisfactory. The staff are very efficient and helpful and this last visit provided us with extra accomodation to convenience friends, ie a small suite rather than a double room. This was hugely appreciated. The breakfast is excellent. The rooms are spotless and comfortable and the situation could not be bettered-just off the Kurfurstendamm and a short walk from the Station at Zoologisher garten", "Date": "September 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "York", "Title": "“Great place to stay in Berlin”", "Author": "lp2706 Posted by an OctopusTravel traveler", "ReviewID": "UR117267183", "Content": "Clean and good-sized room. Great location, within walking distance of centre of Berlin and all sights/attractions. Would recommend.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Frederiksberg, Denmark", "Title": "“Nice and well situated”", "Author": "806262", "ReviewID": "UR116947869", "Content": "Nice hotel close to the eastern part of Kurfürstendam and close to the Zoo and Tiergarten. Hotel is listed as a four-star hotel which seems a bit over-rated as the rooms are quite small. However, the hotel is nice with professionel and helpfull staff. We have no problems recommending the hotel for a stay in the very exciting city of Berlin", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "2.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Overhyped”", "Author": "BennBennjamin", "ReviewID": "UR116580919", "Content": "The website of the hotel made it sound way better than it actually is. For a four star hotel, they do not offer free wifi to everyone, and business/first class rooms are only allowed one wifi code per room, even though most people travel with at least another person. To make things worse, we upgraded to a first class room, and even though we paid the extra money, breakfast isn't included. When we booked the hotel, nobody made any mention of breakfast being included. And the website boasted extended breakfast hours for first class guests. The ladies working the front desk are rude and unpleasant. They are unwilling to help and are consulting with each other on every single question we asked, including what the check out time was. The hallways do in fact smell, and it is next to impossible to open the door to the business lounge. Their website also boasted free wifi in the business lounge's computer, but by that, they mean you have to log in with the one code you were given. They say you can get wifi in all of their rooms, but that is untrue. We are staying in a first class room, but there is no wifi reception whatsoever. If you're upgrading to business/first class for the unlimited pop, don't get your hopes up because they only leave 1-2 bottles of pop out and do not restock in a timely manner. The locks on their first class and business class rooms are also impossible to figure out. How can a door have no handle on the outside? All in all, they definitely make everything sound way better than it really is. I would compare this to a hostel rather than a hotel. Don't waste your time coming here, especially if you want to use their business facilities.", "Date": "August 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Boulder, Colorado", "Title": "“Stay away from this hotel!”", "Author": "MLaguna", "ReviewID": "UR116551940", "Content": "We booked this hotel for a winter stay that we had to cancel due to the severe weather that closed Heathrow. After many phone calls from the United States, the hotel agreed to give us credit for the two rooms and the two nights that we had already paid. The agreement was to pay a small difference. When we arrived, we showed the email with the agreement to the front desk person, and she told us that \"everything was in order\". However, when we checked out, the story changed and after a long discussion, we ended up paying not only the agreed upon difference but also the full price for one if the rooms. The front desk personnel, including the manager, were incredibly rude and unpleasant. The hotel is not a 4*, I would not give it even two stars. The carpets are dirty and there are holes on the ceiling and the hallways have a terrible smell. This is not a good hotel and the staff had no problems cheating a customer out of money.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "UK", "Title": "“Good hotel, good location; nothing amazing but nothing wrong with it”", "Author": "RD11", "ReviewID": "UR116386680", "Content": "The hotel is in a good location, easy access to all public transport. The room was plenty big enough with a nice clean bathroom and good shower (on 6th floor). Our room was facing the back and was quiet; friends who had a room at the front said it was quite noisy, but the street isn't too noisy in general. The hotel staff bought things up to the room as soon as you asked (extra pillows/ towels etc), and they were friendly and helpful, as were the reception staff. We didn't eat the in the hotel; plenty of eating places about, including breakfast. There was no safe in the room, you may have been able to get one. You could leave your luggage before checking out and after checking out no problems.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Athens, Greece", "Title": "“The worst hotel for a trip”", "Author": "mary1980_11", "ReviewID": "UR116352453", "Content": "Last year i went to Berlin with my university and we stayed at this hotel. The rooms were terrible ,the most of them did not have any windows.We have booked triples rooms and they gave us double rooms with an extra bed which actually was a sample of bed,it was very very low with a very thin mattres and was making noise when you sit on it.We asked a better room and they gave us a very very rude answer and a big no.In the end they gave us a better room (from all the children only to us) only when our teacher argument with them.The new room was for 4 people but in bathroom didn't fit even 1 person.The only good in this hotel is the location and the breakfast.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Nothing to complain about”", "Author": "anu_ellen", "ReviewID": "UR116289885", "Content": "Excellent location to explore the city, public transport system really good, reliable and fast. If you like shopping, it's just around the corner of Kurfursterdamn, big shopping street. For restaurants and bars unfortunately only a few to recommend close by to the hotel. The hotel itself was ok, the room was a bit old, so as were the corridors. But the room had everything what was needed, the view from the window wasn't very appealing, hotel's rubbish area and Lidl's car park. Helpful staff. Breakfast if not included 18 euros, lot's of nice cafes outside the hotel and cheaper. Overall a very good stay and Berlin is absolutely great.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Wexford, Ireland", "Title": "“Fine Hotel, happy with it.”", "Author": "Muurt", "ReviewID": "UR115288885", "Content": "Only negative was that the suite was a bit small but at least the rooms were divided, we were 2 adults and 2 kids. We didnt eat in the hotel, just left in the mornings and came back in the evenings, no hidden charges and happy with the price. €97/night for the 4 of us. Have to say i thought the staff were very friendly, even when i was bothering them twice daily for the use of their safe deposit boxes which are behind the counter. Im recommending it to my father and brother who are going to Berlin this Autumn. Like others said, i'd give the breakfast a miss, €12/adult is steep and we preferred exploring and finding new places, which were numerous.", "Date": "July 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "2"}, "AuthorLocation": "New York City, New York", "Title": "“Terrible staff, below average hotel, mediocre location.”", "Author": "kmartinelli", "ReviewID": "UR108203763", "Content": "Although the hotel is ok - by no means great - I had a terrible experience with the staff who were mean, rude, and not at all helpful. Whatever you do, don't upgrade to the business double as this only causes confusion and trouble, at least in my experience. The location is not particularly good or near anything, unless the Hard Rock Cafe is an important landmark for you. No amenities. The rooms do not look like the photos.", "Date": "May 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Nijmegen, The Netherlands", "Title": "“Good location, good rooms, staff not very friendly”", "Author": "Frederik1983", "ReviewID": "UR107330065", "Content": "Stayed here for two nights in early may. Excellent location, right off Kurfürstendamm and close to the U-bahn station for easy access to central Berlin. The room was ok. It was clean and large enough if you are only staying a few nights. Our room was at the front and there was some noise at night from the busy street below. Staff at check in desk was not very friendly, they were having a conversation when we arrived and did not really acknowledge us until they were finished talking. It gave me the feeling that they had more important things to do than deal with us. Would have expected a bit more hospitality, especially since one of them was a duty manager. Other staff we encountered during our stay was much more friendly and helpful, particularly the ladies in the breakfast room made an effort to make us feel at home. 4/5.", "Date": "May 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bagenalstown, Ireland", "Title": "“Excellent hotel, Excellent Price, Excellent Location, Recommended!”", "Author": "Avryl87", "ReviewID": "UR104286969", "Content": "Great Hotel at a great price... This is not a five star hotel, but it's location is perfect on the main shopping street. The room is what you would expect in any ordinary hotel. It is clean with a great shower, mini bar facility, air conditioning etc. The bed wasn't very comfortable but that's only a small complaint! I would recommend this hotel, the location is superb. The hotel is only a five minute (stroll) walk from Berlin Zoo, ten minute walk up along the main shopping street you will find - Karstadt and Ka De We etc - Huge Shopping Stores. A ten minute train journey will get you to Reichstag, Brandenburg gate etc. Hardrock Hotel is located at the top of the side street that this hotel is located on - recommended. A visit to Ka De We foodcourt is a must... really, include it in your plan... you can spend hours walking around tasting all kind of different foods", "Date": "April 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bel Air, Maryland", "Title": "“Typical Berlin Hotel Room With Great People”", "Author": "kwebb100", "ReviewID": "UR102539900", "Content": "I stayed a week at the Berlin Mark because my regular hotel in Berlin was not available. I always stay in the Berlin West City Center area because of the great restaurant choices, stores and things to do and see in the neighborhood. I don't like to spend a lot but I am a fanatic for cleanliness, quality and great customer service. The Berlin Mark has good sized rooms. It also has very quiet rooms. Rooms are older Euro style with upscaled lighting and TV. Not a bad room but it would have been nice to have in-room coffee and free internet (e10.) that is becoming more common in Berlin. The hotel staff are very good. They go out of their way to be helpful. The bar staff is great as well as the reception folks. I found the restaurant breakfast good but over priced (e15). I ate breakfast out during the week as there are better local choices. Parking structure next door was very convenient and well worth the e12. daily cost. A solid 3-star hotel with a 4.5 star staff. With a little work, this could be one of the best hotel choices around. Currently I would call it slightly above average.", "Date": "April 2, 2011"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0"}, "AuthorLocation": "Bergen, Norway", "Title": "“Good placement”", "Author": "Palmene", "ReviewID": "UR102127807", "Content": "A nice hotel with a great location right behind the \"main street\" and close to public transportation. The room was OK but a bit shabby. Cleaning service was good. The bed is your typical hotel-bed: hard as hell and making extreme noise when you move just a little bit. Feels like your'e waking up the whole hotel when turning over. The pillows were way to soft and you had to compress it 4 times to get any effect. The TV was located not in front of the bed but beside it, so that made it hard to watch TV, but all in all, the room was absolutely OK for a few days. The only really big disappointment was the breakfast. Not the quality of the food or the service of the chefs/waitresses but the fact that the people in the lobby asked us if we wanted, and I'm quoting: \"breakfast included for only €6 pr. person pr. day\" - Only €6 pr. day pr. person we said, \"Yes, €6 pr. person pr. day\". When we checked out we were told it was €16 pr. person pr. day. Ended up paying €96 for a simple breakfast we only barely tasted. So they got us there... Internet was €10 pr day. All in all, OK location, medium rooms and expensive breakfast.", "Date": "March 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "manchester", "Title": "“Exactly what it said on the tin!”", "Author": "dinglenoam", "ReviewID": "UR100950274", "Content": "I booked this hotel for our weekend in Berlin mainly based on price, although I was a little concerned about some of the reviews. We were very happy with it htough, it was exactly as described, a well priced, located 3 star hotel. It is on a quieter side street off the main shopping area in Berlin, the nearest tube station (handy for getting from the airport) is less than 5 minutes walk, the Hard rock cafe is at the end of the street and also lots of little local bars and restaurants. The room sized was pretty standard with comfy beds, small but functional bathroom and no noise disturbance. Very happy with what we got and would definately stay again on a return visit.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Excellent location and great value for money”", "Author": "MaryH13", "ReviewID": "UR96725330", "Content": "The Mark Hotel is very central to all transport/ sights and amenities, also the Berlin Zoo was close by and well worth a visit. We stayed for 4 nights and thoroughly enjoyed our stay. The rooms were small but clean and the staff were friendly and polite. We would visit Berlin again as there was so much to see and do in the city and would certainly consider staying at the Mark again", "Date": "February 15, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Espoo, Finland", "Title": "“disapointment”", "Author": "jenninen", "ReviewID": "UR92288587", "Content": "We stayed at Berlin Mark Hotel for 4 nights in December. I got a good deal from hotels.com and read reviews from Tripadvisor in advance. The room was average sized and worn out. Definitely not a four star, I would call it a three star hotel. There was also a big hole between the wall and the floor. And the carpet was torn. Beds were hard and the pillows were unbelievably bad. We asked and got extra pillows from the reception but that didn't really help. The service wasn't what you could expect from a four star hotel. The staff was bit rude and did not really take our concerns into account. The use of the business center was expensive. We had to pay for the hour but really needed it just for the online check-in for the flight. The location was good if you want to stay in the west.", "Date": "January 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Great for business stay”", "Author": "Mitsos6", "ReviewID": "UR87731233", "Content": "Very good value for business stay. Free internet for business rooms included. Business rooms have small desks, but you get rewarded by the separate breakfast room you have on the first floor. Very quite and not crowded on the weekend. Very helpful staff, ready and eager to assist you, meeting room on 4th floor ok, business center available. Transportation from/to Tegel airport easy, just one bus away. On the downside, the car park right on the back side was a bit noisy with drunk Halloween party people swearing in the middle of the night, but I guess that was all over Germany on that particular weekend :-)", "Date": "November 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Muncie, Indiana", "Title": "“Clean, comfortable, corporate”", "Author": "D0ublebass", "ReviewID": "UR83019763", "Content": "I just got back from 5 nights at the Mark. After dealing with the transportation issue flying in from Tegel airport -- it seems as if you could take the U-bahn train in, but you can't. Here's a tip - take the S-Bahn Bus 109, just outside the terminal. You'll need to buy a zone A-B ticket for 2.50 euros. You get the ticket from the machines outside by the buses -- but be aware, the ticket machines looks as if they take credit cards, but actually only take euro debit cards - so have cash. Once you get the ticket, then be sure to validate it (this goes for all the trains too). You validate the ticket on the bus - there is a machine with a slot that you push the ticket in and it makes a cut in the ticket. The tickets only give you a limited amount of time to make the trip, so don't buy the ticket a day in advance. Then take the bus to the Ulandstrasse stop -- about 15 minutes into the trip. This stop will be just past the intersection of Ulandstrasse and Kurfurstendamm. Keep walking in the direction of the bus a half block to Meinkestrasse and then take a right (the only way you can go on this street). The hotel is a couple of blocks down on the left hand side. The alternative is a taxi that will set you back about 18 euros... the difference is the price of a good meal! The hotel is much like any big chain hotel - very nice and clean - with a trendy sushi restaurant on the first floor (loud house music). For a great cafe - go out the hotel front door and make a left. You'll come to Lietzenburger Strasse right away, make another left to get to Joachimstrasse in one block. Make a right on Joachimstrasse and then go to the next corner and make a right -- the cafe begins with a \"P\" - like Pippi or something. Skip the 8 euro breakfast and eat here. They have wonderful crossiants, coffee, sandwiches etc. and all very reasonably priced for the area. Of course there are many choices on Meinikestrasse and up on Kurfurstendamm, which is the main West Berlin boulevard. The Starbucks on Kurf also has free wifi for 2 hours, something that the Mark won't give you unless you pony up an extra 10 euros/night for a business class room. But the comfort level room was fine -- like a Holiday Inn or similar. Not tons of space, but large enough to get around in comfortably. There is a small fitness room with a track - but you're much better off going for long walks and sightseeing. I found the staff to be very efficient and helpful - they have a direct line to the taxis - they push a button and a taxi appears in usually under 5 minutes. Got a great rate and had a discount card from Expedia -- I'd stay again.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "City of San Marino, San Marino", "Title": "“Decent for a 3-Star Hotel”", "Author": "mugwump888", "ReviewID": "UR82501139", "Content": "I stayed for a bit more than a week. Best thing about the hotel is the location. Rooms are rather basic. Nothing stood out as particularly good, but I disliked that the rooms are very dimly lit (in the end, management provided a floor lamp), the mattresses are extremely soft and bouncy, and there is a lot of noise in front of the hotel both late at night and very early in the morning (morning deliveries). I recommend against eating at the sushi restaurant in the hotel. One of the staff suggested an Italian restaurant called Stella di Mare two blocks away; food there for lunch was average, but the price/performance ratio was amazing: 5 euros for starter, pizza for main, and an espresso.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Nice hotel, great location and informative staff”", "Author": "crys94", "ReviewID": "UR81873067", "Content": "Nice hotel with informative staff. We were a little disappointed that we could not get early check-in when we arrived at noon, but they made up for it by giving us a double-room. We had more room than we needed! The room was very clean and the beds were comfortable. Shower was pretty small, but functional. One thing that bothered us was the thin, cheap carpets in the rooms. I’ve never really thought about carpeting in hotels, but I guess it makes a difference. Another minor thing to note is the elevators being really small. On our check-out day, we had to wait awhile until we could get on an elevator that wasn’t full (we stayed on the 3rd floor). There is a business room located in the lobby area with 2 computers working with wifi. Also a pretty fancy Japanese restaurant. The location is excellent. Plenty of restaurants within walking distance. Hard Rock Cafe Berlin is right around the corner and about a 10-minute walk to the Kaiser-Wilhelm Memorial Church, Europa Center and train stations. A few buildings next to this hotel was a delicious and cheap bakery we ate at in the mornings. It’s located right next to the convenient store and grocery store. The grocery store is also a great place to get some cheap candies and chocolates for gifts.", "Date": "October 2, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Mein Urlaub in September”", "Author": "davidrichards69", "ReviewID": "UR81360198", "Content": "Great location, just off the Ku'damm and just a few minutes walk from Bahnhof Zoo (Zoo station) which has direct links to the main airport and the main station. Lots of good places to eat and drink on the Ku'damm and nearby streets. Rooms are a decent size, beds are nice and comfy, showers are hot and powerful, staff are friendly and the place is clean. I'll definitely stay there again the next time I visit Berlin.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Greed is good”", "Author": "uk2dubai", "ReviewID": "UR79654088", "Content": "Run of the mill hotel, with some typical german features, like leaving a 20 euro deposit for an adapter, must be a big problem for them to create forms and procedures for the odd person using another plug. Like always in germany totally impossible to get eye contact with front desk staff, what ever is on that computer screen must be really important, so important that you can not look into the eye of the guest paying the bill. Trying to be trendy, not manaing to pull it of, rooms are ok, a bit on the small size, but Berling is a big city and space is at a premium. Everything works well in room, even the 28 german tv channels, and the two english ones. Apparantly majority of guests are domestic. Breakfast was good, good choice, busy and fast. Other meals i try not to have in the hotel, like most others I guess. Problem with hotels in Germany, is that when there happens to be a trade show, the Rack Rate - one of the few places in the world you actually do pay rack rate, tends to double.. and the 150 euro the first two nights was reasonable for what was being offered, but i fail to see how supply and demand only can make the same room become a 300 euro room, just because there are some IT people in town.. I know, I know..I could have stayed away, and I will next year..", "Date": "September 15, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“it's ok, nothing more and nothing less”", "Author": "JMX2016", "ReviewID": "UR78802940", "Content": "First the good points : the location is great. 10 min walking distance from zoo bahnhof, 2mins from Kudam in the morning you could find some water and fruits complimentary in the hall next to the reception. I found this to be a very nice touch. the hotel is also spotless, very clean. the less good points : when I booked my room I specified I wanted a King size bed. when I arrive I was told that the room didnt have any king size beds, but 2 twins beds that could be put together. this is what we did, but the beds kept moving apart during the night. very inconvenient! the pillow are also the worst I have experienced so far. made out of the cheapest foam. and you just get one per person, not even one reserve in the wardrobe as in every other hotels the hotels room are also not available before 15h. ok this was specified when I booked. but as I heard later, some rooms were innocupied when we arrived, so why not make an exeption? this is not very customer oriented. the front desk staff is also very formal and cold. don't wait for a smile, you won't see any. but I have to admit that they acted profesionnal and were polite. I might go back but I wouldn't pay the same rate", "Date": "September 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "medway, kent", "Title": "“Excellent Experience”", "Author": "melon_lover", "ReviewID": "UR77154760", "Content": "I have just come back from a 3 night stay at the Mark. This is definitley by far the best hotel i have stayed in on my travels to Europe. Excellent value for money, friendly approachable staff and very very clean. The bed was soo comfortable that we slept in most mornings!! It is very accessible to the city having Kurfensdamm U-Bahn around the corner and Zoo S & U Bahns approx ten minute walk. Berlin is such a HUGE city that it would be quite dificult to find a hotel close to everything anyway! The only thing i would say in a mildly negitive way about the Mark, is that there are no tea and coffee making facilities in your room. I have never stayed at a hotel without this facility so was very surprised, you do however get a mini bar. which is quite reasonable by mini bar standards. I would highly reccomend Marjellchen Restaurant in Mommsenstrasse 9. It is a traditional german restaurant, the food was superb and the owner made it a memorable experience, you can easily get a taxi to it from the Mark for 5 Euros. The volume of places to eat aand drink is phenomenal and i can safely say we did not have any complaints. The Berlin wall was a truly somber place, be prepared to well up. If you get a chance visit Berlin Zoo, i have never been so close to a Lion in my life, amazing! All in all a very pleasant hotel and Berlin is amazing, from the food, drink and amazingly nice people (i have never met such friendly people) I will definitly be visting again and will re-visit the Mark!", "Date": "August 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Devon", "Title": "“Excellent Value & Location”", "Author": "Wivelrod", "ReviewID": "UR76140992", "Content": "We booked the hotel for both location and the deal we were able to get. The room was good with a small but functional bathroom. We did not eat here but there are plenty of good bars, Imbiss and restaurants in the area. I would recommend the bar/ restaurant opposite for both service and quality of food & drink true German style..", "Date": "August 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Warrington, United Kingdom", "Title": "“Great hotel in every way”", "Author": "AndyHargreaves", "ReviewID": "UR75643974", "Content": "We were really impressed with this hotel. The room was as spacious as we had expected, good air conditioning and clean en-suite wc/shower. The hotel in general is very smart, the staff are friendly and helpful, and we had a lovely holiday. The breakfast is fairly expensive for what it is - €12.50 each, including eat as much as you like, usual continental breakfast fare. The restaurant was fairly busy each morning, as we soon found the \"Alt Berliner Biersalon\" around the corner on Kurfürstendamm (near U-Bahn station) was excellent, and their various breakfasts cost €5 - €9 each. We ate at the various other bar/restaurants on Meinekestraße, and found them mostly excellent. The one opposite the hotel entrance is good, as is the German restaurant on the same side of the street, closer to Hard Rock Cafe. One thing to note if you are travelling this summer - U1 U-Bahn line is not running along most of its length until September 2010, so avoid that. We found the Zoologischer Garten station to be much more useful than Kurfürstendamm, and only a few minutes longer walk. Overall an excellent holiday, great hotel, and we will definitely return to the Mark hotel.", "Date": "August 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Milton Keynes, United Kingdom", "Title": "“Not as clean as expected - and avoid the food”", "Author": "IvorQ", "ReviewID": "UR75031634", "Content": "We arrived as part of a tour group and were allocated to a large, but not so clean (by German standards) room. We had group dinners booked for that evening and the next, byut after experiencing the first dinner we went awol for the second one. I LOVE German food, but this was poor. Breakfast was confused, chaotic and equally poor. The reception staff were friendly, but the loud (techo? 'music') blaring out of the bar make it a no-go zone. There are great bars and restaurants near by - and amazingly none too expensive!", "Date": "August 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "goldengirlies", "Title": "“Badly treated”", "Author": "anothergoldengirl", "ReviewID": "UR72897257", "Content": "Having booked 1 double and 2 single rooms on May the 7th for the Berlin Mark Hotel. We arrived for our 2 night stay on July 26th to be told, \"we have a problem, we have over booked and don't have rooms for you, we've booked you in our sister hotel 'Grand City' so you'll need to go there\". I was waiting for an apology but didn't get one. Not wanting confrontation we decided to bite the bullet and go to 'said hotel'. Surely it will be the same quality thought I, being a sister hotel. How wrong was I. Met by a very rude young women and given our keys we made our way to our rooms the size of a walk in cupboard, without air conditioning, (I must add that is a must when I book any hotel room) Did i complain further, well no because I was worried we'd have nowhere to stay having been treated as we had I just felt they didn't care one bit, so we just tried to make the most of it. I was so angry, mostly at myself for not digging my heals in and saying no thank you, it really spoilt my stay in Berlin. I just cannot understand why we hadn't been notified earlier to give me the opportunity to choose another hotel. Anyhow the moral of this story is, Do not stay at either hotel. Berlin is a lovely city though!", "Date": "July 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ashby-de-la-Zouch", "Title": "“Great Hotel - Don't bother with Breakfast”", "Author": "AndyGriff1", "ReviewID": "UR71859026", "Content": "This hotel was great for the price paid. The room was amazing, twin bedded bedroom, with a separate lounge/kitchenette and an absolutely amazing bathroom. Both the lounge and bedroom were equipped with lcd flat screen tv's. Hotel is situated close to an S-bahn station, so easy to get about. Only real downside to this hotel is the breakfast. At 12.50 Euros you'd expect the fruit to be fresh rather than out of a tin. And the bottles of water and wine in the bedroom are not complimentary, we were charged at Check Out. The fridge was full of the usual expensive food/drink, but we assumed the ones in the bedroom were complimentary, but not so. The small bottle of water was 3.50 euros!", "Date": "July 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "canada", "Title": "“Nice rooms”", "Author": "leahgirlCanada", "ReviewID": "UR68398099", "Content": "The hotel is very close to Ku'damm and Zoo station so location is great if you want to stay in the west. Also within walking distance of Ka De We and other shops if shoppng is what you want. The hotel has a small reception with warm friendly staff with a nice sushi restaurant. The room though small was very comfortable and overlooked a courtyard away from the road. Very convenient to a lot of retsuarnts , fast food places etc", "Date": "June 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Livingston, United Kingdom", "Title": "“Great hotel, but a bit lax at book in.”", "Author": "Roy Little", "ReviewID": "UR63722285", "Content": "Have to agree with most posts that the hotel is very good. The only problem we had was at book in though. When we entered our room for the first time we were met with the sight of a packed suitcase, jacket and hand bag lying by the bed. We about turned went back down to the reception and explained someone was still using the room. Surprisingly, we were told that this could not be the case to which we said it most definatley was. The girl then appologised, went to book us in to another room. At that point I asked if it was non smoking to which I was told \"No, there are non left\". After a bit of a discussion I eventually got a non smoking room, only to find out it was a double. Fine for a couple, but not so fine if you're on a guys weekend away. We just put up with it for our 2 nights(needless to say both of us were hanging off both sides of the bed! Breakfast was great, as was the position of the hotel and I'd probably use the hotel again, but can't help but wonder what if someone less honest had been given keys to our room. We could have easily been burgled.", "Date": "May 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kingston, Ontario", "Title": "“great hotel in Berlin!”", "Author": "mystericj", "ReviewID": "UR61043992", "Content": "My one and only complaint is the price of the wireless internet - ten euros a night just for access, in such a lovely hotel, seems a bit anachronistic! But this is nothing compared to the excellent services offered by the Mark - it is within five minutes walk of the Zoo-station, an upscale shopping district, Kaiser Wilhelm Kirche and the zoo itself; it is clean, quiet, comfortable, and friendly; the block it is attached to has several little grocery stores, cafes and shops that are fun and practical (although steer clear of the Hard Rock unless you are completely famished!!!). The Tiergarten, the gay district and Charlottenburg Palais are all also easily reachable either on the metro or the overland train. I would definitely stay here again.", "Date": "April 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "newton mearns, glasgow, scotland", "Title": "“Comfort and location,location,location”", "Author": "bobmacNewtonMearns", "ReviewID": "UR59763729", "Content": "Stayed here from 21 to 27 March.Room spotless and kept that way.Staff were great and nothing to much of a problem.Breakfast good value when you can eat as much as you wish and drink enough coffee and friut juice to bathe in you cant do that in a cafe. Perfect location for shops and transport links.Been three times already I shall return.", "Date": "March 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“clean and comfortable - everything you need”", "Author": "backpacker888", "ReviewID": "UR59754682", "Content": "I had booked 4 nights in the Mark Apart hotel, having got a bargain through Expedia, but when I got there, I was told that I had been moved to their sister hotel - the Berlin Mark. I wasn't very happy about this as I was tired and sweaty and had walked past the Mark on the way to the Mark Apart. I felt that they could have emailed me in advance to let me know this, but I also knew that the Mark was more expensive, so I was getting a good deal. When I got there, check in was fairly efficient, although they struggled to find me at first and then I went to my room on the 7th floor at the front of the building. My original booking was for a double bed, but my room only had a single - no biggie. The bed was comfortable, the linen and towels spotless as was the bathroom. My only issue was that the plugs on both the reading lamps were held together with tape and on one socket the prongs were loose, so I elected not to use them. Also the TV had channels in many languages, but all three English channels were news channels (Sky News, CNN and BBC News); not exactly entertaining so a mix of channels would have been nice. I didn't eat breakfast there as it seemed a bit expensive but the Imbiss up the road did cheap breakfasts. It didn't open til 9am though, so apart from one morning where I ate at the Imbiss, I got rolls from a bakery and fruit from the nearby Lidl and set about exploring. Even though I was at the front of the hotel and there was a lot of street noise with the window open, it was very quiet with the window closed. No complaints at all, I'd be happy to stay here again.", "Date": "March 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Very nice stay”", "Author": "totheclub", "ReviewID": "UR58912096", "Content": "Just arrived back from Berlin yesterday after having a lovely stay in the Berlin Mark Hotel. The hotel is easy to find and is a very short walk from Uhlandstr. U-Bahn station. The hotel was very nice and modern. The rooms were lovely inside with plenty of room for clothing etc. Everything was spotless inside the room including the bathroom. The breakfast to a German staying in the hotel I would imagine to be top quality however there wasn't too many things there me and my friends enjoyed. It was typically eurpoean serving things like cold meat, bread rolls and funky tasting fruit but this would not put us off the Berlin Mark as it was expected staying in a German hotel. It is situated in a very nice area of the city but you do need to get a U-Bahn to find decent nightlife and tourist hotspots. The only complaint i could think of was a member of the concierge was a bit snotty to my friend when he asked for a taxi to McDonals, this was at 5 in the morning to be fair but you still shouldn't be snotty when providing a service for somebody. Apart from that there was no complaints and i would highly recommend the Berlin Mark to anybody.", "Date": "March 18, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Essex, England", "Title": "“Frst class business & family hotel”", "Author": "pickledpepper", "ReviewID": "UR57358902", "Content": "This is a very conveniently-situated hotel in a quiet street a minutes walk from the Ku'damm. We arrived at a quiet time for the hotel, and were allocated to a large room on the third floor overlooking Meinekestrasse. The room was large and well-appointed with plenty of room to move around, comfortable chairs and an occasional table, a flat-screen TV, mini-bar and lots of storage space for luggage and clothing. I found the decor a little sombre, but my wife liked it and she appreciated the large private bathroom with everything a woman needs in the way of space, shelves for toiletries, good lighting. Nothing left to chance, everything spotless and in good order. The bed was wide, firm and comfortable. Berlin was very cold and the pavements were piled with frozen slush outside, but the hotel was comfortably warm and snug. We were granted a Business Passport/Ausweis that gave us access to a private Business Lounge, free broadband access and a spare laptop in situ. By accessing the lounge we were able to avail ourselves of complimentary (self-service) soft drinks, tea, coffee and other beverages, and fresh fruit. Breakfast (not inclusive) was served in the business lounge between 0700 and 1100. This was a real help, and allowed us to prepare the business day in a calm, unhurried way. Breakfast was excellent at Euro 12.50 per person. Service polite, attentive and skilful. We didn't eat at the restaurant. We visited the Arlecchino Restaurant at 25 Meinekestrasse a had a very good Italian meal there on two nights of our stay, cheerful service, freshly prepared pasta and fresh fish, at very reasonable prices. The hotel is very near several late-opening shops (including a discreetly placed Lidl and an apothecary), there is a taxi stand at the corner of the street and the U'Bahn is a couple of minutes walk away.", "Date": "February 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "1.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Recommend”", "Author": "ahane", "ReviewID": "UR55239900", "Content": "Went to Mark Hotel, Berlin for long weekend in November to visit Christmas Markets and see sites in Berlin. Mark Hotel is very central to shops, transport (buses and underground). Rooms and restaurant very clean. Although we had breakfast in the hotel, it is too expensive at 15 Euros per person for continental breakfast. In the rooms after the first day there were no toileteries left, your towels would not be replaced unless you left them on the floor which we did not realise in the beginning. Bar area is very small and there is no entertainment whatsover. Receptionists and all staff were helpful. I would recommend this hotel. I have not been to the Christmas Markets previously, they are fantastic, we thoroughly enjoyed them and loved Berlin it is very clean. Lots of places to see. Certainly recommend Berlin.", "Date": "February 5, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Great location, great family room but leave the breakfast”", "Author": "Madame_XYZ", "ReviewID": "UR55156024", "Content": "We stayed in a family room on one of the top floors with view to the street. The family room consisted of a passage with large cupboard and rack for hanging coats, a small bathroom with tiny shower and just enough room for one person at the time, and 2 bedrooms. The smaller bedroom has a bed and desk and the large bedroom had additional cupboard space and was a nice size. The TV is only located in the \"main\" bedroom. It had a mini bar stocked with snacks. When walking towards the room through the dark passage, we were slightly worried about what the rooms would look like, but we were pleasantly surprised. The rooms were quiet even though they were facing the street. The room did not have curtains in stead they have blinds. I found that some of the light still came through on the side of the blinds. So if you want a very dark room, this shall not suit you. The breakfast in the hotel was aweful from the quality of the food served to the service. The waitrons were cold and bordering on rude. Table were not cleared for a long time once patrons had vacated the tables, so you could not use the tables and had to sit at the bar counter. Requests were done but the demeanor of the waitrons left a lot to be desired. Overall, besides the breakfast, the hotel is centrally localed and very near to all amenities including the Metro.", "Date": "February 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ireland", "Title": "“Good location”", "Author": "SamPam", "ReviewID": "UR52188382", "Content": "My sister and I stayed at the Berlin Mark Hotel for 4 nights. our trip was mainly to see the Xmas markets, which were very nice. (When booking be careful as there are 3 Mark Hotels) This hotel is in a good location for shopping and sightseeing tours. The uban is close by, there is a brilliant bus service. The Hotel is very clean (the corridors are a bit drab everything is dark brown) The buffet breakfast was very good a great choice of food , but a little expensive @€15 per person. . The staff spoke good english, they were just about polite BUT NOT FRIENDLY. on saying that we asked for extra pillows and they were delivered immediately. Overall a good place to stay, but don't expect any friendleness.", "Date": "December 30, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Dublin", "Title": "“Fine for short stay to explore city”", "Author": "Byron31", "ReviewID": "UR50805698", "Content": "I stayed here with my partner for four nights recently. The location is great, just off the shopping street of ku'damm. We went for the Christmas markets, and this street had the biggest market we came across. However, you will need to travel to see the historic sights, but the underground is brilliant, with a station at the end of the hotel's street. It's convenient for gay visitors, as the gay district is only a 10-minute walk from the hotel. The rooms were definitely average, but clean. Do ask for a quiet room: we initially were given a room overlooking the street, but they had no problem changing it for a quiet room at the back of the hotel. The breakfast wasn't great - only good if you like bread and cold meats in the morning. Overall, it was fine for a convenient base, but if you'd prefer to be closer to the best shops and sights, I'd recommend staying in the Mitte district, as I felt the shops on Friedrishstrasse were better - the department store KaDeWe is overrated, and one short trip on the subway to it would be suffice for most I think. When visiting Unter den Linden, Einstein's restaurant (a couple of blocks up from the Brandenburg Gate) is worth visiting - you will probably have to wait for a table, but the food and atmosphere more than make up for it.", "Date": "December 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Great choice for a reasonable price”", "Author": "Passenger-to", "ReviewID": "UR49464637", "Content": "I've stayed in this hotel in November 2008 and March 2009 with my wife and child. We've booked a family room consisting of 2 bedrooms and 1 bathroom - a good choice that 's not easy to find in Berlin. Clean hotel, enough space in the rooms, plentiful breakfast (included in the price), reasonable price. Very conveniently located close to the main shopping street - Kurfurstendamm (the sightseing tours also start there) and U/S-bahn easily connecting you to other places in Berlin. Good, solid hotel.", "Date": "November 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "NYC, USA", "Title": "“Nice hotel, but gruff staff”", "Author": "forwarddeployed", "ReviewID": "UR48084703", "Content": "Nice business class hotel. The rooms were a little on the small side, but nicely furnished. The staff were a little on the stiff side and lacked any sort of personal warmth, but were generally helpful in setting up reservations, calling cabs, etc. The hotel allowed an unexpected early check-in. The rooms were a little small, but functional with warm lighting and functional furnishings. The hotel is situated a block away from Ku'Damm and is easily accessible to the rest of the city. . . There are also a couple of gasthaus' along the street, all of which I sampled and found to serve nice local fare. . . Lots of inexpensive eats are also on the same block, along with an excellent soup bar. . .", "Date": "October 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Solid 3 Star Hotel”", "Author": "weslea", "ReviewID": "UR40152608", "Content": "Stayed here for two nights on a business package which included breakfast, one packed lunch and use of the business lounge with free soft/hot drinks 24hrs a day. My room was very clean with good beds, safe, mini bar, desk and flat screen TV showing certain English cable channels. The bathroom was small but perfectly functional, breakfast was served in the business lounge and was more than adequate for me. The bar area looked very \"new\" although I did not venture into it as the bar directly across the road was more original with much more atmosphere. I ate at gasthaus krombach which is on the same road on both nights as it was so good I did not want to risk a dissapointment elsewhere. Well located about ten minutes from Zoo Garden station with many bars and restaurants close by, I cannot fault this hotel on its 3 star rating - it was well worth what I paid.", "Date": "September 8, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Amersham, United Kingdom", "Title": "“Good location - ideal for short break”", "Author": "Fastflight", "ReviewID": "UR39426901", "Content": "I stayed here for 4 nights with my wife and teenage daughter. We had rooms at the back of the hotel which were away from any late night street noise. The weather was very warm (around 28 Celsius) and the air conditioning in our room simply couldn't cope. We slept with the window open which was fine until around 6:00 a.m. when the binmen arrived! The rooms were quite small but adequate for a short stay and were clean and tidy with mini bar fridge and flat screen TV but sadly no tea and coffee making facilities. The shower room was equally small and moving around inside the corner shower cubicle required a certain skill but was fine once one had got the hang of it. I would agree with some of the other reviewers who have commented on the hotel's boring and somewhat dated decor. The bedrooms corridors are especially grim with dark brown walls and low level lighting they resembled a prison more than a hotel. There is a typical German pub directly across the road from the hotel which is much nicer to relax in than the somewhat sterile (and more expensive) hotel bar. There are also several restaurants along the street the best of which, in my view, being the Gasthaus Krombach which served good typical German food at very reasonable prices. There's even an Imbiss (snack bar) at the end of the road if all you want is a snack. The best thing about the hotel is its location. It's easy to get to from Tegel airport and is about five minutes walk from the Zoo Garden train station where you can get both U-Bahn and S-Bahn trains to any part of the city. It's also close to the Kufürstendamm which is a major shopping street for those in need of some retail therapy. And, of course, it's near to the Berlin Zoo which is worth a look. The reception staff were efficient and reasonably helpful but, like some other reviewers, I didn't find them especially friendly. On balance, I would stay here again since, given the price that I paid through Expedia, I believe it was good value for money.", "Date": "September 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Zurich", "Title": "“LIked the small touches”", "Author": "Aussie71", "ReviewID": "UR38609189", "Content": "The hotel looks like it could do with a bit of a freshen up, carpets shampooed etc., but they have put in some thought and there were lots of nice touches. There were large bowls of fruit at reception and they sold postcards and stamps. The white bedlinen was very clean and crisp. The staff were friendly and the business lounge on the first floor was good. I bought a business deal on-line and was able to go to the lounge for a welcome drink. They had hot drinks, soft drinks and fruit juice and newspapers and large TV. I was also able to have breakfast in the business lounge and was quite impressed. There was a good variety, including smoked salmon and even little packets of lollies and snickers bars. Along the main shopping street there were lots of city tour buses to hop on and plenty of places to eat. The food department on the 6th floor of the KaDeWe store had lots to offer as well. An interesting trip is to catch the train to the Ostbahnhof station and cross the road towards the Spree river. There is a long section of the Berlin wall there, with murals and graffiti.", "Date": "August 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "glasgow", "Title": "“location location”", "Author": "derek m", "ReviewID": "UR37588875", "Content": "stayed at berlin marks hotel for 3 nights, 31st of july-3rd of august,hotel is about 5-10 minute walk from zoologischer garten train station,and from berlin zoo. hotel location is good,just off kurfurstendamm, which has loads of shops and restuarants. hotel reception and bar area was nice and clean, room and bathroom where also clean and tidy,the other sites of berlin are a few miles away,but very easy to reach on berlin's superb transport system.", "Date": "August 13, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Bangalore, India", "Title": "“Very Expensive Hotel during ITB”", "Author": "AJose012", "ReviewID": "UR36001076", "Content": "Is that becoz we booked this hotel during ITB.. It iwas indeed very expensive.. Something like 200 Euros per night. This was the case with most of the hotels during this period. I did not like the rooms (Small and Cramped eventhough it was a Executive Room), The heater in the room made a lot of noise, Housekeeping was just average... But the Breakfast served was indeed very impressive. Service in the Restaurant was extremely good and people were very attentive and pleasing. I felt that the stay was not real value for money...", "Date": "July 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "washington, dc", "Title": "“highly recommended”", "Author": "asmartgirl", "ReviewID": "UR34384250", "Content": "this was the first hotel we stayed in on a four-city europe trip, and it was our favorite. clean, safe, easy to get to (maybe two blocks from the u-bahn station), in an area with restaurants and places to eat, no problems with the staff, and totally affordable. one warning: we loved the location, right off ku'damm, because it was a fun area with lots of people, shopping, cafes, nightlife (checkout gainsbourg a few blocks away on savignyplatz) that we probably wouldn't have seen if our hotel hadn't been there. however, it's not particularly close to tourist attractions; so, be prepared to walk or take the u-bahn (both really easy to navigate). i would definitely stay at this hotel again and recommend it to others.", "Date": "July 10, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Orlando, FL", "Title": "“Great Stay”", "Author": "Axl", "ReviewID": "UR33147214", "Content": "When arrived at hotel I was immediately welcomed by friendly staff and given my room card key. It is very well located, connecting with Kudam (main shopping street in Berlin) and a few minutes walk to the U-bahn Kurfurstendamm station and Zoological Garden Station. Located on Meinekestrasse, there are plenty of restaurants and other hotels in that same street that makes you feel safe walking there even late at night. Hard Rock Café Berlin is practically next door and even a grocery store is nearby to get anything you may need. My room was spotlessly clean. The only thing I disliked a bit was the very small shower. Other than that everything was great. The breakfast buffet is awesome with plenty of food to start your day. Staff kept everything well stocked despite the fact that it was always packed. Excellent experience with this hotel and no complaints from my part.", "Date": "June 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "india", "Title": "“Berlin Mark Hotel, good location”", "Author": "cooltips", "ReviewID": "UR32672606", "Content": "The one thing great about the Mark Hotel is the location. Walking distance fom some really neat cafes and restaurants, the Mark Hotel is also very close to all the starting points for city tours, most of which are hop off and on. I would reccomend these tours especially if you do not have much time and do not know the language. YOu can get off as you seem convenient and the tours are all in elglish. The efficient speaking English staff at the hotel will definitely give you information on the necessary tours. Do head to the cafes and restaurants close by to have a nice relaxing meal after shopping at some of the high fashion stores close to the hotel. The hotel is not too far from the airport and a taxi is less than 2 minutes away.", "Date": "June 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "yorkshire", "Title": "“Fabulous!!!!!!!!!!!!!!!!!!!!!”", "Author": "yorkshirelass12", "ReviewID": "UR23354439", "Content": "Just returned from a short break with my husband to The Mark Hotel and we thought it was great. Central location just a minute away from the main shopping street in West Berlin ( 2 miles long ) five minute walk to the main underground station that feeds to all berlin and same to the zoo which is a must ! Twenty yards away to The Hard Rock Cafe which is good when its minus 20 outside !! Rooms were small but ok maid service daily and the beds are the comfiest we have ever slept in breakfast was lacking abit of direction it seemed to me that you just had to find your own way easiest thing to do is just find your own table and look after yourselves because the waitresses are not very helpful they just busied around ignoring people. Go to the Soup Kulther at the bottom of the road for a take away soup . . . . . .FAB. Drinks a bit expensive at the bar but straight across the road is a little authentic german bar we went there every night. Would go back !! If you plan to sight see i suggest the Insider Berlin Tours see website we used them twice. Have a nice holiday.", "Date": "January 7, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Colorado", "Title": "“Perfect Hotel”", "Author": "anni373", "ReviewID": "UR23205374", "Content": "This hotel was great. It reminded me a lot of an American hotel...a nice flatscreen tv (only english channels are news), comfy beds with great downcomforters, large room, and good size bathroom. The breakfast was amazing in the morning....very fresh. The location is great...right near the Hard Rock cafe...close to bus stop and metro as well as all the shopping and food you could want.", "Date": "January 2, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Essex", "Title": "“Disappointed on this occasion”", "Author": "annie088", "ReviewID": "UR22749901", "Content": "Myself and my husband have just returned from a weekend stay at the Berlin Mark Hotel, Our purpose for this visit was to visit the Christmas markets which were truly magical and I would not hesitate to recommend for any age group. Back to the purpose of this review the Berlin Mark Hotel. This is our third visit this year to this hotel. As you will see from my earlier reviews on this site the two previous occasions I have marked it as excellent. However on this occasion this was not the case. On arrival the receptionist seemed miserable and not very helpful. I suffer from multiple sclerosis and can only get around short distances with crutches otherwise I need my wheelchair. The hotel were informed of this as I always do in August when I booked and I requested a ground floor room suitable for a wheelchair. She then proceeded to inform us that there were no rooms available and we were put on floor 6 (Don't know what would have happened in the event of a fire). That was bad enough but the room was barely bigger than a rabbit hutch and the bathroom even smaller. Don't get me wrong this is a comfortable hotel and very clean with good breakfast and in a great location but the rooms are very small even if you are not disabled. But given that there are hundreds of similar hotels in this area of the same standard I will be booking elsewhere in future.", "Date": "December 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hull", "Title": "“great stay”", "Author": "Rayhull", "ReviewID": "UR22521676", "Content": "Ray Thompson Kingston-upon-Hull Yorkshire We have just come back after a 5 day stay at the Berlin Mark Hotel ..It was a joy to have stop there We were a party of 4 and we all had a great time ..the staff were friendly and helpful The Hotel was clean and tidy we had no complaints what so ever ..We were look after from start to finish of our stay all 4 of us are in our sixties ..the service we received was first class ,,one day we will return to the Hotel ..I would like to say a big thank you to all the Staff for making 4 pensioners very happy people ..Merry Christmas and a Happy New Year Ray Thompson", "Date": "December 7, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "london", "Title": "“rudest staff i have ever met”", "Author": "londonse16", "ReviewID": "UR22052989", "Content": "not a bad hotel,but without doubt the rudest staff i have ever met.not one please or thank you throughout the whole stay.all i can assume is that is was probably because i am english.several other english people had the same problem.anything you asked them seemed to annoy them.", "Date": "November 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Milton, Canada", "Title": "“Best Location in Berlin”", "Author": "psallan", "ReviewID": "UR22040549", "Content": "This hotel is located just off the kurfurstendam str, which is the main shopping street in Berlin. The area is full of shops, restaurants, and bars. The hotel is close to several subways on different routes. You could basically walk to any major tourist attraction. The hotel is about a five minute walk to the Berlin Zoo, and maybe a fifteen minute walk to Postdamer Platz. The hotel lobby has recently been renovated. Very nice bar and restaurant/lounge area. The rooms are spacious but eventually need renovating. The only complaint would be the night club down the street which played loud bass pounding music on the weekends. We loved the location of the hotel and would stay there again!", "Date": "November 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Westminster, CO", "Title": "“Great stay in Berlin”", "Author": "valor155", "ReviewID": "UR21757025", "Content": "My parents and I stayed at the Berlin Mark in Fall '06. We had a wonderful stay. Here are the highlights of the stay: -- Very friendly check-in and staff. -- Nice, casual bar area. -- Wonderful, expansive, complete breakfast (mouth-watering remembering it). -- Flat Screen TVs. -- Great downtown Berlin location. Walking distance to shopping and restaurants. No complaints at all. As you can expect with most European hotels, the rooms were a bit on the small side by US standards. Our stay was quite pleasant at this hotel in Berlin.", "Date": "November 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Haywards Heath", "Title": "“Cheap(ish), clean and acceptable for a city centre hotel”", "Author": "wildthing271", "ReviewID": "UR21427978", "Content": "A convention at Berlin Messe saw me needing hotel accomodation for 2 nights in Berlin. As a couple of colleagues had chosen this hotel, I booked myself using a special rate on Expedia. The hotel was a little challenging to locate. I had never been to Berlin before and after getting off the S-Bahn at Zoologisher Garten I managed to spend about 20 minutes wandering around some back streets. Eventually I located the hotel, and thereafter it was only a 5 minute walk from the hotel to the station. Check in was quick and easy, and reception noted that one of my colleagues had already been asking for me. The room was clean and functional - a slightly strange shape but all that was really needed was a bed and a desk. Wireless internet is available but strangely only allowed access to Google and nothing else. The 10 euro access fee was refunded without question. The hotel's bathroom was the smallest I have ever come across. Without conjouring up too many horrific images, it was physically impossible to sit on the toilet - there was literelly no space at all. Breakfast was buffet style and a good choice of cold meats, cheeses, fruit, cereal etc was all availble, plus a couple of hot dishes. If I had paid rack rate I would probably have been disappointed but as I had paid a discounted Expedia rate, I was happy enough with the standard of the hotel. I would recommend providing a discounted rate can be secured.", "Date": "October 31, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leicester England", "Title": "“Great Location”", "Author": "Trip208", "ReviewID": "UR19409721", "Content": "We stayed as a group of 8 over the August Bank Holiday weekend 2008, the rooms, although not large were clean, comfortable, had plenty of storage space, flat screen TV and electronic safe. The staff were friendly, spoke very good English and were happy to help with directions and recommendations on where to visit. The Hotel has a great location, very close to shops, bars and restaurants. Will recommend to any friends who plan to visit Berlin in the future.", "Date": "August 27, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sweden", "Title": "“Great”", "Author": "susmaya", "ReviewID": "UR18349344", "Content": "The hotel is located in charlottenburg, quite close to public transportations and Berlin zoo. There are pubs, clubs and restaurants in the area. The breakfast buffe is really nice and theres plenty to choose from. Also in the weekends the b´fast starts from 6.00 - 12.00 wich is good. The room was big and clean, the bathroom was a bit small tho but very bright and again very clean. A stocked minibar and some snacks. The lobby was nice and felt very spacious. Staff was helpfull and smiling.", "Date": "July 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Orlando, FL.", "Title": "“Good Deal for the Money”", "Author": "chriswick614", "ReviewID": "UR18048992", "Content": "We stayed at the Berlin Mark Hotel in July and the hotel is a good deal for the money. The rooms are average size for a European Hotel but the single beds were extremely small. The mattresses and comforter were comfortable but the one pillow provided for each bed was paper thin. The room did have air conditioning which kept the room adequately cooled however the exterior temperatures were cool also so I'm not sure how it would do in extreme heat. The bathrooms are very small and the shower did not drain on our first day. After speaking with the front desk the following morning, the problem was solved. Regardless, water did run through the sliding stand-up shower screen so you will need to make sure the bath mat is down to sop up the water. There are excellent restaurants and the Hard Rock Cafe in close proximity to the hotel. Shopping is located all over Kudamm so take a right out of the hotel and you will run right into it. There are two U-Bahn stations within 2 blocks but one main train line is down until the end of the year. This created a big inconvenience as this was the line we most commonly used. Overall, the front desk staff was helpful and polite. The breakfast buffet was very good and the housekeeping service was timely and clean. Internet service was included in my room rate but it is very expensive (50E per week) if you have to pay for it. The connection was a bit slow but adequate. You really can't beat the price. The rooms are extremely ordinary but a great value.", "Date": "July 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bangor", "Title": "“Great Hotel, Great Location”", "Author": "MargaretBangor", "ReviewID": "UR17588424", "Content": "Location of hotel great for transport and also quiet at night. The breakfast, although busy from 8am onwards, was good. The staff were very friendly and helpful. A Lidyl supermarket was just down the street and good for rolls for lunch time and buying bottled water. Would recommend an Italian Restaurant called Stella Di Mare at 162, Uhlandstrabe, which was a 5 minute stroll from the Hotel. The service, quality of food and prices was excellent. On future return visits to Berlin I will stay at this hotel.", "Date": "July 6, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Good Central Hotel”", "Author": "mcscottie", "ReviewID": "UR17133685", "Content": "Stayed at the Berlin Mark hotel for an overnight on a business trip. The hotel is central to shops, restaurants and public transport. Its on the same street as the Hard Rock Cafe. The rooms are pretty basic, but were clean and had really comfy beds. This hotel would be a good choice for a weekend break.", "Date": "June 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "england", "Title": "“great hotel, great position”", "Author": "tim41", "ReviewID": "UR17129060", "Content": "BERLIN MARK HOTEL I did my homework and it paid off!!! i was charged with booking a break for ourselves and two other couples. i read all the reviews, not just trip advisors, i looked at al options for price and location and chose the berlin mark.what a great choice for our first trip to this fab city. 5 mins from the zoo station, great flashy reception, great rooms, clean as a whistle, perfect location, 2 mins from the shops and bars. we were there when germany beat portugal, the place went barmy, yet we heard nothing when we went back to the hotel.the breakfast is fantastic, if you can`t find anything you like, you`re not hungry!!. only question was why no tea making facilities in the rooms, but i will go there again anyday, and no, i don`t work for the hotel!! TIM , STOKE-ON-TRENT, ENGLAND", "Date": "June 22, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Rotterdam, The Netherlands", "Title": "“clean but nothing special”", "Author": "Melanie747", "ReviewID": "UR16297813", "Content": "Stayed at this hotel for 2 nights in may 2008. I had booked a quiet singleroom with a bathtub, however, when I arrived they said I will receive the familyroom, for unknown reasons. Sounded good in theory. But then it turns out that there where 2 rooms in my room. What do you do with two rooms when you're alone? Nothing. There where a lot of closets, but I didn't need them as I was only there for a short stay. The rooms where spacious, everything was clean and the beds are really good. The bathroom was a let down, it was really tiny and did not have a bathtub like I requested. Also I wonder how a whole family would manage in this tiny bathroom. The room was on the corner, facing a really noisy street, which meant I had to keep the window shut at night. I am more of an open-window kinda person, that's why I requested a quiet room Even with the window shut you could hear trafficnoise all through the night. My room was on the 4th floor, that had dark and claustrophobic hallways. The elevators where really really slow, and looked a little shabby. Then the breakfast. Like someone has already pointed out; they seemed to struggle keeping up with things. Tables where not cleaned, and even the food was short in the last hour, I had to do with the leftovers at 9 o clock. The next day that problem already occured at 8! All in all, nothing to write home about. It's clean and the beds are good. But the hotel did not fulfill my wishes, which where a quiet room and a bathtub in the bathroom. Those are things that are important to me. Instead I got a family room facing a noisy street and a tiny shower. This makes me not want to recommend this hotel. And one last thing; there are no tea/coffee facillities in the room.This was a big let dow for me,since I am used to having that, but I heard this is typical german, so I can't blame the hotel for that.", "Date": "May 22, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "london", "Title": "“Good location good price”", "Author": "isee1", "ReviewID": "UR14905643", "Content": "The hotel is only a 15 minute cab ride from Tiegel airport, and very well located. Front of house staff friendly and efficient. For the the price room sizes good - bathroom a bit too small though. Breakfast buffet is fine but on the second day of our stay the room was so busy we couldn't get a table. A minor quibble though. This is a good value 3 star and I can recommend its central location.", "Date": "April 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Olivehurst, California", "Title": "“Great Hotel for Short Stay in Berlin”", "Author": "SnyderFamily25", "ReviewID": "UR10562625", "Content": "My husband and I stayed at the Berlin Mark Hotel for two nights in June 2007 in a double room (breakfast included). We arrived at the hotel much earlier than the 3pm check-in time, but as our room was already available, the Reception staff (all of whom were very polite) allowed us to check-in early. This was very helpful as it meant that we were able to drop off our bags before heading out to explore Berlin. Our room was very small, even by European standards, but was clean and comfortable enough for a short stay. The Continental breakfast was satisfactory; and as there are two large dining rooms, there were always lots of tables available, even at peak times. One of the main reasons we opted to stay at the hotel was its location. It is within a short walk of both the S-Bahn and U-Bahn, and there are several restaurants/cafes, including the Hard Rock Café, on the same street. Overall, this middle-of-the-road hotel more than lived up to our expectations in terms of cost, service, and location; and I would recommend it to anyone who is looking to spend a few days in Berlin.", "Date": "November 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“Fantastic hotel”", "Author": "Mandymoocow", "ReviewID": "UR10308767", "Content": "This was one of many hotels I stayed at on a recent European trip, & I have to say that it is was one of the best. It is in a fantastic location, very close to public transport and the main shopping street. The room was one of the biggest I had in Europe & was clean with modern furnishings. I booked in as a business traveller & so was told to go to a seperate breakfast room which was great, so I don't know if that made a difference, but I was truly disappointed that I was only booked in for one night here. The lobby is a bit tired & it took a while to check in, but I found the Reception staff helpful with their information, once they were free to serve me! For the location & the quality of the room it was an absolute bargain & I would not hesitate to recommend it.", "Date": "October 25, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Steve”", "Author": "steveBraganca", "ReviewID": "UR10251041", "Content": "Please read this before before booking your break away in this hotel. All together we were a group of 8 on a 3 night stay in Berlin as part of a package starting from Thursday through to Sunday. We decided to book an extra night online and arrive on a Wednesday. When we arrived at the hotel, the reception staff appeared to be very unhelpful, I would say to state they were not friendly would be an understatement. So we proceeded to check in, or at least attempted to. The receptionist then informed us that dispite booking on Expedia with this hotel, they were not expecting us until the following day, where 3 nights were booked. Instead they told us that we were in their sister hotel for 1 night. We were told to go, the only instruction given was to turn right outside door and straight down. After about ten minutes of lugging our luggage around we found an old building which later we found was the sister hotel. Walking in the hotel was dirty and dated. Our hotel room was really not an improvement. Very basic facilities with dated furniture. We had a small fridge with a mini bar, which had a selection of 6 drinks. The hotel was situated in a seedy part of town. The bathroom was small. The shower sprayed more water over the curtian then into the bath itself, each time after taking a shower the bathroom floor was soaked. We decided to go back and urgue our case. We booked the Berlin Mark Hotel and not the Appt Berlin Mark Hotel. When we went the back the unhelpful receptionist's told us that in fact we were expected there and not the sister hotel, we should never have been sent away. Although it was there error, they actually still refused to move us, they told us it was too late to be moved as we had already checked in. We asked to speak to a Manager for help, they told us to take a seat. After about 15 minutes we re-approached the receptionist as nobody came out to see us, and were told that there was nothing they could do, despite it being their error. We gave up and returned the following day for the remainder of our stay. The hotel was not much of an improvement. Room was very basic with the same features of the old Appt Berlin Hotel. Breakfast was always busy. Tables were hardly ever cleared from the previous people and by the time a fresh pot of coffee arrived, or your milk did - it was time to leave. The service was dreadful. Throughout our stay we would often liase with recpeption staff, but again they were always unhelpful. They appeared not to want to help you, and was always a real effort engaging with them. Not once did they smile. A memeber of our group was sent to another hotel to iron her eveining clothes - when she returned stating that she could not find hotel they directed her the hotel opposite. They could have done this at the begining instead of sending her on a hike of the backstreets of Berlin. So, if you are not looking for service, unfriendly staff, basic facilities then I recommend you book this place! Please do not be fooled by the pictures on the internet - If you book this hotel, please expect an 'Allocation on Arrival' service as you will have no idea where you will be placed.", "Date": "October 23, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, England", "Title": "“Es tut mir leid...”", "Author": "PMY", "ReviewID": "UR10084850", "Content": "Very upset with this hotel. We had booked as part of a group for three nights from Thursday and then booked an extra night for the Wednesday night via Expedia. Although this was advertised and showed photogaphs of the Berlin Mark on Meineke Strasse we found this not to be the case AFTER we had arrived at the hotel and the receptionist simply looked up the reservation in her system, pointed to the crossroads and informed us that the hotel we were staying in was around the corner and four minutes away. No map, no directions and no further offer of assistance. We went to visit the hotel to find that it was a converted apartment block in a rather seedy part of a very busy road. No Bar, a makeshift breakfast room. No restaurant and a basic bedroom which was large but a rather dirty and poorly decorated bathroom. We retrurned to the Berlin Mark Hotel on Meineke Strasse to plead our case that we we were under the impression that we had booked that hotel and wanted to be there for the four nights and not have to change the following day as our friends were due to arrive the next day. Suddenly, the receptionist found a reservation for us which means that they had expected us all along and was about to check us into that hotel when she realised that her colleague had sent us off to another property. In fact BOTH receptionists on Thursday afternoon were very surly and discourteous and even after me asking if I could speak with somebody else and being TOLD to take a seat in the bar as it would take a while before someone could see us, we were left waiting until I had to go back to the empty desk to see if somebody could talk to us. All I could be told was that as I had booked through Expedia, there was nothing they could do. I tried politely to explain that after 25 years int he hotel industry I knew that they could, in fact, transfer a booking within the hotel if they really wanted to - again, to no avail. If you do not expect any kind of service whatsoever then go ahead and book these hotels but be sure what you are getting as they also have a third old building across the street which is a little more convenient than having to drag luggage three long blocks but as it has lots of stairs and no lift it is also below standard. We finally accepted our fate and reconciled to spend the night in the cell block. the only saviour was the ARTOTEL across the street which had a nice bar and pleasant staff so they got our business. The shower in the bathroom simply sprayed water everywhere in the \"APART HOTEL\" (read falling APART Hotel) causing the bathroom floor to flood and cause a very dangerous health & safety hazard Breakfast in the Mark Hotel in Meineke Strasse was absolutely chaotic with surly, rude staff who snapped at you if you asked them to bring tea or coffee pots or more orange juice or bread fort oast. A member of our group was sent by reception to two local dry cleaners shops to get an outfit for that evening ironed before sending her to their hotel accross the street where they had a laundry facility all the time thus wasting an hour and making her late for her evening function. So, some of the poorest service I have ever experienced, misleading advertising, surly/miserable/rude staff and awful public areas. Thank goodness there are plenty of alternative hotels for future visits and for us to recommend to others.", "Date": "October 16, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Preston", "Title": "“Superb, good value for money”", "Author": "JCowell", "ReviewID": "UR10018121", "Content": "Overall, this Hotel provided us with exacly what we needed. The rooms were very spacious and immaculately kept. The staff were all very freindly and polite and on hand 24 hours a day. The hotel was cheap for us to book so we weren't expecting very much but we were both very pleased with everything about the Meineke Mark Hotel. I would receomend this Hotel for anyone visiting Berlin for the first time as it holds an excellent central location but remained just far enough off the main street to get a good nights sleep. The rail links from here are also easily reached by foot.", "Date": "September 29, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ottawa", "Title": "“Great Hotel”", "Author": "Mila016", "ReviewID": "UR8510929", "Content": "This hotel is situated right off the Kudamm and within 5 minutes walk from the Kudamm u-bahn station. I had booked online and asked for a non-smoking room, and I got it. In fact, the room was enormous and very luxurious. We were quite sad to only stay one night, but we had to catch a train to Poland at 6:30am the next morning. Despite our checking out before 6:30am, the time at which the breakfast started, we were invited to have a seat and to eat from the buffet before our departure. Although not everything was available yet, we had a great selection of breads, cheeses and cold cuts. Also, the staff was friendly and helpful. We stayed three other nights in Berlin later in August at a much more expensive, and supposedly better rated hotel. Hands down, the Berlin Mark Hotel was superior in value, not only location wise but also service wise. I would definitely return to this hotel.", "Date": "August 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“A great deal and nice area”", "Author": "tdog17", "ReviewID": "UR8117033", "Content": "For 88 euros a night (double room), this hotel is an excellent value. The lobby isn't very impressive, and we were a bit worried as we headed up to our room, but it was fairly modern, clean and had a nice view down to the road. I had read that the street was a bit noisy, but we found it to be very quiet actually. Slept VERY well. This hotel is also dog-friendly, though there aren't any parks very close by. Secure parking is available in the garage next door for 11 euros a day. Overall, we were very pleased with our pick and would definitely stay there again.", "Date": "July 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Glasgow, UK", "Title": "“Great Hotel for the price”", "Author": "futureTom", "ReviewID": "UR8033476", "Content": "We rated this hotel above average, despite it being our only experience of Berlin hotels, but at £50 per night for a reasonably sized double room including a fine breakfast, who could ask for a better deal. Staff were always helpful on the few occasions we needed help. Meinekestrasse was a little noisy with the windows open, but we just used cheapo earplugs. Good area for transport, with the Zoo train station about five minutes walk providing access to pretty much everywhere, and a U-bahn station two minutes round the corner at Joachimstaler Str. Good eats to be had within 10 minute walking distance: Kuchi [Japanese], Good Friends [Chinese], Savigny Cafe [great coffee], and the beer garden at the Schleuse Tiergarten, possibly our favourite place. We recommend this hotel if you want proximity to Ku'damm and don't want to pay through the nose.", "Date": "July 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Europe", "Title": "“Good location”", "Author": "xTravellerx", "ReviewID": "UR7541523", "Content": "Nice hotel with good location near the shopping area, subway station, Kaiser Wilhelm Memorial Church etc. Rooms are quite small, but clean and modern. Plenty of TV channels in many languages. Nice breakfast, although the breakfast room is quite crowded. They had on some days another breakfast room opened on another floor. They were kind enough to allow us an early check-in. Polite staff.", "Date": "May 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Chorley", "Title": "“Good Hotel and Great Value”", "Author": "Lancashire_Lass55", "ReviewID": "UR6805041", "Content": "The Hotel was great, we really enjoyed our stay and will without a doubt stay there again. The location is perfect its about 3 minutes walk from the famous shopping street Ku'damm and access to public transport is same. The hotel itself is in our opinion fantastic value for money, we stayed in a double room which had a mini bar, flat screen t.v, comfortable bed with crisp white bed linen, great ensuite and more than enough storage, the little bunch of fresh flowers in the bathroom was a real nice touch! The breakfast was good, everything was so fresh, beautifully displayed and the choice of food was extensive, breakfast can be busy but there is ample tables, just need to look. Only real slight problem was being woke up on two nights by other residents, (adults not students!) but the hotel dealt with it very rapidly The staff in all departments were very friendly and very efficient.. Agreat value for money hotel.", "Date": "February 17, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "California", "Title": "“A Very Pleasant Surprise”", "Author": "Kadewe", "ReviewID": "UR6570922", "Content": "Stayed here for four nights in January 2007 and based on past reviews was somewhat worried but my fears were unfounded. Positives were absolutely great central location on quiet side street, wonderful complete German breakfast included in the price, and a price that couldn't be beat for the location. In addition, the room itself was very up to date - non-smoking (though had to persist to get it), flat screen LCD TV on the wall, had a \"chair\" that opened to single bed for our son easily, had hair dryer (important for my wife), nice desk staff, very comfortable beds for my wife and I. Only drawback was even in winter the room was too warm at night even though we turned off the heat.", "Date": "January 10, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "West Midlands", "Title": "“Second visit”", "Author": "elljaaym", "ReviewID": "UR6482305", "Content": "Stayed in this hotel over New Year for the past 2 years. 2004 & 2005. Ideally located and a comfortable hotel. Yes, breakfast is a little busy, but come on folks, be patient! What do some people want! The food was great and always plentiful and was replenished regualrly. The rooms had modern decor and were far more than adequate. We got great deals on both occasions, and could not complain for the price. It is ideally placed to tour Berlin from. The tour bus goes from the end of the street and is close to Zoo Station. The nearby restaurants were excellent, the one almost opposite -called the Meineke I believe, was good, but we also enjoyed the small restaurant, which you would probably mistake for a bar on the same side as the hotel at the top of the street as you head towards the Ku'Damn. Berlin is a top city and highly recommended for New Year! Try out a trabi safari - it is great fun - especially in 3ft of snow in a car with no heating......................or brakes come to think of it!!", "Date": "December 22, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“Top marks for the Berlin Mark Hotel”", "Author": "Novice-kay", "ReviewID": "UR6364099", "Content": "Having spent three nights in the Berlin Mark Hotel I must pass on my findings. The hotel staff were very friendly and accommodating to any request. The hotel decoration in the corridor area leading to the bedrooms could do with a update but the rooms were very clean tidy and modern. Maid service excellent and staff very friendly. Bar facility available in the room although a kettle with tea/coffee facilities within the room would have been welcomed. The cost of coffees in the bar was very reasonable and always served with a smile. Rooms very comfortable and clean with excellent showering facilities. Cable TV. Fresh fruit at the front reception should anyone wish a piece/s. Meals were excellent, breakfast first class. Location is only 100 mtrs from the Kurfustendamm and very central for bus and S bahn. Luggage room available. I would certainly recommend this hotel and would not hesitate in returning. I look forward to my next visit.", "Date": "December 11, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great choice”", "Author": "Tatun", "ReviewID": "UR6305966", "Content": "Perfect location, right around the corner from Ku-damm, but on a quiet street..Excellent rooms with plasma TV, comfy beds..Staff was helpful and personable; absolutely marvellous complimentary breakfast...", "Date": "November 29, 2006"}, {"Ratings": {"Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "London", "Title": "“Stay away...”", "Author": "jplondon", "ReviewID": "UR6113238", "Content": "I have just returned from a weekend in Berlin, where I stayed at the Berlin Mark Hotel. The best thing about this hotel is the location: around the corner from the Kurfurstendam, in central Berlin, and close to lots of public transport. Also, getting taxis from hotel never took more than 3 minutes when the hotel called, which was rather impressive. The hotel is very basic and the room I was given had a single bed (I haven't seen this in hotels for years!) and was smaller than most student accommodation I have seen! The room was extremely basic and the bed and pillow were far too soft, which made me have a terrible time sleeping. I was also given a smoking room. I don't recall Expedia (with whom I booked) asking if I wanted a smoking or non-smoking room, so I felt I didn't have arguments to change. When I asked for a non-smoking room I was told they were fully booked and I couldn't change. Fair enough, but I think there is only one floor in the whole building (of 7 floors) that is non-smoking, so be aware of that when booking. The staff are helpful and nice but the whole place is in serious need of a refurbishment. The decor is very early 80s with some nauseating bright green everywhere... It was also strange to be handed a key, rather than a card for the room, but I suppose that is just me. Brekfast is plentiful but very basic. Beware of smoking areas for people having breakfast that are very close to non-smoking. In fact, the hotel reeked of cigarettes. In other words, if you don't mind the comfort of your bed and if you are a smoker, you will love it! If not, stay away. There are plenty of hotels to choose from in the area.", "Date": "November 13, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“Loved this hotel.”", "Author": "Tressan", "ReviewID": "UR6100396", "Content": "I loved this hotel. You can't beat the location and the value. Our room was spotless, great shower and delicious full breakfast. We never had trouble finding a seat and we went at all times of the morning. The area the hotel is in is lovely and it is minutes away from the Zoo Station where you can get any bus or train in the city. We found the staff at the hotel to be lovely. I would stay here again.", "Date": "November 10, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Roskilde", "Title": "“Very good”", "Author": "felt", "ReviewID": "UR5768221", "Content": "Good location close to Kurfürstendam. Large hotel with nice rooms and a good bar. Carpark next door. Underground station 5 min. away. Good breakfast buffet (if you can get a seat).", "Date": "September 4, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Birmingham", "Title": "“Truly awful”", "Author": "thunderthighs", "ReviewID": "UR5578298", "Content": "The Mark Hotel on Meineke Strasse is truly not a 3 star hotel. The hotel is very tired and is in desperate need of a refurb.The staff are surly and not interested in any problems you may have. When we booked the room the description on the website said it came with a separate seating area, despite raising the issue with reception we were basically told this was not so , I guess someone needs to amend the website.The room given to us was on the first floor. Supposedly a non smoking room it came complete with ash tray and matches. The room was not very big and the bed took up the majority of the room. The room was at the back of the hotel and overlooked an overgrown garden with a block of flats looking directly onto the rooms. Although the bed linen was clean there wasn't much going for the room at all. The furniture is dark brown and very old and battered and the sliding wardrobe door seemed to be just about hanging on. As for the bathroom well what can we say. The shower sliding door is barely big enough for a normal sized person to get through. The frame of the shower was also falling to pieces and came off in your hand when you closed the door.The shower had no height adjustment bar and so showering each morning was quite difficult. Also it was difficult to regulate the water and it was either boiling hot or freezing cold. You either had to sit cross legged on the shower floor or stand up and use the shower by hand. The hot tap became very hot and a towel had to be used to turn it off. We complained to management three times but nothing was done. One of the lamps over the sink had blown and despite telling the cleaner it was still not changed. The bathroom had had the tiles painted to give the appearance of a newly refurbished room. Breakfast was hardly worth the effort. There were not enough tables for everyone and some people who couldn't get a table ended up going away. If you came down late most of the food had gone and was not replenished. Coffee was luke warm and not a teabag in sight only various types of Twinings darjeeling. We did notice a room next to reception with more tables and a waitress walking in and out with coffee but no one was told if this room was an extra room for breakfast. In fact the room was used to store suitcases for people checking out of their rooms. It was not locked so anyone could walk in. The main reception area and corridors stink of cigarette smoke as there is a table and chairs positioned along the corridor for smokers. The only good thing we can say it that the hotel is in a very good position just off ku'damm and great for exploring Berlin.", "Date": "August 8, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Florida", "Title": "“good hotel, horrible service”", "Author": "K.B.7", "ReviewID": "UR5503845", "Content": "The hotel was very nice and the breakfast was great. Our only problem was the lack of customer service from the individuals at the front desk. The were curt, rude, and when we had a problem with our air conditioner told us that maybe we were used to high powered air conditioning but this is good for here.", "Date": "July 24, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "2", "Rooms": "2"}, "AuthorLocation": "u.k", "Title": "“Great location, but.......”", "Author": "donshe62", "ReviewID": "UR5432572", "Content": "Stayed here late March 2006.Very short walk from the train station,very convenient for the city.What sticks out really bad is the decor of the reception area.I felt as though i was in a 80's time warp and i got very worried what would the room be like !.But the room had just been updated and had a nice modern feel,with pale colours and comfortable fittings.Our blind fell off the window at first tug...and not fixed for the entirety of our stay.The room was at the front of the hotel near the really busy cross road,much traffic noise with the windows open,as so much noise from passers by from the 'hard rock cafe' just down the street until 5 in the morning.While we were there a couple of coach loads of teenegers arrived and stayed in the accomodation righ opposite,these kids were obviously not being supervised as they were on the street every night until the early hours partying !.Breakfast is a very well laid out buffet with lots of choice,the only moan here is with so many guests it was hard to find a table,or even when you found a vacant one it was not cleared/cleaned.But on the whole as with all budget hotels there are up's and down's.On the plus....great location....nice rooms/clean.I would stay there again if visiting this magnificent city,but would ask for a room round back.", "Date": "July 6, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Boston", "Title": "“Marks Hotel Meneike in Berlin-Spare but really good location”", "Author": "A TripAdvisor Member", "ReviewID": "UR5300028", "Content": "I stayed in this hotel last week. This hotel is located in a very good area-so location-wise it is four stars. Very accesible to public transportations, 20 minutes from Tegel Airport by bus (#109). Very -very convenient. The hotel is only marked by a green door with a small sign above it- if you blink you would miss it. At around $50.00 a night- it is a good value. $95.00 for week end nights is a bit steep. Breakfast is included- which is a bonus- a pretty good spread- it is possible to have a big breakfast- skip/small lunch- and a big dinner. The room was the definition of bare essentials, mine was a single, it was pretty small. My room has a toilet and shower- no bath tub. The old TV was changed to a flat screen while I was there- so this hotel is doing some upgrading. My room was at the back- it was quiet. Rooms are located off a corridor that is very motel-like except for the original art works along the walls. Caution- the entrance is on the second floor- so I had to lug my heavy suitcase up one flight of stairs. This hotel is not handicap accessible. The staff was friendly and helpful. I will go back if I travel alone or with a regular friend- this is not the hotel for a romantic vacation.", "Date": "June 5, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Toronto", "Title": "“Great value...”", "Author": "Ontario13", "ReviewID": "UR5030211", "Content": "Got a good deal on this hotel and we loved it. Room was a bit small, but very clean. Located about 2 minutes from big shopping area (Kufursterdam) and about 4 minutes from underground station (Kufursterdam again), this hotel was great for us. We always walked 10 minutes to get to the big ZOO station, which connects to just about every line. Lobby has a nice bar and a big room for breakfast. Breakfast was goods with fresh fruit, bacon, eggs, sausage. Proved to be a good start to each day. We had no worries at this hotel and would stay there again if in Berlin.", "Date": "May 3, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Netherlands", "Title": "“Great Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR5016236", "Content": "Nice, quite big hotel 100 m to the kufurstendam. we stayed for 2 nights at the hotel. we had a big room with a lot of space. accros the street there is a nice typical german restaurant which offers good prices. the berlin mark hotel is a excellent hotel and if you wil visite Berlin you really should take this hotel!!!!!", "Date": "April 28, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "High Wycombe, Bucks, England", "Title": "“Fantastic”", "Author": "A TripAdvisor Member", "ReviewID": "UR4967374", "Content": "We have just returned from a 4 night stay in Berlin and stayed at this hotel. Everything about it is good. Clean rooms, plenty of hot water for showers etc. Hair dryers, excellent maid service. Breakfast something else - everything you could wish for to start the day and a good time slot too - breakfast at the week end is served until 12 noon!!! Ideal for sleepyheads! The only down point was that it is just along the road from the Hard Rock Cafe which appears to close around 2am - but if you close the windows (they are double glazed) it doesnt really bother you too much. The location of this hotel is perfect - right on the doorstep to the shops, underground, buses and sight-seeing buses too. We found a fantastic restaurant too in Joachimstaler Strasse called Blauer Flug - really good meal there too so all in all we spent a fantastic 4 day city break in Berlin and cant wait to go back!", "Date": "April 12, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Norway", "Title": "“Perfect place to stay!”", "Author": "NorwayLiv", "ReviewID": "UR4720468", "Content": "We stayed here fore three nights, and will do it again. Great location. The breakfast was amazing! The room was nice and clean. The staff friendly. We really can recommend this hotel!!!", "Date": "March 21, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4700438", "Content": "Fantastic Hotel. Immacuately clean. Staff extremely friendly and helpful. The location was also very accessible both on foot and trains to many Berlin Attractions in the centre of Berlin. I would strongly reccomend this hotel and would have no hesitation in staying there again.", "Date": "March 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Ireland", "Title": "“Great Value in a convenient location”", "Author": "A TripAdvisor Member", "ReviewID": "UR4695267", "Content": "I found the Berlin Mark Hotel fantastic value for money. The rooms were spacious and impeccably clean, our room was cleaned every morning. The breakfast was fantastic, buffet style to suit every taste and as much as you want. The reception staff during the day were not too helpful but the night staff were lovely and also the bar staff.The area of Ku'damn is a bit commercial but very safe. I would definitely recommend staying in this hotel.", "Date": "March 20, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "New York City", "Title": "“Good location, clean hotel”", "Author": "beso14", "ReviewID": "UR4606860", "Content": "We paid around $63 a night for our stay in the Berlin Mark Hotel. The room was on the small side but it was very clean the bathroom was huge and modern. The only complaint about the room might be that it was kind of small but this didn't bother us as we just wanted a clean, safe place to sleep. The breakfast (included in the price) was AMAZING! No continental breakfast here! There were eggs, cold cuts, sausage, bacon (one morning), yogurt, fresh and dried fruits, juice, crackers, several different kinds of bread, dessert, etc. You could easily take some stuff for a little snack later in the day. The breakfast alone was worth the price. The location was good. It was under a 10 minute walk to the Berlin Zoo station from which you can catch trains and the metro (U-Bahn). It was right off of the main shopping street. I personally thought that all of the interesting sights seemed to be in East Berllin and found that we were going there to eat, sightsee, etc. Otherwise, I can't really complain about the location. It's right next to the Hard Rock Cafe and down the block from a Dunkin Donuts/Easy Internet cafe. It might be worth mentioning that there seemed to be a lot of school/tour groups staying in the hotel. Sometimes you could hear them in the hallways but it was never a problem or really annoying at all. Also, there was usually a wait for a table at breakfast because everyone in the group seems to eat at the same time. No matter where you stay I highly recommend taking the Free Berlin tour (it leaves from in front of the Dunkin Donuts across from the Berlin Zoo station and you can find info about it posted there). This was really a great tour and it was a highlight of the trip for me.", "Date": "March 13, 2006"}], "HotelInfo": {"Name": "Berlin Mark Hotel", "HotelURL": "/ShowUserReviews-g187323-d199430-Reviews-Berlin_Mark_Hotel-Berlin.html", "Price": "$70 - $186*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Meinekestrasse 18-19</span>, <span class=\"locality\"><span property=\"v:postal-code\">10719</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "199430", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/20/c7/20c754719c23ba33190f08af6c73ce9e6large.jpg"}}