{"Reviews": [{"Content": "Centrally Located We stayed in the Avante Garde hotel for 3 nights in February. The hotel is well located for sightseeing with the U-Bahn station literally just outside the hotel entrance. The rooms were very comfortable and spacious. The only downside is that there are no tea/coffee making facilities in the room. The hotel literature says that coffee is available 24 hours a day in the reception, but we were directed to a cafe next door! The continental breakfast was perfect. They will also do scrambled or boiled eggs. Staff are friendly. Would recommend purchasing the 48/72 hour travel pass if you are on a weekend break (they sell these at reception). These give you unlimited travel on buses, U-Bahn and S-Bahn in A and B zones which extend as far as the airports. This saves quite a bit on taxis. Also would recommend a trip up to the top of the Europa Centre - 5 min walk from hotel. Cost is only 3 Euros and you get audio tour included as well as a film showing Berlin when the wall was still in place. Have a drink in the cafe at the top and enjoy the panoramic views.", "Date": "Feb 26, 2006", "ReviewID": "UR910749189", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "Garden3"}, {"Content": "Highly recommended Stayed here for 3 nights on mini-break to see the city and visit the Christmas markets. Hotel very central, underground station just outside the door and another around the corner (plus the surface train station). Lots of restaurants and shops very close by (including an excellent Dunkin' Donuts!). Hotel staff all very helpful, and the breakfasts were good. Our room was large, but clean, just a bit noisy because it faced the main road at the front of the hotel. The stairs in the hotel could present a problem for less able-bodied people, but there is a lift. Would definitely stay there again.", "Date": "Dec 19, 2005", "ReviewID": "UR777079112", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "MichelleBristol"}, {"Content": "A reasonable hotel. This hotel is well located, 200m. from the Zoo Bahnhof with its excellent transport links. The airport bus (109) stops at U Bahn Kurfuerstendamm which is less than 100m. away.The hotel itself is a little strange sharing the premises with three other businesses. Access to the hotel rooms on each floor is through a very solid wooden door.You have to climb stairs to reception and thereafter to the lift which stops between floors.The room, a single at 鈧?0, was adequate as was the small bathroom. Breakfast was good and presented with some style in a nice room.All in all it was good value, and only thing I did not like (apart from the stairs) was having to pay in advance, despite having given my credit card details when booking.", "Date": "Oct 9, 2005", "ReviewID": "UR630200146", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "wawawa"}, {"Content": "Gem in Berlin A really good hotel centrally located in Berlin.Why? Friendly, helpful staff from front desk,maid to breakfast woman.It is easy to get to X9 bus from Tegel airport-walk 2 blocks.The Zoo train station is right there to. The rooms are very big with a neat bathroom. Your on the popular street (Kudamm)with a variety of things to do. Would recommend to others and gladly go back.", "Date": "May 31, 2005", "ReviewID": "UR394278258", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "trent"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187323-d200296-r4521604-Avantgarde_Hotel-Berlin.html", "HotelID": "200296", "Price": "$228"}}