{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Trondheim, Norway", "Title": "“Good hotel”", "Author": "TrondheimVagabond", "ReviewID": "UR128298109", "Content": "Recommended. Great location, and I had great view over the square.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Esch-sur-Alzette, Luxemburg", "Title": "“Excellent location and service, a really good place to stay !!”", "Author": "Kasel_M", "ReviewID": "UR127145817", "Content": "The hotel Sofitel Berlin Gendarmenmarkt is situated in the centre (Berlin-Mitte) of Berlin very close to the underground railway (Französische Strasse, Friedrichstrasse) in walking distance (about 10 min.) from the most historical spots. The rooms are very comfortable and modern and (free) wi-fi access included. The rich, delicious breakfast buffet is served till lunch time which was very superb, the hotel restaurant was excellent. A few steps away from the legendary Newton bar and the Ritter Sport a delicious chocolate factory, both a must see. The stuff were delightful, friendly and very helpful. I highly recommend this hotel and will return for sure.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Excellent location and accommodation in the center of Berlin”", "Author": "pemabuk", "ReviewID": "UR125081834", "Content": "We recently stayed at the Sofitel during late February. The location was top notch for our stay of 4 days/4 nights. We only used a cab to come home from Potsdamer Platz one night after a late dinner. Otherwise were able to walk around and enjoy the city. The rooms were well apportioned, clean and housekeeping service was great. Pure HD flat screen, which is nice, because a lot of times you get a flat screen TV in a hotel, with a non-HD signal. Service at the front desk was excellent upon check-in and with any requests for flight confirmations or advice. The hotel has a boutique feel to it, there are not many staff, perhaps one or two, at the front desk or in the lobby at any one time. I can't comment on the breakfast or the attached restaurant - there are many well reviewed and starred restaurants to go to instead. We booked a few months in advance, so the price was great. We also received a complimentary upgrade from a \"Classic Room\" to a \"Luxury Room\" at check-in - which was great. That room included a sofa, table and eating area that the \"Classic Room\" doesn't have. Will definitely return to Sofitel upon my next trip to Berlin.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "são paulo", "Title": "“great”", "Author": "fabiofraga", "ReviewID": "UR123870533", "Content": "we were only two days but we were very well attended. the price was great and the room is large and very confortable. Fits all: couples, family and yourself Good location near metro and the island of museums", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Good location, quiet, comfortable room”", "Author": "poetrylover", "ReviewID": "UR123857603", "Content": "The location is excellent, close to the metro, the main streets and many attractions. The staff are professional and helpful. The buffet breakfast is good, but expensive. There are many cafes and restaurants nearby. There is a safe in the room but no tea-making facilities. I found my room rather too dark but this was partly due to it facing the inner courtyard as well as the low lighting.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“The place to stay in Berlin”", "Author": "Violet_and_Jeff", "ReviewID": "UR122930840", "Content": "Apart from a location which cannot be bettered, this boutique hotel offers everything, and more, a hotel guest needs. Most comfortable rooms [even if a tad quirky - it is a French hotel after all!], a superb breakfast buffet and a top-notch restaurant \"attached\" to the hotel. Above all, the staff is delightful, friendly and exceedingly helpful.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Harpenden", "Title": "“Great location, helpful staff”", "Author": "Were-rabbit101", "ReviewID": "UR122565791", "Content": "Very central location, within walking distance of the Brandenburg Gate, Reichstag, Belin Cathedrals, Checkpoint Charlie etc. Several stations within a few minutes walk. Excellent, comfortable room and facilities. Quiet room, but rather too warm overnight. Had AC running at 16C, but couldn't get a comfortable sleeping temperature. My son had the same problem in the room next door. Gym and Spa looked good, but no jacuzzi or pool. Staff very helpful in providing directions, train times etc. Did not eat in hotel as it is much better value to find a local coffee shop.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“A boutique style hotel, with small rooms, but a great location”", "Author": "HOTELCONNOISSEUR1966", "ReviewID": "UR122477584", "Content": "We stayed here for a couple of nights in what was described as a Prestige Suite, but was really only a Junior Suite, with sliding doors that were supposed to screen off the bedroom but they did not work very well. Housekeeping was not that great and the room felt a little grubby. Bathroom was nice but lacked sufficient toiletries. The bed was on the low side but was very comfortable. Staff on Reception and at Breakfast were very helpful and the breakfast selection and quality of food were both excellent. A good choice for a short break in a very central location with a lovely view to the Gendarmenmarkt. All in all a nice hotel but does not live up to its 'Luxury' billing.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kavala, Greece", "Title": "“Great Christmas experience”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR122276049", "Content": "Wonderful hotel, mixture of modernistic design and traditional comfort. Great staff . Perfect location, we walked almost everywhere around the centre and and also near 2 U-Bahn lines for longer jaunts. Gave us an upgrade - fabulous accomodation. Would go back tomorrow.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Location, Location, Location”", "Author": "steakandWine", "ReviewID": "UR122076746", "Content": "Situated in a great spot, service is very helpful, friendly and useful, but most of the things are over-priced, rooms are too small, and breakfast served to our room was too expansive. We got a room on first floor, facing the impressive Gendarmenmarkt, at evening the view was very impressive. A very comfortable bed, the room was clean and shower was very well equiped, we loved it. For dining, try somewhere else. the breakfast across the Gendarmenmarket in a place called Amici, or at the Chipps, are mach better value for money, and dinner at the restaurants down the streets are also much better.", "Date": "December 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston", "Title": "“A very comfortable hotel in the heart of Berlin”", "Author": "oilfieldtravelled", "ReviewID": "UR121941982", "Content": "We recently spent 3 nights at the Sofitel in Berlin as part of a fairly quick trip to Europe. It very much lived up to the standard of hotel that it is. Quiet room, comfortable bed and no little annoyances that you can run across in some hotels. The staff were friendly and helpful. There was easy (free) wi-fi access and a good coffee machine in the room (Nespresso). The hotel is located one block from Friedrichstrasse.....shops, restaurants, Checkpoint Charlie and next to the Gendenmarket (winter market). It is a 10 minute walk to the Brandenburg gate and Reichstag. The U-bahn is also 1 block away. Plenty to see and do. I must admit that the highlight was a Berlin Philharmonic performance with Sir Simon Rattle conducting. All in all it was a wonderful break and the hotel ensured our comfort and well being.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stowmarket", "Title": "“SUPERB SMALL HOTEL”", "Author": "ManInSeat42 Posted by an Accorhotels.com traveler", "ReviewID": "UR121884040", "Content": "The service is excellent here, the location great for this part of Berlin and with the brilliant restaurant Aigner on site, what more could you ask? Well, actually a coffee maker in the room would be nice! Try the room service!", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Londonj", "Title": "“MOST PLEASANT”", "Author": "Elmo_Cohen", "ReviewID": "UR121553661", "Content": "When my work travel agents booked me here I was dreading the single bed and fact i wouldn't be staying at the sumptuous Adlon. Room was compact, but had all you could need. Wifi was free (I loathe posh hotels that charge for it), bathroom modern and room service delicious. Staff couldn't be more helpful, especially at 5am checkout when they gave me newspapers, croissants, fresh OJ and even a brolly, as it was raining out. So thumbs up from me. Danke.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Lovely hotel, greast location. Staff very accommodating.”", "Author": "latius", "ReviewID": "UR121391571", "Content": "This is the second time we have stayed here. The staff will cater to your every need, nothing is a problem. The views of the Gendarmenmarkt are lovely. The rooms are perfect with every detail thought of. The only slight gripe would be the service at breakfast can be a bit slow. Other than that, I would recommend this hotel.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "glasgow", "Title": "“Sofitel Gendarmenmarkt, Berlin from Glasgow wanderer....”", "Author": "losaltos Posted by an Accorhotels.com traveler", "ReviewID": "UR121282290", "Content": "Spouse & I stayed here for a long weekend. It's in an incomparable location in Berlin, right at the centre of things. The (very upmarket) Christmas markets are across the road in the middle of the square on which the hotel is situated -- wonderful! Service, style, informality all first-class. Breakfasts are really superb, and very casual. The only thing is there is not much space to sit around the lobby on the ground floor, but that is a mere detail. All in all, fab......", "Date": "December 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Halifax, United Kingdom", "Title": "“Modern, chick hotel with a great location”", "Author": "andytudor46", "ReviewID": "UR121208936", "Content": "We arrived ar the hotel at the checkin was very quick and the checkin staff were very friendly, they asked us if we needed to know anything about where to go and even handed us a map of Berlin which was great :-) We started in room 203 and the room was fab, very mondern and stylish and the bed was so comfy :-) we had a mini bar and free Internet (make sure u get the free code at checkin) the room also came with a fab view, I couldn't fault the room at all was fab :-) We had a few drinks In resturant/bar and we had cocktails which were great you could tell the guy was experienced, we didn't eat though but the prices for a main meal was about 20 euros which about right for a meal in Berlin at nice resturant. We didn't have breakfast through as we always went to Starbucks as the food was great and good priced too :-) The location was great too 2 mins from the main shopping street and 5-10mins walk to the Berlin gate and 5 mins to starbucks. To sum the hotel up I would defo stay here again but I would try somewhere else next time as it didn't pop out at me as some hotels have. Great hotel though", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Lovely Boutique Style Hotel”", "Author": "3away", "ReviewID": "UR121195551", "Content": "This Sofitel is small enough to keep a personal feel to it and situated in a fantastic part of town. For Christmas markets they are across the street, there are plenty of restaurants and a food hall nearby as well as shops if you want to explore. The hop on hop off bus is close to the hotel one full loop takes about 2 hours but the main attractions are within walking distance if you like to walk or a short trip on the U-Bahn. Staff are friendly and very helpful, nothing is too much to ask and the rooms were well appointed. We had a junior suite overlooking the Gendarmenmarkt which was very relaxing with a lovely view at night and there are coffee facilities (nespresso) in the room. Taxi from Tegel airport took about 20-30 mins and cost 20 euro. I would most definitely stay here again!", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Finlandaise à Paris", "Title": "“Beautiful hotel - great situation!”", "Author": "Pauliina5", "ReviewID": "UR120386548", "Content": "Really lovely, peaceful hotel. Room not very big, but well organised. Ideal situation, in the very center, next to to amazingly beautiful Gendarmenmarkt. The shopping street Friedrichstrasse is around the corner. Bus stop for the city tour very close. Friendly personnel. We we lucky to have view directly to Gerdarmenmarkt and the magnificent concert house. Lovely breakfast, very good quality restaurant (traditional food with Austrian influence). Even if light fine dining is our favouraite, we tried the restaurant once, and liked it very much. (We also tried VAU, one Michelin star restaurant, which is very close, and highly recommend. The only thing we did not appreciate was the bed. In a luxury hotel one should not have anything to complain about the comfortableness of one's bed.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kent", "Title": "“Great hotel in great location”", "Author": "MrsMKent", "ReviewID": "UR120301767", "Content": "Fabulous. Staff helpful and hotel lovely. Our room had a wonderful view over the buildings of the Gendarmenmarkt. Bathroom wacky but plush (the doors!) Only minor gripe was the Tv. Could not get the remote to work properly.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great hotel and great location”", "Author": "17RLL", "ReviewID": "UR120228713", "Content": "A hotel that works really well and in a great central location. All the reception staff were friendly and helpful and knew everything you would want from them. The room was well designed and bed very comfy. The bathroom had a really great rain shower. We once called reception near midnight for something and it arrived within minutes; very impressive. Also had curtains that actually kept out daylight which might seem small but have stayed in hotels that are supposedly grand where the curtains don't work. Free wi-fi as well. Breakfast was very good with plenty of choice and again great service. Highly recommended hotel.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Good Service Excellent Location”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR120109712", "Content": "From check to check out the staff were friendly and helpful. Plenty of room in the junior suite that had an excellent view of the Gendarmenmarkt. The hotel was well located near museums, tourist sights and shopping.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kloten, Switzerland", "Title": "“Stylish little hotel in the heart of Berlin”", "Author": "Quilmess76", "ReviewID": "UR119630199", "Content": "The Sofitel at Gendarmenmarkt is almost a boutique hotel with only 72 rooms. We were attracted by the location, opposite the French Dome at the Gendarmenmarkt with a ton of history in a couple of minutes walking distance (Brandenburger Tor, Unter den Linden, Checkpoint Charlie) and of course ample shopping. The room was spacious, well designed and arranged, it was odd to find the A/C running every time we returned after the day out because it was already quite autumnally cold outside. WLAN is for free, access codes are available at the reception, for whatever reason LAN is not. They also provide a bottle of Evian for free which is really nice along with free Nespresso coffee capsules and a machine to brew it. We booked without breakfast because that is unreasonably expensive and you can eat anywhere for far less. we opted for the gourmet food-court in the Galerie La Fayette which was a good choice, so is the Ritter Sport Chocolate Lounge around the corner. THe only downside of the room was the mattress which was way to soft and they placed to single mattresses on a king size bed. not ideal. we can recommend the hotel.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“fantastic hotel experience in Berlin”", "Author": "linda r", "ReviewID": "UR119525118", "Content": "My husband and I recently spent 3 nights at the Sofitel Berlin Gedarmenmarkt and I cannot rave enough about the personal attention we received throughout our stay. Hotel staff across the board were top notch. Everyone in the hotel went out of their way to give us special attention. We stayed in a junior suite with a great view of the Gendarmenmarkt. The location was great for branching out into other neighborhoods and we covered most of the city on bicycles rented from the hotel. I highly recommend the breakfast included, it was one of the highlights of every day.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "", "Title": "“Bad A Club experience”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR119393903", "Content": "Booked two rooms for us and our kids through Accor website, and requested interconnecting rooms. When we arrived we were informed they had no interconnecting rooms and showed us to possibly the two worst rooms in the hotel. As an A Club Gold member I was not impressed, as my status with Accor didn't seem to matter to them. I informed them that I was entitled to an upgrade. They begrudgingly found another two rooms down the corridor from each other, which was extremely inconvenient with two children. They made noises about finding other rooms, but none eventuated. The front desk staff were basically totally uninterested. This is one of the worst Sofitels I have stayed at, in total contrast to the Sofitel Amsterdam where we stayed before Berlin, which was wonderful, and everything Berlin was not. A very bad experience and not up to Accor's usual standards.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manila", "Title": "“The Perfect Hotel in Berlin”", "Author": "Saxmax", "ReviewID": "UR119393750", "Content": "Everything about this hotel was great. I couldn't imagine staying in any other hotel when I visit Berlin next. Location was superb, close to many attractions, restaurants and good shopping. Rooms were well designed. Bathrooms clean. And more importantly, staff were excellent. I'm 100% sure I made the best decision staying in this hotel.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Warsaw", "Title": "“Very nice stay in a heart of Berlin.”", "Author": "WaldemarZ Posted by an Accorhotels.com traveler", "ReviewID": "UR119190109", "Content": "We had stay at Sofitel Gendarmenmarkt over the last weekend. Hotel is located in Gendarmenmakt close to many restaurants, Newton Bar :) and shopping on Friedrichstrasse. Two minutes walk to Museums Island and Unter den Linden. The room we stayed (Juniorsuite) was facing Gendarmenmarkt and was very clean with modern furniture and appliances. Separate bathroom and toilet. We were checkin-in early in the morning and the room was not ready at that time. Reception called me back in 1.5 hours to inform that the room is ready. Simple but very usefull. Checkout quick and efficient. Highly recomended hotel for a short stay in Berlin Mitte.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“Comfortable and spacious”", "Author": "Steve8010", "ReviewID": "UR119161896", "Content": "We booked a junior suite as it was quite competitively priced based on the surrounding hotels. It was a decent size corner suite that had large windows overlooking the Gendarmenmarkt. Bed was comfortable and the amenities provided were sufficient. The heating of the room was difficult to manage throughout the night and we found that we had to open the windows occasionally to allow air flow through (even though it was freezing outside!). The breakfast was lovely and the attendants were very attentive. The selection was good as well. The location was fantastic - a short walk to the main train station that takes you all around (including the convenient stop at Berlin Zoo) as well as the underground stations that were littered around the hotel site. All the staff we experienced in our travels were very helpful and polite and had good english speaking skills! The restaurant within the hotel (but not affiliated) was the best meal we had on our entire trip - well worth the visit! Highly recommended.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Handforth, United Kingdom", "Title": "“wonderful experience”", "Author": "Lynda47 Posted by an Accorhotels.com traveler", "ReviewID": "UR119110077", "Content": "The hotel was superb. The staff were friendly and very helpful. We dined twice in the restaurant which was also excellent. Our room was wonderful with a great view of the square. the position of the hotel couldn't have been better.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Arizona", "Title": "“Excellent location, but only average Hotel”", "Author": "loveIItravel", "ReviewID": "UR119012751", "Content": "I am disapointed with the Sofitel Hotels. We arrive on a Sunday and wanted to arrange for a tour the next day. They had no Concierge and the front desk personnel was useless. We asked where we could buy bottle water and they directed us to the central metro station. When I walked out I noticed a Hilton a block away. We went to their store to buy water!. Why didnt the front desk make the suggestion - useless!. The next morning we noticed the room was unconfortably hot, I made notice to te front desk when we left for the tour I found on the internet, Thank goodness for Wifi!. When we retuned that evening the room was still hot. I asked the front desk and they offred another room. I asked to see it beofre we moved. Glad I did the room temperature was even worse, We went back down and now the front desk manager said that they had change to cold weather settings and the aircondinoting had been turned off. The carpets were dirty and stained, Next time I will stay at the Hilton!", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Amazing hotel in amazing location”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR118649472", "Content": "The room I had on the top floor was lovely and modern and the view stunning. The location is great on the beautiful Gendarmarkt with a few upmarket restaurants and bars very nearby. i'd definitely stay there again and was great value for money.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kippaxs", "Title": "“Excellent choice”", "Author": "Barnacles70 Posted by an Accorhotels.com traveler", "ReviewID": "UR118639919", "Content": "Perfect location opposite concert hall, near classy shops, not far from Brandenburg gate, next to tourist bus stop etc etc. Beautifully designed and appointed rooms including Nespresso machine! Breakfast too expensive: go to Galeries Lafayette next door for this. Remember to book for dinner at any nearby restaurant on Fridays, Saturdays and Sundays: there is next to nothing available for walk-in.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "jersey", "Title": "“Ticks most of the boxes”", "Author": "aussijerseytraveller", "ReviewID": "UR118418718", "Content": "This is a quiet, modern, smart, clean hotel which is conveniently situated. Very friendly and helpful reception staff. All the major attractions (other than those around the zoo) are easily walkable. We did not eat in the restaurant as breakfast seemed pricey but found many eating places close by.", "Date": "September 21, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great location, fantastic staff and great rooms. Excellent choice!”", "Author": "mick909", "ReviewID": "UR118219357", "Content": "After much searching for a hotel in Berlin, we stayed here for 5 nights in August this year. One of my better choices and I can't recommend the hotel highly enough. Great location (in Mitte area), fantastic staff and an awesome view of the Gendarmenmarkt, We got a junior suite which was modern, very clean and very comfortable which had an open balcony which you could sit out on and look over all over the Gendarmenmarkt. The staff were very efficient and super keen to assist in any way possible, all spoke excellent English. We were there for a holiday and it was very centrally located for all the tourist spots we were looking to see. It was the best hotel we stayed in on our trip through Europe (and by far the best value). They have a really nice fitness and wellness area too that is mostly complimentary I think (except for massages). A bonus was the macaroons they had at the front desk every day!", "Date": "September 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“A Jewel in the new heart of Berlin”", "Author": "Gottschmitt Posted by an Accorhotels.com traveler", "ReviewID": "UR117223371", "Content": "This small luxury hotel offers outstanding service and luxurious rooms at very good prices in the chic gendarmenmarkt area of Berlin.I have stayed there several times during the last 3 years and always felt pampered by the attentive staff and spoiled by the low key functional luxury of their suit rooms. The brasserie restaurant Aigner,attached to this hotel,offers simple but well tasting dishes of the german/Austrian cusine at reasonable prices. I will definitively come back!", "Date": "August 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "falkirk", "Title": "“excellent hotel well situated”", "Author": "clyde12Falkirk Posted by an Accorhotels.com traveler", "ReviewID": "UR116748407", "Content": "we stayed with our grand-daughter and an extra bed was provided free of charge.One example of slow service in the restaurant but handled very well and more than adequately compensated for.a top class hotel", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“terrific hotel”", "Author": "sacarajane", "ReviewID": "UR116635067", "Content": "We were there for my son's wedding. The hotel gave them a beautiful room with a view and filled the room with flowers, champagne and chocolates. The staff were terrific", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Gothenburg, Sweden", "Title": "“We'll be back for more”", "Author": "farawayfromhere44", "ReviewID": "UR115682943", "Content": "Stayed at this hotel for 6 nights for a conference. Excellent service and very nice room. Me and my family stayed in a very nice suite with a lovely view to Charlottenstrasse. The staff was very nice and welcoming and they gave most relevant tips for things to see and do. The location is the very best 2 blocks from Unter den Linden. There is a U-bahn station 1 minute walk from the hotel which took us to excellent shopping in no time at all. The only question rased was about the internet. There was old information in the room about this which made us sign up for a connection for 35 euros for a week. We soon found out there was a free wireless connection provided by the hotel. When we pointed this out we were not charged for the internet at all. The staff dealt with this very professionally. The room was extremely clean and fresh. We didn't have the breakfast since we thought it was very expensive (18 euros per person). There are several restaurants and cafes minutes walk from the hotel with breakfast at 10th of the cost. The overall impression from our stay is that this is an excellent hotel which we would be delighted to get back to. Berlin is by the way a lovely and exciting town.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Amazing hotel facing a beautiful square”", "Author": "InspirationLondon", "ReviewID": "UR115518626", "Content": "Great hotel facing a beautiful square in Berlin (check it out in the evening when the colourful lights make it really special). The hotel has a very modern look and feel and rooms are quite spacious. There's great attention to detail - but the bit I liked most was the Nespresso coffee machine in our Superior room: really good quality coffee! I cannot comment on the breakfast as I didn't try it - although the hotel can be a bit pricey I would definitely recommend it and will probably stay there again if back to Berlin (Accor hotels normally have 3x2 offers or weekend special rates, which make this hotel really good value for money).", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Jerusalem, Israel", "Title": "“Enjoyable time in Berlin”", "Author": "MoooTi", "ReviewID": "UR115352884", "Content": "Our family have stayed 5 nights in a mini suite room. Room is big and sufficient for 2 adults and 3 keeps. Hotel is very well located in walking distance from all major attractions and public transportation. Just opposite to the church that have concerts and show. Very good restaurants next by. Hotel staff is welcoming and helpful in any questions (flaunt English) clean, good service, great & rich breakfast, best service. We enjoyed much our stay.", "Date": "July 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Alnwick", "Title": "“Excellent hotel”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR114786322", "Content": "Very comfortable bed and great power shower, helped to set me up for the day ahead. I know Berlin well and have stayed there several times. As my time in the city was very limited on this occasion I chose this hotel as the location is very central within easy reach of bus to Berlin Tegel Airport. I found the staff welcoming and helpful.", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Cosenza, Italy", "Title": "“Thanks for making our days in Berlin even better”", "Author": "GUSDALI", "ReviewID": "UR114635177", "Content": "We really have to thank this beautiful hotel (and its staff), perfectly located in the most beautiful Berlin´s square. Excellent service, comfort, cleanliness and the beautiful view from our room, have contributed to make our three days in Berlin were even better.", "Date": "June 22, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Edinburgh. Scotland", "Title": "“Great area, really nice hotel”", "Author": "Fiona019", "ReviewID": "UR114393202", "Content": "Stayed here for 5 nites - Really nice room with a large comfy bed. Staff very pleasant/helpful. Didn't try the restaurant but it was always very busy. Did use the bar one - which was fine for a late drink. Hotel is in a really nice street just a few streets over from Checkpoint Charlie Would recommend hotel / stay here again.", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great Food!!”", "Author": "beno77", "ReviewID": "UR114379697", "Content": "This hotel is just what you would expect from Sofitel. Most things are done very well but a special mention to the breakfast (especially delivered to your room) and the room service was delicious although the range is small.. My only gripe was check in being at 3pm seriously annoying but i did know that when I booked. Cleaning of the rooms is a little slow I came back after being out most of the morning to return at 3pm and room still wasn't cleaned.. But service from all staff members was very good.. WiFi is free but you need to call to get a new log in each day which is a little annoying just make it free permanently..", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Stow, Massachusetts", "Title": "“Exceptional ambiance and service!”", "Author": "GlobeStomper", "ReviewID": "UR112915498", "Content": "This Sofitel hotel provided the best lodging experience my wife and I have had to date. From our stylish room and amazing view of the square outside to the tasty food and exceptional service, it was a first class stay on every level. I was most impressed by the little things such as the staff calling me by my first name as I entered and exited the hotel, as well as the concierge's persistence in helping us get great seats at the Deutsche Oper Berlin on short notice. Kudos to the staff!", "Date": "June 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Adelaide", "Title": "“5 Star quality +”", "Author": "vivehodie", "ReviewID": "UR108456414", "Content": "Friendly service from every single staff member, top location, value for money. Best hotel we stayed in while in Europe", "Date": "May 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“Very well located but disapointing hotel”", "Author": "AddAdrTA", "ReviewID": "UR107546743", "Content": "Definitely the less attractive Sofitel I went into. Though the location is great, the room we had was small (so was the bathroom) and with old furnitures. The TV was small, old (non flat) and incorporated in a glass cubicle ... so weird. The staff was ok but nothing more. The breakfast buffet was quite expensive for what it was and the bar was located in the restaurant next to the hotel and had no chairs, you had to seat at the desk. In addition the cocktails we had were not good ... In summary, I wouldn't recommend this hotel. I already went in the nearby \"The Regent\" which was fantastic and will try next year the nearby Hilton which sounds ok.", "Date": "May 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Great hotel, with some quirks”", "Author": "olympicnut", "ReviewID": "UR104159675", "Content": "The good far outweigh the bad that's for sure. Fantastic staff, from the front desk to the super nice bartender to the housekeepers. We had many questions for the concierge and they were always very helpful with restaurant suggestions and directions. They even printed a map of the area to help us find a particular restaurnt. We didn't eat at the restaurant, but it was packed every single night. The rooms are decorated quite nicely and are very clean, and the bed was super comfortable. It was nice having turn down service as well. One quirk was the air conditioning. We couldn't seem to get it to cool off at all, and had to open the windows to get fresh, cool air (we prefer to sleep in cool hotel rooms). We just attributed it to being different than in the States. A couple of days went by and I mentioned it to the front desk, whereupon they said they hadn't switched the air conditioning for the building to \"summer\" mode, which is why we couldn't get cool air. Luckily our room faced the courtyard, so it was relatively quiet, and we could open the windows with no sound issues. If it faced the street, the noise with the windows open would definitely had been an issue. The door to the toilet doubled as the door to the bathroom when you opened it all the way, which was fine, but it was a frosted glass door. I HATE that! I've seen that so much in Europe and I really dislike feeling like the people in the room can see me do my \"stuff\". Outside of that, I highly recommend the Sofitel. The location is fabulous!! Especially for tourists like us.", "Date": "April 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Only OK”", "Author": "Sagittarius_7", "ReviewID": "UR103290190", "Content": "Here is a summary: UPSIDE - Location, very central. Nice view of Gendarmenmarkt from room. Windows in room open. Helpful reception staff. DOWNSIDE - Corridors smell of smoke. Dirty carpet in room. Strange design of room not practical eg. TV in a glass cube, fabric wardrobe fronts that get grubby. Bathroom doors design not user- friendly. Overall - Would recommend the Westin Grande over this hotel.", "Date": "April 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Exceptionally nice hotel for business”", "Author": "mrwatson", "ReviewID": "UR101406646", "Content": "I can't say enough great things about this hotel. Great rooms, nicely set up with everything you could think of - umbrella, yoga mat!, hand weights, robe etc. Good sized desk to work at. Extra closet space. Very handy for business travel.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Fabulous hotel during ITB, glad to be back again!”", "Author": "Feyenoorder", "ReviewID": "UR100576288", "Content": "This superb hotel is located on the Gendarmenmarkt and is convenient to everything. I have stayed before and they have ramped up the service levels even more so that I was very impressed, from check in and my welcome to the room with the duty manager accompanying me to the room, Rooms are modern, the bed is super comfortable and all the expected amenities are there. Regarding the tv, it is not an LCD, but the rooms are in a special design and the tv is housed in a semi transparent cube of glass.", "Date": "March 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Great hotel and location”", "Author": "yorkiebax", "ReviewID": "UR99157736", "Content": "The service was excellent and staff were very accommodating. They had apples and macarons for guests as they check-in. Location is superb (S-bahn, tourist sites, shopping, restaurants, airport transportaion, etc). You can pretty much walk from the hotel to main areas to visit while in Berlin. The S-bahn is less than a 5 minute walk. The main shopping area is just behind the hotel. The restaurants around the hotel are all high end. The room was a decent size and bed was comfortable. The TV though is pretty old (it wasn't LCD). Fitness centre was also pretty good. There was no fee to use the sauna and steam room. Overall, I was very satisfied with the hotel but then again for the price you pay per night to stay at this hotel I expected nothing less.", "Date": "March 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Tonbridge, United Kingdom", "Title": "“A great engagement!”", "Author": "Jdw210885", "ReviewID": "UR97976275", "Content": "Stayed there while I got engaged, lovely central location with friendly staff and really well decorates rooms. Highly recommend!", "Date": "February 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Very good hotel & stay”", "Author": "coic35 Posted by an Accorhotels.com traveler", "ReviewID": "UR95748293", "Content": "Very good stay at this hotel despite a rather small bedroom. Very comfortable bed allowing for great sleep. Nice span (sauna + steam room + relayxing area) combined with a gym under the roof, great! Location is excellent in the city centre close to restaurants and bars. Friendly and helpful staff at reception. Will come back again.", "Date": "February 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Wonderful”", "Author": "Pierre4823", "ReviewID": "UR93084914", "Content": "Stayed here for five nights over Christmas. We had two Prestige Suites overlooking the Gendarmenmarkt. Beautiful in the snow. Check in was efficiently handled and staff overall were very friendly and helpful. The rooms were extremely comfortable and the beds were sensational. The breakfast buffet, although not inexpensive, was excellent and set up us each day for intensive sightseeing. Many good restaurants all around and easy access to most of the main attractions. Would definitely stay here again.", "Date": "January 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“Very good”", "Author": "maggis", "ReviewID": "UR91800630", "Content": "Stayed 3 nights in a junior suite with great view over Gendarmenmarkt. Excellent location for sightseeing, shopping and dining. Very friendly concierge and good breakfast. The bathroom is a bit small, but rooms are otherwise great. Will return.", "Date": "January 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Location": "5"}, "AuthorLocation": "Copenhagen", "Title": "“Excellent”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR91008692", "Content": "I am most certainly going to stay at the Sofitel Gendarmenmarkt any time I am in Berlin from now on. Everything is top notch, so can't think of more superlatives.", "Date": "December 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Fantastic, amazing, brilliant customer service”", "Author": "Jessa078", "ReviewID": "UR90476398", "Content": "Would love to stay here again. hotel is beautiful, staff are very friendly, helpful and knowledgable. very convenient location for tours, christmas markets etc", "Date": "December 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Conference visit to Berlin”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR90457941", "Content": "I had a 4 day meeting in Berlin, and this was the closest location. Glad it was, as it was really cold all the time. The design and decor are very modern, the staff really helpful and the room was REALLY nice, care of loyalty upgrade.", "Date": "December 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“No better place to stay”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR90298604", "Content": "Fantastic boutique hotel, central to everything you would want to see and do in Berlin. The hotel is prefectly styled, elegant, relaxing and cosy all in one, particularly nice in the winter. The rooms were comfortable and warm but the bathroom design might not be to everyones taste with the unusual doors, although it is very stylish and was always immaculately cleaned. A special mention to the staff who were not only polite but very helpful and extrremly friendly and I have to mention especially funny. A special mention to the manager who could not have helped us more especially with fitting us in to the resturaunt beside the hotel. The food is so good I would highly recommend having dinner there.", "Date": "December 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cologne, Germany", "Title": "“All time favourite hotel in Berlin - super design - great staff - fab details”", "Author": "EuropeanDiversity", "ReviewID": "UR89537111", "Content": "Berlin is a very, very competitive market for hotels, and many of them have unique selling points, ranging from location to style, personalised service or other values. The Sofitel at Gendarmenmarkt has it all, and it continues to be my favourite place to stay in Berlin, and I did stay at quite a few others. The hotel is a former socialist building, which has been completely redesigned and turned into a design temple in the best possible way. Cool entrance and lifts, spectacular gym (in the attic) and unparalleled restaurants (the breakfast room!) and event rooms (the Delphinum is one or Berlin’s best event halls). The rooms are not particularly big, but most have a phenomenal view on the square, and some on the upper floors have small balconies. Cool bathrooms with windows to the actual room, exceptional lighting and cosy beds make your stay extraordinarily enjoyable. When I got to my room, I found a small sweet dish (not just some fruit) on the table – a mousse au chocolat – along with a partly hand-written note. This has been one of the most positive surprises during all my many travels and stays. Also, the check-in and check-out staff was so competent and friendly that it even exceeded the five star expectation. If you like design and service, try my favourite hotel – I will always recommend it and go back.", "Date": "December 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "1", "Sleep Quality": "5", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“fantastic position - very small bathroom”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR88920022", "Content": "Very small bathroom. Hotel located in the very heart of Berlin. Clean Modern Polite Staff", "Date": "December 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Menlo Park, California", "Title": "“Great location with helpful staff”", "Author": "CA_Jayhawk", "ReviewID": "UR88495381", "Content": "Every interaction with staff at this hotel has been great. Maybe it's just me, but everyone seems unusually cheerful and helpful. Breakfast was also above average, with a fairly wide selection and a gracious dining room. My room on the 5th floor has a terrific view of the church across the street (and even a tiny little balcony). The room isn't that large, but perfectly comfortable. Evidently, the Christmas market in the square outside is one of the nicer ones in Berlin. It was bustling and crowded last night with many people enjoying \"gluhwein\" a warm spiced wine. The location seems to be a good one if you're doing a little tourism. I walked to the Brandenburg gate and the Reichstag in about 10 min. Internet service is extra (grrr), but at least it's relatively reasonable. I think it was 9 Euro for a day. At the Zurich Hilton the night before, they wanted something like 25 euro for a day. Robbery! In any case, I'd recommend this Sofitel. It was much cheaper than the nearby Westin, and a perfectly nice place to stay.", "Date": "November 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Australian", "Title": "“Great location”", "Author": "theaussierocks Posted by an Accorhotels.com traveler", "ReviewID": "UR87826431", "Content": "Sofitel Berlin Gendarmenmarkt is in a great location, close to underground railway and walking distance from most historical spots. The staff were very helpful and the rooms were very modern and comfortable.", "Date": "November 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cambridge, UK", "Title": "“A good place to stay”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR87558344", "Content": "Very comfortable hotel. Quiet rooms and a central location. Excellent restaurant with good value food at lunchtime", "Date": "November 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Sofitel Berlin - no iPad connection”", "Author": "GBSLondon", "ReviewID": "UR87019462", "Content": "It is not just business travellers who look for Internet connection while away from home and office. Everyone from pensioners to students has found that it enhances travel. Not only   emails anymore, but airline check-in, local weather, local information and with the iPad apps your hometown daily newspaper too. The iPad is perfect for the traveller. It is light and portable, has long battery life and is dead easy to use. So it was more than just mild disappointment that at the Berlin Sofitel their WiFi coverage rejects the iPad.. The desk knew about this problem and connected me to their service provider who explained that this was something they had not been able to resolve and that there was regrettably no work around. Breakfast at the hotel is an eye watering €28 so if all you want is  coffee and a croissant then the Cafe Einstein is a four minute walk away and they have free WiFi where the iPad is welcome.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tokyo", "Title": "“Best service and location in Berlin-Mitte”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR86020673", "Content": "Rooms overlooking the Gendarmenmarkt with its impressive architecture are small but very practially furnished and kind of cozy. Very friendly and efficient staff, always. Most major Berlin attractions, museums and concert houses - and excellent Cafe Einstein -are all in walking distance. That's it.", "Date": "November 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Frankfurt", "Title": "“value for moeny, will go back”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR85524489", "Content": "Will happily recommend the Hotel to other colleagues. it is not cheap bt the location does justify the rate.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Canada", "Title": "“Nice Location, Kooky Hotel”", "Author": "PeteCanada", "ReviewID": "UR84069558", "Content": "I was here for 4 nifghts in October 2009. The hotel is located very centrally in Gendarmenmarkt, a very pretty square near the main street, Unter der linden. It is only a 15 minute walk to Museum Insel and its attractive museums of archeology and art. The Sofitel had a computer to check e-mail, so that was a very nice touch (no charge). The rooms were modern but unnecessarily funky. The light controls needed a bit getting used to, as did the multi-colored lighting. It felt like a disco dance floor! Bathroom was decent, but the swinging glass doors that separated the toilet from the shower was annoying and a bit unhygienic. I would have preferred a self-contained shower stall that was completely enclosed, like what they have in the Kempinski Hotels. The lobby was too dark for my taste, but that's the style here in this hotel. I've stayed at Sofitel before, in Montreal, and I must say that this Berlin version was inferior -- the room decor just left me cold. Fortunately, Berlin has lots to see outside!", "Date": "October 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Derbyshire UK", "Title": "“The best location we could have found”", "Author": "Scouserabroad", "ReviewID": "UR83552296", "Content": "Lovely hotel, warm and efficient staff, fabulous location.", "Date": "October 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lansing, Michigan", "Title": "“Very pleasurable business”", "Author": "Brandon63", "ReviewID": "UR82133704", "Content": "Perfect little city hotel with lots of charm and great staff too. Normally we aren’t too crazy about cookie-cutter chain hotels, but this little gem has a perfect mix of classical charm and modern innovations. Great location and value too. Thumbs up!", "Date": "October 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“First time at the Sofitel and will try to stay again next time”", "Author": "AGEastLondon", "ReviewID": "UR80828357", "Content": "This was my first visit to the Sofitel. A modern, very comfortable hotel and had the feeling of not being too big. Excellent front desk. Rooms were comfortable but because of the design of the bathroom (window through to the bedroom) probably not ideally suited to a couple of friends sharing a twin room - I however was travelling for business and on my one and so it was perfect.", "Date": "September 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Well located smoothie with class, value, relaxing spa, and A-1 service.”", "Author": "SoBeAddict", "ReviewID": "UR79112205", "Content": "Easy on the eye and senses. Well located for walking to sights and public transportation. Sofitel is across from one of the most beautiful squares in Europe. Five star in subtle ways. Even the smaller rooms are well arranged for one person, but for two go for the superior room or better. I was upgraded to a junior suite , but I decided not to write my review based on this fabulous room with views of the Gendemarket because not every one gets these rooms. If you don't get a view than go to the gym, sauna, spa, and solarium on the top floors and relax on a lounger with a book and provided cd player with views of all of Berlin before dinner. Service is beyond compare at the superlative level from everyone at the front desk and throughout the hotel in a most genuine and warm manner. These wonderful people take pride in their job and hotel. If you want Berlin in your back pocket, Nicolai the concierge is your man from the small requests to the large ones. For example, a top ticket to the sold out opening night concert at the Philharmonic was secured by him with a phone call to you when you are out and about. Need to go to another city? Nicolai will book you on Easyjet and try for the cheapest and most convenient fare including a discount on the luggage charge. Now, about those expensive breakfasts which all the top hotels provide: I can say this hotel does well, but unless you like champagne in the am or it is included than try it for just one morning and then go around the corner to the Unter der Linden to Dressler's, Einstein, or my favorite which is the Opera Cafe for half the price and get that grand Hapsburg/Hollenhazern feeling. You can not hold a reception in the bathroom, but they are well designed in a luxurious way with great towels. This hotel is very quiet and relaxing.", "Date": "September 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seven Mile Beach, Grand Cayman", "Title": "“Quality”", "Author": "SB1234567", "ReviewID": "UR75747450", "Content": "Standard room. Modern, clean, comfortable, good value, good location, helpful staff. Had no problems, no compliants, the standard is what you'd expect from this brand. Nothing wrong with this hotel.", "Date": "August 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Frankfurt", "Title": "“Business in Berlin”", "Author": "JackTrost", "ReviewID": "UR73542429", "Content": "I had a meeting in Berlin and booked the Sofitel. The location was great since there were many sites that could be visited int eh time between meetings. I had a room on one of the top floors with a small terrace that overlooked the Gandarmplatz. This added a touch of relaxation to the trip. The staff was very helpful and the hotel was an expeience to walk throught the hotel and see the pictures on the walls. On the groud floor there is a meeting room with a billiard table covered in glass that can be used for a conference or a meal----I think (it might just be a decoaration!).. All in all, highly to recommend.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Minimalist hotel at a great location”", "Author": "Family-C-L", "ReviewID": "UR69878568", "Content": "This particular trip to Berlin was for business so we chose a centrally located hotel with cleanliness and ease of travel being the top criteria. The hotel is within walking distance from shops, restaurants, buses, etc., and is located in a chic and safe neighborhood. The room was well appointed, with a Nescafe machine (complimentary) and Hermes toiletries. From our room we had a view of the street and the cathedral, which could be risky noise-wise, but we didn't have any problems. The bathroom (with a small shower) was tiny, but for a quick business trip, this was fine. There is a computer in the lobby that you can use free of charge, or you can purchase WIFI Internet at a reasonable fee. The staff is relatively helpful, but not the most knowledgeable. The only criticism I have is on the bed. It was not very comfortable.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Beautiful boutique hotel”", "Author": "ScotAMS", "ReviewID": "UR66943386", "Content": "Great staff, great location, GREAT breakfast. Booked a Standard room that ended up being far bigger than I expected and with a very small balcony too (I don't think all rooms ave this). The staff could not be more helpful and I was extremely comfortable for the whole weekend. Recommended.", "Date": "June 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Taunton, United Kingdom", "Title": "“Lovely, cosy hotel”", "Author": "flyingbee", "ReviewID": "UR64897066", "Content": "I had a one night stay at this small hotel on a business trip. I had a single room, which I found to be a great room for a person on their own. I have stayed in smaller double rooms in 4 star hotels. There was a double bed in the room, a small work desk, Bose radio, enough clothes hanging space, and a bathroom with a shower (no bath). I felt 'at home' in the room, very cosy and comfortable. I used the gym, which among other things, had a couple of decent treadmills. After all my hard work in the gym I enjoyed the excellent buffet breakfast. I have quite a lot of quality hotel breakfast buffets, and this was one of the best - I particularly liked the wide choice of prepared fruit. The reception staff were very friendly. It is unusual for me to stay in such a small hotel on business, but it was a very good experience. I'm surprised the hotel is not higher up the tripadvisor list. I would definitely stay here again.", "Date": "May 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Delhi, India", "Title": "“It was Magnifique”", "Author": "indianlady", "ReviewID": "UR64366374", "Content": "This hotel combines French hospitality, style and excellence along with the warmth of Berlin.I stayed for seven nights with my daughter and amazingly we liked the hotel more by the day. We were upgraded to a suite due to our long stay. However the regular rooms are also very nice but small. The suite has a lovely view of the square, a drawing room, two toilets, Hermes toileteries, an expresso machine and ample cupboad space. The restaurant Aigner serves excellent food. If one wants to avoid paying for breakfast, the Galleries Lafayette bakery is next door. The restaurant Lutter & Wegner which is next door serves faulous fare at reasonable prices and one can visit Newton's for a hip bar. The locality around the hotel is buzzing all the time. The hotel provides residents with a card which gives one 10 per cent discount at Galleries Lafayette. The metro, tram and bus stations are close by as are most of the city attractions.The computer at the lobby gives free internet and also provides printouts free of cost. The wifi rate in the room is also very reasonable at less than Euro 10 per night. A special mention to Tina Hilbert and her excellent team, especially Patrick who has a fabulous service aptitude. My favourite was of course Nikolie the conceirge wit his easy smile and charm. The attitude of every member at this establishment was that of a person who was eager to help with a smile.", "Date": "May 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“Stylish hotel, excellent service, perfect location”", "Author": "ks_moe", "ReviewID": "UR64317045", "Content": "We've just returned from a two night stay at the hotel. The location is great. It is situated by the Gendarmenmarkt, a square described by many as the most beautiful square in Berlin. Tip: Ask for a room facing this square. The hotel is within walking distance of the main attractions (Brandenburger Tor, Reichstag, Checkpoint Charlie, Potsdamer Platz, Holocaust Memorial) The standard double rooms (called \"superior rooms\") are very modern and elegant, but a bit small. The shower section, however, is quite spacious. The bathroom amenities are of high quality (Brand: L'occitane). And the bed is extremely comfortable. We stayed on the third floor, and could hardly hear any street noise. This is because the roads surrounding the hotel are quite quiet, but probably also because the windows are well sound isolated. We ordered in-room breakfast one morning. It was brought to our room 10-15 minutes after ordering. And not to mention, the quality of the food was good and elegantly presented. We also tried the gym, which we can highly recommend. The exercise equipment is of top notch quality, For example, each of the treadmills has an integrated tv with access to 40 channels. The level of service is impeccable. The staff is friendly, attentive and eager to help. We paid 199 Euro per night (flexible rate). Compared to many of its hotel rivals, we consider this rate to be highly competitive. All in all, we highly recommend this hotel, both for business and pleasure.", "Date": "May 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "san diego", "Title": "“Perfect location...Perfect Hotel!!”", "Author": "baharyt", "ReviewID": "UR64248168", "Content": "Thank Goodness for this website! We found this hotel thanks to so many rave reviews. Having stayed at other Sofitel locations, we knew that this one would not disappoint.....and boy were we right! The staff is wonderful, friendly and eager to answer any questions. They made us feel very welcome. It is within walking distance of Museum Island, The Brandenburg Gate and Checkpoint Charlie and there are restaurants and cafes nearby. This was our first time in Berlin and we found it to be fascinating and dynamic. We could not imagine staying in any other hotel. Michael & David", "Date": "May 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“My all-time favourite hotel”", "Author": "dopeyhopey", "ReviewID": "UR58883515", "Content": "I am writing this, as I see that this hotel is not at the top of the listings for Berlin. It is some time since we stayed there, because, being now retired, we have to watch the pennies. But, if money were not a consideration, I would never stay anywhere else in Berlin. It is ideally placed, being near to many of the major attractions to which one can walk, and also a very short walk from the U-Bahn which links in to all the most useful stations. It also overlooks one of the most beautiful squares in Europe. We have stayed there twice, at New Year. We had a suite overlooking Gendarmenmarkt and it was my idea of hotel heaven. The bed was huge; the view gorgeous; we had two toilets and the decor was beautiful (restful and sophisticated). The breakfast is the best we have had anywhere in the world and the service was excellent. It is not cheap, but for what you get it is very well worth it. It is my favourite hotel of anywhere I have been.", "Date": "March 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Derry, Northern Irelnad", "Title": "“Amazing Hideaway”", "Author": "christine12", "ReviewID": "UR46988162", "Content": "First stay in Berlin and we were greeted with very pleasant staff and warm hospitality! As it was my husband's 40th, we were upgraded to a suite with amazing views over Gendarmenmarkt. The room was absolutely amazing, very trendy and modern, full of everything you might ever need in a room. I would give this hotel 10 out of 10 for attention to detail. I would have absolutely no hesitation in recommending this hotel, as a great place to stay. It's location is perfect, as it is within walking distance to Bradenburg Gate, Checkpoint Charlie and other great sites. I would like to thank the staff of Sofitel for a wonderful and memorable stay, and I will definitely be back to stay in this very charming hotel real soon!!", "Date": "October 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Pure perfection”", "Author": "dk18", "ReviewID": "UR45271690", "Content": "I’m writing this review retrospectively for a stay here in October 2008. Firstly I struggle to understand the position on tripadvisor, I’d argue this should be one of the top hotels in Berlin. Aesthetically the building is a contrast of old and new, traditional frontage yet striking inside. Pure minimalist features, glass elevator shafts and trendy décor throughout. The room was beautiful, with a view over the square. Bathroom and toiletries all high end. The TV in the ‘cube’ was, however, ancient and could do with replacing. Most disappointing was the lack of turndown service, this really should happen in a hotel of this calibre. I left this comment with the hotel and received a letter from the manager informing me that this would be taken care of on my next visit. Great communication. I’m an a-club gold member, didn’t receive an upgrade or welcome gift, had to ask for my drinks vouchers, this might have been because the program was relatively new in 2008. But it is awkward asking for those things… Had breakfast each morning in the hotel, it is very pricey but worth it, almost £200 for four days (2 of us). I enjoyed the newspaper, the wonderful food, coffee and juice for hours each morning. Staff polite, well mannered and attentive. I’d love to return, if the management are reading this, thanks for such an amazing stay.", "Date": "September 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "USA", "Title": "“French Design; German functionality”", "Author": "Xamb", "ReviewID": "UR38802799", "Content": "The previous positive reviews are accurate. This is an innovative and comfortable hotel in a terrific location. My 5th floor room was small, but with a spectacular view of the square and twin cathedrals and a terrace/balcony from which to enjoy it. Nearly every featrure, from the movable bathroom wall to the wondeful breakfast pastries, is of high standard. This hotel seems to have been throught through how it wants to present itself and designed its facilities with customers in mind. There were a few original touches that were not my preference. The walls were all textures -- no picutres or decorations of any kind anywhere, which was a little severe and disorienting. The rooms would have benefitted from clocks, water cookers and clear internet guidance. The latter deficiency worked to my advantage. I thought I was signing on to pay for ADSL access, which was very fast and good, but in the end there was no charge, which is a real gift, since so many hotels charge a bundle for such connections which are of no marginal cost to them whatsoever. Walking to nearby tourist destinations is easy. This is not Berlin's cheapest hotel, but it offers a superior breakfast and is not your typical hotel chain clone.", "Date": "August 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Eden Prairie, MN", "Title": "“A great start to six months in Europe”", "Author": "altroldahl", "ReviewID": "UR36096314", "Content": "When I arrived in Berlin just after New Years in 2008, I needed a place to crash for a night before I moved into my apartment in town. I decided I would spoil myself so I booked a room at the Sofitel. It is really a beautiful, elegant place. It felt small for a Sofitel - almost boutique. My room was quite small but adorable. The decor in the bathroom is one of the best I have ever seen (and I have been in some lovely hotels). The location is perfect and the service was very good. The man who showed me to my room tried to show me how to use the thermostat but ended up breaking it - his attempts at fixing it were pretty adorable and I assured him it really didn't matter. It was just one night, after all! What I loved the most - and what makes the place a bit more expensive than you'd think - is the lovely view. I had a little balcony with a splendid 'Blick auf' the Gendarmenmarkt with the Fernsehturm in the background. It's perfect. The overpriced breakfast is spectacular. Just eat it and love it and bite the bullet, though - at least on your first morning! Some downsides: the Gendarmenmarkt isn't a 'hip' area of town - so if you're a night loving party enthusiast I would stay in a different neighborhood. But frankly, the public transport is so fab in Berlin you can be anywhere in 10 to 20 minutes anyway.", "Date": "July 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Texas", "Title": "“Overall- A great Experience”", "Author": "nofear1775", "ReviewID": "UR35544130", "Content": "This hotel has a very friendly staff, nice rooms, and nice amenities. I stayed there 4 daye 3 nights and was very impressed. The one thing I was really impressed with was the friendliness of the staff and their ability to make our stay as comfortable as possible.", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“One of the best city hotels”", "Author": "Fomych", "ReviewID": "UR33380948", "Content": "Absolutely fantastic and charming hotel. Location is superior, very quiet area in the very center of Berlin, facilities, sauna area, in-door restaurant with beef consome served in a glass bottle, electric lolobye near beds, view to the dome of the French church (we were on the top floor in the corner room with magnificent view, i think the best in the whole building), very friendly staff, and Berlinale film festival at same days with Deny Devito and Tom Kruse dinning around our hotel, the area with plenty of top restaurants, made our stay in Berlin really unforgetable, besides of its historical heredity, proximity to Potzdamer Platz, Kudam, Reichstag, check-point Charlie etc.", "Date": "June 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York, NY", "Title": "“Fantastic location and top-notch service”", "Author": "ParisTraveler58", "ReviewID": "UR30729374", "Content": "We stayed here on our trip to Berlin this month and can't imagine staying anywhere else when we return. It's a beautiful convenient location, and the staff is very helpful. For example, our mini-fridge/mini-bar did not work during our entire 4 days there, but the staff was so nice and worked so hard to try to get it fixed, that we were very impressed and ended up not missing it. The beds are very comfortable. The restaurant in the hotel (Aigner) is also very good -", "Date": "May 25, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "germany", "Title": "“TERRIBLE!!”", "Author": "leighannschell", "ReviewID": "UR28752065", "Content": "Unorganized staff - could not even check out without them running after me out the door saying they forgot to charge me an additional 15 euros for parking when I gave them 6 hours notice that I was checking out. TERRIBLE - Do NOT stay here!!", "Date": "April 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "merritt island Florida", "Title": "“Liked this hotel”", "Author": "madiolosa", "ReviewID": "UR24007522", "Content": "Liked this hotel very much. Location is good. Staff is very helpful and friendly. The spa was wonderful and on call even at night. The hotel restaurant was very good, highly recommend. The room was extremely small, and bed very uncomfortable, but room very clean. I loved the bathroom, though small, very nice with large mirrors, cushioned seat for doing makeup/hair, radio in shower, etc. Very traveler friendly. I would definately stay here again.", "Date": "January 29, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great location but that's all”", "Author": "sp_hols", "ReviewID": "UR23217658", "Content": "Let me start by telling you about our loyalty for Accor/Sofitel hotels - we travel a lot on business and private and it is always our first choice. However, it is every Christmas that we return home (Berlin) to see family and friends. This was the first time we did not fancy staying with relatives and with excellent knowledge of the area we decided to book with the Sofitel Gendarmenmarkt (the Christmasmarket at the Gendarmenmarkt is one of the best in the city!). We booked a chocolate special (3 nights) which included a chocolate welcome, two hot chocolates and a chocolate dinner at the Aigner (also a very fine address in Berlin; it has a liaison with the Sofitel). Our room faced the Dom (we upgraded 2x to have the view) but I agree with other comments, I was very disappointed with the layout, size and design. It was extremely dark, the tele was from the 70th (no flat screen but a 1x1m glass box for protection) and took almost half of the already tiny space not taken by the bed. There was one gadget for my husband though, a Bose radio - tiny in size but incredible quality. I enjoyed the bedtime music. This is very Berlinerisch, old fashion Leierkasten music! Now let me tell you some of the more unpleasant experiences: (1) flair: the hotel does not have the typical Sofitel flair, in fact it does not have any flair - what makes it great is its location (the Hilton and the Regent are also 5 star and sooo much better with same location!) (2) noisy: it was the most quiet time of the year, not booked to half capacity, our room was just located next to the elevator and breakfast room, we could hear everything from passersby and the cars on the street (3) service: oh dear, where do I start...let me just say unfriendly, ignorant and arrogant (except front desk) (4) cleaning: disaster, we found the contents of our bin scattered to the four winds (5) daily compliments of the house: this is standard by Sofitel and we wonder what they should have been here... (6) spa: we had the impression that it was there to keep the 5 star rating only - the colour therapy and steam rooms did not function properly and after calling reception a person came to check the same but we are still waiting for a confirmation of whether it is working or not! YES, she ignored us!; the gym was lovely though (7) breakfast: my husband had to remind the waiter and still wait 30 minutes for his omelette - there were only 3 other customers having breakfast with us at the same time (8) apologies: we completed the feedback form and called the manager but as loyalty customers with their highest possible membership we are still waiting today. I am sure there was more but this should provide an inside of our 2007 X-mas experience at the Sofitel Gendarmenmarkt... there is always a black sheep...", "Date": "January 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mayfield, East Sussex", "Title": "“Perfect location for Berlin long weekend”", "Author": "JaspersTravels", "ReviewID": "UR22760308", "Content": "We've just returned from a long weekend in Berlin. The Sofitel was a great choice - fabulous location on Gendarmenmarkt, and within easy walking distance to the Brandenberg Gate, Reichstag, Museum Insel & Alexanderplatz. Two U-bahn stations close by, 5 minutes walk to the Airport bus and a Christmas market right opposite. Our room overlooked an inner courtyard - very quiet. Quality, well appointed room, very comfortable bed & bathroom (although no bath). Breakfast is highly recommended. Staff very polite and helpful. We would definitely go back. Top tips: We booked an official 1 hour tour of the Reichstag & would highly recommend it. Interesting tour & no queues to visit the dome. Also to be recommended is KaDeWe - especially 6th Floor food hall - fabulous!", "Date": "December 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Fab hotel”", "Author": "holly_gl", "ReviewID": "UR20352326", "Content": "Great hotel, really good location close to the upmarket shopping district. Had a lovely room overlooking the cathedral. Every luxury you could ask for - Hermes toiletiries in the bathroom, Bose stereo in the bedroom. Wonderful \"wellness\" area on the top floor, which has a small sauna and steam room and lovely relaxation areas and showers. A great fitness area as well (not that I used it!). Massages can booked also. Good choice at breakfast. Only downsides - room was very small and the staff were very slightly snooty. Small lobby area - no places to \"hang around\" the hotel other than in your room or the \"wellness\" area. But these are only minor issues, overall it is a wonderful hotel.", "Date": "September 24, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Best location”", "Author": "Malino", "ReviewID": "UR16916785", "Content": "Stayed in the Sofitel Gendarmenmarkt for 2 nights with my partner in May 08. Lovely hotel situated in former East Berlin on a very green and beautiful square. Couldn't have wished for a better location. Hotel is very funky and modern but the rooms are rather small. Nicely furnished with some cute little twists like a sliding shutter in the bathroom for more privacy and little string you pull on the side of the bed for a lullaby to be played. Also got some chocolates and fruit on arrival which was a nice touch. Didn't have breakfast in the hotel so can't comment on that but the restaurant did look very nice. Went to Solar for dinner one night which had a great view of Berlin. Also a lot of wonderful bars around the hotel so you have plenty do do. I would definately recommend this hotel and i would happily stay there again.", "Date": "June 14, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "zurich", "Title": "“Modern and stylish Sofitel in a nice location”", "Author": "nico_ch", "ReviewID": "UR16392554", "Content": "The location is just fantastic (and probably the reason for the price tag). The rooms are nice, clean and stylish but small. The bed was very comfortable. The only surprise was to find such a small TV and not even plasma/LCD (not that I watched it). The fruits I got as a preferred guest looked in quite bad shape and they went directly into the trash bin. The bathroom (shower only) and its huge doors isn't very practical. There's a small wellness section on the 7th floor with a sauna (not sure it worked properly that day) and a steam bath (very nice). The hot tub was either broken (or not open yet - a saturday at 10am). The view over the roofs is quite nice and so is the small fitness center. I haven't tested any of the restaurants nor breakfast as we spent most of the time in the city and clubbing, and just used the hotel as a place to crash. What I really didn't understand is why they have only one Internet over WiFi provider (with no alternative) who wants to charge 30EUR for 24h! This is unacceptable these days especially as you couldn't use any roaming partner and they seem to filter protocols like VoIP...", "Date": "May 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "lancashire england uk", "Title": "“Fabulous modern hotel Brilliant location”", "Author": "jtlancsuk", "ReviewID": "UR12697556", "Content": "Stayed for 3 nights 9-12 December 2007 for sightseeing and xmas markets.It was fantastic.Lucky enough to stay in a deluxe suite which had a seperate sitting area fabulous modern bathroom and really contemporary decor.Fab location overlooking the gendarmenmarkt square which had the biggest and best xmas market, lovely stalls ,eating areas and mulled wine!!! The square also has the opera house and 2 churches which is very picturesque.The area around the hotel is very upmarket and is a stonesthrow away from beautiful shops and shopping malls/department stalls.Brandenburg gate a 10 min walk , Checkpoint Charlie 15 mins away.Also the city-tour bus stops on the square.To the right of the hotel at the end of the street is a beautiful chocolate shop which is an experience not to be missed. Would definately stay here again as its pure luxury.Although breakfast isnt cheap its well worth it so try and get a B&B rate if you can.Also no tea/coffee making facilities in room if you like a cuppa when you wake up.", "Date": "January 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Superb location, friendly staff”", "Author": "dublintraveller100", "ReviewID": "UR10456616", "Content": "Culture vultures, gourmets and serial shoppers will delight in the location of this elegant four star hotel, on the edge of the Gendarmenmarkt and in the centre of historic Berlin (but not the best place to stay if your plans focus on the west of the city). Many of the city's world class museums, music and opera venues, art galleries and restaurants are in walking distance, as is the high end shopping of the nearby Friedrichstrasse. Some rooms have a view over the Gendarmenmarkt. We stayed for six nights in a 'junior suite', which was really more a comfortably sized room, well furnished in 'designer' style, apart from a rather ancient TV. The main irritant was an awkwardly designed bathroom and its tiny dysfunctional toilet. The staff are exceptionally friendly and the buffet breakfast must be one of the best in the city (although there are many simpler and less expensive alternatives nearby). There is a well equipped gym and a comfortable 'spa' and the Aigner restuarant is efficient and pleasant. There is no business centre and internet access is expensive and limited. Recommended for a tourist visit, with qualifications on the bathroom. Tip - take your passport with you if you want to rent the excellent audio guides offered in the museums and art galleries.", "Date": "October 30, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brussels", "Title": "“Great location for a weekend break”", "Author": "Bob86", "ReviewID": "UR8606779", "Content": "Wonderful location, and just a couple of minutes for the U-Bahn. Rooms small but stylish. OK for short stays, but lack of space would be a problem for longer stays. Also for the price I would have expected a bath as well as a shower. Reception staff friendly and welcoming (I was personally shown to my room by the receptionist, which is unusual these days) but did not seem partiularly well-informed about what's on etc. Breakfast, at EUR 24 is expensive, but great if you like a slow leisurely breakfast with all the trimmings.", "Date": "September 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Sofitel provides trendy elegance”", "Author": "enofile1", "ReviewID": "UR8266594", "Content": "Our stay at the Dorint Sofitel Am Gendarmenmarkt in Berlin had a schizophrenic nature. Our first three days we were in a standard room, but for the last two days of our stay, we were upgraded to a suite. What a difference a suite makes! Our first room was elegantly designed, but was a bit small and lacked sufficient storage space. However, we enjoyed its style and the location of this Sofitel is simply superb as the other reviewers mentioned. The Newton Bar, one block away, is fantastic! The major problem of our room, which was on the top floor, was the heat. It was oppressive! Although it was late winter in Berlin, and the wind was howling and the rain pouring, we felt as if we were in Equitorial Africa. I guess heat rises. We mentioned our problem to the management, and voila, next thing you know we are in a suite. Sofitels always come through. The suite was simply magnificent, with two bathrooms, great storage, and a hip ambiance. I must applaud the service at this hotel. I would not hesitate staying at this Sofitel again as long as I am not \"posted\" to the highest floor.", "Date": "July 31, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Seoul", "Title": "“Nice hip hotel - a little overpriced?”", "Author": "pmouse3", "ReviewID": "UR8263365", "Content": "This is a very nice, hip hotel - accompanied with great breakfast. Also very quiet, since most of the guests are business people, and they are only visible during weekdays, probably around the breakfast time. The first Monday morning I had breakfast and there were practically NO ONE, even it took me 10 minutes to find a hotel employee in the cafe. (but who cares, it is a buffet and I started enjoy my food and then they came and asked my room number) This is a HIP hotel, more close to a boutique, and considering the price, this seems a little overpriced; I stayed here because this was close to my workplace (near Harckesche Hoffe) and the breakfast was good. But I missed the bathtub very much. They do have a steambath, and a small tub (good for footbath) but still no bathtub. (even though the spa is mixed, it was usually empty around 10pm ~11pm so I enjoyed my footbath quite a lot) My friend stayed in Ritz Carlton at Potsdamer Platz and she paid only about 10 more Euros, her room was twice as big with huge bathtub, with complimentary Bulgari soap ;) provided. (But the breakfast is much better at Dorint, according to the friend)", "Date": "July 30, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Excellent”", "Author": "WheatStacker", "ReviewID": "UR7641649", "Content": "Excellent hotel in a great location. The staff is young but very willing. My room, a junior suite, was decent size. Realize that it's a hip hotel, and there is little shelf space and no chest of drawers. This may not be a good choice for an older customer who wants a more formal setting, but it's a great boutique hotel.", "Date": "May 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sussex England", "Title": "“Superb location”", "Author": "Robin-Towns", "ReviewID": "UR7551707", "Content": "This hotel may provide the best breakfast in Berlin but it is over-priced for what any normal person can (or would want to) eat. You are simply paying (over the top) for a choice you do not need or want. Go instead for the more focused breakfast in your room. Having said that, the hotel is otherwise superb - esp. its location, being close to all main sights & Newton's Bar & the best Italian restaurant outside Italy (Maletesta). Steer clear of Lutter & Wegner if the weather is good & the tables outside are busy - the serivce is appallingly slow though the quality of the food may be worth waiting for,", "Date": "May 6, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "around here somewhere", "Title": "“Great week at the Sofitel”", "Author": "feyenoordtopboy", "ReviewID": "UR7403097", "Content": "I stayed at the Sofitel for a week during ITB and thoroughly enjoyed my stay. I lunched at Aigner, the restaurant on site, and the food was absolutely superb, as was the service, and give the locale, reasonably priced. When I arrived in my room, it was bright, had a small balcony and had a neat design style decoration. The blue spotlight that shines on the bed is`kind of cool, the whole lighting design is pretty neat. Bathroom is nice, all marble and glass and very functional. The breakfast is excellent, and the service is very attentive, and the choices are excellent. There is always drum and bass music playing lightly in in the background in all the public areas. The gym is good, the steam room was fantastic, I did like the selection of different scents you could choose. All in all, great experience.", "Date": "April 20, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Nice, but a bit boring......”", "Author": "bckrSTHLM", "ReviewID": "UR7148288", "Content": "As the Ritz Carlton was fully booked one of the 3 nights in Berlin, we decided to try the Dorint. Well, we actually found ourselves hanging out having a drink and smoking a cigar, at the Cutain Club at the Ritz anyhow :-) The Dorint has a great location, right at the historic Gendarmenmarkt in Old and historic Berlin. Houses may be reconstructed, but the feel is great. Our Favorite spot for meals and great wine (Lutter & Wegner) is just two steps away. The service at the Dorint however is \"invisible\" The staff \"invisible\". Not that we did not get the service we needed, but a true great hotel has alway warm and attentive staff placed here and there.Your lucky if you spot any other staff than in the reception. There is no place to hang out, no real lobby to lounge in, or to enjoy a drink. The public spaces at the hotel are simply so boring, that you will fall asleep after five minutes of \"hanging out\" in the reception-area or walking around.zzzzzzzzzzzzzzzz......... boring. The rooms are rather small though very well designed. The design is modern, clever and boring. The TV-set should however be replaced. It was a great laugh. On a positive note,The place is clean and well run. Staff friendly when you actually meet them. THE SPA AND GYM IS MAGNIFICENT. TRULY GREAT! I must say, the spa and gym is one of the best i have ever visited. Really nice. But beware, its mixed and naked. (Just like all other german spas.) The restaurant next door (Aigner) is great. Breakfast at the hotel is rich to say the least , a buffet that beats everything i have seen in any hotel. The room in wich its served is also very cool, but we ended up having breakfast on town anyway, it was simply too boring as we were just a few guests and the atmosphere too sterile. All in all its a OK place to stay in, if you get yourself a good rate. We did, and slept well, in a great location. Nothing else. Eating, drinking, laughing and hving a great time, we did on town and at Lutter & Wegner.", "Date": "March 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Nantwich, United Kingdom", "Title": "“Superb”", "Author": "pootleperkin", "ReviewID": "UR6541181", "Content": "Room was newly decorated and impecable. Good size, slightly soft bed but otherwise just brilliant. Breakfast was amazing, with as much as you like of almost anything you could imagine. I didn't know so many varieties of bread roll existed! I am sure you could stay somewhere else in berlin that is very nice and much cheaper, but if you want to lavish yourself..........stay here.", "Date": "January 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Perfect Location”", "Author": "scotmad", "ReviewID": "UR6181114", "Content": "This is a hotel with a difference, and all good. The basic rooms tend to be small by Berlin standards, however they have everything you will require and a standard of detail that is rarely found. The location could not be better, both for business and pleasure, with a taxi rank opposite the front door. The restaurant is stylish without being over the top, and prices are fair. The perfect place to relax after a day at the office. Staff are courteous and helpful and happy to spend time explaining how to get about the city. Definitely on my list of places to stay.", "Date": "November 27, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth, Western Australia", "Title": "“Superb”", "Author": "Otsi", "ReviewID": "UR5783947", "Content": "We stayed at the Dorint for 3 nights in August. What a fantastic experience. The hotel is stylish, quiet (even though our room was directly over the entrance) and totally professional. The staff were a delight...so helpful with good dining suggestions and booking help. The room is attractive and well laid out and the bathroom has the best lighting for make-up in any hotel I've ever stayed in. Great closet space. Only question would be the rather shiny surfaced mattress protector used on the bed. Breakfast is expensive....23 Euros, but extremely good and the breakfast staff and really helpful with Berlin tips when you chat to them. The location is fabulous, near the most elegant square in Berlin, and around the corner from one of the best shopping streets in the city. Museums and the Reichstag are all within walking distance. Very highly recommended. Have a meal at Lutter and Wegner, one block away...it's superb.", "Date": "September 9, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Grand Rapids, Minnesota", "Title": "“Hidden gem”", "Author": "LMLWanderer", "ReviewID": "UR5353391", "Content": "Our family stayed here the end of May, 2006. The staff was very friendly and eager to help us in any way. The rooms were a good size, spotless, and they were able to give us the adjoining rooms we requested. The rooms were very modern and the beds were very comfortable. This hotel is on a quiet street but centrally located. It was an easy walk to Check Point Charlies and the Brandenberg Gates and only a block to the U-Bahn. Several nice restaurants in the area. An engergy efficient system requires your room key to be inserted in a slot inside the door for turning on the lights and when you leave and take your key, the lights automatically turn off in a few minutes. We highly recommend this hotel to anyone visiting Berlin.", "Date": "June 16, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Chapel Hill, NC", "Title": "“Absolutely Wonderful”", "Author": "skidleone", "ReviewID": "UR5292095", "Content": "No question, this is a major hotel find in Berlin. Pay for a Deluxe room that includes the best breakfast buffet we saw in our three weeks in Europe, and you are tempted to spend your entire vacation in Berlin. We stayed five nights and walked to all the important sites. Many fine dinner options all within an easy walk from the hotel. Also concerts, opera, and ballet are close by. Fabulous staff, management, atmosphere, and accomodations...very hard to beat!", "Date": "June 2, 2006"}], "HotelInfo": {"Name": "Sofitel Berlin Gendarmenmarkt", "HotelURL": "/ShowUserReviews-g187323-d200257-Reviews-Sofitel_Berlin_Gendarmenmarkt-Berlin.html", "Price": "$144 - $394*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Charlottenstrasse 50-52</span>, <span class=\"locality\"><span property=\"v:postal-code\">10117</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "200257", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/ae/c4/aec4902de287d390e9ab454779e6236511large.jpg"}}