{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Randers, Denmark", "Title": "“IBIS is good”", "Author": "blomranders Posted by an Accorhotels.com traveler", "ReviewID": "UR127728915", "Content": "very good restaurant near the hotel, park outside the hotel . the garage is not so good service from the reception can be better", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Budapest", "Title": "“Good for short stay”", "Author": "Satc0", "ReviewID": "UR126406334", "Content": "We spent one night here. The hotel is not so far from Tegel airport but bear in mind that you have to change at least twice to get there by public transportation. The room was perfect for such a short stay, the staff was very kind and helpful.", "Date": "March 20, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Poznan, Poland", "Title": "“Good price/quality ratio!”", "Author": "Jerzy N", "ReviewID": "UR124381162", "Content": "Ibis Tegel is outside the city center, but not far away from the subway station. The rooms are clean and very decent (typical Ibis standard). Double bed, TV, moderately spacious rooms and decent bathroom. I am only a bit dissapointed that I didn’t get any help from the staff when I got sick (no first aid set, no pills). However, I am not sure whether it is not againt a law to provide guests with medications.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "USA", "Title": "“Great place to stay if you're heading for the airport in the AM”", "Author": "BlueHenFlyer", "ReviewID": "UR121704493", "Content": "Nice standard Ibis hotel with a wonderful staff. Great location proximal to both the S- and U-bahn. Nice family neighborhood in Altreinecker.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Warsaw, Poland", "Title": "“good value for your money”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR121242223", "Content": "Stayed there one night during weekend. Although hotel is located far away from Berlin center it has a good connection via undergroud Residenzstrasse station located few steps from the hotel. It is located not far from Tegel airport but I did not nottice any noise caused by airplanes. Breakfast is 10Euro but offers a wide selection of food. Hotel parking is 7 euro but I did not use it as it was relatively easy to find parking lot at the street. Hotel staff is friendly, helped me to find the hotel when I was driving and my navigation failed. It is not a brand new hotel as other Ibis hotels i visited in recent years, you can nttice some signs of wear but all areas are cleaned. Hotel room was for double occupancy but I used it as single room and paid some 59 euros incl. breakfast. Iwould recommend this hotel for single travellers with limited laguagge since room space is not very large.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tenterden, United Kingdom", "Title": "“Ibis. You know what you're going to get”", "Author": "Skaro1 Posted by an Accorhotels.com traveler", "ReviewID": "UR120980657", "Content": "Standard Ibis fare. Cheapish and cheerful. Handy just for crashing in. Small issue when we arrived late evening there was no opportunity to buy snacks. We'd missed out on dinner due to travelling and couldn't even get a bag of peanuts. Despite signs saying food available 24/7.", "Date": "November 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Bedford, United Kingdom", "Title": "“Perfect value for money”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR119554998", "Content": "I did not use the car park as there was space on the street. The check-in was quick and the room was just right for a one night stay. No noise even though the airport is relatively near. Passed on the breakfast because I only eat a light one and 10EUR would be high for a bowl of cereal. Overall a very pleasant stay.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Orange, California", "Title": "“Average Hotel”", "Author": "PalawanStreet", "ReviewID": "UR118811716", "Content": "Been all over europe 5X, east and west. Although far from the city center, Ibis Tegel Airport is clean, quality accomodation and a short walk to UBahn and Bus stop, If you are headed for City center, Take U8 and U9. If you are headed for the airport, the bus 122 takes you to KShumacher platz and transfer to Bus 128 for Tegel airport, a short trip. A slim lady who checked in and checked us out was not a nice hotel worker, unfriendly in other words. She should be transferred to a back office out of face to face customer service IMO.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Satisfaction guaranteed”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR118206589", "Content": "It was our first trip to Germany, where we chose this hotel by recommendation. Excellent ambient, market facility nearby, U-Bahn station Residencestrasse very close. Our recommendation goes to all those searching for budget hotel at Berlin.", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Stuttgart, Germany", "Title": "“Great Hotel, In a Great Location, at a Great Price”", "Author": "EuropeTourist12", "ReviewID": "UR116605107", "Content": "I highly recommend this one, because it is very clean, good quality and provides easy access to the U-Bahn (metro). I used it for an overnight stopover at Tegel airport for a \"Insider Walking Tour\" of Berlin the next day.", "Date": "August 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Espoo, Finland", "Title": "“Decent hotel”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR115604283", "Content": "Nice and clean hotel. Friendly staff. Good breakfast. Location at the beginning of street with park was also good; It was nice to go walk there in the evenings. Hotel location was good enough. U-bahn is only 500 meters away. You get straight to Alexanderplatz! Also short trip to Tegel with train + bus.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "5", "Service": "2"}, "AuthorLocation": "Oklahoma, USA", "Title": "“Acceptable deal”", "Author": "DarekJarmola", "ReviewID": "UR115589227", "Content": "We stayed here for 1 night - and for 2 reasons: price and location. We were able to book a twin room for 49 Euro - asked for two single beds but got one queen size bed at checking. Location is excellent - near the Tegel airport and in the midst of a typical old-charm Berlin neighborhood. Rooms were clean, bathrooms were spotless. Reception staff was professional but not helpful when asking for advice on dinner or sightseeing options. That is the major reason for not grading it above \"average.\" The other issues to consider is the extra cost of breakfast at 10 Euro a person and parking fee of 7 Euro per day. Will stay again - room price alone makes it a good deal. Best for business stay.", "Date": "July 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Mumbai", "Title": "“Quite inexpensive”", "Author": "a-nike1234 Posted by an Accorhotels.com traveler", "ReviewID": "UR115190545", "Content": "The hotel has all the basic facilities (but no restaurant, only bar). It makes a fine buy if you like to tour around Berlin all day and return to hotel only for Bed & Breakfast. It is, however, many stations away from Berlin Tegel airport and you have to change once to reach here. Also not near from Berlin Hauptbahnhof (have to change from Alexander Platz) Overall IBIS standard is maintained.", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "2.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Washington State", "Title": "“Nasty Clerk Could Not find Reservation”", "Author": "Dtlusty", "ReviewID": "UR113169179", "Content": "My wife and I spent 10 days over a 1-month period in this hotel. When we arrived, the desk clerk could not find our reservation. I presented a copy of it to her, but she refused to look at it. I provided our names and passports for identification, but she still refused to look at them and simply claimed she had no record of a reservation. Finally, after insisting that she check again, she found it and stated that the name was listed wrongly (reversed) even though our written copy of the reservation stated it correctly. She was generally rude, unapologetic and indifferent to us. The room itself was spare but acceptable, given the low rate we paid. In the end, the same rude clerk ended up giving our hotel points to two different accounts, again ignoring my club card ID number. Disappointing and not recommended unless you are desperate.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Super value with price”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR107950110", "Content": "we booked from ibis website 1 month before we travel, so the price is 39 euro per night. The Room is clean and new, in quiet area with many restaurants. There is also a Penny supermarket with walking distance. Parking 7 Euro/day, breakfast 10 Euro is too much! In front of hotel there are some parking places if you are lucky!", "Date": "May 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "bursa", "Title": "“visit”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR100948454", "Content": "we checked in ath night about 23:00 the receptionist was trying to help but so slow. it took 20min to check in. While checking out in the morning the receptionist lady was looking very unhappy and talked with me as i was quilty os something. This is not kind of a behaviour i would like to see in the morning when i am staying at a hotel.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Perth, Western Australia", "Title": "“convienient for a couple of days”", "Author": "thegorbs Posted by an Accorhotels.com traveler", "ReviewID": "UR95505798", "Content": "this hotel is close to tegel airport, about a 10min cab journey. staff were pleasant, and everything was what you would expect from ibis. the subway station is about 5 min walk, and there are a couple of food shops about, and a good restaurant right next door! free net in the lobby.", "Date": "February 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Houston", "Title": "“very good hotel near Berlin Tegel”", "Author": "WibiRoamin", "ReviewID": "UR63050648", "Content": "Clean, seemingly newly remodeled Ibis tucked away in a quiet residential neighborhood (Reineckendorf) near Tegel airport; pleasant 10 minute walk from Paracelsus Bad U8 station. Eateries adjacent. Staff cordial and helpful, arranged taxi to airport efficiently at 5 am. Like other Ibises we've stayed in, street noise precludes sleeping with the windows open, so the room was a bit warm at night.", "Date": "May 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Chicago", "Title": "“Great value!”", "Author": "KarlMang", "ReviewID": "UR49569051", "Content": "Stayed seven nights in an Ikea-like room. I was impressed how clean everything was. There was no noise from Tegel Airport nor from the street in front which had a low speed limit posted. Free internet access in the lobby was helpful; the breakfast buffet had quality.", "Date": "November 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Camp Hill, PA", "Title": "“Cheap and reasonable lodging in Berlin.”", "Author": "JCS276", "ReviewID": "UR23964488", "Content": "Booked through a German hotel reservations company, hrs.de and was highly impressed with it, will use them again. Got into Berlin Tegel early from Amsterdam after KLM flight from JFK. I had the day before called ahead to set up our rooms (2 twin rooms) for early arrival with the manager. After our adventurous cab ride from the airport, we got to the hotel @ 11AM, and sure enough, the girl at the front desk had the rooms ready and waiting, check in was a breeze. I was there with 3 of my buddies, we dropped off our bags, and headed out to see the sights, it was our one and only day in Berlin, unfortunately. The hotel was very clean, I don't think it had free internet, but to us that was no big deal. Rooms were about average size, bed wasn't the biggest for a twin, but I've slept on worse. Bathroom and shower was decent. The hotel was a 5 minute walk from a U-bahn stop, I forget which one, but it's very convenient. From there you can get to all over Berlin and the myriad of sights to see, we saw as much as we could in 1 day, I think. After we were done sightseeing, there was a little bar/restaurant right outside of the main entrance where we had our dinner, the waiter spoke excellent English (despite his claims only speaking \"a little\" - why do all Germans say that when they usually are very proficient?!) and was hilarious...and on top of that, the food and beer was delicious. All around a great, fun dinner experience for our rapidly tiring selves. After that went back to our rooms, turned on the TV and watched some German programs before zonking out. The room and area was very quiet, esp for a Friday night, no rowdy drunks or parties or anything. Woke up in the middle of the night, but that was due to time zone screwup, not the bed, which was quite comfortable. There was no free breakfast the next morning, but there was one of the delicious, ubiquitous pastry shops around the corner, and we stocked up before catching our train to Frankfurt. I definitely recommend the Ibis Tegel, great service, comfy rooms, and excellent location.", "Date": "January 28, 2009"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Loved the Tegel Airport Ibis”", "Author": "Frugal65", "ReviewID": "UR18209359", "Content": "We stayed one night in May and one night in July 2008 at the start and end of our German holiday. We were very happy with the hotel each time and would certainly stay there again. From Tegel airport we took the #128 bus to Residenzstrasse and walked about 8 minutes to the hotel. (2.10 euros per person, pay the driver, he can give change). Going back to the airport for an early flight we took a taxi (18 euros inc tip). We found the front desk friendly and helpful and the rooms were basic but very clean, quiet and comfortable which was all we needed. I booked the room on the Ibis website and got a very good internet rate. The excellent buffet breakfast is extra. The free internet in the lobby is a nice bonus. There are a couple of bistro/restaurants nearby for suppers.", "Date": "July 24, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Value fallback solution”", "Author": "freekicker", "ReviewID": "UR7831537", "Content": "Berlin normally offers plenty of accomodation at reasonable rates. But sometimes the German capital can be very busy, like during the G8 summit meeting. Then I like to return to one of the first ibis locations, which I know for more than 20 years. The location is between TXL and the new Central Railway station (taxi 10 € from TXL). I know about their good service, I get an attractive rate, I am checked in 15 min after leaving Tegel airport. Location, price and service that's what counts for me. You'll find the usual ibis furniture, rather small rooms, but a good buffert breakfast. And a few restaurants around for dinner or just a beer or Berliner Weiße. In the off season I choose more attractive offers of the big chains (e.g. the new Novotel Tiergarten), but (secret !) I always get a room in Reinickendorf, even at convention times.", "Date": "June 11, 2007"}], "HotelInfo": {"Name": "Ibis Berlin Airport Tegel", "HotelURL": "/ShowUserReviews-g187323-d200360-Reviews-Ibis_Berlin_Airport_Tegel-Berlin.html", "Price": "$64 - $109*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Alt Reinickendorf 4-5</span>, <span class=\"locality\"><span property=\"v:postal-code\">13407</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "200360", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/4e/a8/4ea81481c0ab056466902a74d62b559e6large.jpg"}}