{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Harlow, United Kingdom", "Title": "“A very good small four star hotel”", "Author": "dkrinas", "ReviewID": "UR122558960", "Content": "We spend our Christmas holidays in this hotel and we had a very good time. The stuff was very friendly and always available to help you .The restaurant was very good and the food was always tasty . There was a large variety of drinks at the bar and the prices were wonderful . The breakfast buffet was rich and colorful. The swimming pool and other spa facilities were very good and clean and you could even have a drink there . The only thing we didn't like was that at the swimming pool and other spa facilities there was non-nudity policy so you had ladies and gentleman mixed using the facilities or walking about stark naked. Which maybe for the Germans this is ok however for an international hotel the management should think that other may find this offensive and especially parents with children.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Portlaoise, Ireland", "Title": "“dingy and smelly”", "Author": "MaryP48", "ReviewID": "UR85940631", "Content": "booked for a romantic break, miles from anywhere, dreadful smell of stale cooking all over the hotel, small dingy rooms plastic twin beds sliding all over the place and that was in a superior room,,,, would hate to see what a normal room looked like... staff at reception rude. stayed just over an hour and couldnt get out of it quick enought.. a total dive avoid at all costs.", "Date": "November 4, 2010"}], "HotelInfo": {"Name": "Rheinsberg Am See Hotel", "HotelURL": "/ShowUserReviews-g187323-d200428-Reviews-Rheinsberg_Am_See_Hotel-Berlin.html", "Price": "$66 - $131*", "Address": "<div class=\"amenFloat\">", "HotelID": "200428", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/0f/d9/0fd9b992fd09443d346e5b88b542397e9large.jpg"}}