{"Reviews": [{"Content": "Friendly/Safe This is a very nice hotel for mid-budget travellers. If you are looking for a deacent hotel next to the Messe which charges around 50 EUR, this should be your pick. Also, there is an underground station right next to the hotel which you can use to go anywhere in the city.The hotel is close to the main train station (about 10 min walking) but it is in a safe and nice neighbourhood. I was cautious about booikng a hotel close to the main train station because I went to Frankfurt alone (single female) but Astoria ended up being a great pick.The hotel staff was very helpful, nice and friendly. There is wireless internet (free of charge) in the rooms but also you can use a computer and the printer that the hotel has set up for the guests in a speperate (conference) room.Breakfast was ok. Not much variety, but all basc food groups were presented and verything was fresh. Rooms are good size for European standard.I would definetely stay there again.", "Date": "Oct 25, 2007", "ReviewID": "UR257838525", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "APal"}, {"Content": "A well located hotel The Hotel Astoria is about 10 minutes walk from the main train station (and thus train to the airport), or a euro 4.50 taxi fare. It is 100 metres from the Messe (Festival Hall) metro stop. It is in a quiet residential street away from the dirt and grime of the Hauptbahnhof and we found it most useful as it was easily accessible for us to drop the rental car off at the station, coming as we were from the Romantic Road. The breakfast is a cut above the usual continental breakfast offering cereal, fruit salad, ham, variety of cheeses, boiled eggs, toast etc. or you can order fried bacon and eggs. The staff were very friendly offering excellent advice on where to go for traditional meals away from the rest of the pack. The beds were firm and clean, room size and showers average, but good value. I would DEFINITELY stay here again. They also offer promotional deals which are quite attractive. (Dated 9th June 2004)", "Date": "Jun 21, 2004", "ReviewID": "UR117547151", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Hotel Astoria Hotel Astoria is a short ten-minute walk from the main train station; or, if you're loaded with luggage, a two-stop streecar ride or U-Bahn ride. Small hotel next to the Mainhatten Gym which you have free acess to as a guest of Hotel Astoria. The street is residential, quiet. The economy room I had was small with a large single/double bed, tv, closet, bathroom with small shower. Continental breakfast (included in the price of the room) has great variety---cereal, fruit salad, schinken, variety of cheeses, boiled eggs etc. or you can order fried eggs. Staff very friendly and very accommodating. Free use of computer for internet. Would stay there again in a heartbeat. For families? I don't think so.", "Date": "Aug 7, 2003", "ReviewID": "UR809750871", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "nice but not central I've stayed in Astoria during the International PHP Conference 2002 in November. I must say that the hotel is quite nice, well arranged and has almost everything one needs. Even the internet was wireless there. One only thing is that it is deadly dar from the central Frankfurt, so you will need whether a cab or to go to the airport by the free shuttle (which leaves every 30 minutes from the hotel) to then get the airport-center train (another 30 minutes).-maxim", "Date": "Apr 28, 2003", "ReviewID": "UR564096553", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187337-d200951-r10310199-Astoria_Hotel-Frankfurt_Hesse.html", "HotelID": "200951", "Price": "$141"}}