{"Reviews": [{"Content": "Travelling Salesmen Stayed here briefly for a conference. The hotel is reasonably close to the center and has a subway station nearby.The staff was really nice on checkin, but I have mixed feeling about the rooms: My colleague got a really nice, freshly renovated room while mine seemed to date back to the 70s and could have used some new decoration.The breakfast facilities were nice; also there the staff was exceptionally friendly. Wireless internet is only available at an per-hour rate.The building was very motel-like, and doesn't look like much: Big parking lot in front, and rooms that can be reached from an outside gallery (though our rooms were inside a building). It seemed like a place that is used mostly by travelling salesmen and such. All in all the hotel was o.k., but I kind of expected more for the money. (Had I got my colleague's room, I'd probably have been more satisfied).", "Date": "May 23, 2008", "ReviewID": "UR762174228", "Ratings": {"Service": "4", "Business service": "2", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "2", "Rooms": "2", "Location": "3"}, "Author": "averell23"}, {"Content": "Great Alternative to Downtown Frankfurt Although nothing special to look at from the street and located in a pleasant residential neighborhood a couple of miles north of the city center (which is not so wonderful in Mainhattan anyway), this motel is a real little gem for the traveler. For starters, it really is a motel, of the motor court type with a driveway in from the street and a central interior parking lot convenient to the rooms. So if you are driving it is a really good choice. If you are relying on public transportation, no fear--the Dornbusch streetcar station is only sixty seconds away, with constantly arriving and departing cars, and you can be downtown at the Hauptbahnhof in about 15 minutes (change lines at Hauptwache). My room was simple but perfectly fine, not large (to an American's eyes, anyway) but containing a single bed, couch, writing-table, mini-fridge, small TV, telephone, and two chairs; the closet area in the hallway from door to bed area was sizable, and the bathroom was a gleaming, modern, white-tiled monument to German sanitation. The only problem, if you could call it that, was that the shower water (no bath) was SO high pressure that the hose bucked away from me the first time I used it, and the hot water is so hot it could scald you. Also, instead of a curtain (which I never like to see in a hotel!!) or a full door there was only one of those curious plexiglass half-walls the Europeans sometimes use, so unless you were a bit careful you could get water all over the bathroom floor. After my first experience it was easy to dial things down for comfort and keep the floor dry. There was a hair dryer and a magnifying mirror, attached on opposite sides of the basic over-the-sink mirror. My particular room in the one-story wing at the front (#21) had a large window that looked out on a grassy lawn about 15 yards wide, with a tree-shaded gravel pathway on the other side, used by all the local folk as they came and went from work and shopping. It was utterly peaceful and quiet--you would never know a busy traffic artery was right outside the hotel on the other side. There were stores in the neighborhood, a few steps away--bakery, deli, drugstore, cafes, a Pizza Hut next door. The staff was utterly friendly and helpful (it's the kind of low-key place where the visible staff are young women in slacks or jeans who seem to be enjoying themselves in a sisterly way at the office), and the ones I dealt with spoke adequate English, although I mostly spoke German with them. The included breakfast was in a beautiful separate dining room and very nice. Since I was there during the World Cup, the management had erected a tent, tables, chairs and benches and a big screen TV in a corner of the parking lot, along with a refrigerator stocked with drinks and a grill operated by the white-whiskered maintenance guy, so you could buy some beer or wine and a brat and watch the game in the sort of communal beer-garden atmosphere that Germans adore, or just watch the game. All in all I was very happy with this place and sorry to leave (although happy in general to get out of Frankfurt again, not one of my favorite spots in Germany). I'm sure you would like it too, if you are looking for a pleasant, mid-range place to wash up and sleep, with excellent value for the money.", "Date": "Jul 6, 2006", "ReviewID": "UR709284574", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great value We were looking for a hotel at a good price that was located centrally and we were pleasantly surprised. Good price, great breakfast (I don't know if it's common in Germany to get champagne for breakfast, but it was thoroughly enjoyed) and I slept so well. I wish I had such a nice bed at home. The motel meant that we could park our rental car right in front of our room. When we stay at affordable hotels, we tend to expect staff that does everything possible to avoid dealing with us, but they were super friendly here and helped us find our way around Frankfurt.", "Date": "Jun 17, 2005", "ReviewID": "UR348431064", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "War recht ordentlich   showReview(13983949, 'full');", "Date": "Feb 19, 2008", "ReviewID": "UR418962256", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Sehr guter Konfort und sehr ruhig   showReview(11416987, 'full');", "Date": "Apr 25, 2007", "ReviewID": "UR525786898", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187337-d202280-r16327871-Advena_Motel_Frankfurt-Frankfurt_Hesse.html", "HotelID": "202280", "Price": "$153"}}