{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leamington Spa", "Title": "“Definite stay when in Berlin”", "Author": "LeamBull", "ReviewID": "UR128235294", "Content": "Recently returned after 4 nights at this hotel for my wedding anniversary. I simply cannot fault it. A great location - walking distance of the K'Damm and KadeWe and overlooking the Tiergarten (our 7th floor room looked out over the zoo). Impeccable service, very nicely furnished, quiet, clean, everything functioned. Breakfast buffet was busy but plentiful and very good. I would have no hesitation in returning. It is a bit of a walk to the nearest U'Bahn stations but only about 10 minutes so not a big deal - buy why bother when the 200 bus stops almost outside and goes straight to Unter Den Linden and Alexanderplatz? It runs every 10 minutes or so and takes about 15 minutes to Mitte. But a Berlin Welcome travel pass and you can go by bus or U or S-Bahn as often as you wish.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Perfect”", "Author": "Avenelll", "ReviewID": "UR128231876", "Content": "I don't think you could beat this hotel. The place is immaculate top to bottom. The staff attentive and friendly. The breakfast is outstanding with a multitude of choice. The room was clean and very comfortable with a fantastic view across the zoo opposite. Luxury bathroom and toiletries provided with little touches like a mini nail file and sewing kit in your room. Free internet access is provided in a quiet room on the 2nd floor. Once you get your bearings you'll find the hotel is reasonably central. The staff are very helpful and you can buy travel tickets in reception. There is a huge shopping centre 5 minutes away if that is your thing, plus in the opposite direction and nearby are cafes, chemists, supermarket and a market selling the wonderful breads available in Germany. Berlin is a great city with such friendly locals; even those who don't speak English help with a smile. Wonderful place and what better than to experience it at this hotel? I simply cannot fault this hotel.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tel-Aviv", "Title": "“Still great hotel!”", "Author": "udigold1", "ReviewID": "UR127678981", "Content": "A year passed by, and me and my wife have returned to Berlin (after a trip to the Black forest), and to the Pullman hotel. The hotel was very busy as it was Easter weekend, but nonetheless it has remained a great hotel, with comfortable room and a bed (I want it in my bedroom!), staff was very lovely and helpful, breakfast was yummy and all in all this hotel rocks! Keep up with the good job! We will return!", "Date": "April 11, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great location, great service”", "Author": "Emma V", "ReviewID": "UR127661666", "Content": "The hotels appearance when you walk through the doors is impressive in the foyer area. Staff cant do enough to help you and are happy to offer friendly advice on things such as where to eat in the city, what sights to visit etc. Our room was magnificent with a huge bed and loads of space. The breakfast in the morning was excellent and one night we had a meal in the hotel restaurant which was 1st class. The cleanliness and overall appearance and decor is lovely and the spa facilities also very clean and comfortable.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sheffield, UK", "Title": "“An impressive stay for a wheelchair users”", "Author": "Sarah_Lynch", "ReviewID": "UR127624920", "Content": "We stayed in the Schweizerhof for three nights with our nephew, a twelve year old who uses a wheelchair. It was a great base for our stay, made all the better but the excellent staff whose support could not have been better. We had a stylish accessible room with an extra bed put in. With all three beds it was fine for us although someone in a powered chair might have found it cosier. The accessible bathroom was excellent with great facilities and plenty of manoeuvring room. My nephew also said the put up bed was way better than normal with a proper and very comfortable mattress. Staff were really helpful, all speaking excellent English, and the concierges were very helpful phoning restaurants for us, some we had chosen and one they recommended, and checking out access for us. Overall we would definitely recommend this to anyone with a mobility problem and indeed to anyone else.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Zeist, The Netherlands", "Title": "“average”", "Author": "daisy w", "ReviewID": "UR127513213", "Content": "An average hotel for a good price. Booking the hotel though to have found a bargain, but the Pullman is not up to the usual 5 star standards. I regularly stay in hotels for work which are usually 4-5 star. I feel Pullman is between a 3 and 4 star. Nothing fancy just a normal chain hotel. So only 2 dots for the fact that it is rated a 5 star though it is absolutely not.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester,UK", "Title": "“Very good hotel and location with a few niggles”", "Author": "ErikaManchesterUK", "ReviewID": "UR127482367", "Content": "I got an excellent rate for our four night stay at this hotel. The location is excellent, just a few minutes walk from the station at the Zoo and the train from the airport takes you straight into this station where there is also an S Bahn train and an underground station. The 200 bus stop is just a few yards from the hotel and I recommend this rather than the tourist bus for sightseeing as it goes past all the main sights (as does the 100 on the opposite side of the city which stops at the other end of the road). We arrived at midday and early check in was no problem. The room was clean and very comfortable - though we didn't have a room facing the zoo but this wasn't a problem for us. The breakfast is excellent with the full range of hot and cold food and coffee service at your table. The reception staff and concierge were very helpful and couldn't be faulted. We didn't use the spa or pool so can't comment. My only niggles were that the room was very warm at night and the air conditioning didn't seem to help - and was actually a bit noisy. The other problem was that there is no free internet. When we asked we were told that it was 9 euro per day. We actually followed previous advice on this page and went to Cafe Minouche across the road and for the price of a couple of coffees were able to take advantage of their free internet service. Would I stay here again? Most definitely. For value and location it was excellent.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“High on ecfficiancy and comfort, low on ambiance”", "Author": "Anne22594", "ReviewID": "UR127109360", "Content": "I advise only rooms facing the zoo (for tourists), take the \"free\" internet ( you pay for it, only in advance, which gives you a relaxed stay), only high floors. this is done via their \"bussiness plan, or call hotel to ask. Excelant service, nice design, very comfortable.Great breakfast. On the weaker points: nothing special as far as atmosphere Location: very convenient but not anything special. It was less touristy than other parts and close to a lot of good shops if you are interested in shopping. Go to Savigny Plaz for resturants (rent a bike!!!), try the nice cafe across the street- Cafe Minouch for a quick coffe.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Excellent location, comfortable rooms”", "Author": "YossiAzoulay", "ReviewID": "UR126918638", "Content": "We stayed for three nights this week, the first time in this hotel in Berlin. Rooms very comfortable, functional, clean, modern architecture. Very comfortable beds. Breakfast is very rich, dining room staff services with a lot of attention to detail. Strict management of the dining room brings the desired result is always the buffet seems like now he was held for the guests and nothing is missing. The hotel has a spa with heated indoor pool, sauna and fitness room, we enjoyed very much being in the spa, cleanliness, arrangement and calm atmosphere in place. The Hotel is locatde near the Zoo, 10 minutes walk to the main shopping area and to the mail bus station. bus line 200 in front of the hotel can take you to the main atractions in Berlin.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Oslo", "Title": "“Modern hotel, nice rooms”", "Author": "tunafishOslo", "ReviewID": "UR126915339", "Content": "Rooms are well sized and quiet, and comfortable beds. Nice pool, nice bar. The hotel is located in a quiet street/area, maybe a little bit boring. About 5-7 minutes to the U-bahn, close to shopping area.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "england", "Title": "“Pullman Berlin Schweizerhof”", "Author": "lawrenceEngland", "ReviewID": "UR126854284", "Content": "Stayed here at the beginning of February, weather was absolutely freezing. Hotel was fantastic; had a room with views over the Zoo. ,Rooms were nicely furnished and warm, provided tea/coffee making facilities and gorgeous toiletries. Breakfast was the best I have ever eaten; brilliant choice; the scrambled eggs and dried strawberries were gorgeous. Pool was a little cold but ok once in . Staff were very friendly and helpful, an issue with the room safe was dealt with promptly. Got a brilliant room rate through Thomas Cook. Berlin is a great place, did most of the main tourist attractions. At night went to friendly local bar on Savignyplatz called Zwie & Elfisch and also ate at Andra Luica ; gorgeous food and they gave us a couple of free drinks as we were there for my Partner.s Birthday. I hope to return to Berlin in the summer months and would defiantly stay at this hotel again.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "copenhagen", "Title": "“best hotel for 3”", "Author": "mina k", "ReviewID": "UR126639012", "Content": "stayed here for a girl's trip to berlin and we loved it so much. the room was huge and the bathroom was simply luxurious with plenty of room to do ballet if you wanted and a bath with jets and lavendar salts. the concierge(s) were lovely, especially ringo. they helped us find everything we wanted in the city. even the minibar was free and restocked each night! we had an absolutely grand time.. the only thing i could possibly complain about is the broken wifi. unfortunately it was the weekend and they couldn't call anyone to fix it. but there are plenty of others places in berlin you can get your wifi on.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "2"}, "AuthorLocation": "amsterdam, the netherlands", "Title": "“not that great”", "Author": "Carl2009", "ReviewID": "UR126442061", "Content": "it's cheap, but then again so is any other 5 star hotel in that area. Feel it lacks too much to be a 5 star. Small (but comfortable) beds, big room, very small shower. Nothing special, any 3 star big chain is equally good. We had to stay in the south building, which is about 5 minutes from the main building. I hope it it just the rooms over there that are not that great, otherwise I do not understand all the raving reviews.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "4", "Location": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Disappointed”", "Author": "Tourist11111", "ReviewID": "UR126255750", "Content": "This is no way near a 5 star, rooms are way too basic. Bed too small, even à double bed is actually a bed for 1,5. Shower is very small and hot water is not consistent. No free wifi, no where in the building, not even lobby!! We had much hope going here looking at the reviews, but we will not come back for sure. If this is the standard for a 5 star accor it is very disappointing.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Göteborg", "Title": "“Fancy, but no charm”", "Author": "12shoes", "ReviewID": "UR126129538", "Content": "A very fancy hotel with a very impressive breakfast and wonderful rooms. The location is good for shopping and the park next door is a good place to go jogging. The downsides are that they charge for wifi (which annoys me) and the total experience is correct but vaguely soulless. So I would recommend this hotel for couples: the big rooms, the spa and the general ambiance is great for a weekend away. But in reality I would prefer a more charming place.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "France", "Title": "“Great hotel, shame about the internet”", "Author": "RNPARIS", "ReviewID": "UR125920423", "Content": "This is what a modern business hotel should be. Great location, bright decoration, efficient rooms, friendly staff... A top hotel in every respect except for the miserable internet system which just let the property down. Not only does the internet cost €9 per day, but it cuts you off regularly and each time you have to retype 7+5 figure connection codes. Just to rub it in, the hotel system is called 3Connect, yet the first network my Mac picked up every time I opened it was Tmobile, so a change of network was required. I don't even mind paying a modest sum for a good connection, but the need to endlessly re-log onto the system was too much. There you are, a very good hotel with a stay somewhat spoiled by one niggle.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tilburg, The Netherlands", "Title": "“Would give it 'excellent' had they provided free internet..”", "Author": "hloyea", "ReviewID": "UR125437149", "Content": "The hotel is great - without any doubts, but the fact that you still have to pay for internet (while the average room is ~170 euro) is a big disappointment. Really don't get why expensive hotels still charge you for this basic need.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "london, UK", "Title": "“Fab hotel, very friendly staff. and...Gluten free food”", "Author": "weirdo666", "ReviewID": "UR125328710", "Content": "This is the 2nd time i stayed at this hotel, this time for fun with my wife. rooms are spacious, nice and new bathrooms. nice swimming pool and a new gym, with 2 bikes, 2 treadmills and 2 cross trainers, some free weights and stuff. what stood out for us this time: - my wife has a gluten allegery, and cant eat bread and stuff - when we told the breakfast staff they immidiately arranged special bread, and the following days had arranged a range of choices very service orientated, which makes me wanna come back here again next year", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Spoil yourself in this excellent hotel”", "Author": "lozzywozzy", "ReviewID": "UR125297554", "Content": "We loved this hotel! I booked breakfast when I booked the room and this turned out to be a great decision. The breakfast buffet included everything you could ever ask for, and a chef to cook eggs, waffles , porridge etc. The room was spotlessly clean, beds comfy and plenty of room. The staff were really helpful and nothing was too much trouble, from storing our bags after checking out, to finding an English/German plug adaptor. It was very near to the big shops and even nearer the zoo and aquarium. The restaurant was excellent but expensive, but the concierge was able to suggest several alternative venues in the local area.The swimming pool was clean and warm, the fitness studio is open 24 hours, and we were able to use the fluffy bathrobes and slippers provided to go down and have a swim when ever we felt like. All in all a perfect experience, we will return!", "Date": "February 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Fabulous hotel with a great breakfast”", "Author": "JaneandTim", "ReviewID": "UR125247505", "Content": "We really enjoyed our stay at this upmarket hotel in Berlin. It is right opposite the Zoo (our room on the eighth floor had fabulous views). We opted for the superior room which was well worth it for the extra space and the mini bar was complimentary (although sadly we only found this out on check out!). The breakfast was amazing, an incredible choice and excellent service. We also had a lovely drink in the bar one evening. And the pool and spa was really great - very relaxing. The location was really nice, not very central, but a lovely walk into the centre via Tiergarten, or a short trip on the U-Bahn. Berlin is a fabulous city.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Great hotel! Everything could have wanted”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR124704866", "Content": "Bit tricky to find from the U-Bahn but a great hotel. Clean, modern, quiet, great night's sleep, lovely spa, fabulous breakfast, good service. Everything we could have wanted at a competitive price for a European capital", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stockholm", "Title": "“Service management on top!”", "Author": "Traveloholicman", "ReviewID": "UR124030297", "Content": "it is a hotell managed by Accor and one of their top brands. I have stayed at this hotel for three times on different occasions, both leisure and travel. Just booked a room for my elderly mum and dad on a weekend. Good value for money, nothing execptional but clean, good beds, good functional wifi and a various buffet breakfast with a lot of choices. Best: Really good service at reception, had some issues to solve and they did do everything prompt and with a smile! And a honest smile as well. Not the best: No lounge at hotel, but if de luxe room, you have access to a Nespresso lounge and a espresso machine in room, also free soft drinks in minibar.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Nice hotel”", "Author": "Bebej1976", "ReviewID": "UR123794617", "Content": "Stayed at the Pullman for three nights.  I would say it is clean, functional, efficient and comfortable.  I don't really consider the rooms to be of a five star standard, more four star.  They had everything one needed for a short business or leisure stay but are quite small and sparsely decorated. The bathroom is also quite small.  Staff were fantastic. Whether it be the front desk staff or restaurant staff. All were very friendly and efficient and seemed to genuinely be happy to make your stay a pleasant one.   We had breakfast each day and while it is not cheap at 24 euros it was a great spread.  Full selection of hot and continental options as well as eggs/omlette etc made to order. Leisure facilities were quite extensive. It has a great indoor pool (apparently the biggest hotel pool in Berlin) a small but functional gym. And sauna, steam etc. The location was very handy. It is right opposite the Berlin zoo and only five or so minutes walk from several U Bahn metro stations as well as a similar distance from the tegel airport express bus. I would definitely return providing the price was right.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Essen, Germany", "Title": "“Very good Hotel, Breakfast is of high quality and great diversity”", "Author": "3breathed", "ReviewID": "UR123743328", "Content": "I stayed there one night and a day after a trip from Barcelona. I always enjoy this hotel (go there every year around the same time to a meeting). The area is okay, the zoo is right across the street, restaurants can be reached in walking distance. The rooms are very clean, and (quite essential to me) absolutely quiet. But it really is the breakfast I am always looking forward to. Been in so many hotels (including Trump Itl., Chicago and others) this has really one of the best offerings.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Midlands", "Title": "“Good Hotel”", "Author": "MidlandsTravelg", "ReviewID": "UR123511924", "Content": "Good standard modern stylish hotel. Service at reception was very efficient and friendly. We booked a deluxe room, this overlooked the rear courtyard and was very quiet. Free use of mini bar (restocked daily - beers, sparkling wine, soft drinks, water, crips & chocolate) & internet. Very comfortable bed, great sleep quality. Flat screen TV with BBC1/ITV1 & usual English language news channels. Breakfast offered a good choice (both hot & cold). Great swimming pool complex. Location is ideal for Zoo, Tiergarden & KaDeWe. Only about 7 mins walk from U Bahn @ WittenburgerPlatz or Zoo Station. Taxi's always available outside, A great choice in West Berlin", "Date": "January 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“best hotel for resonable prise”", "Author": "ngzarov", "ReviewID": "UR123260188", "Content": "we stay at delux room. advantages: free wi-fi, free minibar, complementary water, modern furnetur in room and in bathroom, free spa area, nase restaurant, comfortable location, quietly. disadvantages: not good enough to clean the bath, as it turned out surprisingly dry cleaning requires a call to the reception, possible settlement with the children that strange for a business hotel", "Date": "January 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“My favourite hotel in Berlin”", "Author": "longhaulfromlondon", "ReviewID": "UR123119651", "Content": "I've stayed in this hotel a number of times over the years, most recently in December 2011 on a short business trip. The welcome is always warm, the rooms are well equipped and appointed and spotlessly clean. Breakfasts are good and the variety means you can have something different each day when you are there for a few days. The pool and gym are great, I believe it's the biggest hotel pool in the city and the sauna makes a pleasant stop off as long as you can cope with the German habit of both sexes naked together, it doesn't bother me any more but did seem a little strange at first. The location is great, a short walk from the Zoo Station and it's easy to find a number of restaurants close by in the evenings if you want to eat out. As long as I have to go to Berlin, I think this will remain my prefered choice for the foreseeable future.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "S Wales", "Title": "“Great modern hotel”", "Author": "Roberderoski", "ReviewID": "UR123114680", "Content": "Stayed here for a long weekend in December with friends. The Hotel is great - clean, modern, comfortable and service is excellent. Staff are friendly, helpful and could not do enough for us. The bar area is small but cosy and very relaxed serving good food and plenty of good beer. Rooms are comfortable, well equipped and the bathrooms were equally as good - spotless and a decent size. We would definatley stay here again.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brussels", "Title": "“I definitely loved this hotel”", "Author": "Melimelo Posted by an Accorhotels.com traveler", "ReviewID": "UR122965984", "Content": "Beautiful and large rooms, quiet and cozy, super clean and very relaxing spa and swimming pool, efficient and friendly staff, ideal situation. Pullman is and remains my favourite place to stay in Berlin !", "Date": "January 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Landskrona, Sweden", "Title": "“An excellent stay!”", "Author": "Mats71", "ReviewID": "UR122937191", "Content": "We visited Berlin during X-mas, between Dec 23rd-Dec 25th and stayed two nights at the Pullman Berlin Schweizerhof. Overall this was an excellent hotel and we can recommend it to anyone that would like a good stay. A few things to notice though: The spa-area is very nice with a large pool and 2 different saunas. As other reviewers have mentioned the sauna area is mixed, i.e. both men and women enjoy the same saunas. However the information about that and rules for \"engagement\" could be clearer. We had read the reviews prior to our visit and knew to expect naked people of both genders, and as flexible travellers we followed the example of the first gentleman we met in the area and undressed completely. Clearly not everyone had understood the principle which had the consequence that when my girlfriend and I went into the steam sauna we found ourselves in the company of a mother and daughter wearing swimsuits. Lucky enough we had large towels with us so that we could avoid making the other couple more unconfortable. Several other couples did join the sauna and there was a clear confusion regarding the (un-)Dress code. My advice to the hotel management would be to put up larger signs, preferably with pictures, that clearly shows what is expected to wear, and not, in the area. This a side, the sauna was very nice. If you like a spa-treatment then make sure to book it as early as possible in order to get it at a time that is convinient for you - during x-mas, at least, it wasn't too easy to find a suitable slot. Speaking about booking, if you book your stay at the hotel early then you can get a very good discount! My advice is to use this discount, or part of it, to upgrade to a room with free mini-bar, WiFi, and breakfast - it's well worth the few extra Euros, and would be much more expensive if it's bought at the location. We can also recommend the fantastic restaurant at the hotel, excellent service and very very nice menu. Last, but not least, we were unfortunately recommended a poor restaurant for our dinner night out in Berlin, we are absolutely convinced that this was an accident driven by the fact that most restaurants weren't open during x-mas eve, but a good practise would always be to double-check any recommendations on trip-advisor! If we would have done this, then we wouldn't have visited Restaurante Diverso!!!! (please see my separate review of this place) All in all, we would love to visit Pullman Berlin Schweizerhof again! :)", "Date": "January 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Bologna, Italy", "Title": "“great berlin hotel”", "Author": "natanBologna", "ReviewID": "UR122811768", "Content": "Great hotel in a central location in Berlin, close to Zoo Garden and acquarium. Well connected to U-bahn 5 min walk or bus 200 for all main Berliner turistic places, in front of the Hotel. Wery clean large room, with all conforts: you can have mineral water for free and also kettle for coffe/tea. One of the best things is the breakfast. Plenty of food and choice of everything you can imagine. The other good point of the hotel is the Spa. A large swimming pool with relax area, sauna, steam bath, showers and ice at your disposal for get cold after sauna. at the second floor you can find a pc room with free internet connection and printers, so we printed our boarding card at the hotel. Price very good for this kind of hotel...I'll reccomend it for whom wll be in Berlin.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "1", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Den haag", "Title": "“Sleeping in an oven...”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR122811275", "Content": "The hotel is very nice and well located...BUT we had two terrible nights as the heating in the hotel was very hot and the control in the room give you little to no control on the room temperature, which I think is unthinkable for such an hotel... You can choose from -3 to +3, which doesn't tell me much, and even by putting it on -3, the AC only made more ventilation noise without having much air getting out of the ventilation grid... We informed the reception the first and we were told that they would send someone to fix it... after the second night in the same conditions, we complained again at the checkout... this time we were told that it was due to the exceptionally high temperature for the season (10°C)!?! welcome to the 21st century! Otherwise the hotel was clean very well located and with a very nice modern design", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "", "Title": "“Lovely hotel in Berlin.”", "Author": "Mattlang", "ReviewID": "UR122669539", "Content": "This hotel has been renovated recently and everything ist just wonderful. The reception is very efficient and friendly, the room at beautiful and functional, the breakfast ist scrumptious and the hotel has a lovely SPA and gym area with a big pool. The dinner is a bit on the expensive side, but you pay for what you get. I had the most amazing beef fillet there ever! Staff is extremely attentive and friendly! This hotel gets a firm YES from me!", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "St. Albans, United Kingdom", "Title": "“Pleasant stay in Berlin”", "Author": "chrisgarcia", "ReviewID": "UR122216620", "Content": "This was our first visit to Berlin, and the main reason was to visit the Xmas markets, and various WW2 museums, memorials, etc For us this hotel was in a great location. 10 min walk from the Zoo station (although a little confusing which way to go when we first came out the station) and 10 mins to another underground. Both on the U2 line, which was great for us as it pretty much went everywhere we needed to go. In fact, i don't think we used a different tube line in the 4 days we were there. We got the Express train from Schoenfeld airport which was only 35 mins to the Zoo station Deluxe room was spacious, with free mini bar, free Nespresso machine and free WIFI (worked fine with Iphone). All three very handy (although the mini bar wasn't re-stocked one night which was slightly annoying). Nice shower and shower gels/shampoo's etc. Bed was comfy, but was two singles pushed together which seems to be the norm in Germany. Breakfast was very nice. Large selection and good quality. Reception staff very helpful and very good english. Would definitely stay here again if we return to Berlin", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cullompton", "Title": "“Lovely hotel”", "Author": "Queenofteddybears", "ReviewID": "UR122023139", "Content": "A sparkling clean and comfortable hotel. It was cosy and warm.The room and the staff were very helpful and caring. The coffee in the bar area is a treat, served with a solid silver tray and delicious biscuits. The actual restaurant food was very expensive and disappointing though, beware! The swimming pool is wonderful and robes are provided in your room, so you don't need to pack them. You can even have a hot water bottle fetched to your door, if you wish; well why shouldn't you?", "Date": "December 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Munstergeleen, The Netherlands", "Title": "“Weihnachten schnuppern in Berlin”", "Author": "TheHeinles", "ReviewID": "UR121924081", "Content": "Dear trippers, we visited this hotel from 9th December till 11th December. This hotel is perfectly situated near Die Gedachtniskirche at the famous Kurfurstendamm (about 400 metres). Within a 10 minutes walk you will find the KaDeWe, metrostation Kurfurstendam, Citytourbus stop, and lots of stores. Besides location the hotel itself is important of course. Well, lets be short this time ...Great beds, room, service and the restaurant.. something you expect in a 5 star hotel which is everything :-). Even the swimming pool is recommendable for a short relaxation after a shopping day. There is a parking place under the hotel. A lift takes you right in front of the lobby. Enjoy Berlin like we did fellows. The Heinles", "Date": "December 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Fantastic Hotel, Great Location, Great Staff - Great Price”", "Author": "andycowdrill", "ReviewID": "UR121896254", "Content": "My girlfriend and I visited Berlin in December 2011 and couldnt of wished for a nicer hotel..... great price, fantastic, clean hotel but more importantly the staff were amazing and could not have done more for us during our stay - even recommending two local restaurants that were amazing!! If you are visiting Berlin stay at this Hotel!!!!", "Date": "December 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nuernberg", "Title": "“Hotel perfect- garage a nightmare”", "Author": "doc holiday", "ReviewID": "UR121842913", "Content": "I agree with all positive reviews about the hotel. Perfect location, nice rooms, friendly service and a very nice breakfast buffet. If you should arrive by car, be warned: The hotel was built in 1999, but the garage must have been constructed fifty years earlier. If your car is bigger than a Mini you will have difficulties getting into a parking space. Going round one of the corners with a full size car deserves your full attention. The walls are covered with marks of the cars that didn´t make it. And if you finally manage to get into the parking lot, you have to show acrobatic skills, to get out of your car .Everything is extremely narrow. They should give a 20 € award for succesfully parking your car instead of charging this amount per night.", "Date": "December 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Excellent stay at Pullman”", "Author": "ShirleyRichmond Posted by an Accorhotels.com traveler", "ReviewID": "UR121776592", "Content": "Chose this hotel after reading reviews on Tripadvisor and it did not disappoint. The service was excellent, even to the extent of being provided with an English Bible on request ( after some confusion with an English bagel, my Scottish accent I think! ). The room facilities were excellent my only complaint being that the temperature was much too hot. We left our windows open 24 hrs otherwise it would have been unbearable. This has been commented on before. Breakfast was excellent. We found the location very convenient with easy transport links everywhere. We very quickly mastered the buses, train and underground. There was a great Christmas market opposite the Zoo not as posh but every bit as good as the Gendarmarket ( ? spelling ) though the one at Charlottenburg was prettier. We had a great time and plan to visit Berlin and the Pullman again next year.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent Hotel, Great Rooms and Friendly, Helpful Staff”", "Author": "trev1uk", "ReviewID": "UR121760103", "Content": "I arrived at the Pullman at about 10am:- after 6 hours of travelling, I was tired and ready to catch up on some sleep but was worried I wouldn't be able to check-in until the afternoon. I was really pleased to find-out my room was already available and ready to use. The Reception staff were great and really friendly, and that is something I appreciated having been travelling since 3am. The room was spotless and well appointed. I did book via bookings.com and paid the entire cost in advance, but for this you get a better standard of room for your money (and I also got a free mini-bar). On the downside, there was only 1 English TV channel, and wasn't being displayed for some reason. However, I didn't plan on spending too much time in my room so this was a minor issue. Breakfast was good and plentiful. There's a lot of choice:- juices, cold meats, cheese, cereals, yoghurts, hot breakfast items and a short-order omlette counter. The hotel also has a gym and swimming-pool, sauna, steam room and ice-showers. It was never busy and was a great place to relax in the evening. There are other hotels nearby with slightly better facilities if this is what you're looking for, but they are also a lot more expensive. I think the facilities here would meet most people's needs more than well. The hotel is a 10 minute walk from Zoologischer Garten S-Bahn, and you can use the Schonefeld Airport express train and be here within 30 minutes for just 3 Euros. The transport connections are easy, quick, cheap and efficient. Would I stay here again? Definately....the quality of the rooms, the facilities, food and very friendly staff, all make this hotel a great place to stay. I wouldn't have to think twice :o)", "Date": "December 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Excellent Value for Money - Great Choice”", "Author": "APF72", "ReviewID": "UR121735105", "Content": "The first point about this hotel is that it represents excellent value for money all round. My wife and I booked in for three nights over the second weekend in December and throughly enjoyed our stay. ROOM: We were given a deluxe room on our check in on the second floor. Overall, it was excellent - extremely clean, bright with modern furnishings. The mini-bar was included in the room price which was a nice touch and while we also had Wi-Fi included. However we did not really need it as there is an excellent business room outside the lift on each floor. One slight negative on the room front was that the lack of English TV stations. LOCATION: The hotel is situated in the West side of the city, close to the 'K'dam' which is one the main shopping areas on Berlin (5 mins walk). Zoo station is also approx a 10 min walk from the hotel which made it convenient from Schonefeld Airport - we caught an Airport Express train which took approx 35 minutes. FOOD: Breakfast was excellent. There was a great choice available at the buffet, from cereals, breads, hot buffet, made to order eggs/omelettes and crepes,cold meats, fruit and pastries. It was one of the highest standard selections that we had experienced in a hotel. The food was constantly stocked and the staff were very quick to provide tea/coffee and refills.The weekend was busy but the room was a good size to cope. SPA: After a short walk to a different wing in the hotel (transfer through 2nd Floor) you can reach the hotel spa which includes a large pool, ideal for lengths. There is also a 'mixed' sauna & steam room area which leads from both changing areas which was an oasis of relaxation. STAFF: We found all the staff were extremely helpful. This included the receptionists, the breakfast staff, the housekeeping staff and the attendees in the spa. All our requests were dealt with true profesionilsm. Overall, I would throughly recommend this hotel.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cambridge", "Title": "“We all loved it”", "Author": "KJAJ1", "ReviewID": "UR121660879", "Content": "Give me a fabulous breakfast and a Nespresso machine in the room and you've won me over already. Throw in wonderful service, comfortable beds, rooms big enough to accommodate our family of four and a pool and spa - well! The reviews on this site are really accurate. The hotel is good value for money - 100% recommend.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“We had great stay!”", "Author": "DK-NO", "ReviewID": "UR121568839", "Content": "We went as a group of three girls wanting to enjoy Berlin in December. We chose this hotel because it really offered great value for money. Compared to many other hotels I have stayed in various countries, the rate seems cheap to us, yet the hotel is an astounding five star with great reviews here. We were upgraded to junior suite upon arrival and all the staff had been very helpful. There was little chaos during the breakfast time due to the number of guests and limited seating, but the various choice of breakfast menu quickly covered that up. The only problem we had during our stay was that the wifi internet didn't work. It could be because we stayed too far from the \"main area\" (our suite was located in the east side of the hotel, we had to walk thru the spa, beauty center and all that to get to our room), but we didn't have internet for 3 days we were there, so we couldn't really browse of possible sightseeing places we wanted to go, but luckily the concierge was super helpful. If I ever go to Berlin again, I would definitely stay here again. No doubt about it.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“you have to be really picky to find anything wrong”", "Author": "jroberts425", "ReviewID": "UR121514088", "Content": "I last visited berlin 4 years ago and passed this hotel on my daily sightseeing walks. I think it was a Sofitel back then but is now still the same group but re- branded as a Pullman. It looks imposing and comfortable and being near the zoo was a little more centralled placed than my last hotel if you want to walk out to both the former East and West Berlin. The deal in the deluxe room with complimentary wifi and minibar was well worth it. The wifi is fine and the mini bar stocked with chocolates,crisps and a selection of alcoholic and non alcoholic drinks. Given the status of the hotel cleanliness and comfort is a given but I cannot remember stopping in a hotel where all surfaces and glasswear gleamed,lots of chrome and glass and no smears or finger marks anywhere - real attention to detail. The room was kept clean to a similar impeccable standard. The buffet breakfast was excellent,and is open 6:30 to 11 from recollection so it is never too crowded. The spa is beautifully decorated and really relaxing and a decent sized swimming pool. I know this all really repeats what is in the preceding reviews but it is exactly what you get ayt this hotel - I noticed Lufthansa book their pilots in here so I'm sure that speaks volumes. However it is the staff who make the whole experience even better. From checking in - quick,courteous and efficient, to the breakfast staff - friendly and welcoming and the cheerful spa staff you really were made to feel like a special guest - particularly nice when on holiday. Again the check out service was crisply efficient ( they had clearly put extra staff on at an anticipated busy time ) but also personal and friendly. As the title implies it is difficult to say anything negative about this gem of a hotel but if pushed possible improvements would be : 1. Swimming pool temperature increased a degree or two. 2 Corridor temperature decreased a degree or two. 3 Clarification of how/when minibar restocked. 4 Better written instructions for Nespresso machine in room. Otherwise perfect hotel - will definitely stop here again on next visit to Berlin.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Luxemburg, Luxembourg, Luxembourg", "Title": "“great - best attention ever a big hotel”", "Author": "Luxikarin", "ReviewID": "UR121253871", "Content": "Staff is really a plus in this hotel which only makes it more enjoyable. Everything is perfect to make an enjoyable stay in Berlin. The location is not my favourite, but this is very personal. With bus nr: 200 just in front you reach all the important spots really easily. And last but not least GREAT swimming pool.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Fantastic weekend getaway hotel for family.”", "Author": "Amurray160", "ReviewID": "UR120821399", "Content": "Not sure I can add anything more to the well deserved praise that this hotel has received here, but having lived now for over three years in Berlin (well, technically in the suburbs ) I can assure visiting tourists that this is a great location for any trip to Berlin. It is walking distance to Ku'dam shopping and the zoo and also to the central Zoologischer Garten train/S-bahn/U-bahn station which can get you all around the city quickly. The pool was warm (especially compared to most other indoor pool experiences we have survived) and the breakfast passed the kids test with flying colors.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maspalomas", "Title": "“Fantastic!”", "Author": "elxolas", "ReviewID": "UR120671328", "Content": "We were very much impressed with our stay here! Staff were very courteous: reception, breakfast and housekeeping. We got a choice for room location upon arrival and enjoyed the breakfast banquet very much indeed! Hotel facilities spotless: trendy and sleek. Very pleasant location infront of the Tiergarten. Appreciated the complimentary water in the room and access to four computers with free internet. Shame we didnt manage to check the Spa/Pool. Would definitively repeat. Excellent value.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great family hotel”", "Author": "crystalone", "ReviewID": "UR120613182", "Content": "We stayed in this hotel because of its great location to the zoo and it definitely lived up to our expectations. We arrived a bit stressed out as the airline had lost our bags to be greated by a very nice check in person who had our room key ready in minutes. We were traveling with children so this is very important to us not to be hanging around and waiting and the staff reasured us that as soon as our bags arrived they would send them up to us. We were staying in a suite and it was very clean and big and very well layed out. We were very impressed with the size of the bed and how comfortabe the bed and pillows were. Our windows overlooked the zoo and the children had great fun looking out. We were also very impressed by the extra effort the hotel went to with the extra little touches like a gift for the children which containded colouring books and crayons. The free mini bar was also a nice touch with water, orange juice, wine, beer ect and also nuts and other snacks. When our bags arrive they were brought straight to the room with no fuss. We also used the free internet which was very fast and efficient. We had room service on two nights as the children were to tired to go out and on both nights we were very impressed by the standerds of the food and the service. Everything was presented on a lovely well layed out trolly. With everything we needed. We had pasta for the children and there was parmesan cheese and we had homemade hambergers and there was plenty of salad dressing and sauses. All in all it was so relaxing and just what you wanted for a family trip with no fuss and for the kids to feel happy and well fed. We also used the swimming pool a few times the only criticism was that the temperature of the pool was very very cold and it was hard to enjoy it as we and the children found it to cold to stay in it to long. We had breakfast every morning of our stay and found it to be a very pleasureable experience. There was a huge choice of food on offer from cooked to cold selection with plenty of cold meats and cheeses and pate. There were lots of different breads and little pastries. I found the selection of teas most enjoyable and we always found that the breakfast set us up for the day to go sight seeking. My only criticism was that the self service area was a bit small and could get very crowed when it got busy and sometimes the staff hovered around the tables a bit to much as they needed to turn the tables over quickly as the demand for tables was huge so you felt a bit rushed if it was busy. However all in all we would return and found it a great hotel to visit all the attractions we look forward to returning to it again soon.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Gent", "Title": "“Meets your highest expectations”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR120584625", "Content": "Very good service, amazing indoor swimming pool, good room cleanliness, good breakfast. For sure a value for money option!! The restaurant is too expensive for the food quality, better to eat on the nearby restaurants where you can find several options less expensive and with better quality.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Brilliant friendly staff and a lovely room”", "Author": "alicej1985", "ReviewID": "UR120391417", "Content": "The staff were a delight, their customer service was superb. The room was lovely and we were brilliantly catered for.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bad Pyrmont, Germany", "Title": "“Great stay!”", "Author": "Getitgoing1974", "ReviewID": "UR120389048", "Content": "Exactly what you expect from Pullman. Very nice rooms, good service, everyone was very friendly. I will definitely go back!", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“We loved Berlin and this hotel!”", "Author": "Brian G Posted by an Accorhotels.com traveler", "ReviewID": "UR120067019", "Content": "The Pullman Berlin Schweizerhof was a great luxury hotel. The rooms were very clean and came with a free bottle of water each day. Upon arriving, we asked if there were any free upgrades and they moved us to the 9th floor for a better view of Tiergarten. The good: it is a really really nice hotel. Definitely 5-star in my opinion. The beds/rooms are clean. TAKE ADVANTAGE OF THE SPA. It's a great place to jump in the modern swimming pool, or go in the sauna (although Europeans like to get naked in the sauna...buyer beware). The bad: There is no Wi-Fi in the hotel, not even for a charge. How a hotel, especially of Pullman's quality, doesn't have Wi-Fi in 2011 is beyond me. They have a huge conference center....I would hope no conferences are held that need Wi-Fi because it won't happen. I wouldn't stay at Pullman again unless there is Wi-Fi next time. Also, while the hotel is close to KuDamm, it is decently far from all of the other sights of Berlin (Brandenburg Gate, Reichstag, remains of the Berlin Wall, Checkpoint Charlie, Holocaust Memorial). At least a bus, subway or cab ride to get to them unless you want to walk 45 minutes. Finally, the concierges didn't seem of any value, giving some bad advice on restaurant suggestions.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Illinois", "Title": "“Great room, fantastic location”", "Author": "comfytravel", "ReviewID": "UR119895924", "Content": "Everything is bright new and stylish. The location is fabulous - on a charming Budapester Strasse, right next to the park on one side, Kurfurstendam on the other, and in between all the attractions of former West and East Berlin. Convenient underground garage, great breakfast, free Internet in the business center - just ask for it. There were two minor problems. First, we had an accessible room for disabled, and the design of the bathroom was pretty bad: shower without ANY walls, curtains, tray, just tiled floor. After shower, it becomes all wet and slippery. Second, it's hard to believe, but the ONLY English channel on TV was Al-Jazeera. They said there was a technical problem to be fixed. Overall, great hotel for reasonable price.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, England", "Title": "“Excellent but BIG”", "Author": "tsirout", "ReviewID": "UR119781766", "Content": "We arrived at the hotel at 14.35 and our room was not ready. we were escorted to the cocktail bar and told to order complimentary drinks while we waited for 15 minutes. We were then escorted about 50 meters to a lift which took us to the basement. Then we walked about 200 meters to another lift which took us to the third floor where we were shown our room. For some reason we had been upgraded to a suite with a free mini bar and a sofa and two armchairs in a lovely large room. Breakfast was everything you could desire and we found the staff very friendly and helpful. No complaints!! Highly recommended.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Budapest, Hungary", "Title": "“Nice 5 star property. Good location.”", "Author": "GPeto", "ReviewID": "UR119740541", "Content": "Across the street from the InterConti. Super location and very nicely appointed rooms. They say to have the biggest hotel pool in berlin which is easy to beleive since it is very big and beautiful. Breakfast is good. All in all its a very good hotel", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Very good business hotel”", "Author": "ouragan1 Posted by an Accorhotels.com traveler", "ReviewID": "UR119485877", "Content": "I recently stayed at the Pullman Schweizerhof Berlin and was very pleased with the facilities. Check-in: Expedited in no time with smiles and confidence from the reception staff. Great can-do attitude. Room: Clean and functional. However windows do not open fully. The bathroom was very standard though. Food: Fantastic, extensive breakfast buffet with great waiting staff who deserve to be praised for their professionalism. Business Centre: Providing internet access for free and laser colour printer. Great to prepare reports Overall, very good value for money with service !", "Date": "October 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Staten Island, New York", "Title": "“Good Stay Overall”", "Author": "Singingsal17", "ReviewID": "UR119393636", "Content": "I recently stayed at this property for a business conference for 4 nites. Location if close to airport (Teugel) and not to expensve cab ride from the Mitte area. Gym and pool were excellent as was the staff . Cost was higher than usual as this was one of the conference's co-host hotels. Only complaints that had some internet difficulties in my room and I heard this same issue from some other guests. At time in room wireless connection was not strong and would loose connection at times. If you are on outside of building it is difficult to sleep with any windows open but fine if closed. Also they had limited TV stations (2) for English speaking clietel and did not have even CNN or BBC. Restaurant was very good for luch or dinner and not crowded during our stay. Would proabably choose another hotel for non-business trip closer to downtown.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Luxury for a good price”", "Author": "39JulioS", "ReviewID": "UR119191074", "Content": "Brand new and elegant designed. The hotel is very centric, a few steps from the zoo. I had a huge room on the top floor with an amazing view over the central park (Tiergarten). We slept with closed windows and it was really quiet but if you like to sleep with open windows take a room facing to the inner courtyard. You can reach the spa in the underground from your room through the lift just wearing swimsuit and bathrobe. There is a huge heated pool, a sauna and a turkish bath. The breakfast was super, really incredible choice and everything good! I didn't need to have a lunch after it. It's also well connected. You can find always a taxi waiting at the door. Or if you want to take a bus to go to the east side, the stop is right there. At walking distance you have the big shopping boulevard (Kurfurstendamm) with the biggest department store of Berlin (KaDeWe). A great option for enjoying this wonderful city.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "london, UK", "Title": "“Excellent business hotel, close to all the sights”", "Author": "weirdo666", "ReviewID": "UR118523206", "Content": "Nice, light rooms. new furniture. large bathroom. restaurant is excellent, and the bar is modern. excellent gym with new equipment, as well as a rather large swimming pool. perfect for business trips, probably a bit \" cold\" for leisure, but then again, very luxurieus.", "Date": "September 24, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Excellent location, staff very friendly”", "Author": "TripDrug", "ReviewID": "UR118061856", "Content": "Check-in was quick and easy, the staff were very friendly. The entrance and reception area are very chic, there are multiple lifts and the floors are attractively decorated. The room was quite small, but very well appointed with modern attractive furniture and a restful decor. The bathroom was also small, but with a great use of space and very well lit. The location is outstanding, near to the zooalogical gardens and the city cenre (K-Dam, Ka De We etc.) Our short weekend break in Berlin was greatly enhanced by this excellent hotel.", "Date": "September 13, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“In short: better than this will be hard to find”", "Author": "TravelGeeks2009", "ReviewID": "UR118054628", "Content": "We stayed in this modern, contemporary hotel over the weekend. We got an upgrade from a Classic to a Deluxe room, paid a very reasonable price, incl. breakfast wireless (free, also a nice add on) and found ourselves in a nice, luxurious and relatively spacious room facing the inner courtyard of the hotel on the 9th floor. Very clean, quiet room, nice bathroom, comfortable beds and feather pillows (or, as a choice special \"health\" pillows), with a Nespresso coffee machine, two duvets (pity that no German hotel seems to provide a nice double duvet rather than two smaller duvets which cannot be tugged tightly at feet end). A centrally located spot for this Accor hotel at Budapester Strasse, not far from the main Berlin attractions. Very extensive and wonderful breakfast in an overall very tastefully designed hotel (even the corridors, not always the most attractive parts of any hotel, are tastefully designed). The reception and concierge are kind and helpful. The hotel has a nice and rather larghe swimming pool and attractive Spa. In summary: simply the best. Want to hear two things that they could improve? Make turn down service a standard service, or, alternatively, ask a guest when checked in, whether they like this service (we do). Obviously this is not standard practice you have to ask for it and big chance if you say \"turn down service\" the receptionist will not immediately understand what you mean. Last small point where the hotel could improve: assistance with luggage. When we checked out and came to collect our luggage after a bike tour (yes the hotel rents good bikes, a must do in Berlin!) we had to struggle with rather voluminous luggage to the front door, no door men assisting us. But, in general, a superb hotel, better than that will be hard to find in Berlin!", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Aalsmeer, The Netherlands", "Title": "“Relax!”", "Author": "Cereusmonstruosus", "ReviewID": "UR118005760", "Content": "It was so comfortable staying there, great swimmingpool, quiet rooms which were a joy to stay in.", "Date": "September 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "hoofddorp", "Title": "“Pullmann Berlin”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR117692704", "Content": "We stayed in this hotel in aug 2011; our first fist fisit to this hotel. The hotel is located in the heart of the city center of Berlin.So we easily found our way by car and parking just beneatht the hotel was no problem. The personnel was very friendly, the rooms were good with exxcellent beds.. Breakfast not cheap but very good. Recommeded hotel.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "todmorden", "Title": "“Loved this fabulous hotel”", "Author": "Ronn1e", "ReviewID": "UR117620728", "Content": "My friends and I have just returned from a 4 day break in Berlin. We chose the Pullman Schweizerhof because of the reviews on trip advisor and its central location. We certainly were'nt disappointed in any way. The hotel was about 10 mins easy walk from the Zoologischer Garten bus station, X9 bus takes you there for 2.30 euros direct from Tegel airport. The hotel is very modern, spotlessly clean and spacious. Staff were wonderful and those in the concierge extremely helpful, from check in to check out. Stayed on B & B and the buffet breakfasts were great...couldn't ask for more choice or better quality. Rooms very comfortable. We had an early flight on the last morning and was impressed with the continental breakfast table located at reception for those checking out before breakfast started Location...close to the aquarium and zoo..easy access to the Ku'Damm for retail therapy...close to the Tiergarten for Brandenburger Tor and Reichstag. Wouldn't hesitate to return or recommend", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Middlesbrough, United Kingdom", "Title": "“Great Hotel - But now the real extra bits of info you need”", "Author": "Colin355", "ReviewID": "UR117605826", "Content": "First of all we booked 4 rooms for 8 people, the hotel does not give refunds for a last minute change of information so be aware if like us you have paid 1,300 Eu (about £1,000) you may not get it back if you need to cancel or adjust the booking due to some emergency situation. Make sure your insurance will cover this. The hotel is very well situated, out of the hotel and turn left you will head towards the local township where there are plenty of bars and restaurantes within 10 min walk. There is also a bank just 2 min down the same road if you need cash. Turning left you can pick up the local tourist bus company city hopper. This is really worthwhile so for a small sum you can hop on and off the bus as it takes you to the main attactions of Berlin. Turning right out of the hotel you will come across a greak restaurante just 2 min down the road, this is an excellent place for drinks or a meal on an evening. Just past the restaurante, next to the river right you can pick up boat that takes you round the city for a small euro sum, the trip takes about 2.5 hours but really is fantastic with drinks served on-board - really cool on a nice warm day. Turning left rather than right you follow a wooded path behind the Berlin Zoo complex. This is really cool as you see the animals etc from the riverside viewing inwards (its really a free show), load of birds, animals etc to look at. Brilliant. There is also a river-boat lock nearby with a small bar so you sit and watch the boats passing through the lock. The hotel is fantastic. Really good value for money. Breakfast is served over 3 rooms and caters for anything from 1 to 10 guests on a table. It's really cool to sit outside as we did on our first night with really warm weather, just drinking into the small hours and taking in the street views. Breakfast is a feast, just fill your boots. If you are into a Gym/Swim/Sauna cuture I have a few pieces of advice for you here - this hotel has the largest swimming pool in the area with a host of sauna and steam rooms to tempt you. So OK lets get down to the nitty gritty - first if are going to the gym no problem, go for it. If after your gym session or your swim session you decide to go for a sauna then be aware...both the men's and ladie's changing room may say \"change/sauna this way\" buty what they really mean is they converge into a massive steam room from which men and women both emerge. In Germany it is NOT the done thing to have anything on when you go sauna, so my advice from this experience is to grab anothe towel from the shef that will be in threre and use it as you 'carpet'. Enter the area, hang up one towel and use the othe to carpet your lay-down spot. From the moment you hang up your towel, you shoud be naked from then on in. The men's changing area and women's changing area converge in this communal area. The area has rooms off with different temperature sauna etc. The communal area also has 'fun showers' where you can shower with forceful showers and have coloured lights flashing etc. This whole area is male/female naked only. Now do not be put off.... ....On entry to the communal area you will see several nakes bodies, men/women, just standing, talking etc - this is normal, just enter any sauna/steam room you want then come out say 10 min later. Dont be afraid you will be showering next to someone from the opposite sex and perhaps going into a splash-pool with them naked in a few minutes time, this is all part of the experience. If you are a guy at this hotel, dont worry about female attendents in your changing room. They will quite often start to clean the floor while you are in the shower, you can have nice chat to them while you try to scrub up. Dont be timid, just act natural and think matcho!!! They will often come into the sauna to add water to the coals for you, just dont worry about it. Overall remember Germans are very private people apart from in their Sauna/Bath-houses where they are very 'free' with their bodies. Just go along with it and you will have a great time!!! ...", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Gothenburg, Sweden", "Title": "“Excellent room”", "Author": "NilsW", "ReviewID": "UR117357227", "Content": "Located very close to Kurfurstendamm, good room, excellent breadfeast. Parking garage to small, easy to get your car damaged.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Massachusetts", "Title": "“What a gem!”", "Author": "Travelgirl061", "ReviewID": "UR117333490", "Content": "My son and I just returned from a three week trip in Europe, with three days in Berlin. I was THRILLED with this hotel! The staff could not have been nicer, from our first to last interaction. The room was spacious, the indoor pool a real oasis, the buffet breakfast was scrumptious, and the apples at the front desk a great touch. The concierge was extremely accommodating. This hotel was the least expensive (of the five hotels we stayed at), but by NO MEANS lacking in ANY WAY. My only wish is that they had Pullman hotels in the States!", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Leuven, Belgium", "Title": "“Friendly staff, great rooms.”", "Author": "Rutger L", "ReviewID": "UR117322800", "Content": "This hotel made our Berlin city trip so much better. The staff was very friendly, the rooms clean and spacious. We liked the swimming pool and sauna a lot and breakfast was very generous, though quite expensive.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“A Modern, Classy Hotel in Good Location”", "Author": "Aussie-Traveller3121", "ReviewID": "UR117313039", "Content": "Five-star corporate hotels are not usually our preferred choice of accommodation, but we got a great deal for our three nights stay from the hotel's web site (50% discount, pay in advance) that we would have been silly not to select this hotel for our stay in Berlin. The hotel looks new and is situated on Budapester Str. close to the Zoological Gardens and the major shopping district (KaDeWe department store and others), supermarkets, restaurants and cafes. Our room was on the seventh floor overlooking the courtyard and was very modern, plenty of room and with all the facilities expected of this class of hotel. A nice bathroom with a bath and shower over bath (take care getting into the shower though) and spotlessly clean. A separate check was made by hotel staff daily to ensure the room was cleaned properly. Expensive mini bar (of course) and tea/coffee making facilities also in the room (a nice surprise) and two bottles of water were provided free of charge. Free WiFi or internet connection was available in the room, but not for free. Actually, the cost was quite expensive, which is disappointing and obviously catering to business people (with company paid expenses) rather than leisure travelers. There is a nice restaurant at the hotel, which was expensive compared to local restaurants. A full buffet breakfast (eggs, crepes etc prepared on request) was included with our room rate and was excellent. The hotel staff are very friendly and helpful, especially the concierge's desk where you can purchase train tickets and also theater tickets if you are interested. To get around Berlin, the No 200 bus goes down Budapester Str., or you can get the train from the nearest metro (U Bahn) which is Wittenbergplatzl or Zoologischer Garten, both about 10 minutes walk from the hotel. Tip for sightseeing; take the No 100 Bus (outside of Zoologischer Garten station) for Euro 2.30 (tickets available from Hotel Concierge) as this bus travels the same routes as the sightseeing buses (but no audio available of course). Overall we had a very enjoyable stay at the Pullman.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Brentwood, United Kingdom", "Title": "“Lovely hotel - good location”", "Author": "AngeS", "ReviewID": "UR117263970", "Content": "Stayed here with a friend for 2 nights in August. We thought the hotel was great and really enjoyed staying there. The location was perfect for us. It seemed to be in the middle of everything that we went to see. The staff were friendly and but a bit slow to serve in the bar area. The rooms are very clean and comfortable. The twin room we were allocated was large and well appointed. The breakfast buffet is good but a bit expensive 24 euros. Good selection of fruit, cooked items, breakfast cereal, bread, cold meats and cheese. The bar has happy hour for cocktails between 9pm-10pm. The cocktails were pretty good and there is a wide selection. The food served at the bar was also made to a good standard. We looked at the swimming pool area but didn't use it. The pool is fairly large, very clean and there are loungers around the outside. The fitness area looks onto the pool. It looked well equipped and a good size. I would stay here again and recommend it to others.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "xxx", "Title": "“Good points: location, pool, breakfast”", "Author": "Torremaules", "ReviewID": "UR117263034", "Content": "Hotel location is good to go to and from city center or airport. Bus 200 has stops near the hotel entrance either to center or to Zoologischer Garten. Zoologischer Garten U-bahn is about 800 m to the west, still near Wittenbergplatz U-bahn is about 600 m. to the south. At Zoologischer Garten the X09 bus goes straight to Tegel Airport. We had an offer with breakfast and late checkout included. We asked for a quiet room in an upper level with views to the Zoo (that is to the North). Room has very good sound insulation from street noise. Window is bottom hinged and cannot be fully open. Planes flying up from Tegel can be seen from the window. Bed is huge and very comfortable. Robes and slippers are provided. The wardrobe is quite small for storage for a couple to stay a week long. The design bedside tables are useless with no drawers. Flat TV is quite big, it has way too many channels in German; a good point Italian RAI 1,2,3 are available; missed Catalan TV3 as other local Spanish channels are available as well. An American plug in with 110 voltage is missing, not even one for the razor in the bathroom. Room has tea facilities (kettle, tea bags, instant coffee). You get complimentary bottles of water which are replenished daily, and a jar of varied nuts on arrival. On the bassement, but with natural light, there is the big pool (maybe 20 x 10 m), and the spa (mixed gender) with sauna and steam bath. Admitance to the pool and spa area is done with the room keycard. The only complaint is that at some times there are noisy people and screaming children in the pool or inside the sauna. The convenient long opening hours for the pool, from 06:30 to 22:00, allows plenty of time alternatives to escape that nuisance. There is a small room in the 2nd floor with complementary pcs with free internet connection (e.g. to check in flight and print boarding pass). Breakfast buffet is plentiful, many varied options and excellent quality, with fresh orange juice, real yogurt, eggs cooked on the spot, lots of different sorts of bread, several types of puff pastries, several kinds of soft cheese, several German specialties like liver paste and nurnberger and wiener sausages, etc. I personally missed some sort of hard cheese.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Schaffhausen, Switzerland", "Title": "“Top location”", "Author": "rolf41", "ReviewID": "UR117260423", "Content": "very well located in the center of Berlin. Room was great and tidy and the staff was very very friendly.The price value relation is just great. This place is really great and helped to make our stay extremely pleasant.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Prague", "Title": "“excellent hotel to stay in Berlin”", "Author": "fozco33", "ReviewID": "UR117114854", "Content": "spend here a weekend during our citybreak in Berlin. Staff was very professional and friendly. rooms were very clean with all you need. breakfast was excellent and quality and selection was great. wellness area was spacious and well managed. For our next trip in Berlin, we will definitely stay here again.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Warsaw, Poland", "Title": "“Nice, business hotel”", "Author": "TomekWu", "ReviewID": "UR117021174", "Content": "Stayed there for 3 nights - standard room with courtyard view. Great, very comfy beds. Breakfast very good, just standard quality for this kind of hotels. Staff OK. Pool quite big, unfortunately a lot of screaming children. Location is pretty good, but not in the middle of action - close to U-Bahn, bus stops and some good shops. Next time I'd probably stay somewhere else, closer to Berlin Mitte.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "romania", "Title": "“Excellent”", "Author": "anca2010", "ReviewID": "UR116956931", "Content": "The hotel is very good situated just across the street from the Zoo.The staff and services are excellent, I can't think of anything I didn't liked here.If you want a pleasant stay in Berlin this is the hotel for you. KA DE WE is 5 minutes away from the hotel. A truly excellent hotel.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“This Hotel exceeded all of our expectations”", "Author": "LauraJ66", "ReviewID": "UR116801667", "Content": "We were a small grp of family and friends going on a short 3 day trip to Berlin - first trip to Germany. We thoroughly researched Berlin hotels and picked this one on the strength of the consistently good reviews on Trip Advisor. Very easy to get to from Tegel airport - X9 bus to Zoo and then either walk to Hotel bout 5 mins or get a no 200 bus which stops virtually outside the hotel on Buderpester Strasse. Reception v welcoming and we asked for and were given a view of the Zoo on the 6th floor (don't worry the lifts are quick and pleasant). This overlooks the quiet tree lined street that the hotel is located off but just by the main shopping areas and transport links - this is a bonus, as it is away from the really busy main streets where other big hotels are located. The view is incredible. Our room was immaculately clean, spacious and welcoming as were the corridors and seated viewing areas. Daily housekeeping with complimentary water, tea and coffee replenished, a bonus after a long day of sightseeing. Roger Gallet complimentary toiletries. The pool and spa areas are wonderful and as a guest you have free use of the facilities. We ensured we paid a bit extra to have the breakfast buffet included and I do recommend you to do that - the choice is huge and the quality is amazing - you just have to experience it to believe it. We were so full, we never needed to buy lunch and only felt like tea and cake mid afternoon. Ask for the adjoining room at the back of the dining area and you will feel you are in a private, exclusive salon. The decor is beautiful. What we also loved about this hotel is the staff - unfallingly polite, helpful and kind - they really do want to make your stay the best posible - absolutely nothing is too much trouble. The Concierge is amazing and you can do most things there like buying your transport tickets, making reservations or booking the Reichstag visit or a river trip. It makes it all so easy. Their recommendation for a nearby Italian was spot on - lovely food, service and atmosphere - the Via Condotti.. Overall, this hotel exceeded our expectations and we will be back as soon as possible - we aren't alone in our opinion, as we noticed that lots of different airline pilots were checking in as well and they usually know a thing or two. This hotel is clearly a corporate hotel but it is also a luxury hotel, which is family friendly. Do try it - I am sure you will not be disappointed.", "Date": "August 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Amsterdam", "Title": "“Top facilities, services and staff”", "Author": "opentrail", "ReviewID": "UR116692760", "Content": "What a fantastic hotel for a weekend city break. Treat yourself to the Spa, swim and have a workout before venturing out into Berlin. Staff very customer focused. Great breakfast and good value if you can get a deal... Half price. I will be looking for this hotel on my next visit.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Stamford, United Kingdom", "Title": "“Lovely hotel - but really noisy spa!”", "Author": "AntoinetteKerrie", "ReviewID": "UR116644127", "Content": "This is a nice hotel, new, modern, clean, and friendly staff. Our room was a nice size, although they said they had upgraded us - but hotels often say that. We asked for a quiet room, away from the lift and we got what we asked for. Room service was excellent, very fresh and hot - we ordered Club Sandwich which with chips which was huge and delicious, plenty to share. A nespresso coffee machine with pods was in the room for free use, and the bottled water was also free - such a nice gesture. Breakfast was excellent and delicious with everything on offer. The only thing I didn't like was that they always wanted to seat us, fair enough, but we wanted to sit somewhere quiet. The first 2 mornings it wasn't a problem, and we were allowed to sit where we wished, but the 3rd morning the lady told us to sit in a noisy area - we moved and sat somewhere else and when the lady saw us we got a rude glare from her. Unfortunately, we booked this hotel for the Spa experience, and it was not an experience I would like to repeat. Whilst it was a lovely, new and modern Spa, it was incredibly noisy. We had to go and lay outside to relax. Not just children screaming throught he pool area, but the adults too. Absolutely no respect for peace and quiet. We thought is was a one off on the first night, but no, it was every night. I hoped the attendants would say something, but again, no. It was awful. As a hotel just for sightseeing, it's great, but if you would like a romantic weekend, a definite no - this is a really busy hotel and the Spa area was really noisy until it closed, so I definitely wouldn't recommend it.", "Date": "August 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Perth", "Title": "“Excellent Hotel”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR116585102", "Content": "Very nice & modern hotel. Would have been one of the best hotels I have ever stayed & this is even compared to USD$500+/night hotels. Nice breakfast, very friendly staff. Will be staying here on my next Berlin trip for sure.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Aachen, Germany", "Title": "“excellent hotel in top location – with great swimming pool!”", "Author": "PushingTheSenses", "ReviewID": "UR116314478", "Content": "the hotel is centrally located, right next to the zoo and close to the frauenkirche, only a short walk from kurfuerstendamm. service and friendliness of the staff was outstanding. even though the hotel seemed to be packed over the weekend, they still managed to provide excellent service at breakfast. liked: nice, spacious rooms large swimming pool – that alone is worth staying at this hotel good breakfast choice friendly service excellent concierge service", "Date": "August 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Fredensborg", "Title": "“Simply the best hotel in Berlin”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR116223307", "Content": "Having stayed at Radisson, Novotel, The Palace Hotel, Pullman Berlin is the best of the best. The pool/spa area is fantastic with probably the largest hotel pool in Berlin. We stayed in a deluxe room with a room size about 28 m2. The beds were very comfortable and there were two types of pillows for each. The rooms are sound proof. An nespresso machine was a nice feature in the room. Prices in the bar are a little high but the same as other 5 start hotels. We ate at the Xenia restaurant and it was very very good and there was excellent service. However, expensive. We'll be back!", "Date": "August 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great services, clean, great breakfast and great pool”", "Author": "Shellyzak", "ReviewID": "UR116004267", "Content": "We arrived early to the hotel and received keys to our room with no extra hassels. The room is clean and all the services are just great.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cymru / Wales", "Title": "“Would go back tomorrow!”", "Author": "Cymroardaith", "ReviewID": "UR115987840", "Content": "Fabulous hotel in every way. Convenient, central location - five or ten minutes walk from the Zoo hub from where public transport to all major parts of the city is available. Many of the city's main sights and shopping areas are within easy walking distance. Well appointed, large, comfortable and quiet rooms - ours overlooked the garden. Not a blemish in sight. Professional, multilingual staff who understand customer satisfaction means! Very reasonable rates too - possibly because there are so many decent hotels in the locality.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London, UK", "Title": "“If only all hotels where like the Pullman!”", "Author": "Andrexel", "ReviewID": "UR115975349", "Content": "ust come back from a three day trip to Berlin and was very impressed at the quality of the Pullman. The hotel was refurbished to a high standard about three years ago and is very well run. Check in was efficient friendly and quick, Rooms are fair size with 32Inch TV's, mini bar and all the extras for a hotel of the category (Ask for a room on the side overlooking the tiergarden). Restaurant food was excellent and breakfast was a very good German style buffet breakfast but perhaps a little expensive. We spent quite a while in the bar (perhaps to long!) the cocktails are very well mixed and during happy hour (9pm hence the name of the bar!) all are 6 Euros each! Pool & sauna & Gym are very clean and efficient and even has a sun terrace for those hotter months. WiFi was chargeable but they do have a free 24hr internet room with 4 pcs and a printer so can not really complain as this is a hotel aimed mainly at the business traveller. However its in a great location being just moments from the gates of the Zoo in tiergarten. If flying into Tengel airport get the X9 airport bus (about 15 mins) and then get of zoo then its a 5 min walk or you can jump on the 200 bus which takes you to just outside the hotel.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tampere, Finland", "Title": "“Conveniently located, private parking and more”", "Author": "AnJou_11", "ReviewID": "UR115962833", "Content": "We will definitely be back: swimming pool, excellent breakfast, good rooms, near the Zoo and railway station Zoo, everything neatly wrapped!", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Stockholm", "Title": "“nice breakfast and pool but ...”", "Author": "Kimonzanoi", "ReviewID": "UR115678513", "Content": "Nice breakfast buffé but too crowded around it. A little bit hysterical and stressful when crowded like this. Nice poolarea but there was a male in the ladies shower so it didn´t feel safe. 10 minutes walk from the underground, buses, sighseeing tours and main shopping street. 15 minutes walk from the bus to Airport Tegel. 2 minutes walk to an entrance to the Berliner Zoo. The room was ok but they didn´t recharge our shower creams the last day. There was an insect on the wall in our room. The beds were comfortable and the airconditioning was working well, so we slept very well. The area around the hotel felt safe. Is this a five stars hotel? I am not sure that the hotel is really worth it. It is more like a ****+", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "Nottingham", "Title": "“Excellent in every way”", "Author": "PeterNG", "ReviewID": "UR115483625", "Content": "We booked this hotel on the basis of the other excellent Tripadvisor reviews and were very pleased. Rooms, reception and concierge service, breakfasts, and swimming pool were all as expected. Superb attention to detail in areas such as fresh flowers and presentation of the food. We generally use 4star hotels and at this grading they are faultless. I don't know what 5star regulars expect but, for example, if you want doormen hovering ready to grab your cases and car keys you will be disappointed. The location is good for public transport being on the 200 bus route and with the Zoological Garden rail station and bus terminus nearby. Allow 6-7 euros per person per day to get around by the superb public transport network (this includes getting to and travel within Potsdam, for example). Not so good for finding restaurants within walking distance .", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Hotel has good features and is near train/bus”", "Author": "PerthEngineer", "ReviewID": "UR114974011", "Content": "We chose the hotel because we wanted a comfortable, quiet hotel near the tourist parts of Berlin. It was perfect for this! We don't speak German, however, all the staff spoke impeccable English (and probably many other languages as well.!!) The hotel has a business room with free-to-use computers and a printer. This was a great boon as we could check emails and make onwards bookings while staying within the Hotel.", "Date": "July 3, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Sydney", "Title": "“Ideal base for 4 day visit”", "Author": "ladygolfer19", "ReviewID": "UR114807440", "Content": "We chose this hotel because it has a large pool and quiet location on the 200 bus route from Zoo Station to all the main points of interest. Real bonuses were the quality food in the restaurant and the hotel concierge, who managed to get us into the Reichstag Dome, for which you now have to book.", "Date": "June 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“everything you would expect from a modern hotel”", "Author": "elinasia", "ReviewID": "UR114290478", "Content": "I enjoyed my stay in this hotel. Service was amazing, our room was great, food at breakfast and hotel restaurant was excellent. Swimming pool and spa area is good too, not very big but modern, clean and quite functional. It is walking distance to KAdewe but not so close to main touristic sites. However Berlin's transport is pretty good, had no problem reaching wherever I needed to go. Had a wonderful time there!", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "St. Petersburg, Russia", "Title": "“Nothing to complain about!”", "Author": "Usenko Posted by an Accorhotels.com traveler", "ReviewID": "UR113424379", "Content": "Stayed in this hotel for 3 nights in February 2011. Really nothing to complain about. Everything was excellent. The hotel is located on a side quiet street opposite Berlin Zoo, 10 minutes of walk to U-Bahn (metro) and Bus Terminal. The hotel was recently converted to Pullman from Sofitel. Great lobby, helpful staff on the reception, fabulous SPA area with hammam, sauna and large pool. We lived in the Deluxe Room. This room features free Wi-Fi as well as free mini-bar and Nespresso coffee machine with selection of coffee. 2 big bottles of water are complimentary. And free mini-bar doesn’t mean 2 Cokes and 2 bottle of water. Minibar is fully filled with beer, sparkling wine, juices and snacks refilled daily. Room is nicely decorated with modern but adequate style. There is separate sitting area with 2 chairs and large glass desk. Large bed is fantastic with lots of pillows. We didn’t try breakfast so I have nothing to say about.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Tel-Aviv", "Title": "“Great hotel!”", "Author": "udigold1", "ReviewID": "UR113126563", "Content": "Stayed there for seven nights with my wife on April 2011. What can I say? Room: Had lots of space, new furniture, the bed was super comfortable, best sleep ever! Reception: Very welcoming! Amenities: Pool, Spa, free coffee in the afternoon, 4 computers with internet and a printer. Breakfast: A plethora of food to choose from! But a bit expensive (24 euros per person). Transportation: Just outside the hotel you can take bus No. 200, and No.100 is a street away. U-Bahn is 5-10 minute walk (WittenbergPlatz or Zoologischer Garten) Price: 120 euros per night - that's a bargain for a hotel that's so good! Will definitely stay there in future visits to Berlin! Keep on the with the great work!", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“What a city view and 'wow' they have done a great improvement job”", "Author": "stalenbu", "ReviewID": "UR112225203", "Content": "I knew this Hotel from the 90\"s and it had a different Corporate Owner. Found a good rate through my travel agent so tried it again. Now I must say, this Hotel has improved itself dramatically. Reception is large, open space and staff very friendly. Concierge knows his stuff. Rooms are sufficient, lovely beds, large tv, nice writing desk, effective lighting, bathroom a little small. The gym was perfect for me and the pool is very large for city Hotel Morover, Hotel is close to Zoo and Kurfurstendam but even Potsdammer Platz is not too far walking. There are various parks in front of the Hotel. WiFI is not free but seems very common in Germany.", "Date": "June 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Amman, Jordan", "Title": "“Great location, great business hotel”", "Author": "FabFabFabFab", "ReviewID": "UR109034796", "Content": "Great hotel, centrally located. Very nice beds, very clean, bathroom is a bit small but nice. Nice, state of the art TV station. Very nice view from the room. Bar and restaurant are very nice. Delicious breakfast. Gym is a bit small. Unfortunately no free internet. They have four PC stations from where you can access internet for free. Employees are very nice, super competent and friendly. No iPod docking station in the room. All in all a nice place to stay.", "Date": "May 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Somis, California", "Title": "“Not a four or five star Hotel”", "Author": "Malibuite", "ReviewID": "UR108935038", "Content": "The beds are wonderful, rooms clean, bathrooms are small and tub showers are not very safe for older people. This was one of their best rooms but certainly not even four star rating. Good overnight hotel if you are living out of your suitcase, but hanging closet is 15\" width with eight hangers, not enough for a couple staying five nights. No drawer space, and three small shelves, really quite expensive at 255 Eur per night. When booking breakfast was included, when we arrived the next morning they said it was not! The advertising said complimentary breakfast? It was a pleasant stay but overpriced for what we received. Dr. CT", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oslo", "Title": "“Great hotel with all amenities”", "Author": "OsloKrisa", "ReviewID": "UR107410116", "Content": "We had a fantastic stay at the Pullmann Berlin Schweizerhof. The room was so comfy we stayed in the first night ordering delicious room service food. (The menu is vast and varied) The staff at the hotel are very friendly and corteous, the food is good, excellent breakfast. The hotel also boasts a really relaxing SPA/Pool area with an outdoor sun deck. Everything is modern and inviting. The hotel´s located right in front of the Berlin Zoo, an excellent situation for shopping and a good base for exploring the whole of Berlin. We will be back!", "Date": "May 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great Value for money ...”", "Author": "r_stanzel", "ReviewID": "UR107303851", "Content": ".. easy to find in Berlin by car, excellent location. Car parking could be a bit better organised. If you pay the carpark upfront for a few days, does not necessarily guarantee you a car spot. That was the only somewhat weird thing to notice. Ohter than that, never had anywhere else such a variety of breakfast buffet ever. Was just great. Rooms all new and quiet. Great place for business stay and pleasure.", "Date": "May 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vienna", "Title": "“recommendable hotel”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR103588672", "Content": "the hotel has a very good central location at the Tiergarten, excellent Spa conditions with a large pool, opportunity for jogging in the Tiergarten park close to the hotel, friendly and competent service, for me the bar looks too 'clinical' and is also from its location not a MUST to visit", "Date": "April 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "israel", "Title": "“BELIEVE ME IT'S FOR SURE NO.1 HOTEL IN BERLIN”", "Author": "lipere", "ReviewID": "UR101230872", "Content": "The room is so clean,big and has a great bathroom the breakfast is so great omlets alot of different cheese; capuccino order by the waitress;etc the wellness spa is so great-it has a big pool with gym with an open window to the pool;great sauna. finally the service by the staff is just fantstic, everything we ordered we got we will come back to this hotel for sure!!!!", "Date": "March 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Upgrade from Expedia...”", "Author": "A TripAdvisor Member", "ReviewID": "UR100003019", "Content": "This is a great hotel with a fabulous buffet breakfast (just get a table closer to the food to avoid a long walk). We had to upgrade from the basic Expedia offering, but for 20 euros per night, we got a Nespresso machine, free Internet, and free mini bar. The pool and spa are excellent. Sauna is mixed, so not for the prudish. Would definitely stay here again", "Date": "March 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "limerick", "Title": "“Great hotel poor staff!!!!”", "Author": "ac11_11", "ReviewID": "UR99558147", "Content": "We arrived in the pullman for a two night stay on arrival we were greated by a cocky and arrogant receptionist who gave the impression that young travellers were not welcome she demanded that we show the credit card we booked the hotel with even though this wasn`t stated on purchase,after a full hour of ringing home for the credit card and holder to be confirmed we were allowed to the room. The room was fabulous and really modern with great views of the citys skyscrapers and zoo,hotel is surrounded by lots of tourist shops and nice church plus there is a cool irish bar in the europa center which also has other amenities which was good. Breakfast buffet was nice with a varity of different foods to suit taste. To sum up the pullman is really cool but more of a business hotel and on checking out there wasn`t even a thank or goodbye even though we paid a lot of money to stay. I would recommend the pullman to people who have thick skin and aren`t easily offended.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Wonderful service from Concierge (Sandy) and Reception staff”", "Author": "maeve59", "ReviewID": "UR99454556", "Content": "We are just back from a 3 night stay in this wonderful hotel and would definitely recomment it to others. We found the accommodation very clean and well equipped and were given a lovely room on the 8th floor with a view overlooking the zoo. The breakfast was an amazing buffet. It has a super swimming pool and a well equipped gym and wellness centre. The hotel is well located for sight-seeing and within walking distance of 2 underground stations (5/10 mins). We bought the welcome 3 day travel pass at the airport (E25) and this covered all our transport needs while in Berlin including getting to/from airport. The concierge arranged a private sight-seeing tour (2 1/2 hours) of Berlin by car - highly recommend to others.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Good location, great rooms”", "Author": "Simbaland", "ReviewID": "UR99260891", "Content": "I stayed in a Superior Room, which was spacious in general but clothes storage was insufficient for 2 people. This would be my only complaint about my stay here. The staff have at all times been corteous and helpful (especially at the restaurant, where they made extra effort to make something special at breakfast as I am a vegetarian). The hotel is a 5 minute walk from the Zoo and Aquarium, and a short bus/cab ride from other tourist hotspots like the Brandenburger Tor, Reichstag etc. There is also a great spa with a pool and a 24-hour gym", "Date": "March 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Absolutely fantastic hotel. Who needs the Hilton when you can have the Schweizerhof at half the price!”", "Author": "graykaren", "ReviewID": "UR98256479", "Content": "We used Expedia who came up with a varied selection of hotels. Not having visited Berlin before we were a bit worried what and where we were booking. Well all our fears were put to rest when we arrived. Having taken one train from the airport to the Zoo and then a 5 minute walk to the hotel. It is situated in West Berlin and near the famous shopping area. We purchased a £5 all day, any transport card which was fantastic value and the bus took us on a 5 minute journey to the main tourist area. We were pleased to be in a quieter area at night but a 5 minute walk took you to a fantastic Irish Bar with live music every night and every kind of restaurant you could want. The hotel rooms were spotless and very new with excellent plasma tv and the breakfast was amazing each morning. I never thought you could have a 5 course breakfast but we did. Anything from continental to full English breakfast. Make sure you get the free breakfast in with your deal as you will not need to look at food again until the evening. The other treat was the spa. Fantastic swimming pool, apparently the largest for a hotel in Berlin and a relaxing spa . There did not seem to be any problem with the children using it, all ages had fun. Great after a day of sightseeing. Overall, absolutely fantastic deal in a great 4 star hotel. We looked at the Hilton and Westin Gate which were both a couple of hundred pounds more and this Pullman hotel we feel was although very modern on par with the rest.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bad Kissingen, Germany", "Title": "“Great hotel in the middle of Berlin”", "Author": "sipaq", "ReviewID": "UR97681774", "Content": "* Location The hotel is located in the western part of the city near the Kurfuerstendamm and directly opposite to the Intercontinental Berlin. We arrived there by public transport (S-train from Berlin main station to Berlin Zoo, then Bus 200 to Budapester Straße). From the bus stop it was only 50 meters to the hotel. The Kurfuerstendamm lies in walking distance. With the Bus 200 you can also head directly to various points of interest (e.g. Potsdamer Platz, Friedrichstraße, Alexanderplatz, etc.) * Arrival We were greeted warmly and were already pre-upgraded to a superior room. I requested an additional suite upgrade, which was denied, instead I received an upgrade to a deluxe room, which was few square meters larger than th superior room. It also had a Nespresso coffee machine and we got the minibar for free, which was great. * Room The room was nice, quiet and spacious. Everything was clean and the bed was very comfortable. The Nespresso machine was definitely an upside, as the coffee tastes great. * Bar We got a voucher for a free drink in the bar, which we used on the first evening. The bar is not exceptional in any way, but the staff was very nice and the pricing is definitely below the standard, that one expects from hotel bars in a capital city. We had a snack there (Currywurst - what else in Berlin), which was great and quite a deal. * Neigbourhood As said before, the Kurfuerstendamm and the KaDeWe are both in walking distance. We had a very good (and cheap) breakfast in a small bakery right around the corner on Kurfuerstenstrasse right next to an Europcar car rent station, which I can definitely recommend. * Spa From all the pictures that we saw, the Spa looks great, but we didn't have the time to visit it. We had a very pleasant stay and will definitely come back.", "Date": "February 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "paris", "Title": "“Great breakfast and service”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR96711364", "Content": "Very clean and excellent breakfast, including made to order omelets.", "Date": "February 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“A mixed experience”", "Author": "MichaelofArabia", "ReviewID": "UR94927484", "Content": "Speedy check in, great service from the front desk staff. But the problem are the tiny basic standard rooms. More of an Ibis standard with 5* prices. Service and facilities are great, but the room size/standard does not justify the $$$ you pay.", "Date": "January 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“In a word \"Excellent\"!”", "Author": "tsofli", "ReviewID": "UR93401686", "Content": "New hotel in a very convenient location, very close to the bus stop (bus no 200) which takes you through Berlin, right opposite the Zoo. The breakfast buffet in the morning was just perfect, with a wide variety of cerials, eggs, sausages, fruits etc. The staff was very polite and helpful and spoke English. The room was spacious and very clean and looked brand new. The beds were extremely comfortable, it was like I had never left my bed. I bet everyone has had one of those experiences when you wake up and can't move, so it was a nice surprise to find not only it look comfortable but it was!!! There isn't free internet access in the room but on the second floor there's a connection room with four computers and a printer to print off anything you might want, like a map or something like that. I definitely recommend this hotel !!!!", "Date": "January 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hellerup, Denmark", "Title": "“Great hotel with pricey breakfast”", "Author": "Lunow", "ReviewID": "UR92278628", "Content": "Staying in Pullman Schweizerhof was a quite pleasant experience. If you like modern hotels with stylish minimalistic interior, you will enjoy staying in Schweizerhof. I have stayed there for a single night, so I didn't have a chance of experiencing much more than my room and the breakfast restaurant. My Classic Room on 7th floor, average size, was overlooking Berlin ZOO. I imagine the view at any time of year other than winter is stunning - no tigers or lions spotted this time. The cleaning standard is average, with several hairs spotted in the bathroom upon arrival, the rest of the room was although acceptable. I have little to complain about, when it comes to the amenities. An ironing board would have been great, and not having such in what I would categorize as a business hotel surprises me a bit. What annoyed me was the strangely functioning air conditioning. It isn't possible to set a desired temperature as one would normally do. You can only adjust a preset temperature with 3 steps up and down. This wasn't quite enough for me, as I prefer sleeping in a chilled room. Thankfully the window could be opened, allowing cold and fresh air do the job. Additionally, do yourself a favour and save the 24€ which is the cost of the breakfast. You can easily grab something in a café for a fraction of the price, as eating out in Berlin is very cheap.", "Date": "January 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Lovely hotel”", "Author": "Ericliv Posted by an Accorhotels.com traveler", "ReviewID": "UR91925057", "Content": "Lovely hotel, great location. Nice pool and spa. Be careful of sauna, as key for locker burnt my hand as sauna was so hot. It also melted the coating on the lenses of my glasses!", "Date": "January 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "jcbexleyoh", "Title": "“Recommend it - especially if you stay in quiet spa-side of property”", "Author": "jcbexleyoh", "ReviewID": "UR91340594", "Content": "We spent a week here in December and found the hotel met all our needs quite nicely. Because the weather is cold and often snowy, we wanted a hotel with a pool to warm us. This property has a wonderful large, elegant pool and provides comfortable lounges, robes, slippers and towels. There is also an fitness room overlooking the pool. Our room was near the pool on a part of the hotel which is extremely quiet. Our room was elegantly spare, really comfortable with great beds and club chairs with ottomans. My only complaint is the sheets were stiff and starchy, harsh really on the skin. I plan to let the hotel know of that. We had very good service from the check-in staff, and okay conceirge help. Some were better than others. This hotel does a lot of convention and event business so it does make an independent traveler feel a little lost in the lobby - but we would recommend it for its other assets: great location on main bus line, very close to the Zoo train station, the Kurfustendam shopping area, etc. We did not eat at the property - the restaurant menu was rather odd - and breakfast is expensive for people who just want coffee, cocoa and bread. Around the corner is a French cafe which has excellent breakfasts at much less cost. If you like to swim, want a comfy retreat from the city, and do not mind a large business hotel setting, you will probably enjoy this hotel.", "Date": "January 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "College Station, TX", "Title": "“Great hotel, great location.”", "Author": "cmm218", "ReviewID": "UR91326199", "Content": "The Pullman was a nice place to stay in West Berlin. You are located very near to the Zoo, KaDeWe (the famous department store), many nice shopping areas and centers of public transportation. The breakfast buffet was amazing. Cons: WiFi costs 9 euros per 24 hours!! The business center has 4 computers that you can use for free but we had to wait to get on them every time. The room is nice but the pillows on the bed were very flat. Overall a good place to stay, even for an extended visit.", "Date": "January 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Fredensborg", "Title": "“Excellent hotel near Kurfürsten Strasse and Zoo”", "Author": "DahlFamily", "ReviewID": "UR91179533", "Content": "We stayed with our two children (2 and 4 years) old in one of the suites. The size of the suite is two standard room plus some more. The suite is divided into two where you can put the kids in one end so they can sleep tight without being disturbed. There is even a sliding door. The rooms are completely sound proof so it can be even hard to hear when somebody is knocking on the door. The hotel is just great - very modern - the pool is very big (maybe the largest in Berlin hotels) which is nice so you can play with the kids without disturbing the other guest. There is a sauna, hot stone seating etc. Being a Accor Platinum member I must say that this hotel has a really high service level. The receptionist really went the \"extra mile\" for us. Which was greatly appreciated. Thank you, Nina. We had absolutely nothing to complain about. However, I still believe that Wifi should be free in a suite but it still isn't - but then again you can surf for free in the business center on the 2nd floor. Parking is 20 euros pr. day. Room service is the same price as in the restaurant just with 3,5 euro in extra charge - this is fair enough.", "Date": "December 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Great Hotel, ok location”", "Author": "1dannymac", "ReviewID": "UR87340198", "Content": "We stayed for a weekend trip at the hotel. We were meeting some friends from Germany there, and they had hotel points to use. I would have preferred a room closer to the center of the city, or on the east side. It was a very nice and modern hotel. The breakfast was a bit expensive, so we used some of the nearby restaurants each morning for breakfast. The bar prices were fair though. We were a couple of minutes walk from the S-Bahn line, which made getting into the center and east side pretty easily. Overall, I would recommend it as a place to stay, if you don't mind being a bit outside of the action.", "Date": "November 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "paris", "Title": "“PULLMAN BERLIN”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR85875162", "Content": "Highly recommended! Location, service and comfort unbeatable", "Date": "November 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Gravesend, United Kingdom", "Title": "“Very well run hotel with excellent indoor pool”", "Author": "Sub_three", "ReviewID": "UR85533194", "Content": "Bright modern business hotel near to the zoo and the Tiergarten – we had a mid-week four night stay – most other residents were business and conference types – only a few other pleasure seekers who, like us, were spending their own money and not on expense accounts. Very difficult to find any fault at all – very efficiently run hotel with polished highly courteous staff. We liked: - quick and efficient check in (arrived a little early - room ready and waiting) - bright and airy room (comfortable and quiet) - tea making facility in the room - well equipped bathroom with robes and slippers - comfortable bed - excellent large indoor pool (gym, sauna and steam rooms available also) - drinks in the bar - location (a few minutes walk from the main bus station and S-Bahn and the biggest Irish bar in Berlin) We disliked: - cost of breakfast buffet (opted to use local cafes instead) Overall a good hassle free place to stay.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Excellent hotel”", "Author": "Shosh1000", "ReviewID": "UR82491247", "Content": "Stayed in Berlin in May 2010. Beautiful hotel, well decorated, clean, friendly staff, delicious full breakfast, next to a beautiful park and a large shopping zone, convenient public transportation anywhere you need to go. beautiful pool and fitness room. We were a group of four and all of us loved the hotel. Warmly recommended !", "Date": "October 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great Location”", "Author": "bexie123", "ReviewID": "UR73909106", "Content": "This hotel is great. Good location for restaurants, bars and transport. Staff friendly and helpful.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Very clean and good location”", "Author": "Nastia82", "ReviewID": "UR72388296", "Content": "Really nice hotel. The rooms were very good and the location very convenient. The reception staff could be more helpful though!", "Date": "July 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“The Perfect Hotel for Visiting the city while Relaxing”", "Author": "gloriajones", "ReviewID": "UR71664589", "Content": "My husband and I stayed here for our wedding anniversary and we were very happy with the excellent customer service and facilities available at this hotel. We booked a few months ahead and got a very good deal. On check in they also offered us a 15 Euros coupon to use for drinks/food at their restaurant. Breakfast starts at 6.30 and lasts until midday (perfect for us as we like to take things easy during the weekend) and it is delicious, the variety of bread they offer is amazing! The pool and Spa are also great and we spent there a relaxing Sunday afternoon (they left us use the facilities even after check out). We didn't eat at the restaurant but had a couple of drinks there, nice atmosphere and great mojitos. The location is pretty convenient, just 10 min walk from the train station (zoological garten stop), also bike rental shops are nearby. Riding a bike in Berlin is in our opinion the best visit the city (weather permitting of course) and also very cheap. Pity the don't offer free wi-fi. We'll definitely be back for another weekend!", "Date": "July 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Fantastic hotel”", "Author": "blackswan1", "ReviewID": "UR69449034", "Content": "We stayed in this hotel for 4 nights, at excellent value. We got a special offer, paying €60 each per night for a superior room on the top (9th) floor at the front of the hotel with a fantastic view out over the Tiergarten. This however excluded breakfast, since we thought it was a bit pricey at €24 extra each. There are plenty of cafes nearby that do great breakfasts! The room was very comfortable, as were the beds. They were also very quiet...even though at the front on the main road, no traffic could be heard. They were spotless too, as was the bathroom. Our superior room included robes and slippers which were great for using to go down to the pool in! The only fault i'd have with the room was that the a/c wasn't very effective. Staff were extremely friendly and helpful. We are a same-sex couple and they made us feel very welcome at check-in. Pool staff were also extremely friendly! Pool facilities are exceptional, with a feeling of luxury and high quality. There's a really great sauna/steamroom area with foot baths, a tropical shower and ice basin! Around the pool are comfortable loungers, a sun deck, and a drink and snack service. There is also a small gym, but we didn't use this! The only let down with this hotel was the lack of free wifi. To use the wifi there was a very high charge per day. This seems to be common around berlin however...we only found free wifi in the starbucks cafes...unfortunately! Location is good...10min walk to nearest U-bahn and S-bahn stations.", "Date": "July 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“BEST MATTRESSES I HAVE EVER SLEPT ON!!”", "Author": "thomais", "ReviewID": "UR67810255", "Content": "Apart from their anatomic and relaxing beds, I have to commend on the clean and comfortable shauna facilities, as well as on their luxurious breakfast, and on their clean room. The staff was so proffesional and polite,but too Germanish for us coming from south Europe!! Keep on the good work!", "Date": "June 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Curitiba", "Title": "“Great Place To Stay!!!”", "Author": "WelcomeTur", "ReviewID": "UR67220970", "Content": "I´ve booked This Hotel from booking.com, it was a prepaid stay, so I was a little worried. The Hotel is perfect, the location, the rooms, the staff everything works just fine. Our room was very nice, very good interior design, good bathroom and amenities from Roger & Gallet. The breakfast was a little noisy but works perfectly. In adition to all this good points there´s a very well appointed spa and wellness center. The sauna is great, the swimming pool is huge, doesn´t look like a Hotel pool at all. The Gym with equipments from TechnoGym has a great view to the pool...is a perfect spot to work out!! I´d definitively recommend this Hotel.", "Date": "June 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“service was exceptional”", "Author": "cardiffafterdark", "ReviewID": "UR66845484", "Content": "Having had my luggage delayed, the reception staff were most helpful in organising teeth cleaning & shaving kit. When the luggage eventually turned up it was brought up to the room with the minimum of fuss. The hotel has a pleasant atmosphere especially with regard to the front of house staff who couldn't have been more helpful if they tried. The rest of the staff were courteous and professional as well. The bedroom was adequate,the pool superb,gym nothing special,restaurant overpriced,bar pleasant & quite lively. Overall the hotel definitely added to the quality of my stay in Berlin.", "Date": "June 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berlin", "Title": "“A marvelous Hotel in the Center of the City”", "Author": "Fruehlingsgold13", "ReviewID": "UR66593314", "Content": "Everything is just great. The Staff, the Hotelroom, the Pool, the nice view over the Zoo and just minutes to walk to the biggest shopping streets. The Hotel Pool is the biggest in Berlin Hotels. Choice of Saunas included. Relaxing Area with Newspapers and freshly made Juices. Recptionniste always at your Service!", "Date": "June 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Amsterdam", "Title": "“Great modern hotel with great facilities and breakfast!”", "Author": "ErikHof", "ReviewID": "UR61994375", "Content": "Pullman hotel is a really nice modern hotel with modern spacious rooms. The breakfast of the hotel is really great and the gym and spa/wellness facilities are perfect. The only thing is that the location of the hotel is not great and that the food and drinks in the hotel bar and restaurant are very expensive and the internet as well.", "Date": "April 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“okay i guess”", "Author": "fathead77", "ReviewID": "UR58949282", "Content": "berlin is amazing and the pullman is in a good spot close to the shopping of kurfersterdam and easily accessible to everywhere. the hotel jogged up the prices for the week as there was a convention in town (about 30% higher). rooms were nice, but the bed was terribly uncomfortable, the food/drink expensive and the internet was ridiculously expensive. it did have nice amenities (roger gallet) and the housekeeping staff was fantastic (even if they couldn't speak any english). however, after checking out, i realized i had left some expensive face soap in the room. and when i asked the front desk if anything was left, they said no. which was completely untrue. definitely colored my perception of the hotel. i'd recommend the hotel, but with big trepidations.", "Date": "March 19, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Healdsburg, California", "Title": "“Nice Clean Hotel”", "Author": "Ted95448", "ReviewID": "UR57142482", "Content": "Good location. Nice workout facilities...........................................................................", "Date": "February 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“3rd stay at Pullman Schweizerhof...love this hotel!”", "Author": "SkunkFunk29", "ReviewID": "UR51496001", "Content": "For the last 14 years I've visited Berlin at least once a year...it's one of my favourite city's! Especially the nightlife in Berlin is awesome,but enough other cool things to see and do in this vibrant city! Since 2 years I always stay at the Pullman Schweizerhof which is a former Sofitel hotel. Last week it was my 3rd stay at this hotel and it was great again! The rooms are spacious,stylish with a huge flatscreen TV and the beds are really comfortable!!! Friendly and professional staff at the reception and in the bar. But the big plus of this hotel is their wellness centre...huge swimming pool and very nice hamam,sauna and gym! The whole wellness centre has been renovated last year and is also really stylish!! Never used their restaurant or breakfast so can't say a word about it; except that it is expensive! Only negative thing I can mention is that it's really warm in the hallways! But this hotel is the ideal base to visit Berlin!", "Date": "December 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Basel, Switzerland", "Title": "“absolutely great”", "Author": "jacobo88", "ReviewID": "UR47823592", "Content": "Since you come in you are received with a smile and the attencion you desserved, thats whats make the difference between hotels and first class hotels. What can i say... excellent. Fantastic view to the zoo and just some blocks from the main street kudamm.Great room. Definitely a place to stay next time I stop shoppingin Berlin.", "Date": "October 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "manzanillo colima", "Title": "“Great Pet Friendly Hotel ; Location, Cleanliness, and Affordable”", "Author": "puffpromotions", "ReviewID": "UR46413934", "Content": "We found The Pullman to be off the beaten path, but close enough to walk for shopping, meals, and the zoo. I would highly recommend this hotel, plus, we brought our dog, and we had zero problems. Very pet friendly!", "Date": "October 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent hotel”", "Author": "Zephyrus33", "ReviewID": "UR45740476", "Content": "Modern, comforable hotel with good location close to old centre of West Berlin. Good value as well.", "Date": "October 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "CopenhagenDenmark", "Title": "“Superb...”", "Author": "MadsCopenhagenDK", "ReviewID": "UR37000311", "Content": "Had the pleasure of staying at this Berlin hotel for the first time - and I must say I was pleasantly surprised. Started out good by getting an upgrade when mentionning it was my first visit there. So I was installed on the 9th floor overlooking the Zoo. The entire hotel is either very new or recently refurbished - and it looks great everywhere. The location is also fantastic - only a short 4 min. walk to Kurfürsten Damm and 5 min. to KaDeWe. Couldn't get any better for any sort of visit... I had room service as I don't really want to bother going to a restaurant as a solo traveller - the food was excellent. Well prepared, reasonably priced and served warm - all in all - perfect. Only 2 minor things - 1) The drain in the bath room sink was shut (not blocked - just closed) - and I could not in any way get it out. I found out just on my way to bed and did not bother calling for someone to come repair it at 11 p.m. - but was anoying in the morning. I am sure that if I had called they would have sent someone immediately. The bath room didn't really live up to the rest of the hotel or room... should have been done more exclusively. 2) WLAN is incredibly expensive - I had to pay €25 for a 24 hour acces - and not that great bandwithd. Radisson hotels provides WLAN for free - something every business hotel should do. Paying that much money is robbery... Breakfast buffet was plentyful and good. Cooks are standing by to cook fresh omelets or different variations of scrambled eggs at your desire. Other than that there is everything you would want on a breakfast buffet. I give this hotel my strongest recommendation for any sort of travel - be it romance (plenty of possibilities of pampering - spa, massages, etc.), business or whatever.", "Date": "August 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Manchester,England", "Title": "“First Class Hi-Tech Pullman”", "Author": "DavidMooney", "ReviewID": "UR34719382", "Content": "Great hotel in a great location, just behind the Irish Bar in central Berlin. Room and bathroom good size and very modern,good breakfast and excellent value for money.Well worth a visit.", "Date": "July 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "US", "Title": "“A good stay”", "Author": "JG-JG8", "ReviewID": "UR34510602", "Content": "The Pullman is a good hotel for business visits. The staff is very accomodating of one's needs. When I arived late at night, I was welcome by the porter who was smiling and full of energy and ready to help. The receptions staff were the same despite the very late hour. The breakfast excellent andd we had a meeting at the hotel that was well organised in a very nice and fres meeting room. Overall a good stay.", "Date": "July 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Belo Horizonte, MG", "Title": "“excelent Cost/benefice”", "Author": "mfgn", "ReviewID": "UR32291297", "Content": "Stay there 3 nights after a cuise in the baltic sea. Luxury Hotel with excelent cost. The SPA facilities are very beautiful. The staff is very profissional and friendly.", "Date": "June 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Lovely hotel - good location”", "Author": "Livi_Looby", "ReviewID": "UR31223525", "Content": "Myself and my husband spent 3 nights at this hotel, having got a very reasonable deal on a deluxe room. (approx 300 Euros for the entire stay) The hotel is lovely and clean. I was a little apprehensive before going to this hotel as I am a light sleeper and often find city hotels noisy. However, I am pleased to say this was not a problem. (However we were situated on the 9th floor at the back so am unable to say if this is the same throughout the hotel). Rooms were very modern, white with a huge plasma TV, however there were only 2 English chanels (and by the end was a bit MTV and news'd out) - still not there to watch TV. The spa facilities were lovely, although a little confusing. When you first enter the sauna area it appears that it is women only (as the entrance to the sauna is through the ladies changing room). However, I can confirm it is unisex as men also get to the same sauna by going through there changing room. I don' think it was just me as one guy, wondered in completely starkers!!!! Can't comment on the food as we were room only. All I would say is that it was a little expensive 17-22 Euros per person and we had no problems and saved ourselves a fortune eating out. Service was good and staff all appeared polite and friendly We also found the location great, it is situated a short walk from the Zoo (which we could recommend) and the aquarium and its within walking distance of the railway station (Zoologischer Garten). There are also many restaurants and bars within the vicinity. We certainly were able to do lots of sightseeing and found the public transport fantastic. All in an all a great comfortable, convenient stay.", "Date": "May 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Leiden, Paises Bajos", "Title": "“The great hotel that you expect!”", "Author": "NdeA", "ReviewID": "UR30169418", "Content": "Perfect hotel. Everything new. Nice and comfortable room. Excellent breakfast, full of delicious and assorted food. Very professional staff. Spectacular swimming pool and spa. The hotel provides you everything for the bathroom (soap, shampoo...) and bathrobes and slippers for the spa. You can also use the computers they have for free during 1 hour. Ideal for your flight check in. The only point I can have some doubts is the location. Berlin is huge and the hotel is located in the West side. However, there are very good connections 5 min walking from the hotel. I'll repeat it.", "Date": "May 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Watford, UK", "Title": "“Great service in lovely hotel”", "Author": "Gazza24", "ReviewID": "UR28238401", "Content": "Couldn't really fault the Pullman Berlin and had a great stay. Very friendly reception staff made the check in nice and quick and we were given a lovely room on the 5th floor overlooking the zoo. Room was modern and spotless, although one thing i would say was the air-con was well needed as did get very hot in the room. Had a drink in the bar every evening and it did get quite busy, but the efficient bar staff were always on hand to keep us stocked with drinks... although a tad expensive... on the current exchange rate a glass of wine was costing nearly £8!! Check out again was speedy and friendly and there was a no-problem approach to any query we had. Would def stay here again should i return to Berlin!", "Date": "April 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Netherlands", "Title": "“Great location, good value !”", "Author": "ElisabetNetherlands", "ReviewID": "UR27182811", "Content": "Just returned from a three nights stay at the Pullman Berlin. Excellent standard, light and airy rooms. Pullman beds are among the best I ever slept in ! White, crisp and clean, just what one needs after a long day in the city. The breakfast is very good, lots of fresh produce and attentive staff ! Great location, just a stone's throw from Kurfürstendamm with the great KaDeWe! A tip: forget elegant shoes, instead take your walkingshoes ! The distances are huge ! Defenitly recommended if you like cool elegance and comfort.", "Date": "March 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Donabate, Dublin, Ireland", "Title": "“Great Location with Great Leisure Facilities on a Great Bus Route”", "Author": "Traveling-Wilburys3", "ReviewID": "UR26412673", "Content": "I stayed with my fellow travelling friends in the Pullman Berlin Schweizerhof on a Leisure and culture break of Berlin for 3 nites. The hotel did not seem busy and the staff were attentive, well presented and pleasant with very good English. The location of the hotel is situated excellently considering the size of the city where everything is not together – IE – the city is very large with no real centre and thus spread out; So one needs to be on a bus route! This hotel is on a great bus route if not the best bus line and the 200 route goes outside the hotel and basically links west Berlin where the hotel is situated to east Berlin (old town). In fact the no. 200 bus goes the same way as the tour bus (in part). They also go every 10 mins and cost 2.50euro EW. They are safe and clean. The concierge in the hotel can organise tickets which you have to validate on the bus (although we did not realise this and effectively used it again the second nite). The location is opposite the Berlin Zoo and the beginning of the shopping area - Kurfürstendamm . There is a great department store – “KaDeWe” where they serve excellent food in various small boutique restaurants on the top floor whilst providing all the usual top international designers brands on the other 6 floor and refined palates will find it hard to choose from the some 33,000 delicacies from all corners of the world. Other good locations for Lunch would be the inspiring Italian Chain (german owned) called Vapiano which are located off the Ku-damn or around the corner from the Ritz Carlton which is located in the area between this hotel and the old town (east berlin) in an area know as Potsdamer Platz. However, back to the Pullman Berlin Schweizerhof which is the subject of this review. Now, the best thing about this hotel is the Leisure Centre with Spa facilities including showers and thermal treatments all of which are free. There is a full menu of massage and treatments which appear very reasonably priced. The pool is effectively the highlight of the hotel as its a great size with a luxury setting transposed with mood lighting and relaxing seating circumventing the pool. Assistance around the pool again like the lobby is excellent and professional which is courtesy of Mr. Butlins who was our leisure assistant for most of the evenings that we visited him. There is a discreet lift down to the pool area from the room which is excellent as it allows for one to use the complimentary robe and slippers from the room. The rooms themselves are well equipped (flat screen TV with in house movies and satellite channels), Internet access and minibar safe) and laid out. The only fault (if sharing) they are a little on the small side but the corridor area will always make up for this. The air conditioning is a little poor but might have been to do with the fact that we couldn't work it or two large lads in one rooms. There is a small little bar in the lobby that is smart and good place to end the nite after being to the Matrix or one of the other great nite spots in Berlin. There is a restaurant in the hotel which looks good but I cant comment on it, as we did not eat there - nothing to do with the hotel but merely because it better to go out and about. We went to the old town (Alexander Platz / TV tower area or overall the Mite area) in an area called the Nikolai quarter . This is the very core of old Berlin or, strictly speaking, of the eastern half of Cölln-Berlin, on the site of the oldest known settlement on a ford around the Nikolaikirche (St. Nicholas' Church). The Nikolaiviertel as its locally known as presents a stark contrast to the open spaces on its northern side between the Palace of the Republic and the Television Tower and contains great little restaurants, coffee shops and bars. However, its not the “temple bar” area in Dublin but starkly different with an emphasis more on romantics’ given its location along the River Spree. There is a fantastic French restaurant facing the river spree between a bar called Brauhaus Georgebrou and the next bridge up toward Ephraims coffee shop(about 50m) I would recommend the French onion soup and fantastic meat dishes with great collection of good French reds. So to sum up, a great city with some great sights with no better base to explore from than the Pullman Berlin Schweizerhof. Enjoy or as they say in Berlin - Hab Spaß! (JD)", "Date": "March 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "USA", "Title": "“modern hotel with relaxing wellness area”", "Author": "reddobie", "ReviewID": "UR26295057", "Content": "Let me start by saying I would have given this hotel 5 stars, however, the fees for phone calls were outrageous...very difficult if you are an american, needing to call home to US..that said...let me move on to the review: The hotel is in a good location...not a far walk at all to the subway zoo station, or the Kudam station...Berlin is a cool city, very clean...the hotel is close to a money exchange store, at the \"Euro Center\" which is a very large indoor \"mall\" area...close to some nice restaurants, especially Italian restaurants, some neat little bars..overall we thought the prices in the area were good, especially for wines...most everyone spoke english...there are several nice stores, and you are maybe two streets fromt the Kudam, which is a street with restaurants and stores... The Hotel: not on a overally busy street. Very modern look to it...nicely decorated...impressive actually, front desk staff very nice...the rooms are a bit smallish, but not bad...very clean and modern looking...flat screen TV that you can program for english...it has a speaker in the bathroom as well...our room had no bureau!, but my brother's room did...he was a single, and we were two people with a lot of clothes, and one small closet for them, and a couple of shelf areas...I loved the tea/coffee drawer...HINT: you must pull the drawer all the way out, for the teapot to turn on...electric kettle...was a nice touch...there is a mini bar, but it was way over-priced...we simply removed some items, but put our own wine, milk and snacks in it, and no one ever said anything to us...the bathroom was roomy, however the blowdryer was terrible, bring your own/with adapter...There was a charge for internet use, seemed high, so we didn't use it, but the room had a desk that was equipped for it. The shower was great, always hot water, weird shower door, but it worked. They give you slippers/bathrobe, which we discovered is what they want you to use in the wellness area...we used the bathrobe, and our flip flops... Maid Service: outstanding...we tipped the maid third day we were there, as she did a great job..I left her messages in German for extra sugar, tea bags, and was always accomodated...the linens were very crisp and clean...the beds were fine...the pillows are okay, kind of mushy...I must mention the light situation, as no one at desk mentioned how to keep lights on, I just knew from reading it on trip advisor's forum from Mexico...you must keep one of your room keys in the slot by the door at all times while in the room to keep the lights on...very quiet room...never heard a peep in hallway etc...as others have mentioned, the rooms get too warm...and we were there end of Feb/beginning of March...we needed the A/C on, and the thermostat in the room only went just so far..we needed to keep window opened but it was kind of damp and nasty weather a few nights, so that wasn't good...we told front desk and they said they would adjust it, didn't seem to make too much difference, so when we left, we would leave both windows open to let some air in...also the beds don't have sheets..there is a bottom sheet but no sheet to cover you, you are supposed to use the feather bed to cover you, but it was so stuffy in room that this was way too hot, so we would remove the feather bed from the cover, and use the cover as a sheet...these were just some things we had to get used to, I haven't been to europe in a long time, and I guess I'm \"americanized\" so it was an adjustment...but I really liked the room, and just loved the tea kettle set up...overall impression of room/hallways/hotel is really nice pretty modern looking hotel...great little bar area...the happy hour is from 9PM to 10PM, and you can get some good prices on cosmos there, which were very good...we did not eat at the hotel, it seemed pretty pricey...breakfast was inclulded with our rate, and it was the best breakfast I've ever been to in any hotel...they had everything you could think of...including a station that made crepes, omelettes etc...a nice juice set up...and the rolls were to die for...best rolls I've ever had...if you can get that included in your rate, what a bargain, as its pretty expensive to pay for separate... The subway: very user friendly system, color coded, maps are avail at the little stores inside the stations, they have the ones with the larger print...easy to read, easy to use, no problems, and pretty clean...we purchased a pass for the week, and it included unlimited subway, train, bus use...which worked for us, as my brother's apt was outside Berlin city... Wellness Centre: Very nicely done..beautiful indoor pool, supposedly 82 F, but I will tell you when you first dip in, it seems kind of cold...you adjust pretty quickly, but I would like to have seen it much warmer..there is no hot tub so that could be disappointing for some...there is a great steam room, best I've ever used..it has a eucylptus infusion in it, which when first entered it is overpowering, but give it a chance, it was fantastic..my brother/sister had colds, and they said it was great for clearing their system...there are two rain showers then to wash off in, which were nice and toasty...we saw the ice, wasn't interested in it...and the foot spas, we didn't use those either...now if you go directly into pool after steam room, you will freeze going into that pool water...you will get used to it, but I really think they should up the temperature...we asked, and were told they couldn't...but nonetheless, the pool is pretty, and once you adjust to the temp, its quite nice to float, or swim in...the loungers at the pool were the most comfortable loungers ever, we fell asleep on them...its a very relaxing area...there is a cool upstairs area as well where you can read...and access an outdoor deck that was pretty, no chairs, but it was winter...The wellness area is so pretty and relaxing that the pool water really didn't matter too much in the end, as we used it everyday and enjoyed every bit of it... The lobby has a bowl of granny smith apples that you can take...so our overall impression of the hotel was I would stay there again, now that I am aware of the phone thing...which was really a headache for the first few days...our cells did not work, and the only way to reasonably call the US for us, was to walk to a \"phone store\" and use the phones in there, that was cheap...we bought a phone card, and at the end of our stay the hotel charged us 3.50 euro each time we used it from the room...I wish the hotel had told us that beforehand, as I asked them about the phone store to begin with.. that was a shocker to the tune of roughly 350.00 US dollars tacked onto our bill...we are trying to talk to hotel about that now, if they credit us some of that back then my rating would go up to 5 stars...I think that is way overpriced to charge tourists...Overall great modern pretty hotel, great area...fantastic wellness area....great stay...", "Date": "March 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent”", "Author": "AHotelier", "ReviewID": "UR26294263", "Content": "I stayed at the Pullman Berlin for business. I chose the hotel as I had heard good things about it and knew someone who recommended it to me. I have to admit that the hotel was very good in all aspects, thus this review will be short & sweet. The hotel location is very good; close to the Zoo, train & bus stations & also to the Europa Centre & the Ku'Dam. The room was good, facing the courtyard, spacious, clean & well laid out. The only drawbacks were that the \"Kingsize\" bed was two single pushed together so not very comfortable. The towels in the bathroom were tiny..... Seriously! Breakfast is very good & well worth the €24, only if you have time to enjoy it to the full though! The spa was 1st class with a great variety of treatments, it's unfortunate that I did not have time to experience any. Staffwise they were all very friendly and apart from quite a long wait for the requested Iron & board (none in the room) & the small towels, I have no complaints. Berlin is a great city & I will be visiting again & yes, I will stay @ the Pullman!", "Date": "March 16, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Germany", "Title": "“Great Value Proposition”", "Author": "aygen", "ReviewID": "UR25101408", "Content": "I stayed at Pullmann for one night in February. I travel to Berlin frequently and stayed at several different 4/ 5 star hotels. Due to my experience Pullmann is the best value for the price. I booked a deluxe room. The room is very stylish, modern and good size. The Spa is newly renovated and the facilities are great. It has the biggest closed hotel swimming pool in Berlin. Very central location. The service is out-standing. I believe I found my hotel in Berlin!", "Date": "February 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fredensborg", "Title": "“Great hotel in the heart of Berlin with large spa and pool area”", "Author": "DahlFamily", "ReviewID": "UR22720235", "Content": "Having stayed at the Schweizerhof several times it just keeps getting better. The new spa and pool area with massage is a must-try. An hours massage is about 65 euros. Do try the XENIA restaurant - it is very very good (a little expensive but worth it)! Also the food in the bar is good! We have absolutly no complaints - everything is perfect - well maybe the Internet charge is too expensive. We will definitely stay at the hotel again.", "Date": "December 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Nice Hotel. Nothing real special though.”", "Author": "tequilatamm", "ReviewID": "UR20256028", "Content": "We stayed at the Sofitel Berlin Schweizerhof in September... in fact, we check out tomorrow! We are in room 706 which is a room facing the courtyard. We gathered from reviews of the hotel that the courtyard view was prettier and more quiet. It's not particularly pretty, as it faces on to another office building with a few trees in between, but it is perhaps more quiet than facing the street side. My first impression of the Schweizerhof is that it didn't look as nice in person as it did in the photos... it looks much more like one of Accor's lesser chains, such as a Novotel, however the feel is a bit more elegant. There were several conferences going on over the weekend that we have been here, and at nearly all times of day, the lobby was crowded with people and receptions. I gather from the number of breakfasts and lunches, etc., that were setup in the lobby itself, they don't have much space in other areas to accommodate such things. This was a little bit annoying, as you had to weave through the crowds to get to and from the elevator when going/coming. However, it also gave the hotel a festive feel, so maybe in some ways it was good. One of our big complaints was with the climate control in the room. The room would get really stuffy in the early morning and stay that way until we returned in the evening, when the winter weather had cooled things off. When we enquired, we were told that, \"Oh, you don't need air conditioning in the winter, so we've turned it off.\" However, the windows only open a slight bit, not enough to cool off the room, so after some insistence by us, reception contacted maintenance who supposedly came up to the room while we were out for the day and turned the air conditioning back on in our room. This seemed to work as the room felt cooler when we got back for the day, but once again, around 4 or 5am, it got really stuffy. For the third night of our stay, we asked to sign the obligatory waiver that we would not hold the hotel responsible if we jumped out the windows, were they to unlock them for us. They promptly, after that, sent someone up with a key to unlock the windows so we could open them all the way. The temperature is much cooler this evening, and will definitely make for nicer sleeping. I am now very happy we have the courtyard side, as sleeping with windows open on the street side would indeed be noisy! So anyway, climate control was a problem, however, the hotel was rather prompt at dealing with all our requests. The pillows were also a disappointment... nearly... nonexistent feeling. Our heads sink in to them and disappear into the matress. Tonight, we have requested a third pillow each, which was promptly delivered, and this will hopefully help the situation. A small complaint, but better pillows that aren't so hollow feeling would be nice too. Now for some of the good things. The hotel has what looks like a whole new \"wellness\" area, accessed from an internal lift well, so that you don't have to take the general elevator to get to it. The pool is large and although not as warm as we would have liked it to be, warm enough to swim in or take a dip after a long day out shopping and sightseeing. The pool is open until 10pm, which gives one time to go to it after a day out, which is also nice. It is manned by one staff in the evenings who always greets you nicely and offers towels, lockers, anything else you might want. There were nice lounges, and a bar that looked to serve fruit drinks and coffee/espresso, although not that time of the evening. There was an upstairs area called a \"relax\" area, which appeared to have a sundeck off of it, although we also didn't use this. The gym looked very nice, with all the normal equipment, but very modern. A few of each type of machine. Had we not walked so much I would have gladly made use of this. There are mens and womens locker rooms, and off of these, there is another common area which contains some pretty neat stuff. There was no jacuzzi, but there were both a wet steam room and a sauna. I love wet heat, and the steam room was one of the best I've ever been in... nice configuration, and lots of steam, with water hoses to make more steam when needed. In addition, in this area, there were two shower wells. One had no less than 7 shower outlets... some coming at all levels off the wall, plus an overhead rose. Next to it was an overhead \"rainforest\" shower, with glowing lights. Very nice. In addition to all this, there was an icemaker area in the wall which generated \"snow\" style ice, so you could cool yourself down after heating yourself up by using the \"snow\". But perhaps best of all was the \"foot bath\" area. A heated, tiled seat area, which had two foot basins at it. Put the funny looking plug in, fill up with water and let run. When the water gets to the top of the plug, it keeps draining at that level, so you can have a continuous flow of hot water on your feet, to soak in. FANTASTIC after walking around Berlin all day! I smuggled my camera in and took photos, so see the traveler photos attached for pictures of all this. Another thing I really liked about the room was the heated towel rail in the bathroom. We needed to do some hand wash, and this rail served a great purpose in drying our clothes very quickly! The shower head on the other hand didn't have the strongest stream of water ever and I had to take long showers to get all the soap out! We had breakfast included in our rate, and were pleasantly surprised at the freshness and tastiness of it. All of the \"European\" style breakfast items were quite fresh and nice tasting: Cold cuts, bread, cream cheese, cheese, etc. There were also hot dishes such as scrambled eggs, potatoes, a few kinds of sausages, etc. There was also a rather large selection of yoghurts and fruits which, if this is your thing, would have given you great choice of flavours! There was a cook who was ready to make you omelettes or crepes as you liked, and there were also thin waffles that had been previously made laid out for the taking. In addition, lots of breads and juices. All in all, not the most astounding breakfast I'd ever had at a hotel, but certainly right up there with the good ones. As far as location of the hotel, Berlin is a strange city, very spread out. The hotel is next to the zoo, about a 10 minute walk from Zoo Station where you can take the U & S trains, and not too much further to Kurfurstendamm, one of the big shopping areas. If these are what you want to be near, then the location is good, although there are similar hotels even nearer. If I had it to do over again, I might consider something like the Radisson, which is near museum island, but that's just me. I certainly wouldn't rule out this hotel, as it was a nice, solid stay, had friendly staff and all the amenities.", "Date": "September 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Haslemere, United Kingdom", "Title": "“good hotel in good location”", "Author": "sandysviews", "ReviewID": "UR20108025", "Content": "We stayed at the sofitel for two days on a jolly to Berlin. One thing we discovered very quickly that in Berlin the hotel you choose is all about location, there are some places which may have great reviews for the hotel but the location could be right oppposite a building site or miles from the nearest bars and restaurants, or just in the wrong part of town. Berlin has an awful lot of construction going on so choose carefully. This place is in a pretty excellent location really, right opposite the Zoo, specify a courtyard facing room if you want quiet, there is quite a busy road going past the front of the hotel, Across the busy road is the Zoo, you really want a room at the back of the hotel rather than at the front. The hotel is about 5 minutes walk from the famous bombed out church and the start of the K'dam, also 5 minutes walk is Ka De We which is the 2nd the biggest department store in Europe after Harrods. East Berlin centre is about 15 mins by taxi (there is a rank at the front of the hotel) The hotel itself is comfortable and well equipped with a very good range of spa treatments, the room we had was quite large and the only complaint we have is that the bath towels are very small, The goodies in the bathroom are very high quaility. The bar is quite small but serves everything you need at usual hotel prices. We didnt try the restaurant as we prefer to eat out but it seemed quite nice and very popular. The staff are efficient and very polite and helpful. All in all a perfectly good nice hotel in a very good location which as I said before is everything in Berlin. Top tip: if you fly in and out of Tegel airport dont go through the security and departures gates until you are ready to fly as there is Nothing on the other side of security, just gates and seats. small duty free in a cabin, I would definately stay at the sofitel again rather than risk a hotel in the wrong place which would seriously dent your enjoyment of a short stay", "Date": "September 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“A Great Stay”", "Author": "treeman", "ReviewID": "UR17424120", "Content": "I stayed at the Sofitel in Berlin on a business trip with my children. It was recommended by a business contact. It is a wonderful, modern hotel. The pool was closed for repair, but we did not miss it. The buffet breakfast was included in our rate and was fabulous - very gourmet. Quite expensive, however, if purchased separately. We had a \"pricey\" lunch there upon arrival, but it was wonderfully served and delicious. The food had an oriental flair - something unexpected by us, being in Germany. The beds and rooms were quite nice and comfortable, and the staff very helpful. The hotel is across from the Tiergarten which is a wonderful park. Also near a major shopping district and within comfortable walking distance to the subways and busses. I have made arrangements for my family to stay there again this summer when we return.", "Date": "July 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great location, indulgent breakfasts”", "Author": "GB1976", "ReviewID": "UR15074271", "Content": "This is the third time I have stayed in this hotel and it has been very consistent. We have always gone for a garden view room, which actually over looks the zoo, so you can see the herons nesting and a few other animals. It is a short walk from the zoo and the main shopping streets, although the nearest station can be a bit dodgy at night. The room isn't that big, but tastefully decorated in a modern but neutral way. The bathroom is lovely, with a feeling of quality about it. There is a cocktail bar on the ground floor which offers some great drinks, which often tend to be ice-heavy, making them poor value for the €9 or so that they cost. They do have a \"Liquid Kitchen\" section of the menu, with cocktails using basil or tarragon - must be tried! Unless it's included in your roomrate, breakfast is an additional €23 per person, which can really whack up your bill if you stay for a few days. But always feels worth it. As well as ham, cheese, bread, fruit and cooked breakfast, they also can also cook your omelettes or crepes to order. Crepe with nutella being my favourite! There are plenty of staff and the food is frequently replenished.", "Date": "April 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good location, great rooms”", "Author": "garrad", "ReviewID": "UR12740995", "Content": "Great hotel, in great location. Breakfast was very good. Rooms were spacious. Spa was nice too. This hotel is also close to one of the gay areas, so it was very handy. I would definitely stay here again.", "Date": "January 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Essex", "Title": "“Good location, friendly staff”", "Author": "bigbadjoe", "ReviewID": "UR11498126", "Content": "Sadly we only stayed one night in the hotel as we were making a quick trip over to see the Christmas Markets. The hotel is about 5 min walk from the Zoological Gardens Station and we arrived early in the morning, way to early to check in. We decided to drop our bags at the hotel and the friendly staff assured us that our bags would be waiting for us in our room when we returned later in the afternoon. We had booked a Superior Double Room (Courtyard side) and were not disappointed. The room was quite big, clean and even had an inkjet printer in it should we want to connect it up to a laptop! The bathroom was great, she was impressed by the Roger & Gallet toiletries. Good shower over a nice slightly wider than average bathtub, 2 sets of slippers, but only 1 bathrobe. The bed was in fact 2 singles pushed together with lovely seperate duvets so no nocturnal fighting was needed. Although some people might find them too soft, they were very welcome after a very long day of travelling and shopping. The room itself was a little too warm for our liking so we tried the airconditioning which turned out to be far too noisy. Ah-ha, didn't the hotel website advertise in the list of room facilities: \"Windows that open\"? Don't be fooled by this one. FIrstly, the aircon turns itself off when you crack open the window (which is a good thing to do), and secondly, cracking open the window is all you can do. The windows open from the top approx 3 inches but it turned out to be sufficient for us and brought the room temperature down to a more acceptable level. We did not eat in the hotel, so sadly cannot comment on the eating facilities or quality thereof.", "Date": "December 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "toronto, canada", "Title": "“Loved the hotel”", "Author": "Brandie13", "ReviewID": "UR10006557", "Content": "This is a great hotel for everyone. The rooms are really sound proof and roomy. We never heard anyone and were traveling with a baby so it was important. The fitness centre was under construction but it was no trouble to use the Intercontinental across the street. The staff was really friendly all-around. We were really happy with the hotel and the area. Great for shopping of course and quiet street 2 minutes from the zoo and 5 minutes from big-time shopping. Highly Recommend!!", "Date": "September 26, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“A comfortable great experience”", "Author": "Janice0324", "ReviewID": "UR8718527", "Content": "We stayed at the Sofitel Berlin Schweizerhof In the City Center and it was a great choice. We were near the Great Berlin Zoo and the Shopping Street that has so many wonderful shops and Restaurants. We booked a City tour through the Hotel and were picked up at the Hotel and ended our tour nearby. It was a very nice tour of the New Berlin and well narrated with stops at Checkpoint Charlie and The Brandenburg Gate. We were told the History of the new buildings that were rebuilt after the War. The Hotel is very clean, comfortable and quiet and they go out of their way to help with most employee's speaking some English. When we called the Front Desk they answered in English with our Surname which made it easy for us to communicate and anything we ask for we were given immediate attention. The food at the Hotel is excellant and we order a few meals that were not on the menu..If they can accomodate you, they will.. We had a wonderful stay at this Hotel. Janice and Richard Stewart", "Date": "September 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Excellent hotel”", "Author": "Tygaman", "ReviewID": "UR8251067", "Content": "The hotel was located opposite the Berlin Zoo and a 5 minute walk from the Zoo Garden station. The room was average size and clean and bright with views over the zoo and across to the Reichstag in the distance. The staff were very friendly, attentive and they could not be faulted. Breakfast was very good, especially the nutella crepes you could order. The hotel also puts out coffee and croissants for people catching early flights out of Berlin from 4am in the morning for no charge which was much appreciated as we flew out of Berlin at 6am. The hotel also had an large indoor pool that was free to use. Overall, the hotel was excellent and I would definitely stay here again.", "Date": "July 29, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Hotel with style”", "Author": "TravellingCarlito", "ReviewID": "UR8120665", "Content": "The hotel is a modern establishment, designed in a contemporary style. The lobby is large and spacious, with plenty of comfortable lounges in case you have to wait to check in. Some apples wait for you at the check in desk if you feel the need to nibble. The staff were very polite and always greet you with a smile. They are very helpful in giving advice on the surrounding area. The room is very chic, continuing the contemporary design in the layout. A plush and comfortable bed awaited us in our room, of which we made instant use. No shortage of space inside, necessary for us since we had so much luggage after spending days of shopping throughout Europe. All the modern conveniences were present in our room and bathroom. The room was clean and maintained by housekeeping to a high standard. The hotel is conveniently located near the Berlin Zoo. The train station is right next to the zoo. For shopaholics like us, the hotel served our needs, as around the corner the KaDeWe department store was nearby, as well as a major shopping strip. The cinemas are also located near the zoo. All you need is here at this hotel and is highly recommended even for tourists in Berlin.", "Date": "July 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "South Wales", "Title": "“All good, superb selection at breakfast”", "Author": "Mrs-CSouthWales", "ReviewID": "UR7756085", "Content": "Myself and three friends stayed for three nights and thought the rooms, food, and service all to be excellent. The hotel location is very well placed for public transport, the number 200 bus stops almost outside (the one you need for the Brandenburg Gate, Reichstag etc). Zoological train/bus/underground station about a (good) 10 minute walk. We didn't have time to use the pool but did eat in the restaurant and had an excellent meal (they were prepared to let us mix choices from the bar menu and the restaurant menu). The choice from the buffet at breakfast was vast. We also enjoyed the biscuits/chocolates that came when we ordered tea/coffee in the bar. We bought Welcome Travel tickets at the Concierge desk which also came with a booklet for discounts on many attractions. The show at the Friedrichstadtpalast was amazing for its technical effects alone, even if you cannot speak German. Would recommend taking a walking tour of the main parts of the city as we discovered a lot of what you see is not what it seems - some old buildings are less than 20 years old!! Plus our guide gave us lots of hints and tips on further things to see and do.", "Date": "June 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good conference hotel”", "Author": "Pardo", "ReviewID": "UR7624843", "Content": "I was here for a 3 day conference in April 2007, the hotel being booked centrally by the organisers. Rooms were spacious and comfortable with good quality bathroom and amenities. The top floor had good views over the park and zoo area from my section of the hotel. Food was included in our rate and buffet in style. Breakfast was very good with plenty of selection for all tastes. The location was close to Zoo station for S-Bahn, underground and busses. I would allow 10-15 minutes walk to the station, from where Berlin is very well served by an efficient and regular public transport network. Ku'damm shopping is a similar walk time from the hotel. Staff were multilingual, helpful and friendly.", "Date": "May 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "-", "Title": "“Great Hotel & Service, Pleasant Stay”", "Author": "PrincessRenée", "ReviewID": "UR6019487", "Content": "We had a pleasant stay at the Dorint Sofitel Schweizerhof. The hotel looked rather understated and plain, not in line with the modern, stylish \"Berlin\" look . However it made up for that with its excellent service and value. The bed was very comfortable, the bathroom clean with great toiletries. We booked the rate that included the breakfast and were thrilled because the breaskfast was delicious, they served Nutella crepes!! Enough said! Room service was superb, I've had the best ever ceasar salad here. After a long day's walk it was great to come back and enjoy the (huge) pool and sauna. Despite the plain and unremarkable look of the spa, the massages were great. I recommend the reflexology massage, divine! The hotel's located on a quiet street near the zoo and aquarium. There's a bus stop right out front and the subway station is 5 minutes away.", "Date": "October 27, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Danville, California", "Title": "“Nice Place”", "Author": "uskuhlmans", "ReviewID": "UR5777351", "Content": "I satyed four nights at the hotel for a conference and found it to be a fine establishment. I was in a distant section that made access to the lobby and conference section quite a hike but was near to the spa and pool which proved to be an advantage. The pool is immense and, as a swimmer, was most welcome. The food was tasty and well presented and the location was very convenient for access to lots of transportation and local activities.", "Date": "September 7, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Hamburg", "Title": "“Very nice hotel, really great service”", "Author": "Cissy113", "ReviewID": "UR5774944", "Content": "We stayed at this hotel during the Berlin film festival in 2006 and managed to get an amazing deal of €80 through the Accor Hotels website. Rooms are in line with what you would expect from a four star hotel: clean, reasonably spacious, modern and with little extras such as bath robes. What really stuck out though was the service at the hotel. We arrived at 9am and were immediately given a room. Obviously, this was only possible because the hotel was not fully booked, but we were still impressed. Also, my friend got sick during our stay and everyone was really helpful, bringing up chicken noodle soup, even though that was not on the room service menu, and their laundry service was also extremely prompt, washing and returning trousers the same evening. Staff at the front desk and the concierge were also helpful. They sell day tickets for public transport right there, which is very convenient. There is a bus stop right in front of the hotel that takes you to Potsdamer Platz in about 15 minutes. Though the hotel is in a quiet street, it is only two blocks to the Kurfürstendamm (the main shopping street), which is very convenient, and the underground station is about a 10 minute walk away. In conclusion, this is a very nice hotel that you can often get a very good deal on in a safe neighbourhood. It is close to shopping and public transport, even if it's not really in the middle of things, so if having lots of trendy bars around is important to you, you should probably choose a different hotel.", "Date": "September 6, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Great hotel”", "Author": "Countryphile", "ReviewID": "UR5613989", "Content": "This is a great hotel – and really good value. Our original stay cost us 89 Euro per night for the 2 of us, including breakfast! The room was clean, with a comfortable bed and nice bathroom. The breakfast buffet was good since there was something for everyone with a good range of hot and cold items. We had one evening meal in the hotel and, while not cheap, it was the best meal we had while in Berlin. The thing that really made the hotel for me was the staff who were incredibly helpful and accommodating. We were caught up in the recent terror alert and associated flight cancellations. The concierge worked hard to try to get information from the airline for us but we had to go to the airport since all lines were engaged. Our flight was cancelled and we could not get another for 2 days. The staff were very sympathetic to us and it was a relief to have a room back in such a nice hotel. I would definitely stay here again. We did, however, have to pay a higher rate (not the full published rate) when we checked back in but you can’t have everything.", "Date": "August 15, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Grapevine, Texas", "Title": "“Good value for money, but not sure I would stay again.”", "Author": "Flydude37", "ReviewID": "UR5013501", "Content": "Guest rooms and public areas ultra-modern with nice artwork displays. I suppose my average review stems from that fact that I'm American and not used to some of the more European features, so take that into account. Beds are two twins pushed together with only a duvet for cover, but very comfortable. About 30 TV channels, but only one in English (BBC News). Great marble bathrooms, but no shower curtain...just the short piece of glass that extends about halfway across the tub. The large pool is fantastic if you're a swimmer, but the heat and humidity level is atrocious and extends into the gym area. My workout lasted about 3 minutes before I melted into a pile of sweat. If this was April I can't imagine how hot it must get in there in the summer. Possibly just an air-conditioner malfunction, but didn't stop to ask. I bit of a hike to the nearest U-Bahn station (about 10 minutes) but manageable.", "Date": "April 27, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Stuttgart, Germany", "Title": "“Pretty Average”", "Author": "bongoblog", "ReviewID": "UR4998773", "Content": "I was in Berlin for 5 nights over Easter and spent the first 2 here. The Lobby and bar ismodern and pleasant though the service to get a drink was very slow. .on going to room the was noone to carry luggage . The room itself was clean and modern but quite small. With the usual facilities. The bathroom was small with hairdryer etc, though the towels were small and coarse. The king bed was 2 singles with flat pillows and no pillow menu and surpringly the bedding wasn't changed daily. After 2 nights I was more than ready to go to the Intercontinental, which is often available for about the same price as the Sofitel", "Date": "April 24, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Best Deal in Town!”", "Author": "LostLagoon", "ReviewID": "UR4468567", "Content": "We made reservations over a month before we arrived in Berlin. We saw a non-refundable pre-paid (though it wasn't prepaid) 69 euro a night rate on Expedia, and chose this hotel after reading the great reviews on tripadvisor. Budget hotels were not even this cheap in Berlin. While we were travelling, I emailed the hotel to ask for an additional night at that same rate and they happily obliged us, which really impressed me. The hotel is new and very well designed. It is a very modern style, but this is Berlin and a lot of things are modern. The rooms weren't huge, but very comfortable, with good beds, a cabinet with glasses in them, a mini-bar, safe and nice toiletries in the bathroom. The king sized bed we had was two twin beds pushed together, but this was good. We found that on our trip, a lot of hotels didn't even do that. The pool was also very nice, but unlike a lot of hotels I've been to, a lot of people use it, so it's hard to get the pool to yourself. I never quite figured out where the women's changing room is - there was a large room that I thought was the women's changing room, but the saunas were off this room and naked men were occassionally strolling by. There's also a small gym. The breakfasts were 21 or 22 euros, but you can go elsewhere on the Ku'damm which is quite close to the hotel. The hotel internet was also very expensive, but there's an Easy Internet Cafe on Ku'damm (above the Dunkin' Donuts) and another one towards the station. This hotel is about a 10 minute walk (even with large backpacks) from the hotel to the Zoo Bahnhoff. This station will also take you to Schoenefeld airport, and the train we arrived on stopped there, so this was a very convenient location. The staff was nice and professional and the concierge was very helpful. He can sell you subway tickets and help you find your way. The one thing that I didn't like and have a hard time getting used to even if it is very common in Europe, is that people smoke in the lobby. Once, I walked up to the reception desk, and another guest turned around at the same time and practically poked my eye out with a cigarette, which horrified me, but generally, the smoking wasn't bad. I do recommend this hotel!", "Date": "February 18, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Moscow, Russia", "Title": "“Regular Traveller”", "Author": "arsenieva", "ReviewID": "UR4456371", "Content": "I have no any coplaints to the hotel. Just on my own individual taste the hotel design is bleak . Large in number squares and right anges (abstractionism style I guess) get me down . But I quite assume that a lot of guests like this style. On the whole: the location is perfect, the rooms are large, the breakfast is variouse... I'd rather recommend the hotel for accommodation..", "Date": "February 13, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Co. Antrim, N. Ireland", "Title": "“STAY HERE !!”", "Author": "ilockyer", "ReviewID": "UR4335421", "Content": "I really can't fault this hotel. It is in an excellent location opposite the city zoo and a 5 minute walk to the main shopping area and the nearest U-Bahn (underground metro railway) station. The staff are very friendly. The rooms are first class as was the breakfast. The leisure centre is excellent as well with a huge indoor pool. There is honestly nothing that I could find to criticise.", "Date": "January 10, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Kristiansund, Norway", "Title": "“A Great Hotel at a Great Rate”", "Author": "Treemonisha", "ReviewID": "UR4249598", "Content": "Most of the buzz on Berlin has been about Mitte; the central parts of the former East Berlin. This also applies to the hotel scene. However; the central areas of the former West Berlin also has its advantages; the lower price for the same quality of lodging in central areas being the foremost. The Schweizerhof is a new, large first-class hotel located on the site of the demolished classical Hotel Schweizerhof. The hotel is facing the Tiergarten, just across the street from the Intercontinental. The Bahnhof Zoo is a ten minutes walk away (taxi recommended if carrying luggage!), KaDeWe and heaps of restaurants and shopping opportunities is similarily close. The main gay area of (West-)Berlin, Scöneberg around Nollendorfplatz, is a safe fifteen-minutes stroll away. Budapester Strasse has some through traffic, but is safe and not too noisy. The hotel is a modern hotel with a spacious lobby. It is a typical airline crew layover hotel, used by several European airlines. It claims to have the largest inddor swimmingpool in Berlin. This is part of a health club, most amenities free for hotel guests. The pool is adequate in size, but be aware: semi co-ed! The standard rooms are nice, and well-equipped. Not too large, but sufficient for two. The breakfast buffet is GREAT, but pricey at €20/person. Crêpes and omelettes are made to order, and the selectin on the buffet is opulent, fresh and of high quality. Try and grab a rate which includes breakfast, and bring confirmation that the price quoted DOES include breakfast. We booked on the net and were told when phoning the hotel to confirm arrival times that \"ze bed and breakfast rate does not include ze breakfast\". Happily, this absurdity was apparent for the hotel when pointed out to them. The standard rate is around €200/night, which isn't bad for Berlin. We stayed for €89 including B&B last easter. We are getting the same rate for a stay next easter, and are going back. Thoroughly recommended!", "Date": "December 18, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "SF Bay Area", "Title": "“Consistent Quality”", "Author": "khw225", "ReviewID": "UR4055155", "Content": "We stayed here for several days and really enjoyed it. The price was also lower than I had feared, knowing this to be a large business hotel. Location is good – you’re close to the Bahnhof Zoo (train station) so you can take trains or the Underground to everywhere easily. It’s a little bit longer of a walk from the Bahnhof than they’ll make you believe, but still reasonable if you can roll your luggage. The room was large and nicely furnished. Internet access and all the other amenities. Everything clean and working well. We even had a nice view over the park. Breakfast was a huge buffet, including hot food cooked to order. Service was consistently friendly. We didn’t get a chance to check out their pool. The only real problem was the shower: the water temperature fluctuated like you wouldn’t believe. I know many hotels have this effect when everyone gets up at the same time, but this was really extreme. I would be happy to come back to this hotel.", "Date": "October 27, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Portland, OR", "Title": "“Excellent service”", "Author": "DavidLPortland", "ReviewID": "UR4047729", "Content": "My wife and I stayed at the Schweizerhof at the beginning of a two week vacation in Germany. We arrived at the hotel in the morning after getting off of a plane from the US. Our room wasn't ready at that time -- as we certainly expected -- and we were told we could check in around 2 pm. We went for a long walk in Berlin, and enjoyed ourselves immensely. We arrived back at the hotel around 3 pm and were first told that our room was not ready and that it would be an unknown period of time before anything more would be known. Another employee, hearing this, took it upon himself to ask us to wait for a few minutes in the lobby, and we watched him work proactively for about 10 minutes, making calls and tracking down the manager on duty, before he loaded our bags onto a trolley and escorted us up to our room. Great to see -- and unfortunately too uncommon -- for someone to take personal responsibility for helping a guest and making something happen. The room was very good -- large by European standards. BTW, the fitness center is now complete, and it is excellent; the pool area in particular is very appealing.", "Date": "October 24, 2005"}], "HotelInfo": {"Name": "Pullman Berlin Schweizerhof", "HotelURL": "/ShowUserReviews-g187323-d202450-Reviews-Pullman_Berlin_Schweizerhof-Berlin.html", "Price": "$131 - $256*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Budapester Strasse 25</span>, <span class=\"locality\"><span property=\"v:postal-code\">10787</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "202450", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/e5/e6/6d/haupteingang.jpg"}}