{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Great location, good value”", "Author": "globezipper", "ReviewID": "UR126992683", "Content": "If you are going to be in the Prenzlauer Berg district of Berlin, then consider this place. I've stayed in several other hotels around Prenzlauer Berg, but I'll be coming back to this one. It's one block from a U-Bahn (subway) station. There are plenty of nice places, cafes, restaurant and night life just a few blocks away. The rooms themselves are somewhat rustic but overall in good shape. There is free Wi-Fi but you need to fill out and sign a whole form before they'll give you the password. Having said this, they seem to take their paperwork very seriously, I really needed to fill out every little box on the registration form, with my phone number and all, perhaps the otherwise very friendly lady at the reception was new or perhaps the other hotels I've stayed at in Germany were a bit more lax in that respect. ;-) I haven't had breakfast in my room rate, and I didn't take it in the hotel so I can't make any comment on breakfast here. I do know something though: there is an absolutely fantastic breakfast place called \"Anna Blume\" just a few blocks away around Kollwitzplatz, if you are two people they have a breakfast combo on a three-layer platter that will blow your mind. If you have time in the mornings, try out that option, you won't be disappointed. Good value, I'll be staying here next time I want to be close to Prenzlauer Berg!", "Date": "March 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Saltspring Island", "Title": "“Mike from Saltspring Island”", "Author": "MikeSaltspringIsland", "ReviewID": "UR118507889", "Content": "Stayed three nights the end of August 2011. Enjoyed the location. Close to cafes and grocery stores. Very clean and updated rooms/bathroom. The outdoor breakfast patio very pleasant. The staff very helpful. Transportation two blocks away. Car parking at the Hotel must be booked in advance (underground). Highly recommended.", "Date": "September 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Seattle", "Title": "“Good value, great staff”", "Author": "MikefromSeattle", "ReviewID": "UR117989030", "Content": "Stayed for 7 nights in early July. Room was on top floor with a view of a park and church steeple. Very pleasant. Substantial breakfast which can be eaten in a sun room or, weather permitting, in the garden. Very peaceful. Front desk staff helped to unlock the mysteries of the German phone system and language by making several phone calls for me. The front desk also had underground/subway tix for sale. Underground station only a block away. Internet cafe close by as well. As other reviewers have noted, lots of cafes and restaurants in the neighborhood. A good mix of people; young and not so young, locals and tourists. I'd stay here again.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Stay at this hotel! Charming & clean, great area!”", "Author": "Cdn_Squirrel", "ReviewID": "UR117188937", "Content": "I enjoyed my stay at Hotel Jurine tremendously. It is in an excellent area for a Berlin tourist, great for strolling and enjoying vibrant street life, cafes, parks, and boutiques. The hotel is clean and tidy. The rooms are charming and quaint but also modern and well-appointed. The bathrooms are clean and modern. The beds are comfortable. I had a nice view of a leafy courtyard from my room. WiFi is included. I opted to have breakfast, and the indoor and outdoor eating area is absolutely delightful. I hope very much to return to this hotel the next time I am in Berlin. The value for money is unbeatable.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Seattle", "Title": "“Berlin revisted”", "Author": "skiswiss2001", "ReviewID": "UR111338474", "Content": "Overall excellent, terrific location, close to U bahn line #2, very clean, helful staff, buffet breakfast good but bit pricy, nice garden behind, quiet, excellent district, conveniet to points of interest, only real short coming was slow internet. Would definitely stay again.", "Date": "June 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lynchburg, Virginia", "Title": "“Loved Hotel Jurine”", "Author": "KellyMulligan", "ReviewID": "UR107721147", "Content": "Our party of 5 stayed at Hotel Jurine and really loved it. The location is excellent. The rooms are comfy and clean. I would recommend this hotel to anyone.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Orange CA", "Title": "“Nice hotel, not much help at the front desk”", "Author": "TravelerOrangeCA", "ReviewID": "UR73309625", "Content": "Good location, clean room, elevator a big plus, price was good, nice neighborhood. Service at the front desk could have been better, asked for recommendations for dinner and got a \"lots of places around here\" answer. Tried to get more info but none forthcoming. Rick Steves had good recommendations. Also the smart phone card would not work at the hotel. Worked elsewhere but not there, very inconvenient.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "The Hague (Netherlands)", "Title": "“Good location, friendly staff”", "Author": "Saskia12", "ReviewID": "UR54307516", "Content": "Good location, nice neighboorhood, close to little cafes and restaurants and nice shops (Kastanienallee). Also relatively close to other interesting parts (you can walk to f.i. Hackischer Hofe, Museum Insel Alexanderplatz) and close to public transport. We had a room on fourth floor, at the back, clean, very quiet and nice view on garden. Staff was very friendly and helpful. Breakfast is ok, but relatively expensive (as it is in most hotels), so you might consider having it elsewhere. Lots of opportuntities around. Free wifi worked fine in lobby, but I didn't succeed to use it in our room.", "Date": "January 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "mallorca", "Title": "“good value city hotel”", "Author": "annieporreres", "ReviewID": "UR21809018", "Content": "If you are looking for good value in a clean and comfortable hotel, I recommend Hotel Jurine. OK it''s not 5 star luxury, but you are not paying 5 star prices. The staff were friendly and the breakfasts enormous! All in all a good find. Just one point, if it is an international hotel, it should have more than just German channels on the TV. At least a news channel in another language would be a bonus.", "Date": "November 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Steiermark", "Title": "“The breakfast paradise”", "Author": "Austriacus", "ReviewID": "UR20822193", "Content": "At each of my four visits in Berlin within the last 3 years I chose a different hotel and this time it was Hotel Jurine's turn. Based on this experience my judgment is that its room rate of slightly below one hundred euros including breakfast may be called moderate for Berlin standards in relation to the comfort and the level of service it provides. Hotel Jurine is situated in the nice Prenzlauer Berg quarter of Berlin, fairly close to the next subway station. From there all the major attractions of Berlin can be reached within reasonable travel time by means of public transport. The quarter itself does not only comprise a lot of beautiful old houses but also numerous restaurants and bars of all kinds in bustling streets like Kastanienallee. Thus, there is no need to take the subway or to walk very far just in order to have lunch or dinner. On the contrary, the choice is so wide that it is difficult to decide where to drop in. The entire hotel seems to have been thoroughly renovated only a short time ago and so everything is in excellent shape. The rooms are decorated with taste and the baths are perfect. The evaluation of the quality of beds is always strongly influenced by personal preferences. For me the mattress and the pillow were too soft. But what bothered me most was the fact that the quilt was so thick that I sweated heavily at night although it was cool in the room. If your room is at the back side of the house there is absolutely no noise coming from the outside and you can leave the window open at night. On the other hand, the rooms are only poorly protected against noise from the corridor. So it depends on the fellow guests how often you get disturbed at night. The TV set in the room conforms to the usual standards. However, I missed a dedicated news channel. As a business traveller I would have wished a better illumination of the desk in the room which apart from that permits reading and doing paperwork comfortably and is equipped with WLAN access. Although quite a few cafes in the vicinity of the hotel serve breakfast I recommend to enjoy Hotel Jurine's comprehensive breakfast buffet. It offers virtually everything one could possibly desire to eat in the morning and I consider it as the hallmark of this hotel. In summer you can even take your breakfast in the beautiful garden behind the house to make the enjoyment complete.", "Date": "October 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "london", "Title": "“A great hotel that works at all levels”", "Author": "partner049", "ReviewID": "UR10064205", "Content": "We stayed at Hotel Jurine for four nights and found it superb. Very friendly and efficient reception sevice. The room was clean and well appointed and in a quiet location. The breakfast buffet is excellent with a wide selection of fresh and high quality food served in a spacious seating area with access to an attractive garden. It is located in a quiet part of a busy and interesting area of Prenzlauer Berg with close access to the S Bahn and U bahn and tram services. It is an hotel that 'works' at all levels and is very good value.", "Date": "October 10, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Amsterdam", "Title": "“Wonderful little hotel”", "Author": "Nitocris", "ReviewID": "UR8435299", "Content": "Hotel Jurine on Schwedter Strasse is an absolute gem! What more do you need in a city such as Berlin but a clean room and bathroom and great beds - this hotel has it all. Situated about five minutes' walk from the U-bahn in a quiet area. The only drawback is the elevator which obviously has trouble transporting all guests, so this requires a little patience. The hotel has a parking accommodation which we found quite unique - all I can say about it is that an SUV won't fit, but if you have a normal size car and good driving and manoeuvring skills it's some experience! Friendly staff, wonderful breakfast. An address to remember.", "Date": "August 16, 2007"}, {"Ratings": {"Check in / front desk": "1", "Overall": "1.0", "Value": "1"}, "AuthorLocation": "Brit in Berlin", "Title": "“They couldn't be bothered, you shouldn't either”", "Author": "Simonster", "ReviewID": "UR7414609", "Content": "As a generalisation, the quality of service in Berlin still leaves a lot to be desired. People do their job, more or less, efficiently enough, but don't look for friendliness or a smile or chattiness like you find, say, in London. For most Germans being \"korrekt\" and \"sachlich\" is what counts and, sadly, for many businesses that deal with people, the customer is still viewed as someone who disturbs the smooth running of the setablishment. This isn't a review of the Jurine per se, because the service I received there was such that the booking is going elsewhere. My father and sister are coming to Berlin in June 2007 so I am looking for rooms for them. I wandered into the Jurine to enquire about availability - two rooms for five nights. If someone comes to me wanting to spend anything up to €1,000 (price including breakfast) I'd have been friendly and welcoming. Not so the woman at the front desk who made me feel distinctly unwelcome. Can't think why since I showered this morning and my German is still fluent. Asking questions about the rooms also seemed too much for her, since she just gave me a leaflet and told me it's all there. And while I'm at it, charging €13.50 for the breakfast buffet is heavy, especially as any of the nearby cafés are cheaper. But then discounting the bill by only €8 if you opt out is (are you listening, the management?) is not a selling point. It leaves the customer wondering why they should pay an extra €5.50 for something they don't want! So to sum up: lots of hotels in Berlin. Give your money to people who appreciate it and make you feel welcome.", "Date": "April 22, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Berlin, Germany", "Title": "“not really beautiful but perfectly located at prenzlauer berg”", "Author": "making99", "ReviewID": "UR6576580", "Content": "one of the view hotels that are located in the middle of prenzlauer berg. hotel jurine is just around the corner of kastanienallee and not far from helmholtz and kollwitz place - which are really nice areas with small cafes, restaurants and individual shops in the eastern part of berlin. design of the rooms is a bit old fashioned but almost new bathrooms and all very clean and quite. plus the service team is very nice. and prices are really okay.", "Date": "January 11, 2007"}], "HotelInfo": {"Name": "Hotel Jurine", "HotelURL": "/ShowUserReviews-g187323-d202455-Reviews-Hotel_Jurine-Berlin.html", "Price": "$95 - $160*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Schwedter Strasse 15</span>, <span class=\"locality\"><span property=\"v:postal-code\">10119</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "202455", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/2b/0c/2b0c52b8143e21ce0091024fcb8e098410large.jpg"}}