{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ireland", "Title": "“Conveniently located, spacious bedrooms.”", "Author": "Worldtour08", "ReviewID": "UR126414152", "Content": "Stayed here for 3 nights, booked room only. The room was very spacious, large bathroom, large closet, trouser press, safe, flat screen tv, tea/coffee making facilities. Cant comment on the breakfast as we thought that it was over priced so did not have breakfast in the hotel. The hotel throughout was very clean and well kept. As I have seen in a few other reviews the air conditioning was not working in our room (617) so the room did get quite stuffy at night. Check in was speedy, I thought the girl at reception would give us a map and go through some basic directions/places of interest but we were just handed our room key card, so we called later for information, which was very limited, I felt that she didnt want to spend too much time with us even though there was only 1 other person waiting at the reception. The Märkische Museum underground stop is right outside the hotel which is great for getting around Berlin, as well as being straight forward to travel to and from Schoenefeld Airport.10 mins walk to the Museum island and a further 5mins to Alexanderplatz. The complimentary 2 beers and 2 waters is a great perk in your room daily. If you want any snacks in your room, bring them from the city centre as there wasnt much in the line of shops nearby the hotel.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Convenient Place in the Center of Berlin”", "Author": "kb0503", "ReviewID": "UR126156316", "Content": "Stayed here with my wife for a few days for our first time in Berlin and we liked it a lot. Booked through Orbitz and got a great deal without any of the check-in misfortunes mentioned in other reviews. Pros: -Location is convenient to walk to restaurants in Nikolaiviertel and a supermarket down the street. Hotel is within 20 min walk of Alexanderplatz, Museum Insel, or Gendarmenmarkt. Also it is located right next to the Märkische Museum stop on the U2 U-Bahn line, which means you can get anywhere on the west or east side of the city pretty quickly. -We love to drink water, which can be tough to get for free in Europe, so the two free bottles of water were much appreciated (beer too!). -Room cleaning was friendly and punctual every day, and the front desk staff were also helpful to us whenever we asked about something. Rooms are a fairly decent size for Europe. Cons -Wifi signal in the room (which you get for free 1hr/day) is pretty much nonexistant. It does work pretty well in the lobby though. -Beds are a little soft for my taste -As good as the location is, we would have really enjoyed having a nice cafe for breakfast right outside the hotel.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“SCAM reservation front desk System”", "Author": "dolldetails", "ReviewID": "UR126067194", "Content": "Ok watch out what you book. When you show up they will point you across the street and place you at a smaller louder lower star hotel with the same name. It is a bait and switch scam. I thought it was my misunderstanding until some Russians were being scammed at the front desk. They had ordered 3 rooms and got two rooms with three beds. They had reciepts and paperwork. What can people do at midnight when they are tired from jet lag? Thankfully the property is super clean and nice. I could hear lots of traffic but I always travel with ear plugs. Oh and the computer accross the street is HORRRRRRRIBLE so bring your own computer or you be lost in outdated dysfunction!", "Date": "March 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Great find and value in the center (perfect location) of Berlin!”", "Author": "Ryan T", "ReviewID": "UR125640133", "Content": "Pros: EXCELLENT central location (10m from Märkische Museum U-Bahn stop), great value (booked through HW). Very clean room, SKY sports TV. Cons: room's heat/cooling system did not work (there was only a fan in there), the \"economy\" room faces the atrium/lobby (ie. I believe there are 3 per floor) - so it can get quite loud at night from people drinking in the lobby bar (also, therefore the windows face lobby only, not outside). Overall: for the price paid ($60/night), it was excellent value. Would take the location alone over the no temperature control.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hartlepool, United Kingdom", "Title": "“stag weekend”", "Author": "Allan T", "ReviewID": "UR125636306", "Content": "beautiful hotel, great location and fantastic staff who helped with were was best to go. The rooms are very modern and clean no problems what so ever. WOULD recommend this hotel to all my close friends and family", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cork, Ireland", "Title": "“Really uncomfy beds.....”", "Author": "stephanie035", "ReviewID": "UR125494179", "Content": "I looked at previous reviews before booking this hotel. Location great. Milly's up the street for breakfast - great, the supermarket around the corner from there with fresh pastries and coffee - awesome. The hotel itself was fine, but the strangest thing, there was one pillow which was about the height of a small house. For all intense and purposes, it was like someone grabbed a cushion off the sofa. We asked for a double but were given 2 singles pushed together so that the Rhine Gorge separated us, not ideal for a couple getting married later this year :( Also the rooms were so hot that we didn't sleep the first night, the second night we opened the window even though it was -7C outside and we didn't feel any cold coming in. The option to control temperature would make guests feel more comfortable, turning down the radiators didn't work. Anyhoo, Hotel and Service, Cleanliness and Location were perfect. Sleep quality was poor, hence the rating.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "yerevan", "Title": "“As goof as if it were very good 5 star hotel”", "Author": "armtraveller", "ReviewID": "UR125488473", "Content": "Really, I felt if it were very good 5 but not 4 star hotel in everything! Rooms, service, breakfast, everything was perfect! As it happens when one wants to describe a good thing, it can be done and is done in very few words! :) Really an excellent hotel! during my 2 night stay there were also two small misunderstandings, but the way hotel solved them even those make me able to say hotel is really excel ant. I was late for the breakfast and though snacks and were till left no coffee was served, so I asked for a cup of coffee, but as I was in hurry I couldn't wait till they bring. During check-out this coffee (8EUR) was included in the bill but when i just said that I didn't drink it they simply and easily discard it from the bill. Very pleasant approach. Second, on the previous day of my leaving, I found that my key doesn't work. At the reception I was told that it was a mistake and they thought I have already checked out! I have only one hand case with me and practically no any items in the room. It was very disappointing especially when I thought they made-up the room in which little things were left. But as it is really an excellent hotel, after 3-4 minutes I was in the same room, got apologizes, and was given my mobile charger left in the room and even one piece of special apple pie which was left from the previous evening and I did not want to eat this second piece, but even it they carefully stored as it was bought from outside shop and was in a box. Such things can be met everywhere and for many people this two episodes can be very negative, as for me own, but more important for me the way they solve these problems which once again make me able to tell this is an Excellent hotel!", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Weekend in Berlin”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR125429325", "Content": "Very nice rooms, location, staff. The breakfast was not included in the price, and was not very good. But everything else was very good. I will defently use this hotel at another visit.....................", "Date": "March 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Vila do Conde, Portugal", "Title": "“Good for the price!”", "Author": "anvarao", "ReviewID": "UR123832668", "Content": "Good Hotel, very well located, just in front of an underground stop, and two stops away from Alexanderplatz. The relation price/quality is above average as long as you book your stay without breakfast... The breakfast will cost you 16€ per person... To expensive for me! The room decor is a little retro but still a confortable room with plenty os space. In our room the AC controls didn't work and we couldn't change the room temperature. Super helpfull staff. Overall, a good place to be.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good clean hotel, good location, helpful staff”", "Author": "tigga23", "ReviewID": "UR123548876", "Content": "We stayed here for a 3 nights over a weekend in January (booked via expedia). I had requested a smoking room in my booking, but this hadn't been passed on - but the receptionist changed it without a problem. The room was big enough for a city hotel, with loads of space to hang the clothes we needed. The bed(s) were big, clean and comfortable (though only 1 spare pillow). I think the hotel should invest in some new towels though - the towels were small, and getting thin. The 2 x beers + 2 x waters in the room each day was nice (though one day it wasn't restocked, but this was very quickly sorted out by reception). The hotel bar was small, but nice - and the barman friendly. The receptionist also assisted us in making a reservation at a local restaurant (Henne - excellent chicken!). There's a u-bahn stop (Märkisches Museum) right outside the hotel. Also across the small bridge, there's a supermarket - great fresh pastries and coffee (though, I think it's closed on a Sunday). Overall - we enjoyed our stay in the Derag Hotel Grosser Kurfuerst.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "scotland", "Title": "“perfect”", "Author": "travel3140", "ReviewID": "UR122841919", "Content": "lovely hotel, clean room, nice bathroom, friendly reception staff, U-Bahn stop just outside hotel door, 10min walk to alexanderplatz. perfect location and good value for money - would recommend :)", "Date": "January 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Nice and friendly at a great location”", "Author": "Nicolai L", "ReviewID": "UR122565670", "Content": "We went here for new year's eve 2011/2012 and we were overall very happy about our stay. The hotel has a great location in walking distance, a short walk from both Museumsinsel and Alexanderplatz. Also, there is an entrance to the U2 subway line directly next to the hotel. The hotel itself is clean and nice, and the staff is very helpful and welcoming. I never tried the breakfast in the hotel, as it was ridiculously overpriced: 16€ in a city where you can have a great breakfast in a restaurant for less than half? Come on! It is also my opinion that in 2011 (now 2012) free unlimited WiFi in the rooms should be an obvious comfort. In this hotel we got one hour per day for free and then we would have to pay. This should usually be enough, except that with the login-system in the hotel I never managed to spread the one-hour access over several 5-minute periods, and we could only use one device at a time. Too much hazzle when all we wanted was to check if we had new mail and maybe set a new facebook status for five minutes using our smartphones. Our room was spacious and clean and there were lots of room to put our clothes on hangers. The bed and the pillow were way too soft for my futon-trained back, I had the feeling of being in a hammock! That's unfortunately the way many hotel beds are. We did sleep well though, unbothered by light or noice, even when we went to sleep around 5am on new year's eve.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southampton, United Kingdom", "Title": "“Would thoroughly recommend”", "Author": "lozzag2009", "ReviewID": "UR122151500", "Content": "We stayed here for 2 nights mid-December. I cannot receoomend the hotel enough. We arrived early as we were on an early flight and they allowed us to check in early to have a nap etc before going off to explore Berlin at no extra charge. Each day, we had 2 bottles of beer and 2 bottles of water popped in the mini-bar for us to enjoy free of charge. The room we were in was a good size and very clean - the bathroom in particuar was nice with a deep tub. On the day we left we had a later flight and the hotel staff were more than happy to look after our luggage for the day. The location of the hotel is ideal, right next to a Metro station and just 2 stops from Alexanderplatz where there was a lot going on and it seemed to be the central hub (well for our visit anyway!). Will definately stay here again!", "Date": "December 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic Stay at Derag Hotel Grosser Kurfuerst Berlin”", "Author": "JATravels07", "ReviewID": "UR122043736", "Content": "Had a fantastic two night stay at the Derag Hotel Grosser Kurfuerst Berlin in June 2011. The hotel was a great value, not too expensive, located right next to the Märkisches Museum‎ u-bahn stop. Rooms were decently sized, very clean, and the staff was super helpful. They even provided us two free beers in the room! Would recommend for your stay in Berlin.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Great Location”", "Author": "alex_povereny", "ReviewID": "UR121954834", "Content": "The hotel is clean and the personal is very nice. It's not so modern, but it doesn't matter for the 4 night stay and the idea was to see the city and go out any way. The best about the hotel is the location - 2 steps from the metro station, not far from Alexanderplatz and food area.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Widnes, United Kingdom", "Title": "“All round excellent hotel”", "Author": "ladybird2254", "ReviewID": "UR121710878", "Content": "We came back a 3 night stay on 9th of December 2011. The hotel is a doddle to find. We flew into Schoenefeld Airport and got the train to Alexandraplatz. From there is it two stops on the U Bahn..... U2. As you walk up the stairs from the U Bahn the hotel it to the right. There is a lovely area of restaurants and bars about 5 minutes walk away which serve traditional German Food (turn right out of the hotel, walk to the traffic lights, turn right, cross over the main carriageway and turn right, over the bridge and turn left) .... Try GeorgBrau Restaurant which was always busy and the food is great. The hotel itself is extremely well kept... modern and very clean. The room was spacious and lovely. The staff speak good English and the reception staff are very helpful. As stated by previous reviewers, there are two bottles of Becks and two bottles of water complementary every day. There is a fridge in the room. We did not eat in the hotel restaurant or the Indian across the road so I cannot comment on either. I would not hesitate recommending this hotel to my friends. I have absolutely no complaints whatsoever.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Fantastic Hotel”", "Author": "Lukeybizzle", "ReviewID": "UR121350903", "Content": "We got back from a 6 night stay at this hotel yesterday and I can not recommend this hotel enough. From the moment we walked through the door we were met by helpful, friendly and attentive staff. The room was a good size and perfectly clean. In the room there was a TV, fridge, telephone, safe, trouser presser, massive wardrobe space and a small table and two chairs. As a guest you are entitled to an hour of free wifi a day and then it charges you after that. The bathroom was a good size again with plenty of mirrors! It was a bath with a shower. There was a toilet and beday. There was soap, vanity kit, shower cap, shoe care kit and sowing kit all complimentary. There were plenty of towels. The lobby of the hotel was fantastic. Very well presented and looked impressive. There was also a sauna and other things (not sure what) available for free but we did not use them. There was a shoe cleaner located on each floor too. There was a bar and restaurant in the hotel too. The hotel is in a great location for both east and west sides. The hotel is located right next to the Märkisches Museum tube station on the U2 line. The only downside to this was you could sometimes hear the trains but it was never enough to become a problem. The Berlin 'Dom' was about 10 minutes walk if you went down side streets and Gendarmenmarkt and Schiller-Denkmal were again only 5-10 minute walk away. I could not recommend this hotel more. It was brilliant and I really can't find anything bad to say about it.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atherstone, United Kingdom", "Title": "“Wunderbar!”", "Author": "MrMojoRisin_10", "ReviewID": "UR120988061", "Content": "My partner and I stayed here for three nights (we got back yesterday). I cannot rate this hotel highly enough! The location is great, only a ten minute walk to Nikolai Quarter where the great Georgebraeu Brauhaus is located and 15 minute walk to Alexanderplatz. In my opinion the area the hotel is located is my favourite. The U2 underground station is right by the hotel and there is a bank on the corner of wallstrasse with an ATM. The room was very clean and spacious, with free tea/coffee and free minibar (2 beers and 2 waters each day!) which comes in handy after a hectic day in Berlin. The hotel staff were very helpfull and polite. We didnt have breakfast so cannot comment on the food. Overall we had a great time in Berlin and will recommend the hotel to anyone who asks", "Date": "November 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens", "Title": "“excellent choice”", "Author": "cyberp", "ReviewID": "UR120818910", "Content": "central position close to metro, friendly staff, spacious and clean room, nice view", "Date": "November 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Reasonable Rate, Good Location, Decent Room”", "Author": "cabingal", "ReviewID": "UR120083857", "Content": "I can't add a glowing review to this hotel's many, but it was a pleasant stay. The location next to the subway station is a definite, but there wasn't much in the surrounding neighborhood. The beer and water in the room was a nice touch, and we also received a valuable coupon for the bar in the lobby. The room was clean, spacious and nicely designed. I booked three rooms through Expedia, and they wouldn't allow us to have outdoors-facing rooms. I wondered if it was because we paid the low Expedia rate instead of their published rate. So, our windows opened to the lobby, and the bar stayed noisy throughout the night. The hotel provided a fan in the room that I supposed was to help drown out the noise. Also, they did not honor our request for non-smoking rooms, and one of us had a smoking room.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "israel", "Title": "“very goog”", "Author": "omerdekel", "ReviewID": "UR119521512", "Content": "We have been there 5 nights, 2 parents + 2 children. The family flat is big enough and very comfertable. breakfast is very good. The hotel is 10 m' from the U-Bhan. The only minus - the internet conection is not free and cost money.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Catharines, Canada", "Title": "“Great Place To Stay”", "Author": "Martin_525", "ReviewID": "UR119307335", "Content": "Perfect location for our amazing European adventure. Access to the subway was at the door. Front desk staff most helpful for directions and local restaurants and spoke very good English. Free internet and our rooms were well appointed with a view of the canal. This was the best value of our accommodations while touring Europe.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Larne, Northern Ireland", "Title": "“Ideal base for seeing Berlin”", "Author": "McCluggage", "ReviewID": "UR119231989", "Content": "Hotel is only 2 stops on line U2 from Alexanderplatz (where Airport Express from Schoenfield Airport arrives). Markische Museum stop is 15 seconds from hotel entrance. Hotel was excellent and located right beside Spree River and walk. Efficient and helpful staff. Nice rooms and spotlessly clean. Nice touch is 2 free beers and water which was welcome after long days sightseeing. Location is great for reaching most of the city sights. Several restaurants nearby. Our only small criticism was that breakfast at e16 is quite expensive especially as my wife has a gluten intolerance and would have been unable to eat most of the food. We went to Milly's cafe situated 200 yds from the hotel(turn right) which was very good and half the price. We didn't try the Lebanese restaurant at the hotel because there was no English translation on the outside menu and we couldn't be bothered trying to explain the gluten free problem.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Quick Stay, Honest Prices”", "Author": "daniegge", "ReviewID": "UR118597711", "Content": "We got a great special rate to stay here for one night. The next day we decided to stay one more night and got a very decent rate as well. Staff is very helpful. Room service is good. The hotel has no parking, only in a parkimeter zone right in front of the building. But it is just beside a metro station. Some rooms can be noisy because of the metro station, if you don't like noise, ask for a room farther from it as possible and it should be okay. Couldn't find air conditioning either, but the weather was pleasant so I could just open the window and it would be ok. The internet was slow, if you need good connection at all times it might be a problem. If you don't wish to pay 20 euros for breakfast, go to Milly's Cafe, 200m from the Hotel, going in the direction of Gertraunderstrasse (near Novotel) where you can get a good Breakfast menu for 7,90 Eur. Overall, for the price we paid, it was worth it.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bangalore, India", "Title": "“Nearly perfect Option in Berlin”", "Author": "Sunil-Globetroter", "ReviewID": "UR118441603", "Content": "When i returned back in Berlin in March - April, i tried to book myself in Derag kunigine Luise on Parkstrasse, however the hotel was fully occupied and they referred me to Grosser Kurfuerst. I obliged as i had a very pleasant stay with Derag Hotels on my last trip. And it turns out to be the best option to stay in Berlin for me. The Hotel is just beside Uderground station of Markische Museum, and in 2 stops you will reach\\AlexanderPlatz where my Office was located on U2 Line. The Hotel just like the other Derag Hotels had a attached Kitchenette, a little smaller then the one at Parkstrasse, however enough for a individual. The kitchen had a oven and few utensils which could be used for cooking a decent Indian Cuisine. Its is located in a quiet locatilty where there is lot of peace of Mind. The staff was very helpful and cheerful. They Helped me settle in and also locate a few supermarkets close by from where i could do my daily grocery and other shopping. The rooms are spacious and the room services does a makeover 3 times a wekk for Long stay. The room cost was about 70 EUR per day and Internet is extra at 150 EUR per month. I also enjoyed the Indian Restaurant right opposite to the Hotel and that turned out to be my regular Hangout atleast twice a week. I will definitely stay at the Derag Hotels in Berlin on my next visit. i want to Also try out differnt derag hotels in other locations as well.", "Date": "September 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good location,helpful staff however room heating a concern”", "Author": "Jim M", "ReviewID": "UR118355419", "Content": "Good location right next to tube and just a few stops on U2 line from Alexandraplatz where TXL bus will take you to Tegel Airport. Breakfast expensive at 16 euros and not easy to get a seat so you may wish to check-out local cafes on arrival. Good Indian restaurant over the road. My only serious concern was that the 'air conditioning' does not give full temperature control. It was slightly cool in my early stay and reception informed the the heating temperature control will not work until they turn on the central heating system later in the year.They duly did this a couple of nighs later and my room became swelteringly hot so could not sleep properly - there was no regulator valve on the radiator to alter the temperature and Reception could do nothing about this at night. When I raised this again the following day they sent their 'technician' round to completely turn off the radiator. Thus at times of year your room is likely to be too hot or too cold! Otherwise, staff were friendly and helpful and the hotel would have been good value had the room temparature been within guest's control - something I would expect from a 4 star rated hotel.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Meath,Ireland", "Title": "“Great location in berlin”", "Author": "Bobafetts", "ReviewID": "UR118102072", "Content": "Lovely, clean modern hotel right next to Markische Museum U-bahn, (two stops from Alexanderplatz) yet in a quiet area. Room was of a very high standard. Reception staff were helpful, there is a pleasant bar area downstairs and can recommend the Lebanese reataurant downstairs. Great for a short break to a wonderful city.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“The perfect hotel”", "Author": "Travel_Is_To_Live", "ReviewID": "UR117573064", "Content": "The good review on tripadvisor made us book this hotel and I must say, it was all true. The staff was very nice and helpfull. The one-hour free internet and free beer/water feels like a nice welcome. We had dinner at the restaurant just across the bridge (3 min. walk), which was very nice. Shops around (5-10 min. walk) if you want to buy some snacks, drinking etc. The areas is very quiet which is nice. You shold ask for a room with a window to the street or the river as it is very nice with some fresh air. . This was our first stay in Berlin. Took the bus/u-bahn from Tegel which was very easy. It's only take 15 seconds from the u-bah station to the hotelArriving to the hotel. To get around in Berlin is very easy. We really enjoyed our stay and will come again another time", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great value and relatively central location”", "Author": "BlairHesp", "ReviewID": "UR117404961", "Content": "This hotel was really cheap for what we received. We had a large room complete with stove and nice comfortable beds a view over the river. The complementary beers and water are also a nice note. It was also within 15-20 minutes walk of all the main areas such as Checkpoint Charlie, Museum Island and Alexanderplatz, and has a subway stop right outside if you prefer not to walk. The staff were helpful as well, and we wouldn't hesitate to go back.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "San Francisco", "Title": "“I'd go back.”", "Author": "MrEricSir", "ReviewID": "UR116708655", "Content": "The Derag Hotel has modern rooms, an English-speaking staff (important for us Americans!) and the location is right next to the U2 U-Bahn line. It's also a short walk to Museum Island, Humboldt University, and Alexanderplatz. Many hotel features are an upsell, however. The wifi and breakfast are not free. That said, the breakfast is much more than you'd get at a normal hotel. We're talking smoked salmon, croissants, champagne, etc. Strangely, the mini-bar in the room -- which is two bottles of Beck's and two sparkling waters -- is completely free. A bottle of beer at the end of your day is a nice touch. The bathrooms have a bidet, something I suppose European travelers might like. There's also a pants press and a mini fridge in the room. Only downside I can think of is the doors to the rooms. Why? Well they make a loud and repeated popping noise when they open for some reason. So if your neighbor gets in late while you're sleeping, it will probably wake you up. Don't say I didn't warn you about that.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Stockholm", "Title": "“highly recommendable”", "Author": "Jenstockholm", "ReviewID": "UR116336045", "Content": "Just came back from a five day visit in Berlin and stayed in Derag Hotel Grosser Kurfuerst for four nights. I chose the hotel primarily due to the good reviews in Tripadvisor and its affordable price. Glad for that decision. Good location, peaceful and yet central (2 subway stations away from where the action is - Alexanderplatz), good service, friendly staff, we were upgraded so we had a room with living room and view of the river, spacious room. We did not eat breakfast there because it is expensive for small breakfast eaters, I read the selection is good though. The hotel is very good, I highly recommend it and will stay there again if I return to Berlin. Just two minor suggestions for further improvement: it would be helpful to have an alarm clock/clock (sidebed) since visitors would always want to see time; and more coffee, sugar and creamer when replenishing. These are very minor details which will make guests even more satisfied. The pillows were too soft for my taste but it was my fault I did not request for other types (they can change, upon request). Thank you and more power to Derag Grosser Kurfuerst. With regard to Berlin as a city to explore, please do not miss the rich historical value of the place. Holocaust will definitely affect you in gloomy way but that is history and we should be aware of what happened then with the hope that awareness will make us avoid the same incident in the future. The East/West Berlin history is also captivating. Checkpoint Charlie and Potsdamer are two places worth exploring. The Free Walking Tour is good to try - a 3.5 hour tour with good general overview of Berlin. We ended up giving as tip the same amount a real walking tour will cost but it is good way to reward the guide(s) who deserve same for the professionally done job. Bus 100 will give you chance to see what you should see. If you are interested to go to Reichstag (Parliament), please remember to book in advance and you should have proof that you booked (print confirmation). Do not forget to bring your passport. This is one thing we missed because we relied so much that booking would be enough and did not have our confirmation letter with us. The information in their website needs to be improved.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New Zealand", "Title": "“Loved this hotel, service, staff and position”", "Author": "saffy55151", "ReviewID": "UR116084143", "Content": "This hotel is brilliantly placed, close to cafes, canals, tour buses(hop on/off) parks, easy walk into central Berlin, great value, staff superb,rooms spacious. Highly recommend.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Great standard within walking distance of all the action”", "Author": "isomet", "ReviewID": "UR116028811", "Content": "Great standard on this hotel with friendly and very helpful staff. The city is located within walking distance from the main attractions, but still in a calm part of town without disturbing noise. There is a subway station right outside of the hotel as well as a bus station where buses can take you straight to Brandenburg gate and the main railway station (Hauptbahnhof). The only downside I could find was that I thought the breakfast was a bit overpriced, but it definitely held four star standard. If you can stand a hunt for breakfast in the morning, there are good options close by on Unter den Linden. Would definitely recommend this hotel and select it for future Berlin visits.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Limerick, Ireland", "Title": "“Top Marks”", "Author": "RJMeehan", "ReviewID": "UR115745146", "Content": "I take a lot of Euro city breaks and carefully select the hotel i stay in, in terms of star rating, location and obviously price. This hotel beats all others I've stayed in for each of the three categories I look for. Literally a kick of a stone from Markisches Museum UBahn stop. Beautifully presented hotel, very accomodating reception staff and then a generously sized room with all modern requirements. I will definitely return to Berlin. And I will definitely stay at the Derag Hotel Grosser Kurfuerst.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Pleasant Experience, good location”", "Author": "jessilynne", "ReviewID": "UR115716224", "Content": "My husband and I stayed at the Derag for 3 nights in November 2010 for a long weekend in Berlin. Our room was a little small, but the bed was comfortable and the bathroom was of a decent size. The mini-fridge came with free bottles of beer and water and there was plenty of storage space in the built-in closets. The hotel staff spoke English well and was able to assist us with maps and directions on our first day. The room rate we found included breakfast, which was basic but sufficient and filling. The hotel staff were also accommodating when we needed to leave our luggage for the day after checking out. I would recommend this as a good base of operations for exploring Berlin.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York", "Title": "“Good Spot for Exploring Berlin”", "Author": "videoordvd", "ReviewID": "UR115269673", "Content": "I stayed at this hotel while visiting Berlin for a weekend in June 2011. This hotel is in a superb location for a first time traveler in the city. It is literally steps from Markisches Museum stop on the U2 line of the U-Bahn, which made getting to all the nearby landmarks a breeze. The Berlin subway was very easy to use and ran about every 5 minutes during most times of day. While it was very easy to get to the action, the immediate area around the hotel was very quiet. This was great for getting some rest, but not so great for finding an open shop in the evening. The rooms were quite clean and the staff at the hotel were very friendly and helpful. They spoke excellent English and were able to help with any requests I had. The complimentary gummy bears and beer in the room when you first arrive were a nice touch. I did have two issues during my stay: 1) The card reader in my room malfunctioned on the first night, flickering my appliances on and off. This was quite annoying! Fortunately, the staff placed me in a new room right away. 2) The two rooms I was in both had windows that opened into the hotel lobby. Since neither the lobby nor the rooms had air condition, the rooms were rather hot! I slept very closely to the fan provided in the room. It was cooler outside, so having an outward facing window might have remedied this. Though the rooms themselves were a bit uncomfortable and could use some upgrading, I was impressed by the level of service that I was provided, and the hotel's location was perfect. Overall, I would recommend this hotel for a first timer checking out Berlin. P.S. - The hotel provides one hour of free internet, then charges after that.", "Date": "July 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Australia", "Title": "“Can't fault this hotel!”", "Author": "Kaylana", "ReviewID": "UR114312704", "Content": "- great location - right next to a subway station - lovely large rooms - nice spatious bathrooms - clean modern hotel - professional and friendly staff - supermarket close by I was impressed with the quality and service at this hotel for the price we paid. Very happy with our short stay here.", "Date": "June 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dover, United Kingdom", "Title": "“Lovely Hotel, Great location”", "Author": "intrepidfox83", "ReviewID": "UR109764988", "Content": "Stayed for a week in April on my own, therefor wanted a central, decent hotel. Checked in early and was made to feel welcome. Both the hotel and the room were very clean and warm. Only problem I had was the window got jammed, there was someone at my door within five minutes and it was fixed straight away. The hotel is only two U-bahn (U2) stops away from Alexanderplatz, but I walked it a couple of times, only a ten-fifteen minute walk. Didn't use the gym, sauna, bar or restaurant as I was busy sightseeing. The hotel was very warm, but that was actually a bonus for me. There was one hour free internet which was all I needed. Staff spoke English and were helpfull. There were two complimentary beers and two complimentary bottles of water when I arrived. I stayed over my Birthday and was pleasently suprised to get a knock on my door that morning and presented with complimentary fruit and sparkling wine, along with a letter wishing me a Happy Birthday and great stay. Would definately recommend and use this Hotel and would stay again.", "Date": "May 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent value”", "Author": "JBSTITCH", "ReviewID": "UR107861854", "Content": "I stayed at this hotel for four nights in May 2011 and was not disappointed. The room was large (for a city centre hotel) and very clean and amongst the ammenities was a small refrigerator with two free bottles of beer and sparkling water per stay which I thought was a nice touch. The hotel bar in the lobby is well stocked and very reasonably priced. The hotel is conveniently situated next to the U-Bahn station called Märkishes Museum which is served by the U2 line, meaning that you are only a couple of minutes away from Potsdammer Platz and Alexander Platz. The Nikolaiviertel with its many traditional German restaurants is only short walk or one stop on the U-Bahn too. Overall a very positive experience.", "Date": "May 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel”", "Author": "RJES", "ReviewID": "UR107560151", "Content": "Really well positioned hotel right next to a U-Bahn station (Märkisches Museum) which means transport is not a problem. The rooms are very clean, you get two beers and two sparkling waters for free in the mini bar which contains no other drinks so it is perfect to put your own drinks in and a free hour of internet access per day. It also has a lovely little bar which introduced me to diesel - coca cola and beer! Sounds grim but was delicious. The only thing I didn't like enough to give it five stars were the pillows! But it is a truly five star hotel.", "Date": "May 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Watertown, Massachusetts", "Title": "“great location, convenient, and quiet”", "Author": "vladb", "ReviewID": "UR104952804", "Content": "The hotel was well worth the online deal we booked, and while some may fret that it's not quite 4-star quality, it was more than acceptable, and met all our needs and then some. Located literally around the corner from the U2 subway line which traverses most of the major sites, and within minutes of walking to Museum Island, the Nicholas Quarter, and the Markisches Museum with its bear pit. Supermarket and 2 Indian restaurants are a block or 2 away. If one is not satisfied with the hotels 1-hour-per-day free internet use policy, one can always go to an internet cafe across the street (we did once when we needed to print an online train ticket). The staff, as everyone mentioned, is very friendly, and had no problems with calling a taxi for us at 4:30 am to take us to the airport (it arrived exactly on time). Another bonus is that despite the central location, the rooms are very quiet, from both the inside and outside. The breakfast was predictably expensive, but we bought everything at the nearby supermarket and kept it in the fridge (not large, but enough for several days worth of breakfast food). Taxi rate from nightlife hotspots in Mitte and Prenzlauer Berg is about 10 euros. All in all, a perfect base to see the city.", "Date": "April 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great Hotel!”", "Author": "LittleMissTravelBug", "ReviewID": "UR104094723", "Content": "This hotel is rated 4 stars and it certainly lives up to its standard. When you get into the room there are 2 bottles of beers and 2 bottles of water free of charge ready for you in the mini ba, so take advantage of it! The staff is extremely friendly, the rooms are extremely clean and it is located just right next to the train station. I would highly recommend this place, well priced for what you get.", "Date": "April 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berks", "Title": "“Great Hotel”", "Author": "aftonlad", "ReviewID": "UR102074648", "Content": "This hotel was recommended by a friend who lives in the city, agree with other reviews. location, cleanliness staff etc. Didn't use the leisure facilities \"forgot the Speedos\" also booked room only, thought 16Eu pp for Buffet breakfast a bit much \"being a Scotsman\" There's also great little Bar/Restaurant on the other side of the canal friendly staff cheap drink \"Scottishness again\" If ever going back to Berlin would stay here again.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Would stay there again”", "Author": "CoralH18", "ReviewID": "UR87949570", "Content": "The hotel is in good location - about 7 mins walk to Alexanderplatz. If you take the subway to there, get off from Markisches Museum station and the hotel is right on your right. A decent hotel, my room was in a good size, with the safe, fridge etc, balcony facing the street but quite. The more pricy rooms had the river view, so would go for those ones for homeymoon. Internet was expensive. The staff was professional and spoke good English.", "Date": "November 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Geneva", "Title": "“Well-located hotel and great value for money”", "Author": "VanHelsing007", "ReviewID": "UR87419409", "Content": "This hotel was recommended by a friend who stays here for business purposes. The service at the reception is excellent with good-humoured, well-trained young ladies speaking excellent English and ready to give good advice to the tourist. We had a large, comfortable room overlooking the canal at the side of the hotel.with a well designed bathroom with lots of shelf space, masses of mirrors complemented by very good lighting - much better than many an expensive hotel hat we've stayed at. The price of Euros87 per night (not including breakfast) for three nights over a weekend was less than half of an equiivalent hotel in Paris. It is right next to an U-Bahn station which takes you directly into the centre of Berlin in three stops. It is also about 15 minutes walk to the museum area. I can't recommend this place too highly. The restaurant is good if not of gourmet standard.", "Date": "November 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "West Lancashire, UK", "Title": "“Super hotel, super location”", "Author": "Edburga", "ReviewID": "UR87116346", "Content": "Selected this hotel after extensive search for somewhere to stay in Berlin. First point is that it is in the Mitte district which really IS a great start point for the vast majority of sights and things to do. The actual location of the hotel is just brilliant in a good, semi-residential area with a very pleasant 'feel'. Down a fairly quiet side street, the Markisches Museum underground station is quite literally outside the door, so it's perfect if you feel like hopping on the tube rather than walking. The hotel itself is smart, staff know what they're doing and the rooms are well appointed with fridge(not mini-bar) that includes free welcoming bottles of beer and water, comfy beds and pleasant, bright bathrooms. The public atrium which also doubles up as the bar, is impressive as it is the full height of the building, some six floors. Breakfast at time of writing was €14 per person per day. We did not bother, and walked to the end of the road to Millie's Kitchen, a nice little café that offers a good selection of breakfasts at very reasonable prices. Next door to Millie's is a small supermarket that's very well stocked, has a bakery, and sells everything for a breakfast picnic in your room! Within a short walk are lots of places to have breakfast so it's worth just going out and seeing what takes your fancy. Again, there are so many good restaurants within easy walking distance of the hotel, that we never used the hotel's own restaurant. The only blip and it is small, is that the bedroom was very warm even though it seemed that the heating was not on. This might suit some people though we opened the window -very wide! Good point is that they are happy to look after your bags after check-out, for example we had an evening flight so didn't return to the hotel until after 6pm. I have no hesitation in recommending this hotel and advise that you search the general hotel booking websites for a deal. We actually got our stay at about half price.", "Date": "November 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belo Horizonte, MG", "Title": "“wonderful hotel”", "Author": "olasBH", "ReviewID": "UR82671383", "Content": "The hotel is a walk distance to alexander platz and other atractions. The rooms are confortable and the bathroom is big. The staff was very helpful, I loved stayed there!", "Date": "October 8, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Norman", "Title": "“Disappointed”", "Author": "Rodomontade", "ReviewID": "UR71307626", "Content": "I stayed here on a very hot weekend. The room did not have air conditioning and the window only opened slightly. It was uncomfortably hot the whole time. The English-language TV channels did not include CNN. There were no toiletries except a soap dispenser. I was charged 14 euros for breakfast. I would greatly have appreciated being informed about the exorbitant price beforehand. I did not see anyone in the tiny restaurant/bar/terrace the whole time. I agree with the others that the nearby restaurant Poona was excellent.", "Date": "July 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "sydney", "Title": "“nice hotel”", "Author": "robp26", "ReviewID": "UR69415570", "Content": "We were very lucky to be upgraded to a suite when we booked a basic room, so my review is going to be coloured by that. The suite was good, with a nice view over the canal. The interior of the hotel has a huge atrium with lots of light coming in from the glass roof, so the design of the hotel worked for me. Free internet at reception helped. Service mainly good.", "Date": "July 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Uppsala, Sweden", "Title": "“Great hotel! Such friendly staff”", "Author": "masi68", "ReviewID": "UR67041800", "Content": "We stayed at Derag Hotel Grosser Kurfuerst for two nights. We arrived early, before 10am, on Friday morning en expected just to leave our luggage in a luggage room but instead we got excellent service right away and could check in and get our keys. We were also very fortunate that it was very fully booked and were upgraded to a junior suite, so we never really saw a standard room. The day we were leaving the hotel, we did need to use the luggage storage room, and it felt very safe. The staff took our bag to a storage room behind and the staff also picked it up for us when we came to pick it up, so not just anyone had access to it. There is a \"spa\" at the hotel, but we never used it. The buffet breakfast was very good, with a good variety, and very well arranged by a lady who made sure everyone found a seat. There weren't that many seats, but it worked very well, also now when the hotel was fully booked. I believe that breakfast is not included in all rates. The location is right by a subway station, Märkisches Museum. When you walk up the steps, cross the street, there are just maybe 10 more steps and you've reached the entrance. Märkisches Museum is only two subway stations away from Alexanderplatz. It's a pretty quiet location, which I think is nice when you step out on the street and you don't get a feeling your run over by cars and buses... An yet it's very close to Alexanderplatz and not too far from Kurfürtsendamm etc. The subway works fantastically well and it's worth buying a ticket for the whole stay if you plan to move around the city.", "Date": "June 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Preston, UK", "Title": "“Fabulous hotel and brilliant location”", "Author": "racoon2007", "ReviewID": "UR66526473", "Content": "I booked this holiday at the last minute for a 3 night trip to Berlin. We wanted something fairly convenient to see the key sights and for a reasonable price...we were NOT disappointed. When we arrived at the hotel reception couldn't find our booking details and I began to panic slightly. However, after realising that the mix up was caused due to our last minute booking failing to enter the system they gave us a free upgrade to a superior room for the inconvenience caused. The room had a separate lounge, huge bathroom and was exceptionally clean. My only slight gripe would be that the towels were a little small and there were no toiletries at all (just shower gel) BUT this is a small gripe. The location was also superb! I bought a three day pass which includes all means of public transport and it was both excellent value and very convenient. The underground stop is about 5 steps from the hotel reception and this takes you to all the key sights in Berlin. We ate in the hotel which was delicious and the Indian restaurant opposite (I think it was called the Shebab) and this was also excellent. I would definitely stay in this hotel again and would thoroughly recommend it!", "Date": "June 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Lerum, Sweden", "Title": "“Great location, nice rooms, busy breakfast (with a tip)”", "Author": "BenganJ", "ReviewID": "UR50394673", "Content": "Second visit to Derag Grosser Kurfürst and still a very good choise in Berlin. Excellent location with U-bahn station just outside the door and Nikolaiviertel with many restaurants a couple of hundered meters away. Edeka grocery store about 100 meters away if you like to buy something to eat in the room. Withing walking distance from Museuminsel, Alexanderplatz, etc. Rooms are nice and the beds a large and very comfortable. The breakfast can be a bit busy at weekends with some people waiting for a free table, but then check out the restaurant since they also serve breakfast at weekends and when we stayed there were more than 5 people waiting for a table in the breakfast room but the restaurant was almost empty (and it is also a nicer room with windows overlooking the canal). So make sure you check it out. I still recommend buying the \"kleingruppenkarte\" if you are party up to 5 persons, it will give you unlimited transportation for a day and Berlin is large so you don't want to walk around to the different places - instead use the excellent U-bahn and S-bahn system.", "Date": "December 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "northampton", "Title": "“A good base for exploring the city!”", "Author": "diva80", "ReviewID": "UR50091822", "Content": "Location and price were our main factors in choosing this hotel, we nearly booked the smaller sister hotel Henriette across the road due to price, but upon reviews we chose this one, and we were not disappointed. From the airport we took a train to the hotel (had to change once) to get to the Markisches Museum U bahn station, and the hotel was literally right outside the station! there are 2 exits, so take the one that says Nikolaiviertel to get directly near the hotel entrance... The hotel itself is clean and fairly modern, the reception staff are friendly and speak good english. We had booked our standard room through Expedia, and the reception said for an extra 10 euros a night we could upgrade to a larger room on the quiet canal side of the hotel. Personally, I would have thought they should had given us a free upgrade, but we took them up on the offer nonetheless. Our room was on the 5th floor, nice and spacious, and tastefully furnished. The room had tea/coffee making facilities, plenty of wardrobe space, and a desk, comfy chair and table. Surprisingly although it was a double room, we were given two single beds pushed together, and two individual duvets - not very romantic! There is a distinct lack of toiletries on offer, apart from soap and a dispenser in the shower for a 2 in 1 shower gel/shampoo concoction. So don't forget to bring your shower cap, body lotion, cotton buds, and anything else you might need! The shower was pleasantly powerful, and there was a nice big sink. There is also a mini bar in the room, though we didn't take anything from it. There are plenty of channels on TV, but not many English speaking ones. We didn't eat in the hotel, and instead chose to have breakfast in Alexanderplatz station, which is not far by train, and have plenty of variety of food on offer... better than spending 14 euros for breakfast in the hotel, very expensive! Berlin itself is amazing, and there is plenty to see and do! We stayed for 3 nights, but would have loved an extra day or two. Some of the good things we saw: Jewish Museum, Checkpoint Charlie Museum, Reichstag (with amazing dome designed by Norman Foster!), TV Tower, Berlin Dom (Cathedral) and the East Side Gallery (largest intact section of the Berlin Wall). We didn't eat dinner in the hotel so can't comment on that. But if you like Thai food, theres a lovely restaurant called Good Time near Oranienburger Tor station. Nice romantic atmosphere, and really nice food. We also visited a kebab/pizza place called Grill und Schlemmerbuffet in Rosenthaler Platz. Kebabs were nice but a little different from kebabs in england (this place didn't do lamb) but the pizza there was amazing! Very fresh and tasty, and the staff there are great... A popular snack there is Currywurst, a chopped fried sausage with curry powder and ketchup, usually accompanied by some french fries. Sounds strange but pretty tasty and good for a snack! And of course, there is beer a-plenty in Berlin, so you must try this. If you're not big on beer, another alternative is a Berliner Weisser, a sparkling type beer, which you can have with a shot of red or green sweet syrup... One thing we noticed in a number of small eating places that the German's generally like customers to take their plates and cups back to the desk, especially if you've been to a cafe type place. As a clue, I just watched to see what other people did first! We learnt a few german phrases, but found we didn't really need it as pretty much everyone spoke really good English... I thought the hotel was a really good base for exploring the city, as even though its in the business area, from Markisches Museum station is really easy to get to other stations and areas... We purchased a Berlin Welcome card from the airport for 72 hours for 25 euros, which gave us use of the trains, and discounts in certain places, such as the Jewish Museum, Checkpoint Charlie Museum and the TV Tower. To use it, you need to validate it once in the boxes on the platform. If I came to Berlin again, i'd probably stay at this hotel if the price is right!", "Date": "November 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Sixth visit...and still brilliant!”", "Author": "janie1", "ReviewID": "UR49195773", "Content": "We visited Berlin for a joint celebration...my mother's 65th Birthday on the 9th November and to be in the city for the Wall celebrations. We were keen to introduce my parents to the Grosser Kurfuerst and we were not let down! I'd arranged a bouquet of flowers and sparkling wine in mum's room and it all went very smoothly. My sincere thanks to Stephanie for arranging this and making the occasion a very special one. Our rooms were spotlessly clean (we had a suite as we had our two children with us, while mum and dad had a double) and everything was perfect. I cannot fault this hotel. Breakfast was ample and delicious and all the staff were friendly and helpful. The location is spot on with the Markisches Museum on the doorstep. We enjoyed a couple of sessions in the bar which is our favourite place. I cannot wait to visit again.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Sydney", "Title": "“OK, nothing special”", "Author": "cowsyyy", "ReviewID": "UR47494799", "Content": "Our room was clean, comfortable and spacious. I wouldn't say this is a 4 star hotel though, more like a luxury 3.5 star. The bathroom was clean. The third night we were there we could hear our neighbours! The hotel is conveniently located next to the train station. As per the other reviews the internet is really expensive.", "Date": "October 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Brighton", "Title": "“perfect location but rooms incredibly hot”", "Author": "HisFussiness", "ReviewID": "UR38906614", "Content": "As already said, a nice clean hotel, great location, lovely staff, good prices. So it pains me to say I wouldn't go back there for one reason only: the rooms were unbearably hot - infact there was a fan in the room when I arrived so I wasn't the only one to think so - and I had three sleepless nights. Thinking that the particular room had faulty cooling I was moved very efficiently to another but it was the same, even on the minumum room temperature setting. Additonally, if you are in one of the rooms that has (sealed) windows facing the internal atrium you may get disturbed by noise in the foyer that echoes around quite late at night.", "Date": "August 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "seattle, WA, USA", "Title": "“Nice hotel in central and quiet location”", "Author": "nordictraveler", "ReviewID": "UR37390723", "Content": "Overall a good experience. The hotel is centrally located in a quiet area. It easy to find if you make note of it being next to the U-Bahn (subway) station: Maerkisches Museum. Overall service: good and efficient. The hotel is tastefully updated.. The room # 722 is medium sized and well organized. Quiet and overlooking the hotel glass rooftop. The breakfast buffet has a great variety including healthy options to start your day. There are newspapers in the lobby, including one American. The fitness room is OK equipped. I had no problems getting access to the machines and only saw 2 people during the 11/2 hour I was there. Internet access over WiFi was15 Euro for 24 hours. You can get it for free in the Internet cafes.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Aalborg", "Title": "“Nice hotel very close to the U-Bahn”", "Author": "zmoelf", "ReviewID": "UR36715110", "Content": "We just returned from a 3 nights stay at the Großer Kurfuerst Hotel in Berlin. The hotel was very easy to find. It is situated in a more quiet part of Berlin right next to Spree River. The hotel has parking facilities 150 m up the Street in Fischerinsel... at least so it said in the hotel information in our room. I asked about parking when we arrived, and they advised us to park in the Wallstrasse just across the hotel, so we never found out until the last day. It was very easy to get a parking space very close to the hotel. We arrived aroung 11 am, but we noticed that there were always free spaces just outside the hotel. Tickets cost 1 Euro per hour from 9 am to 10 pm, so 13 Euros per day, if you want to leave the car there during your stay. Remember to bring coins or EC card for the ticket! We got a room with Spree-view. The room size was pretty much standard for a German hotel, and the beds were very comfortable. Generally the hotel was very clean. Our room was spotless. The bathroom was also very nice and has a bathtub, which was a pleasant thing after walking around in Berlin the whole day. Breakfast was ok: basically scrambled eggs, sausages or bacon, bread rolls, croisants, hard boiled eggs, fresh fruit salad, yoghurts, coffee, tea, juice and the usual selection of sliced cheese and ham. 2 days we had our breakfast buffet in the restaurant instead of the breakfast area, because it was too crowded, but that wasn't a problem at all. We spent about an hour in the wellness area downstairs at the hotel. It's open until 10 pm. They have a sauna, steam bath and a cold water tub. If you find the steam bath not very hot and steamy, try pushing the switch outside the door! You can borrow bathrobes and towels for free at the reception desk. It's also free to use the lockers in the wellness area. If you walk about 200 m from the hotel towards Märkenisch Museum you will find a very small store, and if you cross the river and walk about 200 m towards the Berlin Dome, you will find a super market. The hotel is also near the Berlin Dome, the TV-Tower, Nikolaiviertel (old jewish town) and the Red Town Hall can be reached within a 5-10 minutes on foot. And the U-Bahn station \"Märkenisch Museum\" (U2) is right outside the front door. This U-Bahn will take you directly to Alexanderplatz (TV Tower and much more), Kurfuerstendamm (main shopping street, the Zoo and Gedänkniskirche), Potzdammer Platz (Checkpoint Charlie and Berlin Wall), Stadtmitte (Gendarmenmarkt). We recommend that you buy a Berlin Welcome Card. With this card you get to travel arount Berlin by bus, train and U-Bahn for 2,3 or 5 days. The card gives you a 25% discount on the hop on - hop off busses in Berlin. These busses will take you to all places of interest in Berlin and they also give you a nice impression of the city if you just want to stay on the bus for a full 2 hour trip. Also, you could take a boat trip and save 25% on the ticket. We went on the evening bridge trip, which was very nice. However, don't eat onboard. The food is not very expensive but also not worth the money! Alltogether we had a very nice stay at the Hotel Großer Kurfuerst. Our only complaints would be lack of information about the parking spaces, very expensive internet and only in the lobby and the room service. We tried to order room service at 10.30 pm. First they didn't pick up the phone. Then we got the reception staff to transfer the call. At that time they told us that the kitchen was closed even though the signs said that room service was available until 11.30 pm on one sign and 1 am on another. Oh, and one last thing: The staff at the hotel was very helpful but not everyone spoke English very well, and some didn't even understand English. Good thing that we speak German as well! And don't expect them to exchange coins for your parking ticket.", "Date": "August 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Nice Hotel at the \"Mitte\"”", "Author": "LikeBerlin", "ReviewID": "UR34114565", "Content": "This were the second time we visited the hotel (first time in 2005). Like the facilities and the location near the U-bahn.", "Date": "July 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Near to many tourist sites - U-Bahn outside door - quiet area”", "Author": "Cliveocr", "ReviewID": "UR25592467", "Content": "Modern hotel - very clean - helpful staff. U-Bahn 20mtrs away. Good buffet breakfasts. Easy walking distance to Museum Island sites, Leipziger Strasse and Alexanderplatz. Not too far from Friedrichstrasse and Brandenburg Gate. Only difficulty was finding the room temperature controls.", "Date": "March 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, TX", "Title": "“Everything you need is right here”", "Author": "TheAnswer", "ReviewID": "UR23355349", "Content": "Upon checking into the hotel on New Years Eve 2008, the receptionist informed us that we had been upgraded to the hotel across the street. WOW!! What an upgrade indeed. The Derag Grosser Kurfurst is an amazing hotel. The first thing that caught my eye were its impressive atrium and majestic bronze horse and rider mounted 3 floors up. The rate for the double room we reserved for 4 days varied from €89 to €220, the highest being New Years Day. But since we were upgraded to a junior suite, our suite would normally have been €122 whereas a standard double would have been €89. The junior suite does not appear that much larger than the typical double, but it's the way the room is furnished that makes it so homely. The room comes with cable tv, phone, armchair, coffee table, pants press, electronic safe, and electric window shades. The fully stocked kitchenette comes complete with fridge, microwave, coffee maker, dishes, flatware, sink, colander, etc. The bathroom is bright and spacious, though it lacked amenities you would expect from a hotel of this type such as specially branded lotion, shampoo, and conditioner. Other perks included in the room rate were the hot breakfast buffet, and use of the wellness center which consists of exercise equipment, massage room, tanning beds, sauna, steam room, and hot tub. The location of the hotel is fantastic. The u-bahn station is right outside. There is an Indian restaurant across the street, as well as a German restaurant across the bridge. A little bit further down the street is an internet station that charges €1/hr. There is a small supermarket located at the far end of the street which also hosts an awesome doner kebab stand. The Australian, Brazilian, and Chinese embassies are also within walking distance. My only gripes are that breakfast seating is often limited, internet access is very expensive, and that bathroom amenities are lacking. Aside from that everything else is great. I highly recommend this hotel.", "Date": "January 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "the midlands, england", "Title": "“Loved the Sauna, power shower, steam room, wellness area, location”", "Author": "smartprincess", "ReviewID": "UR23153210", "Content": "We visited this hotel over Xmas 2008 while on vacation to Berlin. Overall, excellent value for money. After a day of sightseeing outside in very cold weather Berlin, it was a pleasure to come back to the hotel and relax downstairs in the wellness area. The rock sauna was in full operation (even over Xmas!), as was the steam room & showers. The recliners were great to curl up with a book in between the heat experiences. Fitness gym, Key lockers & towels all included. All the above were included in the cost of hotel; the solarium was a bit extra (6 euros i think), which we ran out of time ot visit. They had massages, treatments etc also available for additional cost. The sauna was huge, but steam room smaller. The pool which resembles a jacuzzi is actually a cold water plunge pool!! We had swimsuits on in the sauna, but the locals (germans) who were staying at the hotel were all 'au naturel'!!! The rooms were a good size, very comfy pillows, excellent power shower (missing it now that i'm back at home!), lockable safe, and cozy warm room temperature. The bathroom fixtures & fittings were basic (not fancy), but were definitely adequate for how little this hotel + flight cost. There was a fixed unit on the wall for shower gel/shampoo which you had to squeeze a bit hard, but manageable. Towels were thick, but not super-long/large. However, definitely adequate. It's not a 5 star hotel, so you shouldn't expect 5 star luxury/decadence, but it was definitely excellent value for money for a 4 star hotel. I give it 4 stars because of the wellness area downstairs. Without it, it would be a 3.5 star hotel. Another bonus was that it's right outside the underground tube station so very convenient. It was very easy to get here on the public transportation (bus) directly from the airport. I would recommend purchasing a red \"Berlin Welcome Card\", which entitles you to unlimited travel for 72 hrs, including to/from airport & discounts off museums etc. Excellent value for money vs. taxi, which takes just as long to go from airport to hotel. Breakfast was very expensive (14 euros per person) with minimal vegetarian selection. Instead, i would highly recommend having brunch or dinner at one of the many veggie restaurants in berlin (eg Samadhi restaurant, or Good Time restaurant). See my reviews on www.happycow.net. There were no veggie items on their restaurant menu for dinner, however, directly across the road in Hotel Henriette, there's a restaurant called Shezan which did, and was convenient when tired / strapped for time. The reception staff were very helpful in locating items on a map, making dinner + concert reservations. Check out the hotel's website which is very helpful. Overall, definitely made the right decision to stay here while visiting berlin. Highly recommended!", "Date": "January 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "DK", "Title": "“Best Choice”", "Author": "christosDk", "ReviewID": "UR22774336", "Content": "Value for money ++++ .... 15 steps from the U station, near every where, very quiet location, Excellent personnel, great breakfast, spacious and luxurious rooms. My first visit to Berlin, and I am very pleased and lucky to book Derag Hotel. I will definitely book there again.", "Date": "December 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Drogheda, Ireland", "Title": "“Derag Hotel is a little Gem”", "Author": "PollyM90", "ReviewID": "UR20560172", "Content": "This is a perfect hotel to stay in while enjoying a trip to Berlin. Modern, smart, clean, efficient, comfortable, well located, quiet and it represents excellent value for money. The double room we stayed in was compact and well-appointed. Contrary to what is written in a previous post, this hotel does have air conditioning. Its not quite obvious, the controls are tucked away into the vanity cabinet/dressing table and are quite easy to miss. But I found it, used it and it added to the enjoyment of our stay. The minibar also represents value for money. The hotel bar is small but cosy, inexpensive with friendly staff. The lobby is super and has natural daylight flooding in. Pets (!) are allowed, we saw a couple walk out of the lift with their dog! The only negative I can say about this hotel, is that toiletries such as shampoo and showergel are not provided. I will definitely stay here again when I return to Berlin (wonderful city - quite unlike anywhere else I've ever been).", "Date": "October 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ballinhassig, Ireland", "Title": "“Excellent Hotel and quality service”", "Author": "James&Rachel", "ReviewID": "UR20005482", "Content": "I brought my wife to Berlin for a four day trip to see the wonderful sites as I had just being in Berlin on business the previous October. What can I say the hotel is a complete gem. When I booked it I was met by a pleasant voice over the phone who could not do enough to help me with the booking. The hotel staff were magnificent and the buffet breakfast was excellent with a very good range of food. I would highly recommend this hotel for your trip to Berlin as it is very reasonable, very clean and has wonderful staff working there. The hotel is situated in a lovely part of the city with a U-Bahn station on its doorstep. It took 1hr to get there by train for Schonefeld airport. Just take the S9 from the airport to Alexanderplatz and change to the U2 to Spittel Markt to get there. I would recommed Cafe Orange on Oranienburger Strasse for food as the food is excellent and very cheap, this is on the East side of Berlin.", "Date": "September 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pensacola, Florida", "Title": "“Derag Hotel Berlin”", "Author": "MOJOSETI", "ReviewID": "UR18617929", "Content": "I booked this hotel via the Derag website. They were running a summer special for 55 Euro a night. After reading all the previous reviews I decided to jump on it. What a lucky find! When you first enter the hotel you are struck by how beautiful the lobby is & how modern & stylish the hotel is too. We booked a double room which very nice & we especially loved the art work. My only complaint about the room is how oppressively hot it was the first evening. I know it isn't common in Germany for hotels to have A/C, but I had hoped that since this hotel was newer this would be an exception. We left the windows open each night to sleep & it made it tolerable. We were also impressed by the superior customer service of all the hotel staff. On the day we checked out we ask for them to keep our luggage since we had a late flight & they had no problem accommodating. The biggest plus about this hotel is the proximity to the U-Bahn. The hotel is right outside of the Markishe Museum stop. It is also very close to a lot of the important monuments & museums if you choose to walk. We purchased a 3 day train pass at the Berlin Information Center that allows you to ride all of the trains & buses in Berlin. We saved ourselves a lot of money by doing this as well as purchasing a 3 day museum pass that allowed free access to all museums on museum island & as well as other museums. We would definitely recommend this hotel to others. Just a side note to anyone who is a cheap as me. lol I found a free walking tour that takes you to all of the important sites. The only thing that is asked is that you tip the tour guide at the end. It is a wonderful tour that starts at the Brandenburg Gate, then to Reichstag, Hitlers Bunker, Berlin Wall, Checkpoint Charlie, etc & then tour ends on Museum Island.", "Date": "August 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Modern, Friendly, Recommend!”", "Author": "London-Gal08", "ReviewID": "UR18135958", "Content": "We stayed at this hotel and were excited to hear from the taxi driver that it was a \"very good hotel\". The lobby is very impressive and the whole look of the hotel from the common areas to the rooms is very modern, clean cut and stylish. The staff were super helpful, friendly and couldnt do more for us, very impressed with the customer service. The rooms were very clean and well furnished but considering how modern the common areas were, the rooms and bathroom were comfortable, functional and just fine but not as \"modern\" as the rest of the hotel. We had a nice canal view though and its located in a quiet area. The inclusive breakfast buffet was simple but hearty and fresh with eggs, rolls, cold meats and cheese, fruit, cereals and croissants etc. It is in the business district but if you dont wish to use the next door S-Bahn underground, you can walk very easily to Unter Den Linden (10 - 15 mins walk) and the Nikolaiviertel (about 5 mins walk) where there were lovely traditional German houses/pubs/restaurants/shops selling lovely food. A real gem. The TV Tower (Fernsehen Turm) was also just 10 mins walk and was very busy around that area. Once on Unter den Linden the number 100 or 200 bus can take you very cheaply all around the main sights of Berlin, which I would recommend. Having seen how busy and touristy Kurfurstendamm was, we were very glad to be staying in the area where we were! I would definately recommend this hotel to others.", "Date": "July 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Just Plain Perfect!!!”", "Author": "kimboshorne", "ReviewID": "UR17532570", "Content": "Me and my boyfriend have just stayed at the Derag Hotel Grosser Kurfuerst in Berlin.... It was brilliant... just what we needed, nothing too over the top, just a great base for our travels. We are students on our summer break, we stayed for 3 nights in a basic double bed room. The hotel is literally next to the underground (dont worry you cannot hear a thing, and we were the closest room to it) which is great when your tired after a great day of sightseeing and all you want to do is chill out :) The hotel is situated in a quiet businessy area, it is easy to access the whole of berlin within a few minutes. The rooms are nicely presented, spacious, comfortable, have good facilites, large bathroom, nice choice of tv channels, and dont smell funny. The overall hotel has nice decor. We did not eat in the hotel at all, but from the look of things, it did not seem too expensive. We opted to eat out in touristy places and sightsee while doing so. My only moans are... ....that we had no control over air-conditioning, but to be honest, they are not stupid, we went in a heat wave, so they turned the AC up, when it got colder they turned it down... no compliants really. Oh, and also bring hair conditioner and shampoo, the bathroom facilities are good, but it is just an all in one body wash, and shampoo thing. Also, it was a bit annoying that a 'double' really means two single beds put together, it tends to take away the intimacy, and they just give you two single duvets rather than one double duvet. MY TIPS FOR BERLIN and THIS HOTEL IN GENERAL: 1. Check maps - undergound and overground are fairly easy but just check which direction you want to go in. 2. Don't bother with Checkpoint Charlie - its a fake! Literally... 3. Dont bother eating in - go out and see the world.... this includes beakfast! its cheap but filling! 4. Alexanderplatz nearby has some nice hidden restaurants 5. Go to the Sony Centre Cinema - english, massive, cheap and rarely crowded Neway Go to this Hotel its Brilliant.... just what we wanted", "Date": "July 4, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Surrey, England", "Title": "“Nice location, friendly hotel”", "Author": "annejim", "ReviewID": "UR17279722", "Content": "A good location since it is within walking distance of the centre yet in a quiet spot by a canal. Comfortable rooms (though you can't seem to control the air conditioning), good breakfasts and lovely staff. The interior design of the hotel is unusual, striking and appealing, which contributes to the pleasant ambience. We enjoyed a meal at the Indian restaurant across the road and another in the hotel itself. There are plenty of other restaurants nearby as you walk up the right bank of the Spree towards the centre (very pleasant it is too, and river trips - well worth it - are aplenty). There's also a nice drinks and snack place a short stroll along the canal by the side of the hotel. The only annoying factor was the bedroom sunblinds, which automatically descend when the sun gets going, but in doing so block your view! Our room overlooked a busy road; it didn't annoy us since the double glazing cut out most of the noise, but another time we would ask for a room on the canal side, which would presumably be quieter.", "Date": "June 27, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "packerbacker04", "Title": "“Facility fine, but no control over room temp”", "Author": "packerbacker04", "ReviewID": "UR15697117", "Content": "The facilities are fine. Everything is clean, and the breakfast is pretty good. My main complaint is with the temperature in the room. I stayed in this Hotel the third week of April. It was starting to warm up in Berlin, with temperatures in the high teens (or near 70 degrees fahrenheit). The heater in my room was on, and the room was quite hot. I called the front desk to ask how to turn it off, and I discovered that a) one does not have individual control over the systems in each room as a guest and b) while they could turn my heat down, they could not turn it off. I then opened the window wide. This, in turn, led to a lot of street noise coming in. I travel a lot, and I had probably the worst night of sleep in any hotel the past year. It does no good to have a clean place and a good breakfast if you are tired the next day when you meet your client.", "Date": "May 6, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "London", "Title": "“Too much \"OK\", but no \"WOW\"”", "Author": "Writerwriter", "ReviewID": "UR15636135", "Content": "I stayed in the hotel room - so maybe I'd have felt different if I'd stayed in one of the apartments that are also offered. First, the good things: it's just steps from the U-bahn metro. It's immaculately clean. Bathroom has a large tub. Staff were friendly enough. The room is large. well decorated and beds are comfortable. I think we had one of the better rooms, overlooking a little green scrap of park and facing south. The worse points wouldnt have mattered if it had been a cheaper place, but for the money it's just that I have had better value elsewhere. (There was too much \"OK\" and no \"WOW!\" in other words.) The buffet breakfast was OK - the scrambled eggs were burned yet were still put out for the guests to eat. Not a great selection of cereals, breads, etc. not bad, but just ....average. The bedside lights weren't comfortable to read by, although there was plenty of lighting. The district, though not far from the centre, was sort of suburbanl, not many places to eat locally if you didn't want Indian or the hotel restaurant (after the burned eggs, I was wary of the latter) and there was no vibe to the district at all. There was an electricity saving system in the hotel which is theoretically good - but it meant you had to remember to put your key in a slot as soon as you entered your room, so the electricity would keep working. I kept timing it wrong, putting the key in before the room door was shut, or forgetting and then being in the bathroom when the electricity suddeny went off, etc.! Towels were barely adequate, small and thin. Toiletries OK, nothing luxurious. I just didn't feel it was a hotel I wanted to return to, but if you're already booked there, don't cancel ....I think you'll find it is okay even if does not thrill you. .", "Date": "May 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kent", "Title": "“Perfect hotel”", "Author": "AhVienna", "ReviewID": "UR14853680", "Content": "Great location for exploring Berlin. Hotel very clean, modern, comfortable beds, great buffet breakfast, all staff friendly & helpful. Very reasonable price. Enjoyed Indian restaurant over the road - perfect after a busy day of sight seeing. Would recommend 100%.", "Date": "April 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Comfortable hotel and good location”", "Author": "travellingdali", "ReviewID": "UR14384056", "Content": "I stayed in the Derag from March 13 to 16 and found it very good. Staff were always very polite and helpful, room was very spacious and comfortable and the buffet breakfast included was excellent. Its a business type hotel but I would recommend it for any kind of traveller. Its only a short walk to Unter den Linden which is the historical centre with museums, galleries and the brandenburg gate.", "Date": "March 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Amsterdam", "Title": "“Above average with but disappointing because of its potential”", "Author": "da_brickbat", "ReviewID": "UR13924686", "Content": "We stayed for 5 nights in early February. The location is a little far to walk to Alexanderplatz but the U-Bahn is really like 20 steps from the hotel. We took a deluxe apartment but with the short stay option rather than the hotel. That saved us about 30% off the price. Apparently the difference is that the rooms are only cleaned twice a week and breakfast is included. The apartments have a kitchen - a FULL kitchen with cutlery and plates cups and glasses and a dining table and everything you need. We bought food and made our own breakfast. We were pretty tired when we arrived so we ordered room service. The food was a bit pricey and ok quality. The apartment was big and clean and neat. The TVs are small and the choice of english language programs was incredibly poor. Thats not really the hotels fault - it's a German thing. The staff were polite and efficient most of the time. The safe in the room is tiny - too small for a laptop. That was annoying. The wifi is pretty expensive, especially when they say they are a 4 star hotel and nowadays I expect free wifi in a 4 star hotel. A week of wifi cost about 70 EUR and the download rates I was getting were only like 20 or 30 k/s so we couldn't really stream video on the laptop either. Podcasts came through fine though. Their authentication system would cut in every few hours and kill any downloads you were running as it resets. That was a pain. The aircon & heating is seperate from a ventilation system that works all night whether you want it or not. The fans were a little noisy and kept my wife awake on the first night. The next day we called, and they got a technician to turn it off only for our room. We also needed their help to get the heating system working. There are no instructions in the room and control panels are pretty useless without someone explaining it to you. There is no temperature control. The parking was about 150 m. away from the hotel. We had sunny weather most of the time but I can imagine that being a long 150 m. in the wind and rain. Next to the parking is a supermarket that actually had a pretty good range of organic foods. Just down Wallstrasse there is a shop that specialises in Australian food. It has some really nice things. I can recommend the Tasmanian Leatherwood honey. Its pretty strong but there is nothing like it on some toast with a little butter. On checkout, they said we had used the minibar which was not true. They immediately removed the minibar items from the bill. Overall, I would recommend it - especially for a family trying to get a nice, big, clean room for a reasonable price. With a few changes it could really be a fantastic place. As it is, its just pretty good.", "Date": "February 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Leeds UK", "Title": "“Comfortable Stay at the Derag”", "Author": "janiejanie", "ReviewID": "UR12015378", "Content": "First time to Berlin, and this hotel, therefore I cannot compare it to any other hotels in Berlin. I found the location very convient and there is a underground stop right outside the hotel. Did not eat in the hotel, therefore cannot comment about the food but the staff, well all very friendly, and there is a great hotel bar, which one can get very comfortable in.", "Date": "December 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Great Hotel, Great Location”", "Author": "JADEScotland", "ReviewID": "UR10638011", "Content": "This hotel is at the South End of Museum Island, about a 10/15 minute walk from the centre. The hotel was spotless, the staff were lovely and location was quiet but close to the centre so you could walk everywhere. If you didn't want to walk there was a U-bahn stop at the front door.", "Date": "November 6, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Notts", "Title": "“Friendly Hotel in Friendly City”", "Author": "TinkerbellNotts", "ReviewID": "UR10283412", "Content": "Just back from short stay in Berlin, wonderful city break made all the better by the accommodation. Friendly helpful staff, clean well appointed rooms, great facilities and good location. Will definately be back, soon I hope!", "Date": "October 24, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Well worth its price and more!”", "Author": "Rezarta", "ReviewID": "UR10114414", "Content": "Well located and priced downtown hotel. We stayed there for one weekend and were impressed with how much it offers for such a reasonable price. The hotel is perfectly located next to a red-line subway station which makes it very accessible. Few minutes walk and you are by the pedestrian cobble stone streets in Berlin. The rooms are well sized, some have a great view overlooking river Spree which in Fall was pictoresque. The breakfast is great too, with a lot to chose and the staff friendly and accomodating. For what you pay, it's well worth it and a lot more. I would stay anytime again.", "Date": "October 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london, UK", "Title": "“perfect location”", "Author": "snogaroonies", "ReviewID": "UR8839358", "Content": "You couldn't beat this hotel for location, literally 10 seconds walk to the Markisches Museum underground line (U2 red)...and that's if you were dawdling! We stayed in an double apartment room which was huge! We were expecting a little kitchenette in the corner of the room, but what we got was literally a suite with a large sitting room and kitchen complete with microwave and dish washer. We didn't bother with the hotel breakfast - we stocked up with milk, cheeses and meats at the supermarket down the road and then ordered from reception freshly baked rolls and croissants to be delivered to our door. Who could ask for more! Admittedly the maid only cleans the room and changes the towels every other day, but we never put our towels out to be refreshed every day even when we have the option. The staff were extremely friendly, spoke brilliant English, and it was spotlessly clean! We ate in the restaurant two nights and had complimentary drinks and extra starter both times, and the food was gorgeous! A previous review had said that the hotel was a little out of the way for nightlife...this is true, but when you've been out sightseeing all day we certainly didn't have the energy. The lovely restored area of Nikolaiviertel with lots of great traditional bars and restaurants is only a 10 minute walk away, and if you haven't got the energy to walk that far and fancy something other than pork knuckle, the Indian across the road is superb too! I recommend the Punjabi/Maharaja Thalis...both fantastic value for money!", "Date": "September 21, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "cambridge , england", "Title": "“Excellent base for a break in Berlin”", "Author": "jan55", "ReviewID": "UR6818588", "Content": "Hotel was very comfortable. Staff were helpful and friendly. An excellent buffet breakfast. Right next to the underground station. We would definitely stay there again.", "Date": "February 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "stafford", "Title": "“great city great hotel”", "Author": "karenfrost", "ReviewID": "UR6797157", "Content": "This was a lovely hotel which was very clean and welcoming. Rooms were spotless and modern and had a kettle hairdryer, tv, mini bar, 2 easy chairs and a desk/dressing table. The mini bar price was very cheap for a 4* hotel. 70cl bottle of wine was only 11 euros. Beds were extremely comfortable. perhaps some nice toiletires would have improved it even more. They only offered the usual body wash/shampoo and a tablet of soap. Breakfast offered loads of choice. A small sample of what was on offer was cereal, fresh fruit, every kind of bread/roll imagineable, cold meats and cheeses, smoked salmon, eggs. bacon, sausage, strudels and pastries. One of the best hotel breakfasts that we have experienced. We got it included in our package price which by the way was only 70 Euros per room per night for bed and breakfast (early bird offer from hotel itself) The lobby area is small but impressive as it is open all the way to the top of the hotel (6 floors) and the rooms are off a gallery landing around it. The bar is in this lobby area and be warned is only open from 6pm onwards. Complimentary coffee seemed to be available in this area from breakfast time onwards but was never there when we arrived back from a day of sightseeing. Reception staff were exxtremely helpful and efficient. they soon brought us extra pillows and a towelling bathrobe on request. The wellness area is welcome at the end of a day of walking the city although not as impressive as it looks on the pics. It has a sauna and steam room but the inviting lookin jacuzzi is in fact a freezing cold plunge pool. This area was mixed so dont be suprised to find naked men and ladies around. The location is great. we transferred from schonefeld airport by s and u bahn within an hour. We also then walked to many major attractions from here such as the brandenburg gate checkpoint charlie, parliament buildings, berlin dom. There are bars and restaurants within a 5 min walk. Reception staff will direct you. We ate at the indian immediately over the road on our first night due to apalling weather and had a wonderful meal. We would definately return to this hotel again and recommend it to anyone.", "Date": "February 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Loved Berlin, loved Grosser...”", "Author": "mobster21", "ReviewID": "UR6779756", "Content": "We just turn back from beautiful Berlin... We stay for a 4 nights trip to the Grosser... Excellent service from the reservation to the reception... Excellent location... 10 meters from U Station... Very clean... and very nice building... Thanx for everything... We loved Berlin... We loved Grosser...", "Date": "February 11, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Athlone, Ireland", "Title": "“40 years too late...”", "Author": "kaaw", "ReviewID": "UR6753380", "Content": "As said before, the hotel is in an excellent spot directly by the U-Bahn station. When you are arriving by public transport this is wonderfully convenient. That said, the grosser is one of many hotels in the immediate vicinity. The hotel itself is deceptive on entry. The expectations of a grand lobby created by previous reviews and the hotels own web site photos are shattered immediately when you walk into a small area with worn furniture. The effect of the half horse coming through the wall and the atrium feel when you look upwards makes the hotel seem grander than it actually is. The building is very art-deco in design and there are still hints of the original decor throughout. It's disappointing that the bedrooms have been sterilised by modern furnishings etc. The mirror in the bathroom is the only hint of what once was.... Staff excellent - good service at reception and an exceptionally quick responce from housekeeping to swap the cot (bet you can picture our 8 year old's face when he saw it!) for a single bed. Bar staff different every day - some more friendly than others. Breakfast provided from 6am (helpful for those with early flights) and was usual German fare with selection of meats, cheeses, breads, cereals etc. Hot food left something to be desired - if you want eggs go for the hard boilded, as opposed to the \"soft\" which were closer to raw than cooked. If you're down early you can choose from a fantastic selection of pastries also! Overall ok hotel, but nothing special. Probably stay elsewhere next time.", "Date": "February 7, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Rooms": "5", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Excellent Value - Loved the Atrium”", "Author": "CheshiremanUk", "ReviewID": "UR6612297", "Content": "Excellent value 4 star 10 minutes walk from all the old eastern centre venues inc Alexanderplatz. Transport from the airport (Schonefeld) is about 40 mins and costs about £2. U bahn station is next to the hotel. Will definitely use this hotel again..", "Date": "January 17, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "London", "Title": "“Not that much in immediate area”", "Author": "spark6791", "ReviewID": "UR6574543", "Content": "We stayed at this hotel over Christmas time (3 nights). The hotel itself, the rooms and presentation were immaculate - no complaints there!! Whilst the hotel is located relatively central, and is just meters from the underground system, it was a good 15min + walk to an area where we could take advantage of restaurants/bars. There was nothing immediately around the hotel - not even an off licence so we could buy our own drinks (given the hotel bar was shut during our stay). It would obviously depend on your own tastes whether this would pose a problem, and in summer, the walk would not have been an issue. Also- we were given a very bad steer by one of the receptionists who suggested we head to the area around Zoo station for \"restaurants, bars and the like\" .... there was nothing in that area, in fact we stopped at another hotel there and they told us to return to the area we had just come from as there was nothing bar KFC and Burger King! A good 2 hours wasted!! Renember, Berlin is NINE times the size of Paris - definitely read up on some suggested places to eat and drink before you leave!", "Date": "January 11, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Northern Ireland", "Title": "“Perfect for longer stays in the city”", "Author": "DebTheGerman", "ReviewID": "UR6504880", "Content": "I booked this hotel from a German hotel booking service. As my husband and myself were staying in Berlin for a week, we found it very convenient that this hotel offered apartments. The apartment we were given was excellent - very large with two televisions, two fridges, an enormous bathroom and lots of cupboard space. We were able to pre-order rolls, etc. from the bakery around the corner and these were left outside our apartment each morning,so we could have them for breakfast - typically German efficiency! Great location, quiet but easily accessible via U-bahn and bus to both the new city centre and the old one. Would not hesitate to use this hotel again and if you are staying for longer than a few nights, it is great to have the convenience of an apartment. There are also several supermarkets and a bakery within a few minutes walk, which we found very useful as you have a cooker, etc. in the small kitchen. Great place to visit for history buffs (as I am) is the STASI Headquarters on Normannenstrasse (U-bahn Frankfurter Allee) which has a wonderfully creepy feeling and many artifacts from the Cold War era. There is also a small 'cafe' where a local lady makes you tea/coffee and cakes while you watch a video of Berlin during the division of Germany. Not to be missed and you can even see the office of Erick Mielke, Chief of the Stasi.", "Date": "December 27, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New York City, New York", "Title": "“Loved the Derag Hotel!”", "Author": "sfslinky", "ReviewID": "UR6501325", "Content": "We enjoyed our stay here very much. The hotel was extremely new, small and modern. Our room was very comfortable and the bathroom was a nice size. The breakfast buffet was a nice way to start the day. When we first arrived, there were gummy bears on our pillows. The best part is having the train station right across the street from the hotel, so it was extremely convenient and easy to get around all of Berlin. The beds were so comfortable and we always had a great night's sleep. There is a nice Indian restaurant across the street as well a great internet cafe another block away. I would recommend this hotel.", "Date": "December 26, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Fantastic Hotel”", "Author": "Alana_Simpson", "ReviewID": "UR6366185", "Content": "Everything about this hotel is excellent: - great location, close to the u bahn station and within walking distance of all the main sites. - rooms are spacious and modern, with a great bathroom - staff are helpful and friendly - excellent value for money I would definately stay here again.", "Date": "December 12, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leicestershire, UK", "Title": "“Great Hotel for exploring Berlin”", "Author": "leehill1507", "ReviewID": "UR6158203", "Content": "Just returned from a 4 night stay at the Derag Hotel Grosser Kurfuerst Hotel. One of the best attributes the hotel has is its location. Situated in Mitte, the entrance to Markisches Museum U-Bahn station on the U2 line is literally on the hotel doorstep (see candid photo of tube station entrance from our room). The station is two stops from Alexanderplatz, the first major station on the way into the city from Berlin Schoenfeld airport, and we were stood in our room only 1 hour after getting off the plane. The location gives an excellent base to explore the city and the hotel is easy walking distance to the Fernsehturm (TV Tower) and Nikolaiviertel. Stadmitte is only a couple of stops away on the U2 line, where you can shop at Galleries La Fayette and Postdamer Platz (a major commercial centre) is only 5 stops down the line. Check in was simple, and we had a large double room, which made the room rate of €70 per night seem a bit of a bargain. The room was nicely decorated / furnished and spotlessly clean. The batroom was large and modern and we had plenty of wardrobe space. The service was very efficient - We had a small problem with the safe when we arrived, and this was resolved within 5 minutes of us calling reception with minimum of fuss. The only real negative I could think of was the thin walls between rooms. Whilst this didn't cause too many problems, apart from the odd alarm clock and telephone ringing, I could imagine that if we'd have had noisy neighbours, we would not have been happy. I must say though I have experienced this problem in many hotels. We did not eat breakfast / dinner at the hotel so I can not comment on this. Overall a very nice hotel, and if you are looking for a reasonably priced hotel for a short break in Berlin, then this is the place for you.", "Date": "November 20, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Great value hotel in top location”", "Author": "Laurared", "ReviewID": "UR6086599", "Content": "Have just returned from a 4 night stay at this excellent hotel and couldn't be happier. Excellent location in quiet, safe area with u-bahn station literally outside the door. Within walking distance of most major attractions or just hop on the U2 line a couple of stops to Prenzlauer Berg area which has lots of cool bars and restaurants. Our room was large, clean and comfortable and overlooked the canal. The staff were very friendly and professional and certainly wouldn't be out of place in a 5-star establishment. Just one piece of advice - check whether your rate includes breakfast, ours didn't (our fault as we didn't check with reception) and we were stung for 13 euro per person for a run-of-the-mill buffet on our first morning. Far better to avail of breakfast in one of the many cafes throughout the city which can easily be done for under 5 euro.", "Date": "November 8, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Livingston, United Kingdom", "Title": "“Quality and thoughtfulness”", "Author": "Roy Little", "ReviewID": "UR5908954", "Content": "My wife and myself have just returned from a weekend in Berlin at the wonderful DeragHotel, Grosser Kurfuest. Upon surfacing from the Berlin u-bahn, we were immediatley met by the sight of the the hotel (10 metres directly ahead of us). Particularly handy if it's raining, as you don't get a chance to get wet. The staff at the hotel were very pleasant and helpful in getting us booked in and also with local knowledge of things to do, places to see etc. Upon reaching our room (which I had ordered flowers & chocolates for my wife) I also found a complimentary bottle of sparkling wine (on ice) had also been left. A very nice touch. The fittings in the room were of a high standard, and whilst not stunning, they did add to the character of the hotel. The hotel atrium is quite unusual for it's size and design. The breakfast area is on the first floor looking down into tho open plan atrium, as well is the rest of the hotel floors. Breakfast was excellent, with a large choice of things to eat, hot or cold. The hotel is well placed for many of the local sites, whilst being just far enough of the main streets so as to get a good night's sleep. Overall, an extremely good choice of hotel and great value. We would not hesitate in going again, and would recommend it to anyone.", "Date": "October 4, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“An excellent 4 star property”", "Author": "wimbrussel", "ReviewID": "UR5622481", "Content": "My second stay at the Grosser Kurfürst was as enjoyable as the first, a year ago. Excellent location - calm yet only a 10 minute walk from the Museeninsel, with the U-Bahn in front of the hotel. Friendly staff at reception, bar and breakfast. Nice lobby with bar. Clean, quiet and comfortable rooms. The building is clear and bright. I will most definitely return here. Try and find a web deal (I booked via Hotel[-]): during Summer rooms can be booked for as low as 59 euro (and that includes breakfast).", "Date": "August 18, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Pori, Finland", "Title": "“Worth visiting”", "Author": "Javanainen", "ReviewID": "UR5612797", "Content": "This is a hotel perfectly situated for travellers who value easy transportation in the large town of Berlin. Not to forget the fact, that the hotel itself is very modern and fascinating as well. I stayed in Derag two nights in the beginning of August with my 13-year-old son. We got a nice deal via Hotels without breakfast. You shouldn't consider lower-star hotels, if you can get one like this with 72 euros per night in a comfortable room (+ commissions). While my son was resting and looking sport from TV, I could walk round the Nikolai area and Museum Island easily. Alex(anderplatz) was also within walking distance, if you prefer a bit activity and not only use metro. From this hotel, we could make use of both U- and S- lines easily. We chose two hotels during our stay in Berlin: 2 nights in the western areas and two in this hotel. The option for the use of internet (min. 15 minutes) was also excellent.", "Date": "August 15, 2006"}], "HotelInfo": {"Name": "Derag Hotel Grosser Kurfuerst", "HotelURL": "/ShowUserReviews-g187323-d202654-Reviews-Derag_Hotel_Grosser_Kurfuerst-Berlin.html", "Price": "$81 - $1,320*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Neue Rossstrasse 11-12</span>, <span class=\"locality\"><span property=\"v:postal-code\">10179</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "202654", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/0f/5f/0f5fe9129a96fa08b37b1f02c41181fe3large.jpg"}}