{"Reviews": [{"Content": "What a Dump We just came back froma 17 day stay in Italy, All the other hotels we stayed in were great - except this one. We went with another couple and between the 2 rooms here are the problems. Both rooms stunk terribly, one shower did not work at all. Out balcony door did not work and we advised the staff who came up and took off the lock period and left it so that the patio door did not close at all, air conditoning made a lot of noise but did not work at all in either room, and fridges were disgusting and did not work in either room. Breakfast was suprisingly decent, and the lobby is in decent conditon, which sort of sucked us in. Do not stay at this place - TOTAL DUMP!! and we are not picky people, no problems with any other hotels in all of Italy we stayed at 4 other places on our trip", "Date": "Sep 10, 2008", "ReviewID": "UR331992459", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "4"}, "Author": "ontario_ca"}, {"Content": "Good Location, Impersonal Staff       View from the balcony", "Date": "Nov 4, 2007", "ReviewID": "UR731138743", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2", "Value": "3", "Rooms": "3", "Location": "3"}, "Author": "kab77"}, {"Content": "Superior location. It's the location that makes this hotel... a block from the train/bus station and walking distance to EVERYTHING! Room was clean. Bathroom, too, but the shower was barely 2 feet square, which could be a problem for a large person! Breakfast was adequate. Staff helpful. A good place to sleep. I would book again for a short stay.", "Date": "Oct 27, 2007", "ReviewID": "UR193671104", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "patkodak"}, {"Content": "Where's my wine?! Fantastic location a couple of minutes walk from the train station and all the main attractions. Foyer area impressive, room were clean and my friend's room had a cute little balcony. Shower was very small but this seems to be the way in all of Italy. Breakfast was a reasonable buffet. The only problem was that a bottle of wine we had bought in the morning had disappeared by the time we returned to our room in the evening - reception told us quite adamantly there had not been a bottle of wine in our room as the cleaner said there wasn't? They tried to help by sending a porter to our room to search for it thereby making us seem like naughtly schoolgirls - would not have hurt them to say sorry and replace it!", "Date": "Oct 15, 2007", "ReviewID": "UR388512088", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "2", "Value": "3", "Rooms": "5", "Location": "5"}, "Author": "Anon1976"}, {"Content": "no hot water We did not enjoy our stay room was dirty we arrived in the afternoon  there was no hot water till lunch time next day . We found hotel staff very rude  the beakfast was awful. This was the worst hotel we stayed in our 2 weeks we spent in Italy", "Date": "Jul 22, 2007", "ReviewID": "UR219730951", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "mityzie"}, {"Content": "great location Great location between railway station and cathedral. It's interesting how experiences differ. Unlike some other reviewers, I found the staff helpful - for example I was given full instructions how to find the nearest laundromat. The breakfast was pretty normal by Italian and Swiss standards. I spent most of my time out of the hotel so wasn't worried that the room had no view. The only negative is that the hotel is a bit shabby and needs new wallpaper.", "Date": "Jun 29, 2007", "ReviewID": "UR486295476", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "kiwi_traveller75"}, {"Content": "Bad Experience No a/c, poor service, unedible buffet breakfast and a dirty room. I must say, this was the worst hotel experience we have ever had.", "Date": "May 28, 2007", "ReviewID": "UR878475457", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "jp7124"}, {"Content": "Failed to provide a non-smoking room We had a reservation at the hotel, but the only room they could give us had a terrible smell smoke of smoke, so we had to look for another hotel. The reception desk screwed about reimbursing the money and claimed they had not recevied it form the travel agent. We found a splendid friendy small hotel across the square.", "Date": "Nov 2, 2006", "ReviewID": "UR935830603", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "4"}, "Author": "epo78"}, {"Content": "Grim I wish I had read the reviews before booking this hotel through our travel agent. As others have said this hotel is in walking distance of the train station, which was pointed out to us by the cab driver we tried to hire at first. The location is wonderful for easy access to transportation,etc. Our room was not on the Street side and not over looking the Piazza in back. We had a roof line view.....with a neighbor cat who visited the roof for it's nature call......the bathroom was small with a shower we considered dangerous because of the potential to falling through a glass shower door......the room felt like a cell.....The staff just doesn't smile....there appears to be no effort at developping customer service....they did make a dinner reservation for us and called a cab for us.....but they never smiled or made us feel like they were there to help us. Breakfast was better than we expected.", "Date": "Oct 10, 2006", "ReviewID": "UR729085031", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "2", "Value": "1", "Rooms": "1", "Location": "4"}, "Author": "sujanuary"}, {"Content": "Location great, rooms kinda suck Agree with the majority of the reviews. It is definitely a great location, but Florence is so small that there are probably a lot of places with good locales. Whatever you do, stay in the city anyway b/c cabs are such a rip. Anyway, Bonciani just completely lacks charm. No view, no balcony, no common area / patio, etc. Still, not too bad at $160US. And, hugely convenient to the bus and train stations.", "Date": "Oct 9, 2006", "ReviewID": "UR386334812", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lmarlow"}, {"Content": "Should have written this a long time ago.... except I never knew this forum existed when we took this trip.Our experience was similar to many others who have had the 'mis'fortune to stay in this hotel. It does have a great location for getting around the city,so that is the one plus I can give it.On check-in we had no problems,but the front desk staff were indifferent if not rude. I had specifically requested a room away from the streetside in earlier emails to the hotel and was assured they could acommodate us. What did we get? The only room overlooking the street with a balcony.and it was horrible. Stained spread on the bed,filthy shower curtain,nasty,dirty furniture...and I refused to take the room. My husband was embarrassed,but I went right back to the front desk to ask for a room change. When I was asked what was wong with the room I replied 'What's RIGHT about it? It's filthy.' The porter was called back and given another set of keys to show us another room. We where taken almost as far away from the front desk as we could get to the new section,where everything was brand new and the marble bathroom perfect. More of what I expected....About the heat thing? Our room was FREEZING as well,and the heater wouldn't turn on for us. When we called the front desk to ask how to get it to work,we were told it was 'too early' in the winter (this was mid-November)to use the heat and they'd bring us extra blankets if we wanted. HUH??? I had to go out and buy a heavy robe to wear to sleep in as it was impossible to get warm under 2 sets of blankets and a bedspread. The night before we checked out,the heat 'magically' went on and we had the first good night's sleep we'd had the whole 5 days we were there. I never heard any of the other guests complain about being cold, so I have to believe it was in retaliation for my room change....and because I've read about other people having similar problems...heat controlled by the front desk computer??I would never stay in this hotel again,mostly because of the staff. I think they are in the wrong business!", "Date": "Jun 1, 2006", "ReviewID": "UR962099428", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "1", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "sierram"}, {"Content": "Somewhat depressing Wished we had read the reviews before we booked the hotel. When we arrived, everything largely confirmed what I'd read afterwards. Staff that won't smile. Almost comically so. Like they're working the night-shift at a morgue. Then I noticed hotel guests coming and going. None of them were smiling either. Rooms were clean and tidy, bathrooms fine. View from the back wasn't anything to speak of, but it was quiet. So what was it? Just a general feel of the place, I think. An attitude. In a busy city like Florence, the hotel should be a kind of oasis, where you're happy to return after dodging tourists and traffic. This simply wasn't it. When even the staff isn't happy, when it takes three hours to get an extra pillow, when the mini-bar is stocked a day late with two bottles of water...Florence is full of better hotels. Do some minimal research and find one. PS. Breakfasts are to be avoided.", "Date": "Apr 18, 2006", "ReviewID": "UR641670254", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Had a nice room for 5 I was quite surprised at earlier reviews of this hotel, as we found it very convenient and enjoyed our short stay.  We arrived by car, and the hotel got us a discount pass to park at the rail station (1 block away). The Duomo and Uffizi were less than a 10 minute walk in one direction, and the Accademia (statue of David) about 10 minutes the other way. The staff, though not overly friendly, were quite helpful and we thought that the breakfast was very nice. We had a very large room which accomodated our group of 5 (2 adults, 3 children [13, 11  9]) with its own bath. We paid 120 euros/night. We didn't find it noisy, even though the street out front is a busy thoroughfare. We had no problems with the elevator either. Perhaps earlier reviewers are pickier than I am, but I would recommend this hotel, and would stay here again.", "Date": "Apr 12, 2006", "ReviewID": "UR453739052", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "ParentsOf3"}, {"Content": "Quaint if a little shabby ... After reading previous reviews, I was slightly sceptical about staying at the Bonciani for two nights.It does possess old world charm which is on the verge of being shabby, particularly the dirty hand prints on the walls in the lobby. The first thing I did was compliment the desk staff on their English and it worked wonders, I didn't have any problems with them during my stay. The lift is quite small only holding 4 'small' people, or 2 people with suitcases.My double room was 'compact' but the bed was comfortable and there was plenty of hot water for the shower. My mini-bar fridge was working but they only put bottled water in it. The TV has about 10 channels with CNN and BBC World being the only English speaking ones.I was on the third floor and had a balcony overlooking the busy street below. I didn't find the noise too bad although I was woken up at 6am by the street cleaning crew. Rooms seemed pretty soundproof as I didn't hear my neighbours.Breakfast is served 7-10am and was actually quite good. A mixture of cereals, yoghurt, boiled eggs, bread rolls, ham, cheese, chocolate spread and jams, croissants and danish pastry. There is orange juice, but it is mixed from powder, and the coffee tasted lousy after having nice cappuccinos elsewhere.If you are looking for a hotel close to the railway station and a 5 minute walk away from the Duomo, where you will be out all day and are just looking for somewhere to rest your head, then the Bonciani is what you need.", "Date": "Mar 24, 2006", "ReviewID": "UR870307751", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "///"}, {"Content": "Ask for room 460       Looking out of the room", "Date": "Mar 21, 2006", "ReviewID": "UR819700724", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Do Not Stay Here! Terrible Hotel Our stay at the Bonciani was brief, as we would not have stayed more than 1 night. First off, we just randomly stayed there because we were walking by it... I was pretty shocked to come and see everyone's review basically mirroring exactly what I was going to write. However, there were a few other events which made our stay even worse. The staff was pretty much indifferent, I didn't get rudeness until checking out. Our room was very cold when we got in, so I turned up the heat, as they had set it low. After another hour or so, there was no difference in room temperature so I called the desk. He said he was going to set it higher from his computer at his desk where they apparently impose an additional limit to the already limited thermostat in the room. Needless to say it never got a single degree warmer. When we'd checked in, we asked for the room guaranteed to be the quietest room they have available. They gave us one overlooking a really scummy set of rooftops complete with plenty of trash, barbed wire, and grime instead of one on the road, fair enough. We were not expecting there to be demolition or construction in the room right next to ours! At 8 AM sharp, they began an incessant hammering and crashing in the room which lasted for 2 hours solid. When we checked out and brought up these two facts, they of course said the room just wasn't cold, that we were exaggerating (I'm from Wisconsin, and I prefer cool sleeping conditions, trust me it was frigid), and that they had no idea there would be construction going on in the neighboring room, BUT that it wasn't supposed to be starting until 10:00 AM?! Oh and also, the breakfast does suck. It's about equal to breakfast in a cheap hostel. And the general ambience is seedy, the carpet and wallpaper is torn, dust everywhere, etc. Should probably be a 2-star classification, not the 3-star that they have on their sign. The rooms were decent sized and had cable though to their benefit.This was the only bad experience in a hotel in the 3 weeks that I was travelling, so don't be too discouraged, just don't stay at this one!", "Date": "Jan 25, 2006", "ReviewID": "UR736623888", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "1", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great location, so-so hotel We stayed here for a week in October, 2005. The location is very convenient, very close to the train and bus stations, but a little noisy, since it is on a very busy street.Rooms were small, especially bathrooms, most clean, but sometimes it seems the maid was a little forgetful.The breakfast was OK.The worst part was the service or lack thereof on the part of the front desk staff. Very indifferent, unhelpful and sometimes a little surly. Would not stay here again.", "Date": "Nov 8, 2005", "ReviewID": "UR605883361", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "emananon"}, {"Content": "A great place to spend a few days Good: Very near to the train station and a few mins walk to the Dumo. Clean, with a modern bathroom. Suitable aircon unit. Good choice for breakfast, even if you turn up just before it stops.Bad: Don't use the lift if possible, as it can smell *really* bad. The fridges (aka empty minibar) in the rooms are not switched on, so don't expect to keep anythinng too cold.Overall: Near to the action, and a lot better than some European hotels I've stayed in.", "Date": "Sep 28, 2005", "ReviewID": "UR508392719", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "-1"}, "Author": "shardlojik"}, {"Content": "Okay for three days except for the shower. The staff are not outwardly rude but don't expect much from them either. They are not interested in serving customers as Americans expect. They will not say hello, goodbye, or thank you, but they may nod their head. However, they answered our questions and delivered messages and faxes when they arrived. We had a room in the old servant quarters on the top floor and it was tiny but clean. The shower was smaller than a closet and would not meet American standards...but remember you are not in America. We enjoyed the breakfast each morning and did not have problems finding a table or having enough to eat. We had no problem with the location since old Florence is so small.", "Date": "Aug 1, 2005", "ReviewID": "UR323676041", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Find another hotel This hotel is at the top of my list of bad hotels I have stayed at. It was not only tacky, but the bathroom was dirty as well. The desk help was extremely rude. The first room we were put in reeked of carpet freshener and beer. It was dusty and the AC did not work. We requested another room and were yelled at by the desk help. The next room was strange to say the least. It did not have a room number posted on the door and the key was not the same as the others, in fact the number was handwritten on a post-it stuck to the key bob. We figured this was where they put the rude Americans that requested a different room. At least it didn't smell and had AC. We had french doors that looked out over a rooftop...that was it, a rooftop with sewer pipes, old planters, cigarette butts, and a railing to keep you in the room - as if you would dare go out there. I would not recommend this hotel nor would I stay there in the future. It was close to the train station which could have been part of the problem. Believe me, taxi's are cheap, and there is no need to stay by the station.", "Date": "Jun 14, 2005", "ReviewID": "UR209289656", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Not so bad, but... The hotel wasn't so bad, but since the reviews were read after the choice, I was expecting much worse. It's close to the train station, witch is good if you came by train, but not the nicest surroundings, except for tne basilica di Santa Maria Novella.The rooms are big and clean, except for the dust in the awful furniture.The view was terrible, to the back of dark and dirty buildings. The mini-bar refrigerator was off, and off will be, since there were notes to ask room service for drinks, and ask the kitchen staff to keep in their refrigerator food or medicine, if needed.Brekfast was ok. Bad coffe, but I asked for a better one, and got great cappuccino. The staff at the main desk was horrible. Not there to help or be nice. Not to be troubled either. You get a bit less of what you've paid for, but it's not so bad. Just a place to sleep.", "Date": "Oct 11, 2004", "ReviewID": "UR835746897", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "Ana_Mendes"}, {"Content": "OK room, terrible staff! Room was a nice size but wasn't overly clean and decor was tatty. Breakfast was good.The staff were the most un-helpful and rude we met on our whole honeymoon in Italy, customer service obviously wasn't in their minds.We don't mind a slightly shabby appearance but we do object to ignorant and arrogant staff. We won't be staying ever again and would advise others to steer clear as well.", "Date": "Sep 27, 2004", "ReviewID": "UR660281061", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Bonciani Hotel - not as bad as some of the reviews read here! Having read a couple bad reviews of the Bonciani published right here, we were a little skeptical however it turned out ok - room was very clean (and that's what's important), staff could use a little lesson in going the extra mile, but on the whole, we were there to sleep, and shower so it was ok!", "Date": "Jul 20, 2004", "ReviewID": "UR172451502", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Bonciani Hotel - Make Sure You Get a Room Away from the Main Road We stayed at the Bonciani for three nights. The hotel was close to the train station and minutes away from the Duomo and Uffizi Gallery. It was not a quiet room for us, because they gave us a room on the first floor right on the main road (Via Dei Panzani). Sirens went by all night long, buses, trucks and scooters made a lot of noise. We didn't get much sleep. It would probably have made a difference if they gave us a room on the other side of the hotel. Our neighbors on both sides of the room were Japanese too, so I'm assuming they give the worst rooms to the Japanese. The Europeans and Americans were given rooms that were not on the side of the main road. The breakfast was excellent and the room was clean and well decorated. The bathroom was also clean and quite large. Also had a refrigerator in the room. The staff was courteous, but not friendly. The restaurant right next to the hotel called the Dantesca was very good. I had the T-bone steak and it came with potatoes that were just excellent. The also have a no-smoking section in the rear of the restaurant.I think I'll stay at the Bonciani again, next time I will ask for a room away from the road.", "Date": "Jul 2, 2004", "ReviewID": "UR127231729", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great experience at Bonciani My husband and I stayed at the Bonciani Hotel in Florence for 2 nights in mid-May of 2004. I can't believe it's the same hotel as some of the other reviewers on this site were writing about, as we found it clean and charming, greatly exceeding our expectations.Our room was spacious and airy, in Tuscan shades of orange, with 16-foot ceilings and floor-to-ceiling glass doors opening to our private balcony overlooking the facade of the church of Santa Maria Novella and its piazza. The bathroom was large and spotlessly clean, all grey-and-white marble, with a huge bathtub/shower and terrific water pressure. The public rooms of the hotel were large and lovely, interestingly furnished. The breakfast room was a bit frenetic (always busy, no matter what time we went), but we never waited for a table, and the included breakfast buffet was more substantial than one normally finds in Italy.The gentleman on the reception desk in the day time was friendly and helpful, allowing us to extend our checkout time by 2 hours; the night clerk was rather brusque, but no more so than one typically finds in Italian city hotels.The hotel has a fantastic location, close to all and an easy walk with suitcases from the train station, yet quiet at night. We've travelled frequently to both Florence and Rome, on business and for pleasure, and count our brief stay at the Bonciani as among our most pleasant Italian city hotel experiences. We will definitely return there next time in Florence! I would recommend it highly (request a room facing the Piazza Santa Maria Novella, which is in a separate wing of the hotel).", "Date": "Jun 3, 2004", "ReviewID": "UR510634751", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "sailgirl"}, {"Content": "Great Location - Has a lot of potential to be better I just returned from a 5-night stay in Bonciani Hotel, Florence. The location of the hotel is PERFECT. It is less than a 3- minute walk to the main train station and less than an 8-minute walk to the famous church and the other famous squares and sites. All sorts of restaurants and sites surround the hotel. The hotel itself Yes is VERY old, just like everything in Italy. That's what gives it its' character. The rooms are old with old wallpaper, carpet and furniture. BUT, my room was clean. I did not see anything dirty or untidy. If you do get an opportunity to stay there, ask for room 121 which I think has the only balcony in the hotel. It is a large floor to ceiling window that overlooks the street, square, and train station. Also please be advised to bring your own washcloths (they are not provided) and you might want to bring a pair of flip-flops for the room (old carpet). The staff was cordial and helpful when needed (bilingual). The free daily breakfasts were filling with meats, breads, danishes and cereals. This hotel is not for people who want to stay in the room all day long. Overall I would give the hotels a low 3 stars. It is comparable with the U.S. version of a clean Motel 6, but with MUCH history and character. I would definitely stay there again. You cannot beat its location and proximity to everything. This hotel has a lot of potential to be something greater if it wanted to. But, is great as is!", "Date": "Mar 23, 2004", "ReviewID": "UR907492136", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "msbianca2"}, {"Content": "You get what you pay for This is one of the cheapest 3 star hotels in Florence, and you get what you pay for. The staff were rude, the rooms were dirty. The hotel has a lot of potential - the lobby and public area's look good, but the rooms were horrible. My advise - pay a little more for a nicer hotel. I have also stayed at the Goldoni and the Galileo, and they were both fantastic. We book online at eurovacations.", "Date": "Mar 3, 2004", "ReviewID": "UR958186452", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "malo, feo y sucio       Pagar por uso de aire", "Date": "Nov 3, 2008", "ReviewID": "UR138074089", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "Pola-Pato"}, {"Content": "bueno no esta mal   showReview(20895644, 'full');", "Date": "Oct 15, 2008", "ReviewID": "UR507829761", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "gerge"}, {"Content": "Nicht sch枚n, aber Zentral   showReview(22952232, 'full');", "Date": "Oct 6, 2008", "ReviewID": "UR467638085", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "estupendo   showReview(18417740, 'full');", "Date": "Jul 30, 2008", "ReviewID": "UR231477920", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "viajera1214"}, {"Content": "Nos defraudo bastante   showReview(17815847, 'full');", "Date": "Jul 12, 2008", "ReviewID": "UR606150603", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "2", "Value": "1", "Rooms": "1", "Location": "5"}, "Author": "GRANADINOO"}, {"Content": "Algo laber铆ntico   showReview(15045717, 'full');", "Date": "Apr 15, 2008", "ReviewID": "UR114106080", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "Igor_Bikandi"}, {"Content": "銈广偪銉炽儉銉笺儔銈儵銈光棊   showReview(19168821, 'full');", "Date": "Feb 17, 2008", "ReviewID": "UR833133097", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "椐呭墠锛嗚Τ鍏夈伀鈼庯紒   showReview(19166876, 'full');", "Date": "Dec 7, 2007", "ReviewID": "UR207892882", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Lo mejor, el sitio   showReview(10752727, 'full');", "Date": "Nov 11, 2007", "ReviewID": "UR935223516", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "nuska"}, {"Content": "Buen Hotel   showReview(8408653, 'full');", "Date": "Aug 13, 2007", "ReviewID": "UR310565137", "Ratings": {"Service": "4", "Business service": "2", "Cleanliness": "5", "Check in / front desk": "1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "mfloresv"}, {"Content": "銉曘偅銉兂銉勩偋S.M.N.椐呭墠銇т究鍒?#x201d;   showReview(19162410, 'full');", "Date": "Jul 22, 2007", "ReviewID": "UR562422582", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "椐呫倐銉夈偉銈儮銈傝繎銇勩仹銇欙紒   showReview(19159466, 'full');", "Date": "Nov 19, 2006", "ReviewID": "UR390141302", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "non cosi bello   showReview(6152961, 'full');", "Date": "Nov 19, 2006", "ReviewID": "UR230976870", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "Ginevra"}, {"Content": "鍒濄倎銇︺伄銈ゃ偪銉偄鏃呰...   showReview(21801698, 'full');", "Date": "Sep 21, 2006", "ReviewID": "UR312759314", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d202997-r19967682-Bonciani_Hotel-Florence_Tuscany.html", "HotelID": "202997", "Price": "$114"}}