{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Location!”", "Author": "Genken3", "ReviewID": "UR128306741", "Content": "I stayed here with my boyfriend July 2011. The location is fantastic, you can walk everywhere! Close to all the main sites as well a spectacular little piazzas and cute streets you will just run into! The service was great, the hotel staff were very friendly and helpful with booking tours. The breakfast was great, a lot to choose from. The rooms are clean and we had a great view over via de corso, busy street but could not here the traffic! Definitely will stay here a again, not too expensive, good value.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Stoke-on-Trent", "Title": "“Good Location”", "Author": "Trevor F", "ReviewID": "UR128042191", "Content": "Stayed here at the end of March 2012 the loctaion is great no problem getting to all the tourist areas. Used the city tour bus for the Vatican so as far as sight seeing is concerned it is an excellent loctation. Some down sides were that we booked the hotel understanding it had a bar and roof terrace however on arrival we were informed that the bar and the terrace were shut. On some days there was a slight sewerage smell in the bathroom.But the room was clean and tidy. But there was some nice restraunts around the area just out of the hotel and turn right then right again you come to the Taverna del Seminario a great place and reasonably priced. We did have an early tour one day and asked at the front desk about a packed lunch, we were told that they are not available, but managed to get some fruit from the nice lady who was up early prepering breakfast next morning. Friday morning the staff must finish early because they certainly started early and were not partculary quite holding a conversation in the corridor next to our room, I think the maintenace man must have strted early as well by the sounds of the hammering further down the coridor.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brighton", "Title": "“Good basic hotel in excellent locations for all the tourist sites”", "Author": "marinablue", "ReviewID": "UR127553117", "Content": "My elderly friend and I booked this hotel via a British Airways flight and hotel package at a very good price for a four night stay with breakfast, in two single rooms. Having read the reviews and done our homework, we knew that Hotel Regno was going to be a good basic, traditional Rome hotel without any frills, very centrally located. So our expectations about the hotel were realistic from the outset and consequently my review is based on how much (little) we paid for our accommodation. Previous comments about how well this hotel is located and very convenient for walking to most of the major sites were correct, as were the comments about the street noise late at night if your rooms overlook the main or side streets. But, hey ho, at the price of the rooms, which in fact turned out to be small doubles and not singles, who is complaining about street noise. Also, we two ladies feel quite safe walking around the local streets and piazzas at night because of the buzz all around. But we did hold on tight to our handbags, just in case…... and we needed our comfortable shoes because of all the old cobblestones in the centro storico Breakfast was a more than adequate, basic Italian continental breakfast, although you could pay a few euros extra for boiled or scambled eggs. Their black Americano coffee was the best hotel coffee I have ever tasted. And it was nice that they supplied you each with a pot each from which you could get about 3 cups. Rooms and bathrooms were very clean and neat and quite characterful. I only had a very small shower in my small bathroom. My friend’s room was larger and her bathroom had a bath and overhead shower. The maids made up the rooms daily whilst we were at breakfast which was very efficient. There was plenty of wardrobe space and hangers. We were very fortunate to have wonderful weather for the 5 days we were there and so this made walking to the sites, even to St Peter’s at about 35 minutes away, very enjoyable. A stop on the way back in the beautiful Piazza Navona for a beer, yes is expensive, but you get a little bowl of crisps and a few mini sandwiches included. It is lovely just to sit back and people watch. We booked transfers with Rome Cabs to/from the airport before we left home over the internet. We did not have to leave credit card details or pay a deposit in advance. At 50 euros per transfer, you pay about 10 euros extra than for a basic white fiat taxi cab from the airport to the hotel. But you get helpful details emailed to you like a youtube link which shows where to meet your Rome Cab driver at the airport, what to do if your flight is delayed and a big comfy, air conditioned limousine Mercedes, a lovely way to start and finish your Roman holiday. There was one thing at Hotel Regno that slightly marred our stay. After breakfast on our last day, I left in my room a 10 euro note tip for the maid and a wrapped gift that I was taking with me, whilst I went downstairs to pay the mini bar and tax bills and to leave my case. I returned to my room less than 10 minutes later to find the money and gift missing, but almost immediately a strange man, who I had never seen before, knocked at the door and thrust the gift back at me, but not the 10 euros. I was somewhat taken aback. I know I should have complained at reception but I let it go. It was unsettling as this man (who was not the guy who helps take the luggage to rooms or any others whom I had seen working there during my stay) must have been watching out for me to leave my room. He must have had an entry card and made a grab for anything left out for the maids before they did the room. He obvious was not expecting me to return to my room, even though at the time my elderly friend was still in hers next to mine. So make sure you lock up your cases and do not leave anything lying around in your room that could be pinched whilst you are out of it at any time. I wonder if he makes a habit of this?", "Date": "April 9, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great location!”", "Author": "Jane S", "ReviewID": "UR127443038", "Content": "The location is great! We walked everywhere from the hotel. The street where it is located has great shopping and is so close to the sights you want to see. They have red flags out in front of the hotel & that helped us find it as we learned our way around the city. The staff is very helpful & friendly. As soon as we checked in, we realized that while traveling, we had lost an item we needed & the staff quickly helped us resolve this problem. Based on reviews- we were expecting a tiny room but were given a 2 room suite with 2 bathrooms & a balcony. Great fluffy towels and towel warmer in bathroom. It was hot and they said AC was not yet turned on- had to sleep with windows open-- although we faced the side alley- it was really noisy for much of the evening & the noise started again in the early morning. Breakfast was just fair & hot water for tea was just warm. We loved our room & appreciated how friendly/helpful the staff was.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Location location location”", "Author": "Pofoodies", "ReviewID": "UR127426846", "Content": "Great location!! Rooms were small but adequate, however one in our group booked single. this is like the cupboard under the stairs!! In our double room shower was a problem, as it flooded bathroom; due to a design fault, breakfast was good and the location is magic. we love Rome, could recomend regno due to location as a great value hotel, would definitely book this area for any hotel if looking at pantheon, Trevi fountain or Piazza Navona etc", "Date": "April 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, England, United Kingdom", "Title": "“Location, location.......and some!”", "Author": "Sue T", "ReviewID": "UR127182825", "Content": "Just come back from a 3 night stay in the wonderful city of Rome, made unforgettable by staying in this little gem of a place. The location is unbeatable in my opinion.....literally around the corner from The Trevi Fountain and The Pantheon, tourist information across the road, buses a stones throw, and all the other glorious sights within easy walking distance. The hotel itself is extremely clean and comfortable and every single member of staff we came across was polite, welcoming and friendly. The breakfast bar has a good choice and you can pay just a couple of euros extra for a cooked breakfast if you haven't overdosed on the wonderful Italian cuisine just outside the door! Would have no hesitation in recommending this Hotel to all and hope to return again soon.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Marlow, United Kingdom", "Title": "“A good place to explore the eternal city”", "Author": "DavidC55", "ReviewID": "UR127172237", "Content": "The Hotel was situated on the Via del corso which is right where you want to be to explore this stunning city. We were only a few minutes from the Spanish steps and the Trevi fountain so everything was within easy reach. We could walk to the colusium and Piaza novona. I would say the best time of year to go is early or late summer as it can get very hot there. You can see it all from foot but buses are easy to catch. You have to buy your ticket from the tabac which are everywhere so no problem there. This city is stunning with so much to soo and it's a place for romantics to enjoy but like all major cities it's very expensive but if you allow for that it won't be a shock. The hotel was clean but small and the rooms were tiny as was the bath. I have no idea how you could actually take a bath but it was ok to shower in. The hotel is no thrills but it was fine for a place to rest your tired feet at the end of the day.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Berkshire U.K.", "Title": "“Well situated”", "Author": "triple7", "ReviewID": "UR126984210", "Content": "As previously reported the best aspect of this hotel is its location, just a 5 minute walk to the Trevi Fountain and the Pantheon. The Vatican can be walked in about 30mins the Colosseum about 20mins. On our three night break we walked everywhere from this hotel. The main Rail/Bus station can be walked to in about 40mins. The hotel supplied us with a map that was easy to use. On our first night we had a first floor room that was street facing this room was unbearably hot with the airconditiong turned off there was still hot air blowing from the outlet, we opened the windows but the noise from the street was excessive. The next morning we asked to change rooms and was given a room on the fith floor at the back of the hotel this room was cool and quite. The Reception staff were very helpful and polite. Bathrooms are very compact and the shower heads in our two rooms were positioned in a strange position hence difficult to keep the water in the bath tub and not on the floor. That said this is a nice little hotel and we really enjoyed our stay here.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Will definitely recommend to friends!”", "Author": "Steph B", "ReviewID": "UR126577885", "Content": "Booked with BA Holidays - really good value for flights and hotel. The location of the Regno is brilliant with many sights within walking distance or easy to get to by bus (stops virtually outside the door). Also a wide selection of good-value eateries in the side-streets between Via del Corso and the Pantheon. I would agree with other reviewers that rooms at the front can be noisy. The staff are very friendly and extremely helpful - much better than relying on guide-books!", "Date": "March 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "wolverhampton", "Title": "“well situated”", "Author": "dianehaz", "ReviewID": "UR126574554", "Content": "The Hotel Regno is very well situated, very close to the Trevi Fountain and Temple Adriano, the Pantheon is about a 10 minute walk and the Vatican City takes about 40 minutes. All the streets are cobbled so wear sensible shoes. I was a bit disappointed with the Hotel facilities, no tea or coffee in bedroom, or snack bar/restaurant and there is no roof terrace, it is now bedrooms. There are plenty of restaurants about, always order what is on the menu, otherwise they will make up a ridiculous price. We went with guides around the Vatican and the Collosseum, they where very good, got you in alot quicker and gave you all the information you need. Our guide around the Palantino and around the city at night was John Sebastiano, he was english but lived in Rome, he was excellent.", "Date": "March 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great Location Wonderful Staff!”", "Author": "Mary R", "ReviewID": "UR126470909", "Content": "We visited Hotel Regno in 2010 for our 25th Anniversary, had a wonderful experience. We returned again in February 2012, and we were treated like old friends returning for another visit. Everyone was so friendly, and helpful. The Hotel is also located in walking distance to most of the major sites. A large selection of restaurants to choose from, within walking distance. A true pleasure to stay at the Hotel Regno, we highly recommend them to all! Jim and Mary R.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Exeter, United Kingdom", "Title": "“Lovely Central Hotel, Avoid Rooms at The Front.”", "Author": "BondNic", "ReviewID": "UR125993765", "Content": "We booked this hotel as a package through BA ( flights and hotel) and were not disappointed. Perfect location, walked to most of the sights or took the bus. Hotel staff very helpful and friendly. The room was lovely and clean and a reasonable size however.... it was at the front of the hotel, the room was hot hot hot (even with the heating turned off) which meant having to open the windows, the room overlooked the main street which was incredibly noisy so you could either sweat the night away with the windows closed or open the windows but not get much sleep. It is a great hotel just make sure you don't get a room overlooking the front of the hotel. The breakfast was lovely although on more than one occasion we had to wait for a table to become free as it was very busy. The breakfast room is tiny, maybe this is something they could improve on. Would I go back? Yes but I would request a room at the back of the hotel!", "Date": "March 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Location and service”", "Author": "Oshitmoguls", "ReviewID": "UR125386048", "Content": "Excellent location and friendly service. Breakfast well above italian average. Room was large by european standards we had a Balconny facing via del corso.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Derbyshire", "Title": "“Brill Hotel, brill location”", "Author": "Ladybear66", "ReviewID": "UR125328354", "Content": "Recently went to Rome and stopped at this hotel after reading the reviews on Trip Advisor, wasn't disappointed at all. When we arrived the room wasn't quite ready so they gave us a free drink of coffee. When we were shown our room we were lucky enough to have a separate sitting room with a telly, plus 2 balcony's, small bathroom, but very clean. The breakfast was the usual continental, various cereals, yogurts, fresh fruit, selection of meats, cheeses, cold pizza and a large variety of different bread and cobs. The staff was helpful on the desk and gave us a map of the area and pointed us in the right direction to the sights. My only fault with the hotel is that when we had been out all day we couldn't get a hot drink when we got back to the hotel as the snack bar was closed(probably out of season, but saying that the hotel was full) and there were no facilities in the room. The hotel is brilliantly located only a few minutes away from Trevi Fountain, which is across the road and down the side street and the Pantheon is a few minutes down back of the hotel. It is about a 10 min walk to the Colosseo (we got a ticket which also included visiting Palatino Hill for 12 euro and was valid for 2 days bargain). Eating out is not cheap, (wondered why the queues for Macdonalds were so long when we first arrived), we did find a couple of chinese's which were reasonably priced, they did sell the cheapest beer, otherwise a pint of lager ranged from 8 euro up to 11 euro, shorts were 8 euros also. Will definitely go back.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Central location 100 m from pantheon.”", "Author": "Bigsexytoohotty", "ReviewID": "UR125301724", "Content": "Great little hotel. Not overly fancy. Small ( short) bed and tiny LCD but hey you don't go to Rome to sleep and watch tv. Great breakfast each morning . Located about half way between Trevi fountain and pantheon. Only slight negative was that hotel is about 2 km from station, but bus stops right outside. Like many places in Rome, had that weird sewer smell sometimes. Still trying to work that one out.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cardiff, Wales, United Kingdom", "Title": "“Excellent Hotel”", "Author": "Holly B", "ReviewID": "UR125074118", "Content": "I stayed here on a business trip and found the hotel and location excellent. The price was reasonable for the location and the room was very clean and had everything I needed. The only (small) negative was that the breakfast wasn't amazing, it was ok but the bread was quite hard and when I ordered a cup of tea on both mornings it was luke warm. But other than that it was superb, as others have said the location is brilliant and I was able to walk everywhere with the Trevi Fountain just minutes away!", "Date": "February 23, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Location perfect, could improve”", "Author": "0Odisseus", "ReviewID": "UR124760170", "Content": "The rooms in February were rather cold, the AC was difficult to configure (the porter tried to show us how but clearly didn't know himself) and the fan was quite noisy. The rooms/ bathrooms could do with some deep-cleaning or even refurbishing. Breakfast served in a small section on the 1st floor offers mostly miniature chocolate muffins, some yogurt, nice rosette bread, cooked ham and cheese. Not great for Rome, where you'd expect fresh cornetti alla crema. Stay away from the Ribena-like fruit juices. The cappuccino is also on the cold side of tepid, albeit quite frothy. This sounds like a bad review, but the rooms are actually nice, the staff at reception helpful and the location perfect. I will certainly return.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Cleaners ho through luggage and steal, rooms smell of sewage.”", "Author": "Monkeybear123", "ReviewID": "UR124114345", "Content": "Our suitcases were clearly rifled through and my duty free Chanel perfume was stolen by the cleaner during our week long stay at this hotel. The room smelt strongly of sewage, the smell emanating through the bath plug and toilet. While this hotel is undeniably in a fantastic location, I would never in a million years stay here again. There are plenty of other hotels nearby - stay there instead and avoid coming back to a smelly room that has been cased by the cleaning staff.", "Date": "February 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sussex", "Title": "“Simply perfect”", "Author": "kerry m", "ReviewID": "UR123592686", "Content": "We booked through BA Flight & Hotel - arranged for the Hotel to pick us up (cheaper than BA) 50Euro to met by a lovely man in a merc who gave us a guided tour and local knowledge for the 50 minute drive to the Hotel. The staff there are great and very helpful. Loads of food at breakfast, the room was small but we were hardly in it as there is so much to do in Rome and when we were in the room we slept in what must have been a Queen size bed. (pillows a bit hard, you might want to take your own!) The room was cleaned spotlessly everyday, there really is nothing bad to say about this Hotel. Its location is FIRST CLASS, right by the sights you'd want to see and within walking distance of everywhere you'd want to go. If you want to stay in Rome for a decent price dont look anywhere else - honestly. We stayed in January and had the most amazing weather, clear skies the entire time, tshirt weather in fact.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Guildford, United Kingdom", "Title": "“Perfect location!”", "Author": "BellaH_Surrey", "ReviewID": "UR123464161", "Content": "This was our first trip to Rome and the location was absolutely fantastic! Every site was within walking distance and there were lots of shops and restaurants nearby to choose from. Our room upon arrival was on the small side but as soon as a larger room became available staff were happy to move us. Staff were friendly and helpful and breakfast was plentiful, although sometimes the breakfast room was a bit busy and difficult to get a seat. The only downside I would say is that there is no bar at the hotel or tea and coffee facilities in the rooms; however on the whole a fantastic place to stay and I will certainly stay again when visiting Rome.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kelso", "Title": "“A fine place and centrally located”", "Author": "Larry T", "ReviewID": "UR122548479", "Content": "There was a massive number of hotels in Rome to choose from and we got lucky on our first trip to Rome. We had an excellent room with a balcony overlooking the Christmas-lit street. It was clean, comfortable, and reasonably priced. The staff was helpful and friendly. Breakfast was excellent. We walked to the Roman Forum, the Coloseum, Trevi Fountain, the Pantheon, and other highlights. We were there for three nights.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic location”", "Author": "ChristineConstantino", "ReviewID": "UR122269809", "Content": "I think that I am repeating everything that everyone else is saying but the location of this hotel can not be beaten. The Trevi fountain is a 3 min walk. The pantheon is a 5 min walk. The furthest place was the Vatican and that was a 20 min leisurely walk. We were here for five days and never used any form of transport. If I had to be negative I'd say that our room was a bit small and could have done with tea making facilities in our room. The staff were polite and friendly. Finally for those who can't live without the Internet they have free 24 hour wifi. And for those how do not want to bring computers etc they have a computer with printer in a reception area on floor one. Thank you all at the hotel Regno", "Date": "December 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jersey, United Kingdom", "Title": "“Great location”", "Author": "Jodie R", "ReviewID": "UR122174955", "Content": "First time i had been to Rome. Location of this hotel is excellant. Very clean, big rooms, ok breakfast very continental and no tea or coffee facilities in bedroom. My partner had been to Rome before and said that the location of this hotel is the best. Pleasant and helpful staff. We had a room at the front of this hotel, if you are a light sleeper like me i found it a bit noisy with the electric buses that seem to run all night.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Wilmington, North Carolina", "Title": "“Very nice”", "Author": "Leatherman", "ReviewID": "UR121810042", "Content": "We booked through BA and pre paid so rate was great. Walk to every attraction, seriously. The location cannot be touched. Very clean, nice breakfast, OK bed, small bath (it's Roma!), tiny lobby. We had a front room with tiny veranda for people watching. This place is not a four star but just great. This is a perfectly fine place and we'll stay here again.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Surrey", "Title": "“Perfect location - perfect hotel!”", "Author": "bertiebuttons", "ReviewID": "UR121136185", "Content": "Thanks to the reviews on Trip Advisor we chose Hotel Regno. We are so glad we did. The hotel could not be in a better location and for the 4 days we stayed there, we explored the entire city without using any public transport. We had stayed in room 450 which was considerably larger than we expected, which had a balcony. The room was double glazed and noise was kept down to a minimum. The breakfast was very good as well. We plan to stay there again on ouir next visit to a wonderful city.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent, there is nothing more to ask for on a holiday”", "Author": "rianjdeus", "ReviewID": "UR121043710", "Content": "I had been to rome earlier on business but this was the first time i had been on a holiday with my family and my friends. We were debating quite a bit before the holiday on whether this was a right choice or not. However we were happy that the room was good on the 5th floor with a nice little balcony facing the via del corso. The hotel room was spacious and better than many hotels i had stayed in milan & rome. The best part of the hotel is the location and all the main siteseeing locations are just walking distances. And if you can strech a bit and walk for 20mn or so then u can reach even the vatican and castel sant'angelo as well. And within few meters, you have the pantheon, trevi fountain, spanish steps, colesseum, Piazza Venezia,Piazza de popolo etc.., we have done most of siteseeing walking around and the staff are quite friendly and do help. And my 4year daughter wanted to go the Mcdonalds as usual and the best part was it was also just 20meters away from the hotel as well. You could do loads of shopping on the via del corso on the way to piazza de popolo. I have been recommending all my friends to stay at this hotel for thier holiday at rome.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Surely the best-located hotel in Rome”", "Author": "Shortbreak_Dave", "ReviewID": "UR121031702", "Content": "Rome is a city for doing on foot and the great sights are nearly all outdoors - and the Regno couldn't be better to facilitate it. Lots of people have mentioned how close the Trevi and Pantheon are on either side (with the Spanish Steps and Piazza Navonna not too much further) but a couple of minutes up the street is the Marcus Aurealis column and not very far the Piazza del Popolo and the Villa Borghese park. Down the street a couple of minutes you're at Pizza Venezia and right in front of you il Vittoriana. After that, another 10-15 mintes you're down to the Colisseum and the Forum. Apart from that, excellent breakfast to fuel you. Staff helpful and friendly. Rooms fine - a tiny bit cold (but there are extra blankets in the cupboards to sort that).", "Date": "November 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "melbourne", "Title": "“A great place to stay in Rome”", "Author": "930turbo", "ReviewID": "UR120933407", "Content": "First vsist to Rome and could not have picked a better location to stay. Easy walking distance to all major sights in Rome. Rooms not big but very comfortable and clean. Staff were very helpful and friendly. We stayed here 3 times during our month in Italy and each time looked forward to coming back. Free Wifi but some rooms not serviced so had to go to the guest lounge or even just out if the hallway at times to get a signal, but no big deal and all part of the experience.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Rome November 2011”", "Author": "Dkerr_10", "ReviewID": "UR120825694", "Content": "We stayed at this hotel from 13th of November for four nights. Brilliant location - close to the Pantheon, Trevi fountain, shops, restaurant and a little market on the other side of via del corsa. We had bed and breakfast - there was tea, coffee, fruit juice, cereal, bread, rolls, cold meats, cheese, yogurt and fresh fruit - no cooked option - but it was ample. There was no bar but a lounge was available with wifi and a pc. The room itself was very comfortable - nice comfy bed - the BBC news chanel and CNN were the only chanels in english. I would stay here again but would ask for a different room next time. We were in room 242 (second floor) and even with the windows closed there was considerable noise from the street below (one night an opera singer was performing for the restaurant down below! he was good! )and we could hear our neighbous chatting. However all in all we enjoyed our stay here and the weather was fantasic - clear blue skys every day.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Best location in Rome”", "Author": "Sydney_traveller_7", "ReviewID": "UR120322275", "Content": "This hotel has about the best location in Rome. Approximately 5 minutes in one direction to the Pantheon ,a similiar distance in the other direction to the Trevi Fountain and surrounded by restaurants to suit all price ranges. The hotel lobby is small and unimpressive but our room was a good size and very clean with a balcony overlooking the Via del Corso. The bathroom was very modern and had a retractable clothes line in the shower recess which was very useful. The breakfast is quite a good spread of fruit juice, fruit, meat, cheese bread yoghurt pastries etc and coffee or tea made to order ( rather than left to stew on a hot plate). Free wifi or paid internet via a terminal were available but only on the first floor. The staff were helpful without being effusive. I would happily stay here again.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Location, Location, Location!”", "Author": "Angela A", "ReviewID": "UR120175412", "Content": "The hotel itself was very nice and in a safe location. Location was PERFECT! Close to everything you would want to see in Rome. Our room was nice and clean! The breakfast was amazing and fresh! The only complaint was the service. They were not too friendly.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gloucester, United Kingdom", "Title": "“Outstanding situation for exploring Rome”", "Author": "joss1085", "ReviewID": "UR120064292", "Content": "We stayed at the hotel for half term ( british) for 3 nights. The situation of the hotel on Via del Corso is outstanding with everything ( including the Vatican) with walking distance. The staff were great and the quality of the rooms excellent. The forum is less than 10 minutes. On one side of the road is the Pantheon and piazza Navonna and over the road is the trevi fountain and the Spanish steps you could not ask for a better situated hotel ( my third time to Rome). The breakfasts are very good and you can fill up for the day ( unless you have teenage kids of course). Air con in the rooms and despite being in the fron of the hotel it was very quiet at night with the windows closed.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Surrey", "Title": "“Great location, No air-con!”", "Author": "JHoop81", "ReviewID": "UR119871043", "Content": "We stayed at the Hotel Regno from Monday 24th-Thursday 27th. Postitives: The hotels location is perfect, slap bang in the middle of the city and walking distance from many of the big tourist attractions and many restaurants and cages etc. The rooms were very clean and we had free wii-fii available which helped when researching thugs to do in Rome. The beds were comfortable, big plasma TVs and a good breakfast selection. Not so postives: No air-con! The hotel is advertised as having it but we were quickly told that it wasn't working in any room in the hotel. Unfortunately when we arrived we quickly realised that our room was facing the main street, which had road works going on right outside our window for virtually the entire night, every night. We were left with two options-sleep with the window open so we could have some fresh air, but then lay awake due to the very loud noise, or keep the windows shut but literally sweat to death because it was so hot in the rooms. I know the hotel can't control the road works but we should have been advised that the air con would not be available as this led to 3 pretty poor nights sleep and this did impact on the day times too! Staff were not overly friendly and gave us some incorrect information about where to get busses from (not a major issue but frustrating none the less), said there was nothing they could do to help us out regarding sleep concerns! No fans available, no other rooms etc. Shower was tiny and there was no bath (again no biggy but why does the website say each room has a bath?) I would stay here again but I would first make sure the air-con was fully functioning and would not completely trust everything they say on their website.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“excellent value and location”", "Author": "colinwilcox1", "ReviewID": "UR119858573", "Content": "Me and my husband spent three nights in the hotel Regno it was our first visit to Rome. The room was comfortable and clean and the staff were friendly and helpful. The breakfast was good with cereals fruit meat cheese rolls etc. Plenty to choose from. The central location meant we could walk to all the places we wanted to visit. Rome is a wonderful place to visit and the location meant we could go back for a rest for a couple of hours and then continue exploring .", "Date": "October 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jersey, United Kingdom", "Title": "“Excellent Location and Helpful Staff”", "Author": "Anne462", "ReviewID": "UR119821243", "Content": "My husband and I travelled to Rome for a week to celebrate our wedding anniversary and what a fantastic time we had. We arrived at the hotel after dark and were made very welcome immediately by the reception staff. We had requested a room with a balcony but none were available on our first night. However, our luggage was moved to one the following morning for the rest of our stay. Nice sized room, well furnished with comfortable double bed, clean bathroom with good shower. Great buffet breakfast with friendly service and the location couldn't be better. On our first night we wandered around the corner looking for a restaurant (and there are plenty close at hand) and heard the sound of water. We had our first meal overlooking the Trevi Fountain! The location of the hotel means that most of the sights are within easy walking distance but for Vatican City we were advised to take the No. 62 bus from right outside the hotel (1 euro each and tickets can be bought from Information Kiosk opposite the hotel). Don't forget to wear comfortable shoes as you will walk miles every day discovering new sights around every corner. Our week in Rome surpassed our expectations and we would definitely recommend the Regno to anyone who wants to be in the heart of the city in a comfortable value for money hotel.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Omaha, Nebraska", "Title": "“Location,location,location”", "Author": "zanzara64", "ReviewID": "UR119689151", "Content": "This hotel, located on the Via del Corso, is in the center of many sites that first-time visitors to Rome would like to see. It is within walking distance of the Pantheon, Trevi Fountain, Forum, Colosseum and Spanish Steps to name a few. The rooms are quiet, even when they face the street, and very clean. It is near restaurants of every type and price range and the staff are very helpful when they give directions. The continental breakfast buffet was very good and the breakfast room is nicely decorated. The service in the breakfast room was good. In a building very near, some great pizza and grilled sandwiches are available at a decent price.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Friendly staff and great location”", "Author": "MelbournePoppy023", "ReviewID": "UR119504232", "Content": "The room was great, very clean and comfortable with (small) bathroom and separate toilet, good furnishings and lovely bathroom amenities in a little chiffon bag. The staff were extremely friendly and helpful, particularly on our last day when we were heading off to get the bus to the train station, until they told us there was a bus strike - so they managed to get a taxi for us! The location is fantastic on the Via del Corso, within walking distance of so many of the main sights such as the Colosseum, Forum, Trevi Fountain, Spanish Steps etc. Breakfast was good with excellent coffee and delicious bread rolls and other goodies and you can order eggs for a very small additional payment - the lady working (very hard!) at breakfast was wonderful -very friendly and helpful. We were very happy with this hotel and would recommend it.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“The best hotel location in Rome”", "Author": "112Margaret", "ReviewID": "UR119458299", "Content": "We had a wonderful stay at the Hotel Regno in Rome. The location of the hotel is outstanding, its located on via del corso, which is in the heart of Rome-walking distance to all the major tourist attractions, only 100 metres from the trevi fountain. The shopping on via del corso is fantastic and the hotel Regno is also surrounded by lots of trattoria's, bars and gelatoria's. The Hotel Regno has a nice decor, we stayed in the family room and the four of us slept comfortably each night-it was quiet with an ample size bathroom. The staff are polite and friendly and are always eager to help with directions. Breakfast was fresh and ample, coffee was great and we all really enjoyed our time at the Hotel Regno. I would definetly recommend the Hotel Regno in Rome to all travellers.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Australia", "Title": "“Brilliant location and wonderful staff!!”", "Author": "Laguna5", "ReviewID": "UR119104338", "Content": "I booked this hotel based on reviews and I was not disappointed. 3 adults traveling together. The triple room was well sized (for Europe). The location is just brilliant. Steps from the Trevi and all other major spots. Great restaurants nearby. The best part was the lovely welcoming and helpful staff. In particular the breakfast ladies!! I would stay here again without hesitation.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great position!”", "Author": "Abdan", "ReviewID": "UR118673520", "Content": "This hotel is in a great position, few minutes walk from the Trevi Fountain. Room and bathroom were large with a little balcony overlooking the rooftops of Rome at the back of the hotel. Very clean and comfortable and friendly reception staff. Breakfast had good variety and there was plenty of it, certainly enough to keep you going to lunchtime. Would definitely recommend this hotel. There is a great restaurant called Sabatini's in the nearby St Ignatious Square. Definitely worth a visit.", "Date": "September 27, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Melbourne", "Title": "“Perfect location, beautiful breakfast, wonderful staff”", "Author": "Josie_Jo_Aus", "ReviewID": "UR118163738", "Content": "We had 5 nights in a quad room for 2 adults and two children aged 7 and 10. After an overnight flight from Singapore we arrived tired and hungry and the staff kindly offered for us to join the guests in the breakfast room even though we weren't due to book-in until 2 pm. This was an absolute blessing as it gave us the energy to wander off to admire the Trevi fountain and Colosseum before lunch. We mostly ate in the streets between the hotel and Pantheon and every meal was fablous. Would absolutely stay here again. The room was plenty big enough and the bathroom was huge! The kids really looked forward to the buffet breakfast each morning which was extremely filling! They especially enjoyed the hot chocolates served in jugs!!", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Reading", "Title": "“Great Location, Friendly Staff”", "Author": "RichardHawkins", "ReviewID": "UR117928475", "Content": "We stayed here for my girlfriends birthday on 6th August for two nights. We had a 5th floor room facing the main road. The room was spacious. It had a small balcony and we took the 1 chair from the room + stool from the bathroom and sat out drinking champagne in the sun. Interestingly we thought there was a roof top area with bar, but when we tried to access it, it was closed. I enquired at reception but they said it was just a normal roof and not open. We did not notice any street noise with the windows shut and both slept well. The breakfast was nearly finished on the Sunday so there was not a lot of choice left when we got there, slightly better on the Monday but we did not starve. There was free internet on the 1st floor via a code you got from reception. The only problem we had was that I had taken a birthday cake for us to eat. We ate half and then covered the remaining half with a carrier bag and left it on the hotel tray along with our candles and plastic champagne glasses. We came back after our day out the next day with coffee ready to finish off the cake, only to find it had vanished. Long story short the chamber maid had thrown it out and taken our candles and glasses. Eventually we got our glasses back as luckily she had taken them to the bar. We felt the hotel might have done something like got some more cake for us, and the guy behind the reception the next day asked if we wanted something to replace it but we were checking out by then. The man on the night before whilst appologising did not offer anything. Still the night before he had been very helpful, lending me money to go the tabac shop to buy matches to light the birthday cake as the hotel did not have any (this saved me a trip back up in the lift to get my money). But despite the cake saga it was still a nice hotel", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Highland Park, Illinois", "Title": "“Wonderful hotel”", "Author": "Saul552", "ReviewID": "UR117707599", "Content": "This hotel suited us very well, right across the street from a bus stop and within walking distance of many attractions. The staff was very friendly and helpful, giving us restaurant recommendations, directions, and advice about what to do. The breakfast was also very good.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Geelong,Australia", "Title": "“Great position in central Rome..helpful staff...scrumptious breakfast”", "Author": "maabs", "ReviewID": "UR117642353", "Content": "This Hotel is in central Rome in Via del corso and you can walk to all attractions from here...the Trevi fountain is around the corner and the other main attractions in CBD very close by...There are lots of cafes, restaurants and shops all close by and if you prefer the buses and trains are easily accessible nearby...Our room was on the smallish size but very clean and functional.The room was cleaned everyday if you liked and the breakfast buffet was scrumptious with plenty to eat and great staff...You have free wifi on level one , you just have to get a code from the reception to access it everyday. The staff at reception were good and answered all questionIf you hire a car make sure it has GPS as the streets in Rome are crazy and you will get lost!!", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Terni", "Title": "“Centered in Rome”", "Author": "Punditalia", "ReviewID": "UR117292535", "Content": "The Hotel Regno is a small hotel at the midpoint of the Via del Corso, as central and convenient a location as any in Rome. It's located in what were two adjacent buildings and access to some of the rooms is unusual in that the corridors are interrupted by winding stairs connecting the diverse levels of the original buildings. We had a problem with this as there was a baby with carriage etc. in our party. The friendly and helpful desk staff resolved this quickly by moving the baby and parents to a room on the same level as the elevator landing. Our room was a small suite, nicely furnished, and with a very inviting balcony. Breakfast was large by Italian standards, though not the feast that some American and German travelers expect.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Rye, Australia", "Title": "“Great boutique Hotel in fabulous location”", "Author": "Mars2611", "ReviewID": "UR117125124", "Content": "Lovely hotel in absolutely great location! We stayed in comfortable triple room, with a little balcony, just gorgeous. Very well soundproofed as it was noisy outside. Good buffet breakfast, internet available and tourist information. Gabriele was helpful and fantastic to deal with before and during our stay - thankyou,thankyou. Would love to visit again!", "Date": "August 23, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Cute Hotel in Excellent Location”", "Author": "AnnieL79", "ReviewID": "UR116850184", "Content": "Small hotel in wonderful central location so you can walk to all the sight. Small and basic room but everything you need in a city. Breakfast was fantastic and the staff were really friendly", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "New Zealand", "Title": "“Great location”", "Author": "sequoia-design", "ReviewID": "UR116692970", "Content": "Very small room. Some wear on the carpet. Bed fine for 1 person but would be too small for 2 people. In-room safe. Min-far with FREE bottled water. Walls thinnish - could hear conversations, shower in the room next door; also some street noise. Smallish bathroom with very small shower stall. Clean bathroom. Effective air conditioner (needed in the hot, humid summer heat). Friendly helpful staff. Free continental breakfast. Complimentary bath slippers. Very good location -- easy walking distance to Pantheon, Trevi Fountain, Spanish Steps, Colosseum, other sites.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Ipswich, United Kingdom", "Title": "“A lovely place to stay”", "Author": "Ian186338", "ReviewID": "UR116369415", "Content": "The friendly welcome we received as soon as we arrived set the tone for the whole holiday. This is a small but well run hotel with very helpful and friendly staff. The room was air conditioned - a must in Rome in August!! The daily room service was also very good. There was a warm welcom to breakfast every day. The staff at reception could not have been more helpful. The hotel is very central and is in easy walking distance of all that Rome has to offer. We would stay here again and recommend this hotel to anyone. One slight warning however, there is a 2 euro per person per night tax charge that you must pay before you leave. This wasn't included in our tour pacakge and we had to pay 50 euros before we left. I guess this is the same for all Rome hotels and not the fault of this hotel.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "College Park, MD", "Title": "“Convenient and Quaint”", "Author": "mstrpoker", "ReviewID": "UR116364319", "Content": "Stayed here for a few nights on what was a trip of a lifetime (this years anyway) LOL. Hotel Regno room 452 was absolutely fantastic. Close to major tourist areas like the Pantheon, Coliseum and Trevi Fountain we found this hotel perfect for the money. Let's face it, Rome isn't cheap, but we were happy to spend the money here. The restaurants in the area were great as well. Follow your noise for the best smells. Will definitely return to Hotel Regno in the future.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "australia", "Title": "“Fantastic Hotel !”", "Author": "kolbach", "ReviewID": "UR116230515", "Content": "My family & I stayed here 6th July - 10thJuly , what a fantastic hotel ! We had a room on the 4th floor which was clean and tidy, the bathroom although small was fine. The Breakfast was plentyful with great coffee !. The beautiful Trevi Fountain was about a 2 mins walk from the hotel, and the Patheon just behind the Regno. It was also about a 10mins walk to the Flavian Amphitheatre . Would we stay here again - you bet !!", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "clancy", "Title": "“WONDERFUL hotel!”", "Author": "ClancyMontana", "ReviewID": "UR116071154", "Content": "Our stay at Hotel Regno was heaven! We had just had a horrible experience at another hotel not too far away from Regno and they had 2 nights available for us. They had been informed previously that we had been robbed at the subway (Rome) and were so very kind to us. They reassured us there was a safe in our room, to please go up to the eating area and relax and have a cappaccino and some food while they made up a room for us. We stayed on the 6th floor and had a darling terrace with a table, chairs, lounge chairs and beautiful plants...and an overhead retractable covering in case of rain. The room was very clean, air conditioned, soothing colors, updated furniture, WiFi, and the breakfast was great. Many choices and awesome coffees! They could not have done more to accommodate us and help us past our bad experiences we had had in Rome prior to our arrival at the Regno. Very close to the Pantheon, lots of great shops/ restaurants and the Trevi Fountain. They called a cab for us on the day we departed for Fuimicino (50 euros) and the cab was very prompt and took about 30 minutes to get there. GREAT hotel.... a little $$, but very worth it to feel safe, welcome and taken care of. Montana", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney,Australia", "Title": "“Excellent stay - again”", "Author": "dulcieb", "ReviewID": "UR115926783", "Content": "We booked a quad room. We had been to Regno before a few years ago though. We weren't disappointed. We had a level 5 quad room, with a lovely very large balcony. The room was large - definitely big enough for the 4 of us, with a nice bathtub. Breakfast was excellent - continental with cappucino, meat, cheese, croissants, bread, yoghurt, cereal. Very nice. Service is also excellent, recommendations from the hotel about where to eat and how to get places are reliable. Internet didn't work from the room, but we just sat in the public area on the 1st floor, which was fine.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Harrogate, United Kingdom", "Title": "“Excellent service and location”", "Author": "jandsetc", "ReviewID": "UR115796585", "Content": "Excellent service from hotel reception. We arrived at reception to be told,that unbeknown to us, our booking company had ceased trading last month. The hotel had kept rooms for us despite not knowing whether we would arrive or not. This difficult situation was dealt with sympathetically and in excellent English by the reception staff. It would be difficult to find a hotel in a more convenient location to visit the sites. Our rooms were comfortable, clean and quiet if rather compact.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Location Location Location”", "Author": "Family_on_the_go1962", "ReviewID": "UR115027822", "Content": "A really well located hotel with friendly and helpful staff. The room we had faced the via del Corso but the triple glazing made it very quiet. We were impressed with how clean it was. Furnishings were new and it was well maintained. We would stay here again. We felt it was value for money for the location as it was right next to the pedestrian walkway through to the Pantheon and the Piazza Novona and a very short walk to the Trevi Fountain. There was a myriad of restaurants to choose from. I would stay here again without reservation.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Hobart, Australia", "Title": "“Great location, ordinary hotel for family of four”", "Author": "Kingstonbeach", "ReviewID": "UR114993093", "Content": "The hotel Regno is in a fantastic location, very close to the Trevi and the Parthenon but does not cater for families of four. Our quad room was so jammed we could hardly open the door to the bathroom. I'm guessing however that's the way it goes in ancient cities like Rome - if you want an apartment you probably have to head out to the burb where you lose the excellent location. Pretty average breakfast as well. Would not like to have the room that opens directly into the breakfast room either. Hotel has a bar but no barman so it's not open, shame. For over $450US per night I would have expected better. The free wifi only worked on the 1st floor.", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Israel", "Title": "“great location and service”", "Author": "ofiraf", "ReviewID": "UR114666297", "Content": "We stayed with our 1.2 year old boy at the hotel and we had a very nice stay Room is not large but very clean and quiet, service was excellent -staff are very friendly and helpful. there is free internet if you have the laptop with you Breakfast is ok - simple. Maybe the price is high for 3* hotel but I guess that’s Rome in general And most important Location is GREAT walking distance from everything. hope to stay there again", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Excellent Location”", "Author": "Rrodent", "ReviewID": "UR114586064", "Content": "We stayed here for 5 nights in June 2011. The hotel is in a fantastic location, right in the middle of Rome! The hotel was very clean and our room was one of the spacious we had encountered on a trip - there were 3 of us so it was a triple room. The Sofa Bed was very initially very uncomfortable however once the hotel staff were informed they supplied extra blankets to put under the bed which made a significant difference. Considering that a new mattress could not be plucked from the air, they solved the problem the best they could. The breakfast was okay - would have preferred a bigger choice of cereal other then cornflakes, cornflakes and cornflakes and also some of the fruit supplied once opened up could not be eaten. They were only minor negatives about the Hotel. The hotel staff were great except for the one young gentlemen who had the personality of a brick and was just has as helpful however the rest of the staff were more then happy to answer questions. Overall I would recommend this hotel as it was very clean and also due to its location.", "Date": "June 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Great location”", "Author": "Eileen B", "ReviewID": "UR113714391", "Content": "The location has made it so much easier to get out and experience the sights of Rome. Simple breakfast, comfortable bed, easy access to everything.", "Date": "June 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Heart of the city”", "Author": "Teampower", "ReviewID": "UR112015215", "Content": "Location location location!! Situated in the heart of the city this hotel isn't overly big or fancy but is walking distance to all the main attractions and the staff were friendly. It also offers free wifi which no other hotels we've stayed at have. Room was clean and tidy. Perfect stay for those that want value for money and central location.", "Date": "June 7, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Wantagh, New York", "Title": "“Great location but lots of problems”", "Author": "benohen", "ReviewID": "UR111003316", "Content": "Shower flooded, the commode bathroom floor (across from the sink and shower) was soaking wet in the morning and on the last day, the toilet wouldn't flush... major plumbing problems. The continental breakfast was sparse, there was no restaurant in the hotel and you couldn't get coffee at the hotel anytime except during breakfast hours. There as no lobby and the staff was friendly but not very helpful. The location was amazing and we walked to every major attraction except the Vatican. If I were to go to Rome again, I would look for another hotel with a similar location.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "honolulu", "Title": "“Great location & breakfast -we'd say there again”", "Author": "margaretm808", "ReviewID": "UR110707608", "Content": "Felt very comfortable there although wish staff could speak English. Difficult to communicate with housekeeping, etc. ie asked for pillows...got shampoo, tv's didn't work Men at the Front desk staff bit stiff but women were friendlier and again even though there were 2-3 behind desk....only one could speak well. Great about booking tours for us. Fantastic restaurant in alley on right side. Access to wireless email easy but difficult to figure out how to. When you look up networks, you cannot directly access Hotel Regno but have to go through another network first. When suggested that they highlight that when they issue access codes, got the \"look\". Lobby quite crowded and they also keep the stored luggage out front so no place to sit. Little stuff...great hotel.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Maidenhead", "Title": "“Great location in the heart of Rome”", "Author": "DH14", "ReviewID": "UR110258930", "Content": "We had a great stay in the Hotel Regno. The location is wonderful - a short stroll to the Trevi Fountain in one direction and the Pantheon in another. You can also walk to the Forum nearby. Plus there are bus stops right outside the hotel and you can easily reach the Vatican, Colosseum, Trestevere and many more locations. We had a large family room on the first floor which had space for 4 people. It was spacious. Breakfast was fine. The hotel staff were friendly and helpful. They also arranged airport pick ups and drop offs (55 euros in cash). The only negative point was the room was a bit dark and the bathroom needed better ventilation. But overall a pleasant stay. Also the hotel roof terrace is no more. The access area has been turned into another room.", "Date": "May 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gold Coast, Australia", "Title": "“Location unbelievable!!!!!!!!!!!!!”", "Author": "beckchur", "ReviewID": "UR107912884", "Content": "My mother and I stayed at the Hotel Regno for 3 nights in April and again overnight in early May. We were so pleased with the central location. We were literally a few minutes walk from the Trevi Fountain in one direction and the Pantheon in the other. It was also easy walking distance to the Colosseum, the Spanish Steps and Piazza Navona. The staff were helpful and pleasant, the room spacious, comfortable and clean and the breakfasts tasty. I would definitely stay here again if I were to visit Rome in the future.", "Date": "May 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Southampton", "Title": "“Perfect location, great service, a useful city centre stop-over.”", "Author": "gravyfancier", "ReviewID": "UR106555847", "Content": "Statyed here week before Easter with my wife and daughter. There's no doubting the convenience of the location of Hotel Regno - it's right on Via del Corso, with all of central Rome's attractions easily walkable. Great for returning late afternoon after a day's sight-seeing to refresh before heading out for dinner. Reception staff friendly, welcoming and helpful. Breakfast was fine - typical of Rome tourist hotel, with a good selection of cold meats, cereals etc. Our room, although small, was comfortable, consistently clean and although a little tired and would benefit from some updating, was well laid out, with a separate room for our daughter. All in all, it's an excellent budget option and I would not hesitate to return.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rochester, New York", "Title": "“If you want to stay in Rome - look no further!”", "Author": "Bringley", "ReviewID": "UR106498123", "Content": "This will be short and sweet. Stay at the Hotel Regno. Great location, great location and great location. The staff was extremely polite and helpful. Smiles all around every time we arrived at the lobby. Walking distance to EVERYTHING. Clean rooms. Comfy bed. Great shower (although tiny bathroom... be warned).", "Date": "May 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Good hotel, great location”", "Author": "andyvandin", "ReviewID": "UR106296880", "Content": "We loved Rome and had a great place to base ourselves at Hotel Regno. Great location, good comfortable room, attentive service and overall a really nice experience. I would recommend this if you are looking for a reasonably priced great located hotel", "Date": "May 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bellingen, Australia", "Title": "“Nice Hotel, Excellent Location, Friendly & Informative Staff”", "Author": "kalyngra", "ReviewID": "UR104304221", "Content": "Had 2 stays at this hotel with a tour of the Amalfi Coast in between stays. The hotel looked after a lot of our luggage whilst we were away for a week. The second stay we had a \"lesser\" room. I thought it was the best room in the hotel, it was on the first floor on the corner of the building, with a balcony on Via del Corso and the corner of Via de Pietra. Very noisy but atmosphere galore. To cut out the noise it had double shutters so sleeping was not a problem. Watching the passing parade off the balcony was extraordinary. Many great little al fresco restaurants close by. Markets across the road. In the Via de Pietra we discovered a great little restaurant La Rotunda El Tempo, I believe. Excellent Italian food including wine for under 30 euros for a couple of courses. The hotel staff were excellent with getting baggage to our room, Nice little breakfast restaurant, and concierge staff were extremely helpful with arranging Transport to Fiumicino Airport and were willing to provide a great insight into Rome and how the people think.", "Date": "April 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cobourg, Canada", "Title": "“FANTASTIC, FANTASTIC LOCATION”", "Author": "teachertravel_11", "ReviewID": "UR100890311", "Content": "Fantastic location in Central Rome. Turn right out of the front door and walk a few blocks to Vittorio Emanuele II at Piazza Venezia and once there look to your left and you will see the Colloseum in the close distance. To the right of the amazing building in front of you, up and around is the Capitoline Museum..highly recommend..be sure to find the underground view of the forum..spectacular and if you can find the elevator to the restaurant, the terrace offers a fantastic skyline view of Rome. Directly across from the Regno the pedestrian walkway with vendors is a short walk to the Trevi. To your right and across the street is a tourist info booth. You can purchase bus tickets there or at any newspaper stand. They can provide bus info and bus stops are on both sides. Turn left out of the Regno to the first pedestrian walk through on your left and if you follow the signs you will come to a the spectacular panthenon and the Tazza d'Oro coffee shop and piazzas full of candlelit, tented restaurants. The Vatican is a longer walk but you can google a walking map to see interesting sites along the way including the Spanish steps. We were told that long lineups are early in the day as the cruise ship tours and other group tours are in the morning. The Regno offered free morning continental breakfasts with great coffee and internet is 5E for an hour. Wifi is free but you have to get their code each day and sit by the front desk. We were expecting a very small room but we had plenty of room and a lovely marble and spacious bathroom, maybe because we had emailed ahead for two double beds. If you book the Eurorail several days in advance you can get a great deal and the station is easy to get around. We went to Florence for day to see the statue of David and there is beautiful architecture, bridges and leather coats and shoes, scarfs and other things are readily available at all the street lined vendor booths. For us four hours would have been sufficient in Florence and we found from 9 in the morning until 9 at night long. We would highly recommend the cooking class Andrea Consoli, Executive Chef, Cooking Classes in Rome, www.cookingclassesinrome.com. It was a great end to our trip and as much as the March rain was not a deterrent for us, it was a rainy day. Andrea was funny and interesting and his dishes were emailed to us after as they were practical, delicious and easy to make. Before sitting down to eat we were offered to do wine pairing for 20E as well, which I would also recommend. He has a great menu for dining as well and he recommends the many establishments in Trastevere area for experiencing true italian dishes.", "Date": "March 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Woking, United Kingdom", "Title": "“Perfect location, lovely room, charming service”", "Author": "DianeFromSurrey", "ReviewID": "UR99354238", "Content": "Our arrival was expected as we were greeted by name as we came into Reception. Excellent sign of a good hotel. Maps, info etc given straight away. Situated on one of the main streets and just footsteps away from the pedestrianised side streets. Turn one way for Trevi and the other for Pantheon and Piazza Navona. We had a street-facing room, number 330. Bus stop 20 metres for 1 euro trip to St Peters. Absolutely quiet with double-double glazing and shutters. Room was elegant, spacious enough, spotlessly clean. Bathroom had tub, shower-over, hair-dryer, lit mirror. Room was well lit and had air con/heating. Breakfast in airy, bright 'conservatory' was quickly served. Usual choice of bread and bakery items, fruit, yogurts, cheese, cold meats etc. (Twinings English Breakfast Tea readily available!) Our booking had quoted 'Hot Buffet' but we only saw hot drinks and a toaster machine. Found the hotel in Cresta's City brochure. We checked the rates direct with hotel before we checked with Trip Advisor's suggested 'agents' Compared all the rates. Rate was 30% cheaper with Otels.com and much cheaper than booking a package. Thought there may have been some mistake, but not! Having discovered the Regno, I wouldn't bother with anywhere else in future.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“Excellent Location”", "Author": "SazMc", "ReviewID": "UR99018058", "Content": "Stayed 4 nights.Good value for money.Did report flicking light and didn't get fixed also when people above used the loo or had a shower sounded like it was coming straight into the room.Saying this it was what it was,room clean and comfortable,but reception staff and breakfast room staff appear a bit pressured at times but nice enough.The location was very good and would recommend to others,but take it as it is. Wasn't able to use the internet though.", "Date": "March 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Great location for all the sights of Rome”", "Author": "Donnit", "ReviewID": "UR98697889", "Content": "We enjoyed this hotel, had a standard double, a comfortable room on the front corner of the hotel with small balcony. Some traffic noise even with the extra shutters, but too tired at night to care!!! About 15 minutes to Colosseum and about 20-25 to Vatican City. Good places to eat near Pantheon, and some good pizza slice places around Trevi Fountain. If you arrive at Termini station ask price for taxi to hotel, first one said 29 euros!!!!!! no way, went to another taxi rank and the price was 7.90 to get to hotel. Cheapest is to take the 175 bus to Corso for 1 euro each, thanks to hotel reception for that tip on the way back.", "Date": "March 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Banbury", "Title": "“Rome on your doorstep”", "Author": "therogz", "ReviewID": "UR97633866", "Content": "Just returned from a 3 night stay at the Regno, had awesome time. The location is fantastic, 5 minutes to the Pantheon or Trevi Fountain great restaurants and bars just minutes walk away. Our room was small but very clean and comfortable and well soundproofed from the 24 hour Rome traffic noise. Breakfast was very good but chaotic due to the fact that everyone arrived around 9 a.m. so despite their efforts, the staff had a constant battle to clear tables and seat waiting Guests.A couple of things we were slightly dissapointed with were, what appears to be the Roof Terrace shown in the Hotels Website is in fact a bookable a Room and the Hotel Bar was never open during our stay, plus there is no booze in the mini Bar, so if you want a pre dinner snifter you have to go out to find a Bar.All in all the Staff were very friendly and attentive. Just a note about getting to the Regno from the Airport. Watch out for Taxi Drivers who will Rip You Off, we walked it took 30 minutes but all down hill and it was fun.", "Date": "February 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belfast", "Title": "“LOOK NO FURTHER”", "Author": "Paddy130749", "ReviewID": "UR95925812", "Content": "We are just back after a long (rugby) weekend. The location of this hotel is superb. We were able to walk everywhere. One minute to the Trevi Fountain - a great bonus when your wife has no sense if direction and keeps getting lost! The staff were very friendly and helpful. They spoke excellent English. Breakfast was good and served with a smile. Plenty of choice and all very fresh. We had four rooms and all were really good. They all seemed to have been re-furbished recently. Great value for money - look out for their special deals eg four nights for the price of three. Very few negatives. There is a bar, but for some reason it never opens. Do not listen to the person who recommended the pizzeria two doors away (must have been the owner!). We did and it was simply awful - possibly the worst meal I have ever had anywhere. There are loads of very good restaurants nearby. We ate in Piazza San Ignacio, just around the corner and it was great. Two tips. 1. Check out the Habana bar nearby. Turn left out of the Regno, left again and go about 300 yards. It's on the left hand side. Looks downmarket, but very friendly, very reasonable and they have live music every night for no charge. 2. Always check your bill. We found several 'mistakes' in the short time we were there. I hesitate to post this review in case the Regno is booked out the next time we want to go.", "Date": "February 8, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Good value hotel”", "Author": "Bardo71", "ReviewID": "UR94757080", "Content": "This hotel is a good value option in Rome, its not luxorious but in a very good location. Ideal for a long weekend stay to visit Rome's main attractions. The minus is the staff, who while attentive, they are not very knowledgeable about Rome (ie they said the Colisseum last entry was at 6pm, which is wrong, and they said the Borghese museum was closed on Sundays, which is wrong, and failed to mention a prebooking is needed)", "Date": "January 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great hotel, great location!”", "Author": "AlyOT", "ReviewID": "UR89515280", "Content": "We stayed here on the first leg of our honeyemoon. It was a great little spot with a wonderful breakfast and easy access to all of the sights. The best pizza of our trip was at a little cafe two doors away.", "Date": "December 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“It's all about Location”", "Author": "EalingBlue", "ReviewID": "UR88615356", "Content": "The location is really unbeatable - in a few minutes you can be at Trevi, The Pantheon, or to the Campidoglio. And if shopping is your thing, head North up The Via Del Corso for the cities most fashionable shopping district. The staff were unfailingly polite and helpful, from the front desk to the chambermaids - really a huge asset to this hotel. Our twin room was clean and tidy, and obviously refurbished fairly recently. Minor grumbles? Room was very 'compact' , and there was a certain amount of noise from the restaurants in the Via de Pietra below. But you expect this in a major city centre. The biggest problem for me was the size of the single beds - I'm no Peter Crouch, but my feet still stuck out of the end of the bed, and the mattress was also pretty firm. All in all, I was very pleased with the hotel and would have no hesitation in recommending it to others.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jersey, UK", "Title": "“Great Value and fantastic location.”", "Author": "Boogyboots", "ReviewID": "UR88216963", "Content": "Read some reviews before we went and some complained of decor and service, but we found the place fantastic. It is right in the middle of the old part of Rome surrounded by ancient buildings, the major sites and the labarinth of lanes that are Rome. On one of the major shopping streets, there is a bar 2 doors away if the fact the hotel bar is never open proves a problem for you. There are dozens of good value restaurants within a few minutes walk. The Trevi fountain is 3 mins walk one way, and the Pantheon 3 mins walk the other. The vatican only took us 30 mins to walk. The hotel provides a great buffet breakfast to set you up for the day and the staff really took care of us. The room had a safe and a mini bar, with reasonably priced drinks. I will go back to Rome, and I will look to stay in the Regno.", "Date": "November 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great Hotel, Great Central Location to all sights”", "Author": "Juros", "ReviewID": "UR87810560", "Content": "Stayed five nights at Hotel Regno, Room was clean and tidy. We had a small balcony which was great to get fresh air into the room. Rooms are small, like everywhere in Rome, It was perfect for us.So close to all attractions, the trevi fountain only 200 metres away pantheon just behind hotel a 300 metres away. Roman forum, Collesum, all in easy walking distance. Close to hop on hop off buses. Would highly recommended staying here.", "Date": "November 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Adelaide, South Australia", "Title": "“Central everything - transport, restaurants, shopping, historics sights & monuments.”", "Author": "Adelaideans", "ReviewID": "UR86553584", "Content": "The reception area may be small and pokie but don't let this bother you. Our rooms were very comfortable and roomy. The bathroom was clean and of reasonable size. The breakfast room was very adequate and the food and service was good. Don't be too hung up on the rooms. The location of the hotel is unbeatable. Everything is so close to make you Rome experience all the more memorable.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sawbridgeworth", "Title": "“A perfect place from which to see Rome”", "Author": "BirdieVisitor", "ReviewID": "UR82847065", "Content": "Hotel Regno could not be situated in a better location, within easy walking of all tourist attractions. We used the bus stop just down the road to catch a bus to the Vatican as our booked tour started at 10am, but we could have walked it. During our stay we had to move rooms twice, first due to plumbing problems and secondly due to a defective rail in the wardrobe, causing our clothes to crash onto the floor ( funny in retrospect, although not at the time). All the staff were very pleasant and helpful. I would not recommend this hotel to anyone who is less than able bodied. Our rooms were on the fifth and sixth floors and most of the time we walked up and down the stairs. The lift only holds 4 people. It kept us fit. The breakfast was good, plentiful and varied. One small thing that would be an improvement would be the reopening of the bar. It exists but is permanently closed. With the absence of drink making facilities in the rooms (is this just an english thing?) the ability to obtain hot drinks and alcohol would greatly improve the hotel and increase profits surely.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Excellent Location & Friendly Staff”", "Author": "Dolce1976", "ReviewID": "UR82506453", "Content": "The location was perfect and very central to main attractions, the Trevi Fountain is literally a 2 minute walk from the hotel.... The hotel staff very extremely freindly, especially Rosa from the front desk who made our time at Hotel regno enjoyable. The rooms were very clean and comfortable. The satff will go out of there way to make your stay as comfortable as possible.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gloucester, UK", "Title": "“Great Location - Well Worth Considering”", "Author": "Joe_50", "ReviewID": "UR81915919", "Content": "Hotel Regno was our second choice because our first option at a 4* hotel was not available. We were not disappointed, however. Its location is fantastic - literally round the corner from backstreets with lots of independent restaurants, within easy walking distance of many of the major sites, and on a bus route to others such as the Vatican. Our room was surprisingly large for a city centre hotel, and although the bathroom was a bit tired, we were perfectly happy with the quality of the accommodation. The hotel fronts on to the Via del Corso, but the windows effectively kept out the city's noise and we slept well for the three nights we were there. Breakfast was pretty good - a typical continental assortment of cold cuts, cheeses and pastries. Avoid the sweetened orange juice, though! Although we tend to look for 4*hotels and this is rightly classified as 3*, we would certainly consider staying there again, if only for its great location.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Essex", "Title": "“Good all round city hotel - excellent location”", "Author": "EssexGardener", "ReviewID": "UR81401863", "Content": "We have just returned from an excellent holiday with another couple. We recommend this hotel because of its excellent location. We walked to all the main tourist attractions, and my three travelling companions are all old enough to own free bus passes!! Contrary to some previous reviewers, we found the breakfast good, both fresh and plentiful. We found the reception desk staff very helpful, especially Gabriele. Our only disappointment was that the bar never opened. We were told that it was too close to some of the rooms, and caused too much disturbance to the occupants. Although our rooms had a mini-bar, there were no glasses provided. One evening we would have loved a coffee, but were told that \"the bar was closed\". In our opinion still a good choice for a medium priced hotel in Rome.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gold Coast Australia", "Title": "“Compact, clean, central & great breakfast”", "Author": "Aussie-Jac", "ReviewID": "UR80143220", "Content": "Very efficient check-in, room clean & warm, TV remote didnt work but staff at desk assisted. Loved the plentiful continental breakfast. Very close to all the attractions. MacDonalds is just down the Lane opposite. 2 Minutes walk to the Trevi Fountain !", "Date": "September 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Neath, United Kingdom", "Title": "“we loved this place”", "Author": "richard_powell1", "ReviewID": "UR78316279", "Content": "i have to say I was really worried about staying in this hotel after some of the reviews thst have been posted, but I shouldn't have been, bacause we had a great time and i would very happily stay here again, the staff were excellent and really friendly and helpful, our room was really nice. The locaton of the hotel was of course was superb. yes the lift is small but as we alway use the stairs, it did not really bother us. The breakfast was good, and the coffee excellent. Both was and my husband agree that when we visit rome again this is the place for us.", "Date": "September 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "lebanon", "Title": "“great location !”", "Author": "lilykfoury", "ReviewID": "UR78151267", "Content": "the first impression of this hotel was rly bad :small lobby ,weird smell,narrow elevator...but then we noticed that this hotel had many positive points : it had a great location walking distance to all the important monuments and has a bus station nearbuy if u want to visit the monument of castel st angel or the vatican ..the staff is rly nice , they showed us on the map the easiest ways to get to the monuments finally the breakfast was fair nothing special", "Date": "September 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Albany, New York", "Title": "“Hotel staff was rude and not very helpful”", "Author": "mitchell810", "ReviewID": "UR77004815", "Content": "Hotel staff was rude and not very helpful...Toilet seat in the bathroom was broken...The floors in the room had not been clean in quite some time...Housekeeping did not knock, and walked in on me while I was changing, even though I had the deadbolt locked...", "Date": "August 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Not a good hotel”", "Author": "Sullivan72", "ReviewID": "UR75960986", "Content": "Just came back from Italy, I must say this hotel is not what it seems. First of all it is old, when you flush the toilet water drips from the ceiling. Carpets are nasty. Phone did not work in room to make outside call. The bathroom has a toilet and bidet in one and the sink and shower in another. Breakfast was ok. The only good thing about this hotel was the location.", "Date": "August 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Our days in Rome were hot but not...”", "Author": "CugTravel", "ReviewID": "UR75382148", "Content": "Our days in Rome were hot but not oppressive but if we were in need of cool solice on any of the days it would not be found in the Regno. From the moment we arrived we found the entry and common hallways stifling. This was particularly difficult since the crampt elevator was always busy. Moreover the air conditioning in our room limped along at best. If you sat still you were fine but if you moved around forget it. The staff at the front desk during daylight hours was not friendly at all. They never offered any assistance and when they did it was clear it was a bother to them. The short little fellow and his sidekick were very prickly and it became a game with my kids to see how prickly they would be upon entering the hotel. The only redeeming quality was the location. The Regno is located centrally near all of the historical sites and close to a Metro station. We found this extremely beneficial. The rooms were clean but the common areas were filthy. Broken tiles, dirt crammed into corners, peeling wallpaper and a hallway bathroom that put up a horrific stink. The Regno is well located but there are others. It in no way lived up to the advertised 2 star ranking. Stay at your own risk,", "Date": "August 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kenilworth, United Kingdom", "Title": "“Location! Location! Location!”", "Author": "pje39", "ReviewID": "UR74432268", "Content": "Stayed at the Regno for 4 nights - the rooms (double) are quite small but we werent visiting rome to stay in the Hotel room! The breakfast is good and we found the service to be friendly and helpful. The location is fantastic! Steps from the Trevi, Pantheon and Piazza Navona - easy walking distance to the colloseum. The Location has to be one of the best in Rome for the main tourist sights. If i visited Rome again i would try to book this hotel again.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "uk", "Title": "“ideal spot to explore rome”", "Author": "ManWithSillyHat", "ReviewID": "UR71242591", "Content": "The Hotel Regno is situated away from most of the normal tourist hotels - which is good. its a short cab ride from the main terminus and is centrally located for most of rome's historic sites. walkable to the colluseum, trevi, vatican etc. Staff friendly and rooms a good size. our room was set round the back - and was fantastically quiet, not a car horn heard all week! - good for a great sleep after a long day exploring. The bathroom was clean and modern if a little small. the shower required you to be quite agile to negotiate the way in - id be wary if you had any disability or werent as fit as you once were(!) only gripe was coffee service at breakfast could sometime be erratic, especially when the weekend staff are on!", "Date": "July 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "MA", "Title": "“What a deal!”", "Author": "jannibaby", "ReviewID": "UR69805687", "Content": "Stayed here for 4 nights in June with my husband and 2 20-something children. This was the only hotel during our 2 week trip that we were getting a quad. Our travel agent was concerned we would be cramped but when we got there, those fears went out the window. We were in room 568, which is a converted apt. on the top floor. Our room was huge with 2 twin beds and one queen that was a murphy bed type. There was a sink, table with chairs, huge balcony. Looking out our balcony we could see the Victor Emmanuel monument and at the other end was Piazza del Popolo. We were steps away from the Pantheon, Trevi Fountain and Piazza Navona. The staff were super helpful. We also appreciated the free wi-fi room. I have seen some of the reviews stating the rooms were small. I can definitely say this was not the case in the quad we stayed in. Do not hesitate to stay here.", "Date": "July 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“We loved this hotel!”", "Author": "blackbird101", "ReviewID": "UR65850038", "Content": "The location of this hotel could not be better. The entire staff was so friendly and helpful. The rooms were very clean and comfortable. We LOVED the continental breakfast, the selection was very generous and yummy, and it was here that I had the best cappuccino in Rome! For a real treat be sure and try the hot chocolate! There is a very comfortable room to use for WiFi free of charge. If you don't want to bring your laptop with you, they have a computer and you can log on for 5 euros per hour, or 3 euros for 30 minutes. The hotel itself is very cute and charming. There are so many great restaurants close by. We really enjoyed our stay and will return again to this hotel when visiting Rome.", "Date": "May 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Canberra, Australia", "Title": "“dodgy electrics, and a ceiling that drips ...”", "Author": "nmkd", "ReviewID": "UR64102853", "Content": "The location is excellent - easy walking to many attractions, the bus to railway station leaves from directly across the road, and the staff were friendly. However, the light above the bed kept flickering after it was turned off, the ceiling dripped water onto the end of the bed, and the only window was a door that opened onto a balcony shared by many other rooms - so leaving the window open for 'fresh' air didn't feel like a very safe option. The ceiling drip stopped when the rain stopped, the light was fixed the next day but then the hairdryer no longer worked!", "Date": "May 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Francisco", "Title": "“Regno is a find when you need one!”", "Author": "omralk", "ReviewID": "UR62408486", "Content": "As we know, finding a room for four in Europe is not easy. We just decided we would have to compromise if we wanted to go to Rome as a tag-along on a family trip. Thanks to Trip Advisor, we learned that if we stayed at the Hotel Regno, we could have a chance of having a comfortable, convenient, and not unaffordable trip to Roma. The actual experience proved our hopes as well. Regno's service was accomodating and available. They were able to point us in the right direction and made thoughtful and rewarding recommendations on restaurants, transport, and attractions. (I am especially grateful they pointed us to the Roma Pass, which made the city affordable, helped us escape all lines, and got us on public transport.) The rooms, converted from apartments and still decorated with sleek mahogany wood and a delightful pied a terre, were large enough that we didn't feel like sardines, The bathroom was large enough too. The location is right on Via del Corso, on a major tourist artery, but we were able to turn this to our advantage. We walked to the Trevi fountain ( a favorite of the kids', so we kept returning), as well as Piazza Navona, the National Museum, the Coliseum, Forum, the Jewish Quarter, etc. We took the Metro to the Vatican and had to take a cab to Trastavere. They booked us the cab and we didn't get fleeced on the price. The only eh-eh at Regno is the breakfast. Sufficient, but not on par with the class of the hotel. The room is a big worn, the food selection limited and bland, and it took a while to get coffee -- if at all. But we were adequately pumped to start the day, and indulge in culinary treasures almost anywhere else in the city. For the day we needed to get online, we were able to purchase it at Regno; printing was an additional charge, unfortunately, but that's not out of line. We recommend Regno for any family, and probably a couple or individual too. If only every city had such quads....", "Date": "April 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brazil", "Title": "“Near all atractions! I'll be back\"”", "Author": "BrazilRenata", "ReviewID": "UR60477457", "Content": "The best thing about Regno Hotel is LOCATION, LOCATION, LOCATION. Staff is great and helpful. The room was somewhat small, but had a little balcony that ended up adding . Breakfast could be better. Anyway, I recomend.", "Date": "April 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "uk", "Title": "“Clean, helpful and very central”", "Author": "gill145", "ReviewID": "UR60165045", "Content": "Very helpful staff. Close to Trevi fountain and 10 minute walk to Vatican or Coliseum", "Date": "April 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New Jersey USA", "Title": "“Best Location in Rome”", "Author": "KitKolar", "ReviewID": "UR59679170", "Content": "Three generations of women stayed in a quad deluxe room with balcony for 4 nights, (double bed and 2 singles). We were able to walk everywhere in Rome, and my 75 yr. old mother with 2 artificial hips and a heart stent was able to enjoy the heart of Rome without having to rely on cabs. Hotel Regno is situated between the Trevi Fountain and the Pantheon. Originally we wanted a full service hotel but we are so glad we picked this hotel for the perfect location. Breakfast was adequate to start the day. Rooms and bathrooms are small but clean ; quad deluxe had stained glass sliding dividers to separate rooms and a balcony to people watch and check the weather. Via Del Corso is a busy street and a bit noisy at times but you are in a city. Internet is available for a fee. Hotel staff were pleasant . I would definately stay here again.", "Date": "March 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hobart, Australia", "Title": "“Not far from the Pantheon”", "Author": "Virginia15", "ReviewID": "UR59010461", "Content": "Stayed at the Hotel Regno at the end of my holiday to Turkey, Greece and Italy. This was my second visit to Roma, and loved it because you are close to all the fabulous attractions Rome has to offer. Best of all it is very close to the Pantheon, one of my most favourite monuments. The service was very good. One of my favourite personal sayings is \"certainly\" and the lovely receptionist who checked me was delighted with the expression, and adopted it as part of her customer service. The room was very comfortable, but I did stay in a double room because I wanted some space for a few days before heading home after being on the road for a few weeks. There was plenty of food at breakfast and certainly enough to fill you up for a few hours. Overall a very good experience. Because it is near all the attractions I could go out in the morning for a few hours, have lunch, come back and have a rest, then go out again.", "Date": "March 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Surrey", "Title": "“Excellent city break base”", "Author": "Bob&Alison", "ReviewID": "UR58285959", "Content": "This hotel is situated on a main arterial road through the city centre and so noise can be expected for about 20 hrs a day. Our room was situated overlooking the main street & on the 1st floor. There is a small lift. We had very disturbed sleep for 3 nights but we coped. The hotel is not near metro stations. Hotel location was very useful for catching the 175 bus every 15 mins to or from Termini Station as the stop is almost outside the hotel (€1 p/person) buy ticket before you travel from information centre opposite hotel or newsagents. Validate ticket on the bus. We were pleased with the hotel as we find in general European hotel standards lower than British but this hotel disserved its full star rating. It did not have a restaurant (except for breakfast) or bar open when we were there but it is possible there may be one in higher season. Breakfast was continental, don't expect full English. There was one bedroom directly off the breakfast room which we were glad we were not in. (1st floor). It was in an excellent location to walk to the main sites of interest. Be careful of the café just down the street (south) where we bought HALF a sandwich (by accident) for €2 (rip off) however we did have a reasonable warm lunch there. We would stay here again but may pack earplugs or request a room not overlooking the main street although it was nice to see the street from the window.", "Date": "March 11, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Khartoum, Sudan", "Title": "“Super duper hotel”", "Author": "Tamreez", "ReviewID": "UR52830846", "Content": "_ excellent spacious rooms and spacious bathrooms _ no noise from the street even though our room was on via del corso side _ we had two extra beds for children _amazing breakfast and friendly staff at the resturant (haven't seen breakfast like the one in Regno in average European hotels) _helpful staff at the reception _all the good locations and main tourist attractions near by walking distance Over all, My wife and two children (3 and 5 yrs old) thoroughly enjoyed the stay at the hotel. Don't get disappointed by the small reception, lobby and the lift. Look forward to the comfort. You will enjoy your stay for sure.", "Date": "January 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great Location”", "Author": "travel_bugs_1975", "ReviewID": "UR52418094", "Content": "We stayed at this hotel in August with 2 toddlers (aged 1.5 & 2.5yrs) This hotel is in a great location, the staff were very helpful and we were offered a great rate. We had a rear room so not a great view but it was very quite and we heard no street noise, the bath has a funny step in it which made it a little tricky to bath the kids but the room was comfortable enough to accommodate us all. Breakfast was enough although seating is limited. Being a travel agent I was a little nervous booking somewhere different but I will only stay at Regno from now on. Location is fantastic, we walked everywhere so great for the little ones in the pram.", "Date": "January 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Kent", "Title": "“Excellent Small City Hotel”", "Author": "EMM1907", "ReviewID": "UR52325885", "Content": "This hotel is in a great location. 2 mins walk to Pantheon, 5 min to Trevi Fountain, 10 min walk to Roman Forum and 15 min walk to Collaseum. Very clean. Newly renovated rooms are big and clean but not all rooms have been upgraded yet. Room 224 was very nice and a good size for 2 adults and 2 children under 11. Lots of restaurants are nearby and its in a lovely shopping area too. Bad point is that it takes about 40 min by taxi from the airport. There is a small breakfast area but no dining room but this does not matter as the area has many places to eat. Would definitely recommend this hotel for a city break and it seems to be on quite a lot of discounted internet sites so great value. Mini bar was very cheap price wise so again good value unlike most things in Rome !", "Date": "January 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "East Aurora, NY, USA", "Title": "“Perfect Location”", "Author": "Frostie716", "ReviewID": "UR51000664", "Content": "The Regno is the perfect hotel for sightseeing in Rome. The tourist office is directly across the street, just steps from the bus stop and the nearby sopping and dining is exeptional. The breakfast room and restaurant is elegsnt. The staff was very helpful with storing bags, advice for transportation and making our stay enjoyable. This was our second visit to this hotel and I will be back!!!!!!!!!!!!!!!", "Date": "December 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Great value for money”", "Author": "Kayt83", "ReviewID": "UR50704236", "Content": "This was our second stay at the Hotel Regno and we were again very happy with it. The position is fantastic and it is difficult to find a comparably priced hotel in such a good location. The staff were wonderful and our room was unusually large by European standards, with a separate sitting area and a balcony. The rooms are very clean and a good breakfast is provided. The only drawback is that the hotel can at times be a little noisy given its location, however this never troubled us at all and we will definitely consider staying here again when next visiting Rome.", "Date": "December 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Great Location & Great Value”", "Author": "Nicky092", "ReviewID": "UR47687039", "Content": "My husband & I stayed at Hotel Regno for six nights, from 12th October 2009. We found the location ideal for getting to various sights. We had a room on the sixth floor, with a lovely terrace, large enough to sit out and enjoy, with flowering plants. The double-bed was placed against the wall, which was a bit inconvenient, but the bathroom was very up-to-date and there was always hot water. Unfortunately the sounds from the neighbouring bathroom were very evident, when running baths or showers. The Reception & Breakfast Room Staff were always so friendly and helpful and we always got a smile. The small entrance hides a great little Hotel.", "Date": "October 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Manchester England", "Title": "“It was good enough for what we paid”", "Author": "bluwes", "ReviewID": "UR46168772", "Content": "We have just got back from a 3 night post cruise stay at the Regno. We hav estayed in Rome before a number of times at better and more expensive hotels. However with the cost of the cruise we were a little more cost concious this time in selecting the hotel. The hotel has a brilliant location within easy walking distance to all the main tourist sights. We had a great room at the top overlooking the Via Del Corso. There were no noise problems as the heavy curtains and double glazing blocked out any street noise. Our friends room was at the back and had two single beds which didnt impress and as the hotel was full they couldnt changed, so had to push them together. Breakfast as previously stated on this thread was nothing to write home about and the coffee was almost undrinkable but it was enough to get us going. The staff were helpful and very pleasant and arranged an airport transfer for us, as well as giving recommendations for somewhere to eat. If you have big money to spend then stay somewhere better, but for what we paid we were more than satisfied", "Date": "October 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Nerang, Australia", "Title": "“A Little Disappointed”", "Author": "Kconnoll", "ReviewID": "UR35718680", "Content": "This is a our second stay at the Hotel Regno. First stayed in June 2007 and was so happy with our stay then we decided to stay again this year. The hotel is so centrally located and within easy walking distance of all the major attractions. We had two stays at the hotel this year 3 days prior to a cruise and two days after. Our room on the first stay was great except for the bathrom every time we had a shower we nearlly flooded the bathroom. Didn't matter what we tried we could not adjust shower nozzle to stop it spraying onto the floor. Also the airconditoining unit was very noisy and old. On our return stay our room was so tiny we could hardly move. To be honest it was really only suitable for one person. Also once again the shower nozzle faced the wrong way and we flooded the bathroom floor each time we showered. Also the lock on the bathroom door was broken. The air conditioning unit inthis room was also nosiy and on the last day it broke down. The carpet in hthe hallways was in need of a good clean. My husband was unable to drink the coffee at breakfast . On a positive note the staff were always friendly and helpful. Would only stay at the hotel again if we were guarantee us a larger room than our last stay and that the air conditioning unit and showers hd been fixed.", "Date": "July 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great Place to Stay”", "Author": "Desi78", "ReviewID": "UR34530884", "Content": "We spent four memorable nights in Rome, and loved our stay at Hotel Regno. It is clean, neat and spacious with lovely friendly staff. The location is central to all the must see landmarks, restaurants and shops. We had a lovely spacious terrace over looking Via Del Corso - not that we spent much time out there. Hotel Regno was recommended to us and I would have no hesitation in recommending this lovely spot to anyone looking for a central affordable hotel in Rome. Breakfast was nothing to write home about. My husband and l love our Italian coffee and realised after our first breakfast, in order to get a 'real' cafe latte we had to specify we wanted 'espresso e caffe latte' as they were bringing us a pot of frothed milk with disgusting instant coffee. They must have thought we dont know real coffee. Other than this little hiccup l would recommend Hotel Regno as a great spot.", "Date": "July 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Aylesbury, Buckinghamshire", "Title": "“Absolutely fantastic, great location - will definitely stay again”", "Author": "Maz969", "ReviewID": "UR32508312", "Content": "My friend and I stayed at the Regno from 5-9 June 2009. All I can say is it is in an absolutely fabulous location, numerous shops, restaurants and all the best attractions are within walking distance. Rooms are of a good size for Rome, to our shock they had given us a double bed but that wasnt a problem as the bed was very large! Bathroom was clean and tidy, mirrors everywhere. Our room looked over the villa de corso main street, however the double glazing was excellent and drowned about 95% of the street noise. I would recommend the Piccolo Bucco restaurant which is a small family run place just around the corner from the Trevi Fountain, try to avoid the restaurants that prey on you as you walk past, the food is good but they do pressure you and were too mainstream for our liking. We took an open top bus tour but found this was not necessary due to the close proximity of all the best sites. You must see the Vatican and Piazza Navona is great for people watching and a cappacino. Take your credit card - across the road from the Spanish Steps, Gucci, Prada, Versaci and all the top names. The trip was expensive but well worth it, I will definitely be going back for round 2 next year.", "Date": "June 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "California", "Title": "“Good Hotel - Perfect Location, clean with good staff”", "Author": "Dutchman1968", "ReviewID": "UR31641293", "Content": "My wife and I stayed here from the 25th through the 28th of May. If was a great location with easy walking access to all major attractions. We only took a cab to train station to leave. Rooms were clean although it does need new carpet etc but clean for Italy. Bathrooms were fine although the hot/cold pulsed a lot. Great breakfast and very helpful staff. It was pricey, but I think if you want to stay in the heart of Ancient Rome you're going to pay those rates anywhere.", "Date": "June 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "London UK", "Title": "“Location is great”", "Author": "MikeLondonUK", "ReviewID": "UR30728445", "Content": "My wife and I stayed with two friends at the Hotel Regno for six nights. My friend booked the stay in Rome through Kirker Holidays and, after the booking was made, I did have some reservations after reading some comments on Trip Advisor - some were very good and other very poor. However Kirker are normally very good so I did look on the positive side. The location of the hotel is excellent, there are dozens of good restaurants nearby and it was nice to join the crowds at either the Trevi Fountain or the Pantheon before turning in for the night. We found the hotel reception staff upon arrival (Rosa and Gabrielle) both friendly and helpful. We had booked a room with a bath but the room offered only had a shower. Fortunately the hotel were able to offer us the choice of two further rooms, both with baths. The rooms were a good size with ample storage etc. Our room overlooked the Via del Corso which is a busy road but fortunately the windows were double glazed and eliminated most of the traffic noise (apart from police sirens). We were able to keep these closed at night since the room was air conditioned. Although the standard of decoration was a little tired the level of cleanliness was very good with clean towels daily and bed linen changed every other day. As in other Trip Advisor comments the breakfast situation could be much improved. The number of tables was inadequate for the number of guests so if you arrived later that 8.00am you would search for a table (especially for more than two). The coffee was dreadful and they only seemed to provide enough fresh fruit for the first few diners. After the first day we found a really good deli down the Via delle Muratte (opposite the hotel and near the Trevi Fountain) where we brought our own bananas and took them into breakfast. However I have no complaints about the cold buffet, the cereals or croissants. If you wanted something hot it did cost extra, my wife did have a runny boiled egg one morning for 1.70 euro!! Although there was a number for room service this was never answered. After visiting reception we did manage to get a pot of tea sent to the room after about 40 minutes. To summarise the hotel was in a great location, it was clean and we had no major complaints – the breakfast accommodation the only thing that really let them down.", "Date": "May 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "the royal county", "Title": "“Location, Location, Location,”", "Author": "navanman_9", "ReviewID": "UR28067531", "Content": "If you want to see the sights of rome well this is your hotel and location. The hotel was spotless, good size rooms, fantastic breakfast, Trevi Fountain 2 mins, Pantheon 3 mins, spanish steps 6 mins,Vatican 30 mins. can't say enough good things about this hotel.", "Date": "April 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Mount Waverley, Australia", "Title": "“Central to Everything Touristy”", "Author": "AlbaLima", "ReviewID": "UR27196866", "Content": "We were initially disheartened by our room which was very small for three people. (5 Night stay) . The bathroom was tiny. The staff are very friendly and helpful. But we made the most of our stay by getting out everyday and seeing the sights of Rome. On our way back to Australia we stayed there again for our last night in Italy and we were given a larger room which we loved. I would recommend this hotel for any one with a budget.", "Date": "March 31, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“If it's not one thing, it's another”", "Author": "beneatharthursseat", "ReviewID": "UR26164701", "Content": "I strongly dislike writing negative reviews, but after six nights in this hotel I felt I had no choice. After asking twice for a room for our honeymoon (on the phone and when we arrived), we were greeted by a room with two twin beds. The walls are paper thin and you can expect to be woken up very early every morning either by people walking in the hallways or by the loud construction in the dining area. After two nights, we were finally moved to another (double!) room. We were assured that they would move our luggage, but when we returned to the hotel after an hour we found the original room door propped open and the luggage still inside. At some point, credit cards that had been stored in the room safe disappeared, and when we asked for help we were met with unhelpful staff and blank stares. Charges later appeared in another country on one of these cards before we'd even returned home! The \"free wireless\" offered by the hotel simply didn't work, even right next to the router. Our second hotel room also smelled of sewage every time we opened it up after being gone for a few hours. Thank goodness for windows that open! If all you are looking for is a central location and plan to carry no valuables and sleep with earplugs in at night, then this might be the hotel for you. The positive: Great location, very central. Excellent breakfast, attentive breakfast staff. Furnishings seemed fairly new and in good shape. Nice view over Via del Corsa if you have a room at the front of the hotel. Many restaurants nearby, short walk to Trevi Fountain and Pantheon.", "Date": "March 14, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Disappointing”", "Author": "mikvik", "ReviewID": "UR23907031", "Content": "I have just spent 6 nites in the Hotel Regno Rome, as part of a 3 week trip around Italy with my partner and 2 children aged 9 and 13. The Hotel Regno was suggested by our agent but unfortunately, the Hotel was not quite what we expected. Some points to note were: + tiny rooms; + rooms in need of maintenance - ie lots of peeling paint + front desk staff with attitude (ie Question _ \"We are catching a taxi to the station. Do we just pay the fare on the taxi meter or are there additional charges for baggage ...\" Answer \"I do not know. Ask the driver what he thinks...\"; + the hotel has a good central location but no charm. I think we paid EURO 150 per night, for a double room. WHile I understand Rome is expensive, I feel we were paying a lot for very little. We got much better value in Milan (Hotel Lloyd) and Venice (Hotel Schiavello) We would have moved to another hotel with comparable rates (for example the Capo de Africa) but for the fact that we had already paid for our rooms at the Regno.", "Date": "January 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Herts", "Title": "“Hotel Regno”", "Author": "TimCHerts", "ReviewID": "UR21971704", "Content": "Hotel Regno is in an excellent location. Easy distance to the Trevi Fountain, The Pantheon, the Colosseum etc. We found the hotel to be clean, friendly and very functional. Good directions and advice given at reception. Our room was on the 3rd floor and had a great view over the Via Corsa, including a small balcony. Perhaps the rooms at the rear of the building maybe not so good. The room however, did have very thin walls. It has no lounge area as such but as Rome has so much to offer we didn't want to spend time in the hotel. Breakfast was adequate and if you are not too late in dining had lots of variety. We booked via BA, and our four night stay with breakfast was at the same rate as a travel inn in the UK.Marvelous value. Excellent value.", "Date": "November 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“great position”", "Author": "JBav", "ReviewID": "UR21900681", "Content": "We stayed at the Regno for 3 nights at the end of our holiday. The people at check in were friendly and helpful. The position of the Hotel is perfect for both shopping and sightseeing. The Hotel itself is a bit of a rabbit warren with a lot of steps, but our room was quiet and the beds were extremely comfortable. The furnishings were new and elegant and the room was very comfortable. The breakfast room was busy as some others have mentioned, but we always found a table. Some rooms opened off the breakfast room and I should think they must have been noisy. All in all, it was much better than 2 stars and I would stay there again, especially for the position, right on the Via Corso.", "Date": "November 16, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Canberra", "Title": "“Look elsewhere”", "Author": "SusieCanberra", "ReviewID": "UR21348417", "Content": "I stayed at this Hotel in October 2008 for 3 nights. Whilst the location is good , I'm sure you could find better accommodation for the price in the same area. The room - single - was adequate but the shower was a shower base with a curtain which meant the floor flooded each time it was used. The staff were disinterested to the point of being rude.", "Date": "October 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Great location, ok hotel”", "Author": "pghlwr", "ReviewID": "UR20404511", "Content": "Stayed at Hotel Regno Sept. 16-20th, as last stop on honeymoon trip to Italy. As is often cited in the reviews on this hotel, the location is very, very good- you are in the middle of many of the tourist stops, including the Trevi, Pantheon, Forum, etc. Located on the Via Del Corso, which is one of the main shopping streets in Rome. The front desk was courteous and efficient, providing us with a very useful map of Rome. No language problems. Our room, which was located on the first floor (which to us in the U.S. would be considered the second floor), was spacious, and had air conditioning, though it wouldn't make the room \"cold\" as far as U.S. standards are concerned. However, it was the only hotel that we stayed at in Italy that had it at all. One of the reasons it had a.c. was that there was no terrace or balcony of any sort (though our travel agent had requested one for us months in advance)- when we asked to change rooms, we were told there were no terrace rooms available. Our window looked out onto an air shaft- definitely our worst view in Italy. We were also told, when we asked, that there was no sort of outdoor space available for our use at all- i.e. no communal terrace, garden area etc., which I was disappointed in, as their website lead me to believe there would be some sort of outdoor area to hang out in. Also, the breakfast room/bar was on the same floor as our room, and played very loud U.S. music starting at about 6:30 a.m., which could be clearly heard in our room- luckily we had a noise machine with us to drown out the sound. Otherwise, the room was decent- larger than average, with a couch, nice t.v., a bed typical of what we found throughout Italy, and a wardrobe w/ electronic safe (which the bellhop told us to be sure to use not less than 5 times). Bathroom was larger than average and clean, though it showed sign of water damage on the ceiling and some peeling paint. Breakfast was also standard- with good cappucino, rolls and brioches, cold meats, and juice. Overall, aside from the great location, I would agree with the two star ranking, and upon my return to Rome, will most likely look for another place to stay that allowed for some sort of outdoor respite.", "Date": "September 26, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Farnborough", "Title": "“Great location”", "Author": "PicklesFarnborough", "ReviewID": "UR20391372", "Content": "Hotel Regno is the perfect location to explore Rome, 5 minutes from the Trevi ,10 minutes from the Spanish steps and all other locations such as the Pantheon , Forum, Piazza Navona and the Old Town, which should not be missed, are all within easy walking . The Hotel offers clean and comfortable accomodation. Breakfast is ok although very busy and seating limited get down early. The only thing really missing is a roof top bar to have a late drink but there are plenty of places nearby and a lack of a bar is made up by the location and the friendly hotel staff. To explore Rome I would reccomend this hotel. As this is in the business area, local restaurants are of a higher price and a 30 minute walk to the old town would see a reduction of about 50% and excellent food. Alternatively, for a unique experience, try the L'Eau Vive at Via Mongerone, 85-85a and get ready to sing for your supper.", "Date": "September 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "West Sussex", "Title": "“Hotel Regno....Could not have been better”", "Author": "nicknacks", "ReviewID": "UR19811670", "Content": "My husband and I spent four nights and the Regno, the location is fantastic for site seeing, within walking distance of everything. Our room and the common areas of the hotel were spotlessly clean and the staff were helpfull and friendly.", "Date": "September 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent Location”", "Author": "Diane Wright", "ReviewID": "UR19784868", "Content": "Room was excellent - top floor with a roof terrace overlooking the main street. Staff very helpful. Excellent location for seeing all the main attractions in Rome on foot, no need for buses/taxis. Food of course is excellent although can be expensive. If you can afford to get a guide when visiting the Colosseum and Vatican do so, if only to beat the long queues. Fell in love with Rome hope you do too.", "Date": "September 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Oxford, England", "Title": "“Friendly Staff, Great location, comfortable”", "Author": "Oxfordeddie", "ReviewID": "UR19331663", "Content": "This hotel is a real gem. Good value and in a brilliant location. The rooms are quiet and the staff are friendly. Although they speak good English, they are happy to speak to you in Italian if you're up for it- this is a rare quality amongst Italians who generally prefer to insult you with their cheesy English than listen to the dulcet tones of the few cultured Anglo-Saxons who can speak Italian. Anyway, back to the review. The only complaint is that the rooms are narrow as space is such a premium in this city-centre location. Otherwise, well worth booking. You'll love it!", "Date": "August 25, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "melbourne", "Title": "“Regno a worry”", "Author": "jasperMelbourne", "ReviewID": "UR19220656", "Content": "On arriving at the Regno we were showed to our room which was like a box and obviously hadnt been cleaned properly as someone elses toothpaste was in the bathroom.I expressed our concerns to reception and were told we could be moved to a better room the next day - I said that would be good and I would pay any extra .Breakfast was a tragic affair in an overcrowded room with little air - the only plus of the Regno were the staff at breakfast who really tried hard to please.Surprisingly there was no mention of moving to another room and on checking out were not even helped out to the cab with our bags. I would not stay at the Regno again or recommend it to anyone.", "Date": "August 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saskatoon,Canada", "Title": "“great place for family and walking ditance to everything you can do in Rome for”", "Author": "schultzie05", "ReviewID": "UR18989139", "Content": "This place is located two minutes from the Trevi fountain, minutes from great restaurants and 10 minutes from the Colosseum, the Patheon. Can't beat it Great continental breakfast and rooms . Everything you need is in this hotel! Hard to find something better I would say!!", "Date": "August 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth", "Title": "“So central”", "Author": "BeHappyM8", "ReviewID": "UR18327881", "Content": "We chose Hotel Regno because it had been recommended to us due to its location. And its location was superb. 5 minutes from the Trevi Fountain and 5 minutes the other direction to the Pantheon. Another 5 minutes on takes you to Piazza Navona. All very well sign posted. Check in was efficient and service helpful. Breakfast was served in a lovely “outside” terrace and although smallish and busy, the service was engaging and coffee came the way we asked for. Choices of breakfast was good and plentiful. Our room, a double classic room No 350, was a beautiful introduction to Italy. A comfortable double bed in a good size room with another smaller room with another TV. The bathroom was big enough and the shower was hot and strong. A balcony with room for 2 to have a glass of wine overlooking one of the numerous restaurant alleys of this area of Rome topped off a great hotel choice.", "Date": "July 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Middlesbrough, UK", "Title": "“Fantastic Location - Highly Recommended!”", "Author": "CB-UK", "ReviewID": "UR17443829", "Content": "Have just returned from a stay at the Regno Hotel. We had actually booked into another hotel which upon arrival was over 10 metro stops from the centre of Rome in a terrible area and not safe for two females travelling alone and so decided we had to move after one night. From entering the Regno hotel and explaining our situation to the reception staff they were fantastically helpful from the very start, even offering us transport back to our old hotel and picking us up again with our luggage to ensure our safety. The twin room we were given was lovely, clean and beautifully presented with a roof terrace overlooking the Via Del Corso. All the staff we encountered from the reception onwards were incredibly helpful and the location is fantastic 5 minutes walk from the Pantheon, 10 minutes from the Spanish steps in Piazza Spagna, 35 minutes walk to St Peters, 20 minutes from the Colosseum. I would recommend the hotel to anyone visiting Rome and will definitely be returning on my next visit", "Date": "July 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Good location & service”", "Author": "Austraveller49", "ReviewID": "UR17010796", "Content": "Very good location for walking tour of Rome...Minutes to Trevi fountain and comfortable walk to many other city sites. The service at reception was efficient and the room had everything. Internet through the TV was a wait of time and money...Very slow! We found out too late that we could have organised a 'packed breakfast' as we departed before 7am. The cafe next door was very friendly and had a good range at reasonable prices.", "Date": "June 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“So central”", "Author": "SydneyMask", "ReviewID": "UR16961610", "Content": "Stayed in November 07. This hotel is so centrally located we walked to all the sights including the Vatican. Staff were very helpful especially the breakfast room staff. They remembered what coffee we wanted every morning. the rooms are small but why would you want to stay there all day when there is so much to see. Enjoyable stay.", "Date": "June 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“A great little gem!”", "Author": "RealTimeTraveller", "ReviewID": "UR16767030", "Content": "This is a centrally located boutique-style hotel. If you like to stroll around interesting city sights, then it's the one for you. It's very convenient for dining out and shopping as well. Service is very good, the staff were very friendly & helpful (in the italian way, best to do some research and understand their culture). Although, not all staff are able to understand english, a few phrases from my italian phrasebook managed to do the trick. I had a pleasant stay at this hotel and would come back again if I go to Rome next time. Highly recommended!", "Date": "June 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pembroke", "Title": "“Greatest location”", "Author": "meltina_8", "ReviewID": "UR15739636", "Content": "Rome: Hotel Regno - \"Excellent\" Date: 4th May 2008 Reviewer: Maria, Malta. Stayed in quad room ( 2 adults/2 children). Comfortable. Quiet at night in spite of being on a main road. Staff very cordial and helpful. But the best thing is the location. Safe area. It is within walking distance from everywhere we wanted to go. There are so many things to see that it's a pity to miss them if travelling by metro. Reception will provide you with a very good map. Breakfast was very good and abundant too. I would recommend Hotel Regno to anyone!", "Date": "May 7, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London, UK", "Title": "“No can do, Mr. Paying-Guest”", "Author": "HydeWhite", "ReviewID": "UR14981847", "Content": "What a superb location, on the Corso. What a charming little hotel. What a tiny sweatbox of a room for $285/night. You see there's no need to have the air-conditioning on in Rome at the end of March. It just doesn't get hot enough. OK, well it's 24C (75F) out there, but in here, in this sunfree, compact and bijoux room, there's no need to lower the temperature, surely. The fridge? The room's fridge is kicking out a load of heat and the room is sweltering? \"But Sir, it's only the end of March\". If you're after service that puts you first plus a room where you don't shut the bathroom door as you bend over to brush your teeth, try elsewhere. This hotel gets an OK rating for its location and attentive breakfast staff. The problem is a clueless management who think it can thrive or survive with honest reviews like this one.", "Date": "April 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Spokane, Washington", "Title": "“great location”", "Author": "colliegirl", "ReviewID": "UR14645673", "Content": "This is a great hotel for easy access to most things. The rooms are small but adequate, the staff tried to be as helpful as they could be and some of the front desk people were really on the ball we didn't have to ask them twice about anything. We booked it through Tourcrafters and got a much lower rate then advertised. The breakfast was okay, ham, cheese, salami, yogurt, fruit, bread and rolls and the strongest coffee ever. You can almost stand a spoon up in it. Don't hesitate to give the Regno a try.", "Date": "March 29, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Illinois", "Title": "“great location waitresses are rude”", "Author": "tnaIllinois", "ReviewID": "UR13922987", "Content": "There were waitresses that poured coffee on my mom and then she said \"prago and bonjorno\" she sounded like donatella versace other than that it was very good.", "Date": "February 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Doha", "Title": "“Great Location !!”", "Author": "at_doha", "ReviewID": "UR13144560", "Content": "The location of the hotel is excellent !!. It is only walking distance to all major sights (Spanish Steps, Trevi Fountain, Forum, etc). Since the hotel is located along the main shopping artery, then shopping is very convenient. Our quad room is big and comfortable for our family of 4, with 2 teen girls. Breakfast is also satisfactory. Front office staff is also helpful, almost in every ways.", "Date": "January 31, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cheshire,England", "Title": "“A Great Find”", "Author": "Eve1", "ReviewID": "UR13077893", "Content": "We stayed at the Regno for a few nights in Decenber 2007 and the location was perfect. I had never been to Rome before and I wanted to cram as much as possible into my short stay there. We visited all the major sites and walked everywhere, this is the main reason why I would recommend this hotel as it is central to everything, literally 5 mins from both the Trevi and the Pantheon. It took us approx. 30 mins to walk to the Vatican area and that was strolling along. The hotel has a friendly and efficient reception staff, likewise in the breakfast room. The room itself was very clean, quiet, although on a main road and warm. If you want to stay in central Rome then this is a good option.", "Date": "January 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "cheshire", "Title": "“Excellent location”", "Author": "HappyTraveller2008", "ReviewID": "UR13030221", "Content": "We have just returned from our fourth trip to Rome and our third stay at Hotel Regno and would recommend it not only for the perfect location ( everywhere within walking distance ) but the standard of the service and hotel rooms. Our rooms have always been a decent size and very comfortable and the staff especially Reception,Breakfast and Bar staff have always been very pleasant and helpful. Perfect ! The Corcoran Family Cheshire. UK", "Date": "January 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“\"Location Location Location \"”", "Author": "hawk21", "ReviewID": "UR12547954", "Content": "Just back from 4 day stay at Hotel Regno. Booked this hotel through 1800hotels.ie at a good rate. My husband son and I stayed here. We required to book 2 rooms and I was looking for reasonable priced accomodation in a central location in Rome. The Regno did not leave me down. Its location is just fantastic right on Via del Corso , 3 min walk tops to Trevi Fountain, Pantheon .The rooms are small but clean and comfortable. Booking online one does not get the best rooms anyway !!!!!! ( if I had booked direct through hotel it would have cost twice the price) The breakfast in morning was continental and with plenty of variety and plenty of food available. If you want good value accomodation in Central location to major sites in Rome look no further than Regno.", "Date": "January 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cleveland, OH", "Title": "“Great experience”", "Author": "Grahamarb", "ReviewID": "UR12196048", "Content": "We recently stayed at the Hotel Regno in Rome. The location is perfect, within walking distance of major sights such as the Pantheon and Trevi fountain. The hotel is very clean. The staff were very friendly and helpful. A previous reviewer criticized the breakfast. That is unwarranted. The breakfast was more than satisfactory. All sorts of coffee, pastries, cereal, yoghurts, cheese and cold cuts. No one could ask for more. The hotel is on a main street, the via Corso. However, the room was very quiet. If we ever have the good fortune to go to Rome again, we will stay at the Hotel Regno.", "Date": "January 1, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dublin,", "Title": "“Perfect location No problems”", "Author": "Barry Lynch", "ReviewID": "UR10895095", "Content": "This hotel must be in just about the best location in Rome, within easy walking of the Trevi Fountain, which is just across the road, with the Spanish steps and prime shopping of the Via Condotti just up the road, and the narrow lanes leading to the Pantheon, Piazza Navona and Piazza Campo di Fiori just behind the hotel. The hotel does the job, although the rooms are on the smallish side. If you want more space, and the weather is good, ask for Room 660 which has an excellent flower decked patio overlooking the Via del Corso. Would be great for sipping Barolo on a summer evening in the declining orange light.", "Date": "November 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sofia", "Title": "“Fantastic Location”", "Author": "bgsnowsports", "ReviewID": "UR10874425", "Content": "We were originally booked into the Hotel Verona but got overbooked and moved here. How lucky we where, the hotel is comfortable, excellent location and very friendly staff. Great breakfast to start the day. Would reccommend this hotel without any hesitation and would stay again.", "Date": "November 17, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "adelaide", "Title": "“5 out of 5!”", "Author": "myri53", "ReviewID": "UR10661721", "Content": "such a cute little hotel.. i shared a room with my brother and sister and we had a nice big bed each, and even though our room was a bit small, it didnt bother us, as we were hardly ever at the hotel anyway.. the breakfast was the best part though!!! so much selection!! the little yoghurts were the best! nice big bathroom... very friendly staff!! we had a front room so we could see what was going on outside.. within walking distance from the trevvy fountain & colosseum..i'd definately go back there again!!", "Date": "November 7, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "new york", "Title": "“Great Location - Less than helpful staff”", "Author": "luzer", "ReviewID": "UR10264772", "Content": "booked through gtahotels.com the best thing about this hotel is the location. literally on one of the main streets of downtown rome, walking distance to many attractions. tourist information booth across the street. the concierge staff was less than helpful. didn't look up as we walked in, didn't explain themselves, overall - nothing great. wait staff was better. breakfast was ok. also - night tour we booked through them was horrible.", "Date": "October 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "melbourne", "Title": "“\"Loved it!\"”", "Author": "kathryn7", "ReviewID": "UR10181490", "Content": "We stayed at the Hotel Regno for five nights in late September and loved everything about it. The position was fantastic - such a central location. We had two rooms both of which were extremely clean and comfortable and the breakfast room was a lovely way to start the day. Guisseppe and Roberto on the front desk were very welcoming and nothing was too much trouble for them. We would highly recommend this hotel and would certainly stay there again. Excellent value.", "Date": "October 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "brooklyn, ny", "Title": "“great location”", "Author": "linzee14", "ReviewID": "UR10086710", "Content": "Hotel Regno is in the best location of Rome. We were recently there for 2 nights during our honeymoon and we couldn't have picked a better location. We walked to the colosseum, trevi fountain, the spanish steps, and even to the Vatican! The hotel was not the most modern, but it was clean and the staff was friendly and the room was a nice size with a terrace. The decor didn't look like it had been updated in awhile, but while you are in Rome how much time do you really spend in your hotel? I would stay there again.", "Date": "October 16, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kent", "Title": "“Best Location!!!”", "Author": "Fabfourty", "ReviewID": "UR10074573", "Content": "This hotel is a perfect base to explore the fantastic city of Rome. My Dad & I stayed here during our short break & were really pleased with the hotel's location, very central to Trevi Fountain, Spanish Step's, etc. Our rooms were clean & comfortable, breakfast in the morning was pretty good too. TOP TIP- The Vatican is well worth a visit & works out much cheeper if you go on the local bus rather than on the organised trip's, it's really no hassle as the bus stop's right outside & we saved 35Euro's each!!! Also, buy a Radio Tour Guide when you purchase your entry ticket to tell you about every thing. Comfy shoe's are a must too, lot's of walking. Enjoy!!!!!", "Date": "October 13, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newcastle upon Tyne", "Title": "“The Splendid Regno”", "Author": "fivetimesayear", "ReviewID": "UR8715757", "Content": "What a Hotel, the Regno has everything you need for a splendid stay in a wonderful city. My wife and I stayed here, with another couple from the 9th till the 12th of September, we chose this hotel from recommendations on Tripadvisor. The Regno couldn't be more central, if you draw a straight line between theTrevi fountain and the Panthanon, where it crosses the Via del Corso, you will find the Regno. We were allocated rooms 550 and 552, located at the front of the hotel, both had small balconies overlooking the main road, we were never troubled with any traffic noise. The rooms had been recently refurbished to a very high standard, solid wood floors and a beautiful bathroom, double bed, free safety deposit box, plenty of hanging space and very roomy. The breakfast was exceptional, exactly what you come to expect from a continental hotel, with plenty of choice and all of the best quality. The staff were extremely friendly and helpful, we used two resturants that they recommended and the were both top quality. Grill and Wine and the Hostaria Romano, both near the Trevi fountain. This is probably the best 2 or 3 star hotel that we have ever stayed in, and we travel to Europe at least 6 times each year. Try it, and you will never stay anywhere else in Rome, we will return!", "Date": "September 14, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "wigan", "Title": "“Regno fantastico !!!”", "Author": "tonyWigan", "ReviewID": "UR8674625", "Content": "Our first trip to rome & we couldnt have picked a better hotel. 100 metres from trevi fountain, everything else within walking distance. We booked it because of recommendations on this website & we were not disappointed. If we ever go back we will definitely stay here again. Rooms clean, breakfast was ok (needs a more powerful toaster though :-). Rooms air conditioned & double glazed. Safes were free. Staff friendly & helpful. We stayed for 5 nights & it was not long enough to see everything. Rome is such a fantastic place with something around every corner.", "Date": "September 8, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Nice Hotel, great location”", "Author": "Tymetraveller", "ReviewID": "UR8612702", "Content": "We stayed at the Regno for 3 nights, (August 14 to 17). We had some concerns when we first booked, as we normally stay at the Hyatt or Marriott. However the prices in Rome were extremely high in comparision to North American standards, and I could not justify the extra cost. The reception area is small, and we had to take 2 different, very small elevators to get to our room. The room was very comfortable, my wife and I slept in the pull out sofa and the kids slept in the 2 single beds. It was a good size room for Europe, both the room and bathroom were very clean. We stayed on the 5th floor facing Via del Corso, and room was very quiet considering we were facing the main street. The A/C worked well, and we had a nice little balcony, which served us well in the morning. We did try the buffet breakfast one morning (located on the second floor), but it was not that good, so we walked across the road and picked up some fresh pastries, coffee, and enjoyed breakfast on our balcony with a nice view of Rome. The staff were extremely friendly and helpful, and made good recommendations for restaurants at night. The Regno was within easy walking distance to the Trevi Fountain, Spanish Steps, Emmanuel Monument in Piazza Venezia and the Pantheon. Plus many restaurants and cheap pizzerias. Overall my family was very happy with the hotel, and we would recommend the Regno, and will stay there again on our next trip to Rome.", "Date": "September 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Reading, UK", "Title": "“A little gem in a city of materpieces”", "Author": "SStamp", "ReviewID": "UR8522449", "Content": "I stayed at the Regno from 19th to 26th August 07. I stayed in room 350 which had a double bed and a single in a little adjoining room. The bathroom was large with a lovely big shower, bath, bidet and sink area. I had a lovely big balcony, so big infact, it had two sets of double glazed and traditionally wooden shuttered french doors. There was also air conditioning, pay for view movies and free (although intermittent) internet access. The bed was lovely and comfortable and there was lots of closet space, but not enough hangers. The view looked onto the neighbouring building, but also down onto the streets below where there were markets during the day and diners eating out at night. The only downside was that I found its position on Via del Corsa extremely noisy. The hotel's position is perfectly situated for upscale shopping, tourist souvenir shopping, the Trevi Fountain, the Pantheon, Spanish Steps - a really great location. The continental breakfast was pretty dire, and the fruit jiuce (from a machine) was undrinkable. The coffee was very nice however and there were meats and cheese. The staff, especially Gabriele were just wonderful. I could not have asked for more friendly, helpful, accomodating people. They directed me to places, ordered me cars, booked restaurants, chased up tour companies - allsorts of everything - they could not have been better. House-keeping were good and gave me lots of little toiletries whenever I was running low. I had the best time in Rome and this was very much to do with the service I received at the Regno. I would have no hesitation in returning there in the future.", "Date": "August 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, Ca.", "Title": "“Not bad at all....”", "Author": "JerryLosAngeles_Ca_", "ReviewID": "UR8431348", "Content": "I'm a little spoiled, (we are Starwood hotel members) so I'm not used to smaller hotels, but this place was pretty darn nice. The service was excellent, the location is better than great ,and the rooms are nicely decorated. We had two rooms (one for the kids), and as promised, they were next to each other. The rooms were on the noisy street side of the hotel yet there wasn't any street noise in the room. The air conditioning was cold, and the breakfast was fine. I don't have any of the complaints that some of the other reviewers have. It was actually a very good place to stay for the start of our two week Italian vacation.", "Date": "August 15, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“Location Location Location”", "Author": "Glennys", "ReviewID": "UR8352777", "Content": "A rather small but quaint hotel on the via del Corso. We had been warned Hotel rooms in Rome were rather small so we were pleasantly surprised at the large size of both the rooms we had ( we had a broken trip with a cruise in the middle of our stay). The staff were helpful and friendly and spoke good english. The location was perfect. It was within walking distance to the Trevi Fountain, Pantheon, Spanish Steps and the Collosseum. It was very handy to some great eating places and about 2mins walk to an Irish Pub! Bus stop outside the front door for trips to Vatican City and a 10 min ride to the Termini. We would stay there again.", "Date": "August 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "England", "Title": "“Fantastic location”", "Author": "Chickle", "ReviewID": "UR8184976", "Content": "We stayed at the Regno for 4 nights for my mums 60th birthday. The best thing about this hotel by far is the location. Everything is on your doorstep. We found all of the reception staff exceptionally friendly and helpful, giving us help, directions, booking taxis etc whenever we needed it. They wouldn't even let us carry our cases anywhere, it was all done for us. Ok the rooms are a little tired, but they are very clean and for a three star hotel anyone who expects the Ritz are being unrealistic. A bit of stained wallpaper is not going to ruin your holiday! The air con was great, there was no road noise as the windows were so good. It's hard to find fault. The only down sides to this hotel were the showers, although good and hot and powerful, the cubicles are tiny and the bathroom gets completely flooded. Also the breakfasts, as someone has previously mentioned the fruit juices are disgusting! But the thing that really annoyed me was the breakfast lady with the dark frizzy hair, who was extremely rude. On the day of my mums 60th birthday we tried to move a table 6 inches over to another one so that the 5 of us could breakfast together and she came marching over, shouting at us in Italian and would not even let us sit together. It's a shame that one member of staff can let an otherwise brilliant hotel down so badly. Overall though, if you can avoid that woman, I thoroughly recommend this as an excellent hotel to stay in!", "Date": "July 19, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "West Yorkshire", "Title": "“Good Hotel”", "Author": "WestYorkshireScooby", "ReviewID": "UR8092545", "Content": "We chose this hotel as we thought it would be a very central place to walk to the many sites in Rome and we were right! We walked everywhere. The room was clean, we had a fantastic terrace (but with so much to see and do in the city we didn't use this too much). The breakfast really set us up for the day with a great choice of food. We would use this hotel again.", "Date": "July 10, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Great location, rooms a little tired though”", "Author": "OliStoli", "ReviewID": "UR7871668", "Content": "Stayed here for 2 nights at the start of June. Found the rooms a little tired looking (ripped wallpaper). Location was excellent - just around the corner from the Trevi fountain. Also walked to Spanish Steps. My biggest winge would be about breakfast...bad coffee, juice from a machine (i.e. powder mixed with water). Just head out and grab breakfast somewhere else in the city. Other than that I'd recommend it for what it is due to location.", "Date": "June 18, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Barnsley, United Kingdom", "Title": "“convenient Regno”", "Author": "alfie92", "ReviewID": "UR7857708", "Content": "We stayed at the Hotel Regno for 02nights on our 1st trip to Rome. We found this hotel and checked on tripadvisor and the reviews were fine. We booked the flights through easyjet who offered a city shuttle bus you could pre book for 14 euros rtn each. The shuttle bus was well organised and ran every 30 mins, and the bus dropped you of at the main train termini. We got a taxi then from here to our hotel which took us around 10mins, We were ripped off!!! he charged us 27 euros, it was our fault we didnt ask a price when we got into the taxi, our return journey back to the train termini was 8 euros! On arriving to the hotel we were given a room on the 5th floor overlooking the side street with a lovely little balcony and we could see over the roof tops of Rome.The room was very compact but clean and the bathroom had a shower over the bath which again was very clean. We had continental breakfast included in the price which was adequate. The hotel is in a excellent location very easy to walk to the Trevi fountain and we also walked to the Spanish steps. There are lovely restaurants all around the hotel and its also very accessible to all the shops. Would recommend the open- top city tour bus, 20 euros each, this is a hop on- hop off service which goes around all the major sights.", "Date": "June 16, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Orleans", "Title": "“Clean and very convenient”", "Author": "jankoke", "ReviewID": "UR7836236", "Content": "We stayed here for 2 nights. Our rooms was very clean, quiet and fairly large. 3 beds and a separate room for watching TV. The lobby is small and cramped and getting around to find your room was impossible. The hotel continental breakfast was average. The best part about this place was its ease to get around the great sites of Rome: 2 blocks from the Trevi, 4 blocks to Pantheon and Novona Square and 1/4 mile to the Steps and Ara Pacis. The resturants were all over the place. The staff was fairly nice. I would DEFINATELY stay again!!!! The price was bad either.", "Date": "June 11, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "5.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Devon", "Title": "“Great Location”", "Author": "DevonShazzy", "ReviewID": "UR7625348", "Content": "We stayed here for four nights and thought we were lucky to be right in the historical centre. Everythng we wanted to see was within walking distance for us and there are numerous takeaway eateries, shops and restaurants literally round the corner for all price ranges. You also have the Trevi Fountain, the Pantheon and lovely piazzas within a very short stroll. If you wish to travel by bus further afield, the bus stop is right outside! The hotel was very clean, the staff were friendly and the buffet style breakfast perfectly ok. You have to pay extra for a cooked breakfast. Our room was a perfectly good size with a king size bed and the bathroom was clean and had a great power shower. We were overlooking the main road but the room had double glazing so we were't affected by any traffic noise. We did find the plumbing a little noisy. You could hear loos flushing and people showering which was fine as long as it wasn't in the middle of the night. We were under the impression that the rooms had balconies and that there was a roof terrace but this wasn't the case. The staff said that unless you booked specific rooms or a suite, you didn't get either. It didn't spoil our enjoyment of Rome at all as we didn't spend that much time at the hotel and so the balcony/roof terrace became irrelevant but beware if you really wanted one! Overall, I would recommend this hotel and would stay there again myself.", "Date": "May 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Small, friendly, great location”", "Author": "footloose_farang", "ReviewID": "UR7395648", "Content": "Being just on the edge of the Centro Historico its ideally placed for that part of Rome. Our double room was small but comfortable but with a tiny tiny shower which tended to flood the bathroom and would have flooded the bedroom without our towel dam! However my wife and daughter stayed there in January and had much larger rooms As a base from which to explore Rome its ideal. Pantheon just down the street, The Trevi, Campo del Fiori, Piazza Navona etc etc just a short walk away. Also handy for buses to and from most other sites and to Termini. Continental breakfast was reasonably comprehensive, but don't have the standard coffee in a jug, possibly the worst coffee in Rome and why drink that when the Gran Cafe is just down the side street next to the hotel! Be sure to arrive early for breakfast as the restaurant gets packed out after about 8am Staff are very friendly and helpful. Front rooms can be noisy as the hotel is directly on the Via del Corso but side rooms have the advantage of a view of the busy, pavement restaurant and cafe filled alleyway that runs along one side. Other than breakfast we didn't eat in the hotel and why would you with so many places to choose from, so only book on a B & B basis.", "Date": "April 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "White Plains,NY", "Title": "“Small, but comfortable”", "Author": "LADWhitePlains", "ReviewID": "UR7347681", "Content": "Stayed in the Hotel Regno April 4 to 11, 2007. We found the location, directly on one of Rome's main streets, to be both an advantage, and a problem. Its a great location because you are only five minutes from the Trevi Fountain and to the Pantheon both of which have numerous stores and restaurants surrounding them. On the other hand, rooms in the front can be quite noisy and the air conditioning was not yet on for the season. Ask for the back of the hotel when you book. Rooms are small but comfortable and have everything you need. The front desk personnel were very helpful with information and bookings. Breakfast is included, but eggs will cost you extra if you must. Otherwise, cereal, yougurt and pastries. The hotel has a full-service restaurant but we did not try it. If you get hungry late at night there is a late night take out pizza and a take-out store just a short walk away near the Trevi Fountain.", "Date": "April 13, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Croydon", "Title": "“Perfect location”", "Author": "Selsdonricardo", "ReviewID": "UR6778857", "Content": "We normally travel using top hotels, USA, Mauritius etc. However, this is a weekend break and the hotel is not so important. This is a typical Italian hotel - old building etc. Whilst the hotel itself is 3 star standard, this is not important. On a Rome visit, you will be out of the hotel for most of the time. Rome is very easilly seen on foot and you will do a lot of walking. This is a great city break - you need 3 nights at least to see the city - and the amount of time you spend in the hotel is minimal. The loction of the hotel is completely superb. Cannot be better. 2 mins from the Trevi fountain, 4 mins from the Pantheon and 5 mins from the fashionable Spanish Steps - plus much more closeby. Bus stops are outside (or a 100 yds to the Piazza Venezia) and you can go anywhere in Rome for 1 euro. In summer, the hotel will be hot. Air conditionig is noisy so keep the windows open during the day. Breakfast is good. Will definately use this hotel next time we visit.", "Date": "February 11, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Derby", "Title": "“A fantastic find!!!”", "Author": "it's_a_small_world_1", "ReviewID": "UR6687624", "Content": "We have just returned from 4 nights in Rome at the Hotel Regno and found it to be a very comfortable and relaxing place to stay. The location of the hotel could not have been better. Within 2 minutes walk we were at the Trevi Fountain, and 5 minutes at the Pantheon (where there are some superb little restaurants for an evening meal). It is in a well lit and busy area so we felt very safe at night, but even though it was busy the double glazing in the room did an excellent job of blocking out the sounds from the road. The room was very comfortable, and clean. The shower was excellent - just what we needed after a long day on our feet. The staff are pleasant and helpful, and we particularly enjoyed the sticky pastries at breakfast - delicious! We would definitely stay here again. Thumbs up.", "Date": "January 24, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Ireland", "Title": "“Love Rome!”", "Author": "happybridetobe", "ReviewID": "UR6571371", "Content": "Stayed at the hotel regno september two years ago and have just booked my sister and her husband in for st patricks weekend this year: its is clean with a nice restaurant and nice rooms but very small as they are in the eu. bathroom was of hotel standard no mildew etc perfect if you do not want to spend alot of time in your hotel but do want to feel like you are staying in a hotel when you are there it is lovely! hope this helps", "Date": "January 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“return visit”", "Author": "EvertheOptimist", "ReviewID": "UR6567799", "Content": "Just returned from Rome and our second stay at the Regno. Pleased to say we were just as impressed as we were the first time! Different room, but just as clean, functional and comfortable as the previous one. Contrary to many of the previous posters, we found the staff to be very friendly, helpful and extremely competent at their jobs. The Reception staff were always very willing to book taxis, make restaurant suggestions and reservations and they always answered our queries in a friendly and helpful way. The man who served meals and ran the bar on an evening even remembered us from our previous visit and what we wanted to drink - top marks to him!! I would definitely recommend this hotel to anyone visiting Rome. The location is great-very central and just minutes to many of the must-sees. The rooms are clean and comfortable (you have too much to see and do to be spending much time in them anyway), and the staff are lovely. What more do you need from a hotel?", "Date": "January 9, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellent location”", "Author": "Buzbyago", "ReviewID": "UR6344223", "Content": "Spent 4 nights here. The hotel is brilliantly located, within walking distance of all the major tourist attractions. Hotel was very clean and our room was beautifully decorated and very comfortable for 3 adults. Only down side I would say is that there is nothing to do in the evening at the hotel, no bar, no coffee facilities or tv to watch (unless you like Sky/BBC news). We like to come back to the hotel of an evening and sit down and relax with a coffee to end the day off, but we just had to go to bed as there was nowhere else to sit. Reception staff were very friendly and helpful, one of them even came out to translate instructions to a taxi driver we were having problems making ourselves understood to. All in all a very good hotel to stay in as a base for Rome.", "Date": "December 7, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "atlanta", "Title": "“worn out”", "Author": "zaccaria", "ReviewID": "UR6162618", "Content": "Stayed four nights at Hotel Regno. What the other posters say is correct: the location is very convenient. However, the hotel is run down and not well maintained. Upholstery and wall coverings were stained and ripped. Breakfast was ordinary, much of the china was chipped. Most of the staff I encountered were barely civil. Looked like it had seen better days. A disappointment.", "Date": "November 21, 2006"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kingston", "Title": "“Great hotel, great location”", "Author": "ROBBJOHN", "ReviewID": "UR6031362", "Content": "We spent 2 nights at Hotel Regno. On check-in I asked if there were any rooms available with a balcony. The friendly staff checked availability and we were given a room with 2 balconies overlooking the street. It was an excellent room, very clean, although I left the balcony doors open at night and it was noisy. The continental breakfast was quite sufficient and the area was pleasant. Great thing about the location of the hotel is we were within walking distance (about 5 min.) to the Trevi Fountain. The Pantheon and Colosseo and Roman Forum were also within walking distance. We would recommend this hotel.", "Date": "October 30, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Israel", "Title": "“Location, Location...BUT!!!”", "Author": "xpis3", "ReviewID": "UR6016840", "Content": "On July 2006 I visited Rome with 2 family members, all of us adults. Before deciding which hotel to stay I searched the member's opinions more 3-4 times. Finally after reading a member's review about staying twice in the hotel, I decided to stay at the Regno. I would like to share our experience with you. We got a room for 3. When we checked in the receptionist told me that we have separate toilet and bathroom, and that we have a balcony. When the bell-boy opened the door, we saw a short corridor and in the end the room itself. The corridor has 2 doors opposite each other – one for the bathroom and the other for the toilet. While the toilet was roomy the bathroom was tiny. There was no pegs to hang the cloths, the 2 shelves are opposite the sink, and very high. As I am the tallest of the 3 of us, I was the only one who could use the shelves, and even than only be standing on my toes. The closet is near the entry door, there is one shelf, and one rod to hang and put one cloth. Here too the rod and the shelf are so high that I was the only one who used the closet, and to reach the shelf I had to stand on my toes. Apart from the closet there are only 2 small drawers, and the other 2 had to leave all their cloths and other things in the suitcase. Very uncomfortable when you stay few days in one hotel. On the first day I asked for one more chair. They did not give us one, when I reminded reception about it on the second day, it did not help. On the third day the receptionist told me that they don't have any spare chairs in the hotel and that we have to seat on the bad. When I said that we would like to seat on the balcony he said: \"your problem\". On the second day we discovered that something is wrong with the air-condition, and that it makes a lot of noise. I called reception but they did not send a technician. On the next day when we went out I reminded reception about the problem with it, and the receptionist (this time a woman) said that she will look into it. When we came back it was not fixed. I call again and she sent the bell-boy. He tried to do his best, but he could not fix it. When I asked him to tell reception to send a technician he said: better you ask them, whey won't heed me saying it. So I called them. But next day, again after reminding them about it in the morning, they did not do anything. Only on the fourth day after I got really angry with them they sent the technician who did his best, and at least he eliminated the noise. To sum it up – the location is unbeatable; the breakfast was very good; the receptionists are rude and uncooperative, especially the blond woman; the hotel amenities not the ones you find in a good 3 stars hotel. I don't think that we ever stay again in this hotel.", "Date": "October 27, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Okay but not the best”", "Author": "chocdeb", "ReviewID": "UR6016611", "Content": "Several people recommended this hotel to us, but when we arrived we were disappointed. The location was good but the room was small and the walls were paper thin! The bathroom was old and tired. Breakfast was okay. Overall the hotel did not live up to our expectations, except for the good location.", "Date": "October 27, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Perfect location”", "Author": "Morningsider", "ReviewID": "UR5982493", "Content": "Stayed here for three nights on my recent trip to Rome. Turned out to be an ideal spot to have as a base if you wanted to see some of the best sights of Rome. The hotel is located on the via del Corso (one of the main streets in Rome). It is quite a busy shopping area. There are plenty of pizzerias around the hotel. It is a five minute walk to the Fontana di Trevi and the Palazzo Venizia, ten minutes to the Pantheon and the Piazza di Spagna and about ten to fifteen to the Colosseum. The hotel staff are quite friendly and willing to help with directions, etc.. The city's traffic is quite disorganised, watch out for the scooters that whiz past you on pedestrian crossings without stopping. Most of the tour operators provide hotel pick-ups. However, they do not drop you off at the doorstep of your hotel but at the nearest possible landmark. In the case of the Regno, this would be the Palazzo Venizia or via Tomacelli. For motor racing freaks, there is a Ferrari store on via Tomacelli (ten minute walk from the hotel). The breakfast options are quite good, served from 07:00. On the whole, it was quite a pleasant stay.", "Date": "October 22, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Chicago, Illinois", "Title": "“They moved us to another hotel”", "Author": "angela2336", "ReviewID": "UR5882172", "Content": "Plumbing problems are their overused excuse to switch you to their other property. We booked this hotel for 4 nights and 2 rooms for a stay in mid July, 2005. The reservations were made by a friend who knew the manager. On the way from the airport, the driver handed me his cell phone and I was informed that due to \"plumbing problems\" they were moving us to the Hotel Oxford. I felt that we had no choice so the driver took us there. Although we never stayed at the Hotel Regno, this bait and switch made me feel like they were taking advantage of us. We stayed one night at the Oxford and the next morning we checked into the Hotel Minerva which is fabulous. We were not going to take any chances that the \"plumbing problems\" were not repaired. The hotel Oxford was far from everything we wanted to see and the rooms were small. They charged us the same as if we had stayed at the Regno. Shame on them!", "Date": "September 27, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Il", "Title": "“Your Taking Chances”", "Author": "BarryPatch", "ReviewID": "UR5813605", "Content": "\"WE HAVE A SLIGHT PROBLEM WITH YOUR ROOM\" That was our greeting as we attempted to check in. We were told that there was a plumbing problem and we' d be provided with a room at their other property, Hotel Oxford. If I'd wanted to stay there, I would have. I told them that I wouldn't accept that and insisted on \"my room\" and that I could have been easily contacted via e-mail and notified of the overbooking, oops, I mean \"plumbing\" problem before my arrival. Read the other reviews and you'll find that this is not an anomaly ( I wrongly assumed it was). Our fifth floor front room was very nice with a great balcony over Corso St. It's very noisy on Saturday nights if that's an issue. If you choose to stay here confirm your confirmation, as I did, a couple weeks in advance. If they try to move you, insist on your room.", "Date": "September 18, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Auckland", "Title": "“Fabulous hotel in the centre of everything”", "Author": "Dooleysmum", "ReviewID": "UR5811247", "Content": "We spent 4 days at the Regno and were very happy with our choice of Hotel. Our room was just great, lovely decor and we had our own little balcony which overlooked a delightful street full of cafes. Our room was spotlessly clean as was our bathroom. The room was very quiet at night with very heavy drapes to drown out any street noise. The hotel itself is a bit of a rabbit warren to get used to finding your way around but all in all a perfect place to stay when visiting Rome as it is so well situated, within walking distance of most of the famous sites. We will be very happy to return to Hotel Regno when we next visit Rome.", "Date": "September 17, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ontario", "Title": "“Loved The Hotel”", "Author": "Dommich", "ReviewID": "UR5762602", "Content": "We stayed for 3 nights in Rome. The location of this hotels was perfect. Within walking distance of just about everything. The hotels was clean and they serviced the rooms daily. In room internet was convenient. The breakfast was the same as everywhere else. Edible but not fabulous. The staff went out of their way to help us book day trips and plan our stay.", "Date": "September 2, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Can't wait to stay there again!”", "Author": "RandomTravellerz", "ReviewID": "UR5574905", "Content": "We happened to be staying at the Hotel Regno when Italy won the World Cup! What a great place to be at that time! We loved our stay at the Regno and will most definately stay there again the next time we go to Rome (we threw coins in the Trevi so we are destined!)! We splurged on two rooms, one for ourselves and one for our two teenage sons. Their room had a lovely balcony which my husband and I utilized. Our room across the hall, had no balcony, but was a bit larger and still had a lovely view. From our room we were treated to live orchestral music each night, coming from the nearby piazza. The breakfast was wonderful (great coffee) and the front desk very helpful. The location cannot be beat. We walked to everything, including from the train station as the taxis were on strike when we arrived (a good argument for packing light and each having only one bag). The only time we felt the need to use public transport was to the Vatican. We took the bus - easy, easy, no problem at all. If you are reading this and are considering a stay at the Regno and have looked at their website, it is as wonderful as it seems, and I am very excited for you and your trip to Rome! Buon viaggio!", "Date": "August 7, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "DARLINGTON, ENGLAND", "Title": "“great hotel”", "Author": "Ann003", "ReviewID": "UR5469985", "Content": "just came back from a 4 night stay at the regno. could not fault the hotel the reception staff were friendly and on arrival our cases were taken up to our room by the porter. the room was clean with a bath and shower on suite. there was air conditioning in the room which was marvellous as it was very hot on a night. we were at the front of the hotel which is situated on a busy main road, but as there are a double set of windows in the room we could not here any noise whatsoever. the hotel is very central for all attractions and shops, everything is within walking distance except the vatican which takes about 15 mins on the number 62 bus which stops outside the hotel. I could not fault this hotel and would definitely stay there again.", "Date": "July 16, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Pontyclun, S Wales, UK", "Title": "“Ideal Location”", "Author": "Beti_Mal", "ReviewID": "UR5442499", "Content": "For a city centre hotel we found the Regno to be a great base for our four night stay in Rome. Our room, if a little small, was perfectly comfortable and clean with a minibar, air con/heating and TV/internet access to add to the comfort of the stay. The only real problem we encountered was the noise. The wall between us and the room next door was incredibly thin, so much so, we could here the man next door snoring! We were also opposite the kitchen which did get rather noisy first thing in the morning. Inevitably in a city centre you will get noise outside the hotel but we were woken at around 5am by the sound of glass bottle being emptied out of a bin. After the first night we invested in some ear plugs and this put an end to the problems. I would recommend asking for a room higher than the first floor in order to minimise noise levels. The breakfast was good, plenty of choice, good coffee etc. We didn't eat at the hotel in the evening as there's so much choice in Rome, we wanted to explore other places. Certainly, the best thing about this hotel was its location. We walked everywhere during our time there. One tip, if you do take a taxi, watch out as we were duped by a taxi driver upon arrival at the Termini Station. Keep an eye on what bank note you give them as our taxi driver told us otherwise!", "Date": "July 9, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "CHICAGO, IL", "Title": "“Great Location, Poor service”", "Author": "RGARCIAMD", "ReviewID": "UR5438344", "Content": "We rented two rooms. My wife and daughter in one, my son and I in another. My wife's room smelled really bad, and my room's air conditioner did not work. The staff did not go out of their way to solve any of these problems. It seems the hotel is severely understaffed. I would not choose this hotel again. The location is very good, the rooms are small", "Date": "July 7, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Madison, Indiana USA", "Title": "“Good Hotel - No problems!”", "Author": "Harmon31", "ReviewID": "UR5391916", "Content": "My family stayed here May 21-25th, we had two triple rooms. The rooms are small, but by European standards they were big. The staff was very helpful and freindly. Breakfast was small but fine, it would have been nice to have some variation from day to day. The dining staff was very quick and freindly! The rooms were clean, A/C worked fine, and we had plenty of hot water! The lobby is small and they could use a faster elevator! We were on the 5th floor and could sit outside and watch the crowd walk in the street below us.. very nice after a long day of touring Rome! Perfect location! We would stay there again!", "Date": "June 26, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Perth Australia", "Title": "“As they say Location, Location”", "Author": "BJC49", "ReviewID": "UR5352658", "Content": "We spent 5 nights at the Hotel Regno, one prior and four post a Mediterranean Cruise, in May / June. One could not ask for a better location for your Rome stay, it is literally 5 or 6 minutes walk from every “attraction” you would want to visit in the Old Town, and 12 minutes and 1 Euro on the number 62 Bus to St Peters, which stops outside both, coming and going, simply the best. While the hotel is in an old building, actually two buildings, with one small lift, however the rooms are quite up to date and clean, however SMALL, and our bathroom was TINY, the trade off was the location. There was Air Con on in both the rooms we had, and access to the Internet through an interactive TV and keyboard in your room at 3 Euro for 30 minutes, which is a bargain having just paid the minimum of $70US for 90 minutes on the Cruise. The staff were mostly helpful, but like most service providers in Rome, from Shops, Restaurants, Hotels, Bars and the people selling from Stalls, all seemed to treat Tourists, especially anyone that spoke only English, as an annoyance rather then as the major provider of their livelihood. Breakfast was ok, but then we had just come off a Cruise, so our opinions are influenced by what we had just experienced. There are a couple of levels of Rooms you can book, so if you want space than go for the Suites, if you want cheap then you will get small.", "Date": "June 16, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Perth, Australia", "Title": "“Great Location!”", "Author": "KKmad", "ReviewID": "UR5337500", "Content": "We stayed at the Regno from 23rd – 27th May 2006. The location of this hotel is fabulous. It is right in the heart of it all and we were able to do all the famous sites by foot and had lovely, reasonably priced restaurants at the door step. Our room was very small and at first I thought I we would not beable to sleep in the bed together – it wasn’t queen size but a bigger than a double. It was nicely decorated and clean - adequate for the two of us and the double glazed windows illuminated the street noise sufficiently to get a good nights sleep. Breakfast as adequate with a selection of juices, cereals, yoghurts, fresh fruit, meat, cheese, breads, pastries etc - Unfortunately the reception staff were not very friendly and we got the feeling that we were an inconvenience to them. Each time before we’d passed through we would take bets on whether we could get a smile out of one of then – but it never happened. It di give a good laugh though. That aside – we would stay there again.", "Date": "June 13, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "cheshire, england", "Title": "“Unbeatable location in beautiful Rome!”", "Author": "maudsters", "ReviewID": "UR5229575", "Content": "We stayed at the Regno for 5 nights and honestly couldn't fault it. The location was perfect. Yes, it's on a very busy main road, but this didn't bother us at all (even though we are used to living in a very quiet neighbourhood). We were holidaying with a friend who had a single room, located at the back of the hotel overlooking the breakfast room conservatory. We occupied a twin room overlooking Via del Corso. Both rooms were excellent. We had no problems with the hot water - there was plenty at all times. The air conditioning was also switched on and working well (most welcome as the weather was scorching!) There was a good selection of pastries, yogurts, bread & ham etc on the breakfast buffet. The reception staff were brilliant - dealing with our request for an extra mattress straight away. Also, the restaurant they recommended for good pizza - L'Archetto - was brilliant (and did great panna cotta!). Well, we all threw our coins in the Trevi fountain, and when we return to beautiful Rome, we'll definitely stay at the Regno. We recommend it to anyone wanting a decent hotel in a central location.", "Date": "May 28, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Christchurch, New Zealand", "Title": "“Service at Regno left a lot to be desired”", "Author": "A TripAdvisor Member", "ReviewID": "UR5041370", "Content": "I would not stay at the Regno after our experience there. My husband and I arrived at the Hotel Regno which we had booked and paid for through our Travel Agent on a Saturday for a four night stay. Our friends were with us and they had booked their room on the Internet so they had not paid anything for the room. We arrived at reception to be told that there was water damage in our rooms and they were going to move us to their other hotel which was 20 minutes walk behind the Spanish Steps and we were also told it was near shops. (Yes it was but Via Veneto shops - all very expensive) and also near the American Embassy. They seemed to think we were Americans and it was a big deal to stay by the Embassy. After a lot of discussion we were put into a taxi and sent to the Hotel Oxford. Once there we found out after a lot of discussion again that we could move back to the Hotel Regno the next day - funny how the rooms were going to be ready after the weekend was over. My husband and I were going on a early morning tour on the Sunday morning and decided to stay at the Oxford because of this but our friends moved back to the Regno. The whole experience marred our enjoyment of Rome as we felt we were at their mercy because we had prepaid for the Regno and had no choice but to go to the Oxford. The Oxford was out of the way and we had to taxi or walk quite a way to get to the sights of Rome. The Regno reception staff didn't give a hoot about what we wanted - they told us we would be upgraded at the Oxford but the room at the Regno that our friends moved back to was definitely a nicer room than those at the Oxford. We felt that the reason we were moved was because the hotel had been overbooked. We had booked our room 6 months prior to our arrival.", "Date": "May 8, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Wauwatosa, WI", "Title": "“Great Location & Good Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR5021479", "Content": "We had a pleasant experience with this hotel. It's not super fancy, but the staff was helpful (spoke English), room was clean and location was perfect. We could walk nearly everywhere in Rome from our hotel. The street was a little busy, so it was a little loud at night and in the morning with traffic and people noise. Breakfast was good - pastries, cereal, juics, and some meat and cheese. Seemed like there were better food choices early in the morning. Table seating was a little limited. They held our baggage when we arrived and on our departure day. I would recommend this hotel.", "Date": "April 30, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New Jersey", "Title": "“Great hotel and location-good value”", "Author": "Italiandream", "ReviewID": "UR4996091", "Content": "Stayed at Hotel Regno at Via Del Corso 330 . Room #452 quad room with seperated pocket doors.and terrace @250 Euro's a night. Very pleased with hotel! Perfect location, nestled in between Trevi fountain and the Pantheon. Restaurants, shopping and all the action around us was great. The hotel staff was very accomodating. They have 69 rooms-small lobby and small elevator but that just added to feel and flavor of Italy. We slept well, showers were great, safes in room and with doors closed no problem hearing street traffic. Breakfast was nothing fancy but served it's purpose. We are a family of four, boys 15 and 18. We have a 4 night stay here at the Regno and then on to Sorrento & Amalfi Coast then back for one more night at Regno. Good hotel choice for us. Stayed here for a total of 5 nights on our lat night after being away we returned to same room at our request . When we arrived everyone greeted us so warmly we felt as though we never left. It was great! Best of all we already knew the layout and the surroundings", "Date": "April 22, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "5.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "the Netherlands", "Title": "“bellissimo !!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4970850", "Content": "Me and my boyfriend stayed at the hotel Regno for 4 nights in November. We had a great time: The room was clean en fairly big enough. We had a great view, and did not hear the 24-hr-traffic because of double windows(!). The staff was very friendly and helpfull (called us cabs etc) and spoke English very well. The location was teriffic! Close to almost everything (specially Pantheon, Trevi Fountain (2 minutes or so), Forum Romano and Spanish Stairs (5 to 10 minutes). Longest walk (to the Vatican) took us only 20 minutes.), and surrounded by lots of restaurants and bars. PS> If you like Spagetti Carbonara you should go to the Piazza Navona and order it at the bistro situated across the largest fountain! :D", "Date": "April 13, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "4"}, "AuthorLocation": "plymouth uk", "Title": "“Pluses and Minuses”", "Author": "A TripAdvisor Member", "ReviewID": "UR4734871", "Content": "Overall very pleased with this hotel - had read reviews of loads of Rome Hotels before booking and had kept fingers crossed that hadn't picked a duff one! The staff were all very friendly and spoke english. The room was very spacious with a large double bed - created from 2 large single beds - and a flat screen TV - not much in the way of english speaking channels though - mainly just the news. The room was very clean and well decorated. The bathroom was really tiny with a very small bath. It could have done with a bit of a reburbishment - the shower wasn't too good - I think others beat us to the hot water on the first morning and the pressure was down. OK on the 2nd morning. Still, the bathroom was clean and servicible, which is the most important factor. We were in room 554 - on the 5th floor overlooking the main road. It was VERY VERY noisy. The first night we didn't sleep because of the bus, car and ambulance noises that continuously hammered up and down the road. This was the worst bit about our overall stay, as we couldn't feel well rested and couldn't even contemplate a snooze in the afternoon to recover, as their was no let up in the traffic. Breakfast was OK - nothing to write home about - bread, croissant, ham, salami, yoghurt & cereal are all available and formed a perfectly adequate meal. The hotel is excellently situated in easy reach of a lot of main sights - the Trevi, Pizza Navona, Pantheon, etc. Overall the lack of sleep through the noise levels left us feeling drained but the friendliness and helpfulness of the staff along with the sizable, clean accomodation made our stay enjoyable.", "Date": "March 26, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Heybridge Maldon Essex England", "Title": "“Centrally Located”", "Author": "A TripAdvisor Member", "ReviewID": "UR4692472", "Content": "We have just returned from The Hotel Regno in Rome. This Hotel is very Central in a main street full of shops and all the major sites are within walking distance. Five minutes to the Trevis Fountain, and approx. 15 minutes to the Collusseum. The Vatican is also walking distance but takes a little longer and you will probably need a map, but theres plenty to see on the way. The bedrooms in the Hotel are a good size, tastefully decorated and very clean. The staff were pleasant and helpful during our three night stay. We would definitely stay there again if we return to Rome and would recommend it to anyone wanting a centrally located Hotel", "Date": "March 19, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "sedgefield", "Title": "“Nice hotel, great location”", "Author": "UK_traveller123", "ReviewID": "UR4616730", "Content": "This is a good 3.5 star hotel, which is in a great location for those that want to see all that Rome has to offer. A couple of minutes' walk to the Trevi fountain, and the Pantheon, and maybe a few extra minutes walk to the nearest Metro stop (Barberini) if you need it. (We actually found that everything, Vatican included, was within walking distance, as long as you don't mind your feet being sore at the end of the day!) The hotel is very clean and the staff were great - polite, friendly and helpful. The breakfast is fine too, and we didn't have to queue for it on any of the 4 mornings we were there. Also, the bathroom seemed quite modern and had a power shower, and there were no problems with the hot water. Also, the rooms were not at all cold as other users have reported, they were just fine. We had a posh widescreen LCD TV too (ok, I'm easily impressed), and there's internet access for those that want it. Beware those travellers that are over 6 feet tall - you may find that your feet are hanging off the edge of the bed! Our double room was actually 2 single beds pushed together, and they were shorter than the British beds that I'm used to! Not a major problem though. The hotel is on a main street so there's no shortage of shops and places to eat and drink nearby, although it can also be a little noisy. On the other hand, our room was facing directly onto the main road (room 230, 3rd floor), but the noise certainly didn't keep us awake at night. Couldn't really fault the hotel, as long as you shop around for a good price - we used Cybertravelnetwork and got 4 nights for the price of 3, and at a pretty decent price.", "Date": "March 14, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "australia", "Title": "“great location”", "Author": "likearollingstone", "ReviewID": "UR4518848", "Content": "We stayed at the Hotel Regno last August and found it to be a pleasant hotel. We caught the train into Rome (30 mins) and at only 9 Euro that was good value. The platform at Termini must be the longest in the world. When you finally get to the bus area, look for a No.175 and before boarding purchase a ticket from one of the news stands. There is a stop just near the hotel, ask for Trevi fountain stop. The hotel is friendly, especially the bell-boy Daniel, who was almost over the top with service. The rooms were not large but well serviced. There are no facilities for coffee or tea making, common in Italy, and don't expect an iron. Officially banned in Italian hotels. The breakfast area is quaint, and I suggest eating early, as some days there was a queue to get a table. The coffee at breakfast is wonderful, a fresh cappucino on demand. The position of the hotel is fantastic. 5 minutes to the Trevi, and 5 minutes the other way to the Spanish Steps. I put in some laundry on a Friday night and by Monday it had not returned. It seems that they cannot get it done over the weekends, and it was only when I enquired was this info passed onto me. The staff were overall helpfull and friendly. On our last night there, Daniel kindly made up some toasted sandwhiches after hours whilst running the small bar area. I would have no reservation in returning to the hotel in the future.", "Date": "February 25, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Australia", "Title": "“Hotel Regno is great!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4460835", "Content": "My husband and I stayed at the Regno in April '05 for 5 nights. We changed rooms after 1 night and nothing was a problem at all! The staff were great giving us tourists local information. The location of this motel is just PERFECT. We alked to all sites including the Vatican and saw the Popes last audience. F. Liddell", "Date": "February 14, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Comfortable and convenient”", "Author": "ozliz", "ReviewID": "UR4394575", "Content": "I stayed at the Regno with my mum for 4 nights over New Years, after booking through a travel agent, and found it to be exactly what we needed. Had a minor issue with our room upon check in. After checking in early, we were advised that a room was available, but found that this was a double room, rather than a twin (which we had requested). They happily showed us another room, which had a double bed and a fold out bed. We stated that this would not be acceptable for a 4 night stay and they showed us a tiny twin room. We asked for the double in the second room to be separated, which they did. This probably means we ended up with what would be classed as a triple room. The room itself, on the thrid floor, was very comfortable and clean.The beds were brilliant and we had plenty of space to store luggage and hang washing. The bathroom looked recently renovated, with a shower, toilet and bidet. We had no problems with hot water, although found the water could not be kept on full pressure (which was excellent) for an entire shower as the alcove would flood. I agree with a previous review in that the linen, includeing towels was exceptional. Breakfast was provided and was always more than enoughy to carry us through to dinner. A selection of pastries, cold meat, cheese, yoghurt, cakes and toast was offered, along with a small selection of average tasting fruit. The breakfast room oozed ambience, with a glass ceiling, which was very convenient to check weather conditions, especially in winter! The staff were helpful and some were very friendly, with others always courteous. They were more than willing to help with directions and supplied us with a great map of Rome upon check in. Storage of luggage was also not a problem. The position of the hotel was fantastic. We walked everywhere, apart from the Vatican (although it probably could be done). There was also a great little restaurant down the alley leading to the Pantheon, which served fantastic food at very reasonable prices. There were bus stops 5 minutes down the road and tobacconists for bus tickets the same distance away. The only real negative was the busker that would plant himself opposite the hotel every night and sing the same song on a loop for hours. He was always finished by the time we anted to sleep, but was there enough that we knew the chorus of his song word for word and were seriously considering what we could throw out the window! ;) We found this hotel to be charming, comfortable, pretty much as we expected and deserving of a 3 1/2 star rating. We'd absolutely stay there again!", "Date": "January 29, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "nottingham, england", "Title": "“Decent hotel, great location”", "Author": "mrmktr", "ReviewID": "UR4315406", "Content": "Stayed in the Regno for 3 nights, couldn't really fault it anyway, especially for the cheap rate i got it for on the ---- website. For a city centre location it was suprisingly nice and quiet. The rooms were cleaned to a high standard and front desk staff were nice and helpful. As for location, you couldn't do much better, next to all the decent attractions, even though still managed to get lost coming back from one of the plaza's after a few to many bottles of pinot grigo. Would i stay again if i went back to Rome-Yes ..... Also nice towels.", "Date": "January 1, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Toronto", "Title": "“No Heated Water”", "Author": "A TripAdvisor Member", "ReviewID": "UR4230631", "Content": "Was just in Rome for 4 days and stayed at the Regno. The hotel itself is in an ideal location - right where you want to be. The room was clean and tidy and we found the staff helpful. The problem is the water. During the week, the water pressure and temperature was acceptable, but come Friday night there was no water pressure at all and by Saturday night there wasn't any HOT water at all. We had to shower in a trickle of cold water as there was also no pressure. I'm not kidding about the temperature of the water, it was absolutely freezing. When we called the front desk to ask if we could get another room or whether they could fix the water, they attempted to call a repairman but said there was nothing they could do about it. I honestly think this happens every weekend. The Regno needs to upgrade its water system - I will not stay there again because of this. I find it unacceptable to pay that kind of money ($150 Euro) and not be able to take a decent shower.", "Date": "December 10, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "stourbridge", "Title": "“Great Location”", "Author": "carolina7", "ReviewID": "UR4150911", "Content": "We have just returned from a 7 day holiday at the Regno. The location of this hotel can't be bettered, within walking distance of all the main attractions although we did catch a bus, no. 62, to the Vatican, from the bus stop just outside. Trevi, Pantheon and Piazza Navona just a few minutes away. We were upgraded to a very nice room with kitchenette on the fifth floor. We were on the back of the hotel and so heard none of the noise others here had complained of. The breakfast was adequate and snacks and coffees were available all day. Although we had read that there was no restaurant, we were surprised to find that dinners were served between 7 and 9pm each evening, which was useful if you were too tired to make the effort to go back out after a strenuous day! We found all the hotel staff to be very friendly and more than helpful and their English was superb. The room itself was kept very clean. Accepting that this is not on the grand five star scale, we certainly would have no hesitation in recommending it for those who want a more than adequate, centrally located hotel.", "Date": "November 29, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Orlando, Florida", "Title": "“Really enjoyed the Hotel Regno & it's location is ideal...in the heart of town!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4146222", "Content": "Our family of four stayed a week at the Hotel Regno. All 4 of us stayed in one room, which was very adequate (and hard to find in Europe). The staff was most cordial at all times and helpful to guide us to our destinations. A hearty breakfast of wonderful croissants, bread rolls, cold cuts, cheeses, fresh fruits, coffee, tea or cappuccino (made by Sarah) was a great way to start the day. We only ate one other meal during the day, plus drank wonderful Italian wine. The hotel's location is ideal...so close to many of the popular sites and a bus stop right outside the hotel door to go to other sites. Bank across the street. A tobacconist shop (to buy bus tickets) around the corner to the left. Take bus #62 to Vatican and #175 to the train station. Ride to Florence on the EuroStar Train and be there in 1-1/2 hrs. Great city to visit even on a day trip. We would definitely stay here again. Have a great time! Walsh- Orlando, Florida", "Date": "November 27, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "4"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Hotel is great; front desk staff is not”", "Author": "BEK216", "ReviewID": "UR4105789", "Content": "We thought the Hotel Regno, in some aspects, was great. The location can't be beat. The rooms are large and comfortable. There's an elevator, and breakfast is filling and plentiful. Unfortunately, the front desk staff seems to care very little about helping their guests. We felt like anything we asked them inconvenienced them. At one point, a hotel employee, without knocking, entered our room in the middle of the afternoon and surprised us. He quickly left without an explanation. I called the front desk and asked twice in person what the employee needed or was doing. I was completely ignored, told to ask another desk clerk, or told coldly that they would look into it - with no follow up or apology or any concern. I am sure the employee was restocking the mini bar or something legit, but it was startling when it happened and the front desk's complete lack of help and interest shocked me. Because of the attitude of these clerks, I would not recommend this hotel.", "Date": "November 11, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Regno - Great location”", "Author": "JCM81", "ReviewID": "UR4034113", "Content": "We spent four nights at the Regno during September 2005. The hotel is in a great location, near the Trevi Fountain, Spanish Steps, night markets and walking distance (if you don't mind walking) to the Vatican. In general we found the hotel to be fine, except when we ordered a breakfast to go when we had a 6.45am pickup for a tour. The breakfast was ordered the night before, but nothing was ready and when asked, the guy on Reception was not happy when we asked him to check the kitchen. He hurriedly threw a few things into a bag - warm yoghurt, stale and sweaty croissants plus a bad attitude do not make a good service. We also found the normal breakfasts to be average when compared to other hotels. However, if you want a hotel in a great location - you cannot go past the Regno. By the way - if it looks like rain, make sure that you take your own umbrella as the hotel does not provide umbrellas for guests - something that would be appreciated and that could be charged to your room if you fail to return it. Also, watch the internet - we paid for two hours and did not get the full time and where told by Reception that it was not their problem - it was the ISP - but we paid the hotel!!", "Date": "October 19, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Wareham, Massachusetts", "Title": "“Great experience at the Hotel Regno”", "Author": "fiftyishtraveler", "ReviewID": "UR3945736", "Content": "Six of us stayed at the Hotel Regno from September 14-Sept 17, 2005. 200euros per night per room. Two rooms were upgraded to suites complete with a terrace overlooking the street. The rooms were clean and very comfortable. For the most part I found the staff to be very helpful. They were more than willing to make tour arrangements, call taxis etc. I loved the location. One block from the Trevi Fountain and the Pantheon was about one block behind the hotel. I felt completely safe both in the hotel and in Rome. I would definately recommend this hotel and I will stay there again when I return (and I will return; Rome is great). Fiftyish traveler.", "Date": "September 28, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "2", "Rooms": "4"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“Good hotel in ideal location”", "Author": "AJO_UK", "ReviewID": "UR3939141", "Content": "This hotel is in a great location, minutes walk from the attractions in central Rome. The hotel is very clean and pleasantly decorated. It also has air conditioning (which works). We were fortunate to have a fifth floor room with a small roof terrace furnished with small plants. The room was small but the terrace made up for this. My only criticisms are that the front desk service was unreliable (messages not passed on) and the food at breakfast ran out before the last serving. Also, the beds are very short! On the whole it is a very good hotel and I would certainly visit it again.", "Date": "September 26, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Miami, FL", "Title": "“Phenomenal location”", "Author": "ll127", "ReviewID": "UR3939057", "Content": "Loved this hotel. It's right down the street from the Trevi fountain and a short walk to the Roman Forums, the Colosseum, the Pantheon, and the Spanish Steps. I highly recommend this hotel. The rooms are BEAUTIFUL and SPACIOUS and the area cannot be beat. It's a safe and upbeat street (Via del Corso), one of the main streets in Rome.", "Date": "September 26, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "bolton", "Title": "“really good regno”", "Author": "benjaminmelton", "ReviewID": "UR3880064", "Content": "My wife and i stayed at the regno for our first anniversary and what a stay! a brilliant hotel in the most ideal location possible!! we found the location to be the most important aspect when visiting rome. it was 1 minute walk from the trevi fountain and no more than 2 minutes from the pantheon and over five minutes from the piazza navona (three of the \"must see\" points in rome) our room although not huge was adequate, clean and comfortable. our balcony overlooked the trevi-pantheon walkway filled with busy little restaurants. it was very cheap (£200 for four nights!) it was only about a 20 minute walk to the collosium too. the only negatives were the bed was too short and im not even 6 foot! some of the staff werent too helpful (although never rude) and they ran out of some food at 9;50 (our fault really as its served till 10 which is quite convenient and the waitress smuggled me a do-nut from the kitchen) on the whole VERY much reccomended", "Date": "September 7, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Regno: Great Hotel in a Fantastic Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR3831964", "Content": "My family of four booked a suite for a week in July, and we could not have been more pleased. The suite included two bedrooms and one and a half baths (one of which had a minor plumbing problem which was fixed within an hour of our reporting it), and was a good value at 200 euros per night. Breakfast was excellent every morning, and the staff was very helpful (including safekeeping for several days of passports and money which we forgot to remove from the room safe on departure). Even better than the hotel itself was the truly unbelievable location, 3 blocks from the Pantheon and 2 blocks from the Trevi fountain (and the best gelato in Rome at San Crispino). We walked everywhere in the city (except the Vatican), and the Regno was a perfect base from which to explore on foot, which is by far the best way to see Rome. My family would be happy to stay at the Regno again anytime.", "Date": "August 31, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Australia", "Title": "“Great Hotel, Great Location”", "Author": "AussieGuys", "ReviewID": "UR3824894", "Content": "My partner and I stayed for 5 nights at the Hotel Regno at the beginning of August. Our rooms was on the 5th floor overlooking the Via Del Corso. We were lucky enough to have a small balcony - with a view up and down the whole street. Our room was more than adequate in size, as was the bathroom. The room was soundproof, and the standard of cleaning was spotless. Breakfast was probably one of the best we had in Italy during our month stay - and the restaurant area where it was served was bright and and really charming.. The staff were excellent, and more than willing to assist if asked. When they knew that we were having an early start for a day trip to Pompei they handed us a breakfast bag as we raced out the door at 7.00am. The location is brilliant, everything that you could possibly want to see in Rome is within a short distance. Rome is very welcoming for tourists, and it is easily possible to do it on any budget. We plan to return and would only consider the Regno.", "Date": "August 30, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Melbourne Australia", "Title": "“Clean, new but nothing special”", "Author": "A TripAdvisor Member", "ReviewID": "UR3806977", "Content": "This Hotel has a great position on the Via del Corso. The famous strip of shops is only a short walk away, as is the Trevi fountain, the Pantheon, and if you dont mind walking a little more, the Colosseum and the Roman Forum. The Breakfast served int eh mornings was adequate but nothing spectacular. The Bell boy was friendly but the front desk staff were average, only helping if asked (eg to ring a taxi!) The rooms were clean and of a comfortable size, but the bathroom was very small and the shower had a curtain that did not go all the way around resulting in all the splashed water ending up on the bathroom floor rather than down the drain. The air conditioning struggled to keep up with the hot Roman days. It is a bit of a walk from the nearest Metro Station (Barberini) so if you are weighed down with the luggage, you would need to take a Taxi, however with the state of Roman Traffic these days, you would still get there before the taxi did on foot.", "Date": "August 25, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "North West UK", "Title": "“Great location for all tourist areas”", "Author": "Mimocuja", "ReviewID": "UR3796862", "Content": "We recently stayed here for 4 days. I thought the reviews were good and therefore chose this hotel. A great location for sightseeing. Hotel room was clean and comfortable, with a roof top balcony, (however the outside lights were not working)! If you are disabled, you might want to inform them before your arrival. This hotel has six floors , and there can be quite a walk to the other side of the hotel. Staff were friendly, and assisted in translation (italian/english). Had a great time overall, very close to the Trevi fountain. Fill your purse/wallet as Rome is the most expensive city I have ever visited, but it was worth it!", "Date": "August 22, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Cardiff, UK", "Title": "“Brilliant location, convenient and so friendly!”", "Author": "gyinnit", "ReviewID": "UR3742239", "Content": "I stayed here with my boyfriend at the end of July 2005 for 3 nights. We went to Rome as neither of us had ever been and we are so glad that we picked the Regno! We couldn't believe we were so centrally positioned. Each night we would go to the Trevi fountain on the way back to the hotel after dinner as it was so near the hotel and look at all the people gathered there doing the same thing....even at midnight! The room was fairly large for a typical european hotel. The TV had international news channels so we could keep up to date with what was happening in the world. As we were starting early each day, it was useful having the breakfast there so we would pick up a croissant/ donut on our way out. With such a good location, we found that we could see a particular attraction and then go back to the hotel to rest for a while before going out for more (especially useful in the heat!) sightseeing. I would highly recommend this hotel and will definitely be returning! The staff couldn't have been more helpful, the receptionist reserved some tickets to the Borghese gallery for us, no hesitation.", "Date": "August 6, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Essex England", "Title": "“Good all round”", "Author": "zygo", "ReviewID": "UR3738930", "Content": "Good value Perfect position on main road for sites shops and restaurants Rooms pleasantly decorated and clean Good breakfast Staff very friendly with sense of humour and especially sympathetic and helpful when we had to cut short our holiday due to family bereavement Would definitely return Slight drawback some rooms little small but moved on request to larger", "Date": "August 5, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Rockaway Park, New York", "Title": "“Great Hotel - Perfect Location”", "Author": "barbara06248", "ReviewID": "UR3615215", "Content": "Me and a friend stayed at the Regno in June, 2004 and we thought it was perfect for our needs. It is small, but new, clean, and comes with breakfast every morning. THe staff are friendly, courteous, and willing to help and assist. You can't beat the location. You step out your door and the buses are right in front of the hotel. Your are 3 small blocks to the trevi on foot, literally across the street, and you are 3 small blocks to the pantheon as well. You have great shopping right on via del corso also. Also, can walk to the Spanish steps, which is maybe a 10-15 min walk past the Trevi and also can walk to the forum and coleseum as well. Enjoy it! It's a great place. In fact, I'm going again July 1, 2005 and I'm staying at the same place with my Honey Pie. lol", "Date": "June 27, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Norway", "Title": "“You can't miss!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3581891", "Content": "We (my wife and I) can just add to all the great reviews written about this hotel. We stayed fri-mon in the middle of June and had a GREAT stay. First of all, you can't beat the location: right there on Via del Corso, the best shopping street in Rome. We could walk to all the major sights (Vatican: 25 mins, Coloseum 10 mins, Trevi Fountain 2 mins, Spanish steps 5 mins, Pantheon 2 mins). The hotel's restaurant is small, but cosy, with a simple but tasty breakfast. The \"snack bar menu\" for the afternoon is much bigger than you can imagine (alltough eating out is recommended). The staff was excellent, with great knowledge of the city an very service-minded. The room was italian-style with all the things you want, and the windows towards the street are almost sound-proof. Next time we go to Rome (and we will), we won't even consider another hotel.", "Date": "June 20, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“Beautiful Hotel”", "Author": "eur2005", "ReviewID": "UR3530729", "Content": "I just came back, I love it, we have a balcony with view to plaza popolo and Victor Emanuelle Monument. If i return to rome, I will repeat the experience. Is walking distance to everywhere in Rome. The employees were so nice. They know you.", "Date": "June 5, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Best hotel on our Italian adventure”", "Author": "A TripAdvisor Member", "ReviewID": "UR3512355", "Content": "Our family of four adults just came back from a vacation to Italy. Rome was our last stop on this trip, and Regno Hotel was our last hotel. It was the best of all of the various hotels we had stayed on our vacation. We had a very large room, with a queen bed and two twin beds. The room was beautifully done, with a minibar and tv that had CNN and BBC in English so we could catch up on the news. The bathroom was spacious and had all of the toiletries we needed. Breakfast was lovely and there were many options for the five days we were there. The staff was patient and kind, answering the many questions we had about our time in Rome. They set up a taxi to come pick us up and take us to the airport on the day of our departure. The location was excellent, only a fifteen minute walk to the Roman Forum and the Collosseum, minutes away from the Pantheon and Trevi Fountain and Piazza Venezia (most of the buses stop at that square, so very easy to get to other parts of the city). I highly recommend this hotel; it made the last leg of our vacation quite enjoyable.", "Date": "May 31, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Swansea, UK", "Title": "“Great Hotel, excellent location”", "Author": "A TripAdvisor Member", "ReviewID": "UR3477037", "Content": "Excellent hotel, very clean and well maintained. Our room on the 5th floor was rather small, but more than made up for it by having a small terrace. Lovely to sit out late in the evening, enjoying a drink from the mini-bar and soaking up the atmosphere of a perfect Roman evening. Very close to the Trevi Fountain (which we visited at least twice a day), the Pantheon, Piazza Navona, Il Vittoriale (Victor Emanuele Monument) and Forum/Colosseo also very close. Staff were extremely friendly and helpful, breakfast pretty standard but lots of it and the coffee is very good indeed. Would recommend it to anyone, and will definitely stay there again when we return (and I have thrown lots of euros into the Trevi just to make sure).", "Date": "May 16, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "UK", "Title": "“Unbeatable Location”", "Author": "UkKatie", "ReviewID": "UR3452122", "Content": "This hotel has an absolutely unbeatable location in Rome right on the Vila De Corso. We could walk to the Pantheon in 5 mins, the Trevi Fountain in 5mins, the Spanish Steps in 10 mins and the Colloseum in approx 15 mins. The rooms are no frills but comfortable and clean. The hotel staff were all extremely helpful and accomodating and the breakfast buffet was also excellent value. I would reccomend the Hotel Regno as the perfect city break hotel in an amazing position to see this wonderful city.", "Date": "May 9, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "California", "Title": "“Perfect location, Good staff”", "Author": "JLongo", "ReviewID": "UR3419439", "Content": "My husband and I just stayed 4 nights at the Hotel Regno. We booked it because of their affiliation with American Airlines, and used mileage for half the cost of our stay. It is a perfect location, we walked everywhere except when we went to the Vatican. For visits to the Vatican, there is a bus stop just outside the hotel and it takes you right there! The front desk staff was helpful at explaining how to do the bus, and with recommending restaurants. The breakfast is a typical European continental breakfast with a woman there who makes a GREAT cappucino. It was the best cappucino I had the whole time in Italy.", "Date": "April 27, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Very good bargain”", "Author": "0Odisseus", "ReviewID": "UR3414710", "Content": "My partner and I were given a bright room on the 5th floor, right on Via del Corso. There was a safe in the room and a brand new marbled bathroom. The double bed turned out to be twin beds put together, but we had no difficulty sleeping well... The location is just next to the Senate, in the middle of everything! I will definitely return.", "Date": "April 25, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Rotherham, S Yorkshire", "Title": "“Ideal Location”", "Author": "Sues51", "ReviewID": "UR3399630", "Content": "Have just stayed 3 nights at the Regno and would stay here again. I was there with my aunt (85) and we enjoyed our stay greatly. Our room was not at all small and we faced onto via del corso, noisy until about midnight at the latest and then very quite. They do come to do your room early but it was done for us one morning when we got back from breakfast!! You can eat as much or as little as you want at breakfast. Very central for walking to the sites or taking the buses which you catch just by the hotel (1e). I would recommend this hotel for anyone any age. English is either spoken or understood by everyone we spoke to in Rome.", "Date": "April 23, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Crawley, United Kingdom", "Title": "“Ideal Hotel for a Short Break”", "Author": "munkypete", "ReviewID": "UR3366166", "Content": "I was a little apprehensive about choosing a two star property but the Regno was perfect. Slap bang in the middle of town, easy walking distance to all the main sites. We even walked from the main train station, but got a taxi for the return, Rome is so hot in August. The hotel rooms were very small, but clean and nicely appointed. Separate shower/wash room and separate toilet. We had a balcony (again small) to watch the world go by. Good sound protection from the outside. The hotel was very busy in August and the breakfast room was a little crammed. My only poor comment would be to say that the staff were a little slow at clearing the breakfast tables (of departed guests) and several mornings we cleared our own table to be able to eat. The reception staff were very friendly and helpful. If I ever go back to Rome, I would certainly consider staying here again.", "Date": "April 15, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Sussex", "Title": "“Great location, good value”", "Author": "A TripAdvisor Member", "ReviewID": "UR3276579", "Content": "Stayed at Hotel Regno for 5 nights in March 2005. All major sights are within easy walking distance and hotel is clean and well maintained. Staff are helpful and speak good English. Our room was a little on the small side but they did offer to find us a bigger one if we were unhappy...we chose to stay where we were. I would definitely recommend this for a 'no frills' functional hotel in the heart of Rome.", "Date": "March 16, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Christchurch, New Zealand", "Title": "“Great Hotel”", "Author": "bevchris", "ReviewID": "UR3275624", "Content": "We have now stayed at the Regno twice. Both times we have found the hotel and staff to be great. Our room was clean and comfortable. The hotel is in a great central location. Breakfast is great. We would definately stay there again without hesitation.", "Date": "March 15, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5"}, "AuthorLocation": "United States", "Title": "“Great place in the middle of Rome”", "Author": "gfmstravel", "ReviewID": "UR3254999", "Content": "This hotel is really incredible. While not a lavish 5+ star hotel, it has an incredible location on Via del Corso. Many of the major attractions of Rome are no more than a 5 to 15 minute walk! Trevi Fountain, Pantheon, Piazza Navona, Spanish Steps. The staff are all helpful, and all speak excellent English. We saw reviews about the rooms being small, but we were assigned a room that was almost a junior suite, with a balcony(ask for room 134). Room is well equipped, has an honor bar/refrig. Even though on top of busy street, room is well soundproofed. We went in late Feb, and got a rate of $660USD(all taxes, etc, plus breakfast) for 5 nights which was less than what it would have cost to go to Los Angeles. Right out the front of the hotel, are 2 bus stops(both directions) that will take you almost anywhere in Rome, or where you can make a connection. Coming into Termini from Fiumicino, take the 175 bus to the Minghetti stop on del Corso- hotel across the street. Cant get any easier. If you aren't in the market for a super expensive international hotel, this would be a great choice.", "Date": "March 6, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Pittsburgh", "Title": "“Great Hotel, Location and Staff”", "Author": "gooddaughter", "ReviewID": "UR3242523", "Content": "I was very happy with the Hotel Regno. It was so close to all the major attractions of Rome, along with the shopping areas and good restaurants. The hotel staff couldn't have been friendlier or more helpful to me as they all speak very good English and didn't mind answering my questions. The rooms were small, but thats typical in Europe. They were very clean and neat. The location was absolutely perfect - I would definitely stay there again if I ever go back to Rome. And the Italians in general were lovely people. What a great trip!", "Date": "March 3, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Darlington UK", "Title": "“Bel Regno”", "Author": "Oztrekker", "ReviewID": "UR3232410", "Content": "Back today after 4 enjoyable nights at the Regno. If you could pinpoint a central location this is it! Everything (apart from Vatican area) is within easy walking distance but it is the hospitality of the staff that make this hotel - reception, cleaning, bar/breakfast - everybody is so so nice! The rooms are immaculate and yes, some of them are small but the staff cater and read your every need (we had an usually cold spell and threw an extra cover over and next day the beds were made with extra covers). Towels whiter than white. Breakfast ample. Would recommend this hotel to anyone (some renovation going on at the moment - not that you notice any noise or disruption) Say hallo to Gabrielle - he is a sweetie!", "Date": "February 26, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Wonderful City Break”", "Author": "A TripAdvisor Member", "ReviewID": "UR3213656", "Content": "I booked a one week stay at the Regno after reading good reviews on this site, and when I got there I was not disappointed. The holiday was to celebrate my father in laws 60th birthday as he had always wanted to visit Rome. His requirements were a central location, walking distance to all the major attractions, a clean, tidy and friendly hotel and ofcourse at a good price, Although the hotel is small it met all of his criteria and we all had a lovely holiday. The rooms were small but clean and decorated well, both our rooms had a balcony which is a must for a view and ofcourse if your a smoker (no smoking in the rooms)! I would recommend this hotel to anyone who wants to be at the heart of everything.", "Date": "February 21, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Gladewater, Texas", "Title": "“Hotel Regno Center of Excitement!”", "Author": "DecorateOrnate", "ReviewID": "UR3100893", "Content": "Hotel Regno is located on Via del Corso, which is the best of locations! My daughter and I stayed there in May 2004, and we loved it. Our room was small, but very nice. We had our own window with balcony which over looks del Corso. Look out your window to the right and you see the beautiful bldg with the chariots on top, and walk just across the street and you have a bank for ATM. Walk just beside the bank side street and you will run into the \"Trevi Fountain\" The breakfast buffet is delicious and has a wide selection of foods with juice, etc. The staff is above excellence. They are so friendly and helpful with anything we asked. They helped us with any place we desired to see. We just loved our experience there. You are in walking distance of Trevi Fountain, Spanish Steps, Via del Conditti which is wonderful shopping. I highly recommend it!", "Date": "January 31, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Destin, Florida", "Title": "“Really terrific”", "Author": "A TripAdvisor Member", "ReviewID": "UR3091333", "Content": "We stayed at the Regno for four nights in January 2005 and found both the service, cleanliness, and help to be outstanding. On the first night we had a little problem with the room and the next morning the reception person moved us into another room with no hassle. All the staff were extremely helpful in recommending restaurants and things to do and see. We will always stay at the Regno. Oh, this is our sixth trip to Rome and this hotel is by far the best.", "Date": "January 27, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Brisbane, Queensland", "Title": "“Loved the Regno”", "Author": "Lambsy03", "ReviewID": "UR3011606", "Content": "I will never forget the wonderful time we had in Rome and part of that experience was the Regno. Yes the rooms were a little small and the bathroom was a little cramped but everything was clean and tidy and had so much charm. (Outside our window was a busker playing the accordion, it was like a scene from a movie) The staff were wonderful, the breakfasts of pastries, fruits, etc were to die for, and I have yet to experience a cappuccino to equal Regno's. The proximity to the beautiful Fontana di Trevi and the mesmerising Pantheon only enhanced my stay in Rome. I have left my heart there, one day I will return to collect it.", "Date": "January 17, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Newcastle, England", "Title": "“Loved the Regno”", "Author": "A TripAdvisor Member", "ReviewID": "UR2844376", "Content": "Despite the hotel not receiving notification of our booking (via British Airways) & being \"full up\" we were allocated an upgraded suite (at no extra cost)which was superbly decorated & furnished. Breakfast was all you could ask for and the location ...well you won't find anywhere more in the centre of attractions & shops. We would recommend this hotel to anyone.", "Date": "November 24, 2004"}, {"Ratings": {"Cleanliness": "4", "Overall": "1.0", "Value": "3", "Service": "5", "Rooms": "2"}, "AuthorLocation": "uk", "Title": "“hope you have lots of money!!”", "Author": "chickie2", "ReviewID": "UR2843220", "Content": "When arriving in fco airport rome DO NOT use taxi's they charged us 87 euros to our hotel when returning i used airport shuttle and for 2 people it was 29 euros. Hotel was situated on via del corso everything was within walking distance fab!! Lovely helpful staff but street and fellow guests were heard 24/7 there was no escape. When visiting all major attractions colleseum the pope etc. you MUST pay 4 a tour guide to explain monuments etc as there is no other source of information,this obviously is costly anything upto 80 euros each. Highlight of the trip a man called TONY at the colleseum there is nothing he doesnt know about the roman empire you can listen to him 4 hrs!!", "Date": "November 23, 2004"}], "HotelInfo": {"Name": "Hotel Regno", "HotelURL": "/ShowUserReviews-g187791-d203082-Reviews-Hotel_Regno-Rome_Lazio.html", "Price": "$131 - $1,311*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Del Corso 330</span>, <span class=\"locality\"><span property=\"v:postal-code\">00186</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "203082", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/a4/9b/a49b3a4f8f5f4723bac96120360902f47large.jpg"}}