{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“Good value for money”", "Author": "porcer", "ReviewID": "UR126748474", "Content": "Hptel is very close to Spanish stairs and Fontana de Trevi. Realy walking distance to almost everywhere in Rome. We stayed with child, and it is also good location as Villa Borgesse is nearby to walk there and let child run and jump :-). This is not possible in crowded areas of tourist districts in Rome... Breakfast is quite poor, but enough for moring: bread, ham, cheese, yogurts, crouasans and some choice of sweets. Corn flakes with milk is available also. Enough for starting the day... Rooms are small but cozy, modern design. One thing was a bit annoying: fan in bathroom is quite noizy, but luckily working only when the light in bathroom is on. Prices are nice, 80 Eur per night for a family. Personel is friendly. English skills are not perfect, but enough.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Excellent room, great location and GREAT value”", "Author": "ktfranks", "ReviewID": "UR126257253", "Content": "I stayed here for one night in February. This is one of the best values I've ever had in a hotel room. The location was excellent, and the room was quite comfortable. Many, many sights are within easy walking distance. I think this hotel is significantly under-rated, and it is by far a much better hotel than some higher rated (and more expensive) ones. I had a room on a high floor, and the view overlooking Rome was incredible. Highly recommended!", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cadiz, Spain", "Title": "“Good Location!”", "Author": "sarah j", "ReviewID": "UR126083141", "Content": "5 mins walk from metro! lots of restaurants and bars around! Perfect location! Hotel was clean, breakfast was simple but nice. The room was just slightly small but it was OK! the only negative thing I have to say is the room was extremely hot and the air con wouldn't work. The hotel staff were extremely helpful! wifi in rooms! They also have a PC in reception with printer which is available for free for guests. I would not recommend hotel for someone disabled as you have a lot of steps to get to the hotel or hill! And the lift it quite tight! Strip club next door was no bother! Would stay again.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Couldn't ask for anything more”", "Author": "Ffsbj", "ReviewID": "UR122985864", "Content": "Cheap, renovated(looks exactly like the photos), double room is big for Europe, great breakfast, smart area(5 star hotels everywhere), walking distance to sites, helpful concierge, and quiet. Much better than 3 stars and at 70 usd a night probably your best value.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jerusalem, Israel", "Title": "“excellnet!!”", "Author": "yael c", "ReviewID": "UR121316495", "Content": "the hotel was in perfect location we walk all rome!! the service was good and the was very nice and help us!! we was very enjoy!", "Date": "December 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Overpriced!!! Not what we expected...”", "Author": "Hadas E", "ReviewID": "UR119699374", "Content": "We stayed 4 nights at Caprice hotel and except from the lovely renovated rooms (although very small), we didn't enjoy our stay! over The location is not convenient at all!!! if you want to reach the city center to Trevi or Piazza Spania, it takes 20 minutes and the way back is a long incline - we had to take a taxi each time... The sorrounding is also very borring- there's nothing interesting in via veneto- only expensive restaurants... The breakfast is awfall!!! Only cold buffet -no eggs- only dry bread or dry crossiant (not fresh at all!) with cheese/ham ,cornflakes, cofee, yogurt and preserved fruits. The reception is hardly helpfull, it feels like you \"bother\" them asking questions... I would't recommend. There are better hotels at that price!", "Date": "October 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Rishon LeZiyyon, Israel", "Title": "“Nice hotel for a nice price”", "Author": "Hadas L", "ReviewID": "UR117452221", "Content": "close to the center, to the metro (barberini), easy to arrive from and to the FCO airport by train. when we arrived, the reception looked really old, but the room was very nice looking, new and clean (but it's also very small). I liked the bathroom (it has no bath, only a shower - but very convenient one). the towels and sheets were clean. what I didn't like was that the air-conditioner didn't cool the room at all. it almost didn't work, and when we complianed about it, they said they know about it and they are trying to fix it. anyway, we were there for three nights, and we had to open the window and thank to god that the weather is windy. the breakfast was satisfying, great service with a smile! the receptionist on the other way, did help us, but was less nice. over all, it is a good hotel for it's price, and we have had a nice time staying there.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Good location, excellent sleep, but subpar breakfast”", "Author": "Robimane", "ReviewID": "UR116067883", "Content": "We got a deal and paid 100 Euro / night. The location was good - within 10 minute walk to Spanish Steps and Trevi Fountain. A strip club is next door (you would never know though), but unfortunately we did not see any of the girls. The reception is dank and outdated, but the rooms were very nice with a modern design - a surprise to us. TV had several channels, but not one in English, which was a disappointment. The room was almost pitch black once you closed the curtains, so sleeping conditions were ideal. Pros: modern design, exceptionally quiet and dark in room Cons: breakfast is dull, outdated decor in reception area, no English TV channels", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Lodi, NJ USA", "Title": "“Enjoyable Stay”", "Author": "CAAnthonyLodi_NJUSA", "ReviewID": "UR115428166", "Content": "I was very happy with our stay at the Caprice. The rooms were clean, small but liveable. The bathroom was nornal, the shower was great. The best thing about the hotel is that it is off the main street of Via Veneto, so it is quiet. The main street has many hotels and restuarants and too many people. It was nice to walk away from the crowds when we were heading to the hotel. Yet we were still close enough to everything. The staff was very nice and helpful. They set up our tours, gave us directions when we needed it. Our favorite desk staff was Claudio, he was friendly and accomodating. The only complaints we had was there is no mirror in the room except the bathroom mirror, we did not even know how we looked until we got in the elevator which had a wall mirror. Also, they don't have any American channels on the TV and no statelite so we had to watch the Cosby show (old shows) in Italian for a whole week. They could have at least one channel. They do supply breakfast in the morning...the same thing everyday croissants, ham, cheese and salami... not sure why. The croisasnts are wonderful but you do get sick of it after awhile. Our Hotel was rated a 3 star and was reasonably priced.. If you are looking for comfort and cost savings, but not luxuary then I reccommend this hotel. I would go back there again.", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Moscow, Russia", "Title": "“Really a good budget place to stay”", "Author": "Anastasia_Art", "ReviewID": "UR115409420", "Content": "I stayed in the hotel for 4 days in the beginning of July 2011 & I never regret it. The stuff was friendly, breakfast was just what I wanted & the location was ideal. As it was said many times here, there's no need to be worry about the club next door as the hotel is very quiet. My room was very nice with very comfortable bed, though it was rather small. I would definitely stay here again!", "Date": "July 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "athens", "Title": "“good hotel”", "Author": "arind", "ReviewID": "UR91504756", "Content": "After the negative impression i got from the entrance of the hotel and the non renovated entrance (reception) i was surprised by the modern and newly renovated and clean room. negative impresision was the charge for 2 bottles of water from the minibar for the price of 8 euros!!! but they only gave a receipt for 4 euros. The rest was some kind of tax, so they said...", "Date": "January 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Wonderful Place. Great deal!”", "Author": "Portland_and_beyond", "ReviewID": "UR88943466", "Content": "Not sure why there are other bad reviews on Hotel Caprice. This place is in a great location near the Spanish Steps and near a street with 5 star hotels. Walking distance to anything, including the Metro. Yes, there is a strip club next door, but we didn't hear anything from it. Our room was newly and tastefully remodeled, large, and had a wonderful bathroom. I couldnt' believe we got this much from a hotel for the price! Would stay again", "Date": "December 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tokyo, Japan", "Title": "“A standard economical one in Rome”", "Author": "WhiteCamel", "ReviewID": "UR88475355", "Content": "The room I stayed wasn't big but OK with own bathroom, TV, fridge, and a single bed. It was enough for one person and comfortable staying there even for a week (Aug 2007). The price was understandable considering the buffet type breakfast and the location. Staff were also nice but needed to be cautious if you're alone.", "Date": "November 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "adelaide", "Title": "“worried about club next door”", "Author": "chocolatestarfish7", "ReviewID": "UR86360682", "Content": "but needn't have. Hotel very quiet. Felt quite safe as solo female traveller. Location wonderful. Tiny lift a little claustrophobic but felt quite safe. Continental breakfast was always fresh and plent of it. Staff very helpful.", "Date": "November 8, 2010"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "NL", "Title": "“Horrible experice with dishonest staff”", "Author": "tappat", "ReviewID": "UR74878791", "Content": "I reserved a room with a credit card at the Hotel Valadier for 3 people and when we arrived at 10pm in the evening they said that they tried to put my credit card through but it was not valid so they gave our room away. HOWEVER, they had another hotel!, not far away that they could offer us a room in. This was the Hotel Caprice, next to the lapdance hall with all the working ladies hanging out by the front door, lovely! It was undergoing renovations, total mess, and they charged us the outragous prices of the Hotel Valdier. If I didn't have my 9 year old daughter with me I would have walked away. But it was late and we had been traveling the whole day so I felt I had no choice. Oh yea, my credit card went though just fine when we got the Hotel Caprice as I suspected. I would not advise anyone to book a room with any of the Groupe Valadier as this seems to be common practice with them. Their hotels include : Hotel Validier, Hotel Zone, Hotel Diplomatic, and Hotel Caprice. You are taking a chance you won't have the room you reserved.", "Date": "August 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oxford", "Title": "“Decent hotel”", "Author": "JamesypOxford", "ReviewID": "UR56641784", "Content": "Some of the reviews below are quite negative, but while we were there, they were in the middle of refurbishing the hotel, only one floor was left to do. Our room was quite small, but well equipped, all the typical things that good hotels have, flat screen tv, nice shower, comfortable bed, but one of the best bits were the views as we could see out to the Vatican. The breakfast was a average, but did the trick. It is in a good location, and within walking distance of Termini station and the spanish steps. Whilst it is upstairs from a lap dancing club, that never really bothered us, as we couldn't hear anything from it, and it has become quite a good story to tell! All in all, it was a good place to stay, cheap, clean, and welcoming.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Washington, DC", "Title": "“Ok”", "Author": "gibs120", "ReviewID": "UR36435164", "Content": "You definitely get what you pay for in Rome. This was a decent hotel to save some cash and stay for a few nights. The decor is terrible, it was stuffy, and smelled like smoke. It was also not very secure. The breakfast is included and is the best part of the hotel. The Cica Cica Boom Boom sex shop was not a problem...we thought it was pretty funny, and the topic of many of our conversations. The building was undergoing some renovation during our visit, so it was noisy at times. The staff were friendly and always willing to teach us some Italian. The location is pretty good as well - it is close to the Spanish Steps and Palazzos.", "Date": "August 1, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Cape Town, South Africa", "Title": "“Not the best area, but close to everything”", "Author": "catire79", "ReviewID": "UR32805765", "Content": "We booked via the internet, and it was a good value for money. Rooms are ok size, and bathrooms are larger than most in european hotels. Internet is available at a price, and breakfast is included in the dayrate. The only thing we regret is the location of the hotel, which is in the middle of bunch of night go-go clubs.", "Date": "June 21, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "San Jose, CA", "Title": "“Worst Hotel of my Entire Trip!”", "Author": "handtalker", "ReviewID": "UR27231344", "Content": "Don't ever stay at the Hotel Caprice. It's old, noisy, and even though the write up says it's been remodeled, don't believe it. There was scaffolding right outside our room and sketchy sheetrock working still going on in the hallway. The worst part is that it is right next door to the Cicacica Boom Strip Club. We listened to booming music, horns honking, and screaming men till almost 4 in the morning. Even if this was a 5-star hotel I wouldn't recommend it. It was a terrible way to end an otherwise good trip.", "Date": "April 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Grosse Pointe, Michigan", "Title": "“Pleasant Experience”", "Author": "GrossePointer2", "ReviewID": "UR22663179", "Content": "I was part of a family group that stayed at the Caprice during the last week of July 2007. My wife and I, our daughter, and my sister had two rooms for 7 nights. We would gladly return there, and in fact plan to do so during the summer of 2009. The greatest asset of the Caprice is its staff: the two lovely women who run the breakfast room, the two gentlemen who assist guests with luggage, etc., the housekeeping staff, and the several desk managers are all friendly and helpful. My wife and I had taken a very short adult education course in Italian, and the staff was almost always patient and helpful as I tried to speak it. The Mr. Cunningham lookalike (I now know his real name but am not using it) was still there, still charming and helpful and unfortunately got me started on fig pizza, which is impossible to find in the U.S. The Caprice is located on the north side of the Via Liguria, four doors east from the Via Emilia. On the Google satellite map, the entrance is just under the eastern branches of the tree. It is not on an alley. The Via Liguria is a rather pleasant side street that is not nearly as congested and noisy as the Via Veneto. Between the hotel and the Via Emilia are an upscale furniture display room (Roncato), an entrance to a restaurant (La Fontana), and the entrance to CicaCicaBoom. The CicaCicaBoom closed during the time we were there, not likely, it seemed, to reopen. But open or closed it was no problem. The Via Emilia ends at the Via Liguria, and its extension to the Via Veneto is a stone staircase that leads down to the Via Veneto near a convenient bus stop (southbound routes 52, 53, 63, 95, and the wonderful 116 and northbound routes 630, 25, 55, 60, 52, 53 and 116). Along the three blocks down the Via Veneto to the Barberini Metro stop are restaurants, a very good bookstore, and an exchange bureau that sells the terrific RomaPass for E20 with no surcharge (we got 8 of them). For the most part, the Via Liguria near the hotel was relatively quiet. I am the only member of our group who smokes and so was frequently alone outside the front entrance of the hotel day and night, talking to passersby, employees of nearby businesses, municipal workers watering the trees, hotel employees, and even a few customers of the CicaCicaBoom (mostly Germans), where the prices were so very high that it hardly attracted riffraff. I found the street very pleasant. It was noisy only in the morning when employees at area businesses arrived for work on their motos and the waste disposal trucks picked up garbage and unfortunately crushed the bottles and cans during the process. To answer the question that most troubled me before I stayed at the Caprice: its amenities. It has an elevator, air conditioning in the rooms, and a pleasant breakfast room down a few steps from the lobby. It is not suitable for people with limited mobility. Websites are wrong that say that the hotel has a pool, or poolside service, or a rooftop restaurant. I am puzzled about where these errors originate, but I think it may be the small chain that owns the Caprice. When we were in Rome, Romac’e (July 25-31, 2007, at page 192) carried an ad for the Caprice that said, “There is a Restaurant, Roof Garden, Pianobar, Pizzeria, and a floor completely reserved as a Meeting Center.” In fact, this is all wrong. It must be that the owners of the chain confuse the amenities of another one of their hotels with those of the Caprice. I thought the breakfast was just fine. I had feared that I couldn't get American coffee in Rome and took instant Maxwell House with me. The women at the Caprice made the best American coffee I've ever had. The greatest drawback of the Caprice is the size of the rooms, as has often been pointed out. The rooms and bathrooms had recently been thoroughly refurbished, and the interior designer unfortunately chose to cover the walls of the rooms with dark green fabric, which makes the rooms seem even smaller and more den-like. Most of my hotel experience is with large five-star hotels and resorts in the U.S. for business meetings, and I too like large rooms with sofas and armchairs for relaxing and reading. At the Caprice, the most pleasant place to read is in the long lobby, where there is a PC that for a small fee can be used to get email, tourist information, etc. over the Internet. The lobby is also a pleasant place to talk with other guests to the extent you can remember any German, Spanish, or French. While we were there, there was a large American family (about 16, I think) from the Pacific Northwest who were also staying there, and according to the grandmother they were all happy with the hotel. The Caprice is an affordable three-star hotel, but if you must have a large room, you will have to go elsewhere. Still, I believe that we had a far richer experience staying at the Caprice and getting to know its staff than we would have had at a big five star hotel. We hope very much to go back there this summer.", "Date": "December 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Michigan", "Title": "“Hotel Caprice-Rome”", "Author": "Jenzybenzy13", "ReviewID": "UR20258991", "Content": "My husband and I stayed at the Hotel Caprice for 3 nights. It was a decent stay. The rooms are old and worn but sufficient for a good nights sleep, a hot shower, and to periodically catch up on US news from time to time. The location was pretty good in my opinion. Not far from anything. The breakfast was decent however there was not a lot of variety. What I did like about their breakfast was the available time to eat. We visited Venice and Florence as well on our vacation and they held very tight windows for eating breakfast. The Hotel Caprice kept about a 4 hour window to eat breakfast. The staff was helpful. They reserved a transfer to the airport for us on the last day of our vacation. The rooms were clean and provided decent space. Overall I would say it was a good hotel but Rome is a big place and if you are in it for the perks this place is not for you.", "Date": "September 21, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Kelowna, BC, Canada", "Title": "“Shakedown at the Hotel Caprice”", "Author": "Ambient1963", "ReviewID": "UR20109115", "Content": "I booked this hotel via Expedia, gave all the information required including that I was arriving with two children aged 12 and 9. The room was booked as two adults, and one child since children for this hotel were 11 and younger. No indication was given as to an additional charge for children. This is normally done automatically when booking with Expedia. I checked into the room in the late evening, with no apparent problems. The room was very small and a bit shabby, though relatively clean, for Europe. We had settled in and were getting into bed when I received a call at around 11 pm by the front desk. They insisted that I pay an addition 50 euros for each night we were staying. They said that I was required to pay extra for children. They said that Expedia should have told us this and it was a common problem with Expedia bookings. I would blame Expedia for this except that the hotel knew that people would arrive with children via Expedia bookings expecting that the room was fully paid, yet they did nothing to correct it. This is clearly a shakedown. They have your money, you have arrived and possibly settled in, and they require an additional fee knowing that you will not have anywhere else to go and will simply pay the fee. For me, this was totally unacceptable. I refused to accept the shakedown. I was then told that I would have to leave, which I did. I didn't wait to be thrown out by security. My children were already upset enough by this. So, I was left wandering the streets of Rome late at night with two small children, hoping to find somewhere to stay. Fortunately, I found acceptable accomodation around 1 am, but it was a pretty miserable couple of hours. I am now trying to get my $500 back from the hotel. Expedia is handling this for me, but they cannot contact the manager. This is nearly two months after I complained to Expedia.", "Date": "September 16, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“Would not recommend this hotel”", "Author": "DaniKMelbourne", "ReviewID": "UR18702486", "Content": "We stayed at the Caprice Hotel for one night with the intention of booking additional nights once we had seen the hotel. Lucky we did this as we were not impressed with the hotel. Whilst the location was fanastic, a mere 10 minute walk to the Spanish Steps and easy access to the Metro, the hotel was next to a sex shop (with others around the corner). The hotel staff were friendly however some would say a little flirty - we were two females travelling. The rooms were small and not at all \"modern\" as summarised in the review of the hotel. The breakfast was also not worth the effort.", "Date": "August 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Not bad”", "Author": "Hoyas2000", "ReviewID": "UR18090869", "Content": "We booked the Hotel Caprice after their sister hotel, Hotel Diplomatic, gave our room away. When we got there and the staff was very accommodating and made us feel welcomed. Our room was ok and was a nice size. The breakfast was pretty standard--meats, cheeses, breads, and a toaster--but it was good. The location, however, could not have been better--walking distance to the Spanish Steps, Trevi Fountain, and even the Borghese Gallery if you wanted a longer walk. Overall, it was a good stay after a somewhat chaotic experience with Hotel Diplomatic.", "Date": "July 21, 2008"}, {"Ratings": {"Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Francisco, CA", "Title": "“Sign language has never been so much fun”", "Author": "AlexxR", "ReviewID": "UR13790481", "Content": "I can admit that the awe inspired by Rome greatly overshadowed the flaws of the hotel, so maybe if I separate it into positive and negative qualities it would be easier to give it a fairer review. There were many positive things about the Caprice. It's an old hotel conveniently located near the Spanish Steps, and as such its charm is just that of an old hotel. It even smells old. The staff is great, nobody can really speak English but they're veterans at talking without words. They were very helpful, just persist and you, too, will become a veteran in sign language. One of the people at the front desk gave us chocolate for kicks, and we were always greeted going in and out. Sometimes I felt they were going to break into song and dance. The room was cozy. I was in a triple and didn't feel too crowded. Yes, it's shabby, but if you're in Rome you probably won't spend much time awake in it to notice. The beds are pretty stiff, depends on how you're used to sleeping. I liked it, though. It was quiet for the most part, the only noise we heard were the neighbors coming in after a wild night out. In the mornings, breakfast was continental: bread, salami, cheese, ham, butter and jam, along with baked goods. And of course, juice, milk, coffee or hot chocolate. Location was amazing, of course. It's 5-10 minutes from the Spanish Steps and 10-15 from the Trevi Fountain. From there it's easier to walk to the Pantheon, which would then be easier to walk to Piazza Nevona. It's close to the bus stops and underground system. There weren't a lot of negative things about the Caprice, just the kind of negative that makes you laugh. For example, the tiny elevator smelled like goat and the cultural exchange via sign language between me and the staff was a lot of fun. I don't think our bathroom door closed all the way, and one person at a time could see the TV. Like it matters, really. Why watch TV in Rome? Others have said it lacked style, but I felt it had a certain kind of charm to it that most modernized hotels don't have. A great, friendly staff and a cozy hotel beats a lavish hotel with temperamental receptionists. All I can say. I'm only giving it a \"neutral/above average\" because the facilities were average, and when you think about it, it is an average hotel. Or it's what an average hotel SHOULD be, rather. The room was cozy but my mother found it cramped, and yes, there was plenty of shabbiness to go around. Their internet was also down. Helpful hints? To get there from the FCO Airport, take the train to the Termini and then the metro (Linea A) to Barberini. You can then take a bus from the stop \"Tritone\" (a stone's throw from the metro exit) to Via Veneto, or you can bum a map from tourist information and walk it if you don't have a lot of luggage. From the bus stop, climb up the steps and it should be to the right next to... la dolce vita lap dancing. Careful of pickpockets and people trying to short-change you. If you get short-changed, kick and scream until you get what you're supposed to. The last thing they need is someone scaring away other potential customers. Other than that, enjoy your stay! The hotel is pretty shabby, but Rome and the great staff should make you forget about it in no time.", "Date": "February 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“What you see doesn't have to be what you get...”", "Author": "AliandMin", "ReviewID": "UR10264565", "Content": "We were staying in Rome for 5 days. Having seen three rooms within our first 24 hours at this hotel, we can say that it can range from the downright unacceptable to a comfortable three star establishment. Owing to an unforeseen problem, we were told that our original room was unavailable and they had a smaller one for us or a transfer to their sister hotel. When we checked the room we returned to reception to say that it was totally unacceptable. A double bed was squeezed up to the wall and the bedside cabinet didn't allow the door to the bathroom to open more than halfway. A very small window six foot above the floor allowed no natural light and certainly no chance of a view. We were then shown a marginally larger room but there was barely room to walk round the bed. In both rooms the bathroom consisted of a shower head, a toilet and a very small sink. The net result was a completely soaked floor after a shower. The decoration was poor and in need of refurbishment, the window and shutters were rotten. We wanted to reject this room but there were no others available and we were told we could move to a better room the following afternoon. Our third and final room was an acceptable double room with a large window, ample floor space and a complete shower cubicle. It was still a little shabby in places. Had we had to endure either of the first two rooms for the entirety of our stay in Rome we would have had a very miserable time. However, the assistance of the hotel staff to improve our stay was welcome. In the hotel's defence, although the facilities are poor and in dire need of a spruce up, the beds were hard (good!), the shower water was very hot and it had air con, a mini bar, safe and hairdryer, along with basic toiletries. Unfortunately, there were no tea/coffee making facilities in the room and the breakfast room was only open until 10am. The location of the hotel was ideal as it was near Via Veneto with its beautiful bars/cafes/restaurants and also within walking distance of the Spanish Steps and Trevi fountain. The tourist bus has a stop nearby for all major attractions. From our experience, we can fully understand the wide ranging views shared on this website.", "Date": "October 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Newcastle", "Title": "“Nice clean hotel, very central and great value for money”", "Author": "Chris_R77", "ReviewID": "UR8357194", "Content": "We spent 7 nights in the Hotel Caprice, and it was a very pleasant experience. The hotel is situated right next to the very popular (And expensive) Via Veneto but is a fraction of the cost of a hotel on the street itself. Location wise, it's pretty central to all the tourist sites in Rome. We went everywhere on foot and although places like the Vatican and the Colosseum are a bit of a hike, they're certainly walkable from the Hotel Caprice. Other sites like the Pantheon, the Trevi Fountain and the Spanish steps are just a short walk away and we went repeatedly to all of them. Speaking of which, a quick tip to any travellers to Rome: You can drink from ALL the fountains (Of which there are hundreds), except the Trevi which is chlorinated. We bought one large bottle of water when we got there, and refilled that as we went round. To the hotel itself - We found it extremely clean, with polite, friendly staff though the decor in the rooms is a bit drab and wasn't to our liking (Padded dark green wallpaper, anyone?). The bathroom was positively tiny (See photos) to the point that if you sat on the toilet your knees would touch the wall in front of you but it was, like the room, immaculately clean and well stocked. The shower had great power to it and could be turned up so that it almost blasted you clean, which was lovely after a hot day out and about. Breakfast is an \"all you can eat\" continental affair served right through to 10:30 am. We tried to eat quite late and stuff ourselves full, a tactic which meant we could manage on just an icecream for lunch then a full meal in the evening. The food itself was fresh and tasty, comprising cereals, fruit, bread rolls, pastries, ham, cheese and salami. Coffee, juice, milk and water were available to drink. We found the bed to be rock hard, which may not be to everyone's liking. That said, a day of trecking round Rome and a few drinks on the evening meant we had no trouble getting a good night's sleep. Speaking of which - The lapdance club \"Cicacica Boom\". As others have said, it's a complete irrelevance to your stay in this hotel. We heard precisely nothing from it and saw nothing or no-one from it either. A sign and a doorway, that's really all there is. Overall, we'd recommend this hotel. We had a very pleasant week there, and for the price and location you'll really struggle to do better.", "Date": "August 5, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Essex", "Title": "“Splendid Hotel”", "Author": "happytravellerEssex", "ReviewID": "UR8251765", "Content": "We have just arrived back from a four day city break in Rome staying at the Caprice. Wanted to arrive in Rome looking a little smart instead of the usual travelling gear but failed to do so due to the intense heat - to say I glowed would be polite. The staff on the desk were extremely helpful and showed us to our air conditioned room. En suite just the job. We received clean towels daily. Due to the heat we chose to rise early and have breakfast between 6.30 and 7. Choice of cerials, fresh rolls, pastries, coffee and juice. The location is superb for sightseeing. We were given a map by the chap on the desk and he kindly showed up places to visit and told us places to avoid eating due to the cost (i.e. in front of the Pantheon) where prices are elevated. Overall our stay was extremely comfortable and | would wholeheartedly recommend the Carpice for a reasonably priced hotel. Oh yes, by the way, the lap dancing club that has been mentioned really was not a problem and on our last day it had a notice on the door and was completely shut up.", "Date": "July 29, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Yorkshire", "Title": "“great find!”", "Author": "HTeachers", "ReviewID": "UR7774194", "Content": "I spent days trawling the internet for a moderately priced hotel in a good location in Rome for husband and I and so I was pleasantly suprised to find that the Hotel Caprice was great!I Staff were very pleasant and when we arrived they immediately helped us with our luggage.Our room was small but adequate,and very clean-(I am very keen on clean bedding and bathrooms in hotels! )and overlooking the street-I wouldnt agree with the reviewer who called it a 'seedy street'-it was a minute off the Via Veneto with all the swish hotels and we felt totally safe going to and from the hotel.Yes there is a lap dancing club next door but dont let that put you off at all-it was never open when we went out in the evening and when we returned there was always one or two men outside,I suppose they were'bouncers' but they looked respectable and I imagine there to stop any trouble before it began.Breakfast was good with as much as you liked,our only gripe would be that there was nowhere to make a hot drink during the day-but not that necessary in a hot Rome!I would recommend this hotel to anyone wanting a decent hotel in Rome that is centrally placed-Spanish steps,Trevi fountain and many other sights were all within 10/15 minutes walking distance,and the 1 Euro fares on the metro and buses got us every where else!", "Date": "June 5, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Glasgow", "Title": "“Ups and downs”", "Author": "HonestScot", "ReviewID": "UR7580716", "Content": "Well what can you say? It really is in a good area for travelling from - Barbarini metro and bus stops nearby. But if you like walking, everywhere is accessible on foot in Rome from anywhere. This hotel is cheap, but really cheap for its location. It is possible to find better value in less touristy areas. The hotel itself - front desk staff helpful, especially the guy who looks like Howard Cunningham from Happy Days. It is next to a lap dancing club but there was no noise or hassle from there. The room was miniscule and the bathroom a tiny cupboard and no, your not in Rome to spend time in your room, but after a day on your feet its nice to come home and relax. The room was cleanish. If I had had my time again, I would go and stay in another area of town for the same price. Just for people to place me, i'm 29 yr old professional from UK - well travelled.", "Date": "May 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "veo beach", "Title": "“Excellent location and convenient”", "Author": "Cor2na", "ReviewID": "UR7049170", "Content": "We were at the Caprice March of 07, and the 3-day stay was enjoyable. Someone helped us with our bags right away. The desk managers were always helpful. There is even a phone that you can use - no charge for local calls to make reservations, which we did for Villa Borghese. We definetely fell in love with Rome this trip. You can walk to Villa Borghese; to the Spanish Steps (about 15 mins); and to lovely piano bars/restaurants. We enjoyed Harry's Bar - great singers and piano - not sure their time schedule, and it is just 5 mins away (take left at Via Veneto, and procede all the way, right before the entrance to the underground walkway to Spanish Steps. Metro is very easy to navigate, though mostly we had to use the machines to get tickets, and this requires low denomination Euros. Police make a definite presence, but this is good... they are watching, and helpful with directions, even. The rooms can be small, and for a long stay in Rome that would be difficult. Breakfast is good, and served in a charming little room. Also, internet: 1 euro for 1/2 hour.", "Date": "March 12, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Surrey England", "Title": "“Not for obese Americans”", "Author": "Silverpablito", "ReviewID": "UR6805307", "Content": "I was a bit concerned about the mixed reviews of this hotel. Americans seemed to hate it whereas the Europeans thought it was OK or great. The hotel is a good 20 minutes walk from the main station but for one Euro each you can get the metro for two stops to Barberini and then you are just three minutes away. The hotel is in a bit of a seedy back street, but in a nice part of town, right by the American Embassy. You can walk almost anywhere from here and get the Metro to the Vatican. The Spanish Steps and Trevi Fountain are less than five minutes away, so it is a pretty good location. There is a topless lap-dancing club right next door so if you are from the American bible belt you may prefer to go elsewhere. This is only open later in the evening and you cannot see or hear anything so I wouldn't worry about it. It is a typical European city centre hotel in this price range. Rooms vary in size and can be small. The beds are standard five foot for a double and so if you are used to six foot beds you might find them tight. The furniture is generally laminated chipboard. There is a reasonable amount of storage and a safe and mini bar. We had a balcony with French windows and table and chairs outside. There is heating and air conditioning. The bathroom was a good size with bath and shower. Everything was very clean. I didn't find the staff to be rude or off as alleged by some. Do try and speak a few words of the language when you speak to Italians. They will soon come back to you in English when they have smiled at your efforts, but making the effort makes a lot of difference and it does get their back up if you launch into English and assume they understand. The breakfast was cereal, cold meat, cheese, croissants, pastries, bread, yoghurt, fruit juice and coffee. All you can eat and very good for a continental breakfast. I am sure there are better hotels out there but for the money you could do a lot worse.", "Date": "February 17, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great Location”", "Author": "Danglecherries", "ReviewID": "UR6763410", "Content": "I stayed here for 3 nights. I was searching on the internet for a long time to find a decent budget location. I paid €105 per night for 2 people in Hotel Caprice and I booked it through Otel.com. For the price I was very impressed. The room was small and decoration was dated but it was perfectly clean and I simply cannot complain. The bathroom was spotless and the shower was great, really powerful! The rooms were cleaned daily and towels replaced. There was a mini bar, tv and hairdryer in the room. Breakfast was bread, pastries, ham, cheese etc and was nice and fresh. You can also have it delivered to your room in the morning for a nominal fee. I was also impressed that breakfast was served from 6.30am until 10.30am which suited me as I am not an early riser and usually miss breakfast in Hotels because they finish so early. The Hotel was in walking distance of the Spanish Steps and the Trevi Fountain. It was also only a short walk from the subway station (red line) Overall, I was delighted with my choice of Hotels, if you are on a budget I would highly recommend this, it was great, I have nothing bad to say about the place!!!!!", "Date": "February 8, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Chicago, Illinois", "Title": "“We were disappointed.”", "Author": "A TripAdvisor Member", "ReviewID": "UR5472463", "Content": "We stayed at the Caprice Hotel in Rome, and were somewhat disappointed. The concierge was slow to help us when we arrived, and seemed to be somewhat bothered by having to deal with us for check-in, internet use, etc. The room was so small that my husband and I kept stumbling over each other. The room was clean, but again, very small. At night, we were surprised to find that the address next door is a strip bar advertising \"lap dances\". Obviously, this would not be a place to bring children, or anyone else that you love and respect. The one bright spot was that the concierge did get us a ride to the airport on a day when the taxi drivers were on strike, but that ride was not inexpensive.", "Date": "July 16, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Scotland", "Title": "“great location”", "Author": "A TripAdvisor Member", "ReviewID": "UR4241616", "Content": "booked this hotel on the net after being told Barberini was the best area in Rome to stay in and couldn't believe the amazing price (roughly about £30 each per night) We didn't expect it to be very nice after the bad reviews (particularly the cockroach one) but were pleasantly surprised. The lobby is nice and welcoming , the staff are friendly and very efficient and the room we were allocated was nice and clean. Irish people would like this hotel as everything is green!! The bed was so comfy and the room was tidied to a high standard each day. We found it nice and quiet with no noise so if it got too warm, we just opened the window. The breakfast is an all you can eat affair and was really nice too. I think this hotel is worthy of its 3 stars. We had a really lovely stay there, perfect location- right next to Trevi Fountain and Spanish Steps with Barberini metro just next to hotel. Loved Rome and would definitely return to this hotel for its price, cleanliness and location.", "Date": "December 14, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "3", "Service": "1", "Rooms": "2"}, "AuthorLocation": "New York, NY", "Title": "“Not the best, not the worst.”", "Author": "Yoshi_Robot", "ReviewID": "UR3488413", "Content": "The room we had looked out on the street side. Was a little noisy, but about as quiet as can be expected. It was clean and has a nice bathroom. The evening desk staff was very nice and helpful, but the daytime staff was rude and inconsiderate. The day we checked out, the concierge wanted us to leave by 10am even though we had been told check out time was 12pm. He then gave my wife a big attitude because she only had a 20 euro note versus coins. Finally, the \"shuttle\" to the airport is actually a 48 euro car service, a charge we only found out about once we got to the airport (I suppose this is partially our fault, but no one at the hotel mentioned it as they were booking it for us). The breakfast is rather bland even by the low standards of this place and the furniture in the room is a bit down market. I'm sure there are worse places to stay in Rome, but we will never stay here again.", "Date": "May 19, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "1", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Sarasota, Florida", "Title": "“not a great hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3478848", "Content": "stayed there in Dec of 2003. Travel agent said it was a good hotel. Booked a single room, small, bathroom small shower size of postage stamp, shower curtain sticks to your body and the water goes all over. discovered cockroaches crawling all over the walls, room was hot and noise level was high. Slept with lights on to curb the cockroaches, found them crawling in my suitcase. Yuk! people were friendly though. bathroom seemed to be clean. will not stay there again!", "Date": "May 17, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Lake District, UK", "Title": "“GREAT LOCATION EXCELLENT VALUE”", "Author": "Lin_Harry", "ReviewID": "UR2478043", "Content": "We chose this hotel for its ideal location - and indeed it was - also because we got such a cheap rate - we knew it was a 2 star and so not to expect much - and so we were delighted at such a bargain. Ok the rooms are 'cozy' but the staff were helpful. Ok so there is a strip club next door -but you can easily ignore this and the price and location far outweigh everything. We would definately go again.", "Date": "August 20, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Ireland", "Title": "“Great Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR2448313", "Content": "Great Location, about five minutes from Spanish Steps, great restaurants etc. Desk staff very nice, breakfast top class, nicest Cafe Latte I ever had, rooms not the greatest, small but functional but hey a holiday in Rome is about spending as little time in your hotel as possible.", "Date": "August 14, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Channel Islands", "Title": "“Good Value for Money - Great Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR2081960", "Content": "Spent New Year in Rome 2003/4 and had a fantastic time. Never heard a thing from the night club next door and as for it being a strip club - perhaps it was, but it wasn't glaringly obvious. The hotel was clean (although I was a little concerned about the electrics at one point but hey, I'm still here) but like other visitors had a couple of run in's with the reception staff. Breakfast was continental but adequate and always fresh and kept you going until lunch time easily. Rooms were cleaned daily and security seemed good. The location is fantastic and if you enjoy a good stroll you can get to see everything in the guide books from this hotel. O.K. not the Ritz but then it is cheaper than the Ritz too. Incidentally, when a night porter tells you he cannot order you a taxi (as you would in the UK) he isn't being difficult, which we first thought, he actually means that in Rome they do not book taxis in the busy evenings, you have to flag them down in the street. Fantasie Trastevere - a night of traditional roman entertainment with the most amazing opera singers and a fantastic 3/4 course meal is a great night out in rome too. Go there - you'll have a ball.", "Date": "May 20, 2004"}], "HotelInfo": {"Name": "Hotel Caprice", "HotelURL": "/ShowUserReviews-g187791-d203174-Reviews-Hotel_Caprice-Rome_Lazio.html", "Price": "$129 - $342*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Liguria 38</span>, <span class=\"locality\"><span property=\"v:postal-code\">00187</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "203174", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/4b/d1/4bd1d808223b2ddabb3e5e2ff18d83f76large.jpg"}}