{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“False representation !”", "Author": "michael D", "ReviewID": "UR125884397", "Content": "I visited this hotel around 25 years ago and recalled that it was fairly nice and even upscale. My visit there last week was actually horrendous. Quite honestly a dilapidated mess. I was scalded twice trying to use the shower because the water control valves in two separate rooms were faulty. The carpeting throughout looks as if it had not been changed since my last visit. The lighting especially in the bathrooms made it almost impossible to get a decent shave. Toilets flushed sometimes as well as the sink drains. I could go on forever about the poor service. Do not dare use their Wi-Fi which is an absolute rip off !!!!! Remember it cost them nothing. Save your money go elsewhere and enjoy Rome with a few more dollars in your pocket.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Best location, switched on staff, classy hotel”", "Author": "Johnny_Javy", "ReviewID": "UR125421441", "Content": "It's only one street away from swinging Via Condotti and 2 minutes walk from the Spanish Steps and Spagna metro station. So, we were right in the heart of all the action and attractions. A charming hotel. Every staff member was so welcoming, helpful and full of great recommendations. Even though we only ate in the restaurant (Cafe Romano) once, it was delicious and the food was better than most other places we tried. We will certainly return when next in Rome.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London, England, United Kingdom", "Title": "“Over priced and over hyped”", "Author": "ChrisF1983", "ReviewID": "UR124600781", "Content": "My girlfriend and I stayed here after booking it as a Top Secret hotel through lastminute.com. I think we paid around £420 for our 3 night stay here and believed we had secured ourselves a relative bargain. This was absolutely not the case. The price we paid as a Top Secret hotel was too much and I would have been even more indignant about the quality of accommodation on offer had we paid any more. The hotel is trying to appear elegant and charming. It is not. It is tired and in need of renovation that befits the character that the hotel has. The quality of the bedding was poor. The bed consisting of 2 slightly larger single mattress leaving an ever widening chasm for one of the beds occupants to occupy partially or fully throughout the course of the night. The duvet appeared to be a very thin low quality synthetic duvet that had been loosely sandwiched between 2 unfitted sheets. Totally unacceptable in a hotel that thinks of itself as high enough quality to be listed as \"Top Secret\". I need to iron some clothes after my journey and went to use the iron. There wasn't one, so I phoned for an iron and board from reception. That was not option either but I was entitled to pay for my ironing to be done within the half hour for a fee of €12 per shirt. No thanks. In fairness, the bathroom was nice (although the shower had a nasty habit of spraying half of its delivery on to the ceiling) and the breakfast included in the price was also pretty good. Additionally, the location of hotel is very good. But I'm not sure that this compensates for an exceedingly average interior. Luckily, Romes more obvious charms, friendly people and fantastic eateries made our frankly disappointing stay a very minor negative in an otherwise thoroughly enjoyable trip. Avoid this hotel if you can and do your homework before booking a Top Secret hotel in Rome!", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“When in Rome”", "Author": "KristenObaid", "ReviewID": "UR124449772", "Content": "I'll definitely recommend Hotel d'Inghilterra to all friends who visit Rome - the location is excellent, but the experience was made even better by our concierge Dario, who went above & beyond to make sure the unexpected snow didn't hinder our holiday plans. Every restaurant & bar suggestion was brilliant & the reservations Dario made for us (especially at hard-to-get-into places) reduced the time we spent outside. Since this was my first luxury trip outside Australia I wasn't sure if Rome could live up to my 20 years of dreams, but it did! :)", "Date": "February 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Opulent Rome”", "Author": "Sbroumand_Nomad", "ReviewID": "UR124366928", "Content": "I stayed at the Hotel d'Inghilterra in 2004 and it was a wonderful experience. The place is 5 star and the location is impeccable. The food in the restaurant is also phenomenal, and the service is exceptional for Rome.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Gorgeous, great location close to everything”", "Author": "Cdngirl_68", "ReviewID": "UR124162308", "Content": "What I loved most about this hotel (aside from its amazing location), was that you could look out the windows and see the real Rome. We were only on the 5th floor, but whether it was laundry hanging, birds singing or the peaks of churches, you really felt like you were in Rome, not closeted away. I had a few baths in the large tub with the windows open to see the view and truly felt like a Roman! There are many cafes close by, and it's very central to both fashion and the tourist attractions. The staff were so pleasant and helpful, even letting me print my boarding pass. We loved it and would definitely come back!", "Date": "February 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Madison", "Title": "“Lovely and Perfect location”", "Author": "RobinB56", "ReviewID": "UR123378629", "Content": "Loved this hotel and is old world charm! We stayed on a lower floor and had to be moved because of the traffic and moter scooters. The new room was equally as nice and the staff was very helpful. The restaurant was in the basement which only served breakfast. I would recommend this Hotel because it was in the best location only 4 block to the spanish steps", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Riyadh, Saudi Arabia", "Title": "“Prime location, excellent service & warm hospitality”", "Author": "Virtuous-7", "ReviewID": "UR122327681", "Content": "The Hotel D'Inghilterra made my very first stay in Rome remarkably enjoyable and memorable. The hotel is located right in the heart of Rome's historic attractions, and is only steps away from Via Condotti, Rome's prime fashion avenue. The hotel itself, orderly and invitingly clean, is designed exquisitely in classic renaissance style. What truly made my stay pleasant was the grand reception and royal treatment we received from the kindly staff, who would cheerfully and promptly rise to fulfill our every request. Hotel D'inghilterra will always be my first choice for accommodation in Rome, and I truly encourage visitors of Rome to consider staying at this splendid hotel.", "Date": "December 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“A Fab City Hotel”", "Author": "gem901", "ReviewID": "UR121690338", "Content": "Stayed here with my husband for 3 nights, We found the hotel charming. Staff very helpful and friendly. Hotel room large, clean and spaciuos. The hotel has a great central location, we walked to all main attractions, and i enjoyed walking around all the designer shops in the evening. We had a fantastic stay at Hotel d'inghilterra, can't wait to return!", "Date": "December 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“The issue with 5*”", "Author": "J C", "ReviewID": "UR121673850", "Content": "My wife and I take each other to a new city for Birthdays and we chose this hotel on star rating and location which are superb, arriving it hits you that's it a little scruffy outside but the lobby much better. We were top floor as i like and the decor was superb but sadly it seemed to stop once in our room which was tatty at best, the main issue was some of the staff as the maid crashed in even with the request not to and the door locked, we had to send the ultra expensive food back as was under cooked despite clear requests and this seemed to annoy the staff too. I have stayed in many hotels in many places and it seems to me when one obtains 5* it stops trying as i see 3* trying hard to be 4* and so on. Overall this hotel is a nice one and you know your in decent company but it's at a high price.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Memorable stay”", "Author": "VoyageDublin", "ReviewID": "UR121616029", "Content": "We were booked from our travel advisor to this Hotel and we really thank her for such a wonderful choice. Fabulous position in the most fashionable and quite streets of the city centre. Staff very polite and genuine and always ready to help. We had a delicious dinner at the Cafe Romano and our service staff was so nice to suggest and to explain all our orders: very professional. Hotel d'Inghilterra is for sure our Hotel in Rome.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“A Total Disappointment”", "Author": "Phyllis K", "ReviewID": "UR120816448", "Content": "We were so excited to begin our travels through Italy in Rome, with our dear friends. We had booked 5 star hotels in 3 cities, but this hotel would be our most expensive stay. The location was excellent, the lobby was fine, but when we were taken to our rooms we were most disappointed. Our room was tiny, there was no room for luggage. My husband suggested putting my suitcase in front of the door, which I knew would be a disaster in case of a fire. The carpet was shabby, the room was dimly lit and my feeling was this must have been the wrong Hotel D'Inghliterra. This hotel needs refurbishing badly. Additionally, although we paid top dollar for our room in advance, it did not include breakfast. On principle alone, we would not dine at their restaurant, so we went roaming for a pastry cafe for breakfast. Do not stay at this hotel until they completely redecorate!", "Date": "November 20, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“A Serious Mistake”", "Author": "PR R", "ReviewID": "UR120633295", "Content": "Booking a hotel in a foreign country is always tricky, and you tend to find yourself relying on the 'star' rating given in review tour brochures. The 5 star rating which this hotel claims, is, in our opinion, an extreme exaggeration. We stayed here having booked a tailor made multi-centre holiday, so we had already stayed at 4 star hotels in two other Italian cities. At the Hotel d'Inghilterra the supposedly upgraded room turned out to be poorly lit perhaps to disguise the shabby and grubby furnishings. In addition a broken chandelier fitting left one arm of the chandelier hanging by a single electrical wire. Given our lack of experience of Rome hotels we decided to persevere. However, the next morning, we discovered that although provided with a fully working plug the sink was incapable of holding any water. The shambles that faced us at breakfast where cutlery and crockery in use was cleared away twice, whilst we were at the breakfast buffet, and where you had to ask for the toaster to be turned on somewhere in the next- door kitchen every time you wanted to make toast, confirmed our suspicions that selecting this hotel was a serious mistake. On complaining we were told that the problems in the room would be resolved by the time we returned to the hotel in the mid afternoon. When we returned we were informed that they could not rectify the problems and were asked if we would like to view an alternative room. Since the problems with the hotel were not just with regards to the room, we declined their offer and checked out, even though we had paid in advance for our four night stay. We moved to what turned out to be an exceptional truly 5 star hotel near the Piazza Navona. Despite the additional cost this move totally rescued our holiday.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“Structure and Staff - Excellent”", "Author": "Sabrina V", "ReviewID": "UR119481904", "Content": "Right in the heart of Rome! Near the shopping, great food, main sites.... confortable rooms, great staff.... this is what you get when you stay at the Hotel D'Inghilterra. Thank you for helping us make our event perfect. Our guests were so pleased with everything from restaurant to the maid service.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "surrey, u.k.", "Title": "“Old fashioned but good - now overpriced”", "Author": "rc51", "ReviewID": "UR119057272", "Content": "I stayed at this hotel some years back and by the looks of their web site the public rooms have been redesigned and probably most of the guest rooms. This is not always to the guests advantage. I actually quite liked the somewhat old fashioned feel to the hotel, nothing slick and pretentious which is becoming more common these days, yet it was comfortable and of course the location is wonderful. My main complaint was the very small breakfast room which really was inadequate and a somewhat cool attitude by the staff, not off hand but could have been a bit more welcoming. It would appear that the updating of the hotel has caused the rates to rise considerably so on my next visit to Rome I would probably consider an apartment which is much better value for a prolonged stay.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Very charming”", "Author": "igotthis", "ReviewID": "UR118527663", "Content": "The hotel itself is gorgeous, with elegant furnishings and settings. You have to see it to enjoy it. I didn't like that the rooms weren't always the cleanest. Nothing was actually really dirty, but they could have been cleaner. Location: Couldn't have been better. Room size: Some rooms may be quite small, but from what I've seen, they make up for it in other ways, e.g. a larger bathroom with better amenities. Staff: Excellent. Always with a smile, and always exceedingly helpful.", "Date": "September 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Great location , awful rooms!”", "Author": "jcrewebrown", "ReviewID": "UR118407608", "Content": "It's a pity that this hotel can not get it right! We stayed in a double DELUXE room where the carpets were stained & dirty that we would not walk barefoot! This is meant to be a 5 star hotel... They are lucky they have location & an excellent restaurant.", "Date": "September 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Stay away.”", "Author": "BHolland85", "ReviewID": "UR118231954", "Content": "Currently staying here for two nights. My wife and I are on our honeymoon and wanted a \"luxury\" hotel in a great location. Unfortunately we chose the D'Inghilterra. Our bed is literally a box with metal springs poking through. The room is old, small and tired. Would have expected much, much more for $450 Euro per night! Motel 6 rooms in the US are much nicer:(", "Date": "September 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Amsterdam", "Title": "“Charming hotel”", "Author": "BidaLokka", "ReviewID": "UR116747735", "Content": "I particularly liked: the central hotel location the bar and other public areas, they were very atmospheric. my big bedroom on the fourth floor, my big bathroom and the small balcony overlooking a small street. the bedroom furniture which was modern and elegant, the big and comfortable bed. the nice breakfast selection. the people at the front desk who all were very helpful and professional. the 10% discount from any meals at the hotel restaurant the breakfast at 18 Euros instead of 28 Euros the free bottle of Prosecco in the bedroom (I suspect this was to thank us for putting up with the noise since some of the floors are still in process of being renovated and there were some works on the small street next to the hotel too.) I did not particularly like: the small front desk area that can be easily overcrowded the cleaning lady who ignores the do not disturb signs the stained carpets and chipped walls the light bulbs that did not work anymore the strange business model: you need to pay for the internet, but if the personal at the front desk searches the web for you, it is free. I felt sorry for the people waiting to check in/out!", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Sydney, Australia", "Title": "“The love affair is over”", "Author": "Heb26", "ReviewID": "UR116280554", "Content": "We first stayed at this hotel in the '70s and it was fabulous. The rooms were absolutely huge with similarly huge (and wonderfully antique) bathrooms. Since then the hotel has been \"updated\" a number of times and each time we have stayed there we have been slightly less enchanted. The common areas have remained much the same and are in fact charming but the bedrooms are tired (ours had very stained carpet) and while the bathrooms look quite good, they don't work eg shower did not work and there is nowhere to hang anything. The front desk area is a nightmare for those checking in or out as it is minute and overcrowded, The Concierge was most unhelpful and was unable or unprepared to make a simple train reservation. The hotel remains in a wonderful position but it needs to get its act together and at the moment is not good value for money", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Shanghai", "Title": "“Worst 5 star hotel since ages (but very good location)”", "Author": "GlamourousShanghai", "ReviewID": "UR116040502", "Content": "The weak point of this hotel are the rooms. They are old they need to be renewed urgently as for example there was not hot water in the barthroom, the cupboards were falling apart etc I must admit though that the location near Piazza di Spagna was excellent and the staff friendly.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“How hotels should be!”", "Author": "studioacta", "ReviewID": "UR115344398", "Content": "Having travelled extensively, I can truly say that I haven't been as well looked after as during my recent stay in Rome at the Hotel D'Inghilterra. It isn't only Location, Location, Location, which is what this hotel enjoys, and so did we, but also service! We have truly enjoyed every moment of our stay. We had a refurbished room on the hotel's executive floor and it was just perfect for a romantic weekend away. The staff were friendly but professional. Loved the bar, where it felt like being in a London's gentlemen club and the food, just fantastic. Even my simple choice of spaghetting with cherry tomatoes was excellent. I heard the hotel is part of a small group, if the other hotels in the group are as good, then I will for sure book them again.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Danville, California", "Title": "“Good location, average service, below par quality”", "Author": "Worldwalker888", "ReviewID": "UR115068963", "Content": "I and my wife stayed at the hotel from May 30th to June 4th in the Classic Double room booked through Expedia. Here are some plus & delta after 6 nights stay. Plus: - got the room switched to a non-smoking fairly quickly after complaining to the lady who took us to the 1st room. We walked down the hallway and got another room in 5 minutes. - room service staff were friendly. - excellent location. - room has safe, hair dryers, etc to meet your basic needs. Delta (need improvements): - light brown carpet has a lot of stains or water marks that look filthy. - the shower water leaked outside the tub no matter how careful you are; very small bathroom in a very small room. - felt like the front desk people did not see your existence. In general, we do not see the hotel is a 5 star, at most I would give 3-star, the cost was at 5-start level though. In contrast, prior to arriving at this hotel, we had very pleasant stays at K+K London (4 nights) and Westin Regina & Europa in Venice (3 nights).", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Very charming hotel”", "Author": "Sandra303631", "ReviewID": "UR113640712", "Content": "The location is priceless. The hotel is very charming. Our suite had a beautiful balcony whith amazing views. The restaurant Cafe Romano has a very good menu and many tables outside. We certainlly would return and recommend.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“we loved it and will be back”", "Author": "GerardSikias", "ReviewID": "UR113627837", "Content": "The hotel is extremelly well located,the rooms are large and the service is good , concierge very helpfull", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "SoCalifornia", "Title": "“Nice hotel ... terrible, terrible rooms..annoying service ..”", "Author": "beachfront71", "ReviewID": "UR111140488", "Content": "stayed here this month based on location, the reviews say it has been renovated but I wish I knew what was done ... The hotel itself is in a great spot, has a nice restaurant, public, area, etc ... but once you enter the rooms be prepared for old green carpet meets a bad paint job. The desk staff are great but the back end staff are annoying.. in 2 days we had the maids wake us up 2 times in the morning by opening the door as well as a cable guy come in our room unannounced to fix the internet .. no knocking, just showed up. The bathrooms need serious work and they \"do not allow irons for safety reasons but will iron your clothes for a fee\" .. this maybe the only hotel I have been to that will not let you iron your clothes ... Overall .. an ok hotel that to me was overpriced and rundown once you are in your room, great location but that does not make up for the rest... This is not a 5* and the reviews really sort of allude to that ...", "Date": "June 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Hotel del Inghilterra Rome”", "Author": "zitoruben", "ReviewID": "UR107022369", "Content": "I had the opprtunity to visit this Hotel which is my favorite in Rome From the location of the Hotel to the Service this Hotel rates very High It has been recently renovated in the rooms are wonderful but whar characterize the Hotel is thei extraordinary Service from bboking restaurnt to arrange trips all you can ask for .Theconcierge Serviceheade by Mr Giuseppe Giaquinta is one of the hihest quality of Service that Ihave had in this Hotel category.This Hotel is a jewell and Istrongly recommend", "Date": "May 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "rio de janeiro", "Title": "“disappointing”", "Author": "leilats", "ReviewID": "UR106001397", "Content": "I guess why you haven't published my report about that horrible hotel...I'm afraid you did not receive it.I can only tell you that: if you like half bottle of Prosecco opened in your room and you are abstemic...You'll understand my complains...", "Date": "April 28, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "los angeles", "Title": "“Great boutique hotel in excellent location”", "Author": "savvygirlLosAngeles", "ReviewID": "UR103703463", "Content": "I like this little hotel because it is in the heart of Rome, walking distance to Spanish Steps. The Beverly Hills of Rome. We had a nice deluxe room with dark curtains and so we slept well, no traffic noise. Breakfast was just perfect, fresh and the restaurant though small was really cozy. We also had dinner outside and my 4 year old daughter then fell in love with Emiliano the waiter. We had a lovely, romantic dinner with the best lasagna with fresh mozarella. I would stay away from tempura dish though and stick to Italian dishes.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“On The Way Back Up!”", "Author": "vanchem", "ReviewID": "UR101814516", "Content": "I initially had concerns about this property based on the recent reviews, so I made a quick inspection trip in January to the property in advance of my group's March arrival. I do admit to being disappointed on my first visit with the overall condition of the hotel (especially the rooms). I had strong words with management about canceling my group because the hotel did not live up to its 5 star rating. I was assured that my issues would be addressed and corrected by the time of my group's arrival in March. I was skeptical at best, but decided to take management at their word. I'm very pleased to report that not only did The D'Inghilterra keep their word but they went out of their way to spruce up the property and even went the extra mile service wise. I as well as my guests found the rooms and carpets to be newly renovated or deep cleaned. The corridors were all freshly painted and the ground floor public areas were as lovely as any you'd find in a 5 star property. The breakfasts were fine (although not overly elaborate) and completely acceptable considering that they were included in our rate. The bar staff were gracious and attentive. Although a few complained about room size and spotty internet connection others were more forgiving, appreciative of the old-world European charm. In short, the hotel did meet our expectations. One piece of advise to future travelers, while this hotel is not at the level of The de Russie, St. Regis, Hassler or Eden neither is its rate structure and your expectations should be adjusted accordingly.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Redondo Beach, California", "Title": "“Very expensive 3 star quality in a 5 star location”", "Author": "CheerfulChickie", "ReviewID": "UR101325669", "Content": "I stayed at this hotel for work based on recommendation by our Italian customer. I assume they made the recommendation based on location, because that's all that is worth the cost of this hotel. It's located only 2 blocks from the Spanish Steps, right in the middle of the luxury shopping district. Chanel, Dior, Valentino, etc are just steps from the hotel. The problem is that those stores can be found anywhere in the world. The main attraction is then the Spanish Steps. You can walk your way around Rome from there. That said, I am otherwise not impressed with the hotel being rated as a 5 star. I did not experience any unfriendly service as others have mentioned. The staff was actually very friendly and helpful. BUT, the rooms are extremely expense, no breakfast included unless you have the higher priced room. If you don't, it's 29EUR for an english breakfast that was quiet plain to me. Another 18EUR/day for internet. Considering I had just stayed at two other 5 star hotels in Australia before this trip (also for work), this hotel felt like I was in a 2-3 hotel that was just over-priced. I am also told that the translation of the hotel's name is \"The English Hotel\". That's ironic when you come to Rome to see Italy. Perhaps the italians don't think so fondly of their Italian chains, because when I joked about being recommend an english hotel to my Italian customers they said next time I should stay at the \"Hotel D'Russo?\", which translates to \"Hotel of Russia\". So what about an Italian hotel? I still love love love Italy though!", "Date": "March 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“BED BUGS!!!!!”", "Author": "JimPBoston", "ReviewID": "UR89454350", "Content": "BED BUGS - A couple of days after returning from the trip, I woke up with over 100 bed bug bites on my arms, face, and legs. Paid $$ to inspect entire house, no bugs. Process of elimination means this hotel has an INFESTATION. Tried to contact Hotel but would not respond, so I am doing all I can to help inform other travelers. DO NOT STAY HERE.", "Date": "December 9, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“What a disappointment”", "Author": "HJKMIA", "ReviewID": "UR84211685", "Content": "What a disappointment. Our room (259) hardly qualifies for a 3-Star-Hotel. I read Hemingway and Liszt have been guest here. Well, furniture and amenities have not changed a lot since. No radio, no clock unless you switch the TV on. Obvious plumbing issues in the bathroom. Water from the sink took minutes to drain, no reaction after complaining on arrival day), a shower of 2.5x2.5 feet with a door that opens only half way because it hits the toilet, dark light and no make-up mirror. Anything positive? Yes, the location, but that is it.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sonning on Thames, United Kingdom", "Title": "“Some staff let down an otherwise delightful hotel”", "Author": "Barton-bonviveur", "ReviewID": "UR83359317", "Content": "At check-in, staff were indifferent - off to a bad start. Among other shortcomings, they claimed that they could not locate the room key but would advise. Meanwhile, the porter took us and our luggage to the room and the key was in the door. Not a word from this sullen individual who also failed to give the customary run-down on the room. In spite of this, I gave him a decent tip for which there was no acknowledgement whatsoever. Dinner (in the hotel) that night got off to a good start and the Maitre d'Hotel was welcoming and helpful. It then went down hill. Chef screwed-up on my main course to the extent that I was not brought what I ordered. Probably not checked-off against the ticket at 'the pass'. Meanwhile, my wife was obliged to begin hers and had finished it before mine came. When it did, it was a huge disappointment: my wife rated hers 5 out of 5. It/they should never have left 'the pass' . The Maitre d' was embarrassed over my situation and offered complimentary puddings. No marks to the chef who would have won some had have he popped-out to acknowledge his cock-up. Breakfast was a complete disaster - and not just for us. So, it is such a shame that some staff can let an otherwise delightful hotel well and truly down. Its gm needs to 'rattle the cage', big time: we are talking high tariffs here. In conclusion, if these were the downsides, the upsides included a very acceptable room (ours) and the superb location of the property.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "miami", "Title": "“WHAT A RIP OFF!”", "Author": "vazMiami", "ReviewID": "UR80981854", "Content": "I would not reccomend this hotel to an enemy, let alone a friend. the only good thing about it is the location, evertyhing else sucks Will just mention a few, Mildew in shower, old/outdated rooms, cigarette burns in beds/sofas, small A/C, etc etc etc", "Date": "September 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Dubai", "Title": "“Would not stay here for pleasure”", "Author": "DubaiDesertfamily", "ReviewID": "UR79489082", "Content": "Stayed at this hotel with husband when he was on business. When we first arrived we were given a room on one of the upper floors. Very warm, old, out of date. When speaking to colleagues they told us they had a very modern nice room. Turned out there is one (4th?) floor with renovated rooms, all the others are somewhat outdated. Hotel accomodated us by giving us a better room the next day (huge difference!!!). However, other colleagues were not so lucky. The quality of the bed in the \"outdated\" room was okay though (room was very small and bathroom especially not of modern time). Location is fantatstic, very close to Spanish steps and in the middle of the fancy shopping district. Would never book this hotel by own choice. It is a pity the hotel doesn't make it clearer on it's website that there are renovated and non-renovated rooms. Would be much fairer to their customers. Price of internet was also high.", "Date": "September 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "NSW", "Title": "“A big disapointment...”", "Author": "Elim08", "ReviewID": "UR78287205", "Content": "My husband and I stayed here earlier in the year. We booked this hotel based on the internet which was a big mistake. The images used on sites such as Wotif and even on the hotels where photos taken on the only renovated floor and does not show at all what the rooms actually look like. The rest of the hotel is very tired and run down and the service was really disapointing. We had to move rooms twive during our stay due to problems with the hot water and the first room we were put in wasn't even big enough to walk around the bed. The 5 star rating this hotel boasts is actaully closer to 3 star in reality.", "Date": "September 5, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Miami", "Title": "“Their Advertisement is Deceitful”", "Author": "Adri0809", "ReviewID": "UR76979335", "Content": "Why didn't I listen to the latest reviews of this hotel. It is terrible. When you look at their webpage, the place looks beautiful. What the webpage doesn't tell you is that only the lobby and one floor (4th floor) of the hotel are renovated. The other floors are dismal. I found this out totally by accident, because their unreliable elevator accidentally opened up on the 4th floor. So, I decided to look at all the floors. We were put into a room on the 5th floor. It was horrible. It was not clean. Dust accumulated everywhere. The bathroom was moldy. The a/c hardly worked. It was hard to breath in there. We asked to change rooms and they gave us a smoking room on the 3rd floor, with an even worse mold problem. We told staff that was not satisfactory, we wanted something on the 4th floor, and finally, they gave us the most basic of rooms next to the elevator on the 4th floor. Yes, this floor and room was much better, but I can see the dust starting to accumulate in the air vents. This hotel may have been rated as a top location, but that must have been a long time ago. It is run down with a staff that barely makes an effort. Do not waste your money here. You will feel cheated.", "Date": "August 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Hampshire", "Title": "“5* location - poor quality hotel”", "Author": "ajsHampshire", "ReviewID": "UR72229541", "Content": "As many of the other reviews say, this is a 5* location and once you find your way around the main Via Condotti (avoiding hordes of tourists) it is amazing. The hotel itself though is very poor. Breakfast - uninspiring, poor quality and limited in choice. When we stayed we were literally pushed out of the way by the staffs children who were raiding the breakfast and then wandering around the main reception area eating. Staff are aloof and unattentive. Each day we overhead complaints at the front desk, none appeared to be resolved. The doorman never opened the door for us in the 8 days we were there, and the reception was hardly ever manned! You spent many minutes waiting for someone to arrive to give you the room key. An American guest on a short trip asked reception for advice on which were the best museums to see in his short stay. The response: \"ask tourist information\". Others have already said the advertised roof terrace is not available. It was used for a private party during our stay and was VERY loud late into the night. A lot of American guests. We were on the 5th floor, wiht a nice balcony. BUT, you just couldn't use it as it was too hot and the air conditioning in the room so poor the room would never cool down again. Always had to use the 'do not disturb' sign on the door when we were in the room as we had a succession (housekeeping, maintenance, gardener, mini-bar (!)) of staff through the room otherwise. The location is excellent, and if you can get a price on rooms you are happy with, and have low expectations - then this is good for you.", "Date": "July 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Nice hotel in good location, unfriendly service”", "Author": "AA82", "ReviewID": "UR67127811", "Content": "I'm really on the fence about whether to give this place 3 or 4 stars, and whether I'd recommend it, because while I think it's above \"average\" (3 stars), I don't think it's quite \"very good\" either. It all depends whether you are looking for a really nice room, or really great service. But the point is, at a supposedly five star hotel, you shouldn't have to choose between them. Our deluxe room was nicely decorated, had very modern conveniences, and was fairly spacious for a European hotel room. The shower was great (no problems with hot water as I had read about), there was a tv behind the mirror in the bathroom, the bed very comfortable, and A/C working just fine (I mention the thermostat because of past reviews complaining about it). Housekeeping kept the room very nice and did turn down service every day.... although they walked into our room without really knocking, which wasn't a huge deal, but just one small example of the unrefined service. Our biggest complaint about the room was the lack of tv channels. We watched CNN for 4 days straight. I realize no one goes to Rome to sit in the room watching tv, but we did go back to relax for a while every night before dinner, and watched tv while going to sleep, and there should have been more variety. Of course, you CAN get more channels..... if you are willing to pay 30 euros a day for satellite tv and internet access. It seems like a \"five star\" hotel should just include something like this and not make you feel like you are being nickel and dimed for something as basic as tv service. You can buy unlimited internet service in your room for 18 euros a day, or you can use the computer in the hotel lobby right next to the front desk where you still have to pay by the hour (and sit there looking like a concierge). Breakfast buffet was good, it included cereal, fruit, pastries, meats/cheese, scrambled eggs, etc. The biggest atrocity at this hotel is the service. The staff is just completely, unbelievably unfriendly and not helpful. When you walk into your hotel, you at least expect the doorman and front desk employees to say hi to you! We were completely ignored every single time we entered. We made dinner reservations through the concierge, but they don't confirm anything with you. I had requested a reservation for 8:00 somewhere, and didn't hear back from the concierge... finally at 7:45 I called the front desk to find out what happened and they said \"oh yeah, of course it's confirmed\"... at which point I had to have them reschedule for 8:30, since we hadn't left the hotel yet (assuming the reservation had not been made). I asked them to please reconfirm with me that they were still able to get the table for 8:30 and the concierge argued with me saying that I should just assume everything is confirmed and they don't need to call me back to tell me so. What kind of five star service is that? Unlike most previous posters who seem to have had issues with their rooms, we were happy with this hotel on the surface.... it's clearly in a good location and our room was very nice looking and clean. But it was among the most unfriendly service I have ever experienced at any level.... while being one of the most expensive rooms we have ever stayed in. If it were less expensive, I might still say it was worth it. But I have to assume there are better places out there for the money, and probably even for considerably less.", "Date": "June 10, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Too expensive for what it delivers”", "Author": "Lallum35", "ReviewID": "UR65797996", "Content": "I booked a quick one-night stay at Rome at Hotel d'Inghilterra. Having stayed at its sister hotel in Florence (Helvetia&Bristol), which was highly commendable, I figured it would be the same. While the booking process (direct with hotel) was swift and attentive, and they offered a discount on their Junior Suite, when we arrived to the hotel we could not enter the room until 13h. They had advised, of course, that check-in time was 14h but I told them I would be arriving by 12h. A luxury hotel like this one boasts to be would have had the room ready with prior notice. The stay was brief, as I said, but enough to realize that what Hotel Inghilterra calls Junior Suite would be a bare Deluxe Room anywhere else in Europe - and I am used to smaller European-style rooms. Air conditioning was doubtful, the view of the room was clearly its best feature, with a small balcony where one could sit and have breakfast if the concierge would have cared to ask. Which brings me to the second fault I have with Inghilterra. The two young ladies in charge were efficient, kind, and seemed very capable of being in charge of everything. Why did we need the actual concierge in charge, who looked angry all the time and performed the coldest hotel welcome I have ever experienced? One wonders. Incidentally, that same man tried to bill me for the standard price of the room when I was doing the check out. I gently pointed out that there had been a special offer, he distractedy said \"Oh yes, yes\" and issued the correct final bill. Breakfast buffet was ok but nothing out of the ordinary. I guess Rome provides for most of the extraordinary, but one also expects a top-rate hotel to keep up with the city. Especially when paying for a Junior Suite! All in all, a very disappointing experience given the hotel category and in comparison of the very fine, extremely better Helveia & Bristol at Florence. During our visit we checked out the close-by Hotel Hassler and I have to say this will be my next Rome hotel when I get back.", "Date": "May 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Don't Do It! (My first negative review on Tripadvisor...)”", "Author": "capuferg", "ReviewID": "UR62240799", "Content": "Just wrote a long detailed review but it was somehow lost while trying to upload pictures so I'll make this brief... Dingy filthy room. See images of carpet attached. No hot water. Internet didn't work. Terrible service and attitude at front desk. Charged us $40 for breakfast that was to have been included in room rate. (We ate something on the buffet that was not part of the complimentary breakfast!) The only plus is location. There are many other hotels in the neighborhood and likely with better services and amenities. For $400+/night you can do better. Don't be deceived by website or brochure~ they are not representative of what we experienced. Book elsewhere!", "Date": "April 23, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“3 star hotel masquerading as 5 star hotel”", "Author": "newald", "ReviewID": "UR61996482", "Content": "My parents and I checked in to this hotel due to our flight to heathrow being cancelled (volcano in iceland). My travel agent booked the hotel last minute based upon my request that we get a \"four seasons quality hotel\". This hotel was anything but what we had hoped for. The lobby and common areas were small and unimpressive, the reception area cramped and the front desk staff did not seem to know the meaning of service with a smile or how to apologize for hotel shortcomings with grace. The rooms were technologically up to date, however, they were in need of touch up paint on the walls, and carpet/upholstery cleaning. Twice during my stay (3 nights) the minibar person barged into my room without waiting for me to answer the door. The internet was down for one day and there was no hot water one morning (which I see from another review is not something new). There is a definite lack of attention to detail throughout the hotel, which extends from the burnt lampshades in the restaurant, to the burnt out lights in my room, to the shabby, dirty carpets in the hallways, and finally a doorman, who apparently did not consider opening the door for clients to be part of his job description. There was a computer system changeover during our stay which resulted in chaos at the front desk with 3-4 staff running around each other in the cramped 10x10 reception area. The concierge desk was empty during our entire stay. Overall, this hotel would have been acceptable had it billed itself as a 3 star hotel (with 3 star pricing). My parents and I had to extend our stay in Rome, and rather than stay at this extremely mediochre hotel, we decided to move to the Hassler Roma hotel - a true 5 star experience. I write this from the Hassler, where we were greeted with staff who know what service really is. We have received a personal tour of the hotel, welcome drinks, a handwritten personal welcome note, and were given a room upgrade with a choice of rooms. Need I say more....", "Date": "April 20, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Los Angeles, California", "Title": "“Disappointing Stay; Look beyond the covers!”", "Author": "2TripAdviser", "ReviewID": "UR48907962", "Content": "We stayed here several days this past August. We had been told this was a 5 Star in Rome and it certainly looked very presidental from the outside. But don't be fooled and look under the covers and read the reviews before you book this hotel. It was more of a 3 Star with lots of issues--air conditioning, small motel style rooms, rude concierge service, and a disappointing breakfast buffet. I'm writing this to warn people that you'll pay $400 night for a 5 Star, and this is NOT A 5 STAR. We had booked our non-smoking King bed room w/air conditioning 6 mos in advance. When we arrived they put us in a room that smelled of heavy cigarette smoke and the air wasn't working. We explained the issue to the concierge and he was perturbed with us. So he sighed and showed us to another room. This room was even worse and my husband laughed when he saw the small toilet enclosed by walls which he said he'd get stuck in if he ever sat down. They took us to a third room (and meanwhile we're still lugging all of our luggage) which we knew was going to be the best out of the worst. But we found out the air conditioning was not working. It didn't work the entire time. They brought us a fan, and basically asked us to deal with it. Aghhh The hotel claims that a number of famous people have stayed here, so naturally we assume this is a very nice hotel. We learned there was a separate floor for all the upper echalon people and the rest of the clientel just received the motel treatment. There are much better options..keep looking", "Date": "November 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Oslo", "Title": "“Great location, nice hotel, helpfull staff”", "Author": "Idahelen", "ReviewID": "UR48346310", "Content": "We stayed at the hotel for 3 nights and had a great stay. The location was perfect for sightseeing, but was a bit noisy from the streets late at night and early in the morning. But I guess that´s the price to pay for such a central spot. Room was not huge but quite all right for one couple. Could use some shining up, but it was clean and cozy and everything was working as i should. Staff was friendly and help us out making restaurant reservation. Would stay here again and also recommend it to others.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "san francisco", "Title": "“Great location, but uneven service and room deficiencies left us disappointed”", "Author": "topaccommodations", "ReviewID": "UR46398055", "Content": "Service Issues: We informed the front desk both the night before and the day of our departure that we would need a taxi for the airport and requested that one be arranged both before we arrived at the the hotel and on the morning of our departure. None was arranged by the hotel, despite at least two requests. In addition, there was a lack of follow up with the concierge regarding the status of our request for restaurant reservations - both requested via email before we arrived and at the time we arrived. The hotel simply failed to attend to our request promptly. Room deficiencies: I take hot water for granted, I suppose, especially when staying in a five star hotel. There was no hot water at all in our room upon arrival. This was unfortunate because we really wanted a hot shower when we arrived after walking around Rome for hours. The hotel fixed it for the next day. I also expect that air conditioning operate if provided in a five star hotel room. The air conditioning did not work properly in our bedroom, which made it difficult for us to sleep. Rome can and was during our stay hot. Despite bringing these shortcomings to the hotel, the hotel simply apologized.", "Date": "October 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "YORKSHIRE", "Title": "“Excellent location, an old stylish Italian palace with helpful staff”", "Author": "YorkshireFrancesca", "ReviewID": "UR43129269", "Content": "Five of us stayed here for a long weekend to celebrate our daughter's Birthday. A whistle stop tour it was indeed. We arrived very late at night but received a warm welcome. Very old Italian palatial style buildings & decor, interesting rooms where staff had placed a bottle of bubbly on arrival in daughter's room to celebrate. All our rooms were close together. Great breakfasts, location superb- just near the Spanish Steps and for shops, river Tiber, several monuments and the metro . Expensive, yes, being next to Via Condottii and its inimitable style and shops to be expected I guess but we were paying for the location which was brilliant for us in the few days we had to get around quickly and easily. Helpful staff too who found a restaurant one evening for a celebration plus the concierge had also pre-booked tickets to the Coloseo to save queuing on Sunday morning. We saw a lot, had a good flavour of the city with lots of time to explore, eat, soak up the sun and could return at night to a great place to sleep.", "Date": "September 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“A very nice centrally located property”", "Author": "greece4ever", "ReviewID": "UR38047450", "Content": "We stayed in a suite at the renovated, 4th floor of the hotel, and have only good things to say about the property. Staff was efficient and kind, not overly friendly, but good overall. Our suite was spacious for central Rome, pretty, with TVs in the living room, bedroom and bathroom, and equiped with everything one might need, there are some finishing touches, minor details really, that they have not been fixes very well, but this is ok, and happens most of the time in hotels. We saw also a unrenovated room, and it seemed acceptable, not really filthy and old, although the renovated floor was quite superior to the other ones. Breakfast was ok, good for a small hotel, but it could have had more items. The location is excellent for visiting the center of Rome.", "Date": "August 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "San Antonio, Texas", "Title": "“None of the 3 rooms we tried were cool.”", "Author": "bptx", "ReviewID": "UR36309974", "Content": "This is a decent hotel but not a 5 star. The first day we checked in, we noticed our room was not cool. We spoke with the staff and they agreed to have the room serviced. We ran into the service person on our way to our room and he said he had worked on the unit. The room was still not cool. We spoke with the service person on our way to dinner and he assured us it would be solved, even if they had to put a box fan in front of the unit. When we returned from dinner, that's exactly what we found (see photo). The room had air circulating but still not cool. They moved us into another room which was no better (this was midnight) and when we protested they told us it was the only room left. The next day they assured us a cooler room. Although our stay was 2 nights, we were never able to unpack because they kept moving us. The 3rd room was warmer than the 2nd. This hotel is quaint but desperately needs a facility update before I would stay here again. No one in our group of 9 reported a cool enough room.", "Date": "July 31, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Menlo Park, California", "Title": "“poorly maintained, small room,”", "Author": "Emily07", "ReviewID": "UR35806140", "Content": "Rooms: there is a difference between charming and poorly maintained. This place was the latter: old carpets, old dusty drapes, fruit flies in the bathroom. The shower area was 2 feet by 2 feet, you can barely turn around, water pressure was low, drainage was slow, there was simply no way to have a decent shower. The rooms in general were small, we didn't open our regular luggages, we could only open our small carry on luggages. The 4th floor is newly renovated, however, there were only 10 rooms on that floor so if you read their website and see a new refurbished hotel, you are only looking at 1/10th of the hotel and unlikely to get one of the new rooms. Power outages - I've been to Rome a few times but never stayed in a hotel that had power outages 4 times in 2 days. Breakfast was quite good and some of the service in the restaurant was friendly. Front desk, bell men, concierge provided very limited sincere or honest service.", "Date": "July 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Florence", "Title": "“Excellent stay”", "Author": "MNBA", "ReviewID": "UR34052671", "Content": "The staff was very friendly and the outstanding service made our stay unforgettable. Perfect Locatin.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Rome, Italy", "Title": "“Charming old style!”", "Author": "myosotis", "ReviewID": "UR31750405", "Content": "We spent two nights at this hotel for a business trip. The location is superb, and the hotel is very elegant and charming. Our room was spacious, elegant, very clean and comfortable. The bed was extremely comfy! I loved the old furniture and the beautiful marble bath. Definitely don't come here if you want a super modern and efficient hotel. This hotel is charming BECAUSE it's a bit old and demode'! If, for example, they redid the bathrooms, the hotel would lose its charm. So keep it as it is, and come here only if you have a taste for a style that's a bit retro and delabre'!", "Date": "June 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "tyne and wear", "Title": "“Great location, rooms in need of updating, expensive but food very good!”", "Author": "tindallgirl", "ReviewID": "UR31110148", "Content": "We booked a luxury room for our 10th wedding anniversary and upon arrival were amazed at the room they had allocated to us! It was on the 3rd floor at the front of the hotel, was a reasonable size but the carpet was very marked and the bathroom was disappointing as the bath was cracked and all of the grouting was discoloured etc. The air con was very noisy as if it was very old. It did drown out the street noise though!! The bed was comfortable and I was relieved that at least that was good! We complained immediately but were told we could not have another room until the following day. The other room they eventually offered us was on the 5th floor with a balcony and although it was smaller, it was cleaner so we took it the next day. We had emailed the hotel in January to advise them we wanted this trip to be special due to our anniversary but it was plain to us that no one in the hotel knew it was and so we were disappointed by that. Even when we explained that we wanted a good room as we had booked for that, they were very non committal about which room they could offer! The 4th floor has absolutely amazing rooms and we never saw anyone come out of those rooms dispite asking if we could be moved in to one and being told the hotel was full! We think they keep them for show or for a really special guest so that they stay special rather than tired like most of the other rooms! The food was great, although expensive, but there again Rome is very expensive with the pound being so poor against the euro. We had a meal at the hotel for our anniversay and were happy with the quality of food and one waiter was great! We would say that the more you get used to the hotel and Rome the more you warm to the hotel! By the end of our stay (3 nights) we decided we would go back but would bargain hard with the hotel!! The beds were extremely comfortable and rooms on the 5th floor are very quiet and air con was good too. Shame that you don't even get complimentary water in your room though as coffee/tea/coke etc are 9 euro each! If you go to this hotel do not expect a typical 5 star as it isn't as smart as you would expect, but we have stayed in expensive hotels and not slept well due to uncomfortable beds so...! The location is second to none, but the standard of english spoken is generally poor so caused some problems. So a mixed bag really but generally good. Do not expect luxury unless you get a room on the 4th floor!! And do not expect an English approach - very Italian!!! It's a hotel that could be amazing but needs more updating!", "Date": "May 29, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Washington, DC", "Title": "“Stay Far Far Away”", "Author": "Chezmeit", "ReviewID": "UR24563733", "Content": "I stayed at Hotel d'Inghilterra twenty years ago during a summer college program and had the most wonderful memories of the friendly staff, the hotel's elegance and the location. On holiday with the wife in July 2008, the only thing that had not change was the amazing location, just moments from the best shopping and the Spanish Steps. Sadly, the rooms were horrible, water damaged with broken furniture. The first room we were given was worse than a down-and-out bordello, including the faded red velvet chairs. We did not accept it. The final room (photos added) was better but still dark and in poor condition. The front desk staff are arrogant and unhelpful although all speak English. We did have a deal that included their full English breakfast that made the astronomical room rates palatable. Unless you need to be able to roll our of bed into Versace, stay away. So many other wonderful places in the Eternal City.", "Date": "February 14, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "San Francisco, CA", "Title": "“Here come the thieving housekeepers again”", "Author": "Bewareofthisone", "ReviewID": "UR23002505", "Content": "A nice experience last year prompted us to return to this Hotel d'Inghilterra, but this time we had the worst experience ever. No hot water one night, no water at all another night, jewelry stolen from the room, and above all a cold and dispassionate staff. This is an expensive, so called \"5 star\" hotel which delivers little service and lots of problems. Beware if you stay here.", "Date": "December 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Las Vegas, NV", "Title": "“Not a five star”", "Author": "sobelvsoho", "ReviewID": "UR20460339", "Content": "This hotel is in major need of an overhall. The carpet is filthy. The bathroom in need of an overhall. Not worth $100 a night. Stay away.", "Date": "September 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Washington, DC", "Title": "“Five Stars? Ha!”", "Author": "Washington_DCWowme", "ReviewID": "UR19036730", "Content": "Maybe our perception was a little skewed coming directly from the Hotel Villa Franca in Positano where the balcony in our room overlooked the city and the water, but we were expecting much more in a five star hotel. Our nonsmoking room smelled like smoke and the carpet was old and stained like the carpet in a fraternity house. The headboard, which was the focal point of the room, looked like it came out of the 80's. There was a hole in the ceiling directly outside of our room. Nice touch. This room was on the first floor, but I'm not sure if there are really better rooms. Maybe you just have to stay in the penthouse suites where the terrace seems to be. For Americans, this hotel is extremely expensive, since the dollar is doing poorly. If you're going to spend the money, stay at the St. Regis a few blocks away, where our friends stayed. We saw their room, and it was what a five star hotel room should be -- it was gorgeous and the bathroom was luxurious. The positive things I have to say about the d'Ingliterra...The location is very good. It really is right by the Spanish Steps. The concierge is helpful -- this is one area where the d'Ingliterra beats the St. Regis grand. The outdoor dining area is a nice place to start your day. We only had the complimentary breakfast, so we can't tell you anything about the restaurant other than the fact that a cheeseburger ordered from room service costs 30 Euro.", "Date": "August 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "1", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Disappointing”", "Author": "purdueup", "ReviewID": "UR15994379", "Content": "We spent one brief night at this hotel the night before our departure from the Rome airport after returning from the Amalfi coast. We chose the hotel because of it's reputation and location. The location was perfect, the hotel somewhat disappointing. We arrived before the normal check in time and the room was ready which was nice. The room was located on the third floor facing the street. The room was clean and attractive but there were at least 100 black flies circling over the bed. The windows and the shutters had been left open. We spent an hour killing the flies with the room service menus, leaving smashed flies all over the windows. We later discovered that the walls in the bathroom were covered with mold as was the tub area. All of this for $600 a night!", "Date": "May 13, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Recife", "Title": "“Very good location and charming”", "Author": "cenoronha", "ReviewID": "UR15080335", "Content": "Great location. Very comfortable rooms. Charming hotel and as friendly as one could possibly wish in Rome (that´s not the specialty in the \"Eternal City\"...). Service ok.", "Date": "April 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Wonderful!”", "Author": "patacakeUk", "ReviewID": "UR11694275", "Content": "We have been to the Inghilterra twice, both times at Christmas and just cannot wait to go again. I can't imagine how (or why?) anyone could give this hotel a bad review. It certainly compared very well with other hotels we have stayed at in Rome, for example the Albergo del Senato, where we stayed this October..admittedly the Inghilterra costs more, but you do get what you pay for in this instance, so it serves us right for paying less. The bathroom was luxurious and the bed comfortable and the staff perfect. Excellent breakfast too. Wonderful location and walking distance of most sites. I would not hestiate to recommend this to anyone and it would rank as my favourite hotel of all time if it weren't for the superlative San Clemente Palace in Venice, which just pips it at the post.", "Date": "December 19, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "california", "Title": "“Roman Ruins takes on new meaning...”", "Author": "babacat", "ReviewID": "UR11298811", "Content": "MOLTO LAME is the word that comes to mind when I think of this overpriced, dingy, dark, miserable place. This is a lame hotel for old farts, with dimly lit rooms, ugly dated fixtures that give you the creeps, (not to be confused with antiques), moldy showers, thieving maids, absolutely disgusting, overpriced food and a staff that looks like the walking dead. The front desk staff is snobby and tired and knows NOTHING of customer service, or even treating you with any dignity. They did little but stare back at us blankly and tell us, \"We do not know\" when we asked politely what a good place for dinner would, and they never gave us accurate directions and seemed to delight in our exhaustion when we would return hours later, still not able to find the landmark they had not been able to help us find, which any town fool could have lead us to in seconds. They were amused by our problems, which I would say is the first sign of mistreated employees. The waiters at the restaurant are old and bemused by the fact that two young women would even want to eat at this crap hole, and are obviously mistreated by the management and pass it on snydely to the guests, just like the front desk taught them. As if guests are not already insulted enough by the pot of tea that costs-12 Euros, which is the same pot of tea that we are given for free in the morning, with leftover cookies from the bar that are stale and few. The food at the restaurant was truly terrible, almost so disgusting it was inedible, and so expensive we could have paid a private Mercedes to take us to the best restaurant, (if we could have found it...) ordered two bottles of nice wine, ordered five courses and bought a cheap knock off purse off the street for less than the price of the vile dinner we had. We decided the steak on the plane coming over was better, but tasted strangely similar. And to top it off, they stole my jewelry case out of the room and even when I offered a cash reward and no questions asked, they still took no responsibility and refused to give it back. You can not trust these people at this hotel!!! Also, nothing is free. Not internet, they will not call to confirm a flight for you, no WAY! They will not call a restaurant to make a reservation, they will not find a tour guide to take you to the places they refuse to tell you how to get to...NOOOOooooo, that would be too much to ask this lame place. Also, the bellman was instructed to order us a taxi, NOT a private car, for our departure to the airport at 4:30 a.m, and we are quoted 40-Euros, but when we were dropped off, the driver said it was 60 Euros, because he was a \"private car\", hired by the hotel, not a taxi. He told us the bell man was lying when he said he ordered us a taxi and quoted us 40 Euros. Who knows, they are all in bed together...either way, the whole thing is a rip off and just sucked. Not to mention, we paid over $400 per night just to be abused by these jerks and ripped off over and over and over again. Don't stay here, \"they don't deserve customers!\"", "Date": "December 7, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "St Albans, London", "Title": "“Charming, friendly, great location”", "Author": "fenderdeluxe", "ReviewID": "UR10087178", "Content": "If shopping floats your boat, then this is the place to stay. Charming, 'old-world' style Italian hotel. We had a room with balcony on to the front, which was great. Small room, but huge marble bathroom and tastefully decorated - not modern though if that is your thing. Friendly staff, good English skills, and classic Italian service - with a flourish and attitude. Some of the reviews seem to forget the Italian temperate, and particularly the Romans. Would stay here again. Surrounded by wonderful designer shops, walking distance to many attractions and city bus (must do!). Try Mario's restaurant nearby - excellent. Breakfasts good, stylish lounge area, 'James Bond' bar very pricey, but this is true in most city hotels. Recommended.", "Date": "October 16, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Edinburgh", "Title": "“Great location, mediocre service”", "Author": "ronaldoEdinburgh", "ReviewID": "UR10073164", "Content": "The location is perfect but the initial welcome was cool and signalled further disappointment. Our 5th floor room was dark and gloomy and in need of updating. It was difficult to see without having the lights on fully even during bright sunny days. On requesting a change, we were told that the hotel was full. It was however, a quiet room, so we tolerated it. Staff extended only the basic courtesy and there was a general lack of warmth throughout our 5 day stay. In retrospect, although we did not allow the hotel to spoil our visit to Rome, it did not enhance it. Our overall impression is that it is overpriced for the level of comfort and lack of ambience, perhaps too content to rest on its situation off the via Condotti and upon its former glory.", "Date": "October 13, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "staffordshie,england", "Title": "“Excellent location best part of this hotel”", "Author": "iloveengland_7", "ReviewID": "UR7974258", "Content": "I would not recommend a standard room at this hotel. The room was tiny and the chair at the desk had to be moved to the side of wardrobe to pass the bed and vice versa to open the wardrobe. There was a tiny balcony that was in need of cleaning and redecorating. The staff are rather stuffy but obviously happy to pander to some guests more than others. This was our first wedding anniversary celebration so to say we were disappointed is an understatement. I would suggest anyone planning to stay here ensures they book other than the standard room. I would not rate this 5*.", "Date": "June 24, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cambridge, England", "Title": "“Okay Stay”", "Author": "IKDR", "ReviewID": "UR7838492", "Content": "The Hotel D'inghilterra was not our first choice hotel - we wanted to stay at 155 Veneto, but the hotel delayed it's opening. Expedia rebooked us into the D'Inghilterra in a deluxe room (and refunded £200 for the inconvenience!). GOOD THINGS: The location of the hotel was excellent - just off the main shopping street and round the corner from the Spanish Steps. The bed and pillows were extremely comfy, and considering the location, the room was very quiet. BAD THINGS: Apart from one very cheery girl in reception, the staff were fairly surly. We had an expensive breakfast (once!) in the hotel restaurant. The food wasn't up to much - standard European buffet, and the attitude of the staff bordered on rude. My husband asked for a medium boiled egg, and when it arrived it was almost raw - he couldn't eat it at all. During our three nights, none of the toiletries were replenished - I had a cold, and emptied the box of tissues on the first night - not replaced. Shower gel/shampoo bottles were as we left them - not refilled. On the final day we wanted to log onto the internet for a few minutes to check in for our flight. The hotel would only let you have internet access for a 24 hour period at a cost of about 24 euros, therefore we went into town to find an internet cafe. Don't expect a pool/roof top bar or cafe etc. The only small bar was in a dark windowless room at the back of the hotel. With hindsight, in June, we should have picked somewhere that had a nice cool place to chill out.. I believe that you are paying for the location and the history of the hotel. If that is all that is important to you - great. Otherwise, there are a lot of new boutique hotels opening up that provide more, for less money.", "Date": "June 12, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "World", "Title": "“Less Than Expected”", "Author": "Fantomredmask", "ReviewID": "UR7407345", "Content": "I was going to meet my girlfriend in Rome as she booked two nights in this Hotel through the travel agency with a honeymoon notice as a surprise. I came earlier than her and wanted to make a surprise for her in the room. It was 11 am when I checked in. They advised to come later around noon time as the room was not ready. That is usual. I thought they would arrange the rooms if possible in a case like a honeymoon. I left my luggage and had a walk around. My girlfriend was gonna arrive around 12:30 pm and I get to the hotel at noon just before her. They apparently did not finish to prepare the room yet. I had to wait and I could not make that surprise to her in the room. I was at the lobby when she arrive to the Hotel. Their excuse was that their normal procedure was to check in at 2 pm and we were lucky that the previous guest left earlier. Must not this be something predictable for them at 11 am ? This was not a major issue of course, however some things were not so simple for us then. The room service was not very bright since we could not order anything to eat or drink at 2 am. The bar was closed and we could not get a wine except the selection of some drinks in the mini bar. There were no wine in minibar. The room was nice but the lights at the bedroom can not be turned off without turning the master switch which then turns the bathroom lights off as well. It was strange. We wanted to listen some music in the room but we had only few TV channels none of them is a music channel. There were pay channels, including the music. We were disappointed that we could not listen to music without paying extra. The next day we could not open the door as the old conventional key was not working. We phoned the room service twice, but it took like about 10 minutes for the technician to arrive and help us to get in the room, we were asked excuse to be at the bathroom. He was not speaking English and he sounded like as we were not potent enough to use the key properly. They did not attempt to fix the door lock. Therefore we had difficulty each time we entered the room. My girlfriend's hair curling machine plug did not fit into the outlet on the bathroom wall. We had to ask for an adaptor and they brought it immediately. When I called the room service couple of times from the number written on the brochure in the room, sometimes I had no answer. I had to call reception. Loundry service was good and reasonable. I had my shirt ironed for only 8 €. The last morning, at 8:55 am, our door was opened by the maid when I was at the bathroom and my girlfriend scared to be seen naked. After some time, the maid tried to open the door without knocking or ringing the bell for a second time. This is not desirable in such a Hotel. We left our luggages ready to take in the room ad spent time outside of the hotel until our flight time, after the check out. During the check out, they checked our minibar while we were waiting at the reception, since we were too drunk at the night that we did not remember our consumence. We asked a taxi from the reception but they advised us to ask it from the porter. At the door, we could not see any porter. We returned to the reception to ask where the porter is. Then they tried to find him. We standed outside waiting for them to get us a taxi. After some time, I had to go back and ask once again, where the person at the desk was there with the porter but they forgot to call our taxi. Later, we returned to the Hotel with the cab waiting to take our luggages. What we noticed is that they found our phone charger in the room and put it next to our bags. It was a nice gesture. Later, on the way to the airport, we realised that we forgot to take our champoo and hair balsam in the bathroom and also the pack of Italian cheese that we bought earlier and kept in the minibar. Basically they thought that we left them on purpose for trash. However, I would expect them to warn us about those as they checked the minibar and started to clean the entire room before we left. When we paid the extras, I noticed that they charged 24 € for a local telephone call about 1-2 minutes only. This was not reasonable at all. We did not complain about it as we already paid quite a lot for the minibar already. This Hotel is a five star one, but it is quite simple central Hotel with a classical ancient look and furniture. Do not expect a swimming pool, nor other facilities like a fitness center, sauna, solarium, desk for travel agent, convenient stores in large lobby, 24 hours open bar and room service etc... You can not find those in there.... Enjoy very cool costumes of the reception clerk and their noble respect in the most high society street of Roma... Antonio", "Date": "April 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Great hotel , beautiful and the staff is great”", "Author": "Cwm7128", "ReviewID": "UR6715851", "Content": "My wife and I spent part of our our honeymoon at the Hotel d'Inghilterra and in our opinion iot was great. The room we had was large but still felt very individual. the staff was very helpfull and the majority of them could speak English. They had excellent suggestions for dining and plans for the day. I didnt feel like they were sending me to places they had deals with. Overall an excellent place to stay.", "Date": "January 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Small, but perfectly formed!”", "Author": "EW1966", "ReviewID": "UR6164384", "Content": "This hotel is 400 years old so has not been designed as a hotel. It oozes charm and charisma. It is quirky and interesting. It was reasonable - we paid £2500 for 4 people in 2 rooms for 4 nights - including flights and hotel transfers. I recommend Kirkerholidays.com for their outstanding service and exceptional value. Yes the rooms are a little small, but with they are lovely. We had two inter connecting rooms to accomodate our 2 children aged 7 and 9. The staff treated the children as royalty and could not have been kinder. In fact, reception staff were impeccable. Breakfast was a good selection - even some bacon and egg to satisfy my English taste. The location cannot be bettered. Everwhere is within 25 minutes walk. There are two places we recommend to eat. The first - turn left out of the hotel and walk to the end of the road where there is a T-Junction. Just on your right is a Tea Shop which is a restaurant at night - superb. The other is by the Roman Forum at the end on Via Cavour. There are two eateries side by side, they are both fab and both reasoable. (80Euros for four) We had a fantastic stay. You are staying in an ancient city - a modern hotel would be odd. Besides - get out and see the amazing sights and dont linger in the room! Pantheon is a must. Book tours for coloseum and Vatcian - it is oh so worth the extra. Last tip - The official tours of the Coloseam often include FREE extra tours of The Roman Forum and Palentine. Take your driving licence or passport as EU Citizens get a discount.", "Date": "November 22, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“d'Inhilterra for Business and Sightseeing”", "Author": "Conchobar", "ReviewID": "UR6163030", "Content": "Traveling on business to Rome and with my spouse and child taking the opportunity to visit the city, I chose the d'Inghilterra for its outstanding location and was not disappointed. I upgraded to a Junior Suite on a high floow and for the additional money (given the description of the sizes here at TripAdvisor of standard/superior rooms) it appears the upgrade was well worth the additional money although the rooms are certainly not cheap at this hotel. The room was quite large and the bathroom sizeable. The location is first rate and allows for easy access to the ancient Rome sites. The staff was extremely friendly and helpful from check-in through check-out and was always available for any inquiry or question. The small bar was a very nice place to discuss the events and sights of the day and the bar staff was very friendly and accomodating. I have nothing but good feelings about our stay there.", "Date": "November 21, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Overpriced”", "Author": "marsky", "ReviewID": "UR6101549", "Content": "We were one of the unfortunate people who were given one of the dreaded small rooms. The room was nicely decorated, but was so small that my husband and I couldn't move around the room without bumping into each other. We were told that the hotel was full that night but we would be moved the next day. The new room was bigger, but not as nicely decorated. The bathroom floor actually had a hole in the tile! This hotel is in much need of updating. It may have been grand at one time, but now needs refurbishing. The rugs are worn and the paint is peeling. It is most definitely not a five star hotel. The great location doesn't make up for the condition of the rooms.", "Date": "November 10, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cambridge,", "Title": "“Totally Fantastic Stay”", "Author": "Zenarosa", "ReviewID": "UR6086496", "Content": "I wanted to add my comments on this hotel after reading some of the negative reviews. I stayed here earlier this year for my honeymoon and I have to say that myself and my husband thoroughly loved our stay. The hotel is beautiful and has a fantastic location. We requested a superior room and had breakfast included (£800 for 3 nights). The decor was lovely, the bed was huge and the room was a good size so we didn't feel cramped in at all. The view wasn't fantastic, due to the hotel's location in the shopping area I think rather than any other problems. We found the breakfasts to be varied and delicious, setting us up very well for our days exploring. The staff were very attentive, even opening up the cafe so we could have a drink on our last day, and we had no complaints about the service. Overall, this was expensive and a treat as it was our honeymoon but we felt that it was well worth every penny.", "Date": "November 8, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Phoenix,AZ", "Title": "“Style and Substance in Rome”", "Author": "UmaS", "ReviewID": "UR5923221", "Content": "We chose the Hotel d'Inghilterra for our lodging in Rome to celebrate our 10th anniversary. And, as with our initial concerns about the Grand Hotel Excelsior Vittoria in Sorrento based on previous reviews, I had some misgivings about this choice. As with Excelsior Vittoria, my fears were quickly dispelled when we were shown to our room - almost like a little suite with separate sleeping area, nicely decorated with a small, but lovely bathroom with tub/shower combination. The bed was comfortable, and there were plenty of windows . Housekeeping came twice daily, and turndown service included chocolates and the next day's weather forecast. Plush robes and slippers were provided. Our package included a buffet breakfast in the hotel's cozy restaurant where you can eat indoors or out - cereals, yogurt, breads, meats, cheeses, pastries, fruit, eggs and bacon, as well as tickets to the Borghese Gallery (highly recommended). Each evening we returned to find some sort of treat in our room. The hotel is nicely decorated, with several intimate seating areas. We found the restaurant staff cordial and the bellmen solicitious. The concierges and front desk staff truly shined. Everyone seemed to know our names from the beginning. All were extremely gracious, attentive, helpful and seemed to care about their guests. The location is terrific - in the heart of Rome's most fashionable shopping district, a block from the Spanish Steps, very close to the Trevi Fountain, walking distance to the Pantheon, Piazza Navona, ancient Rome. We found the hotel to be a welcome oasis of calm at the end of our busy days. It is not cheap. But our stay at the d'Inghilterra definitely contributed to a wonderful first visit to Rome.", "Date": "October 6, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "new york", "Title": "“RipOff”", "Author": "paintsflowers", "ReviewID": "UR5894631", "Content": "First of all, I will not use Hotels.com to ever book any hotel. we arrived here knowing that we had paid for Superior rooms and ended up with standard ones. This was my first trip to Italy and all I could think of was a wonderful view from my room. Not so as I opened the shutters to view a steel pipe. I requested another room, which had a view of another building across the narrow street. I hated to be a complainer, so I settled on this smaller room. Found out later that I overpaid quite a bit for a lesser room. At first the staff was stiff, but seemed better as time went on. The food is so expensive. Imagine 6 Euros for a bottle of water? I had a bowl of clear broth for 24Euros. Breakfast was supposed to be included orginially (I blame Hotels.com for that). They screwed up this whole deal. Maid service was excellent (2x a day), but would I stay here again? Only if they gave it to me for half price. I have to say that the doorman was quite nice and very attentive. It is in a good location, but at what cost?", "Date": "September 30, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Sydney, Australia", "Title": "“Just Not Good Enough :::”", "Author": "andrewsydney", "ReviewID": "UR5424589", "Content": "The positives included the great location (near the Spanish Steps) and some nice staff, but the negatives overwhelmed them. In particular, the rooms are just not good enough for the price, and the staff seem under instruction to lowball the room as much as possible. We arrived and had to wait as a group of two couples checking out were complaining about how inadequate their room arrangments were. We were left waiting for about 30 minutes whilst this went in circles. We were then shown to a room which was ridiculous for the rate we were paying, and contrary to what we had requested upon booking. We were then offered another - again, not good enough. The third room was better, but still by far the smallest and poorest equipped room we had on a 3 week euro tour. But, we had been travelling for 5 hours, and just wanted to get moving. The doorman to be fair had no problem moving us each time we said the room wasnt up to scratch, but in a weird way that only made me feel more taken advantage of, in that we were not offered the best available room for the rate from the beginning. Two mornings later at breakfast I heard anotehr couple at reception calmly stating their room was not good enough either ... frankly the staff are being given a hard deal here, as they need to defend the indefensible. They do it with good grace, not rudeness, other than in the case of the head concierge who we found patronising, but the hotel is overcharging. Also, we arrived 30 June. The Head Concierge could not inform us of what concerts were on through Rome for the next 3 nights, as the guide book they used expired 30 June and they didnt have anything else to refer to. We made our own arrangements, but, really, not good enough, especially as we had emailed ahead of time asking for suggestions and nothing was offered other than for the first night (referencing the guide book for 30 June). The room was cramped and decor not as plush as we have enjoyed elsewhere for less. The room blacked out, for no good reason, on the second night. The bathroom scales did not work and toiletries were missing. All little things, but they dont happen at better places, and the hotel holds itself out as 5 star. This area we loved and would definately return to; but we would stay elsewhere.", "Date": "July 4, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "1", "Service": "1", "Rooms": "3"}, "AuthorLocation": "Athens, Greece", "Title": "“Not worth the money”", "Author": "Philleas_Fogg_uette", "ReviewID": "UR5343231", "Content": "The best thing about this hotel is its fabulous location in the very heart of Rome, 1 minute from the Spanish Steps and Rome's luxury shopping. However its other features, and especially the service, do not justify its price. My husband and I arrived at the hotel at around 10.00 pm for a one night's stay in a Superior room (costing 590 Euros with breakfast). Check-in was fast and after that we were led to a first floor room by the bell-boy. The bell-boy got us crammed in a tiny elevator together with our luggage (not a five star treatment at all!). The room was quite nice and comfortable, but certainly not worth the price. The bed was very good and the linen high quality, but we noticed several stains on the carpet, covered up by various rugs and mats. Furthermore, the TV (a large flat screen one) was sitting on top of a small desk, so no workspace at all for writing. There was one armchair and one chair in the room and no coffee table. The bathroom was fitted with stunning Italian marble and had natural light, but it was quite small and we had to jump over the bidet to get into the bathtub. The bathroom amenities were cheap stuff and actually the shower cup and the vanity set boxes were empty. Also there was nothing complementary in the room when we arrived (not even a bottle of water), and for us this was very bizarre given that we had booked directly with the hotel and were paying a great deal of cash for less that a ten hour stay. Anyway, we had a good sleep and the room was quiet, but that was the least we expected. Breakfast was OK but not great, and pesonally I was amazed at the fact that the waitress ignored us all along. Upon leaving the concierge help us sort out a problem with our rail tickets in a very short notice, and this was the only moment of our stay when we felt we got good service. Overall, we did not hate this hotel but we were not very happy with it either. Next time we are in Rome we will stick with the St Regis, which a few months ago furnished us with an Imperial Room and excellent service for less money.", "Date": "June 14, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Bristol UK", "Title": "“Enjoyed this hotel”", "Author": "tabbykins", "ReviewID": "UR5039725", "Content": "We enjoyed a fine stay at this hotel. We did upgrade to a Junior Suite but what we were given I would rate as a full Suite. We had a spacious sitting room with seperate bedroom, linked by large double doors. We also had a large bathroom. I was delighted with our suite which was furnished with some fine antiques, a couple of pieces I coveted for my own home. I feel it is worth upgrading when staying in older hotels in Italian cities for the space provided. Although we do not plan to spend an inordinate amount of time in the room, I do enjoy having a sitting area to relax in. Excellent fabrics, linens, pillows & such a comfortable bed. Quirking plumbing though but hey, you're in Italy, it's usual! We did not eat in the hotel (other than breakfast which was very good) as we are familiar with Rome & have our prefered restaurants there. We found staff to be so helpful & our experience differed totally from last reviewer although we may have been there at the same time. We were prepared with restaurant bookings for every night but one which, due to our own inertia & indecision, meant we reached 7.30pm with nowhere to eat on a busy Friday night in Rome! No problem, concierge sorted us out & got a last minute table at an excellent restaurant nearly. Nothing was too much trouble for the people on the front desk, they are charming. The location of this hotel is excellent, not just for the shopping nearby, but only a modest walk to most things you are likely to want to see, including the Vatican. For longer distances, Spagna metro station is only a few steps away. The price I was quoted for a standard room was, by my experiences of Rome & given the standard & location of the hotel, cheap. I did peep into some of those rooms & whilst they looked beautifully decorated I prefer more space. For me the upgrade was worth it & when we return we will do so again. I can thoroughly recommend.", "Date": "May 7, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "1", "Service": "1", "Rooms": "4"}, "AuthorLocation": "New York, NY", "Title": "“Overpriced for what it provides”", "Author": "PleaseDoNotDisturb", "ReviewID": "UR5015888", "Content": "I would recommend this hotel only if you absolutely have to be within walking distance of the Spanish Steps and upscale shopping (but remember you can get to those places from almost any other hotel for a taxi ride costing less than 10 Euros). Our room was clean and well-appointed, although the bathroom was ridiculously small -- you could literally sit on the commode and rest your chin on the sink. The room was quite noisy from activity on the street below, which continued into the late evening. Staff were snooty and unresponsive. Lunch service in the restaurant moved at glacial speed -- we almost spent our entire trip waiting for the waiter to return to our table. The food was good, but not spectacular. We had difficulty arranging a dinner reservation at an outside restaurant because the concierge does not work on weekends! I guess they don't expect people to eat out on Saturday night. We asked the desk an hour in advance to get us a taxi, and when we arrived downstairs -- no surprise here -- there was no taxi. It was clear that they had never called for one, because one came in 20 minutes after they did place the call. We stood outside waiting for the cab that should have already been there, and then the doorman had the audacity to look at me for a tip when he opened the door for me! Next time, I will stay at one of Rome's other fine hotels for 100 Euros less, and take that 10 Euro taxi ride to the Steps. That way, I'll be 90 Euros ahead of the game when I go shopping.", "Date": "April 28, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "West Hollywood, California", "Title": "“Wonderful low-key elegance”", "Author": "rachilde", "ReviewID": "UR4580010", "Content": "Relatives recommended this hotel but I was initially hesitant because of some of the reviews here. My fears were unfounded. We loved the understated elegance of the place. No, it doesn't have a traditional lobby, but rather several delightful public rooms. We got a great rate through American Express (290 Euros a night) that also included breakfast and tickets to the Borghese Galleries. The room was 50% larger than one costing the same amount in London two years earlier. The bathroom was large and luxurious with plenty of towels and amenities. The tub had an overhead shower and a handheld shower. The TV had internet capability for those evenings I didn't feel like walking to the internet cafe in the Piazza Barberini and the rate was reasonable (compared to what I experienced last year in Malta). Our room was buttery yellow. We noticed that each room is decorated differently. The buffet breakfast was fresh and delicious. They provide a variety of papers to read as well. The doormen and cleaning staff were very friendly and welcoming every day that we were there. The front desk people were efficient and professional. They were helpful with directions, lending umbrellas, etc. The neighborhood was well located for walking everywhere. Overall we were very happy with our stay.", "Date": "March 4, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Glasgow", "Title": "“Hotel D'Inghilterra”", "Author": "pauly789", "ReviewID": "UR4232878", "Content": "My partner and myself went to Rome from 7 December to 10 December and were looking for a romantic, charming, slightly more traditional and nice hotel to base ourselves. Not only did we find this with the Hotel D'Inghilterra, the location is probably the best in Rome. From outside the hotel you can walk to the Spanish Steps in 2 mins and to the Colloseum, Forum and the Vatican within about 20-30 mins. The rooms were big, spacious and very clean and the marble bathroom is sheer opulence. The breakfasts were hearty and filling and certainly set you up for a day of sightseeing. The food in general was of a high standard and the bar served great drinks and the barman were very hospitable in always providing nibbles to accompany the drinks. The staff in general were friendly and we had no complaints in this regard. Whilst the hotel may be seen by some to be a wee bit expensive, deals can be done on the rooms and to be honest the price we paid was worth every penny for the location and the standard of the hotel. Highly recommended and charming!!", "Date": "December 12, 2005"}], "HotelInfo": {"Name": "Hotel d'Inghilterra", "HotelURL": "/ShowUserReviews-g187791-d203146-Reviews-Hotel_d_Inghilterra-Rome_Lazio.html", "Price": "$299 - $803*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Bocca di Leone 14</span>, <span class=\"locality\"><span property=\"v:postal-code\">00187</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "203146", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/86/53/86538eaea755a005e2ed0a5b8b696b908large.jpg"}}