{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "White Plains, New York", "Title": "“Excellent hotel, excellent location.”", "Author": "Aucone", "ReviewID": "UR127383854", "Content": "The location of the Hotel dei Borgognoni couldn't be better, literally steps away from many great attractions, and in easy reach of good restaurants and the omnipresent Italian coffee bars. Rooms are on the small side, like most European hotels, but they are very well-appointed. The staff is friendly and eager to be of help. Breakfast is excellent, and the bar/lounge is a good place for a nightcap. (The hotel is on a quiet street, but Rome is not a quiet city.) Overall, a terriffic place to stay. My wife and I would gladly do ita again.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "tulsa,ok usa", "Title": "“Very nice hotel Great location”", "Author": "skylane9", "ReviewID": "UR124910128", "Content": "Hotel Dei Borgognoni is right in the historic center of Rome, Perfect! Quite too!! They have a nice breakfast, very relaxing bar and aera, Wi-Fi Internet connection and they also offer limousine service and a guarded car parking. The staff was very very helpful! Also when you walk outside turn right and go 10 yards and on your right is a Eurospar market, where you can in the back have the meat counter put together a very fresh sandwitch with fresh bread, cheese and fabulous meats.(cheap!!) pick up some fruit and your good till dinner!!", "Date": "February 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Camp Hill, Pennsylvania", "Title": "“Great location, average hotel”", "Author": "Alicia D", "ReviewID": "UR123939863", "Content": "My husband I stayed for 4 nights at the Hotel dei Borgognoni in October 2011. It's in a great location between the Spanish Steps and the Trevi Fountain, tucked away on a quiet street. Our stay there was less than great. Our first room was terrible (room # 404) - the bed was very uncomfortable, it sagged in the middle; the room was extremely small; and the shower was awful. The half glass door in the shower did not keep in the water and each time we took a shower, the entire bathroom got wet. There were puddles all over the floor. The front desk staff at the hotel is hit or miss (like I read on another review). We told the front desk about the issue and the man called maintenance and brushed us off. That same front desk clerk gave us very bad directions to the Borghese Gallery. The next day we complained about our room to a different front desk clerk, who was very nice and helpful. They moved us to room 307, which was much better - the bed was very comfortable, the room was spacious and we didn't have any trouble with the shower. If we would have had room 307 the entire stay, our review would be much different and more positive overall. The decor in the hallways is very dated and in desperate need of updating. The breakfast was okay. We would possibly stay at this hotel again based on location, but I'd want to ensure we'd receive a room like 307.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“SIMPLY INCREDIBLE!”", "Author": "veronicamorali", "ReviewID": "UR121596124", "Content": "My family and I had such an excellent stay at this hotel. The beds are clean, the floors are well kept, all appliances work, the bathrooms are in great shape and are beautiful! I definitely recommend this hotel to anyone who travels to Rome. The view is also beautiful. The location is great too, it is close by to many restaurants and is only a 4 minute back to the very heart of Rome. I had an awesome week staying in Hotel dei Borgognoni.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Williamsville, New York", "Title": "“What a Hidden Gem!”", "Author": "jgentner", "ReviewID": "UR120289953", "Content": "My wife and I recently took a 3-week trip to Italy. We stayed in Rome the first 3 nights and the last 2 nights of our trip. For our last two nights, our travel agent booked us at Hotel dei Borgognoni. What a wonderful hotel! Tucked away on a very quiet street but near everything (shopping,Trevi Fountain, Pantheon, Piazza Navona, Spanish Steps, good restaurants) we thoroughly enjoyed our brief stay there. The staff was very attentive and helpful, too. This is a smaller hotel (about 50 rooms) so you get more attention to detail. The room was not huge but quite adequate and the bathroom was very clean and a nice size. Lots of closet space, too. The morning breakfast was very nice and served in a quaint, quiet dining room, just off the main lobby. You could tell that the other people staying at this hotel also enjoyed the quiet atmosphere. WiFi was available in the very large and comfortable sitting area of the main lobby. We could walk to almost any of our destinations, which was an added bonus. On our next trip to Italy, we will insist on staying at Hotel dei Borgognoni.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Temecula, California, United States", "Title": "“Great Location but Not Fancy”", "Author": "VicRoc62", "ReviewID": "UR118850179", "Content": "Great location. Rooms are adequate. Staff is very helpful.", "Date": "October 2, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Benicia, California", "Title": "“NICE HOTEL AND LOCATION”", "Author": "LORRIE P", "ReviewID": "UR118252537", "Content": "We loved this little hotel on a quieter street than most near the Trevi. We booked the least expensive double and asked for the best air conditioning. The room was as cool as we wanted while outside Rome sizzled. The staff was very helpful trying to get our lost luggage, making phone calls and giving us free internet access. Although we never got our luggage we still had a fantastic time. Bed was comfortable and the bathroom was attractive and clean. Check out the Market next door! We enjoyed wine, cheese and prosciutto in the terrace off the 1st floor of the hotel. It's a secret little garden with a few chairs and lounges. Not fancy but peaceful. The breakfast was good and enough to carry us through the day. I would stay here again!", "Date": "September 18, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "new york", "Title": "“Good location and decent hotel ( not memorable)”", "Author": "BobbyNY", "ReviewID": "UR118128525", "Content": "Great location and hotel provides all the basic quality services-- room is good size, clean and bed was comfortable. While room is modern, hallway furniture and ambiance is very dated.Breakfast is basic but good. Staff pleasant and helpfull. Easy to get to all sites in Rome from the hotel by walking.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Tripoli, Lebanon", "Title": "“excellent location”", "Author": "44yrswithfamily", "ReviewID": "UR118013903", "Content": "(+) an excellent location. most of city attractions are in the nearby. Breakfast seems to be poor at the first glance, but really they offer almost all what makes good one. (-) rooms not spacy. limited free internet: no free internet in rooms, only 1 hr/day in lobby.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Madison, Indiana", "Title": "“Perfect location, Perfect choice.”", "Author": "kenmac33", "ReviewID": "UR117934853", "Content": "We chose this hotel so we could walk anywhere in Old Rome. The small street the hotel is on is a walkway between the Spainish Steps (500 yards) and the Trevi Fountain (200 yards). We we very pleased with the clean and updated rooms. If you never travel you will find the bed a little hard. If you travel you will enjoy the firmness. The hotel has a nice hidden terrace. Great staff. Fabulous resturant 50 yards from the front door. Walk left from the front door to Ristorante Sant' Andrea where we ate twice. We would stay here again.", "Date": "September 11, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“So pleased with our choice”", "Author": "SallyEF", "ReviewID": "UR115419608", "Content": "Having never been to Rome before, we did a lot of online research before choosing this hotel. Location: perfect. Ambiance: wonderful. Cleanliness: No complaints at all. We would absolutely recommend this hotel.", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "London/Bangkok", "Title": "“DIRTY CARPETS”", "Author": "SDMLondon_Bangkok", "ReviewID": "UR115143522", "Content": "Home last night from 5 nights at this hotel. My room, 101, had the dirtiest, nastiest carpet i have ever encountered in my life, let alone in a hotel room. An utter horror! The wallpaper is an expensive fabric type which too is old and dirty and should have been replaced several years ago. Room was very small but quiet (apart from about 30 phone calls one night from kids in another room-we tried to call reception, etc. but no one answered so we disconnected phone). Pay-per-view films stops on its own and e-mail service drops out but at 19 Euros for 24 hours (packaged) is good value if you watch a few films in the evening . Air-con is dirty as too are extractors in bathroom which have caked on dust. Water pressure in shower is very good. Location is very good indeed. Breakfast is good and staff efficient. The bathroom was very clean and tidy. No sure about pillows or mattress age. This is NOT a 4 star hotel by any shape of the imagination. Putting aside the disgraceful carpet it makes a 3 star, which for what i paid is an outrage. I would not go back as there of plenty of other hotels in the vicinity.", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“I cannot heap enough praise on this hotel!”", "Author": "djkelly46", "ReviewID": "UR114582959", "Content": "The Hotel Dei Borgognoni, has a lot of things going for it: Clean, comfortable rooms, a fine selection at its continental breakfast, but the two best things about this hotel are: Number 2, it's fantastic location right in the city centre. 3 - 4 minutes walk from both the Spanish Steps and the Trevi Fountain, it is an ideal base to explore all of the major sites that Rome has to offer. However it's Number 1 feature is the Staff. We have never come across a collective group of people so polite, jovial, helpful and accommodating as the staff at this hotel. Nothing was too much trouble for each and every one of them, they made our 4 night stay there truly memorable.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Harrogate", "Title": "“Great hotel in a great location”", "Author": "yorkshire_pad", "ReviewID": "UR114226259", "Content": "Stayed here for the first 3 nights of our honeymoon. We were lucky enough to be upgraded to a jacuzzi room. The hotel is in a great location. 5minutes from both the Trevi Fountain and the Spanish Steps. Our room was great, nice size, comfy beds and large bathroom. Overall an excellent hotel.", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Morristown, New Jersey", "Title": "“We loved it and will be back”", "Author": "Nina1959", "ReviewID": "UR111952046", "Content": "We recently spent five days at Hotel dei Borgognoni and it was wonderful. Vincent and the staff at the hotel were fantastic and very helpful. The breakfast was good each morning and the location of the hotel was fantastic. The rooms were not very large but we expected this because Rome is a very old city ( which is what we love about it) The bathroom was large, the room was quiet and clean! We were able to walk everywhere! Grazie mille Vincent! Addio finché non ci incontreremo di nuovo!", "Date": "June 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Loved it! The perfect hotel in a perfect location!”", "Author": "JanineLP", "ReviewID": "UR109220334", "Content": "We spent our last three nights of our european vacation at the Hotel dei Borgognoni and we couldn't have been happier. We loved this hotel! The rooms are amazing, the location is perfect, and the staff are exceptionally friendly and helpful. I spent a lot of time researching hotels in Rome and this hotel exceeded our expectations. I would highly reccommend spending some time at this hotel on your next visit to Rome.", "Date": "May 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "South Coast England", "Title": "“Great Location, Good Hotel”", "Author": "Spiritflame", "ReviewID": "UR109101482", "Content": "We are a couple in our late 20's who were celebrating our wedding anniversary in Rome. As others have said this hotel is in a great location. You can easily walk to many of the major sites. We did not use public transport at all and walked to the colosseum, vatican and everything else inbetween. Our room was bigger than expected considering at lot of reviews mentioned small rooms, it was a little tired looking and could do with a spruce up, but thats the only negative about the room, and such a small thing it's almost not worth mentioning. The hotel was a lot cheaper than others in the area and in my opinion in a much better location as it is not on a main road or busy tourist cut through. We were facing the small street and had our window open all night and were not disturbed at all. We had no problems with the bed or the pillows and did not find them too hard, but I suppose it is all personal taste. Most of the staff were friendly and helpful, however as we were leaving the hotel to get our taxi to the airport, I tripped on the rug in reception as it has ruffled up (very dangerous!) and landed quite hard on the marble floor, only the porter asked if I was ok, whilst the member of reception pulled the carpet straight, neither member of staff helped me up or came to my assistance. Whilst I do take some responsibility for the fall, the carpet is not secured down is very dangerous and no-one from the hotel apologised. My husband was left to help me up on his own and help me out to the taxi. I was surprised that the staff, other than the porter asking me if i was ok, did not seem to care that I had fallen and this was not a good end to an otherwise fantastic holiday in Rome.", "Date": "May 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boynton Beach, Florida", "Title": "“Great Hotel, Great Location...........”", "Author": "5POINT56", "ReviewID": "UR108611201", "Content": "Our primary motivation for a hotel in Rome was location and quality.....this place delivers on both accounts. A 5 minute walk gets you to Spanish Steps, a 10 minute walk gets you to the Trevi Fountain. Despite its great proximity to these and many other great sites in Rome, the hotel is located on a quite street and that's saying something in Rome. Rome is busy to say the least, people, cars, scooters everywhere.....but this hotel allows an escape just a few blocks from the crowds which was really important. The staff were helpful and friendly, the hotel offers a modest breakfast which was sufficient....could use a few more options however. Our room had a private outdoor patio surrounded by citrus trees, which was really nice. As mentioned, the pillows on the beds feel like they're filled with sand....very hard and somewhat uncomfortable...the beds are very firm as well.....though this was a minor complaint. We were able to walk to the Pantheon, the Colosseum, the Forum and other great spots....only taking a cab to the Baths of Caracalla (great ruins to visit by the way) and the Vatican. Avoiding cabs in Rome is a good thing considering the few times we did take them we were hustled by the cabbies. We had room service one night, which was prompt and delicious. Wifi is available in the room and in the lobby, but there are ongoing charges for that. In my opinion, wifi should be a standard, included feature. Just outside the front door to the right you'll find a very small convenient market to by food and supplies, plus a little coffee shop that makes a good cappuccino. If taking cabs, I would strongly suggest getting a small hotel address card to show cabbies. Most didn't know by name where this hotel was, but a quick look at the address card removed the confusion completely. I'd recommend this hotel to anyone going to Rome...we had a great time.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Better than expected”", "Author": "popup420", "ReviewID": "UR104959046", "Content": "We stayed in early April for 5 nights. Loved the location (near attractions and shopping) and the hotel rooms were a good size. Better pillows would be good. The front desk staffs were great and knowledgeable. Breakfast was a great start to the day. The lobby bar was great and drinks came with some lovely nibbles. Would highly recommend this hotel to all and would stay again for sure.", "Date": "April 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Doncaster, United Kingdom", "Title": "“Great location & great hotel”", "Author": "HillroyMush", "ReviewID": "UR104675198", "Content": "We stayed in this hotel for a long weekend and thought it was a very romantic, enjoyable and pleasant stay. It was very clean and the staff were extremely helpful and polite. The hotel was loated less than 5 minute walk from the Trevi Fountain and not much further from the Spanish Steps. Breakfast was good, mainly continental, with bacon and scrambled eggs (not the best) as a hot alternative. All in all a very good hotel in an ideal location. Perfect for a romantic holiday in Rome!", "Date": "April 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location and nice hotel”", "Author": "Chippergirl71", "ReviewID": "UR102402552", "Content": "We stayed at the Dei Borgognoni for a long weekend as a birthday celebration. The location, smack bang between the Trevi Fountain and the Spanish Steps is unbeatable and from there we were able to walk to the Colloseum, Villa Borghese and The Vatican. The hotel itself is lovely and clean, the rooms are small which is the norm in Rome, but perfectly good. The air con wasnt working but I think thats the Italians not putting it on until the height of summer rather than it *not* working. This did mean we have to sleep with the window open, which did get quite noisy at times.. this was the only downside. There is a supermarket just down the road which means that you can buy your own water.. dont use the mini bar as its too expensive. The hotel management were very nice though when they left a bottle of Prosecco on ice in our room for my birthday (we hadnt told them so they must have checked my passport). Highly, highly recommend a resturant called Live which is on the Via Vito, literally around 5 - 10 mins walk from the hotel. We loved it so much we went twice, the second time for my birthday where the lovely staff all sang happy birthday to me.", "Date": "April 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Lovely Hotel in fantastic location”", "Author": "JoJoTourist", "ReviewID": "UR100273474", "Content": "Ideally located between Trevi Fountain (6 mins walk) and Spanish Steps (4 mins walk). Nice Reception area with friendly staff and everywhere appears to have recently had a make-over / upgrade. Smallish but perfectly adequate and clean bedroom with king sized bed (which probably made it appear smaller) and bathroom with shower only. Had room on 2nd floor overlooking the road, some noise from bin collectors early morning but not too noisy. Only downside was central heating/air con unit did not work - not an issue at this time of the year but could be a major issue in the summer. Did not bother with breakfast so cannot comment. A real find - great value for money, very clean and everywhere is within walking distance - we will definitely visit again.", "Date": "March 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cavan, Ireland", "Title": "“Ideal hotel”", "Author": "ruadhan", "ReviewID": "UR92516387", "Content": "Very atmospheric location for wandering the streets Perfect location for seeing Rome on foot Close to bus link to Colosseum and Forum Airy room and spacious bathroom Lovely large windows with shutters Nice decor and high standard of hygiene Very helpful staff in all areas", "Date": "January 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montreal", "Title": "“Great hotel, fantastic location...would go again !”", "Author": "Racha2008", "ReviewID": "UR91771039", "Content": "We've spent 9 nights at this hotel. The location is amazing, the staff and service et very good and the size of the room are great for the historical district. There is no major bad points, and I would choose this hotel again. My only suggestion, for improvement (this is very personal), is that the matress (bed) is a bit hard and the pelows are just ok. But all the rest is so great, location is on a quiet street and it's easy to rest. Breakfast is good, just alwayst the same. We had as well special attentions from the staff.", "Date": "January 4, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Nice Boutique Hotel”", "Author": "ChillieNails", "ReviewID": "UR91309853", "Content": "Great location for first time visitors--walking distance to Spanish steps, Trevi fountain, the forum and coliseum, Pantheon, several piazzas and much, much more. Rooms are small, of course, by American standards, but workable. Bathroom is decent, but towels don't have the freshly-laundered scent. Breakfast buffet from 7 to 11 am is convenient and filling. Loved, loved, the croissants and Italian butter. Scrambled eggs, cereal, cold meats, breads, juices, and cappuccino, tea, all good. Concierge service good as well.", "Date": "January 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Owatonna, Minnesota", "Title": "“I'll be back to the Borgognoni next time I'm in Rome”", "Author": "gthom1", "ReviewID": "UR87793785", "Content": "I Just got back from my first trip to Rome and a stay at the Hotel Dei Borgognoni. Picking a hotel in Rome is a daunting task with an overwhelming amount of choices, and I feel lucky to have picked this one. Upon arrival we were greeted and checked in promptly by friendly desk staff. Check in is at 2p.m., but they let us in right away when we arrived at 11a.m. with no problems. We had a triple room for 3 of us. Two double beds pushed together into a \"queen\" and a pullout. The queen was comfy, and the pullout was...well a pullout. The room was small by my United States perspective, but very acceptable. The bathroom was bigger than expected and the whole room was very clean and well put together. A nice surprise was the small patio with a table and two chairs outside the room. My only complaint was temperature control. If you want heat, it's there, but for cooling the only thing we could get to work was opening the window and door. Worked o.k. for us, being that it was cool out, but could be an issue in the summer. The hotel has a breakfast included in the morning, and I thought it was very good. Coffee, juice, bread, pastry, granola, yogurt, fruit, meat, bacon, and eggs. Much bigger selection than expected. The front desk was very helpful. They helped us arrange a couple of tours and had a car waiting on time as requested when it was time to go back to the airport, and answered/helped with every question we had. As for location...FANTASTIC. The Trevi Fountain is about a 5 minute relaxing walk, Spanish Steps were not that much further. With the exception of the Vatican, we walked pretty much everywhere else too. Food, shopping, drinking, and sights all very conveniently located. I would have no hesitation about staying here again.", "Date": "November 21, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Calgary, Canada", "Title": "“Every other hotel in Rome looked nicer than this one.”", "Author": "Kanzi75", "ReviewID": "UR87709761", "Content": "You should know as soon as you walk past the lobby and the carpets are filthy in the hallway, that things are only going to deteriorate from there. We were showed to our room...where again, quelle surprise, the carpets were filthy. I guess they reckon that giving you slippers makes up for this...IT DOESN'T! Nor does it make up for the 5 inch long curly black hair I found on our bed. Yeeuck! This place made me itch. The staff wasn't terribly helpful either. For 4 days we asked them if they could please the safe in our room. By day 5 of excuses and them telling us \"that a technician was coming tomorrow\" we got sick of asking and just continued to lock our valuables in our suitcases. Out of all the hotels we stayed at in Italy this one had the weakest breakfast. You could find a couple of things that were edible, but you could just tell a lot of effort wasn't put in. Due to the fact that we were in Rome to see Rome, we managed to get through 5 days here, but it certainly isn't a place you want to unwind and relax in. Get in and get out...or actually...just pick somewhere higher end. Our travel agent told us this was 4*...clearly North American 4* hotels are on a different rating system than European hotels, but this one did not compare to anywhere else we staying in Italy. When our travel agent sent them our comments, they came back with some surprised remark like, \"nobody has every commented on our cleanliness before.\" Either I'm uber picky (which is definitely part of it), they're lying or everyone else is blind. They offered us a free stay on them next time we're in Rome, but sorry not going to make that mistake again. The ONLY thing we could see that this hotel had going for it was its location, which was within walking distance to all the attractions we wanted to go to, but we're huge walkers anyway. Honestly, with all the options there are in Rome, you can find somewhere better than this!", "Date": "November 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“Disappointing Hotel”", "Author": "Divaspy", "ReviewID": "UR87471864", "Content": "I will not recommend this hotel at all despite being situated next to the Spanish steps, the Front office staff are very rude they lack tack and I asked to speak to the Manager which I never got to see him during my stay and eventually we decided to check out earlier to check into Regina Baglioni hotel 5* hotel but 7 * service!", "Date": "November 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portsmouth, Rhode Island", "Title": "“Great Hotel, Great Location, Terrific Staff”", "Author": "pmateu", "ReviewID": "UR86770363", "Content": "We just returned from five days in Rome. This is the second time that we have stayed at the Hotel dei Borgognoni, and we were once again delighted with our stay. The location is terrific, close the the Spanish steps, and within walking distance of many of Rome's sights and famous Piazzas. The staff was very helpful, and friendly, and went out of their way to help us practice our Italian. The only recommendation we have for a hotel of this category is to include internet in the price of the room. We look forward to returning again soon!! We", "Date": "November 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Warsaw, Poland", "Title": "“Excellent location”", "Author": "meexxx", "ReviewID": "UR86426360", "Content": "Excellent location - very close to Trevi Fountain and short walk to Spanish Steps. Half block to hop on/off bus tour stop. We had a triple room which was small, but very nice. Very nice bathroom. Excellent breakfast included. We booked a private airport transfer through hotel for 60 Euros - great. The noisy airconditioning did not work and the staff said it would be fixed the next day - nothing happened eventhough we brought this up 3 times. I hear this is very common to this hotel. You could also hear the steps from the upper floors.", "Date": "November 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yonkers, New York", "Title": "“Great Place to Stay !”", "Author": "globetreker36", "ReviewID": "UR84691143", "Content": "We're glad that we did our research on Trip Advisor and decided to stay here. Couldn't ask for a better location, 4 blocks to either the Trevi Fountain or the Spanish Steps. We were in a double superior room which was a decent size, very clean with a bathroom you could actually turn around in. The hotel is not located on a main street so there was not much noise from traffic; however, ask for a room overlooking the garden to ensure absolute peace and quiet. Hotel lobby, including the bar and restaurant were very classy. Breakfast was great and service was excellent. The desk staff and concierges were very friendly and helpful. Only caveat, go elsewhere for nightcaps as the prices were very high there compared to other local options.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“Great Location”", "Author": "BobSanJuan", "ReviewID": "UR84442380", "Content": "This hotel has a great location next to the Spanish Steps and the Treevi Fountain and Metro. The first night they said that the power was out on the 2nd floor so they sent us to thier sister Hotel acroos the river the Hotel dei Mellini which was modern, with large rooms just excellent, but not where we wanted to be! Then, the next day we returned to the Borgognoni, which is a little older, but very nice. We found out that there were 2 concerts going on the night we checked in (1 was U2). We think they overbooked us! be careful of that on weekend bookings.", "Date": "October 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Excellent, of course!”", "Author": "RuxandraB", "ReviewID": "UR83579871", "Content": "Very good location, between Spanish Steps and Fontana di Trevi, quiet hotel, soundproof windows, nice room 106 and not so small, probably recently decorated, clean but not very clean, breakfast ok considering you are in Italy, supermarket in the close neibourhood, souvenirs boutique just across. Small and intimate breakfast area, probably it’s very crowded before 10 am, fortunately for us breakfast is served until 11 am! If you enjoy the night life, you must be prepared to enjoy as well waiting for the bellman to open the door when returning to the hotel!!! We stayed 3 nights and every night, not very late, we had to wait 5-10 mins to get in! Happily, the last evening we met a couple of very funny almost drunk Americans tired of waiting who knocked the glass door until the bellman finally woke up and let us all in! I advise you not to order taxi through hotel concierge, it comes with few euros (4 - 7,5 eur) already charged and the driver’s explenation is „this is the procedure”!!! You can walk 50 m to via del Tritone and get a taxi, there are enough for all tourists visiting Rome. Please be carefull when crossing streets! Traffic is a total chaos.", "Date": "October 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Halifax, Nova Scotia", "Title": "“Fab hotel close to it all-stay here!”", "Author": "stellahannah", "ReviewID": "UR80608504", "Content": "A gem! Friendly staff, continental breakfast, largish room-only need to sleep and shower as you want to be out enjoying beautiful Roma. On a relatively quiet street with a gift shop, market, and bar right outside your doorstep. And all the sights and sounds of Roma are well within walking distance-Trevi Fountain, Spanish steps, Piazza Navarone, Pantheon...", "Date": "September 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wyckoff, New Jersey", "Title": "“Wonderful Experience”", "Author": "carlafp", "ReviewID": "UR74896914", "Content": "Stayed for two nights and enjoyed the amenities and the service. A special thank you to Vincent and the bellman who came out in the pouring rain to bring us to our restaurant...silly Americans couldn't find our way...they raised care for guests to a whole new level.", "Date": "August 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cumbria", "Title": "“Great Location, Great Staff”", "Author": "PeteB107", "ReviewID": "UR74799113", "Content": "We picked this hotel based on Tripadvisor reviews. We weren't let down. It is 40 mins away from Ciampino Airport. The location is ideally situated if you wish to visit the renowned sites in Rome, basically 3 mins away from the Trevi Fountain and 3 mins away from one of the main shopping areas. The Queen bedded suite was a little smaller than we had expected, but considering we were only using it to put our head down this wasn't a problem. We only used the restaurant for breakfast, which was good and plentiful and therefore cannot comment on other meals. The staff were excellent, always pleasant, smiling and welcoming. Everyone spoke very good English and were always helpful. There was a problem with the air conditioning one night, but this was soon corrected. This is a 4 storey city centre hotel situated amongst narrow streets so don't expect balcony's over looking the city it wasn't a problem for us. It is far enough away from the tourist routes so the surrounding streets are generally free from the hordes of tour groups exploring the ancient city.", "Date": "August 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bristol", "Title": "“Lovely Hotel, perfect Location”", "Author": "Andy C", "ReviewID": "UR72126747", "Content": "Stayed here in February. The location is perfect beinga 2 minute walk from the Trevi Fountain but being in a small quiet back street. It was a 5 minute walk from the Spanish steps. We did not eat here so cannot comment about the food but the room was very comfortable with a nice powerful shower. It had a TV which had English and American news channels for those who don't speak Italian. It did not have tea making facilities, a shock for the English!!! WiFi was available at an extra charge. The staff were polite and friendly and switched between several languages effortlessley. Well all except one guy who grunted at us but perhaps he was having a bad day! Handed over our passports at check in, as the staff have to register you with the local police, not copy it to use in crime. Definately recomend this hotel very highly", "Date": "July 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Location makes this a top choice in Rome”", "Author": "dgryan1", "ReviewID": "UR71063041", "Content": "We chose this hotel for it's great location - Spanish Steps, Trevi Fountain, Piazza Spagna, shopping are within a 5 minute walk. A little further is the Pantheon and Piazza Navona. We stayed the first 2 nights in Rome at the St. Regis and moved to the Hotel Borgognoni after our tour ended. The hotel is hard to find as it is located on a side street. We even asked a policeman and he pointed us in the wrong direction. The room was a decent size with a king bed and nice furniture. There was a small entry with the closet and entry to the bath and then the room itself. The decor is contemporary in red and grey but it works well. Breakfast was included and was very good. We had upgraded to a double superior and I'm not sure that's what we got. The room overlooked the courtyard and was very quiet. Not all the staff at the front desk was that friendly or helpful but some were. This is a small, chic hotel with a great location, once you find it! We'd stay here again as the rooms are clean, not too small and have all the conveniences you need.", "Date": "July 15, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Houston, Texas", "Title": "“Way overrated and expensive!”", "Author": "BAF68", "ReviewID": "UR68955264", "Content": "Old, unfriendly, unhelpful staff, small, dark rooms, very old and dirty carpet. Not worth the $314 dollars per night rate and absolutely NOT a 4 star hotel! I moved out to another hotel. Only good thing is the location.", "Date": "June 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“This hotel was modern and in a great location”", "Author": "Dassi32", "ReviewID": "UR67601880", "Content": "My spouse and I stayed in this hotel while our stay in Rome during our honeymoon. The hotel is clean and modern with a standard continental breakfast every morning. The location was great because it easy to get near all the attractions in Rome by walking. It is also a few doors down from a supermarket if you needed anything. We had two small terraces that were enclosed so we could only see the sky. I did like that the TV had channels in almost every European language and wireless internet for a small fee per day. Overall it was a good experience.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Canary Wharf, London", "Title": "“Great potential - & location”", "Author": "Greenish", "ReviewID": "UR59729966", "Content": "Spotless; nice touches (Valentine's gift for example); huge lobby & bar area that are under-utilised - especially bar - ie closed. Would have been a good place to have pre-/post-dinner drinks, but closes too early. Very small breakfast area for seemingly large hotel. Good location. Varying rooms - friends had a HUGE room with terrace and had i stayed there i think i would have upped the ratings Probably a little on expensive side for what it is. Recommendation given below is if you want a central place to lay your head - but do a bit more research and you may be happier.", "Date": "March 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Massachusetts", "Title": "“As a world traveller, one of best hotels ever”", "Author": "patted", "ReviewID": "UR59018467", "Content": "Dei Borgognoni Hotel in Rome was the perfect place to be for a seven day stay in Rome. Got good off-season rates through Expedia and chose this hotel because of its wonderful location near the Trevi Fountain and Spanish Steps, on a quiet side street. The hotel is understated luxurious, cozy with good heating in the cool season (has air conditioning in summer), and with new, tight-fitting windows and doors which screen out noise for very quiet rooms even on the street side. Bathrooms with bidets and lots of hot water, rooms very clean and well appointed, beds comfortable. Staff is extremely friendly, knowledgeable and helpful in every way. We are experienced travellers and know some language but needed help with museum and show reservations and with routes, busses, etc. They provided all that and more, making calls for us and recommending tours (which we did not use but which looked good.) The breakfasts at this hotel are great -- a buffet with local yogurt, cereal, fresh fruit and juices, cakes, eggs, meats, cheeses, When you come down to the attractive dining room, the server brings you a large pot of coffee or the beverage of your choice (excellent cappuchino or hot chocolate available) and a large basket of freshly made rolls and croissants, also there are yummy Hero jams in little jars on your table. We did not try out the bar or restaurant service at night, preferring to go to local trattoria, but they looked nice, if expensive. Hotel is a few steps from the Quirinale, the Trevi Foutain, the Spanish Steps, and within easy walking distace from the Forum and Colloseum, and many museums. Also one block from Silvestro Square where many busses terminate, making getting around (to the Vatican, the Termini etc.) extremely easy. There is a grocery store next door selling everything including good local (cheap) wine and deli items for picnics. Also a cafe across the street for late day coffee, and several less expensive tourist gift shops. Just another block away on Via Trittone, many good shops and boutiques. On the way to that street, just a few steps from the hotel, a delightful small local restaurant with reasonable prices and excellent simple fresh local food at reasonable prices and friendly service, (with signs saying Pizza.) My husband and I had our birthdays while we were there (we were born on the same day), and apparently the staff had discovered this from our passports. When we returned in the late afternoon on that day, we found a bottle of iced Proseca wine (the local \"champagne\") and glasses in our room, compliments of the hotel staff!! Altogether I would recommend this hotel extremely highly -- one of the best we have ever stayed at.", "Date": "March 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wales", "Title": "“Great find”", "Author": "FussyWales", "ReviewID": "UR58727583", "Content": "Hotel in a very narrow quiet street very close to Trevi Fountain and Spanish Steps.We had an inner court yard view which can be used in the summer months. Our room was on the 4th floor, it was spotless with a queen sized bed ( a bit on the hard side, but I am fussy about beds). The room wasn't huge, but didn't actually spend much time in it so that wasn't a problem, it had everything that you wanted. The bathroom was a good size with just a shower in it and nice fluffy towels. Breakfast was included and it was fresh and nicely laid out. Next door to the hotel is a Spar supermarket if you need any nibbles or drinks. The hotel also had a nice bar area where we had a lovely cup of coffee and a drink every night. All staff were very poite and helpful - Thank You hotel staff for a lovely experience. The hotel is very close to Spagna Metro stop if you arrive by train so no need for taxis.", "Date": "March 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "brasil", "Title": "“Unbeatable location”", "Author": "fabRJ", "ReviewID": "UR56763381", "Content": "This hotel is just about 3 min walk from both fontana de trevi and piazza de spagna. The rooms are small, especially if you're not used to european standards, but have all sort of amenities one might need. Our room was very quiet, with a comfortable bed and clean marble bathroom. Staff was polite and the breakfast is honest. Great place to stay in this esplendorous city.", "Date": "February 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wokingham, England", "Title": "“Great Location, Great Room but most of all Fantastic Service & Staff”", "Author": "IggyP11", "ReviewID": "UR56370926", "Content": "All the reviews state how good the location is and I would agree. I have stayed in many places across Rome and this is one of the best. There are a huge range of hotels across the historic centre of Rome and this one certainly adds that little extra with some of the most attentive staff I have ever experienced in the Italian Capital. Our trip was over Valentines Day weekend (not the reason for the trip) and on the 14th itself we returned to our rooms to find two lovely heart shaped cakes (along with chocolates) and a lovely message from the hotel. All in all the Reception / Concierge / The two Bartenders and the staff at breakfast could not have been more friendly / chatty and helpful. We will be returning to this hotel on our next trip.", "Date": "February 18, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Nice clean rooms, stellar location, service left something to be desired”", "Author": "jpark10", "ReviewID": "UR56316281", "Content": "So let me start with the pros - location is outstanding. It is literally a 2 minute walk from the trevi fountain and a short 5-7 minute walk to spanish steps. We had pretty easy access to the train and took this to both termini station and vatican city. The hotel itself is modern looking and pretty clean. The halls looked slightly older but the room itself was in good shape and pretty new appearing. Bed was nice, and there was a decent sofa bed. If convenient location and newish clean rooms are important for you (they were for us, as after 2 wks of travel and various shoddy hotels I was desperate for a clean place), this is not a bad choice. Cons - when we got there, we were under the impression 3 people could stay in a 2 person room. They said this was not possible, and wanted us to pay 50 euros, but eventually gave us a 3 person room. It was a smoker room, but they said they had nothing else available. From this point on I felt a reluctance in their service towards us, and an awkward tension, which I would not expect from a 4-star hotel. Our bags took 2 hours to get to our room, and only after calling did they come up. They initially didn't turn on the heat, and we had to ask. The bathroom ceiling was initially dripping, but they took care of it the next day without any issues. Overall I thought the desk people working in the daytime were not very accomodating or friendly. Also, they charged us 18 EUROS for a subpar breakfast, as we did not initally know this was included. Finally, internet is VERY expensive - 12 euros for 24 hours or so. Overall thoughts: Service was not up to par with a 4-star place. However, I picked up on a general lower standard of service in Italy on the whole, so this was consistent with that. After staying in very shoddy places in Barcelona and Florence though, the clean rooms and fabulous location here were pleasant surprises. This place is not that cheap, but outside of the service, I would recommend it based on the perks of the place.", "Date": "February 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Chico, CA", "Title": "“Perfect Location!”", "Author": "khurley", "ReviewID": "UR48141117", "Content": "I loved this hotel! It was very well maintained. I loved the set up of the rooms. We had shutters on our window which we loved to have open to experience the sounds and smells (nearby restaurant) of Rome. It was in a perfect area for us since we were only in Rome 1 day. There is lots of shopping and eateries nearby. The Trevi Fountain, Spanish Steps, and Coloseum were all within a very easy walk. I recommend this hotel!", "Date": "October 30, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Cincinnati", "Title": "“Cozy hotel in quiet location”", "Author": "mroadster", "ReviewID": "UR47421417", "Content": "We stayed here our first two nights on a three week trip to Italy. The hotel staff was very friendly and helpful, the breakfast very good and the service excellent. The hotel is on a little side street and very quiet. Really enjoyed ourselves. Little trouble getting cab to hotel, we had to walk up to the main street, so don't pack too much!", "Date": "October 21, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Calgary", "Title": "“Quaint but small”", "Author": "wlmcdonald", "ReviewID": "UR46705624", "Content": "The Hotel dei Borgognoni is close to spanish Steps, 30 min walk from Coliseum and close to designer shopping. The hotel itself has a beautiful lounge, breakfast area and front office but their rooms are small and dark. Their lighting quality isn't that of North America so the room takes away from ambience. Breakfast is typical Italian breakfast, not too impressive for North americans but it's something to eat. Office staff isn't particularly friendly. there is a Mercato (grocery store) next door that you can buy bottled water and some snacks for the fraction of cost in many other places. Mattresses are made from memory foam. A little hard to get used to. Bidets in bathroom", "Date": "October 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "manchester, uk", "Title": "“Great position, surprisingly big rooms”", "Author": "adelenicola", "ReviewID": "UR46275232", "Content": "Great position close to trevi fontains and seven steps, great breakfast love the homemade cakes!! Big modern comfortable rooms, lovely terrace on the roof overlooking the city where you can enjoy a drink. I would recommend this hotel if you want a bit more space than the average room in room and prefer modern rooms to something traditional. I would stay again for business and leisure. reasonable price too", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Tennessee", "Title": "“A great hotel!”", "Author": "TeacherTn", "ReviewID": "UR42171332", "Content": "We loved staying at this hotel for our three days in central Rome. It has an excellent location: two blocks from either the Trevi Fountain or the Spanish Steps. We walked to nearly every historic site we visited. It is extremely quiet, friendly staff, very clean, marble lobby and bathrooms, large rooms for a European hotel (no suitcases in OUR bathroom), and located next door to a full service grocery that sells wine and water at a reasonable price. No question, we will stay there again when we return to Rome!", "Date": "September 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Peterborough, United Kingdom", "Title": "“Great location within walking distance of 2 main attractions.”", "Author": "Lauren8590", "ReviewID": "UR39050848", "Content": "Hotel offers a great location for tourists, walking distance from Trevi fountain and Spanish Steps. The tourist buses also stop nearby. The staff are very helpful and friendly the rooms are comfortable and clean - just what you need after a hard day sight seeing.", "Date": "August 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Cambridge, MA", "Title": "“Mediocre hotel with a good location for tourists.”", "Author": "just_the_food_please", "ReviewID": "UR38885060", "Content": "This is a decent hotel, next to the Spanish steps, kind of tucked away in an alley. + Clean, good service + Great basket of breads at breakfast - Weak A/C - Internet costs 13 euros per 24 hrs - Hard, ultra-firm bed (I guess if that's your thing -- and the king was 2 twins pushed together) - Small room with not a lot to see - Atrocious orange juice and inedible eggs/sausage (this seems to be an Italian standard, though)", "Date": "August 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“great location-great price”", "Author": "loto23", "ReviewID": "UR38076822", "Content": "I would recommend this hotel to anyone. Great location on a quiet street close to most everything. Great supermarket next door that you can buy snacks and bottled water before heading out for the day. Two complaints- internet is really expensive 6 euros for 45 minutes and the lobby smells of smoke when you walk in. i was worried our room would smell this way too, but thankfully it did not. I think it smells from the staff smoking in the lobby. Hotel is clean, rooms are good sizes, breakfast is good and staff very friendly and helpful. Definitely a good place for anyone that wants to be in a good location and stay in a nice hotel, but without spending too much money.", "Date": "August 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Berlin", "Title": "“Very nice hotel. Super location!”", "Author": "luvbey", "ReviewID": "UR34661149", "Content": "I met up with my son in Rome on the 6th of July. It was going to be a mother/son holiday. He came in from Milan and I flew in from Berlin. I have to say I was somewhat nervous about the trip. I wanted to be sure that I made the right choice when it came to accommodations. I did a lot of research and read a lot of reviews. I I thought surely location is a primary decisive factor for us. However I had to be careful because I read a lot of reviews about different hotels and basically complaints ranged from too much noise ( street noise and inside hotel ) to bad smells to bad food to bad service etc... We were so happy when we arrived at the hotel. A 30 minute ride from the airport ( 60 Euro! ) It's a small hotel in a small street ( all streets are small and winding. One has to admire drivers ). It was worth to arrive by taxi since the hotel is somewhat difficult to find. Most are in that area. Very centrally located we walked to all sightseeing attractions. The Spanish Steps, Fontana Di Trevi, The Colosseum, The Vatican, and all kinds of cafes, restaurants, and shopping. Make sure to eat at Angolinni at Piazza Rondanini, Our room was small ( as expected in Europe ) but very nice and clean. 24 hr Pay per view and internet package for 19 Euros. Although internet only LAN. Bathroom spacious and nice. The only complaint I have is that the mattresses were too hard! But I guess one gets used to that. We slept very well and I'm a light sleeper. AC worked fine and overall like I said a nice room. The breakfast was ok... eggs, bacon, cold cuts, fruits, yogurt, etc... Price to quality ratio is excellent. We paid 182 per night including breakfast and taxes. So, I definitly recommend Hotel Dei Borgognoni. Ciao ciao!", "Date": "July 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "San Antonio, TX", "Title": "“You don't see customer service like this anymore.”", "Author": "LoriG319", "ReviewID": "UR33202763", "Content": "As a traveler in a foreign country, the staff at this hotel made me feel so at ease. I can't describe to you how many times they bent over backwards to make our trip better. They made bar reservations, cab negotiations, helped us find lost train bags. It was so above and beyond and they did it all with a smile. It is in perfect walking distance of the Trevi Fountain, Spanish Steps, Villa Borghese. The continental breakfast was also very impressive.", "Date": "June 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Minnesota", "Title": "“Wonderful location, staff, rooms”", "Author": "Roman_newyears", "ReviewID": "UR25089405", "Content": "Wife & I with our daughters and their spouses spent a week over New Years. We had three very nice quiet rooms with comfortable queen beds, large tiled bathrooms. Ours had a tub with shower while the others had small showers. Very clean. Front desk staff all very friendly and very helpful regardless the time of day. English well spoken. Breakfast buffet was very good and the capachino served was the best we experineced. One morning the staff put together a nice bag \"breakfast\" for eacy of us for we had to catch a tour prior to the breakfast buffet opening at 0700 hr. Very nice. This hotel is very central for exploring and shopping.", "Date": "February 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ireland", "Title": "“Excellent hotel.”", "Author": "JCP1976", "ReviewID": "UR24944132", "Content": "Excellent hotel in super location. We, too, were booked in here by the Relais Pierret and could not have been more pleased. This hotel would be hard to beat on all ratings. A previous reviewer found fault with the breakfast. We on the other hand found the breakfast to be excellent, and it included delicious eggs and bacon which we had not expected. Our room was, we think, one of the smaller ones but we certainly weren't short of space and as we were only there to sleep (and the price was right) that didn't matter at all. All staff were unfailingly pleasant and helpful. The area abounds with excellent restaurants, cafes and bars. We highly recommend the Hotel dei Borgognoni and would certainly stay here again.", "Date": "February 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sault Sainte Marie, Ontario, Canada", "Title": "“Wonderful location, service and rooms!”", "Author": "heajayjr", "ReviewID": "UR24017504", "Content": "Absolutely loved our stay at this hotel! The staff was friendly and accommodating; the rooms were beautiful...spacious, well-appointed, classy and comfortable; and the breakfast was a great start to the day. We couldn't beat the location with Trevi a 3-minute walk, and the Spanish Steps/Condotti a 7-minute walk. We had a garden-view room, and my sister had a street view room. Both were quiet. The beds were king/queen size...nothing tiny about these rooms. My parents' room was a little too warm for them, but otherwise we had absolutely no problems with this hotel. We would highly recommend it!!!", "Date": "January 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Great location, but a little overpriced”", "Author": "handyspanner", "ReviewID": "UR21774775", "Content": "Stayed at the hotel during the end of October, for a city break from the Saturday to the Tuesday. The hotel was suggested by colleagues and we went for the superior room. The room was very well appointed and clean, as was the bathroom, with a terrace outside. However, the room was small and just fitted in a double bed. The staff were very helpful and recommended some great places to eat in the evening. The breakfast could be improved, accounting fro the price, £279/night, to include fresh \"fresh fruit\" and juice rather that concentrate. The breakfast generally was a little basic. The best thing about the hotel was its location, it is central for every thing; we even walked to the Vatican City and the Coliseum. The steps and fountain were only 5 minutes walk from the hotel. We had a great few days in Rome and covered most of the main sites, the Coliseum area is just like a film set and the area and buildings are really impressive. The people in Rome were excellent and really helpful, but be careful for the \"rip off\" as some will try it on! The taxi from the airport to the centre of town was 60 Euro, and the same for the return. Over all, we had a great break, the hotel was comfortable and really well located, but if we go again I think I would look for something else. This is solely down to the price and I feel you could get better value if you look, and still have the location. Enjoy Rome it was a great place for a City break and the weather was warm enough to be in shorts and “T” shirt. The wife also enjoyed all the designer shops that are around the steps and the hotel!!!", "Date": "November 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "miami, fl", "Title": "“excellent”", "Author": "lesfrenchies", "ReviewID": "UR20038837", "Content": "The location is perfect, you walk everywhere except for the vativan but the metro is 5 minutes away. From the airport you take a bus then the metro and you're there. Service is great, the staff is exceptional and they speak english and french (which was good for us as we speak those two and no italian). We wanted a room with the terrace (you have to reserve it in advance) and it is great for a morning breakfast outside but still private! We will stay there again if we go back!", "Date": "September 13, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Milwaukee, WI", "Title": "“Very good hotel”", "Author": "PatriciaMilwaukee_WI", "ReviewID": "UR15100584", "Content": "Great hotel for my purposes: good price; excellent location; friendly staff; clean room. I travel frequently and don't expect a medium-priced European hotel to meet American expectations. Cleanliness is #1 with me, along with location. Several blocks from the busier streets so it is quiet at night. The breakfast being included in the price was a plus. There is a small grocery store nearby for snacks, etc. The Trevi Fountain and Spanish Steps are both within a 5-10 minute walk and the Post Office is 2 blocks away. Several very good restaurants nearby. This is an above-average hotel for the price. I would highly recommend this hotel.", "Date": "April 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Crewe", "Title": "“Lovely little hotel in perfect location”", "Author": "Jimothy", "ReviewID": "UR12297369", "Content": "This is a fantastic little hotel located in exactly the right place for all the tourist destinations in Rome. We walked absolutely everywhere from here without any need for taxis or public transport. The staff were excellent and the duty manager went well beyond the call of duty. I cannot rate this place highly enough. The only downer is that the bar was a bit expensive, but we found a nice Irish Pub not too far away. It was an American take on what an Irish Pub should be, but the Guinness was authentic enough.", "Date": "January 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Decent hotel close to Trevi Fountain”", "Author": "Waterbabie", "ReviewID": "UR11103977", "Content": "A decent hotel, very well kept, friendly front desk and breakfast staff (especially the guy who asks everyone if they want a cappucino and looks completely gutted when you politely say no)! I enjoyed the location, a 2 minute walk to the Trevi fountain and about 5-7 minutes to the Spanish Steps. The room was comfy and clean - the bathroom was especially tidy which is always nice!! Overall a good hotel.", "Date": "November 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Great hotel for family of three”", "Author": "mcrow805", "ReviewID": "UR8699566", "Content": "Just returned from our first trip to Rome. The Hotel Dei Borgogni was a great pick. The location was extremely convenient for walking to all of the sights and the staff was excellent. The hotel is a bit dated from a decor standpoint but the bathrooms were completely updated and well appointed. We traveled with our teenage son and this is one of the few hotels with a 'triple room' option. A very nice continental breakfast was included. We would stay there again.", "Date": "September 12, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "new york city", "Title": "“what a disappointment”", "Author": "bedfordmclain", "ReviewID": "UR8601596", "Content": "We tried to find a centrally-located, well-priced smaller hotel, for sightseeing in Rome with our two kids (13 & 10). Location was terrific, but that was about it. Rooms were shabby and worn, mattresses and tiny beds uncomfortable, Looked like the place needed a serious makeover. Air conditioning was available, but minimal. Some investment, care and style could make this great, but there just wasn't anything I could like about it.", "Date": "September 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edinburgh", "Title": "“Absolutely lovely staff!”", "Author": "kph15", "ReviewID": "UR8492803", "Content": "We stayed here for 6 nights and it was lovely! The staff at this hotel are some of the sweetest and most polite i have ever encountered, they were only too happy to organise us taxi's and reservations and even walked us to some of the trickier to locate restaurants they recommended (which were also lovely!) they also get to know their residents very well and you feel sad leaving them when you have to go! Our two rooms were at different ends of the corridor but were very cosy and clean. The hotel is also a very short distance from the Spanish Steps, Trevi Fountain, Via De Condotti, Pantheon and many of the beautiful Piazzas. I would definently reccomend this hotel to anyone going to Rome.", "Date": "August 24, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Barnsley, United Kingdom", "Title": "“Great Base For Exploring”", "Author": "Love2Travel_30", "ReviewID": "UR8447559", "Content": "We had a fantastic stay at this hotel. Staff were really friendly and always happy to help. The hotel is centrally located and within walking distance to the majority of attractions. It is nicely tucked away down a small side street so you are away from the busy tourist filled streets. We found it to be a great base for exploring. The Spanish Steps are a few minutes walk away. The Trevi Fountain is also fairly close by. We walked to the majority of places, however for the ones a little further away, ie) Colosseum we hopped on the Metro. It only costs 4 euros for a full-day pass so you can just hop on and off at all the different sites. If planning on going to the Vatican, check if it is open. We went on Sunday whilst the service was taking place and the museum and gardens were closed, so we missed out on the Sistine Chapel, which we really wanted to see!", "Date": "August 18, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Baltimore, MD", "Title": "“Perfect location”", "Author": "theatremom", "ReviewID": "UR8444187", "Content": "We spent three nights at the Hotel Dei Borgognoni, and the best feature of the hotel is its central and convenient location. We were in easy walking distance to the Spanish Steps, Trevi Fountain, and plenty of shopping. Since it is right in the Historic Center you can walk everywhere within 10-20 minutes-the Pantheon, Piazza Navona, ancient sites. There is a stop for the Hop On Hop Off Double Deck tour bus within easy walking distance too. We had two rooms. One had 2 twin beds and was somewhat small. The other room was larger and the beds were pushed together to create a queen size. Both rooms were exceptionally clean and had excellent bathroom facilities. There were plenty of clean towels, and the daily maid service was very good too. Each morning the breakfast was delicious--juices, wonderful coffee, cereals, fruits, pastries, breads, eggs, yogurt, ham, and cheese. The hotel staff was friendly and gracious. They helped us with maps, directions, laundry service, and restaurant suggestions. The only time we used a taxi was to get to the Vatican.", "Date": "August 17, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "California", "Title": "“good location, friendly service”", "Author": "JNS_CALI", "ReviewID": "UR8227954", "Content": "We had a nice stay at this hotel for 3 nights in April. A friend in Cali recommended the hotel - and it fit our expectations. For the price- it was great although if you are expecting US standards, you would be disappointed. But it was clean, room was spacious, bathroom was clean and stocked with necessities you would expect. Front desk was friendly and accomodating - made one great restaurant recommendation. Location is perfect - easy to get around and see the sights. Travelled with a one year old so the little shop next to hotel made it easy to find some food to take on the go for him. Would recommend this property for someone looking for decent price, central location, and a good breakfast.", "Date": "July 24, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Worthing, England", "Title": "“Great location, good hotel”", "Author": "HonestJon", "ReviewID": "UR5982380", "Content": "My wife and I stayed here, for four nights, early September 2006. We had read some bad reviews about the staff. They were Ok with us. The hotel was just what I would expect from a 3 star city hotel with the exception of the decor in the room which I thought above average. It is two minutes from the Trevi fountain and every where we wanted to visit was within walking distance. Make sure you locate Via Del Bufalo 126 on a map bafore you leave home. It is a small street and even the cop 20 yards away did not know where it was. A tip. The ATAC website is in Italian but very useful. I would stay there again.", "Date": "October 22, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Macerata, Italy", "Title": "“A perfect wedding hotel”", "Author": "Cath A", "ReviewID": "UR5822159", "Content": "We stayed at the dei Borgognoni for the week before we married in Rome and the night of our wedding. We have stayed here once before and decided to go back because of our experience then - and we were glad we did. The staff were lovely, very friendly (and for those who found them not so you need to remember that Italian people in a good quality hotel like this tend to be deferential which can be taken as 'stuffy') and did everything to make our stay wonderful. They had all been told of our wedding and all the staff - room staff, catering staff, receptionists - were almost as excited as we were. They took care of my wedding dress, kept it safe, pressed it and had it ready for me exactly when I needed it. They made such a fuss of me when I appeared in the lobby, and when we returned to the hotel on our wedding night we found a complimentary bottle of champagne with a lovely note from all the hotel staff waiting. I am so glad we went there, and I wouldn't go anywhere else when we return to Rome. Thank you to all those members of the staff who made this stay so special.", "Date": "September 22, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Ontario, Canada", "Title": "“Just OK”", "Author": "Melibi", "ReviewID": "UR5589687", "Content": "The main lobby is nice but the front desk staff are stuffy and snobbish. The rooms are small and clean and towels were replaced daily. The airconditioning barely works, so be careful if you are staying here in the summer-- it gets quite hot in the room. The breakfasts were average and the location was the best feature-- close to the Spanish Steps and the Trevi fountain. For the price and the location, I may stay here again. You just have to realize that a four star hotel in Rome is NOT a four star hotel in North America.", "Date": "August 9, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "2"}, "AuthorLocation": "San Diego", "Title": "“Location...Location”", "Author": "Powell55", "ReviewID": "UR5435755", "Content": "First the primer. If anyone expects a 3 star Italian Hotel to be anything like a 3 star Marriott in the States, you are in for a huge disappointment. This Hotel was $281.00 per night plus taxes on Expedia, and take my word for it, you will NOT find a better deal during peak season in Central Rome. That being said, \"Blessed are those who expect nothing in Italy, for they will not be disappointed\". This is a Red Roof Inn with a nice lobby. No in room internet, barely serviceable A/C. However, the Continental breakfast was included and was superb. But..don't use room service for anything else other than Breakfast. The Dinner was terrible and made us sick. The best thing going was the location, which is a two minute walk to Trevi Fountain, and right by the Spanish Steps. This made the experience servicable. Look around and you will see what I mean. (Westin- 800 Euro, Intercontinental-400 Euro, etc...). Sure you can get a better experience, but are you willing to shell out $700-$1000 per night? For all the shortcomings of this Hotel, I would still stay there again, and spend the cost savings on a great Tour Guide. After all, how much time do we actually spend in the Hotel when all of Rome is waiting to be explored?", "Date": "July 7, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Portland,Oregon", "Title": "“We had a wonderful time.”", "Author": "A TripAdvisor Member", "ReviewID": "UR5366453", "Content": "Our experience was very good. Located off the busy street, the entrance is unassuming but attractive. We were warmly welcomed by Vincent with all of our paperwork in perfect order. We had been given inside rooms due to minor construction noise but we prefered the openess of outside rooms and were graciously moved. It was a good choice as the noise wasn't much, starting at 7:00 and it was quiet at night even with opened windows. Two twins together made a pretty decent king sized bed and it was comfortable. Small rooms and closets but with a good sized bathroom and kept clean and we spent little day time in the room. In the morning the breakfast and coffee were a terrific start and with full dining staff our needs were well taken care of. It got crowded after 8:30 so plan to eat early. Aldo was a bit more brusque but Luca and Vincent gave us excellent service and very thoughtful recommendations for meals and attractions, and it wasn't a tip driven kind of service. The location is ideal. We walked everywhere and the hotel got closer and closer as we explored the network of wonderful small streets. We were with another couple and we all felt that the hotel had been an excellent choice and worth the price as everything in Rome is expensive but we enjoyed coming back to our neat little hotel at the end of our incredible days, sitting in a nicely appointed lobby and bar, and enjoying a quiet drink before bed. I would describe the room as small, clean, quiet and tastefully decorated but needing refurbishing, lacking in storage space, but with pretty nice bathrooms. We would definitely stay there again.", "Date": "June 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Philadelphia", "Title": "“Hotel Borgognoni - Rome”", "Author": "Catzz", "ReviewID": "UR5354762", "Content": "We stayed at the Borgognoni last week for 5 nights, and were generally very pleased. The staff was extremely helpful and pleasant, and the location was prime. The hotel was clean, and the breakfast was basic but nice (try the cappuchino!) The rooms were very quiet, although small. The beds were very hard though. Bathrooms were modern with a good, hot shower,. We would recommend this hotel, and thoroughly enjoyed our time in Rome.", "Date": "June 16, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Los Gatos CA", "Title": "“Great location, location, location, quiet and very clean”", "Author": "LGTripper", "ReviewID": "UR5339500", "Content": "A family of three we stayed five nights at the Borgognoni and overall were very pleased with our choice. The location is outstanding: five minute walk to Steps and Trevi Fountain, 10 minues to the Pantheon, about 15 to the Colosseo and an estimated 30 mintues to the Vatican should you choose to walk there. Our room, 311, was VERY quiet and comfortable and cleaned twice a day. The staff was helpful but you do need to get over what I'll call a little Italian \"attitude.\" The rooms are small and hotel servies other than breakfast limited....with so many many restaurants close by it didn't matter that Borgognoni lunch terrace wasn't open often. Cable internet is 10 euro for 6 hours which must be used continuously. Wireless, 5 Euro I think for 1/2 hour only works on the first level. We recommend Al Moro especially (near Trevi-try a bottle of the Cordero Montezemolo Barbera D'Alba) and Restorante Alla Rampa (near Piazza di Spagna). If you want a fair value with an excellent location and a touch of class, we recommend the Borgognoni", "Date": "June 13, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "1", "Service": "2", "Rooms": "2"}, "AuthorLocation": "San Diego CA", "Title": "“Expensive for no good reason...uneven”", "Author": "HarryWang", "ReviewID": "UR5183768", "Content": "Arrived at 8:30 AM after flying all night from NYC. Front desk clerk...Vincent...surly initially and every day after that (4 days). Asked for room...said no rooms ready til noon...have to wait. Went for walk...after an hour there was a heavy rain, went back to hotel. Still no room til noon...because of downpour had to sit in lobby and kill time. Finally at 11:45 Vincent relented and let us have our 10X10 room, which was right on the main street, very busy and noisey. We shut the window and tried to put on the airconditioning to drown out the street noise, especially since we wanted to sleep after being up all night on our flight. I couldn't turn on the air...I called Vincent at the front desk and asked how to turn it on...\"Oh maybe next week it will go on.\" I replied it was indeed noisey and we wanted to sleep but couldn't with the street noise...how about moving us to a more quiet room. \"NO! The hotel was full.\" And so it went...no one could rate this hotel a 4 or 5 star. But its location was excellent...close to Trevi Fountain and Spagna (Spanish steps). We would not stay there again because of surly service and miniscule albeit expensive rooms.", "Date": "May 20, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Mixed to be honest”", "Author": "bax52", "ReviewID": "UR5057251", "Content": "We had really high hopes for our three night stay in this hotel, after booking it on the strength of reviews on this website and the pics on the hotels own website. Initial thoughts on arrival where of disappointment to be honest. The pics on the hotels website have been very well taken, and we thought the hotel could do with refurbishment as it just doesnt look as nice in reality. As everyone posting reviews here has pointed out, the location really is first class. Just two minutes from Trevi fountain and the Spanish Steps. However we found the service by the staff on the front desk to be very mixed. Some of the concierge's where excellent and some where truely appaling. The bad ones, Aldo in particular where extremely surly and unpleasant. Aldo just shouldnt have been in that job, as he was the rudest conceirge I have ever come across. We had to change room one night when the bath flooded due to a blocked drain (not our fault), and he was so rude. Saying it was our fault and we would have to manage with a flooded bathroom for 24 hours and what did we expect him to do about it as it wasnt his job !!! Eduardo the spanish speaking porter was so embarresed and even apologised for him. One other also didnt look happy in his work and a request to book a restaurant for us was met with much huffing and puffing, and big sighs ! The other two we experienced where first class though, and couldnt do enough for us. The often praised breakfast was ok nothing more. Good fruit selection but only one type of ham and no freshly sliced cheese, just pre-packed stuff. The hot offering didnt look very appealing to be honest. Excellent coffee though ! The good points are the location, the quality bathrooms and the room sizes which I thought were good for Rome. Also the beds are huge and very comfortable. Quite firm but wonderful if you like a firm mattress. Bad points included some rude staff, intermittent aircon, ill fitting bath plugs, a redecoration needed and building work (see pic) right outside the room on the apartment opposite. Dont expect to sleep after 7am on a weekday morning ! This should have been mentioned by the Hotel when booking I feel. To sum up it was ok. Not great, and probably wouldnt stay here again in Rome. It has prices and ideas above what it actually delivers and I would think there are better options in Rome than the Borgognoni. I guess we expected more from the reviews on this site.", "Date": "May 12, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "2", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Cork, Ireland", "Title": "“Good but pricey”", "Author": "Ronan_7", "ReviewID": "UR4726190", "Content": "I would recommend this hotel on the basis of its excellent location and the general presentation of the hotel. The lobby area is very nicely appointed and the rooms, whilst small, are nice and very clean. On the downside, we got a \"deal\" at €195 per night. By Rome standards this was just about acceptable but I wouldn't pay any more as there is no gym/jacuzzi/pool etc that might justify such price. In fact my room didn't even have a bath. Breakfast was pretty good though and service was excellent.", "Date": "March 23, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Australia", "Title": "“Not too bad”", "Author": "MrArthur", "ReviewID": "UR4100832", "Content": "Hotel had the wrong room type when we arrived, although fixed this not long after. The breakfast was above average for Italy, although the eating area is quite small, and resulted in a long wait for some other guests who needed tables for more than 2 people. The main problem was that their concierge staff at the time spoke fairly poor English (and didn't seem keen to get other staff who spoke perfect English to help). Upon checking out they suggested the best way to the train station was by taxi. However, when trying to book a taxi the staff weren't able to arrange one - pretty poor for a 5 star hotel. The directions that staff gave to the closest metro station weren't great, and combined with pouring rain didn't leave a very good last impression of our stay.", "Date": "November 9, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "The Netherlands", "Title": "“Great small hotel!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4024692", "Content": "Very nice small hotel. Great location. Great service. Nice restaurants close by, bus close by for the Vatican. don't expect 5 star rooms, but for rome it was pretty good! very happy we stayed there.", "Date": "October 15, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "houston", "Title": "“Great Decision!”", "Author": "partytime2", "ReviewID": "UR3947255", "Content": "Great decision - we couldn't have been happier! We had room No. 307 at the end of the hall - think it was larger than others. Luca at the front desk (makes a great hotel even better!) he said to book directly with him the next time for a better rate.) Location is perfect, few short blocks to sp. steps, shopping, good food. Would return tom!", "Date": "September 29, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Nashville, TN", "Title": "“great hotel!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3839960", "Content": "What a great hotel, in the perfect location! I stayed here while travelling alone for 6 nights in Rome. Small room, but very nice with its own private patio. The staff was fabuous and a great breakfast was included. You can not beat the location.....central to everything. Luca at the front desk was amazing. He let me into my room at 10:30 a.m. the day I arrived and took care of me the whole time with directions, plans, etc. I couldnt have asked for better accomodations for the price. Oh, and there is a grocery store right next door!", "Date": "September 3, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Wonderful service & perfect location!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3779425", "Content": "We stayed at the Hotel dei Borgognoni in May this year for 4 nights on our very first visit to Rome (and to Italy). This was a prelude to a week in Tuscany for our daughter's wedding. The hotel staff were amazing! We had excellent service. Vincenzo and Luca were wonderful and gave us great directions and suggestions for good restaurants. Pietro our bellman went over and above his call of duty -- he even chased down taxis for us! We were greeted every morning and evening with smiles and friendly chats. Our room was perfect -- ground level with our own private outside terrace. We were delighted when we arrived so early in the morning and were able to get into our room immediately. The breakfast buffet was plentiful and always fresh. The hotel is very close to the Spanish Steps and the Trevi Fountain, and the surrounding area is very close to shopping and good restaurants. We walked everywhere! We will DEFINITELY stay at the Hotel dei Borgognoni on our next trip to Rome! We can't wait to return!", "Date": "August 17, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Francisco", "Title": "“Kid haven in Rome near Spanish Steps”", "Author": "sfinparis", "ReviewID": "UR3719322", "Content": "Italy, Rome, Spanish Steps Area, Hotel Dei Borgononi ----------- . More information on our Rome stay on our travel blog, http://sfinparis.blogspot.com • Location: near Spanish steps, a great location for walking around but it is next to impossible to drive to because the street directions are so confusing in Rome. We parked our car at airport and had a driver from the hotel pick us up there for 50 euros. • Room (2 adults, 2 children < 10): we had a very nice suite with a sitting room and a bedroom. The boys slept on the sofa and the floor in the sitting room (not ideal, but workable). The room was on an interior courtyard, very quiet and had A/C which is critical because it is too noisy outside to keep windows open at night • Service: service was outstanding throughout our stay – extremely helpful staff, particularly for planning trips to various sites in Rome • Internet: no wifi or wiring to room, hotel has a computer you can use • Food: a very good breakfast was included, with good coffee and baked goods. • Best feature: this is a wonderfully quite and calm oasis in a very bustling city – it was great to come here and get out of the crush of tourists. • Best food nearby: Noni is a great, traditional restaurant nearby, the hotel staff can direct you. Food and wine was great, waiters were terrific and wore the full white uniforms – very classy • Price: around 250 euros a night (June). • Overall family rating: excellent 9 out of 10. A very comfortable, classy hotel in a great location. I will definitely stay here again.", "Date": "July 29, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“Brilliant location in heart of Rome”", "Author": "garye", "ReviewID": "UR3282865", "Content": "Stayed at the hotel for two nights for a long weekend visit to Rome. The hotel staff are very friendly and helpful and speak perfect English. The hotel location is unbelieveable, one minute from the Trevi Fountain and about 2 minutes from the Spanish Steps. Everything is within walking distances, even the Colesseum and the Vatican. The room was overlooking the street, was beautifully finished, and we felt quite spacious for a city centre hotel. Breakfast was excellent. The hotel is small, 50 rooms, and does not come cheap but would recommend.", "Date": "March 17, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Northern Virginia", "Title": "“Great Location”", "Author": "marebear19", "ReviewID": "UR3272668", "Content": "We stayed here in November 2004 and agree with the other reviews. Good bargin for the location and price. The location is really great. I have been to Rome 3 times now and love the area by the Spanish Steps and the Trevi Fountain. Great shopping and very safe area. Hotel staff were fine (not the most friendly but efficient) and we thought breakfast was great. We booked an internet rate so didn't get the best room....it faced the street and was a bit noisy but hey, its Rome. Walking distance to many tourist areas but recommend taking a cab to the Vatican (fare was pretty cheap). In general, Rome is like NYC in that its a big city and hotel rooms are not huge. In any case, I would definitely go back to this hotel in an instant.", "Date": "March 14, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“great location!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3025428", "Content": "Stayed at the Dei Borgognoni from Jan 8th - 13th, 2005. From the hotel, the Spanish Steps and Trevi Fountain were 5 minutes away. Tritone and Del Corso (2 main shopping avenues) even closer. There was a supermarket next door and public transportation was close as well (bus and taxi stands). The hotel was clean, the bathrooms were fine and the breakfast was perfect. If the room window was open there was some street noise, but all in all would recommend highly!", "Date": "January 22, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“The PERFECT Hotel and Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR3013095", "Content": "I spent a week at the Dei Borgognoni Hotel in August 2004. I was traveling alone with my three year old daughter and the staff went out of their way to be helpful and make my daughter feel like she was arriving home after every outing. There is an Italian \"supermarket\" right next door, with fresh breads, cheeses and deli, in addition to anything you could possbily need. It is so easy to miss, since it blends in with the small cozy neighborhood, which is a 1/2 block from the main street Tritone. The Trivi Fountain was two blocks out to the right and the Spanish steps was six out to the left. Anything you could want to do was within walking distance. The buses and metro could easily be caught on Tritone. The room was a nice size for any city standards. They were clean and decorated elegantly. The convenience of A/C, cable TV and direct telephones in your room was great. Their full breakfast was wonderful and if you needed or wanted something else they would get it for you. I not only can't wait to return to Rome but to the Dei Borgognoni Hotel.", "Date": "January 17, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Home away from home in Rome!”", "Author": "italydizzy", "ReviewID": "UR2696786", "Content": "I couldn't agree more with all the positive remarks already made! Have been staying at the Dei Borgognoni almost every year for the past 10 years and the hotel is my home away from home when in Rome. The location is perfect...you can walk everywhere, and the staff, well, there isn't a better one to be found in any hotel in the city. Whether it's the ever smiling Pietro the bellman or Luca who doesn't have \"no\" in his vocabulary at the front desk, the Dei Borgognoni staff goes that extra mile for its guests. The interior rooms are particularly quiet ensuring a good night's sleep. I can't think of one negative about the place and that's why I'll keep calling it home in Rome!", "Date": "October 11, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London, England", "Title": "“Great hotel, great location”", "Author": "A TripAdvisor Member", "ReviewID": "UR2601013", "Content": "What a lovely hotel! Exceptionally friendly staff, lovely rooms, and surprisingly quiet considering it is smack bang in the middle of Rome. We moved here after spending 3 days at the Cavalieri Hilton on business (which we hated) and it made the whole trip for us. Talking of which, you could not ask for a better location. We walked to everything from here - Trevi Fountain, Spanish Steps, Pantheon, Colisseum, even the Vatican. It is also right next to the top shoppng street in Rome! In spite of all this, it is extremely reasonably priced. Can't recommend it highly enough.", "Date": "September 26, 2004"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Warwickshire England", "Title": "“Brill - Highly recommend staying here”", "Author": "A TripAdvisor Member", "ReviewID": "UR2580497", "Content": "Have just come back from a three day stay at the Dei Borgognoni - can't recommend it enough. Just around the corner from the Trevi Fountain and the Spanish Steps and within easy walking distance of the Vatican etc. Needed a short Taxi journey of 5 Euros to the Colosseum or Horse & Carts available for a more scenic journey. The staff were so friendly and helpful and the Porter couldn't do enough for us. Carried our bags, opened doors and even turned down our bed and left us a sweetie on our pillows each evening ! The decor is lovely - lots of marble and statues - and the rooms, though quite small, were spotless and very welcome air condtioning. Would definitely stay here again.", "Date": "September 17, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "USA New York", "Title": "“Great small hotel in Rome”", "Author": "Bürgenstock", "ReviewID": "UR2508547", "Content": "Was looking for a small hotel in the center of Rome near the Spanish Steps and followed Nicholas Rex (formerly an Assistant to the General Manager of the Hassler Hotel) in his new position of GM of this delightful small hotel just below the Spanish Steps. Very quiet, convenient and a good alternative to the expensive hotels around. Highly recomendable.", "Date": "September 2, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Miami, FL", "Title": "“Don't stay at this hotel!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2112911", "Content": "The web site stated that all rooms faced an inner courtyard. Ours faced the street. We stayed here on the night of May 21. It was warm but the hotel hadn't turned on the air yet. They suggested opening the window - on a Friday night in Rome - great idea. We would have gotten as much sleep on the Spanish steps. Even with the window closed it was intolerable. Of all four hotels in Italy, this was the most expensive (287 euro) and the worst experience. We liked the Capo D'Africa much better.", "Date": "May 24, 2004"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR2079005", "Content": "Stayed there 9 to 12 May 2004. Fantastic location, distances to major sites really is as described on their website. Went with friends. we stayed in room 309, this was bigger than room 310 where our friends stayed. Meant to be a superior, not sure. Staff could not be more helpful. Breakfast adequate but not great.", "Date": "May 19, 2004"}], "HotelInfo": {"Name": "Hotel dei Borgognoni", "HotelURL": "/ShowUserReviews-g187791-d203147-Reviews-Hotel_dei_Borgognoni-Rome_Lazio.html", "Price": "$135 - $488*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via del Bufalo 126</span> | <span class=\"extended-address\">Piazza di Spagna</span>, <span class=\"locality\"><span property=\"v:postal-code\">00187</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "203147", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/8c/57/b6/entrance-hotel.jpg"}}