{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Great hotel in a great area”", "Author": "Julia_cammou", "ReviewID": "UR128346498", "Content": "This hotel is fantastic! Is near to subway and you can even walk to the main historical centre. The street that is located hass a supermarket, great stores and restaurants ( dont miss Mangiafuoco !) . The service was excelent, Ernesto explained everythig to us and indicated restaurants, transportation and tips about rome. The breakfast was great too, with breads, croissants, cakes, yogurt, fruits...the room was pretty good, clean, with bathroom ammenities ans everything new. My only little complain goes to the shower that sometimes during the bath, the volume of the water was much less needed for a shower. I'd go back and I will recommend to all of my friends!!", "Date": "April 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Southport", "Title": "“Curates egg”", "Author": "ColinTSouthport", "ReviewID": "UR127989991", "Content": "The hotel ishas a few points that if corrected could make this into a good hotel. The staff we met at reception would good and helpful whislt in the bar/breakfast room quite different, (not been on the customer satisfaction course yet!). The room, at the front was noisy particularly with sirens from nearby hospital. They were adequate but would have been improved with the addition of tea/coffee making falicites.. The lift was difficult only allowing three people, a number of times someone had to get out. It offten also went in the opposite direction to the requested on. This lift would make this hotel useless for people using wheelchairs. You also need to reach the second floor before reaching the lift. I assume this a security feature as you had to go through reception to reach the lift for the higher floors. Breakfast was adequate but not amazing. They seemed to think tea could be made with cold water and there was littl eif any variation. There was refurbishment taking place but this did not intrude too much. The chocolate brown walls on the corridors were vile. The happy hour consisted of cold pizza slices from accross the road and no one was there. The hotel is in a good location with 20-25 mins to the Colosseum although few restaurantes in the area. The restaurante recomended by the hotel was emtpy so we gave it a miss. Getting around using the Metro and busses and walking was easy and cheap - not much else is in Rome. The receptionist gave good advice and supplied a good tourist map.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Canberra", "Title": "“Value”", "Author": "CanberraRonnie", "ReviewID": "UR127868447", "Content": "This hotel did provide value for money. The staff were very helpful and the room was very clean. The issue we had was that we had to carry our bags up a flight of stairs before we got to the elevator. The elevator was small and only two people could fit with luggage.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Newcomerstown, Ohio", "Title": "“One night stay, worth the $”", "Author": "Chris B", "ReviewID": "UR126958834", "Content": "This was a mid week one night stay away from our villa in Tuscany for a little sight seeing. Check in was pretty straight forward, other reviews are correct about the 3 person elevator but we were clued in to the sevice elevator that got us to our 3rd floor room. The \"bar\" consists of pizza from across the street and a couple bottles of liquer and beer but the bellhop maintaining it was great! Breakfast was better than any american continental breakfast but not 5 star by any means. A big positive for us was that the coliseum and the subway were within walking distance. The one thing that we were not expecting was the temperature in the hotel must have been 80 degrees, even without the heat on in our room we slept with the windows open", "Date": "March 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paignton, United Kingdom", "Title": "“Value for money”", "Author": "Mat W", "ReviewID": "UR126481135", "Content": "Firstly I would like to complement the staff on reception, they were helpful, knowledgable and polite. We purchased the Roma Pass from reception, highly recommended, and they even made reservations for the Galleria Borghese for us. The room, on the 4th floor, was a good size and had been recently refurbished. As previously mentioned by other posters the hotel is on a busy main road and can be very noisy, particularly the sirens, however it quitened down considerably by 22:00. The breakfast is average but we always found enough to fill us up until a late lunch. We went up to the 8th floor with its stunning views of the city for the \"happy hour\" one night just to see what it was about. We had a drink and a few bits from the buffet, mainly focaccia breads, pizzas, a selection of nuts and crisps. My main gripe is upon checkout we were quoted €20 for city tax, something that was never mentioned to us beforehand. Overall we felt we had a great deal for the money, the noise is a fair substitute for its ideal location to the metro and local attractions. Would stay again upon our next visit to Roma.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fell short of my expectations”", "Author": "MrCfromHYU", "ReviewID": "UR125995331", "Content": "This hotel has the potential to be very good, but ultimately didn't manage to live up to what I was expecting based on Trip Advisor reviews. Our first room was on floor 2, facing front. It was huge, although the bathroom was small in comparison. The furnishings were good, the bed really comfortable. We knew in advance a front room would be noisy but we dealt with that fine. However on the first morning we had no hot water and lost valuable time before being moved to a higher floor. Once again at the front, this room was smaller, but the shower was brilliant. Once they got the water sorted. The renovation seems to be nearly complete, as has been said before the brown artex walls are a bit yuck. The reception staff were excellent, really helpful and genuinely charming - shame the same couldn’t be said about the surly ones who were on level 8. They try and avoid looking you in the eye, let alone acknowledging your presence. The breakfast itself was a disappointment, stale breads and a lack of desire to provide more bacon or scrambled eggs being just two examples. And how can a hotel with 55 rooms not have a proper bar, rather than some very limited choice cottage industry that only runs from Monday to Friday in its place? I thought previous reviews sounded a bit harsh about the lift situation: but they were spot on. Location wise, you’re fairly well placed. 5 minutes or so walk from San Giovanni on Metro A – from there it’s 3 stops to Termini or 6 to Spagna. If you don’t want to walk to the Colosseum, then the 87 bus stops outside and takes you right there. So overall a mixed bag. Have to say though, Rome as a city is simply marvellous. So, as a whole, we still had a great trip", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Woking, United Kingdom", "Title": "“mid week break”", "Author": "peter c", "ReviewID": "UR125295880", "Content": "Got a deal on this hotel and was absolutely delighted with it. Its in the middle of updating its rooms and the one we had was on the 6th floor, updated abut two weeks ago, beautiful but lots of road noise. Had to have the window open as the air conditioning is only put on in summer months. Hotel moved us into a room at the rear which was as quiet as a church mouse. Everything we asked the hotel staff to do was done quickly and with a friendly smile. Breakfast was a hot and cold buffet with lots of everything. Rooms were clean and spotless. About a 5 minute walk to underground or travel by bus from directly outside hotel. free internet which we used to print off our return boarding passes. At the airport we were quoted 90 Euro for a taxi to the hotel, booked it via the hotel for the return and paid 45 Euro. You won't find friendlier staff than here.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Suffolk", "Title": "“Some redeeming features - but not many”", "Author": "TamarTiger", "ReviewID": "UR124897564", "Content": "Two nights at this hotel was more than enough. The receptionist started alarm bells ringing as soon as we arrived: to be greeted by someone who clearly thought himself far too important to bother being polite to customers was, to say the very least, irritating and unncessary. The miniscule lift, the only way to get between floors as access to fire escapes was not permitted, would only carry 3 people (I suspect two people of more generous proportions) opened to reveal a corridor decorated with the most revolting shade of brown paint I have ever seen outside a nappy. The room was small but had everything required other than tea making facilities. It even had an ash tray - which given the fuss I made about requiring a no smoking room was disappointing. However, the room did not smell and so, was acceptable. I do wish I had taken more notice of Trip Advisor room tips: the advice to ask for a room at the back was so right, the noise levels at the front of the hotel was unbelievable at all hours of the night. The Italians even use sirens at 04:30 in the morning!! As for their use of car horns: it hasn't been exagerrated, it is constant. Having read that breakfast was \"amazing\" I was disappointed by the offering. Saturday's breakfast was much better than Sunday's but on neither day could it be described as particularly good. The restaurant staff were a different matter, they were lovely. Almost made up for the arrogance of the young man on reception when we arrived! The view from the restaurant is definitely a bonus, its fabulous. It is open as a bar in the evening but we were the only people there and it really has no character as anything other than a breakfast room. There is, however, a nice bar cafe to the right of the hotel, which was better. The hotel is not particularly central, about a 20 minute walk to the Colisseum but is close to a Metro station so it isn't difficult to get around. You could certainly find quieter, more centrally placed hotels, which I will be doing when I return to Rome.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Amazing...”", "Author": "Rachy84", "ReviewID": "UR123771599", "Content": "We've just returned from staying in hotel picadilly.. We loved it.. All positive.. Staff are friendly and helpful! Great location we walked to most places or got the metro which is so easy to use and so cheap! Rooms are very clean lovely bathrooms.. Alittle Noisey but didnt really notice it afterwards! We would highly recommend this place to anyone!", "Date": "January 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Leicester, England, United Kingdom", "Title": "“fab!!”", "Author": "Craig A", "ReviewID": "UR123198869", "Content": "what a great place. small and simple but thats all you need!! we didnt want to stay in and look at four walls, so it was just what i wanted. clean and smart rooms, pleasant staff who where more than helpful to us first timers in rome. Ernesto was especially helpful in pointing out where to go and how to get there. amny thanks to them and would recommend to anyone.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Nicosia, Cyprus", "Title": "“A good 3 star hotel”", "Author": "androsg8", "ReviewID": "UR122398090", "Content": "Have just stayed there with my wife for 4 nights. Here are the facts, as seen from my point of view: On the pro side: 1) Staff was very helpful, fluent in English, polite and ready to assist you on anything you might need. Probably the best feature of the hotel. 2) Clean rooms with nicely decorated showers. 3) Free wi-fi and amazing breakfast with some offerings that you usually find in much more expensive hotels (such as fresh kiwi juice). Free coffee was also served anytime in the lobby. 4) Roughly 500M from San Giovanni Metro station with easy access to the city center. 5) Less expensive than other 3 star hotels. On the down side: 1) Only one elevator (and that tiny too) for an 8 floor building. Had to wait much for our turn again and again. (There is another elevator in the entrance but it only gets you to the reception lobby which is located in the first floor). 2) Noisy rooms. External noise, either from adjacent rooms or from the street totally enters the room unfiltered no matter what you try (Rolling down the shutters will not solve the problem). 3) All television channels but one are dubbed in Italian.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Great location as a base for sightseeing Rome”", "Author": "LondonGliss", "ReviewID": "UR121082324", "Content": "Easy access by walking, tube or bus to all the major sites in Rome. Rooms reasonable for the price, cleanliness good. Breakfast (included) is nothing to write home about. Rooms at front suffer from road noise, but that's not the Hotels fault, you are in Rome after all! All the staff very friendly and helpful except one of the reception staff who was very unpleasant to us during our stay, don't know why, maybe he did not like my after shave!", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Godalming", "Title": "“Good hotel, but very noisy at night”", "Author": "SueGodalming", "ReviewID": "UR120734286", "Content": "Our room faced the front which meant we had constant traffice noise throughout the night. Triple-glazing might be a good idea. Rooms a good size and nicely furnished. Plenty of coat-hangers. Beds very comfortable. The room was quite hot though and couldn't open the window as the noise from the road outside would have made sleeping impossible. The bathroom was excellent, very clean, no black fungus anywhere around the grouting, with two brilliant showers. The room was immaculately cleaned every morning. Breakfast was a bit limited but adequate and kept us going until lunchtime. The view from the breakfast room was amazing. Front of house staff pleasant and helpful. The lift was a bit slow and frustrating, especially in the morning going to breakfast. Booking on-line for our flight home was no problem. The hotel is conveniently situated near the metro and we had no trouble getting around the sights of Rome. Would have rated this hotel 5 stars if it hadn't been for the traffic noise.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Henderson, Texas, United States", "Title": "“Great experience!”", "Author": "D0n1981", "ReviewID": "UR120252529", "Content": "The hotel was so much more than we thought it would be, and the price was amazing! The front desk staff was beyond wonderful. The night auditor even gave me a couple of smokes after I ran out in the middle of the night. The room was very clean. The bathroom was clean, and big. BEAUTIFUL view out of the bathroom window that I would open as I would shower. The breakfast is very very good, and you can eat enough to skip lunch, and take advantage of the free snacks in the evening. We did not spend money on food for two days while in Rome. I would reccomend this hotel to anyone. Business or pleasure. Single or couple. Metro is very close. Get off A line on San Giovanii Ave. Will 100% sure stay at this hotel again!", "Date": "November 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "South Africa", "Title": "“Great hotel”", "Author": "Edrsa", "ReviewID": "UR120022069", "Content": "Stayed at hotel for four nights in October 2011. Found hotel charming with decent size room and clean bathroom. Located close to San Giovanni metro with bus stop outside front door of hotel. Breakfast more than adequate unless 5 star service expected. Receptionist impersonal but always helpful. Would definitely stay there again. Had spacious back room with no street noise but avoid rooms at front of hotel and next to lift shaft.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Stony Plain, Canada", "Title": "“Very happy with this hotel”", "Author": "Bev P", "ReviewID": "UR119157995", "Content": "We stayed at this hotel for three nights while visiting Rome. We arrived early in the day after an overnight flight from Canada and were given a room immediately. The room was modern, everything appeared new. It was spotlessly clean. It was not a large room, but certainly adequate for the two of us. The front desk staff were extremely friendly and helpful, with excellent English. The complimentary breakfast offered a good variety of items. We went to the happy hour reception one evening - might as well give it a miss unless you are in the hotel with nothing to do. Average price on drinks and limited snacks. We walked most everywhere from the hotel, but it is also convenient to the metro if you aren't into walking. We would definitely stay at this hotel again.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Trikala, Greece", "Title": "“Convinient, but needs renovation.”", "Author": "elenagiannoulaki", "ReviewID": "UR118591451", "Content": "Been there in April 2010. Convinient, hotel, adequately clean, nice European style breakfast buffet. Close to metro station, bus stop just outside, a spot to discover Rome.. Restaurants near by. If you like walking there are sightseeings at a close distance. Do not choose front rooms if you have problems with your sleep.. Very noisy even at night.. Nice room view from upper floors but rooms should be bigger.. toilets the same. Needs renovation !", "Date": "September 26, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "DUBAI", "Title": "“IN THE CENTER OF CITY NEAR METRO - SAN GIOVANNI”", "Author": "PRATHAPA", "ReviewID": "UR118295507", "Content": "Hotel Located in the very center of Rome, close many historical places ( By Metro). Convenient location , small rooms, good staff and breakfast on 8th floor cafe , with panaromic view of Rome.", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Annandale, Virginia", "Title": "“Wonderful, moderately priced hotel”", "Author": "dolefan", "ReviewID": "UR117932923", "Content": "I stayed at the Hotel Piccadilly for 8 nights in September 2011 while vacationing solo in Rome. The hotel is situated relatively close to the San Giovanni metro stop on the Red Line and several buses stop in close proximity to the hotel as well which is a huge plus. The room was decent-sized for one person and also had a stocked mini bar if one wanted snacks or drinks. The hotel served breakfast each morning from 7-10 a.m. on their 8th floor which offered a fabulous view of the city. The breakfast was adequate and the same each day--pastries, rolls, meats, cheeses, cereal, fruits, eggs, bacon, yogurt, variety of juices, coffee, etc. I ate there each morning and was never unsatisfied nor did I walk away still hungry. The hotel also offered a happy hour from 7-10 p.m. Monday-Friday on the 8th floor as well. They offered a wide variety of drinks and a \"buffet\" which consisted of chips, peanuts and some flat bread type of thing. My thought on the happy hour . . . skip it. Head out someplace in Rome for their happy hours. All are reasonably priced and offer more of a drink variety. The staff was mostly helpful (except for the gentleman who worked at the happy hour--he seemed to really hate his job and life in general). On my second to last night there, the AC in my room developed a leak. I called the desk around 10 p.m. that evening and they sent someone up immediately. While they couldn't fix the issue that night, they did offer to move me to another room which I didn't find necessary and also provided a bucket to catch the dripping water. When I walked by the front desk the next morning, the woman at the desk assured me the AC would be fixed when I returned even though I didn't even inquire about it--she just knew it was my room that had the issue and wanted to make sure I knew how sorry they were and would resolve it quickly. When I got home, the AC was fixed and everything was fine. The neighborhood the hotel is in is safe as well with several dining opportunities right in the area. Overall, I would recommend this hotel. My stay there was enjoyable and I was taken care of while staying there. The Hotel Piccadilly was my home away from home while in Rome . . . thanks for the great hospitality!", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Riverland", "Title": "“We would certainly consider another stay”", "Author": "Picassosgirl", "ReviewID": "UR117776058", "Content": "Having stayed in Rome 10 years ago this hotel was a gem. One staff member in particular was absolutely wonderful. He was always helpful, knowledgeable and was keen to assist with any questions, assistance etc. I even witnessed some other guests asking him to help fix their camera which he graciously attempted to do! We did not have a balcony room however the view from our window was sensational. The room was clean and cleaned very well everyday. I would agree with a previous review complaining about their room next to the lift. I would suggest you check that your room is not adjacent the lift as this would be very annoying and noisy. For us we had great sleep, very quiet and comfortable bed. Breakfast room also had sensational views of Rome, charmingly decorated and the breakfast was quite good. At least everything looked fresh. For us the only down point was that it was a little far from some attractions and this of course was worse due to the Metro temporarily shut down due to the new line being added. There were of course bus services but this was a very hot and crowded trip but not the worse travel experience we have had. Overall a great place to stay and such a treat to have staff on front desk who are so helpful and happy.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great start to our trip. Can't wait to go again!”", "Author": "gcooksey", "ReviewID": "UR117676467", "Content": "The Picadilly is just a little way off from San Giovanni Laterano and the San Giovanni Metro station - and the southern areas of Rome, perfectly placed for the traveller who needs a base of operations. The bus stops adjacent and opposite perfectly made up for the Metro station being closed (a new line C is being constructed and staions on A were closed south of Termini at the time of our stay). The welcome was brilliant - really friendly and the desk clerks were thankfully very helpful, speaking in perfect English and preempting many of the usual questions we had. The rather small lift (of which there are two, front and back) was a bit awkward if there was more than 2 of you. The hotel lobby was air conditioned and a welcome respite from the August heat. The room was really lovely and looked new! The cleanliness was outstanding; on 2 mornings, athe room had been cleaned and made up whilst we were out at breakfast! -Really efficient! The tastefully decorated bathroom was compact, but more than adequately resourced. The mini bar was tempting, but we would have liked tea and coffee making facilities in the room, though this was only on request. Wifi was available in the room, the WEP key provided on request from the reception. The balcony was big enough to sit out on and the air conditioning was silent, but effective. The breakfast room has an amazing view over Rome and was the perfect way to start the day - we'd have loved to have eatenh there at least once in the evening, however the Bistro is closed during August. The choice of breads, cereals, fruit and juices etc was a really lovely way to start the day. Cappucino or espresso are available by request, but the staff seemed busy and it was not always possibl;e to catch their attention. Very polite and hard workers though when asked! I loved this hotel a great deal and felt the cost was well worht it! Little local tip: Look out for the wonderful cheap ice cream parlour at the north end of Via Magna Grecia and also the nearby chipped-ice stand - grattachecca - a great treat for a well cooked tourist!", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Foothill Ranch, California", "Title": "“Clean, convenient, and friendly service”", "Author": "Tammy A", "ReviewID": "UR116987566", "Content": "Service: Staff was friendly and knowledgable, regarding the bus/metro schedule, for instance. The Front Desk sold bus/metro tickets, as well as Rome Passes (for 25E, includes entrance to 2 museums and 3 days public transportation. The Rome Pass doesn't cover the Vatican Museum, but it does include the Colosseum and Borghese Museum (both are must-see). How we liked the room: We had a pleasant, modern renovated room street side. We did not hear the traffic, although we visited in August which is typically quieter in Rome due to residents leaving the City for their own vacations. The room was small compared to US hotel rooms but it had all of the amenities: A/C, safe, flat screen TV, mini bar, hair dryer, shampoo and body wash. Location and amenities: The Hotel is across the street from the Metro, Line A, and Bus Line 360 and 87. From here it is a 10 min ride to the Termini which is very convenient. There were also good local restaurants, shoe stores, gelatin and supermarket and day market either directly across the street or within a short walking distance. Loved the supermarket to pick up food to take home. The hotel offered free wifi and we signed up for the free daily breakfast, which was filling (juice, coffee, tea, toast, pastries, scrambled eggs, bacon, ham cold cuts, cold cereal and yogurt). Also forgot to add, the bed was very comfortable. Liked best: Friendly and helpful staff and convenient location (note: the hotel is not in the center of town, but it is very close to the Metro stop. The neighborhood is very pleasant, where locals reside. Liked least: The elevator was functioning, but would sometimes pass our floor or go the opposite way. A minor complaint.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "2.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Perth, Australia", "Title": "“Would not return!”", "Author": "SarahJG19", "ReviewID": "UR116043140", "Content": "The room itself was small with out dated furnishings. The room door is literally next to the lift so you hear it moving and the people coming in and out, not to mention people hanging by your door until the lift comes up! The TV had no English channels, which was annoying and the breakfast is nothing to wake up for. Location is a good 10 minute walk to the Metro and the reception staff were pleasant and helpful.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“OK”", "Author": "marian_p_nastase", "ReviewID": "UR111642495", "Content": "We stayed there for three nights after we were doublecrossed by Damiano from Crazy Holiday B&B. Rooms are clean. Bathroom clean. Good continental breakfast. Staff very nice. Nice area, near subway. Bank, supermarket, bus across the street. SO: Next time I will stay there for sure.", "Date": "June 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Loud, Creepy Room, poor staff, nice manager”", "Author": "falcongoggles", "ReviewID": "UR95706531", "Content": "WARNING: Hotel is divided in two sections - renovated and non-renovated. What you see in the photos online are the renovated rooms. Wife and I checked in and asked for a room on the backside of the hotel (we read it was quieter on tripadvisor). They did as we asked, but did not inform us that by moving to the back of the hotel we would be traveling back in time to a room with a fold-out bed, stained carpets, velour wallpaper and heinously smelly bathrooms (a non-renovated room). When we showed up in the \"new\" room and nothing looked like the pictures on the internet we called the front desk. Although it had only been a matter of minutes, they said they no longer had a renovated room and to call Monica in the morning and hung-up. We called in the morning and the concierge told us Monica got to work at 9 am and then hung-up on me. I went to the lobby at 9:45 am and Monica wasn't there. The same guy who hung up on me, Giorgio, questioned why I wanted to speak with Monica (am I taking crazy pills?). Giorgio proceeded to question my integrity, refuse to compromise and seemed utterly put off that we were requesting anything from him. My wife who is the sweetest woman in the world was royally pissed off by the treatment we received and the lack of hospitality for someone in the hospitality industry. Trying to not let the morning incident ruin the rest of our day, I spoke with the manager after a long day of sightseeing. The manager recognized the hotel's errors, switched our room and even bought us dinner at a restaurant around the corner. The owner of that restaurant was really nice and authentic and the manager was very professional. It is called Roberto and Loretta and it was tasty and moderately priced. The new renovated room was LOUD!!! With the windows closed, on the seventh floor, and the shades fully shut, it was ridiculously loud. Rush hour brought horns and people yelling. In the middle of the night, it was a scooter at full throttle on the empty street. I would not go here if you enjoy refreshing sleep as every night just made us more tired (the Best Westerns in Venice and Florence were very quiet in comparison). Highs: Good Breakfast, Nice manager, nice bathrooms (renovated) Lows: Creepy non-renovated rooms, slimy concierge (Giorgio), LOUD regular rooms I cannot recommend this hotel to future travelers and friends because even without the room buffoonery it was just too darn loud", "Date": "February 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cheltenham, United Kingdom", "Title": "“monica is fab”", "Author": "jamdav", "ReviewID": "UR81081133", "Content": "we stayed for two nights and had a great time monica was so warm and welcoming from the moment we walked in the hotel and nothing was too much trouble if we ever go back to rome i know where we will be booking and all for the right reasons. once again thank you monica", "Date": "September 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“super friendly”", "Author": "charlie1973", "ReviewID": "UR79139379", "Content": "The main thing that strikes me as i remember my trip was how friendly and proffession the staff at hotel were. Rooms wer nice and clean, food fine and hotel itself attractive on inside. To get to the lift you do need to go up one small flight of stairs first but im sure staff would assist if needed. Within few minutes walk of central rail station so perfect for airport too. Would reccomend. - piccadilly (best western)", "Date": "September 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cairo, Egypt", "Title": "“Excellent place, would definitely stay there again!”", "Author": "msnarouz", "ReviewID": "UR71982940", "Content": "We stayed at the hotel for 7 nights, during July. The trip was mainly for sightseeing. The location is very good, away from the crowded city center. Transportation is close ( 2 metro stations - S.Giovanni and Re Di Roma) around 5 minutes away, and a bus station just in front the hotel (buses 360 and 87). The area is non touristic, thus the prices are good. An awesome pizzeria and Gelateria are located in Re Di Roma, must try them! The hotel itself, is a small cozy one. The room size is ok, totally renovated, new and very clean. Breakfast is served at 7.30 at the 8th floor where you can have a view of Rome from the top. The breakfast buffet was convenient, Ham, eggs, cheese, cold cuts, coffee, tea .... etc. The staff are very friendly especially Monica. At the entrance there is a free coffee server machine, it was nice to grab a cup of coffee whenever you needed! Free WIFI access is available upon request. The only disadvantage, is the lift as it's very small, but it was no big deal at all. Overall it is a true value for money, our experience at the hotel was great, and we definitely would go there again.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "hkmny", "Title": "“Bad Location, Friendly Staff”", "Author": "hkmny", "ReviewID": "UR67782257", "Content": "The hotel isn't conveniently located for tourist places in Rome. It's located in a mostly residential area(think Central Park West-NY). There are surprisingly few restaurants in the immediate area. The nearest metro stop is 10-15 minute walk. There is a bus-stop right across the street. The hotel staff was very friendly and helpful and will arrange tours for you. The room was on the small side, and the bathroom was really small. In-room wifi worked well.It's an ok place to stay, but would definitely stay in a different area next time.", "Date": "June 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "1", "Rooms": "5", "Location": "4"}, "AuthorLocation": "bristol", "Title": "“Very nice”", "Author": "snowqeen", "ReviewID": "UR58366851", "Content": "We stayed in this hotel for three nights in February. Bargain really, two for three nights with airmiles. It was werey easy to find even in the rain and dark. First night we were in room 703 I think, which has been refurbished to high standart. The bathroom was a bit luxerious, the room was fine. Unfortunately this rooms faces the main very bussy road ( even in the night) and the windows were not fited properly . There was hude gap at the top so we heard all the noise form outside. Unless you can sleep on the street, I would give this one a miss. I sleep with very good earplugs and it still didn`t cut out the noise , although my husband slept blisfully. So if you can sleep anywhere you should be fine. Next day we moved to room no:802, which is right on the top , where the breakfasst is this room was nice and big although not renovated but it was very good and much quieter. The breakfast was absolutely fabulous. FAb qussants, juices, yoghutrs, and the usual egg, yummy bacon,salami, bread etc... Very fresh and tasty. It is a bit out of town, very close to metro. we mainly walked as I love walking , if you don`t walk I think you miss lots of things. We used the free internet and the free coffee . I would give it a 5 stars if only I could sleep there.", "Date": "March 12, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Glasgow", "Title": "“Very Friendly Staff”", "Author": "Dougspec", "ReviewID": "UR55268967", "Content": "I have to totally disagree with the last reviewer as we found that one of the strong elements of the Hotel Piccadilly was the friendliness and eager assistance from their staff. Whether this was in the way they they helped us to find a restaurant, gave directions, organised taxis etc. The Hotel Piccadilly is a little out of the way from Central Rome, but you are only 5 minutes walk from the Metro and with a taxi ride back to the hotel at only 10Euros we preferred this option to some of the overpriced and less comfortable hotels around the tourist areas. The Hotel Piccadilly is also on a number of main bus routes. Our room was a reasonable size and the bathroom was small but had a great shower, but both were very clean and freshly refurbished. Again I have to disagree with the last reviewer as we found the breakfast one of the least impresive aspects of our stay, but this did not impact on our overall view of our stay. Though I agree that the breakfast staff were charming. This was our second visit to the Hotel Piccadilly and having experienced a disappointing previous stay in a hotel in Central Rome I would certainly recommend it for good value, comfort and for its staff.", "Date": "February 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Great value if a little out of the way”", "Author": "hbuckley", "ReviewID": "UR46719621", "Content": "The staff couldn't have been more helpful. Because both of us had been to Rome before but wanted to see the sights again, instead of selling us a ticket for a hop on-hop off tourist bus the receptionist recommended getting on the 87 bus from outside the hotel which drives past all the tourist attractions for a fraction of the cost. A single ticket costs €1 so you can do a lot of the hopping yourself! Many of the other reviews are accurate and I would highly recommend this hotel if you don't mind being slightly out of the centre. The bus to the centre took less than 15minutes.", "Date": "October 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Wendover", "Title": "“A clean modern retreat from the bedlam chaos of central Rome”", "Author": "brentmaster", "ReviewID": "UR45666367", "Content": "I stayed at this hotel with my friend Marilyn from September 28th to October the 1st, having read numerous positive reviews by previous guests. Although the entrance is small at street level the interior is beautifully decorated with marble steps and facades well-polished brass handrails and a fresh , bright reception area. Most of the the staff are helpful and friendly but especially Monica and the head breakfast waiter who repaired my safe instantly when the battery ran out and the lock had to be drilled out to gain access. I must say I've never seen such a smart maintenance man in my life before! Breakfast is taken on the 8th floor where there are fantastic views towards the west of the city and a good selection of tasty continental food is offered. You do have to wait for the lift sometimes but what the hell ? Patience is the Italian way ! We had two west- facing rooms which although compact are very clean and comfortable with fantastic showers and flat screen TV's showing several English speaking channels .You also have your own safe, dressing table and mini-bar. All in all a very enjoyable stay.", "Date": "October 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "2"}, "AuthorLocation": "AndWhere2Next", "Title": "“Not touristy (in a good way), but one valid criticism...”", "Author": "AndWhere2Next", "ReviewID": "UR45024536", "Content": "We checked out of the hotel today; stayed for 4 days. Four rooms, two people per room. Why I liked the hotel: All in all, we loved the staff - the hosts and hostesses were very friendly and spoke English flawlessly. The breakfast was adequate and the view from the dining room was breath-taking. Machine in lobby served free coffee drinks all day. Free WiFi access is available in the lobby ( I was not able to connect on the 5th floor ). For eating, the neighborhood was perfect - several restaurant choices within walking a two-block span. The best part about the neighborhood was that it was safe, was not in a touristy location (therefore, the prices in the restaurants were reasonable and the food was great), and many supermarkets, cafés, and gelaterias were close by. The San-Giovanni metro stop was three blocks away, so it is very easy to get around the city if you are comfortable using the Metro. The Coliseum is within walking distance (perhaps a 20 minute walk), and a vibrant gay/lesbian night scene is also not far (in fact, it's in the shadow of the Coliseum). Rooms were clean and perfectly-sized from a \"European-size\" standpoint (and had more space than most hotel rooms in New York City); irons and ironing boards are available, English-language stations are on the TV. Bathrooms were impressive but all of the guests in my party commented that the toilets did not flush adequately. Why I'd likely not stay here again: I rated the rooms a \"2/5\" because they were unreasonably hot and uncomfortable at night. I learned on the last night of my stay that the hotel turns off the air conditioning from 7PM to 7AM. Additionally, there was no fan in the room or any way to circulate air to feel cool at night (even with the windows open). Further, the hotel is on a very busy and loud street; when the windows were closed, there was no real problem with the noise because the windows are double-paned and windows had external shutters; with the windows open, it was impossible to sleep without earplugs. The fact that the hotel intentionally inconvenienced guests (by turning off the AC from 7PM to 7AM) at a point when they would most like to feel comfortable and refreshed is unforgivable. If I had been made aware of the fact that the air conditioning would be turned off at night (when outside temps were very warm), I would have found alternative lodging. While I would very much love to rate this hotel favorably, I can not say that I would recommend this hotel to a friend because of the air-conditioning issue.", "Date": "September 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Paris, France", "Title": "“Hum...”", "Author": "philippe_42", "ReviewID": "UR39699641", "Content": "The receptionist was very nice and helpful, and spoke good english. The breakfast area indeed has a very good view. We had a room on the street, and the double grazing dampens the noise pretty efficiently. On the other hand our bathroom had a slight mold smell, and the elevator was tiny. I was with a friend and we had a good deal on the room, but I wouldn't recommend it to impress your girlfriend! The location is slightly out of town, but 5 minutes walk away from the subway and a bus stops in front of the hotel.", "Date": "September 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Lancashire", "Title": "“Good value hotel!”", "Author": "GinaLancashire", "ReviewID": "UR37475546", "Content": "Just returned from a 3 night stay with my daughter. Small, but adequate twin room with a lovely bathroom. We were on the front and although the main road was noisy, this didn't affect us at night time, it was quiet with the shutters down. Nice, pleasant and helpful staff. Breakfast very good, the restaurant is on the 8th floor, so a lovely view of Rome each morning. Previous post regarding taxi fares is very true. We caught the Terravision shuttle from the airport, but were tipped off about the taxi drivers in advance. We were quoted 20 euros at the most by someone on trip advisor, but on arrival, the first driver asked for 26/28/30 euros, he couldn't give an exact price! Paid 14 euros and 10 euros respectively each way. Also be careful about being 'fast tracked' into tourist sights. We were told the queue for one was at least 90 minutes, it took us 15! As 2 ladies, we felt quite safe in the area, lots of locals in the restaurants which caused a few memorable moments regarding language malfunctions, but with gestures and a phrase book, we got by. Excellent restaurant, can't remember the name now, turn right out of hotel, next right and it's the first one you come to on the right hand side. We enjoyed this hotel, would happily return.", "Date": "August 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "York", "Title": "“Perfect hotel, and fantastic bathroom”", "Author": "Anderoby1", "ReviewID": "UR35938657", "Content": "I stayed in this hotel for 2 nights on leisure in Rome. The hotel was well located with easy access to the main sights. San Giovanni subway stop is only a 10 minute walk away and the number 87 bus stops just outside and takes you to some of the main sights. The rooms were modern and clean with fantastic bathrooms, equipped with wonderful rain showers. Breakfast was served in the 8th floor restaurant and provided a good start to the day complete with bread, hams, cheese, cereal, croissants and toast. All in all I would definately choose this hotel again.", "Date": "July 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Florida", "Title": "“Great Hotel, clean, friendly staff, GREAT breakfast!”", "Author": "Zaz17", "ReviewID": "UR34427950", "Content": "We stayed at this hotel after looking at reviews online. The hotel was great; a 2 minute walk to the nearest metro station, and a 5 minute ride to wherever we needed to go. The room was VERY clean, and they even packed us a boxed breakfast to go for the morning we checked out early. I would stay here again, and would tell all my friends and family to stay here as well...GREAT value!", "Date": "July 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“When the chips are down ... who's there for you?”", "Author": "Uber-Scribe", "ReviewID": "UR34046394", "Content": "Certainly not BA or the Heathrow baggage handlers who lost our case on the way out ... and then delivered it the night before we came home. In the meantime, though, Monica and Ernesto at the hotel reception desk were the ones who came through for us. Always a sympathetic ear, a word of encouragement or advice and they made many phone calls on our behalf to try and find out where the hell the case was. So ... molte grazie Monica ed Ernesto ... voi siete i migliori! It's people like this that makes a hotel good. Not just the comfortable, clean rooms with great views across the city to St Peter's (and wonderful air conditioning for the summer!) , nice breakfast selection, proximity to the easy, two-line, 'one price' Metro system and Rome's amazing cathedral church of San Giovanni in Laterano. And around the corner in Via Gallia you'll find Mangiafuoco - one of the best Roman restaurants of its kind in the city. Look ... just go! Graham and Tricia", "Date": "July 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Warwickshire", "Title": "“Great Value in every way”", "Author": "Oldstoneybroke", "ReviewID": "UR33122634", "Content": "Our first view of the hotel from the outside was less than favourable but once we were inside that changed completely. Marble steps up to a lift that took us to a small yet spacious reception, then up via a second lift to our room which though smallish in size was excellent. As has been previously reported there is no tea/coffee making facility in the room but is available on request. There is a mini bar with drinks at reasonable prices, not the normal hotel rip off prices. The bed was very comfotable and the bathroom, though again small, was modern and clean with a pressure shower that was unbeivably good - a mini hand held shower and a giant fixed shower head. Our room faced the main road and although it was noisy at times it didn't disturb us. There was an electronic shutter that helped cut out noise at night and also left the room in complete darkness, keeping out the early morning light until we were ready to start the new day. We found the staff, especially Monica, very friendly and helpful and the only down side is tha very small lift that takes a maximum of 3 people to their rooms and to the 8th floor restaurant which has a great room across Rome. And breakfast there was very good indeed!", "Date": "June 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Weston super Mare, United Kingdom", "Title": "“Nice rooms shame about the facilities”", "Author": "Aginoth", "ReviewID": "UR32017833", "Content": "Stayed 3 nights. Room was well decorated, but would have thought there would be 2 chairs for a room for 2 people. No Tea or Coffee facilities in the room, No Ice Available from Hotel. No Bar as advertised, and still listed in welcome pack. No Bistro for evening meal as advertised and listed in welcome pack. Internet access ok from Hotel reception, but only 1 PC for 55 rooms, and wireless connection in room was hopelessly slow if you were able to connect at all Only one small (3 person) lift for 55 rooms - 100 plus guests, meant a lot of queueing and waiting by lift doors, no accessible stairs, as they were behind the firedoors that appeared to be alarmed. Staff were friendly, cleanliness was ok but a bit of dusting wouldn't go amiss. Excellent location for the metro and to get to the colleseum etc, bit far to walk to Vatican but as I asaid Metro was close and good value. Shower in room wasw good and the bathroom exellently decorated. Beds were huge and very comfortable Not aprticulalry good value for the cost per night, but comfortable none the less. Rooms on Via Magna grcia side of hotel suffer from a large amount of traffic noise and from being on an ambulance route to nearbìy hospital. Would not use again or recommend due to lack of facilities and cost.", "Date": "June 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Comfortable and with very helpful staff”", "Author": "aelfred", "ReviewID": "UR30091187", "Content": "We booked this hotel through airmiles. We were concerned because previous reviews mentioned building works so I contacted the hotel in advance and was assured that we would not be disturbed. This proved to be so. Although the building work continues it is completely screened from the bedrooms and public areas and we heard no noise at all. Our room faced the street and had a small balcony. The decor was a bit tired except for the shower room which although small was beautifully fitted and very glamorous. The location is a bit Colleseum and San Giovanni in Laterno as well as the metro. Buses for the centro storico stop right outside the hotel. The breakfast room has great views over Rome.", "Date": "May 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Monmouth, United Kingdom", "Title": "“Stay here when they've finished refurbishing!”", "Author": "glewpot", "ReviewID": "UR26669697", "Content": "We stayed at the Piccadilly for 3 nights to do the usual Rome tourist trip. We chose it because it seemed good value and pretty well reviewed here. When we arrived we asked for a quieter room at the back - as per advice from other TA members. We were given a 2nd floor room at the back. At 6.30 the next morning we were woken by the sounds of hammering, clattering and loud conversation. Looking out of our window we discovered that we were basically staying in a builders yard (we had arrived in the dark - in every sense) The hydraulic lift for materials was just outside our window. Why give us a room like this - did they expect us to say nothing? We asked for a change of room and luckily one was available at the front so we had to repack and move. The next people at reception were also requesting a room change. We then discovered the hotel was full of notices apologising 'to our dear guests for the refurbishment work' This of course is a real dilemna for hotels - do they close up or keep going and upset the guests? We booked the hotel through Airmiles who say that they were unaware of the works. I would have liked to have known beforehand - we would not have stayed here. On a positive note the new room had an excellent bathroom and was comfortable. The breakfast room is very bright with excellent staff and great views. If you really are in to eating out this is not the best area. There are a few reasonable restaurants but not much choice (I'Corsari kindly recommended by a previous reviewer is now a Barclays Bank!) Getting around is pretty easy. The metro is fairly close by. The general area is pretty uninteresting, though San Giovanni in Laterano is walkable. This will be a very pleasant hotel - when they've finished the 'works'", "Date": "March 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Solihull, United Kingdom", "Title": "“Ticked All The Boxes For Me”", "Author": "Wafto", "ReviewID": "UR16232077", "Content": "I have just returned from 3 nights at the Picadilly and have to say it is a very comfortable and well located tourist hotel. It is located no more than 5-10 minutes from San Giovanni metro station on the very busy Via Magna Grecia. The area feels very safe as the vast majority of residents are local, I could not see any other hotels in the area. The room is functional and clean, they are in the process of refurbishing the hotel, the room had all the amenities you would expect, a decent bathroom, towels are provided, TV, mini bar. The windows are double glazed which allowed a good night's sleep. The Via Magna Grecia is a busy and noisy road (even at night) why do the Italians love their car horns so much. The only slight downside was the lift, very slow and at breakfast time it took what seemed like ages to arrive at your floor empty, as it only takes 3 people. Breakfast is in a 8th floor dining room with a great view over the city, you can just about make out the top of the Colosseum and St Peters is clearly visible. The buffet breakfast offers a good variety of options, I found the scrammbled eggs and bacon very good. If you need to temporarily stow your luggage after checking out there is a free room available for the purpose. We found the staff fantastic, they all spoke very good English and were most helpful especially when explaining the excellent public transport to us. Bus 87 stops directly opposite and takes you to the Colosseum and terminates not too far a walk from the Vatican, the 360 takes you to Termini railway station. They did recomend a restaurant, its menu being displayed in reception, best avoided, we found it poor in all aspects. I can thopugh highly recomend 'l Corsari' ,turn right from the main doors and the restaurant is on the other side of the road about 100 yards away. We ate there twice, the quality is excellent and the waiting staff are very hellpful, the restaurant is frequented mainly by the locals so the prices aren't a rip-off. All in all we found it a perfect base to see the sites, the traffic noise is the only consideration - maybe a room on the opposite side to the Via Magna Grecia would be quieter. Thanks to the wonderful staff the Hotel Picadilly is a great place to stay.", "Date": "May 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Herts", "Title": "“3 Night stay in April/May 2008”", "Author": "FulhamCV", "ReviewID": "UR15590141", "Content": "Stayed 3 nights.The hotel is conveniently located. Whilst not exactly in the centre you can be at the Collosseum within 12-15 minutes by the metro (which whilst shabby is ultra efficient). The room was of good quality, even the mini bar wasn't a rip off and the first drink is free!! The range of English tv channels is a bt limited but then that's not wat you go to Rome for (is it?). The 8th floor breakfast room overlooking the Rome skyline is excellent and the selection of food is good.", "Date": "May 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Manchester", "Title": "“Clean & friendly”", "Author": "phlipManchester", "ReviewID": "UR14020808", "Content": "Stayed 3 nights at end of Feb. Clean & friendly. Currently undergoing a much needed refurb! Decent 2nd floor room but shower was poor and view was of nearby apartment buildings. Having said that, we only slept and had breakfast here. Terrific views from 8th floor restaurant. 5 min walk from Metro. A bit out of city centre/tourist areas but this had it's advantage with having no crowds around late at night. All in all, an adequate base from which to see all the tourist attractions.", "Date": "March 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brussels", "Title": "“Absolutely wonderful place to stay”", "Author": "VijaySrinivasan", "ReviewID": "UR12465640", "Content": "We had a great stay at the hotel. Very clean place, good locality and a nice breakfast room at the 8th Floor providing a good view on the city of rome. Very friendly staff. We had left behind a mobile phone in the hotel and realised it after a few days. It just took a phone call from us and they promtly sent the phone to my home. On the whole it was a great stay and i would surely recommend this hotel to everyone.", "Date": "January 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tasmania, Australia", "Title": "“Very good hotel”", "Author": "SammyHtas", "ReviewID": "UR8490376", "Content": "Very friendly staff & clean & comfortable hotel! Had good directions to catch a bus from Termini (train station) - bus stops right outside hotel! The metro station is also close to hotel & quicker than bus! Easy access to all major sights in Roma! Only complaint was that the hotel was next to a major road so got the traffic noise. Disappointed that we didn't get to check out breakfast - had to leave hotel early for tours,etc!", "Date": "August 24, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Helsinki", "Title": "“Quite good”", "Author": "mercan", "ReviewID": "UR7936014", "Content": "The hotel isn't at the heart of Rome but still pretty well located - 200 meters to the subway and a bus stop right in front of the entrance The lobby and the reception was in a almost glittering condition but the room was a bit worn-out A big bonus for a large bathroom; at least in a italian scale. Staff was correct and polite but not overwhelmingly friendly, adequate english was spoken. Breakfast was usual. Only minus comes from a small and awful slow elevator.", "Date": "June 19, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Adelaide, Australia", "Title": "“A fair Hotel”", "Author": "BonnieMax", "ReviewID": "UR7702365", "Content": "This hotel is fair, we stayed here for 5 days in April 2007.The front desk staff was helpful and spoke good English. The room was a good size for the three of us although I saw a single room that was quiet small. The room was out dated but clean, it had a small LCD TV and a fridge that did not work. The lift was very small so it was hard taking up your bags up. The lift seems to service the top floors first and works its way down. I waited 10 minutes to go up to the top floor for breakfast one day. There is free dial up internet in the lobby which was great. The breakfast was fair but the view was good. There are alot of little resturants close to the hotel and the underground is pretty close. It is a little away from the major attractions but you can catch the train for 1 Euro. I would try somewhere different next time maybe a little more central, but we got what we paid for and that is the important thing.", "Date": "May 27, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Depends what you are after”", "Author": "OzBoyMelb", "ReviewID": "UR7573151", "Content": "The reviews that have already been written about this place seem to be spot on. We stayed there for 3 nights. Good points are the terrific view from the breakfast room, safe neighbourhood and central location. Bad points are the elevator and average service, which I guess it almost to be expected in an Italian hotel. In particular the breakfast staff were nightmares but the front desk were ok, but a little unhelpful. I would stay here if I was in Rome for a few days and wanted to cover off a few of the major tourist attractions. There is a decent TV with plenty of channels in Italian and English. Outside of that the rooms are fairly basic.", "Date": "May 9, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "new jersey", "Title": "“Horrible Staff!!”", "Author": "melanie311", "ReviewID": "UR6060976", "Content": "We stayed at this hotel on our post cruise stay for 2 nights. The hotel staff was not very helpful at all! The \"free\" internet that the hotel advertises was never working and the staff kept informing us that they were \"waiting\" for someone to fix it. When we went to check out, the hotel staff gave us a fax from the Vatican for our tour the previous day. They never bothered to apologix for not giving it to us!! We would NEVER stay here again. The location is terrible and you should stay away from this hotel at all costs! The rooms are terribe. Beware!", "Date": "November 5, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "3"}, "AuthorLocation": "London UK", "Title": "“The staff swung it”", "Author": "A TripAdvisor Member", "ReviewID": "UR4249036", "Content": "I recently spent 3 nights at the Picadilly and on balance my views are largely positive. The location - 5 minutes from San Giovanni metro station and the very busy Magna Grecia road. 20-25 minute walk (if you chose the right route) to the Colosseum. The room - functional. Nothing special but clean and all the amenities you would expect. Decent bathroom, towels provided, tv, mini bar. Air con is really an air cooling/heating system rather than proper air con. The windows are well double glazed which was the only thing allowing a night's sleep. Otherwise the Magna Grecia would be too noisy a road (even at night) thanks to the Italian love for their car horns and the need for ambulances to always have their sirens blaring. Breakfast - is in a smallish 8th floor dining room with a great view over the city. The Colosseum (just) and St Peters are visible. The buffet breakfast offers a good variety of options. Luggage - If you need to temporarily stow your luggage after checking out there is a free room available for the purpose. Internet - Apparently wireless access is available, but if you don't have your laptop with you there is a pc available and usage is free with a code given by the reception staff Staff - fantastic. All speak English, and one particular member of staff gave great recommendations for restaurants. The best being Il Corsari (Turn right from the main doors and the restaurant is on the other side of the road about 100 yards away). We ate there twice, and a slap-up 3 course meal for 2 inc a bottle of wine (house wine is very nice), water, coffee, liquers came to 60 euros (40 quid). We ate there the night before and had another great meal for 35 euros. The quality is excellent and the seafood mixed grill is exquisite. A restaurant frequented by the locals so the prices aren't a rip-off like in the touristy areas. All in all, if you are a city dweller used to traffice noise then it is a perfect base. If like me you live in the country, the traffic noise is the only consideration - ask for a room on the opposite side to the Magna Grecia. Otherwise thanks to the wonderful staff the Hotel Picadilly is a great place if you have a short time to see the ancient sites.", "Date": "December 18, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Average Hotel - clean, convenient and cheap”", "Author": "A TripAdvisor Member", "ReviewID": "UR3733694", "Content": "We were in Rome for 3 days and wanted something clean, convenient and cheap. This hotel was fine for the weary traveller, it provided everything you would need for a city break on a budget. The only really negative thing I would say was there was a bad smell both in the room and out on the street from time to time.", "Date": "August 3, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Highly recommend this hotel”", "Author": "MeNAnj", "ReviewID": "UR3704644", "Content": "My daughter and I stayed at the Piccadilly Hotel for 3 nights and can thoroughly recommend it. The room was spotlessly clean and comfortable the bathroom was spacious and contained a bidet, hair dryer and clothes line, the mini bar was well stocked and reasonably priced, and the staff were cheerful, friendly and helpful. The hotel is situated 500 metres from the wonderful San Giovanni in Laterano Church and 20 minutes walk from the Colosseum, Forum and Palatine Hill. There is a metro station 100 metres away and a bus directly across the street which will take you to the Trevi Fountain, Spanish Steps, Pantheon and Piazza Navona. Although situated on a main road, the windows are double glazed which makes it very quiet. The bufet breakfast is varied and plentiful and the view over Rome from the breakfast room on the 8th floor is amazing. There is also good shopping and good restaurants in close proximity. All in all, I cannot recommend the Piccadilly Hotel highly enough, particularly for those on a budget.", "Date": "July 27, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Menai Bridge, United Kingdom", "Title": "“Good place to stay”", "Author": "juliejos", "ReviewID": "UR3097154", "Content": "We have just returned from a 3 night stay at the Piccadilly. The room was quite small, but comfortable and spotlessly clean. Staff were very helpful and pleasant. The hotel is within walking distance of many of the major attractions, but if you don't feel like walking, the Metro is very convenient (you can buy a ticket from the hotel reception). Would definitely stay there again if returning to Rome.", "Date": "January 29, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Central Illinois", "Title": "“Good value, but off the beaten path”", "Author": "Revlisag", "ReviewID": "UR3026090", "Content": "My husband and I have a different opintion about this hotel experience. We chose it for the price. I didn't mind that it was off the beaten path - but still only 3 metro stops from Termini. I enjoyed being in a less touristy neighborhood that included stores with reasonable prices. And because we stayed there, we stumbled on to San Giovanni, which is an incredible church. He thought it was too far out. Also, when we got there we were put in smoking rooms. We complained and the next night we were moved - they did all the moving for us. I thought this fixed the problem, but he would rate them lower for not getting it right the first time. The staff is very helpful, expecially Richard ! The hotel did a great job of getting us to the airport at 5am for our flight. The decor of the rooms is a little dowdy, but the bathrooms were good - larger than many. The breakfast room is a great experience with the view of Rome. The breakfast itself is just OK. So choose this hotel if you want a less expensive, less central Rome experience.", "Date": "January 23, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Cheshire", "Title": "“Enjoyed the Piccadilly”", "Author": "Sandra.Jan.", "ReviewID": "UR3012216", "Content": "We have just returned from a trip to Rome and stayed at the Hotel Piccadilly. The staff were very friendly and helpful. Rooms comfortable and the mini bar was not expensive. The buffet breakfast was adequate, some items could have been a little warmer, but I'm not complaining. The view from the breakfast room was wonderful. The hotel arranged our transfers to and from the hotel and also an illuminated tour which I would certainly recommend. One very big bonus point for us there was no noise.", "Date": "January 17, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "stratford upon avon", "Title": "“Happy to recommend Piccadilly”", "Author": "Arnie21", "ReviewID": "UR2330650", "Content": "Perfect base from which to explore Rome with great transport links to places of interest. My room (506) was clean, spacious, had great views and a very good bathroom. The panoramic view of Rome from the breakfast room on the 8th floor is also worth a look. My mother became quite ill on this visit to Rome and was admitted to Hospital, the staff at the hotel were a great help making phone calls on my behalf to the Hospital, orgainising transport and offering helpful advice somethimes until early hours of the morning. Nice people and I'm very happy to recommend the Piccadilliy. Incidentally, my Mum was fine!", "Date": "July 29, 2004"}], "HotelInfo": {"Name": "BEST WESTERN Hotel Piccadilly Roma", "HotelURL": "/ShowUserReviews-g187791-d203225-Reviews-BEST_WESTERN_Hotel_Piccadilly_Roma-Rome_Lazio.html", "Price": "$88 - $233*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Magna Grecia 122</span>, <span class=\"locality\"><span property=\"v:postal-code\">00183</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "203225", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/09/16/0916afec2bc483e7df6b3589a7cd62152large.jpg"}}