{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "", "Title": "“nearby the centre and little park”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR127794192", "Content": "the staff is very friendly, the location is wonderfull, and for an city tripp THE place to be! But mind the beds...", "Date": "April 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cluj-Napoca", "Title": "“Very good location”", "Author": "cosminutza24 Posted by an Easytobook.com traveler", "ReviewID": "UR126953410", "Content": "We booked a double room at Hotel Daniela, but there were some problems with the water and they send us to Hotel Edera. The location was even better than the first. The room was nice, clean and we had balcony. Breakfast was ok. The hotel has also wi-fi. The location is great, very close to Colosseum, metro station, Termini. The only negative thing was that on our reservation was written that fee and taxes are included and at the reception they put on our invoice another fee.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "edinburgh", "Title": "“Good value - amazing location”", "Author": "andy p", "ReviewID": "UR124304449", "Content": "Booked a double room through booking.com and got a cheap deal, around £33 pppn. (We were a little miffed to hear that we had to pay the tourist tax £2pppn as we were told it was already included but this was no big deal and possibly the fault of the agent rather than the hotel) The staff were friendly and we encountered no problems, breakfast was standard for European hotels with cereal, croissants, rolls jams, ham and cheese everyday with fresh coffee. The room was small and 2 single beds were shoved together but I'm beginning to realise this is fairly normal for budget hotels. The bathroom was clean and impressive with a new marble-looking finish. One annoyance is the staff's habit of turning your air conditioning off while you are out so the room is always hot when you first get back, but we had a fairly powerful little machine in our little room so it cooled down quickly. I found a solution to this was hiding the remote although they must have got a spare one one of the days. Oh you also have to ask for the remote at reception which they will neglect to tell you but offer when you ask. We wanted a certain standard of room because it was our little get-away and we wanted somewhere nice to come back to but the location was the most important thing to us as we planned on being out site-seeing all day every day, and the location is fantastic!! Walking 30 seconds round the corner you can see the Colosseum and after a 5-10minute walk through Domus Aurea (Nero's garden) you are there! And there is a metro line at the Colosseum from which you can get to almost everywhere for a couple of Euros. Not by any means a top hotel but would recommend for those on a budget as deals can be found that beat the price of some hostels!", "Date": "February 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Serres, Greece", "Title": "“No water because of the ice.”", "Author": "Tasos_Serres", "ReviewID": "UR124255648", "Content": "I went in Rome in 03.02.2012 for the weekend with my girlfriend and a friendly couple. When we entered the hotel, a very friendly guy welcomed us and very quick he drove us to our rooms. Our room was under some kind of repairment so, he gave us another one in the 2nd floor wich was pretty comfortable and clean. The first one was on the 6th floor. My friends stayed on this floor. After the first day, everything seemed to be perfect, but the second there was no water in any tap of the hotel beacuse of the cold. We told the receptionist about the problem, and he said that they couldn't do anything with the excuse that the hole city was in the same situation. Third day and we still didn't have water. then, at the end of the day they offered us the chance to go to another hotel nearby, and give us a discount to our price for the two days for about 10euros per night. That was unacceptable, but we didn't knew our rights and it was very difficult to call anyewhere outside Italy. So, after a lot of negotiations with the manager herself, we had a discount of 15euros per night. That was the only black spot to our accomodation in Edera. The hotel is very close to the Colosseo, only 5minutes maximum on foot, and to the metro where you can easily visit any place in Rome.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Kingston-upon-Hull, United Kingdom", "Title": "“Looking Tired”", "Author": "Stephen F", "ReviewID": "UR123603666", "Content": "Just come back from a three nighter staying here. First impressions not great - entrance between two garages! Room looked tired, but clean, saying that the wallpaper was peeling at the joints, bathroom door woulkd not secure as the lock was broken, wardrobe doors would not close as one was not on its hinges properly, no control unit for the air-con and due to the low level we were at, had to keep the shutters closed with the windows ajar to keep the local moggies out. Towels etc could do with replacing as they were worn thin - again clean though. No in room info guide to attractions etc and no facilities to make a drink at all..Hotel provided an adequate continental breakfast [cheese, meats etc] but no bar or any other chance to get a drink [no room service etc] To be honest, would be best described as a B&B than a 3* hotel", "Date": "January 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Lovely staff, great location, very clean hotel.”", "Author": "Aussietourists_9", "ReviewID": "UR118625287", "Content": "I am surprised to read the bad reviews for this hotel because we love it. We are staying here now and will have had 3 nights here altogether. The staff have been friendly and helpful and the room is very clean. It is much bigger than other ones we have stayed at on this trip. Our friends' room is a bit smaller but still sufficient. The A/C works fine in all our rooms, (there are 3 couples) and we are all very happy with the hotel. We can walk to most places, including the Colosseum. It really is in a great location and very quiet at night. There is free Wi-Fi and safety deposit boxes at the front desk. They don't have a restaurant, apart from breakfast in the morning, but that is even better, because they have let us bring our own drinks and nibblies back and eat them in the courtyard out the back. There are plenty of nice cafes nearby for dinner. Maybe we are not as fussy as some, because we are only here to sleep,the rest of the time we've been running around Rome. But we have found this hotel extremely comfortable.", "Date": "September 26, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Athens, Greece", "Title": "“We will not come back again”", "Author": "Nickk50", "ReviewID": "UR116952439", "Content": "I have been there for a long weekend during March. Location was good since with metro line you could reach almost all the tourist places of Rome. But the Hotel apart from its friendly reception and cleaning ladies was terrible. Firstly our bathroom stinked to high heaven we could not stayed to the room unless we left its window open. Beds were also not good. This terrible smell will always be connected to my memmories of Rome :-(.", "Date": "August 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Great location”", "Author": "KristaDawn", "ReviewID": "UR116681177", "Content": "We stayed at the hotel for a week in April. We arrived in Rome at 8 at night so it was getting pretty dark. We should have taken the train or a cab but we figured we could walk it. Which in the day would have been no issue. Live and learn! The gentleman at the front desk was great in showing us to our room and giving suggestions on where to grab a bite to eat. Out room was off the courtyard. It was small but aren't most European hotel rooms. The best part of the room was the large bathroom and shower that was great. For two tall people this was nice to see. The complimentary breakfast was enough to get you started for the day. The waitress was there all 7days and was great and super efficient. The walk to the colosseum was only fifteen minutes away. And only fifteen to the subway. The area looks a little sketchy at night but during the day seemed fine. Only real issue was the lack of electrical plugs but not a huge deal. Would stay again.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Alloa, United Kingdom", "Title": "“not so good”", "Author": "Ewills10", "ReviewID": "UR114790669", "Content": "service was ok, staff helpful,room was basic ,marks on bedding top cover looked like blood, sheets clean, bathroom not so nice broken tiles on floor , shower head was disgusting and needed replaced, location was good close to the metro and the colosseum both only a 10 min walk,liked that the hotel was close to many cafe's resturant's,disliked the shower in room.", "Date": "June 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Port Saint Lucie, Florida", "Title": "“Great Location to the Historic District”", "Author": "reclusive6099", "ReviewID": "UR110234552", "Content": "I found the Hotel Edera a good hotel for location and price. It was easy \"navigating\" around to all the major sites. We felt that the rooms were adequate and the breakfast quite good. The staff was not overly helpful or friendly. (Possibly because they didn't speak much english. The map getting from the train station to the hotel needs some more detail as we had some difficultly finding the hotel.", "Date": "May 28, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Antwerp, Belgium", "Title": "“Very nice hotel and close to Colosseum”", "Author": "Vijay1979", "ReviewID": "UR98062086", "Content": "It was a beautiful hotel, also fits the budget of a normal traveller. Priced at 75 Euros per night, it was ideal and most of all the location was the best. Situated very close to the Colosseum it was a perfect place to stay.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bruxelles", "Title": "“Very good hotel”", "Author": "acia83 Posted by an Accorhotels.com traveler", "ReviewID": "UR96477613", "Content": "I was in Rome during a weekend and I was afraid of which kind of hotel to find, but once arrived there I was positively surprised by this hotel. The location is excellent, just 2 minutes walking from Colosseum and not far from termini station, with a metro stop at 5min walking distance. The area is very elegant and very quiet. The hotel itself is very good: very nice, clean and stylish rooms and very kind and helpful staff. The breakfast was not various but good anyway. I strongly suggest this hotel for an unforgettable staying in the most beautiful city in the world!", "Date": "February 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Southampton, New York", "Title": "“Hotel leaves a lot to be desired.”", "Author": "Rachel48658", "ReviewID": "UR95230770", "Content": "Room was as small as a closet. I could not open my suitcase and the armoire at the same time. I was there for 4 nights and there was no outgoing phone service throughout my entire stay. Service could be described as lackadaisical at best. The two concierges did not care about the lack of phone service. Maybe saving on NOT HAVING A LAND LINE for outgoing calls since most people have a cell phone nowadays, but it made calling the States impossible. Breakfast was minimal with stale bread.", "Date": "February 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Goole, United Kingdom", "Title": "“Perfect location.....”", "Author": "163avidtraveller", "ReviewID": "UR87880721", "Content": "Have visited Rome numerous times and stayed in several hotels and this visit was as successful as ever. Booked online and wasn't disappointed large clean room with balcony and 3 beds as requested, friendly staff, best choice of italian breakfast and lots of it. Easy access to Collosseum and only 20 mins from Termini and 15 Mins from Piazza Maria Maggiore. Quieter location than previous visits as is in residential area but with local shops just up the road IDEAL LOACATION!! CAn recommend www.romepickup.com for taxi shuttle from Fiumicino Airport extremely helpful and very accomodating at short notice.", "Date": "November 22, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Warragul, Australia", "Title": "“Ideally located but room size inadequate for two.”", "Author": "Sainter66", "ReviewID": "UR84513238", "Content": "The Edera Hotel is conveniently located for the Colosseum and the Termini railway station. The receptionists speak English and assist with any tours and information. Downside was the size of our room and the uncomfortable, small bed. Also the shower screen leaked water over the bathroom floor. The breakfast was good and the buffet was always well-stocked. We didn't have air con, even though October can still be very warm.", "Date": "October 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Perfect location”", "Author": "lininil", "ReviewID": "UR82610880", "Content": "The reviews on this hotel vary quite a bit so I wonder if it is determined by each individual room. However, our stay was comfortable and we were very happy with the accommodations. We arrived early and they allowed us to check in early. Hotel room was clean and bathroom spotless. New facilities, large wall mirror, tub, tile floor and walls, all spotlessly clean. Decor of the room was typical and non-exciting but room was cleaned daily. TV reception was static - just wanted the CNN news so I didn't really care so I never mentioned it to the desk. The breakfast was the same daily, but offered a variety of fruit, juices, coffees, rolls, meats, cheeses, yogurts, and the like. The location is what we loved! A two block walk and then you find yourself in a lovely park walking downhill straight to the Colosseum. What a view! We went for nightly walks just for the view. Small grocery a few doors down, very small but you can get a few things for your room like a bottle of wine or sodas. The desk staff arranged a taxi for the last day and provided wake up call for that very early ride. They were helpful whenever asked. We plan to go again and were happy enough with the hotel that we would stay again. I'd say it was a \"competent\" choice to have made. I traveled with my teen-aged daughter and we stayed a full week at the hotel.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "4", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Box Hill, Australia", "Title": "“not very good”", "Author": "random_ninja", "ReviewID": "UR81538332", "Content": "we stayed here a week. we got a room which left ALOT to be desired. - the walls where patchy with different shades of paint, which made the room look rather dirty. nothing like the premium rooms displayed in pictures. the sheets where clean and the bathroom which was ancient was also clean. - the air conditioner was not working and the mosquitoes would eat you alive if you left the window open day or night. lucky it wasnt too hot when we stayed. - the tv in the room was a tiny old CRT screen. - the WIFI was not free and only worked in the lobby, which is weird for such an expensive hotel. - you had to hand the keys back to reception when you left, and the staff lost our key!! he kept trying to blame it on us and then we had to wait around for him to find a spare. - the breakfast was OK. it was a buffet and people would pile the food up like it was going to run out or something. it was rolls and croissants with some cold meats and jams. the coffee was one of the worst in my life. the major issue was that there was not enough tables and often a line would form of patrons waiting to get a table to eat. and there was 1 waitress who was meant to clear tables, clean dishes and serve food all at the same time. she was run off her feet every day and often there would be one table with a massive pile of dirty plates which she would add to because she didnt have time to take them back to the kitchen. - the location was not great. it was in a part of town surrounded by ruins and thus there was no shops or good restaurants near by. it was a 15 min walk the Colosseum and another 10 min walk to get to a part of town with better restaurants. over all i would not stay here again. it was a fairly run down hotel in need of renovation. it was way too expensive for the quality. and the location was abit of a let down.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bilbao, Spain", "Title": "“Good and bad attitudes”", "Author": "Jator-C", "ReviewID": "UR81251277", "Content": "After staying 3-day in this Hotel is annoying that 10 minutes before time to leave the hotel (11 am), the receptionist was knocking the door. The service and the breakfast, passable, taking into account that has 3 stars.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rosario", "Title": "“excellent location,comfortable hotel and very good attention”", "Author": "Lana_G82", "ReviewID": "UR73070907", "Content": "Despite all the negative reviews I've seen I want to share my absolutely positive opinion. I've stayed in this hotel in July 2007.I booked (and paid) in advance for this hotel in a travel agency, and my friend booked it in internet and and no one of us had any problem with booking and accomodation.We've choosen this hotel first of all because of its location: it is in the centre of Rome, having some very important tourist attractions very close: the Coliseum, the Forum,the church Santa Maria Maggiore and also it is very conveniently located in 5 min on foot from the railway (and subway) station Termini (which also has a special train to get to/from Fiumicino airport). The hotel staff speaks various languages-English, Spanish, also very kind, attentive and helpful. The breakfast always was very good. The room was good too, clean,comfortable,with TV,phone,air conditioner,minibar,also a desk and bedside table. The hotel has patio with some plants and flowers and my room had a view to this patio. During my stay in this hotel I didn't have any inconvenience. I can't tell anything about wi fi internet, tv channels, free parking etc etc because I came to Rome to go sightseeing and that's why I was not very interested in this stuff. The price was intermediate, this hotel has 3 stars. I think this hotel can be recommended to any kind of visitors.", "Date": "July 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Great location”", "Author": "dwpjbp", "ReviewID": "UR57976699", "Content": "We stayed four hights and the hotel was met our needs. The room was clean with an excellent en - suite. Always plenty hot water. The breakfast was all that you need. The loacation was great with the Colleseum only about a 10 min walk and the metro fairly close as well. Although not many eating places in the immediate area there was a good selection within an easy stroll. This hotel is a good choice for the city break type of trip.", "Date": "March 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Boston, MA", "Title": "“Dirty with poor service”", "Author": "StudentInBoston", "ReviewID": "UR54038934", "Content": "I hated this hotel to the point where I canceled my reservations for the next few days and found someplace else. The two things that were right about the hotel were the location and the price, but the long list of wrongs blew those away. Moldy shower head, really worn mattress, batteries missing from the TV remote, mini-bar fridge was loud, room was tiny, ants in our room, and total indifference to that last complaint. The breakfast was actually worse than other budget hotels we stayed at on our trip. I would never stay here again.", "Date": "January 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Cheshire", "Title": "“Clean and comfortable”", "Author": "racoon51", "ReviewID": "UR52666235", "Content": "Before going I had read some poor reviews on this hotel before going so was nervous when I got there, but found it to be very pleasant. Though some rooms could do with a little refurbishment, everything was clean and comfortable, and the location was perfect. I would recommend this hotel to anyone staying in Rome. One thing I would say is book a taxi before you arrive through the hotel, as there is a set taxi price for getting from the airport into Rome, and many taxi drivers try to con you when you get off your flight at the airport.", "Date": "January 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Doncaster", "Title": "“Perfect location and ignore all the negative reviews!”", "Author": "ukhotsarah", "ReviewID": "UR43147185", "Content": "After booking a three day break with greatgetaways, I had read some of the previous reviews of Hotel Edera to gain some idea as to what it was like. I read in a couple of entries that the guests had been relocated to other hotels due to mix-ups in the booking so I was understandably worried about this happening to us. I needn't have worried. The hotel is located about a five minute walk from the Colosseum and the bus-stops for city tours. There are plenty of restaurants and bars around but just be aware that you should have a good idea of how to get back to the hotel after dark, as wandering round aimlessly trying to see your map under the streetlights isn't the best idea (not just in Rome...anywhere!) The rooms in the hotel are well-equipped with toiletries, phone, hairdryer, handtowels, huge bath towels, fridge (fully stocked with drinks...but you have to pay), plenty of drawer space and the wardrobe has plenty of hangers (unless you're Victoria Beckham). The TV is OK if you want some background noise but is only Italian stations (but you do get the odd European video on MTV.) I was in room 2 but I had a peek in room 5 and it's HUGE!!! Ask for that one if you like a lot of space. The curtains are long and heavy and allow you to have a lie-in if you want without being woken up by sunlight. The room I was in looked over into a lovely little courtyard with a huge palm tree, a couple of tables and chairs and was perfect for relaxing after a hard day sightseeing. The resident cats were a welcome sight (but then again I am a cat-lover) but didn't pester us. Theres a sitting area inside with a small bar. The staff behind the desk spoke good English and were happy to help with any queries I had. They don't have a problem with takeaway pizzas being taken back to the room (although this was only done due to illness). There is a little shop up the road on the same side that sells beer, wine, fruit and veg and other stuff. Breakfast consisted of tea, coffee, hot choc, juices, cereal, bread buns (a bit hard!), ham, cheeses, pastries and fruit. Loads more than when we have stayed in Rome before. All in all, a good location and facilities. Would definitely recomment this hotel to a friend.", "Date": "September 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Grimsby", "Title": "“Ok hotel but too far from city centre”", "Author": "Zen1983", "ReviewID": "UR40137047", "Content": "This hotel is ok for a 3* city centre hotel. Our room was small but clean with air con (you need to ask for the remote) the bathroom was very nice. The staff were very good and spoke perfect english. The hotel does not have a bar. The downside (which would stop me staying there again) is that it is just too far out. Yes it is 5min from the Colleseum but the Colleseum is the last attraction to the south of rome. It is at the end of this long busy road, the hotel is then past this and close to a park which sounds nice but is not great when you are coming back at 11pm. It was too quiet and as two female travellers we did feel a bit vulnerable, you have to come off the main road and go up these 40 or so steps then the hotel is off a quiet little street. To walk to the Trevi Fountain which is in the centre it took about 20min, which is too much to be doing every time you go back, it is about 5 miles from the vatican. For these reasons alone i would not stay at this hotel again.", "Date": "September 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Copenhagen", "Title": "“Good hotel, nice location”", "Author": "Torpegart", "ReviewID": "UR38037063", "Content": "This hotel has good value for money. The rooms are okay for a 3*-hotel. The only thing that was bad, was the TV, which didn'y really work, but in a town like Rome you don't really sit in your room watching TV. The breakfast, which is included in the roomprice, was okay. Good coffee and okay food, if you just need something quick to start your day. The hotel is located very near to Colosseum and Forum Romanum, but in a quiet area.", "Date": "August 18, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "poland", "Title": "“Never more”", "Author": "daroPOL", "ReviewID": "UR37293009", "Content": "Good localisation, quite good rooms and breakfast (buffet) but BIG problems with accomodation. I've been moved to another Hotel of Leonardi Group because of \"overbooking\"...", "Date": "August 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "malta", "Title": "“enjoyed holiday”", "Author": "angelaMalta", "ReviewID": "UR21977674", "Content": "We stayed in Edera hotel for four nights.It was very easy to find and very close to the metro and buses.The room was small but good. Breakfast was good too.", "Date": "November 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brazil", "Title": "“Nice hotel, good location, nice price!”", "Author": "PaulaB27", "ReviewID": "UR18879506", "Content": "We stayed at the Edera in early June. Although reading many reviews to be careful as they use this hotel's location as a 'trap' and then tranfer the clients to other hotels in the same chain, we decided to give it a go, as our main concern was having a parking spot for our rental car! We had no problems. The room was spacious and clean. Breakfast was buffet style with a good variety of choices. It had a frigobar & tv. Parking space available for EU 10 per night. It's right around the corner from the park where Domus Aurea is. Crossing this park, you're right in front of the Colisseum, where you will also find a subway station. This park closes at night, but you can go around it. There are lots of nice bars close to the park. We were very lucky with this choice!", "Date": "August 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brixen, Italy", "Title": "“Nice hotel, good location”", "Author": "JoFritz", "ReviewID": "UR16686603", "Content": "Nice, clean, silent (!!!) hotel, very friendly staff, good breakfast (considering that Italians don't take b/f), excellent location (15min walk from train station, 3min walk to Colosseum, good connections with publ transport). House keeping could once in a while fix some things.", "Date": "June 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chester", "Title": "“Great liitle Roman hotel near Colusseum”", "Author": "Ricardo25", "ReviewID": "UR14816334", "Content": "I stayed at this hotel in June for 4 days and found it very quaint, very Roman, and most importantly the location is perfect for exploring Rome. The Colusseum is minutes away and we walked everywhere around the city - no need to get trains or taxis. The hotel itself is fine - small rooms as expected, but with an authentic feel. Check out the original cage style lift, garden courtyard, and paintings on the walls. If you're looking for a central location, mid-priced hotel then this is perfect for your stay in Rome - a beautiful place.", "Date": "April 5, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“OK but could do better”", "Author": "OnwardThruTheFog", "ReviewID": "UR8212550", "Content": "Rooms were very small even by european standards, refrigerator had mold. We requested some ice and were told ice is not available !! Location is good, you can walk to the Coliseum and Forum. Would not stay there again.", "Date": "July 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "marsa al brega", "Title": "“A very comfortable small hotel”", "Author": "ruxpin7", "ReviewID": "UR7942010", "Content": "Hotel Edera June 7th to 11th 2007 A very comfortable small hotel set in a quiet neighbourhood with a great location. We went to Rome to attend a wedding and combined this with sightseeing. We looked at many hotels and read many reviews on the internet before choosing the Edera, one of the Leonardi group of hotels. A number of its reviews were not favourable but it appeared to have all we were looking for. Upon arrival we were greeted by a very helpful reception clerk who checked us in promptly and never questioned our early arrival, before 1pm. Our room was perfectly adequate for our needs and fulfilled our expectations – Whilst not spacious it had a big enough wardrobe, a TV – but no English channels and a small refrigerator which had room to keep the necessary bottles of water chilled. Even more important it had an individual air-conditioning unit, which allowed us complete temperature control and ensured a good night’s sleep. The bathroom had washbasin, bidet and shower and was very clean. Each day the room was cleaned thoroughly and the towels and sheets were changed. We dealt with three different reception clerks, all of whom were extremely helpful. Taxis were ordered immediately and arrived within five minutes. A map of Rome was forthcoming and included an explanation of the nearest metro station and the best shopping streets. Nothing was too much trouble. Hotel Edera proved to be all we desired – a quiet, cool and centrally located base from which to explore and attend the wedding. The latter proved to be an absolutely memorable experience. Along the street to the right is a fruitereer, a corner shop and an excellent Trattoria, where you can eat in or take away a variety of pizzas and pastas – try the lasagne, it’s truly mouth-watering. The Colloseum is a five minute walk away through a delightful park.We will certainly return to the Edera if we visit Rome again.", "Date": "June 20, 2007"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "West Sussex", "Title": "“Needs some loving care”", "Author": "Journeymaster", "ReviewID": "UR7592060", "Content": "Hotel Edera , Via Poliziano, Rome 26 April 2007 It’s interesting reading some of the previous reviews. One in particular would rate this Hotel higher than it’s three stars. One can only speak from one’s own experience and as I stayed in only one room in this Hotel, that is my bench mark. I would only rate this Hotel at the most a two Star for the following reasons. Whilst the Hotel was situated in an ideal location, a very pleasant five minute walk from the Colosseum, the hotel itself, judging it by our room and our friends across the landing, I'm afraid requires some loving care and attention. Apart from the reception area, the overall feel is that there hasn't been any kind of refurbishment or decoration work done for quite a number of years. I use the term \"dog eared\" to describe our room. Though spacious, the very old wall paper was peeling off of the walls and the paintwork had been very badly touch in. The toilet/shower room though clean was old and completely worn out. However, the continental breakfasts were excellent and well replenished and the staff were friendly and helpful. The overall impression I felt was that the management were making cutbacks to the point that there was no room service available and the lounge bar was permanently closed. If you wanted to have a drink in the lounge area or court yard garden, then you were asked to use the mini bar in your room and bring your drinks down. In it's present decorative state, I’m afraid I could not recommend this Hotel. If I were to go back to Rome I would go back to the same ideal location but I would choose a different Hotel.", "Date": "May 12, 2007"}, {"Ratings": {"Check in / front desk": "1", "Overall": "1.0"}, "AuthorLocation": "london", "Title": "“dont bother booking here your quite likely to be sent elsewhere”", "Author": "madphysio", "ReviewID": "UR7583554", "Content": "We booked the edera specifically because it was near the sights , we shouldn't have bothered. we were met by a rude man behind the desk who told us the rooms were overbooked and we were being sent to another hotel in their chain. But not , as he described, near the sights, it was well away from where we wanted to be. The receptionist showed us a massive pile of overbookings which the hotel has made in the past few months. So I cannot review the hotel because we didnt get to stay there, the replacement was comfortable and the desk clerk polite. So just dont bother, the stress of being shoved somewhere else was a real dampner on the start of the holiday.", "Date": "May 10, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "edinburgh", "Title": "“Lovely little hotel”", "Author": "rhondaEdinburgh", "ReviewID": "UR7153645", "Content": "Me & a friend stayed in this lovely little hotel last week, its 15mins walk from termini train station, not great for girls alone but taxis were available. Room was clean and big, receptionists very helpful with bus info etc. Bathroom was big and room cleaned every day with fresh towels. Breakfast was lovely chocolately croissants, rolls and usual continental breakfast. Street is a bit dark at night. Only 10 mins walk from colleseum and the beautiful Domus Area park 5mins.", "Date": "March 13, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Yorkshire", "Title": "“Location good, Hotel very disappointing”", "Author": "YorkshireRoamer", "ReviewID": "UR6654794", "Content": "Location was good - within walking distance of sites and station. We found the hotel facilities rather disappointing. Every time we switched the room light on by the bedside switch there was a flash and a bang and several rooms lost their power. Despite reporting this to reception every day the problem remained throughout our stay. We decided to have a wine from the minibar but it tasted and smelled of rotten eggs. This was returned to reception with the glass but they had no replacement and we had no wine or glass until the last day of the stay. The double bed was 42 inches wide which was ok if we both turned over at the same time - I slept on the floor instead. The weather was very hot but the air conditioner was so noisy we couldnt sleep with it on. The traffic was too noisy to have the window open. Breakfast was ok. Staff friendly but innefective. One evening we returned to our room and the cleaner had left the door unlocked with all our belongings available and vulnerable. Receptionist was 'sorry'.", "Date": "January 24, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London", "Title": "“Stole From My Room!!!”", "Author": "Hopeful88", "ReviewID": "UR5909049", "Content": "I can't even explain the trauma this hotel caused me! I had a very treasured pair or earings in my room, not an overly expensive or \"special\" pair but they were given to me by a dear friend who passed away so sentimentally they were priceless! I, of course, made staff (5 in total including a manager) aware that the earings had gone missing (STOLEN!) from my room. I was only repeatedly told that the staff member in question had been employed for a very long time and was trustworthy. Do not stay here unless you want to have your belongings stolen!", "Date": "October 4, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London", "Title": "“Avoid!”", "Author": "drunkenfly", "ReviewID": "UR5882235", "Content": "This hotel is used as a bait for getting the rooms in other hotels in the chain of Leonardi hotels. This hotel is the closest to the city center and all of the tourist attractions and it will always have the rooms available, as long as other Leonardi hotels have rooms. You will pay for rooms, arrive and hotel will tell you about \"booking mistake\" and will transfer you to the hotel far away from the center. The other hotel will have the same star count as Edera, so there is no way to complain.", "Date": "September 27, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "York, England", "Title": "“Great Location!”", "Author": "warwick43", "ReviewID": "UR5621857", "Content": "My family stayed at the Hotel Edera during the Italian summer. The Hotel was in a perfect location, being situated a 5 minute walk (thorough a park) from the Colosseum, which is where the nearest bus/tram stop is situated. The nearest Metro station is also only a 5 mintue walk away. The Hotel doesnt appear to be much from the outside, like most italian buildings it looks a little tatty. However, inside the hotel is lovely. The foyer is neat and nicely deorated. The reception staff are pleasant and friendly, and although 2 of the 3 receptionists dont speak brilliant english, they were always happy to help. The showerhead in my room was broken on the first day. We reported this to reception in the morning and by the time we returned in the afternoon it had been changed. There is a small garden/patio area which we found to be very useful. During the warm hours of the afternoon we found this area perfect for relaxing and socializing. It was shady and cool, and we often ate our breakfast out there. The breakfast was adequate - a normal continental breakfast consisting of a variety of hams, cheese and croissants. There were also yoghurts, cereals, fruit juices, bread rolls and fruit. The breakfast is between 7 and 10 and is served in the dining area on the ground floor. Our hotel room was quite small, but the bathroom was large in comparison. The room was furnished with 2 single beds, a wardrobe, dresser and television. the room had an air conditioning unit, which we found to be very useful as the night were quite warm. My parents room was a lot larger than ours, however they requested a double room and recieved two single beds pushed together. The rooms were cleaned everyday, the beds were made and the towels were changed. Overall we found the hotel to be perfectly situated, clean, tidy and we would definately recommend it.", "Date": "August 18, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "essex", "Title": "“Great little hotel”", "Author": "DawnandMike", "ReviewID": "UR4529873", "Content": "Stayed here Feb 2006 - London UK traveller First visit to Rome. This hotel is great value for money.Short walk thru park and you are at the Coleseum.Great base for sight seeing. Near to the Termini, central railway station, ten/fifteen minute walk away. Off the main roads so nice and quiet. There were supermarkets nearby and places to eat or have coffee. As we were there only for 2 days we done all the tourist places in the centre. Room, clean, smallish but large bright bathroom. Buffet help yourself breakfast-continental style, great pastries. Reception staff very helpful with good English, bonus as our Italian non-existent.Provided map and directions to main sites. Would recommend this hotel to friends and family.Part of larger Leonardi group 3-5 star hotels.Was rather worried when I have read some of the other reviews which were not glowing but glad I stayed here.", "Date": "February 27, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“What a rip off”", "Author": "lamma2002", "ReviewID": "UR4247619", "Content": "We booked a double and received a single (one towel, one pillow etc.). Our bathroom was leaking (water all over the bedroom - called the concierge to ask for additional towel (thought maybe the rooms are so small in Italy) - he said that he could not provide a towel as he is the only one in the hotel - but he will get us one up in 30 min - never came - we wanted our money back - had to fight for another room in another hotel with manager who pretended not to understand English, even though porter told us that she speaks English - Hotel wanted us to walk to next Hotel which was 35 min away - yet another fight - all in all the worst experience ever - after we left the porter said \"you won\" - I don't think so we lost a whole day in Rome and felt utterly cheated to have to fight for customer service in a three star hotel - what a rip off - oh another thing - you pay in £'s on Opodo just as much as you would pay in Euros there.", "Date": "December 17, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Ireland", "Title": "“A top class stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR3786040", "Content": "I really dont know where these people stayed. The edera hotel is more than 3 star in and out. The rooms are modern with artistically decorated ceilings. The towels are changed every day, the bins cleaned with the beds made. The staff on the front desk were very helpful and spoke fluent english. Facilities include safety deposit box, a mini bar, a hairdryer, Internet access, comfortable lobby couches, breakfast, garden with patio seating, and the ability to book a taxi from the hotel. Its in prime location 5 minutes from the coliseum and 3 from the nearest metro stations of vittorio emanuele and colosseo. Although outside it looks shabby the majority of romes buildings are the same. Price is also very important and we paid €43 for a night with seven days amounting to €910 in total for three people. Tips for tourists in rome a few flat comfortable pairs of shoes, drink plenty of water, a map is a necessity even for the first day Rome is a huge place. Be careful of thiefs and pickpocket around termini station and the spanish steps. you should eat in side streets away from the main sites its cheaper. Bring a book on all the sites in rome. Get up early to see everything because you will melt in the midday sun. Go to bed early!!! I think my review justifys the hotel the above reviews don't. The Edera a top class stay.", "Date": "August 18, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London", "Title": "“Probably the worst hotel I have ever stayed in...”", "Author": "A TripAdvisor Member", "ReviewID": "UR3625106", "Content": "My heart sank the minute I pulled up in a cab outside........ depressing and dilapidated looking building and signage. I'm not sure if they put me in a room that hadn't been used in years (right at the top of the hotel), but I can only describe it as more like a 'back street bedsit'. Dark and dingy, no working shower, rotten sticky carpet, ancient wall mounted aircon which barely worked. If the rate was more like £85 for a week and I was back-packing on a tight budget, then maybe, but not per night NO WAY. I checked out the very next day and for just a few £'s per night more stayed in beautiful 4* hotel. The only positive is that the staff were polite and helpful (with directions and cab ordering etc) and didn't bat an eyelid when I said that I was leaving! Perhaps they are used to it.", "Date": "July 1, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Coventry, England", "Title": "“Very good hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3599301", "Content": "After reading the above reviews (and after I'd already booked the hotel!) i was a bit worried about going here. The hotel though was very clean, air condintioned, large rooms, nice bathrooms with a fantastic warm shower, the so-called walk through the dodgy park is not to be beleived, this is through a well lit park next to the collusium so a better view at night on your way home you will be hard pushed to find. The only drawback was that some of the staff had limited English but thats really a case of our ignorance to not learn much Italian. I can't comment on breakfast because I never got up in time to make it! Great hotel recommended.", "Date": "June 22, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Champaign, IL, USA", "Title": "“Location is everything, but...”", "Author": "Pickyfrugal", "ReviewID": "UR3207281", "Content": "The location is fabulous for the money, and very quiet. Everything else is either mediocre or bad. Management is plainly misleading the guests: ignoring my phone calls ahead of arrival, they concealed that their elevator was not working and under repair (I can't walk the stairs)! After some pressure, they gave us a ground floor room looking into the main lobby. A group of pretty boorish Dutch spent all their evenings right near the door shouting and smoking so heavily that we couldn't breath behind the door. Every time I had to ask the reception guy to intervene. We had some special room, it was very large, but the plumbing was not replaced since the Empire collapsed. Half of the staff don't speak either English or French and are not of any help. Breakfasts were acceptable. The problem is that Edera is by far the cheapest hotel belonging to a large group, and it seems nobody cares what's going on there. Still, it's hard to find a better deal for the money.", "Date": "February 18, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "", "Title": "“So,So”", "Author": "A TripAdvisor Member", "ReviewID": "UR2854307", "Content": "The room was large enough and the air condioner did work. So much for the positives. Some luggage racks would have been nice (alot of sitting on the floor). The t.v. was small and didn't have a remote. The bathroom was pretty bad, very cramped and it was so dark that it was hard to see. It also smelled bad. The drain constantly overflowed. There was a nice bar/lounge in the lobby... Only one problem, it never opened. It was just there for looks. It would have been nice to have a place to socialize with fellow travelors. The area smelled of garbage and there seemed to be graffitti everywhere. We've been in worse hotels but expected better for the money. We wouldn't stay here again.", "Date": "November 29, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Toronto, Canada", "Title": "“Nice hotel, pleasant staff”", "Author": "A TripAdvisor Member", "ReviewID": "UR2623027", "Content": "My husband and I chose Hotel Edera for our 1-week stay in Rome (from September 26 to October 3, 2004), based on price (980 Euro for 1 week) and location. Situated on Via Angelo Poliziano, it is a 5-minute walk to the Colosseum when taking Via Domus Aurea through the park. It has a quiet charm and also quiet rooms for a hotel located centrally (a combination not easy to find in Rome). Small but pleasant room, luxurious bathroom, nice, clean hotel with helpful staff; breakfast (buns, cold cuts, cheese, tomatoes, cereal, milk, fruit, fruit juice, assorted croissants/pastry, coffee or tea) was included in the price. I would recommend this hotel, and we're sure to return there next time we travel to Rome.", "Date": "October 6, 2004"}], "HotelInfo": {"Name": "Edera Hotel", "HotelURL": "/ShowUserReviews-g187791-d203222-Reviews-Edera_Hotel-Rome_Lazio.html", "Price": "$82 - $211*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">75 Via Angelo Poliziano</span>, <span class=\"locality\"><span property=\"v:postal-code\">00184</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "203222", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/f4/29/f42999269016df1adb60a19e010ed7574large.jpg"}}