{"Reviews": [{"Content": "Definitely NOT 4 STAR having stayed in 2 other hotels in Italy prior to Hotel ritz, we were looking forward to our stay in Florence. Neither of us had been to Florence and were excited at seeing the city.Before I start my feedback, be re-assured we were by no means expecting 'THE RITZ'.... we were expecting 4 star hotel.Where do I start, the hotel on entry, I can assure you was NOT a 4STAR accomodation, it is in major state of dis-repair.(holes in walls, in numerous places, the carpets were well worn- need I go on)One good side, the reception staff were friendly enough.If you do have a car it's 25 euro extra per day for parking in a garage at the back of the hotel.The room- well one good thing for it- the linen/towels were changed daily, which was nice.The room itself smelled of stale smoke, with the dust under the bed only knows when the last time it had a good clean. And dont even ask to try to see yourself with the dirt on the mirror in the wardrobe.However the beds were comfortable- just dont expect to have a romantic few days in Florence as we requested a double bed but got twin beds(normally the head boards are attached- not these) what a romance killer!Lastly but by no means least- the bathroom or 'wet room'. It was definitely wet after having a shower, you could nearly swim to the door with the amount of water in the room flowing out into the hallway. We could not close the door to the bathroom so obviously this wasn't a new problem to the room.Did we complain?No we had paid in advance so there was no point in swapping hotels. We thought also if this is what the rooms are like, what if the next room is worse... and it wouldn't have changed our opinion.Breakfast- it is included, we were hoping this would redeem the hotel, sadly it did not. We went to breakfast about 9.00/9.30 each morning, the coffee had been sitting there since first thing- ie it was cold. If you like cocoa pops and plain oul ham and hard rolls, then you would be happy.Overall, I am sorry to say we were not impressed and it actually put a whole damper on the Florence romantic time we had planned.I would like to re-visit Florence, but sorry definitely not in Hotel Ritz, this is our opinion, some others may differ, but as the saying goes 'buyer beware'", "Date": "Sep 22, 2008", "ReviewID": "UR524089781", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1", "Value": "2", "Rooms": "1", "Location": "4"}, "Author": "shedo"}, {"Content": "Professional staff, nice view, location-good Our room overlooked the river and we opened the window and had a great view. The street is heavily traveled by cars and many people. Personally, I loved having the window open and hearing the city noises. The rest of my family slept through the outside noise. The staff was very sweet and professional and always available to assist. The bathroom in our room was in serious need of an upgrade and caused the bedroom area to have an unpleasant smell at times. (Opening the window helped.) Our room and bathroom were exceptionally clean.The hotel is in a great and safe location. We only took a taxi to and from the train station and walked everywhere in Florence.", "Date": "Apr 30, 2008", "ReviewID": "UR403128395", "Ratings": {"Service": "5", "Business service": "1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3", "Value": "2", "Rooms": "3", "Location": "5"}, "Author": "manvstravel"}, {"Content": "If you like clean avoid the Ritz THE HOTEL RITZ - FLORENCE - ITALYBooked this hotel via http://www.hotelritz.netThe Hotel Ritz is masquerading as a 4 star hotel but should not even be star rated if condition and cleanliness is anything to go by.We stayed for 3 nights from the 25th April, the reception staff were lovely, polite couteous and helpful, the kitchen/dining room porters were helpful and polite, but what really let the place down was the tired condition and filthy rooms and spoilt carpets on the landing.(We used the stairs for three days to the third floor, we noticed that they were not cleaned in that time as the same muck was in the same place on the same stairs each day.)On entering our room we were immediately drawn to a filthy stain about 2 inches wide running down the wall from ceiling to floor near the TV. The floor which was tiled was dirty in the corners, there was a thick layer of dust on everything, the brass bed ends, the chandelier, the TV, inside the wardrobes, so thick in places it was like felt.The TV was 3 metres above the floor? Why? It was absolutely filthy. I was able to stand on a chair and write the words clean me across it in the dust it was so bad. (photo to follow!)before we could sleep in the bed we had to take a damp towel and wipe down the metal surfaces of the bed to remove the dust and no doub't bed mites which love that kind of filth.The navy blue bed cover was obviously not laundered very often as it had some white stains on the underside of it near the top. I'll leave you to draw your own conclusions!! After the first night we rolled it up in to a heap with the stains showing so that the cleaner might think to replace it. We were much too the optimist, it was neatly placed back onto the bed for that night in the same condition as before!There was no other accommodation available otherwise we would have walked out. The saving grace was that the sheets on the bed were clean and the bath towels looked okay.The dining room was amazing, not because it was fantastic, but because it was so bad, the large round tables were squashed in with little room between them, the table cloths were generally stained. Instead of removing them after previous diners they were hoovered with a miniature table top hoover and left for the next diner, regardless of whether they were stained or not.The choice at breakfast was poor and not what we had anticipated.What I would like to know is, who awards them their stars, surely the bottom entry should be a high standard of cleanliness and a commitment to customer care and satisfaction. Sorely lacking here. In fact they should be ashamed of themselves and remove any star from their advertising so as not to mislead people.", "Date": "Apr 30, 2008", "ReviewID": "UR561781011", "Ratings": {"Service": "2", "Business service": "3", "Cleanliness": "1", "Check in / front desk": "5", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "4"}, "Author": "AlnwickWanderer"}, {"Content": "overpriced and shabby we have just returned from a 2 night stay in this hotel. We had a family suite - it wasn't large but was adequate. However it was very expensive for what it was. The rooms were shabby and not very well lit. Wallpaper was peeling from the walls and part of the door frame was missing on the bathroom door. Our window overlooked a back street but there was no problem with noise. Sheets and towels were clean. Breakfast however was very poor - just rolls, a few buns and cereal. We were very late having breakfast the first morning and were horrified to see the kitchen lady just put the large bowls of cereal in a cupboard without being covered up! Needless to say we didn't eat cereal the next morning and my teenage son refused to eat any breakfast at all. The location was OK but the Ritz has 4 stars above its doors - a real joke. This is a 2-3 star hotel at most. We had expected a lot more as it was nearly 400 Euros for the 2 nights. We won't be staying here again - there has got to be better value in Florence.", "Date": "May 30, 2007", "ReviewID": "UR456975281", "Ratings": {"Service": "2", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "3"}, "Author": "lindacooper"}, {"Content": "Don't believe all the bad reviews! They almost ruined my trip! I read the reviews of the Hotel Ritz on TripAdvisor and was mortified! I knew I had no say so on the hotel choice since I was invited to go on this trip. I had read about dirty sheets and towels and since I am a clean freak and very particular about the sheets I decided to bring my own! I lugged a set of twin sheets and 1 bath towel and 1 hand towel all the way from MS to Italy just in case!! Well, I didn't even use them! We stayed here on March 4-9,2007 The room we had was #25 on the second floor and it was quite large. Therewas an entry foyer and a decent size bathroom with one sink and a tubwith a shower. The bedroom was large with 2 twin beds pushed together. There was an armoire, 2 nightstands, a desk and chair and a small fridge. There was plenty of light from the floor lamp, desk lamp and 2 bedside lamps. The sheets were CLEAN and even appeared new. The bedspreads looked new also. The towels were CLEAN and fairlythick. Our sheets and towels were changed everyday and the room cleaned and trash taken out. We didn't see any bugs. There was plentyof hot water for a long shower. The hair dryer was old and looked like a vacuum cleaner! It had heat but poor blowing power and it tookme 15 minutes to dry my long hair! My own travel dryer hardlyworked at all even with an adapter. We had a large window that overlooked the side street. The view from the window was the Arno River to the left and the spire of St. Croce to the right. Across thestreet was a lovely home with a flower strewn patio. Perfect!! We opened the window whenever we were in the room to let in cool air.Would not stay here in the heat of summer because I feel the AC wouldnot be good enough. Or maybe it was not turned on since it was still cool out. There is a pully cord behind the curtains that lowersa metal shade down over the outside of the window to help with sound and light.The street noise was loud but I was prepared and used ear plugs every night. My roommate slept fine without earplugs as did my aunt and uncle who were in room # 33. Their room was on the 3rd floor right on the front overlooking the Arno. It was a huge room with entry foyer, large bathroom with double sinks and plenty of counter space, glass enclosed tub with shower, and a large corner room with a window on front and another on the side street. It even had a king bed! So remember to request either room 33 or 25!! I did not care if the decor of the lobby was dated and the rooms plain---I came to see the beauty of Florence!! The breakfast wasn't fancy but was enough to help you get the day started. The staff was friendly and recomended several resteraunts and even a good place to get gelato. They even parked and fetched our rental car when we needed it. The location of the Hotel Ritz was great! St.Croce is but a few blocks away and the Ponte Vecchio and Uffizzi are a straight walk down the main street. I would stay here again. I would recomend it. I regret letting all the negative reviews on this sight almost ruin my trip! Some people just like to complain about everything. Our hotels in the US spoil us. This is Europe and things are different. Go for the food, wine and art and architecture and enjoy yourself!!", "Date": "Mar 23, 2007", "ReviewID": "UR184699400", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "HRo"}, {"Content": "Filthy I have to concur with earlier reviews that noted the condition of this hotel. A 4 star hotel that was this dirty? Dirty linens, bathroom, crumbs up and down the hallway. Window with alleged view literally crusted over with crud. My advice is to do a little digging and for the same price there are way better pensiones and hotels that are, I might add, much closer to the center of things in Florence. There are many places in this city that are beautiful and inspiring. Trust me, the Ritz isn't one of them.", "Date": "Dec 29, 2006", "ReviewID": "UR925226445", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "MarilynnW"}, {"Content": "Great location, 3 star standard don't know how it's got 4 though! Stayed here for 3 nights last weekend, the staff were very helpful and accommodating, and the room was fine, very spacious and had beautiful views. Great location, very close to the centre of everything. Only downside was the noise of the traffic, no double glazing or sound proofing here, traffic noise was so bad we had a lot of trouble sleeping, definitely bring earplugs if you can't sleep through noise. Hotel itself is a bit shabby, could do with new furniture in lobby, new carpet, it's a bit dirty and worn. Room was fine though, clean and warm. Would rate it three stars, definitely not four, who decides these things??", "Date": "Dec 5, 2006", "ReviewID": "UR289492714", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "twinkletwinklelittle"}, {"Content": "Good Location, Value for Dollar       River view from room", "Date": "Oct 18, 2006", "ReviewID": "UR778505542", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "ReaganNelson"}, {"Content": "Good Hotel - welcoming staff Nice staff at front desk. Very helpful. Nice clean room with view. Good quality for the price.", "Date": "Mar 9, 2006", "ReviewID": "UR726671338", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Excellent stay I had a positive experience at the Ritz. It's not a big international chain hotel, but the rate wase very convenient for the spacious room. The view from the room was great. The hotel was very clean and staff was very friendly to me. I wonder why other people comlain about this.", "Date": "Feb 17, 2006", "ReviewID": "UR294472147", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "This is a Dump I cannot understand why this hotel would have 4 stars. There are no more than 15 inches from the end of the bed to the wall, so one must step sideways to reach the far side of the bed. The drop down table also blocks movement in the room, but it is the only flat surface beside the bed so at times one must have it down. The bathroom is beyond describing here. It has been years since I have stayed in a place like this and hope I never repeat the experience.I was disappointed in the rating system used for this hotel and think we were misled. The hotel was shabby, but not shabby chic--just shabby and unkempt appearing.The staff had no interest in making the guests feel welcomed or significant. Everything seemed to be a great deal of trouble for them. It was no problem to leave early!", "Date": "Feb 9, 2006", "ReviewID": "UR144135955", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "Travellin' More"}, {"Content": "terrible hotel We stayed in Frorence few days. We were going to stay the terrible hotel but the room was so dark and noisy. Front desk women was really rude and mean. They never listen customer's complain. Breakfast was poor nad horrible. So we decided to stay the terrible hotel only one night and moved to the HOTEL PRIVILEGE which located in the next block from Ritz. HOTEL PRIVILEGE is little cheaper than Ritz but everything was so perfect. Front desk gentleman is so friendly and kind. Breakfast was excellent and room was big.", "Date": "Jul 7, 2005", "ReviewID": "UR874094807", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "This place was fine in 2002 We stayed one night at the Ritz in the Spring of 2002. Despite the negative reviews from people who stayed here more recently, we found the accomodations satisfactory. For about $150, we got a decent size room on an upper floor with a outstanding view of the Arno.I will admit that the hotel was kind of old and perhaps has degraded since our stay a couple of years ago.But my rating is above average based on the value and the view.", "Date": "Sep 10, 2004", "ReviewID": "UR517853693", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "the worst hotel on our trip We stayed at the Hotel Ritz in April 2003. Let me gest say that one of the rooms did not have a shower curtin in the shower which the water went everywere! The breakfest was gest ok.... and the whole hotel except our room smelled like old cigerets.", "Date": "Aug 30, 2004", "ReviewID": "UR366464565", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Ritz on the Fritz Where to start? We booked for 6 nights and stayed one. AC broken. Toilet broken. Shower broken. Door would not close, let alone lock. Dreary as a cave, except darker and dirtier. Yes, there was a view of the Arno, albeit filtered through about a century of dirt on the window. Front desk staff nearly uniform in their indifference, not only to us, but apparently to many other guests as well, from the complaining we heard in the lobby.Fortunately, the one thing in our room that did work was the phone. So we moved to the Bernini which, for the same price, had all the qualities one looks for: graciousness, charm, cleanliness, and a courteous and helpful staff. I would also add that the location is much better and more central than the (F)ritz.", "Date": "Jul 14, 2004", "ReviewID": "UR817436324", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "CollegeProfBayArea"}, {"Content": "A big disappointment Stayed at the Hotel Ritz several years ago based on favorable reviews. It was very disappointing considering the 4 star rating and positive spin given by reviewers. Our small room opened to an airshaft, had torn carpet and holes in the wall. The beds were on cheap metal frames with mediocre mattresses. Lighting was virtually non existent, one small nightstand lamp in the entire room. The refrigerator was so noisy we had to unplug it at night. The bathroom looked like it was decorated in the 60's. No closet, just a small armoire with two hangers. And the staff.... terrible. Very unfriendly, unhelpful and almost hostile. They routinely glared at customers for no apparent reason. All in all, a negative experience.", "Date": "Jun 6, 2004", "ReviewID": "UR122336657", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "ontravel"}, {"Content": "Ritz is the pitts I agree. Ritz is the pitts. My husband and I spent 5 days in Florence while we were on our honeymoon. There was water damage (visible stains) around the window in our room, visible water stains on the ceiling, the wallpaper peeling, the bathroom was dirty and smelly, and there were bugs in it. Like the other reviewer we do not believe they vacumed. When we complained, we had to argue for over half an hour and threaten to leave to get another room. The other room was only slightly better. The reason that they gave us for giving us this room was that we wanted a view of the Arno (our agent requested it because of our honeymoon). Then a bus tour came through with high school kids who ran up and down the halls all night yelling. We had a travel agent and I had to call him several times. We should have just left the first day when we saw the room. I am sorry that we didn't but it involved moving our rental car to another space, etc. etc. It was so bad we took pictures to show our travel agent so that he does not recommend it to anyone.  Also, the breakfast was horrible. We eneded up going to the Pastacerria in the Piazza Del Republica every morning. They even had a nasty breakfast woman who yelled at us for sitting at a table for three when we only had two people. When we were leaving I saw an American at the desk complaining about his room and I felt like telling him to just leave and change hotels.", "Date": "Jan 6, 2004", "ReviewID": "UR514727828", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Good location, noisy street We just got back from a 3 week vacation in Italy and stayed in Florence for 2 nights. I picked the Ritz because of its relatively moderate price and its location near the river. I requested a room overlooking the river because I thought the views would be worth it. The views were nice, but the road turned out to be very noisy. Our room was large. The matrimonial bed was equivalent to a queen. The rooms have refrigerator bars and A/C which is controlled by the hotel but was ok - Milan was experiencing a heat wave. Santa Croce, Uffizi, and the Ponte Vecchio are short walks away. Across the river is the Piazella Michelangelo which offers a great view of the city. We exited the autostrade at Firenze Sud and found the hotel easily. We left our car in a nearby parking garage. Good for its intended purpose. Would use again.", "Date": "Jul 1, 2003", "ReviewID": "UR980680817", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Not the pits, but close We stayed at the Ritz for three nights in May 2003. While I don't agree that it was the pits, it could have been better. The hotel is right on the Arno and our room had an excellent view. The room was large, with good water pressure (I guess this is important to alot of travelers), and the decor was acceptable. The major problem was the noise - Vespas scooting by day and night - couldn't get a decent night's sleep. Also, there were cleanliness issues - my suitcase was covered with dust when I repacked it after three days, and I never saw nor heard a vacumn cleaner. The staff was helpful, but not overly accommodating. The breakfast was basic - croissants, fruit, cereal. I wouldn't stay there again or recommend it to anyone, but I also did not feel the need to change accomodations while I was there. It is close to Santa Croce (an excellent church to visit) and some fine eating establishments. Also a short walk to Ponte Vecchio.", "Date": "Jun 5, 2003", "ReviewID": "UR862899011", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Ritz is the Pitts Travelers FYI. We stayed only one night in this hotel and were very dissatisfied! There are visible stains, holes in the walls, torn carpet, cracks in the ceiling, unprofessional staff (one person in jeans and t-shirt), ugly old furnishings, and a terrible urine smell in the hallways. By far the worst hotel of our trip with the highest star rating (4 stars). There are many other nice hotels along the Arno that are closer to the Ponte Vecchio for the same price, stay in one of those!", "Date": "Jul 9, 2002", "ReviewID": "UR657305331", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "Un desastre, ni merece una estrella   showReview(23344703, 'full');", "Date": "Jan 7, 2009", "ReviewID": "UR547183085", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1", "Value": "2", "Rooms": "1", "Location": "3"}, "Author": "RINLO"}, {"Content": "C'猫 di peggio, ma c'猫 anche di meglio   showReview(23275900, 'full');", "Date": "Jan 5, 2009", "ReviewID": "UR532754786", "Ratings": {"Service": "5", "Business service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2", "Value": "3", "Rooms": "2", "Location": "4"}, "Author": "bruco142"}, {"Content": "malo y sucio       pared con papel despegado", "Date": "Oct 28, 2008", "ReviewID": "UR828249215", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "2"}, "Author": "elturistajusticiero"}, {"Content": "H么tel bien situ茅 et confortable       Vue d'une chambre donnant sur l'Arno", "Date": "Sep 21, 2008", "ReviewID": "UR861898586", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "4", "Location": "4"}, "Author": "Dizzy1977"}, {"Content": "Poca pena!       Ba帽o Hotel Ritz Florencia", "Date": "Apr 8, 2008", "ReviewID": "UR555796075", "Ratings": {"Service": "2", "Business service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "3"}, "Author": "NapsCatalunya"}, {"Content": "4 stelle ???       tv", "Date": "Jan 31, 2008", "ReviewID": "UR566738860", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1", "Value": "3", "Rooms": "2", "Location": "4"}, "Author": "__Dave-Torino__"}, {"Content": "Hotel di stampo antico...   showReview(11336809, 'full');", "Date": "Nov 19, 2007", "ReviewID": "UR642872954", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Estancia normal       Terraza", "Date": "Jul 31, 2007", "ReviewID": "UR889887885", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "golfregoneta"}, {"Content": "锛斻儎鏄熴儧銉嗐儷銇壊銇伅...   showReview(21802699, 'full');", "Date": "Jul 9, 2007", "ReviewID": "UR745601444", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "灏忋仌銇儧銉嗐儷銇с仚銇?..   showReview(21802539, 'full');", "Date": "May 18, 2007", "ReviewID": "UR345155382", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "鏈€涓婇殠銇窛娌裤亜銇儴灞?..   showReview(21802506, 'full');", "Date": "May 9, 2007", "ReviewID": "UR988860038", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銇俱仛銆併偣銈裤儍銉曞叏鍝°亴...   showReview(21801986, 'full');", "Date": "Nov 5, 2006", "ReviewID": "UR320399651", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "El hotel nos encanto por su...   showReview(11336810, 'full');", "Date": "Sep 19, 2006", "ReviewID": "UR378442393", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "閮ㄥ眿銇倛銈娿伨銇?#x201d;   showReview(19158441, 'full');", "Date": "Aug 8, 2006", "ReviewID": "UR983877376", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "1", "Location": "-1"}, "Author": "lass="}, {"Content": "Non e' un 4 stelle come...   showReview(11336811, 'full');", "Date": "Jan 12, 2006", "ReviewID": "UR887279490", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "銈点兗銉撱偣銈傘€侀儴灞嬨伄瑾?..   showReview(21800420, 'full');", "Date": "Aug 20, 2005", "ReviewID": "UR306872533", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "Hotel vieillissant manquant...   showReview(11336812, 'full');", "Date": "Jun 6, 2005", "ReviewID": "UR962745539", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Era per me una delusione che la...   showReview(11336813, 'full');", "Date": "Aug 2, 2004", "ReviewID": "UR150537459", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d203967-r20268433-Hotel_Ritz-Florence_Tuscany.html", "HotelID": "203967", "Price": "$170"}}