{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "england", "Title": "“Excellant Hotel”", "Author": "robhiam", "ReviewID": "UR139949396", "Content": "Stayed there 2 nights and could not fault it the staff were very friendly and so helpful, the rooms were spotlessly clean and everthing worked, and at that price one of the best hotels we have ever stopped at", "Date": "September 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "Cape Girardeau, Missouri, United States", "Title": "“Friendly staff and clean motel at low cost”", "Author": "Brenda H", "ReviewID": "UR139396180", "Content": "Great place to stay if watching cost. The staff is super friendly and the motel was clean. Nice to have coffee at any time. Location on Wildwood was great as the motel was near a lots of attractions yet not on the too, too busy Hwy 76. Motel has a good hot breakfast to start the day. We will definately stay here again.", "Date": "September 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Starkville, Mississippi", "Title": "“Wonderful stay at clean, friendly hotel”", "Author": "Cathy653", "ReviewID": "UR139201742", "Content": "Staying here was almost like a trip back in time in the sense that the staff really cared about making our stay positive. We were in Branson to pick up our child from Kanakuk, and this hotel was a convenient location to K-West. The room was clean and comfortable, and we appreciate having breakfast there. We would stay there again.", "Date": "September 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Conway, Arkansas", "Title": "“Friendly staff, excellent accommodations”", "Author": "jdub5827", "ReviewID": "UR138553950", "Content": "Hotel was outstanding. Owners very outgoing and accommodating. Lobby area was like your living room at home. Gatherings there in the evening to talk, meet new people and even had a jam session one of the three nights we spent there. Had a guitar and violin session. Rooms were very clean and comfortable. Rates were about 1/3 less than what I have been paying at other hotels of lesser quality.", "Date": "August 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Siloam Springs, Arkansas", "Title": "“Will Stay Again...”", "Author": "Sarah V", "ReviewID": "UR138100515", "Content": "We stayed one night, but will definitely stay again. Great customer service and room rate. Pet friendly - that's a biggie for us, as it's difficult to find a pet friendly place to stay that is clean and doesn't charge you an arm & leg to have your pet there. Good breakfast. Not the Four Seasons, but a very good room for a very good price. Incidentally, I left my wedding ring in the room and didn't notice it until we were an hour away. We called the hotel, they promptly checked the room, found my ring and kept it safe for us until one of my relatives could go pick it up. I really appreciate their honesty & willingness to go the extra mile for us.", "Date": "August 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fredericksburg, Iowa", "Title": "“Knights Inn at Thousand Hills”", "Author": "Duane B", "ReviewID": "UR137533225", "Content": "Great place to stay. We stayed for four nights. The outside area was well maintained. Located in a quiet part of Branson. The rooms were small but neat and clean. Beds were very comfortable. The staff was very helpful and friendly. Excellent breakfast. I would stay at this motel the next time I am in Branson.", "Date": "August 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mountain Grove, Missouri", "Title": "“Excellent Stay”", "Author": "Missy C", "ReviewID": "UR137197139", "Content": "My husband and I spent the weekend in Branson at this hotel.. The staff was very friendly, and the check in and check out times were great. Our room was a typical room with a king size bed with tv, shower, and sink. The room was not huge, but with just the two of us we did not need a huge room. The room was kept clean, and overall we had no issues at all. The location was great, and the cost was good as well. I would reccommend this hotel, and I will probably stay there again next time I travel to Branson.", "Date": "August 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Toledo, Ohio", "Title": "“Super clean”", "Author": "howehome1", "ReviewID": "UR137029452", "Content": "Super clean motel. Friendly staff. Typical breakfast for a motel of that price range, but they also had eggs and biscuits & gravy. Just a little hard to get to but worth it. Not too far from the main road. Highly recommend.", "Date": "August 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Arkansas", "Title": "“Customer is King”", "Author": "mel2b59", "ReviewID": "UR136532451", "Content": "We stayed two nights when we went to check in they had us arriving and checking out on a different date but the nice guy at the front desk fixed that for us. After receiving our keys we went back out to the parking lot to get our stuff out of the car and I realized I forgot to mention about the mircowave and frig. I went and stopped at the front desk and mentioned that to the guy and some older lady was very rude asking \"What to you want a mircowave for? Her tone was not very friendly. I explained it was stated on website you could request one. SHe blurted out if you need anything warmed up we have a mircowave down here. If mircowaves arent available to request in y our room then take that off the website simply as that. IF that lady was an owner she needs to learn some customer service skills. Does she not realize without customers checking into her motel she doesnt make money and to treat a paying customer like that is terrrible .I have been in customer service relations since 1977 and that was the wrong approach. I was shocked my 14 year old even commented on how rude she was about the mircowave situation. Other than that everything was good. we had a nice time didnt have to run into that mean lady which was a plus. Everyone else did a great job friendly nice. IF that lady was an owner she needs to take some tips from her staff members A.S.A.P.", "Date": "August 7, 2012"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Wentzville, Missouri", "Title": "“Worst Customer Service Ever”", "Author": "btreading", "ReviewID": "UR136511377", "Content": "Owner and Manager are the rudest people we have ever encountered. They are rude to their paying customers and employees alike. They not only treat you like dirt but they talk negatively about their customers to other customers. Totally unprofessional! Putting up with these people is not worth the discount. If they had a 4 star hotel it would not have been worth the discount to put up with these people. Lastly, I noticed the place had an unsavory smell they tried to cover with fragance. Someone with Asthma or other breathing conditions could not have stayed here. Spend a few more dollars and get treated with the respect a paying customer deserves. My heart goes out to their sweet employees.", "Date": "August 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "5", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Harrison, Arkansas, United States", "Title": "“Would not recommend”", "Author": "gmy3359", "ReviewID": "UR136400573", "Content": "Stayed one night this past Friday. The lobby and outside amenity's of the hotel were very clean and nice. The room however was tiny and the bathroom was extremely small, it was a toilet and stand up shower and only room for pretty much turning around and I am a small person. The room being small didn't bother me for the price, but the smell in the room was terrible. Not sure if it is because the hotel is pet friendly and or what but it was awful. The inside of the shower door was covered in mold and the back of the toilet seat was broken and had been taped up. I can't say this hotel is great for the value because I have stayed in many hotels in this price range and not had these problems at all. Was very disappointed and will not stay again.", "Date": "August 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Non-smoking smelled like smoke, but they take pets”", "Author": "canard314", "ReviewID": "UR136062068", "Content": "My husband and I were in need of an affordable, clean hotel that took pets near Indian Point. Oddly enough, choices are few and far between in such a family-oriented town. I chose Knights Inn at Thousand Hills because they're rates were quite reasonable and the location was decent for getting in and out of Branson (we actually try to avoid Branson and stick to the lake). Compared to other places we've stayed in/near Branson, this place is definitely the best for pet-friendly hotels. Plus, they don't charge an extra fee for pets (at least that I saw...other reviewers are mentioning a pet fee). I did note that we had two dogs on my reservation. My only complaint is that we had a non-smoking room but it was most definitely a smoking room at some point. I got use to it, my husband wanted to complain. But the room was clean and I especially liked how the underside of the beds were blocked off so we didn't have to worry about what our dogs would find under there. There isn't a lot of grass but I don't expect them to cater to that aspect. I was glad they put us on the first floor with quick access to the door to minimize disruption to other guests. We'll definitely be back and hopefully the smoke smell will be gone by then. Staff was extremely friendly. Breakfast was fine. Coffee in lobby was good and available at all hours.", "Date": "August 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Van Buren AR", "Title": "“Good rate, great breakfast, good location”", "Author": "Cecil B", "ReviewID": "UR135838605", "Content": "We stayed two nights, and enjoyed the experience. The only not-so-good issue we encountered was the small size of the swimming pool. Otherwise, everything was better than expected, including breakfast. The staff was very friendly and helpful. We will stay again.", "Date": "July 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Linden, TN", "Title": "“Great Stay!”", "Author": "LadyByrd115", "ReviewID": "UR135721006", "Content": "We decided to stay here for two reasons. The first being the continental breakfast and the second being the reasonable pet fee. The room was very clean and odor free, the breakfast was good <sausage gravy, biscuits, eggs, cereal, yogurt, bread, bagels, juice, coffee, and milk>, the staff was friendly, AND THE LOCATION was more than expected. We were right off the main strip, within walking distance of food and attractions. Why pay twice the price for half the product? Knights Inn at Thousand Hills was a great choice and we look forward to returning.", "Date": "July 29, 2012"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Rooms": "1", "Value": "1"}, "AuthorLocation": "Carthage, MO", "Title": "“Will NEVER go back!”", "Author": "Debbie A", "ReviewID": "UR135663731", "Content": "My husband and I booked 1 night at this hotel and when we arrived, the hall smelled terrible and so did the room. The carpet was filthy,one of the pillows had a wad of hair on it and the shower was disgusting. The room was the smallest we had ever stayed in. We left. We did NOT stay. We live a couple of hours away and went back home. We just wanted to get away for a couple of days.", "Date": "July 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Springfield, IL", "Title": "“Good value stay.”", "Author": "mimimingo", "ReviewID": "UR135626363", "Content": "This hotel was fine for our 7 night stay. GOOD POINTS: Back in March when I called to make reservations Ed was very helpful. He told me to make reservations on line in order to get a great price (and it was!!). The hotel is pet friendly with a king size bed. Most pet friendly hotels only give you queen (or double) beds. There was no nightly pet charge (but you have to keep your dog crated when you leave the room, which we do anyway). We did learn they now have instituted a $10.00 per night pet fee. The staff is super friendly and will help any way they can. The shower was large with great water pressure and the water temperature was constant - not hot one minute then cold the next. Our room only had a shower, no tub. We called a few days before our arrival and asked for a refrigerator (for our dog's medication). It was in our room when we arrived. The bed was comfy. We had no problems getting on the Wi-Fi in our room using our Nook Tablet. We have never stayed in a room where the A/C was so quiet. You hardly knew it was running, and it kept the room super cool. We also found the location to be great. NOT SO GOOD POINTS: Although the room was clean it could use some updating; too many different patterns on the carpet, drapes, bedspread and mismatched colors. The room carpeting had several stains on it as did the hallway carpeting. The pet rooms are in the back of the hotel; there is no security door to allow only hotel guests in (by using their room key to access the door). Pets are not allowed to come in through the hotel lobby. Although the free breakfast was good, providing some type of fresh fruit (oranges, apples, bananas) would have been nice. We would probably stay here again since they are pet friendly.", "Date": "July 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kansas City, Kansas", "Title": "“Great time”", "Author": "Paula C", "ReviewID": "UR135182228", "Content": "the staff was very friendly and the hotel room was clean. every morning the man that cleaned the room spoke to us and always asked if we needed anything. My girls had a great time in the pool. It was very clean and welled maintained. Our room was very clean with no stained sheets or pillow cases. Breakfast was always hot even when we came down close to the end of breakfast.", "Date": "July 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ruston, Louisiana", "Title": "“Another Great Stay”", "Author": "Brad E", "ReviewID": "UR135142872", "Content": "Thanks for another great stay at Knights Inn. We had a great time thanks for making us feel at home amd part of the family. See you in Dec.", "Date": "July 23, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“Great stay but didn't keep their promise”", "Author": "snoopyblossom", "ReviewID": "UR135092593", "Content": "The hotel was great- very clean, great location & breakfast! We checked out of the hotel and had no problems. However we were 45 minutes away when my 3 year old tells me that he forgot his homemade beloved Cars pillow at the hotel. I immediately called the hotel and tell the front desk what happened. They ask me if I would like to come back and get it. I tell them no as I am already 45 minutes away and would they mind sending it to me. They said they would and she would go right down to the room and get it. Well my 3 year old has been waiting everyday (a month and a half) for the mail to come to see if his beloved pillow is in it. So far no luck! If you tell a customer you are going to send something, especially a child, then please do it!", "Date": "July 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Little Rock, Arkansas", "Title": "“What a Great Surprise!”", "Author": "Tony B", "ReviewID": "UR134665059", "Content": "Well when we first got there we found the motel and room pretty organized and clean. The front desk lady was pretty funny and we enjoyed her banter. The only thing that bothered us really was the dirty carpet in our room to include an old bobby pin. We told the front desk lady about the carpet and she had our carpet professionally cleaned while we were out!! Pretty good service!!!! We'll definitely go back. They've won our business. Also, very good free breakfast with biscuits and gravy and very good nightly rates too.", "Date": "July 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Versailles, Indiana, United States", "Title": "“GOOD STAY!!!!”", "Author": "Midge1_12", "ReviewID": "UR134215531", "Content": "The hotel was clean, very good continental breakfast. The staff & visitors were friendly. Hotel was walking distance to the main road. Could walk & do some looking around. Would go back to Branson & stay there again. This was our first trip to Branson. Very pleasant experience. Didn't see a fitness center or no restaurant. Randal & Brenda Brooks Versailles IN", "Date": "July 12, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Broken Arrow, Oklahoma", "Title": "“Rude and disrespectful”", "Author": "Laura G", "ReviewID": "UR133953228", "Content": "Horrible customer service. When I made an inquiry about an additional charge on my bill, I was treated rudely and mocked. Horrible experience. Will never stay here again.", "Date": "July 9, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Hotel OK/ Rude and disrespectful owner”", "Author": "KGbaok", "ReviewID": "UR133933226", "Content": "We go to Branson often, and each time there are a few less people there than before. I am beginning to understand why after a phone call I just heard my wife make. We got a bill in the mail after our stay for $15 additional dollars... No big deal, but when my wife called and asked for an explanation, she was told it was because our son is 14, OK fine no big deal, but nobody mentioned this while we were there or when we checked out. And then the Jerk tells my wife that she should read, and gets disrespectful and then proceeds to tell her, get this, to write as many bad reviews as she wants. What a punk. I reviewed fairly because I believe in integrity. Their sign says Veterans always welcome, well this veteran won't be back.", "Date": "July 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stillwater,OK", "Title": "“Clean, caring, and comfortable!”", "Author": "Brian B", "ReviewID": "UR133913805", "Content": "The whole place - the lobby, the room, the pool, and even the parking lot was clean and beautifully kept. The staff was friendly and responsive to every request and Ed and Betty were fantastic hosts!! Their attentiveness to details made my family feel welcomed, valued, and comfortable. They truly went the \"extra mile\" to make our trip at Branson, and at their motel, a wonderful experience!!", "Date": "July 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wylie, Texas", "Title": "“Great Value”", "Author": "Steven P", "ReviewID": "UR133725214", "Content": "Front Desk people were friendly and helpful, Price was outstanding, Hotel is old, but still a good place to stay, location good to get to either end of the 76 Strip.", "Date": "July 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Champaign, Illinois", "Title": "“Fantastic stay!”", "Author": "Barbiegirl10", "ReviewID": "UR133724649", "Content": "We stayed here while visiting Branson and were extremely impressed with the outstanding customer service, cleanliness of the room and the hot breakfast. We would definitely recommend to friends and family and stay here again.", "Date": "July 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Jonesboro, Arkansas", "Title": "“Excellent stay/Awesome customer service”", "Author": "Amber S", "ReviewID": "UR133680327", "Content": "We stayed 3 nights at this hotel, it was an awesome value and in a great location. The staff was amazing, they accommodated any needs we had! The rooms were very clean and a nice size for a standard hotel room. The beds were comfortable. They serve breakfast; eggs, biscuits & gravy, toast, cereal, muffins, ect.. It was a nice extra!!! I would definitely stay here again!", "Date": "July 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hot Springs, Arkansas, United States", "Title": "“Wonderful place to stay.”", "Author": "Niecy63", "ReviewID": "UR133647768", "Content": "We decided to book with this hotel, because of all the good reviews. We are glad we did, we were not disappointed. The people are very helpful, and friendly. The rooms are very clean. The showers are a good size. I take long showers, and I never ran out of hot water. The water pressure was great. I like the idea of the sink outside of the bathroom. I was able to get ready, while my husband was taking a shower. The pool was very clean. There is someone at the front desk all the time. The breakfast was just your normal breakfast. You do get a good food selection for the price your paying for the room. The breakfast was eggs, sausage gravy, biscuits, bagels, toast, dry cereal, oatmeal, yogart, different package muffins, coffee, milk, hot tea, and orange juice. They keep it fully stocked from 6am -10am. They give you a number to call for discount tickets, which is not connected to timesharing condos. The tickets are delivered to the hotel. I will be using this hotel everytime I come to Branson.", "Date": "July 6, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Bentonville, Arkansas", "Title": "“great price and great stay”", "Author": "rad2010", "ReviewID": "UR133213564", "Content": "Rooms were clean and tidy. The baths were also clean. They were a bit poky, but comfortably spacious. The hotel is very close to a place for outdoor golf as well as a pan era bread which is pretty much within walking distance. Ride the Ducks is also within .5 miles from the hotel and the hotel is located close to many other attractions on Hwy 76. The hotel has a good breakfast in the morning, the staff is very friendly and hospitable and I would def. recommend this hotel to others. The hotel also seems to be undergoing some renovations, so some mornings it was a little noisy because the room just besides ours was getting renovated! but it is still a great stay for the price!", "Date": "July 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pea Ridge, Arkansas, United States", "Title": "“Great Place to Stay”", "Author": "Michelle H", "ReviewID": "UR132989258", "Content": "My husband and I stayed 2 nights here on our 1 year wedding anniversary. We absolutely loved the place. The service was wonderful, everyone bent over backwards to help you. They were all so friendly. The rooms were very nice and clean. The free breakfast was great a well. We had a super time and plan on making this our Hotel of choice for all of our Branson trips in the future.", "Date": "June 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Great find!”", "Author": "SSWTexas", "ReviewID": "UR132809728", "Content": "We had high expectations from the reviews we read about this hotel before booking. We were NOT disappointed! We wanted to stay a few nights in Branson, but didn't want to spend a ton of money for a decent hotel. We loved the friendliness of the staff, cleanliness of the rooms and the breakfast was actually better than the Holiday Inn's freebie fare; i.e. biscuits that were warm, soft and fresh vs warm, hard as rocks and dry. It was also closte to good restaurants and attractions; just off the main highway (quieter) but still in the heart of everything. We will stay here every time we visit Branson.", "Date": "June 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Frederick, Oklahoma", "Title": "“What a great value!”", "Author": "Felisha14", "ReviewID": "UR132753142", "Content": "We stayed one night in Branson while picking our child up from Kanakuk. We wanted to keep costs down and took a chance at the Knights Inn. What a treat! The rooms were spacious and very clean as well as a great free breakfast. The staff was super friendly and very helpful. I will definitely stay here again next year.", "Date": "June 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Outstanding”", "Author": "DTClaybrook", "ReviewID": "UR132730339", "Content": "We could not have been more pleased in our choice to stay here. We read the reviews about the cleanliness of the rooms and property, and friendliness of the staff, and decided to give it a try. My wife, awhile back, used to work as a cleaning lady at a hotel, and she had nothing but compliments for the room. A/C worked great. Even the pool was spotless. They supply all the towels you want, including down at the pool area. An added bonus was the hot breakfast every morning which included scrambled eggs and biscuits and sausage gravy, along with the usual hotel breakfasts items. They definitely have our business when we come to Branson in the future.", "Date": "June 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oklahoma City, Oklahoma", "Title": "“Great place, excellent value”", "Author": "traveldad46", "ReviewID": "UR132690880", "Content": "You never know when you find a great rate on the internet what you will get. This place definitely delivered above expectations. At check in there was an error in the room reserved for us, the front desk person quickly solved the problem. The room was a little dated but clean and efficient. My only wish would be that there be a frig and microwave in the room. There is a microwave in the breakfast area however. The pool area was clean and plenty of towels were available. Using the colored routes makes getting around Branson much easier and the location is perfect near the middle of everything. The breakfast was a nice surprise, eggs and biscuits and gravy, plus the regular fare. Everyone seems to be friendly and hospitable.", "Date": "June 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fairfield Bay, Arkansas", "Title": "“great affordable place to stay”", "Author": "russell e", "ReviewID": "UR132689387", "Content": "First time at knights Inn,room was clean and air was working great.Beds were comfortable. Very impressed with the hospitalitythere! Breakfast was great with added hot scrambled eggs,bisquits and gravy.i was impressed with houskeeping making beds everyday.Outdoor pool was great and it is opened 24 hrs.a day. A must stay when you are on a limited budget. Employees always there to help you with a smile and that goes along way.When guest get treated like this,people will always come back. WE SURE WILL!", "Date": "June 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bella Vista, Arkansas, United States", "Title": "“Great Bargain for the Money”", "Author": "Andy M", "ReviewID": "UR132668917", "Content": "Very clean, better than average breakfast, great location and some of the nicest staff we have ever encountered. We go to Branson several times a year and will probably stay here most of the time. Cannot think of any negatives.", "Date": "June 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great stay for a great value”", "Author": "Skowtko", "ReviewID": "UR132601276", "Content": "If you're looking in the bargain range, pick this one! Clean, hot breakfast, awesome owners - rooms are older, but nicely maintained. Highly recommended!", "Date": "June 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Grove, Oklahoma", "Title": "“Great place to stay!”", "Author": "Tom P", "ReviewID": "UR132484518", "Content": "Honestly, we read all the reviews but we were still a little nervous since frankly the hotel is SO affordable. We were NOT disappointed. The owners and staff were wonderful! We got there early and they couldn't have been nicer. The breakfast was really good. I don't remember ever getting a free scrambled eggs, biscuits and gravy breakfast with any hotel stay. They gave us information about easier ways to get around the traffic and were just very helpful all the way around. The rooms were so very clean and comfortable. We also liked the fact that the second floor had an area with a couch, chairs, coffee table etc. if you wanted to sit out there and read or just relax with a cup of coffee. (first probably did also, but we were on the 2nd) We not only plan on staying again, we would highly recommend it to anyone planning a trip to Branson!", "Date": "June 21, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Little Rock, Arkansas", "Title": "“Reviews mislead me !”", "Author": "secondhome247", "ReviewID": "UR132190283", "Content": "Management did NOT go out of their way to accomodate our family. Yes, we showed up 2 hours early and were turned away. It was a 4 hour trip. When we came back, our reservation had been CANCELED and we had to wait over 30 minutes to get that straigtened out. We were given a room on the smoking floor that allowed pets. We asked for NON-smoking rooms. Had to wait nearly 45 minutes to switch rooms. NOT friendly at all Betty Sue. Beds are uncomfortable. Door would not latch closed. Rooms are noisy. Will not ever stay there again, and will pass on bad experience to anyone who asks for recommendation.", "Date": "June 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Yantis, Texas", "Title": "“prtjtp”", "Author": "paula l", "ReviewID": "UR131970105", "Content": "nice hotel, very friendly staff. The beds were very uncomfortable my back hurt everymorning when I got up", "Date": "June 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Value”", "Author": "Dastarksfam", "ReviewID": "UR131904968", "Content": "The hotel was in a good location to the attractions on the strip. The hotel itself was basic but nice. It was a great price. The staff was one of the best that I have encountered in all of my travels. I would stay again.", "Date": "June 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maryville, Tennessee", "Title": "“Great Place To Stay”", "Author": "nes1941", "ReviewID": "UR131709859", "Content": "While reviewing ratings of motels prior to making reservations in Branson, I saw many excellent ratings for this Inn and really wondered if the ratings were valid as my previous experience with a Knights Inn at a different location had not been that good. I decided to take a chance and make a reservation and from the moment that we arrived at the check-in desk, we knew we had made the right decision and never regretted our choice. One of the staff assisted us with our luggage and our request for a refrigerator in the room was taken care of in a prompt manner. The many choices for a hot continental breakfast of eggs, biscuits, gravy sausage, etc., or cereal, rolls, toast, fruit, yogart, was indeed better than average. Our room was extremely clean and the managers and staff were very friendly and concerned that our stay with them was totally satisfactory. We will definitely return to this Inn the next time we are in Branson.", "Date": "June 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“Excellent find!!”", "Author": "William E", "ReviewID": "UR131643877", "Content": "The staff at Knights Inn were very nice, making us feel very welcome. After describing our party consisted of both two seniors and two children ages 2-4, they offered numerous suggestions for activities. The use of space in the room was great with pocket doors, allowed ample room for two children to not feel confined. My four year old daughter loved taking showers after the first night and proceeded to take two in 10 hours with no activities other than sleep to interrupt the activities. Close enough to the strip to enjoy the town, but very quiet at night . The breakfast was excellent also. Only issue is check the door to the room when you get there, our two doors needed modifications in order to be securely closed. They were very quick to correct it though.", "Date": "June 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rolla, Missouri", "Title": "“Very Good Experience”", "Author": "charleyjoe", "ReviewID": "UR131347061", "Content": "Great value, close to all the attractions, clean room, better-than-average continental breakfast (microwavable sandwiches, donuts, etc.) My only complaint is this place is a wall-to-wall shrine to veterans and I felt a little out of place not having been in the military.", "Date": "June 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Oklahoma City, Oklahoma", "Title": "“Fantastic stay and great service!”", "Author": "Nicole R", "ReviewID": "UR131204168", "Content": "We had an amazing stay at Knights Inn. Friendly service from the time we arrived until the time we left. The staff was very helpful when it came to recommendations and the location of the hotel couldn't be more perfect. Off the main strip, but close enough for a short drive everywhere! We will definitely stay here when we return!", "Date": "June 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Missouri", "Title": "“Great stay, great price!”", "Author": "mightymouse217", "ReviewID": "UR130917535", "Content": "This was a great hotel! Very close to 76 so it was only minutes away from Tanger and the Landing. The people are absolutely charming and welcoming. Breakfast was great and included scrambled eggs, biscuits and gravy, muffins, etc. Rooms are not very big but are cozy. Great stay, will keep this one in mind when returning to Branson!", "Date": "May 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“This was our first stay but will not be our last!”", "Author": "cscolclasure", "ReviewID": "UR130747234", "Content": "This was the cleanest, most friendly place we have ever stayed. Our daughter was the one who told us about this exceptional motel. The hot breakfast was very good. The people were extremely accomidating. The beds were very comfortable. My husband and I have O negatives to say about this excellent motel. We are customers for life!!!", "Date": "May 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mesa, Arizona", "Title": "“Great Hosts”", "Author": "KeeneRO", "ReviewID": "UR130691103", "Content": "We stayed one night at the hotel and it was a pleasant experience. Our hosts were great and very informative. They gave us a lot of information regarding the area. Our room was clean and comfortable and central to duck boats & Andy Williams. They are very proud of those who served and show their support of veterans in the lobby of the hotel. As a veteran, it was great to see such support. Thanks and I would stay there again and would recommend this hotel to my friends.", "Date": "May 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cabool, Missouri", "Title": "“Another Great Stay”", "Author": "motraveler50", "ReviewID": "UR129875782", "Content": "We stayed here again last night for our 3rd stay since they opened, and had another wonderful stay. The owners and staff anticipate our needs and and are so nice and friendly. The rooms are exceptionally clean with good beds and pillows. Our room had new bedspreads and throw pillows, also new towels and wash cloths. They have a full breakfast with good scrambles eggs, sausage patties, biscuits and gravy, pastries, muffins, oatmeal, yogurt, cereals, breads, juice and coffee.", "Date": "May 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nicaletta", "Title": "“Great Place to Stay”", "Author": "Nicaletta", "ReviewID": "UR129672182", "Content": "This place was in a great location! The people working there were super nice and the place was clean! They gave us lots of great advise and directions You should definately stay there!", "Date": "May 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cleburne, Texas", "Title": "“The Staff are definately Royalty!”", "Author": "RLene M", "ReviewID": "UR129601335", "Content": "My Mother and two pet dogs stayed for several days recently at the Knight's Inn on Wildwood in Branson. We were SO well treated. The friendly, helpful and funny staff were always available to help out with whatever questions or needs we had. Yes, funny. They were not only warm, but had a great sense of humor. How fabulous is that!! We really enjoyed breakfast at tables set family style with little flower table cloths. We tended to congregate in the foyer or the breakfast nook of an evening for socializing. I would recommend this location to absolutely anyone for the safety, comfort and overall ambience. Plus, being on a budget, we really appreciated the more than reasonable rates! Wow, Knight's Inn, we are making you all our Branson go to place. Thank-you for everything!!", "Date": "May 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Grove, Oklahoma", "Title": "“Great Location”", "Author": "loveitorleaveit_76", "ReviewID": "UR129590672", "Content": "The location is perfect right off the strip. We felt kindof out of place because most of the people staying were senior citizens and not young couples with families. Room was nice and clean. Shower was nice. The only negative was the hard bed. Woke up with a backache. Overall good place to stay for the money. We didn't eat the breakfast or swim in the pool.", "Date": "May 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lawrence, Kansas", "Title": "“Clean, Quiet, and Comfortable”", "Author": "rdevans619", "ReviewID": "UR129526158", "Content": "Nice clean, quiet, and comfortable hotel located inh the heart of the action! For being so close to the famous Branson Strip and a wide range of other activities (did I mention the Lonestar Steakhouse and miniature golf course just across the street?) this property is very quiet and peaceful. The rooms are very clean and welcoming and the hot breakfast every morning is amazing! (Just wish they would serve it a little later... it is over at 9 AM) All in all a very affordable and comfortable stay in the heart of Branson. Would recommend this hotel to everyone staying in the branson area. (With the exception of families of 5 or more... the rooms are a little small and would make a family of 5 pretty well cramped!) Great owners and a VERY at-home welcoming feel.", "Date": "May 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Topeka, KS", "Title": "“OUR SECOND STAY”", "Author": "Treadman46", "ReviewID": "UR129382796", "Content": "We go to Branson 3 or 4 times a year. This was our second stay at the Knights Inn at Thousand Hills. The owners are present at all times during the day. Very pleasant people. Will do all they can to make your stay enjoyable. Reasonable rates. Clean, quiet rooms. Very close to all the activities. Great place to stay.", "Date": "May 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Marshfield, Wisconsin", "Title": "“Great Lodging in Branson”", "Author": "Elaine F", "ReviewID": "UR129309151", "Content": "Our recent trip to Branson was our first time staying at the Knights Inn at Thousand Hills. The staff was very friendly and helpful, they always knew us and were very personable every time we saw them, and by the time we left we felt like friends. The room was very clean, breakfast was good-very filling and fresh. We will definately stay here on future trips to Branson and will recommend it to family & friends.", "Date": "May 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tupelo, Mississippi", "Title": "“Wonderful lodging in Branson”", "Author": "SEtraveler53", "ReviewID": "UR129209806", "Content": "We choose this property for lodging after reading the reviews here. We were not let down. The management and staff are super nice and helpful. Our bed was very comfortable and the room clean. The hot eggs and biscuit breakfast was good too. My only complaint was the quality of the jelly served at breakfast(sorry I'm selective) but they were supposed to be upgrading it. Property has good location just off 76 with great back road route access to get to our shows quickly. Also the 1st floor is partly underground and is a good place of quick protection in case of bad weather. Our room was shower only which was fine with us as it is nice size shower. We left planning our next stay.", "Date": "May 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Crockett", "Title": "“First Time To Branson”", "Author": "Lourene D", "ReviewID": "UR128986765", "Content": "We were very pleased with the hospitality with our host and will be very happy to stay at this property again. Checking in was very easy and fast. The property is very clean and well kept. One of the best places we have stayed.", "Date": "April 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Missouri", "Title": "“Great Hospitality!!!”", "Author": "Mauigrandgal", "ReviewID": "UR128557683", "Content": "We loved our recent stay at this Knights Inn at Thousand Hills. Check in and out was a breeze. Ed and Becky were gracious hosts and the people that work for them were awesome too, we felt as if we were part of their family and for a few days we were :) This hotel is very clean and has a wonderful aroma that is heavenly. The beds was very comfortable and the room decor was up to date. Oh by the way....did I say..this hotel is clean :) so important!!! We loved having a small refrigerator in our room. Morning complimentary breakfasts were yummy! It was a real treat to stay at this place. Next time we come to Branson we will be staying with Ed and Becky! Thank you so much!", "Date": "April 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hot Springs Village, Arkansas", "Title": "“None Better”", "Author": "lobo0036", "ReviewID": "UR128547544", "Content": "5 stars not enough, extra clean, full breakfast, great service. SUPER people. We have stayed at a number of places in Branson but none come close to these folks. Stay there and you will be writing your own review. Get to know Ed and Becky they are super people who really care.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jonesboro, Arkansas", "Title": "“Hidden treasure”", "Author": "drbar7", "ReviewID": "UR128296884", "Content": "I have to say I was skeptable about staying at the Knights Inn for our family vacation in Branson,Mo but it was fabulous. I am reluctant to say how great our stay was for fear that when we want to go back there won't be rooms available but I can't keep this hidden treasure a secret. It is very affordable, has nice clean rooms, excellent morning meals, and the most warm, welcoming, hospitable owners you will find anywhere. The entire staff was courteous and helpful. If you need something, just ask and you will get fast solutions. On your next trip to Branson,Mo please give the Knights Inn at Thousand Oaks a try, you won't regret it. BR", "Date": "April 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Plymouth, Minnesota", "Title": "“An Awesome Hotel in Branson”", "Author": "Jean W", "ReviewID": "UR127333142", "Content": "Jim and I had a fabulous time at the Knights Inn at Thousand Hills in Branson, Missouri. What we noticed first was the amazing warmth and hospitality demonstrated by the owners, Ed and Becky. They made us - and all of the guests - feel like old friends. We became aware of their attention to detail. Everything was perfect, from the decorating and cleanliness of the rooms to the wonderful complete breakfast served each morning. This is a place not to be missed!", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Beatrice, Nebraska, United States", "Title": "“LOVE LOVE LOVE!!”", "Author": "Mercedes E", "ReviewID": "UR127162009", "Content": "I was a little hesitant to book this hotel because normally Knights Inns are not the greatest, but I saw the picture and decided to book anyways. Best decision is the planning of our wedding/trip. The room was the cleanest room I have ever stayed in. You can tell that they care about their guests because they always addressed us and made us feel special. The amenities were amazing. Always friendly faces, staff always did above and beyond what I expect. Breakfast was DELICIOUS! Eggs, biscuits and gravy, sausage patties, muffins, danishes galore. Total heaven to wake up to. The services was so great and above expectations that we decided to extend our trip from 6 days to 7. We can not wait to stay again!", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mendon,MO", "Title": "“Best Hotel for a Long Time!”", "Author": "Lene G", "ReviewID": "UR127159510", "Content": "We will be back. The staff were above and beyond when it came to help and service. We all loved the clean fresh smell of the black bamboo air freshner. The rooms were very clean and well furnished. The ad said each room had a refrigerator, which we didn't see, but ended up not needing them.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baxter, Minnesota", "Title": "“Wonderful”", "Author": "mary o", "ReviewID": "UR127158914", "Content": "The employees and owners were just great. We have a dog, and they treated the dog as special as they treated us. We would definitely go back and recommend to friends and family. Excellent breakfast, and clean everywhere. They were in the process of putting in laundry facility, definite plus. Great stay", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gurnee, Illinois", "Title": "“Best Knights Inn we've stayed at.”", "Author": "Greg S", "ReviewID": "UR126988754", "Content": "My wife and I have spent over 1000 nights in motels over the last 25 years. We are budget conscious and we've been in some real clunkers. Some of those clunkers have been Knights Inns, so when I saw the low price and the amenities of Knights Inn at Thousand Hills in Branson, MO during my motel search for a 5000 mile trip just completed, I was a bit skeptical. After all, you know what they say about things that sound too good to be true. Boy, were we pleasantly surprised. The room was very clean with all the amenities as advertised and the host and hostess were some of the most freindly and hospitable people we've ever met behind a motel desk. They definitely showed personal interest in those who enter their doors. They had me scheduled on the main floor, but were happy to accomodate my request for top floor in a quiet section. (The room was quiet) I suppose that this review might be suspect if I didn't find something wrong with a $45 room (including tax) in a motel in Branson that includes a hot breakfast and has an elevator, so this is it...the rooms are a bit on the small side. However there was enough room for our purposes...sleeping, and I admit we were a bit spoiled since we had just come from a place that had given us a free upgrade to a room that could have held another king sized bed, another table and still had room to spare. Everything in the motel looked new or freshly remodeled, and there were no irritating smells like those that permeate many lower priced national chain motels. Having spent a lot of nights in motels, one thing we find annoying is when the bed has a lamp and/or night stand only on one side because my wife and I both like to read in bed and have a place to put our glasses (reading and water) when we turn the lights out. Many times I've had to take a drawer out of dresser as a make shift night stand, and or move a floor or table lamp. Here, we had none of those problems. In fact, besides each having our own night stand, there was a wonderful bright overhead light that made reading a breeze. If you have a desire for a friendly, quiet, clean, economical motel off the noise and glitz of the of the main drag, you can't go wrong here.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Topeka, Kansas", "Title": "“Overpowering air freshener”", "Author": "Mary S", "ReviewID": "UR126987907", "Content": "This was a girls weekend. My friend has a problem with asthma and after eating in the breakfast area she had an extreme asthmatic reaction because of the air freshener. Also, although a roll away bed will fit into a king room, it allows for absolutely no room to maneuver around the roll away. The room is very small with no table available to play cards. The price was very low, so I guess you get what you pay for.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wildwood, Missouri", "Title": "“\"Fantastic Place to stay in Branson!\"”", "Author": "MssLSU", "ReviewID": "UR126799294", "Content": "Our stay at this hotel was absolutely fantastic! This hotel is very, very clean from the outside to the inside. Our room was spotless!. It is a simple, nothing fancy, very adequate hotel. The owners (Mrs. Becky) and all of the staff were so sweet, most sincere, and very hospitable. She even gave me a big hug upon my departure. It definately beats the high end hotels. They asked repeated if I needed anything, and cordially greeted me (with a big smile) each time they saw me within the hotel. I felt like family staying here!!!! It was quite pleasant. The breakfast was great too, in a quaint country setting. Also, this hotel takes pride in honoring our Veterans, from all of the memorabilia displayed. The location of the hotel can't be beat. It is so close to every attraction and restaurants. And the hotel rate was unbeatable. I feel like we received so much more in value, with all of the \"southern hospitality\" a guest could want! I even witnessed a guest requesting his shirt be dried in the dryer, and Mrs. Becky, without hesitation, immediately took care of the guest's request (w/ a smile). WoW! Without a doubt, we will return to this hotel for each trip we make to Branson.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Branson, Missouri", "Title": "“A Wonderful Place to stay in Branson!”", "Author": "Dynomitepraise", "ReviewID": "UR126605883", "Content": "My last night in Branson was wonderful in many ways but the Knights Inn and it's wonderful owners and staff added the touch of excellence that made it a \"Forever Memory\". They attended to my every care and the hotel is one of the cleanest I've ever stayed at. These people really care about their guests. I will stay here whenever I come to Branson!", "Date": "March 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ruston, Louisiana", "Title": "“Great Place!!!!!”", "Author": "Brad E", "ReviewID": "UR126329047", "Content": "Great place to stay. Wonderful staff and very clean. Great coffee and breakfast. My family and I have nothing bad to say about this hotel. Will use again every time We visit Branson.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lees Summit", "Title": "“March motorcycle trip to Branson”", "Author": "John R", "ReviewID": "UR126290702", "Content": "I had a wonderful experience at Knights Inn. The management is so friendly and helpful. They had great suggestions on places to see and how to get there. I enjoyed talking with them every day I was there. You could really tell they cared about how my day went and my stay was doing. Thanks for a really nice time in Branson. John Russback", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Beaumont, Texas, United States", "Title": "“The right people make things work.”", "Author": "Garrett G", "ReviewID": "UR126257940", "Content": "This hotel is pretty much attended by the owners the majority of the time. They are readily available and their attention to detail is second to none . We arrived at the hotel at 130 in the morning and our 8 year old had been crying for the last hour of the trip complaining of a toothache. it is rare for her to cry about pain. We took her to a dentist the next day in Springfield and the long and short of it is she ended up having a root canal our first day of vacation. Upon learning that her medication had to be refrigerated the owners immediately put a mini fridge in our room at no charge. The night we arrived, despite being tired ,we stayed up til 3 am talking with the night manager who was a very sweet woman and we now count them all as friends. The hotel is well kept and for the price is the best you will find. If we ever find ourselves back in Branson we will be staying with our friends at the Knights Inn. They care about customer satisfaction to the point that it sets them apart. They also have a book for visiting veterans to sign and a wall honoring veterans. You can send in pictures of you and friends or family to be placed on this wall. As a veteran myself I was pleasantly surprised by this.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“extremely pleased with stay”", "Author": "Don M", "ReviewID": "UR126109885", "Content": "The room was beautiful , very clean the staff were helpful and friendly. We had all the amenities we wished for. When we go to Branson we will definitely stay there again. Nice complimentary breakfast was available each morning. Close to golf course and restaurants. It topped our expectations. Would highly recommend to anyone. Don and Jeanette from Winnipeg Manitoba", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Good Place to stay for the $$”", "Author": "CruiseSki", "ReviewID": "UR125285617", "Content": "We stayed at the Knights Inn @ Thousand Hills in Branson, MO on Friday, 02/24 & Saturday, 02/25. We go to Branson 2 or 3 times a year for a quick get away but had never stayed here. We decided on the Knights Inn mainly because of price and we knew the location was great. We booked a King room w/microwave, refrigerator, hairdryer and the total cost for 2 nights was $80.36. Before booking I read reviews on TripAdvisor as well as a few other sights and overall the reviews were very favorable. The hotel is an older hotel and the room was fairly small; however, the hotel was extremely clean and provided everything we needed for our 2 night stay. The bed, while not the best, was okay. I will say this was the first time I had ever stayed in a hotel that had pink sheets on the bed. The bathroom was shower only but it was a very, very large shower that extended out into the curved wall area within the room. The shower doors can be tricky to open as you may need to lift up a little bit to get it open. Breakfast was fine - scrambled eggs, biscuits/gravy, sausage, danish, cereal, toast, juice, etc. The front desk staff was very friendly and you could tell they really appreciated the fact you chose their hotel to stay in. Overall, our stay was enjoyable.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bloomfield, Iowa, United States", "Title": "“Wonderful time!”", "Author": "Kathy M", "ReviewID": "UR125253105", "Content": "This was a very nice place to stay while in Branson for a couple of nights. The staff were all very friendly and helpful and really nice to visit with. The room was clean and well taken care of. Great value! The hot and cold breakfast offered many choices and was well maintained. The only complaint was there was not a recliner for my husband!", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lonsdale, Minnesota", "Title": "“Fantastic motel”", "Author": "dubs37", "ReviewID": "UR125195646", "Content": "Our 2 night stay was very enjoyable and restful. The front desk staff were very cheerful, pleasant, and helpful. The cleaniness of the entire motel and room outstanding. Very comfortable beds. The hot breakfast was a big plus. The rates of the room is very affordable. Will stay there on future trips to Branson, and would recommend it to everyone that is on a trip to Branson.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Godfrey", "Title": "“Fantastic Customer Service”", "Author": "GodfreyFilmor", "ReviewID": "UR125103492", "Content": "I arrived about five hours early to the motel. I was met by Becky Sue, co-owner of the motel, she allowed me to check in early. Customer service was her top priority and let me know if there was anything I needed to let her know while I was there, so she could take care of it before I left. Their breakfast goes beyond a deluxe continental breakfast. Scrambled eggs, sausage patties, biscuits and gravy, deluxe muffins, cherry cheese danishes, various cereals, orange juice, cranberry juice or grape juice and so on. Nice clean and well maintained room. Ask for a refrigerator and microwave if you need them, their not in all rooms yet. Becky Sue and her husband are committed to making this one of the best Knights Inn. There is another Knights Inn in Branson. Don't get that one confused with this one, they do not compare at all.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Missouri", "Title": "“Very Clean Hotel”", "Author": "MissouriReviews", "ReviewID": "UR124837159", "Content": "Very clean hotel, friendly front desk, breakfast buffet was very tasty, should switch to Real OJ though. We shall be back", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Missouri", "Title": "“Great hotel!!”", "Author": "Kristy T", "ReviewID": "UR123261785", "Content": "The rooms were very clean and the service was fantastic. We stayed two nights and really enjoyed our stay. The price was great. Breakfast was good and there was a wide variety of food. We will definitely stay here again.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "theodosia", "Title": "“Expression of Appreciation”", "Author": "davidhayesTheodosia", "ReviewID": "UR123125899", "Content": "I have traveled the world, stayed in some of the most expensive as well as less expensive dwellings, with service to match. My visit with Knights in rates a 10 on a scale of 1-10 for value, accommodation & quality. Service a 12! I felt appreciated and well taken care of by everyone. I highly recommend a visit", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paragould", "Title": "“Relaxing Time in Branson”", "Author": "Susan A", "ReviewID": "UR122885831", "Content": "My husband and I were looking for a way to relax from our work at home. We chose to go to Bransaon and stay at Knights Inn not realizing how truly wonderful our few days would be. The hosts met us with smiling faces and all the information we could have ever wanted. Things are slow in early January, but we were directed to wonderful places to eat, activities to occupy us, and even a relaxing afternoon by the water. All was rejuvenating to say the least. It is hard to express how nice it was. I would definitely recommend Knights Inn at Thousand Hills for you next vacation base. By the way, the breakfast was way above most continental breakfasts. We also had a microwave and frig in our room for $39 plus tax. Can't beat all that!!!", "Date": "January 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great Stay!”", "Author": "Melmal31", "ReviewID": "UR122222592", "Content": "The rooms were clean and the attendants at the front desk were extremely welcoming and helpful. We will definitely stay here again. I have already recommended it to family. Great place to stay if you want clean and affordable.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "biscoe, ar 72017", "Title": "“memaw & papa vacation”", "Author": "juanita h", "ReviewID": "UR122073722", "Content": "We went on line to find a place to stay that would not break our budget,when we got to Knits in we were showed one of there rooms and we were amszed at how clean the place was it is centrally located the desk clerk Kaleen was so helpful to show us how to go about getting the cheapest tickets, We cannot express our thanks and satisfaction with this great place we plan on going back in March and we will stay there and tell our friends how great a time we had", "Date": "December 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ft. Worth, Tx.", "Title": "“Best Value, Most Genuine and Helpful Staff In This Town!!!”", "Author": "M A", "ReviewID": "UR122053443", "Content": "We stayed here late Oct. so sorry it has taken so long to post this. I can not say enough about the owners. They DO go out of their way to do anything to help you. I work here 6-9 mos. of the year, yet my wife and 4 dogs are in Texas. I usually drive home @ least every other Sunday, but my wife comes and stays a couple of weeks out of the year. The place I rent is really small (frugality), so I book a room twice a year. My wife brought our 2 smaller dogs.The room was very clean and homey with fridge, micro, etc. The owners totally went out of their way to accomodate us . Great people. . You can't go wrong staying here!! BEST VALUE IN THIS TOWN!", "Date": "December 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston (Cypress), TX", "Title": "“Met our needs”", "Author": "Texan11-11", "ReviewID": "UR121771427", "Content": "Clean, comfortable,safe, new looking, quiet area, friendly staff. What more could you ask? Standard hotel breakfast selection. Good as any.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice, friendly atmosphere with down home hospitality.”", "Author": "Hastypuddins", "ReviewID": "UR121671605", "Content": "We stayed at the Knights inn and were pleasantly surprised. Rooms were cozy and comfy. Warm environment. Owners were very nice as well. We loved the travelers prayer at the bedside. We would definitely stay there again.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Poteau, Oklahoma", "Title": "“It worth every dollar we paid”", "Author": "mkacs", "ReviewID": "UR121606188", "Content": "The hotel is definitely worth more - since this is in branson! The hosts can't be more friendly and helpful. The room is homey, clean, I like the coffee maker - so convenient. I made at least 10 cups of tea with it. If you don't want to spend tons of money for your vacation, this is a great choice.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "palm harbor, fl", "Title": "“Wonderful place to stay!!”", "Author": "ziffel", "ReviewID": "UR121466714", "Content": "We stayed here late Oct. so sorry it has taken so long to post this. I can not say enough about the owners. They DO go out of their way to do anything to help you. We had two dogs and one died not to long before we stayed at this hotel. Our other dog was not used to being alone. They owners went out of their way to keep her calm. I could not believe it. They got us show tickets that were last minute but we had great seats. They told us places to eat and of course shows to see. We were only there two nights but felt like we knew them for ever. Great people. You can't go wrong staying here!!", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cabool, Missouri", "Title": "“Great Stay for a basic rate!!!!”", "Author": "motraveler50", "ReviewID": "UR121393969", "Content": "We stayed 1 night on Dec. 2nd at the Branson Knights Inn, and enjoyed every aspect of our stay. The owners, and staff went out of their way to make our stay enjoyable and memorable. The room was nice, bed was a little firm, but the pillows were much better than most Hotels offer, and the entire room was very clean. Breakfast was good with sausage, egg and cheese biscuits, burritos, boiled eggs, waffles, pastries, muffins, several cereals, juice and coffee. In the evening they offer hot Dr. Pepper with lemon, a real treat. We will definitely stay there again.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dallas", "Title": "“EXCELLENT Stay!”", "Author": "jiminy-cricket-77", "ReviewID": "UR121179401", "Content": "We had a great stay at the Knights Inn at Thousand Hills. The owners were wonderful, the staff was helpful, and the service was tremendous. Since we needed to work while we travelled, we required strong internet. The internet was very reliable. Ask the staff for suggestions on shows, obtaining tickets, and other fun things to do in Branson. During breakfast, I often observed staff assisting other guests. Staff were pleasant and genuinely concerned for their customers. The value is awesome!", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Republic, Missouri", "Title": "“Loved it!”", "Author": "kari w", "ReviewID": "UR121167152", "Content": "Very clean, very friendly staff, comfortable bed. Great hotel for the money!", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Graham, Texas", "Title": "“Great, comfortable Motel to spend our time in Branson, MO”", "Author": "Cucuta-1968", "ReviewID": "UR121155706", "Content": "We had a wonderful time at the Knights Inn and were so pleased with everything. The Staff is very friendly and helpful. We stayed three nights and wished we could have stayed longer. At the Breakfast there is such a good variety of items that it is hard to choose which one you want. We will go back there as soon as possible.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dayton, Texas", "Title": "“great Stay!! November 19-22, 20011”", "Author": "Laurie B", "ReviewID": "UR121068825", "Content": "We were looking for a comfortable hotel with good location and a decent continental breakfast. Knights Inn at a Thousand Hills was just that. People were so friendly and helpful with show recommendations and directions. We will be back and tell our friends. Thanks for a great stay!!", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Inver Grove Heights, Minnesota", "Title": "“This is the place to stay in Branson”", "Author": "David O", "ReviewID": "UR120874038", "Content": "Have stayed at this location on two separate occasions for a week each time. It is very convenient to all arractions and quiet (not directly on the strip). It is a very comfortable place. The decorating is nice, the breakfast is nice and the owners who manage it are extremely friendly, caring and helpful.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Albert Lea, Minnesota", "Title": "“Thanks, very nice place”", "Author": "susan445", "ReviewID": "UR120799334", "Content": "We had a wonderful time in Branson, thanks to our friendly visit to this motel. The rooms were clean along with the whole building. The breakfast was very nice, they had a large assortment of choices for us. The staff went out of their way to show southern hospitality. We will return to this place. Also one evening we came back from a busy day and they had hot beverages to serve. The little things matter. Also it was a friendly christian attitude that we enjoy from Branson. Thanks for everything", "Date": "November 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Radcliff, Kentucky", "Title": "“AWESOME”", "Author": "Dee W", "ReviewID": "UR120675541", "Content": "knights inn was a wonderful, friendly,clean,comfortable place to stay. we called in advance to make sure we had all rooms and aminities ready for our arrival. we were and are well pleased with what we recieved. friendly staff,clean rooms,easy access to all attractions be it driving or walking. they even made our two four legged friends comfortable and well recieved. will surely stay here again the next time we are down that way. thank you so much for everything you all did and do for all us travelers near and far.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Very nice place and beautiful people with it”", "Author": "travellingDitty", "ReviewID": "UR120362060", "Content": "Had a wonderful 5 night stay and best continental breakfast yet!! Multiple items to choose from and mostly nutritious. Very nice personnel and clean rooms, beds were wonderful for a hard days play in Branson!!! Always a gracious welcome, and downhome friendly folks, what more could we have asked for.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbia, Missouri", "Title": "“Modern vibe with a bed n breakfast attitude”", "Author": "ShowMeCoasterGuy", "ReviewID": "UR120294279", "Content": "Picked this hotel from a search list created by a discount program thru my job. Glad I picked this one. I go to Branson; at least once each year, for College of the Ozarks homecoming....and Knights Inn at Thousand Hills will be my *go to* hotel from now on for ALL my Branson trips. I see myself making more trips to Branson each year in the future; in part, because I now have a great place to stay, with Knights Inn at Thousand Hills.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cabot, Arkansas", "Title": "“Wonderful”", "Author": "Kevin S", "ReviewID": "UR119995609", "Content": "The people at this hotel were wonderful....everyone! Breakfast --Choose from danish, muffins, toast, hard boiled eggs, sausage/egg biscuits, breakfast burrito, waffles, juice and milk. The rooms are not real large, but they are very nice and clean. We stayed in a king size bed and it was great. Our room price was fantastic. They invited us to watch a game upstairs and join the crowd. Thought that was really sweet. Every person we meet was so friendly. If your on a budget this is a great place to stay.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Iowa", "Title": "“Good management results in Pleasant Environment”", "Author": "GrandmaBJIowa", "ReviewID": "UR119791183", "Content": "An old principle is exemplified in the Knight's Inn, Branson: people tend to take better care of what they own and worked hard to obtain than those who are caring for others' property. First, the room and entire facility were super clean. The details reflected the efforts and expertise learned from years of experience in the neatness and orderliness of the grounds. The landscaping is well maintained. The pool area is clean. The breakfast area is well-organized and the breakfast is sufficient - especially for the reasonable price. The patriotic theme adds more than just nostalgia showing appreciation for veterans who sacrificed for our freedom.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Housekeeping Needs To Do Their Job, Better.”", "Author": "Thorogd", "ReviewID": "UR119726858", "Content": "I stayed at this facility from October 5, 2011, and departed on Monday October 10, 2011. At first the facility seemed well taken care of, but nothing prepared me for the unpleasant surprise the next morning. I woke up, turned back the sheets and comforter, and what did I see? About a five inch strip of what appeared to be fecal material, on the back side of the comforter. How gross!!! I slept with that all night!!! The next morning I attempted to talk to one of the owners ( the wife), but she was busy eating breakfast with some of the other guests. I did leave a note for housekeeping to see, and instructed them to remove that comforter, and all the sheets and pillow cases. I had a 10 am show that morning, and returned at the hotel about 12:30 pm, and found someone from housekeeping replacing everything on the bed. At that point, I went to the front desk and complained to the wife, and she apologized, and said they would make things right with me, not indicating what that would be. After further investigation, I discovered there was no hair dryer at all. Also, the timer for the heat lamp did not work, and the light in the shower had no cover over it. The breakfast was nothing to write home about. Something like Tang, was passed off as orange juice. 3-4 dry cereals, all cheap knockoffs of Cheerios, and one flavor of yogurt, vanilla. The sausage, egg and cheese biscuit was quite tasty, however. When checking out, they removed the charge for just one night. Should have been 2 or 3. Will I stay here again? Not likely.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Springfield, Illinois", "Title": "“Outstanding bargain with excellent service”", "Author": "hdj38", "ReviewID": "UR119646552", "Content": "The good reviews on Trip Advisor and room rate were a major reason for our stay for two weekend nightes at the Knight Inn at Thousand Hills. The staff at the front desk was extremely helpful and friendly as were other staff we encountered. The location is very good since you will find yourself mid-way on Rout 76, but about three blocks to the south away from all the trafic. BTW the breakfast is great. We will stay here again.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“Gem hidden in Branson, 5 stars!”", "Author": "AAAAAA504", "ReviewID": "UR119410014", "Content": "The best people ever at this hotel, from the front desk to the housekeeping. Will stay here again for sure! Super clean rooms, and an awesome breakfast. We travel alot and this is by far in the top 5. The only reason it is not number 1 is because the pool is outside and we like to have a pool year round, but there is plenty to do in Branson besides swim! Recommend this hotel all the way!", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Cape May, New Jersey", "Title": "“All you could ask for in a budget hotel.”", "Author": "Percfish", "ReviewID": "UR119341633", "Content": "I loved my stay at the Knights. Very clean, very friendly staff at all hours of day and night. The location is on the less congested yellow route but close to all the attractions. Well lit parking and safe area. Thanks for the prior advice and ratings from trip advisor. My one thorn was the lack of refrigerator in the rooms. Bring a cooler and enjoy your stay.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Was blessed.”", "Author": "Opal M", "ReviewID": "UR119340229", "Content": "We were so blessed to have found this hotel. The people that run it are truly a blessing to be around. They treat you as family and always want to know if you need anything. You can also bring your little pets with you. We met their little pet while we were there. And he was awesome. There rooms and the whole hotel is very clean and there breakfast was delicious. We plan on staying there each time we go back to Branson. Wish we could have stayed a month or two with them. Just to get to know them more. I can't say enough wonderful things about this hotel and the people who run it and own it. May god bless you. Thank you for the wonderful time we had with you all.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Olympia, Washington", "Title": "“Great Pick!”", "Author": "Karen98503", "ReviewID": "UR119278861", "Content": "I picked Knights Inn at Thousand Hills because of the great reviews on this site of this hotel! Then we worried that it was SO reasonable, could it be that good?!! Well, it is!! We spent five nights, four of us retired teacher ladies with two adjoining rooms! We each had a queen size bed, the shower was wonderful, and the service each day could not be surpassed! The desk people were so accommodating, and the \"continental\" breakfast had too many choices to call it \"continental!\" Thank you so much!", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arkansas", "Title": "“`We'll be back!”", "Author": "OmaArkansas", "ReviewID": "UR119239549", "Content": "From the moment we checked in to the moment we checked out, we felt very welcomed and cared about. The owners, Becky and Ed, are outstanding. The place is very clean and quiet. Breakfast was all you could ask for! Everyone on the staff that we encountered was very personable and helpful. This is a tremendous value. We WILL be back!", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Humboldt, Tennessee", "Title": "“Clean Rooms Great Rate Friendly Staff”", "Author": "Timothy S", "ReviewID": "UR119123092", "Content": "Just spent 8 nights, everything was great above our expectations with affordable rate. my daughter commented on how good the place smelled,breakfast was good, and the staff were ALL very friendly, will stay there next year on our yearly trip to Branson. Last year stayed at another hotel that was twice the price and the room smelled musty. You can,t go wrong with Knights Inn at thousand hills very convient to everything.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Alma, Wisconsin, United States", "Title": "“WAL”", "Author": "Wayne L", "ReviewID": "UR119051932", "Content": "This is a great hotel. The owners Ed & Becky and the night desk person Colleen were all very friendly and helpful. They kept telling us if there was anything we need to ask and when we did it was done. Our room was at the end of the hall with a long walk and I have a problem walking. They immediately moved me to a room close to the door. They indicated they had remodeled 16 rooms and were going to do more in the next slow time. The room we had was not remodeled but they indicated they were going to but I don't know why. It was nice, clean and better than some hotels that I have stayed ing that cost over $100 per night. As a travel agent and a tour operator I have stayed in a lot of hotels and this was one of the best - probably the best. They had an expanded continental breakfast that even included hot items. As I said I am a travel agent and before I left I booked rooms for a client who is coming to Branson next month. No where will you get this much value for the great prices they charge.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "2.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Excellent location, Excellent service, Excellent rates, PERFECT”", "Author": "myyngatheart", "ReviewID": "UR118941324", "Content": "We reseved our room for 2 nights, and a extra room for my brother and his wife for one night both rooms were very clean and accesiable to everything.....we attended Dixie Stampede, Adventure Zipline and Kirby Vanburch and visited the Auto Museum and were at each within 10 mins of motel so very little car time. Since we drove from oklahoma 4 hrs not having to spend a lot of time n car was awesome...... and having an awesome resturant right accross the street (Lonestar steak) also was wonderful didn't have to take car or settle for fast food....awesome.....we did not see roaches nor did we witness any mistreatment of handicap, we have already schuduled our next trip and will be staying there...", "Date": "October 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Kansas", "Title": "“Met My Expectations”", "Author": "luggagecheck", "ReviewID": "UR118910719", "Content": "For $39 a night, this place was not bad. My family did a two night trip to Branson and stayed here. The room was very small but we managed to fit the portable crib at the foot of the bed. The room was not much bigger than an inside cabin of a cruise ship. The bathroom did not have a tub and there was no closet just drawers. Bring a hairdryer as there isn't one in the room. There is however a coffee maker and the free breakfast was not bad. If our trip was for a longer period, I would not stay here but for our short trip, it was fine. The people at the front desk were very friendly and the room was clean. Overall, it met our needs.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Searcy", "Title": "“Very Lucky to find this hotel!”", "Author": "Rod L", "ReviewID": "UR118907281", "Content": "This was our first trip to Branson and we didn't know where to stay. We trusted our instincts and choose Knights Inn off of the internet. It was perfect. The owners bent over backwards to make us welcome, helped us find our way around the \"strip\" and the rooms were very nice, clean and we were amazed at the price for the quality that the hotel had. We will definitely be back and will recomend it to our friends.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“We are going back”", "Author": "Cheryl3209", "ReviewID": "UR118824681", "Content": "The staff was delightful, so delightful that we are going back to Branson the middle of October and staying here again.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cedar Falls, Iowa", "Title": "“Best Value in years!”", "Author": "Emptynesters50613", "ReviewID": "UR118664339", "Content": "The hotel was very clean and the staff was extremely friendly and helpful. This was the best value (price for clean) we have had in years! We will definitely stay again.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bella Vista, AR", "Title": "“If you are handicapped, don't expect respect”", "Author": "Rosalie72714", "ReviewID": "UR118463159", "Content": "We have stayed at both Knights Inns in Branson. The older one had much better service than this one. We stayed 3 nights. There were 2 handicap parking spots on level ground next to the door. Another was down the hill. My husband had a very difficult time walking, and he has a handicap license plate. Both level handicap spots were occupied, and one car had no handicap sticker or plate. Throughout our stay, I mentioned the problem to the lady behind the desk several times. She always said the driver just forgot to put up the hanger. Then I saw HER GETTING INTO THE CAR!!!!!! She was not handicapped. I complained to the man behind the desk, and he said it was HIS car, and he could park his car anywhere he wanted to on HIS property. He did look handicapped. But the lady was the one using the car. Sorry, mister. Your arrogance and the other lady's failure to recognize needs of the handicapped will make me tell everyone I know how you treated us.", "Date": "September 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mountain Home, Arkansas", "Title": "“What a great experience!”", "Author": "Millie R", "ReviewID": "UR118442342", "Content": "How nice to get a great stay with a great price! We live 2 hours from Branson so generally we head home after shopping or a day of fun, but on occasion we do decide to make our trip a two day event. From now on, this will be the hotel we try to book! We had a very good price, large room, quite acceptable breakfast, nice pool to look at (too cold for our use at that time), and an extremely friendly and courteous staff. A good reception with a smile goes a long way to making any stay nicer. The manager did everything she could do make our stay convenient and enjoyable. Note to those who dislike dragging yourself and or your luggage up and down stairs: The hotel has an elevator so stair climbing is not needed. Note to drivers: It is also accessible by using the yellow route and avoiding the bottleneck traffic on the 76 strip.", "Date": "September 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Denham Springs, Louisiana", "Title": "“Excellent value!!!”", "Author": "VenessaH", "ReviewID": "UR118413094", "Content": "The staff was very friendly and the rooms were very clean and smelled nice. I have paid twice as much for rooms that were not half as nice.", "Date": "September 21, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Pittsburg, Kansas", "Title": "“We Loved It!”", "Author": "saw09", "ReviewID": "UR118248444", "Content": "We stayed here before our flight the next day in Springfield because we wanted to spend the day in Branson. It was perfect for us, great accommodations for the money. The staff was very nice and helpful. They also had a pretty good breakfast. Just a simple hotel if you are looking for a nice place to sleep.", "Date": "September 17, 2011"}, {"Ratings": {"Location": "3", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Maryville, Missouri", "Title": "“Great Place to Stay”", "Author": "Ben W", "ReviewID": "UR118025125", "Content": "We stayed two days with the folks at Knights Inn at Thousand Oaks. The rooms were clean and fresh smelling. All the people that worked there were very accommodating and pleasant. Can't say enough great things about them.The breakfast was good. You can swim all night in their pool. It is not a 5 star hotel but great price and I would put them up against a lot of $75 per night hotels. They also have 2 great places to eat within 3 blocks. Need a place to stay reasonably? Stay here!!!!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Topeka, KS", "Title": "“WHAT A BARGIN!!”", "Author": "Treadman46", "ReviewID": "UR118020457", "Content": "We were looking for a reasonably priced hotel for a quick trip to Branson. Started looking around and found a deal I thought was too good to be true.....but I booked it anyway because of the price. Turned out to be a great bargain. The Knights Inn had previously been the Patriot Inn then a Sleep Inn. Located very close to the strip, interior hallways, very quiet location and super friendly desk people. Several breakfast choices.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "2.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Poplar Bluff, Missouri", "Title": "“The Good and The Bad!!”", "Author": "JMOOREEllsinore", "ReviewID": "UR118010763", "Content": "First of all I booked this hotel through a tripadvisor discount code for $39 per night. That's were it all went wrong. We arrive on a Saturday Night around 9 PM check in was fast and easy. We were told we are in Room 114 or what my daughter called the dungeon. The security door in the back of the hotel had tape on the handle and the door did not lock at all. No big deal!! Our room when we opened the door had a scent of moldy, meldewy mess. The blankets and sheets and pillow cases were damp, like a due had settled on them and they stunk. We opened the window to air it out but it did not help much. The bath room was clean and small and but the room had peeling wall paper, dirt and debris under the night stand, dead cricketts on the floor and dust on the furniture. After making it through the night,was out all day and the cleaning crew cleaned the room. The smell was all most gone,the sheets did not stink, the floor was vaccumed All most a descent room. What I dont understand is how you run a promo on tripadvisor and then put guest in the worst room in your hotel and not expect a bad review. Very bad night stay here!! I am sure the rest of the hotel is not like this room at least I hope so.", "Date": "September 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sullivan, MO", "Title": "“Super value...clean, safe excellent staff, a very good place to stay!”", "Author": "scotty085", "ReviewID": "UR117959518", "Content": "I recently stayed at this hotel for 3 nights and it was just perfect. Easy entry, clean rooms, good beds,location is easy to get to, you can walk to craft mall next door to shop, 2 blocks to Panera Bread Co, across street from Lone Star restaurant, 2 blocks to village shops....a great deal! I'll certainly be back.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Chillicothe, Missouri", "Title": "“An answer to our prayers: great value, friendly staff, convenient location”", "Author": "PaulSFraser", "ReviewID": "UR117887891", "Content": "We arrived at 2 in the morning, yet our hostess greeted us warmly and made us feel right at home. The staff creates a truly Christian and patriotic atmosphere in gentle, inviting acts of kindness. They referred us to an excellent source for ordering discount tickets to all the shows we wanted to see, and offered helpful suggestions about places to shop and dine. The rooms were attractive and pleasantly appointed with comfortable beds. By week's end, we realized that we had been \"spoiled\" by the friendliness of everyone on the staff and truly missed them all when we had to make our journey home.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Glen Rose, Texas", "Title": "“Stay here for friendly people”", "Author": "19xris60", "ReviewID": "UR117801798", "Content": "The owners are very helpful and are an excellent source for local information. They are free with recommendations and will get your tickets for you and have them delivered to your room. The Hotel is located in the heart of Branson, just off of the strip. We will always stay here when in Branson.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Yukon, Oklahoma", "Title": "“GREAT place TO stay”", "Author": "gary s", "ReviewID": "UR117771680", "Content": "We were there for 13 nites attending a SOUTHERN GOSPEL sing at Silver Dollar City, we were delighted with the service and very kind and helpful hostes and employees of this establishment", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Maynard, Iowa", "Title": "“we had a wonderful experience”", "Author": "lovebranson20", "ReviewID": "UR116392829", "Content": "everyone was very friendly and helpful. actually, they went ouy of their way to make our stay a wonderful memory. also the rooms were very clean.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Shelbyville MO", "Title": "“Great, clean, very helpful, and friendly place to stay!!!!!!!!!”", "Author": "TupperwareLady11", "ReviewID": "UR116137027", "Content": "My family were there for two nights. The room was super clean, nice walkin shower, extra pillows were provided. I will stay here next time to travel to Branson. The owners went out of their way to make us feel welcome. The motel was nicely located to the area shows and attractions.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Graham, Texas", "Title": "“My husband & I had a wonderful stay at the Knights Inn; we were very comfortable!!!”", "Author": "Cucuta-1968", "ReviewID": "UR115697962", "Content": "The location is excellent! The Staff was very attentive to our needs and were friendly. Our room was very comfortable and the mattress was just right. The Breakfast was great and we didn't lack for a thing while there. We plan to go back as soon as we can. For sure we will stay in this motel again and again!!!!!", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Miami, Oklahoma", "Title": "“perfect location”", "Author": "rhinds", "ReviewID": "UR115587735", "Content": "They are located on the yellow route which made it so easy to get to one place or another. We didnt have to roll along HWY 76 at 2 miles an hour. The people were warm and friendly. They cater to the military and gave me a nice discount and even put my military picture up on the wall where they had started a ...um..military..picture wall thing. This was not a big resort type of place. in branson we go to the room for showers and sleep so I thought we got everything we needed for the price we paid. i will return there and recomend it to my friends. especialy my military friends.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Branson, Missouri", "Title": "“I had a great time with some great people!”", "Author": "Dynomitepraise", "ReviewID": "UR115430138", "Content": "I found this hotel to be very clean and the owners were freindly and who went out of their way to make my stay enjoyable. I appreciate the fact that they honor the US Veterans of all military branches by offering them reduced rates. They worked hard to find me area show discounts. Everything was great! The pool is gorgeous. I'll be back and have already booked some rooms this fall for some of my freinds from Michigan so they can come and enjoy themselves here too.", "Date": "July 16, 2011"}], "HotelInfo": {"Name": "Knights Inn at Thousand Hills", "HotelURL": "/ShowUserReviews-g44160-d2049811-Reviews-Knights_Inn_at_Thousand_Hills-Branson_Missouri.html", "Price": "$56 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">210 S. Wildwood Drive</span>, <span class=\"locality\"><span property=\"v:municipality\">Branson</span>, <span property=\"v:region\">MO</span> <span property=\"v:postal-code\">65616</span></span> </span></span></address>", "HotelID": "2049811", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/de/df/dedf66b53a34e0b6ebfd7ae8661837cc2large.jpg"}}