{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "northwest", "Title": "“average hotel”", "Author": "calnorthwest", "ReviewID": "UR127694790", "Content": "The hotel was clean, the room was adequate,clean, and quiet at the back of the hotel, there is a busy road at the front of the hotel so these rooms maybe a bit noisier, drinks and chocolate in the fridge with a price list, .4 of a litre of beer is 5euro. The breakfast was fine,tea,coffee,juice,ham,cheese,eggs,jams,buns, they seemed to be short staffed in the mornings as it did take some time for the tables to be cleared.perhaps if the resuraunt supplied trays then the customers could return there used trays to a trolley, so the tables are ready for the next group of people. Their is a TV in the room but the only english speaking channels were BBC news and CNN. The bathrooms are clean,modern, with a hair dryer, but very small. The metro is a 5 minute walk away from the hotel, we paid 11euro for a 3 day ticket to use as often as you want. We didnt eat in the hotel, we went to a very modern bistro to eat, very friendly owner and staff, reasonabley priced for Rome, just turn left out of the hotel, next to the super market. Take good old walking shoes as you can walk for miles in one day, I am glad we went in April as it would be far too hot for sight seeing in the summer months. 20 degrees in the day but quite cool at night and first thing in the mornings.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "south wales", "Title": "“Not a 4 star”", "Author": "ponty2", "ReviewID": "UR123918962", "Content": "Just back from this hotel after 4 nights celebrating my hisband 60th birthday. We knew 4 star abroad is not quite the same as 4 star Britain but this hotel should rate barely a 3 star. The young reception staff are great, the older ones are just miserable. We were shown to a room that was not much larger than a corridor, L shaped with twin beds that were actually around the L shape so the foot of both beds were together! we went to reception to ask for another room, they had none until next day but could put us in the attic, this was a much bigger room (incredibly noisy) and you had to walk around like the Hunchback of Notre Dame as it was only possible to stand up in the middle, the bed was pushed up against the wall on one side so you had to crawl across person next to you or go on hands and knees to avoid banging your head on the ceiling. I know people say you only use the room to sleep in but it is nice to come back to a reasonably comfortable room after a long day sightseeing in a very busy Rome, the rooms in this hotel were not comfortable and were very small, also the walls were made of paper, you could hear people unzipping their suitcases and hanging their clothes in the wardrobe. This hotel was on the outskirts which was not really a problem as the Metro was close by and it is so easy to get around, the hotel restaurant was expensive and the menu didn't particularly make you want to dine in of an evening. There are no restaurants nearby but there was a supermarket and also one of two takeaways serving lovely food, mostly pizza and paninis and cakes. The breakfast was as you would expect: croissants, cheese, ham, salad, jams, fruit juice, yoghurts etc, scrambled eggs (actually omelettes cut up) were only served on a week day and not at weekends. It is the first hotel I have ever been in where your fruit juice was served in plastic cups and also plastic tea spoons, all drinks were out of machines, and the waiters and waitresses were there just to clear tables, there was no welcome or eye contact, they were very slow to fill up any things that had run out, I got the impression this hotel was run on a shoe string. I have to say the good things about the place were: it was spotlessly clean, the shower was boiling hot with lots of water pressure and the towels were large. I would not recommend anyone to stay here, it also is in need of a refurb. The beds were ok if you like sleeping on a table!", "Date": "January 31, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "tampa", "Title": "“Two Star Hotel, NOT Four Star!”", "Author": "nctampa", "ReviewID": "UR123475402", "Content": "This hotel needs a name change, as it is certainly NOT a TOP American Hotel, and no where near a palace! Not sure when the photos were taken on their website, but there was lots of lipstick on that pig. Very shabby property. Front desk staff clearly are not in love with their jobs, even though we were pleasant to them. Internet would have been 6 euros/day, had it worked - their wireless was down throughout the hotel. For a large hotel, they had very small elevators & teeny tiny rooms, with a bathroom to match! If you are a large person, I'm not sure you will be able to enter the shower, as the fold out door of ours bumped up against the pedestal sink & left an opening of about 18 inches. Our room was big enough for a double sized mattress, with about a foot of space between the foot of the bed and the desk unit that also housed a small fridge and 13\" B & W tube TV, with poor reception (not that you'd want to spend any time in the room). On the plus side, there was a small safe, and blackout curtains. The mattress was thin, with pillows to match! The only redeeming qualities were that it was pretty close to the Metro (walk straight out to the main road, hang a left, cross the street & walk about two blocks) and they really did have quite a buffet spread for breakfast. Speaking of Metro, from Termini, take Line B to the Laurentina station, which is at the end of Line B, about 25 mins. If you're visiting the Vatican, then plan to change trains at the Termini station.", "Date": "January 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Wrecsam, null, United Kingdom", "Title": "“OK”", "Author": "Andy Berry S", "ReviewID": "UR122396739", "Content": "Cleaned Daily and 2 min walk from Laurntina station.. Room 333 was small on main road, so noisey at night if they aint honking their horns an ambulance will be coming past... Beds are hard and so are the pillows ... The staff are helpfull and pleasant ... 2 deli's on the street both excellent, dont speak english but thats not a problem and also gelato on the same street... food in the hotel is good but for 30 euros for a 3 course meal it should be great Theres a fruit stall across the road that is excellent and sell their homemade wine that is superb. Theres also a supermarket next to the train station if you tire of spending 6 euros for a small bottle of beer in the hotel bar. Be careful of pickpockets they are everwhere and pick on the unwarey traveller. look for people with scarfs, slings etc as they use it as cover.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Rochester, United Kingdom", "Title": "“Very thin walls”", "Author": "Rosie0112", "ReviewID": "UR121977796", "Content": "I stayed in this hotel for 5 nights in November, It cost £20 pppn and that included breakfast so we knew it wasnt going to be the Ritz. Our room was tiny, but as we were only going to sleep in teh hotel and spend the rest of our trip in Rome this wasn't a problem. At first glance evehrything looks clean but we did notice dust and stains on the walls. The walls are also paper thin. We could hear everything going on in the room next to us and the room opposite. Breakfast was good, eggs, tomatoes, ham and cheese as well as pastries and breads. The coffee was pretty awful but it woke you up! The maid came to make the beds every day and the towels were changed every other day. The location of the hotel is quite far from the centre of Rome, but the metro stop is 200m away. It took around 25minutes to get to Termini.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Rijeka", "Title": "“Bussines trip to Rome”", "Author": "Posted by a trip.ru traveler", "ReviewID": "UR120986350", "Content": "Although hotel room rates are acceptable, you need to pay extra for the internet connection. Breakfast food offer is bad and simple. Single rooms are too small, but you need it just to sleep in it because there is so many things to see in Rome. Advantage is nearnees of Metro station (last metro station on line B)!", "Date": "November 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Better avoid....”", "Author": "SAMTAN210411", "ReviewID": "UR120609674", "Content": "Check-in took more than an hour. The check-in staff was very rude. The breakfast was forgettable. Rooms are not of the standard what we pay for. Washrooms are just OK, but a lot clumsy. Stayed there only because it was near to our office and booking was done by our agent. We asked for plates in our room and were asked to pay Euro 5 for the room service. We did never had dinner over there. Internet charge is also high. AC in the rooms are floor mounted and make lot of noise. The building looks like an old structure. TV was of a very old model with no a broken remotte. By no standard it looks like a 4 star hotel (as published by the hotel on thier website). It was a very bad expereince, will never stay there again. Only good thing was the balcony with the view of a pleasant morning in Rome.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "london", "Title": "“American palace hotel Rome - Don't stay here”", "Author": "snowwater", "ReviewID": "UR120492980", "Content": "Very unimpressed with this hotel. Rude and unhelpful staff. When I asked to change rooms as my room stank, I ws told I'd have to wait to see someone else who was at lunch. I was told I couldn't see the manager as he was at the beach! When I eventually got a new room, that one was just as bad. Small stinky rooms - don't stay here", "Date": "November 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Rude Staff, Incompetent and lack of basics!!!!”", "Author": "Nwlndnnurse", "ReviewID": "UR119367200", "Content": "I had 2 reservations either side of a trip to an Italian Island. I had 1 reservation through a hotel booking site and the 2nd direct with the hotel. The 1st booking was a special rate for a double or twin room. When I arrived at the reception I was greeted by the staff. They were not very welcoming, There had been an error in my booking that said there would be 2 people. I arrived with my friend who had picked me up from the Airport. They immediately started wanting his ID to check him in. I explained that it was just me. They seemed very suspicious and insisted that he left his ID at the front desk whilst he escorted me to the room. They had put me in a single room. I went to the reception and state that i had booked an offer that stated I would get a double or twin. They then put me in twin. There was no room information in the room. There was what I later learned to be a mini bar in the room but no price list etc, JUST AS WELL I DIDN'T USE IT!! The breakfast was good! though staff not very welcoming and you kinda had to work it out for yourself. The 2nd night was a booking through the hotel website on a \"Gay Friendly\" offer. With a free cocktail. There was no mention at all through my stay about the cocktail. They put me in a double room. The rooms are basic and look tired. There was no tea and coffee facilities in the room. I asked and the rude staff stated I could purchase this in the bar. Bit strange for a 4 star hotel. The staff member was also smoking behind the reception desk!! The air conditioning unit was loud and rattled and didn't make it very cold. The bathroom was basic and old fashioned and therefore appeared dirty. The metro was across the road so very near to the hotel and ideal for getting into Rome. On checking out they tried to charge me again despite already paying the night before. This was a bit embarrassing. I was generally disappointed, As it was not \"cheap\" and it was 4 class hotel so i had high expectations, The only saving grace was that the breakfast was plentiful.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Santa Barbara CA", "Title": "“Rude Staff”", "Author": "Mariuchi", "ReviewID": "UR119261405", "Content": "The hotel is very basic and small. Not very clean. Staff completely RUDE! Air conditioner was broken. They were beyond rude, and very insulting. Would never stay there again.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Chennai (Madras), India", "Title": "“Simply superb”", "Author": "Traveller1986_11", "ReviewID": "UR118914998", "Content": "The hotel is a short 5 min walk away from the Laurentina metro station. Check in was smooth and quick. I stayed only for a day. I reached the hotel at 8 am in the morning itself. I left my luggage at the reception and returned later in the day after sight-seeing. The room was spacious and extremely neat. The attached balcony was a huge bonus. The bathroom had a bathtub and was maintained very well. At 60 euros the room was a steal. The breakfast was decent. The Laurentina metro station is the last leg in line B of the Rome metro. So commuting to the Termini station took half hour. If you have to visit the Vatican, then it involves a change of trains at the Termini station.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Chisinau, Moldova", "Title": "“cry from the heart”", "Author": "Alex L", "ReviewID": "UR118683795", "Content": "I have never meet in my life so improper stuff. I am not consider myself a super smart man, but it is very hard to explain them the simplest things that 2+2=4. The hotel has 4 stars, but really the maximal number of stars could be 2. The kitchen is very poor and dirty, but the internet access is for money, 24 hours for 6 euro, which in my point of view is incredible. Everywhere it is usually for free. Also you have to pay daily a city tax of 3 euro without any invoice, because they refuse to give it to you without any logical reason. In the other hotels of Rome there is no problems with invoices. I have payed for a double room, but they gave me a single one. I could write more and more, but I will stop here. Just want to suggest everyone to not go there. I have never commented the situation in any hotels I stayed, but this one I really hate.", "Date": "September 28, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“The Worst Hotel in Italy - AVOID”", "Author": "Alex15_001", "ReviewID": "UR117896190", "Content": "After traveling from Venice to Pompeii - stopping over at various hotels, seeing some beautiful sights we stayed at the Hotel American Palace EUR which we booked via lastminute.com We arrived at the hotel - the check-in seemed rather pleasant with smiles all round. The interior in the communal parts of the hotel seemed that of a 4 star hotel, rather grand, rather well kept. We thought we had chosen a good hotel which was nice after a long afternoon drive from Florence. We weren't taken to our room, our bags were not taken for us, and were left to our own devices to find the room. This is something that is expected to at least be asked in any accommodation above 2 stars, nonetheless we found the right door. As we entered the room, we literally couldnt believe our eyes. The room was a about the size of the double bed, had to have our bags piled up on top of one another in order to get to the bed. The walls had various splash marks of various beverages, black marks, cobwebs on the ceiling. The paint had faded, the carpet had filthy stains on, the curtains looked like they had never been cleaned, there was dust everywhere, the lights flickered - far below par. The bathroom was filthy, with mould growing everywhere, the tiles laid in the bathroom were faded in parts, the shower door did not close, water leaked everywhere. The fan made a horrible noise, and the air conditioning which barely worked only had 3 options which were all very noisy. After seeing the state of the room, we went down to complain to the management. Although they remained vaguely correct and polite they seemed to think that there was absolutely nothing wrong with the room and stated that if we had paid €150 or more for the night then we would have had a completely different room. I am afraid that being a hotel pretending to be 4 stars ALL rooms need to adhere to certain standard. None of the standards one could expect even in a 1 star hotel were met. I believe that even a youth hostel would have been cleaner and better kept. We reluctantly remained in our room as the management seemed to turn a blind eye to the problems they have in their hotel room. We found a minibar which could barely be opened with greatly overly priced beverages, an old fashion, small (12\") TV stashed above the minibar - something you might find in a movie from the 80s in a cheap motel room. About the size of the minibar below. Despite the double glazing we could hear the beeping and cars running from the dual carriage way below. The mattress was firm in places and soft in others - luckily the sheets seemed a little cleaner than the rest of the room. Very disappointing. The nightmare however didn't stop there. We had breakfast - thinking that just like any other four star hotel, breakfast would be rather good. However to our great disappointment - there was no orange juice, just super sugary concentrated liquid which appeared orange which came out of a machine from the 60s. The coffee came out of an automated machine from the 80s which clearly hadn't been cleaned in months, if not years, the coffee tasted disgusting. Absolutely vile. The croissants were not fresh - tasted stale - even with the jam / cream inside. Despite us being right between the middle of the serving hours for breakfast they had run out of butter and jam as well as croissants just before we returned to our room. Something not correct there. The people working on the floor for breakfast seemed obnoxious and expected us to move out of the way when they wanted to pass without any polite words, a simple \"Thank You\" would have done. We were very glad that we only spent one night in that hotel - and would NEVER return to it - even if we were paid to do so. Extremely disappointed, felt robbed and made our night in Rome quite simply rubbish. The check-out was somewhat less polite, more rushed, and seemed they just wanted us out of the hotel. All in all a terrible experience, just hope that people would avoid this hotel - I am absolutely positive that even a youth hostel would be better - as well as better priced. This was not worth spending any money on. All in all... AVOID AT ALL COST! This is a scam of a hotel, a complete shambles and I will be reporting to the health & safety as well as sanitary authorities as this hotel is just vile.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Linkoping, Sweden", "Title": "“Adequate value for money you pay - good enough for short stay”", "Author": "kasilka4", "ReviewID": "UR115885093", "Content": "It was good enough for a long weekend stay, but I wouldn't choose this place for loner stay. We had the window from the main street side, which caused that it was loud, even at nights (regardless blinds) and we didn't use our balcony at all. The room was reeeaallyy tiny, but clean. Two people could hardly move around. Bed was comfortable and good continental breakfest, which for both of us was more than enough. The price was very appealing and this is why we did not have extreme expectations. We knew that the hotel is far away from city center, but if you buy a card for metro, you can easly get everywhere, because hotel is very close to Laurentina metro station and it was the biggest adventage. Generally speaking, value adequate for money you pay and good enough for a short stay, when you sightseeing most of the time and need hotel only for sleep and breakfest.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Boise, Idaho", "Title": "“Good for the money!”", "Author": "JessEE221", "ReviewID": "UR115769971", "Content": "It is not really close to any of the tourist attractions but we were pleasantly surprised by the quality of the room for the price we paid. It was clean, safe, and a quick walk to the metro. There was a restaurant in the hotel but we chose to eat elsewhere (not many choices late at night). We were disappointed that you had to pay 6 euros for the internet as this amenity was included in all our hostels and hotels we stayed at elsewhere. It would have been nice for them to provide that service for free. Overall it was a fine place to stay and we were happy with the price", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Ashburn, Virginia", "Title": "“Small, old, worn out....”", "Author": "xuvirginian", "ReviewID": "UR115538165", "Content": "I just wrote one review but I did not see it from Trip Advisor. SO I want write about it again to let people know what they can expect for this worn out hotel. This American Palace does not hold any American standard. I verify all the reviews that mentioned its small room, dirty look carpet, out od date AC that even can't cool the tiny room. Not only the rooms are small that two people can't get around (smaller than my kitchen), the elevators too. TV is like 1970's black and white type. Gosh, I just can't believe it's still running its business. The pictiures on internet must be 50 years ago and did not show its true face at all. I don't care about the price. I think it should have a complete renovation before it operates again. There is no fitness, spa and swimming pool. It's super 6 in Rome.", "Date": "July 19, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Perugia", "Title": "“A joke!!”", "Author": "Anaisabelmartinez", "ReviewID": "UR108157410", "Content": "Well, anything I can say about this hotel is negative: who gave them four stars?? the rooms are for dwarfs, tiny little rooms, no a/c that makes the room feel as a sauna, the guy at the reception is rude, have no manners and his English is very poor. I wouldn´t give them not even 1 star, it is just a pension, not a hotel. if you have a look to the webpage, looks beautiful and elegant..nothing further from the truth. We managed to get a new 4 stars hotel, a real one! Do not go there unless you are masochist or you are a backpacker.", "Date": "May 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Pleasantly surprised !!”", "Author": "oldbutlively", "ReviewID": "UR101490464", "Content": "After reading various reviews on this hotel, we were pleasantly surprised to find that it wasn't as bad as we had expected, yes the room wasn't the biggest we had stayed in, but it was clean, the beds were done every day,& there was a FREE safety deposit box in the wardrobe, the bathroom was spacious & the towels clean & plentiful.We had the breakfast, which was included in the price( cereals, yogurt, cheese, ham, bread, jam,croissants,cakes, apples, fruit juice & coffee ) but the restaurant & bar are expensive.Turn right out of the hotel, past the petrol station on the opposite side of the road, we found a cheap little shop for water & beers, next door is a pattisseria for good affordable pizzas & cakes, there is also a shop selling kebabs & pastas.The location is very good for the Metro,& we bought Roma Passes, which can be used on trains & buses,& gets you into the Colosseum without queuing, which was a bonus.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Moscow, Russia", "Title": "“Hotel American Palace EUR”", "Author": "gawab", "ReviewID": "UR96540798", "Content": "Excellent location: close to metro Laurentina, where 15 minutes before the main station of Termini in a straight branch. In the center of all the hotels are expensive and with small numbers, but here the normal hotel for good money! Good breakfast buffet, everything is always fresh. There is wi-fi for 6 euros a day (not per hour)", "Date": "February 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chios, Greece", "Title": "“Just ok”", "Author": "anodem", "ReviewID": "UR95487331", "Content": "It is 150 m from the metro & bus station and that was great. Every day we had a rich breakfast. Our room was at the last floor but it was warm. It was clean but they can do it better. Furniture is old and so are the carpets... Personel was very helpful. We wanted a hotel for sleep and breakfast and that was just OK. We stayed there through a good offer from internet so it wasn't so expensive for us.", "Date": "February 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“I hate Rome after this hotel”", "Author": "Maccke", "ReviewID": "UR92128399", "Content": "The worst hotel I ever been staying in. Never, ever, seen such rude people working in a hotel. 1. Hotel threaten to call the police when I was ripped off by a taxi driver. Instead, I was hoping to get some help from them. 2. Bar: Had to wait for 20 minutres to order, more than once. 3. Breakfast: Terrible breakfast. Was like a joke. This hotel is very close to the metro. Problem is, it's far away from the city centre..", "Date": "January 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Inverness, United Kingdom", "Title": "“Great Value for Money”", "Author": "Julie186543", "ReviewID": "UR82895730", "Content": "We have just returned from a 4day stay in wonderful Rome and I must admit when I read the reviews for this hotel my heart sank, but im not sure what people are looking for in a cheap break the cost of our room was £168 I suggest if you are looking for a true 4star then look at the price for betwen £500 and £800.our room was clean and comfortable with clean sheets every day. The staff couldn't have been more helpful-we arrived at 10.30 in the morning and they had a room at the back of the hotel ready for us as requested and gave us great information on travel on the metro etc. The breakfast okay could have been more varied but you don't expect a full english breakfast when in Rome and there was plenty of ceral eggs ham etc. I have stayed in far worse hotels here in England and paid much more so don't believe all you read. The metro was just a short walk from the hotel and you were at the centre of Rome in approx 30mins-we didn't eat at the hotel in the evenings prefering to stay in the city for our evening meal-which we could enjoy knowing what we had saved on the room -expect to get treated by the staff as you treat them. All in all a great trip and I would certainly stay there again ***", "Date": "October 10, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“SO NOT IMPRESSED!”", "Author": "citytraveler30", "ReviewID": "UR77253572", "Content": "i spent so much 2 have fun with my family, but the experience at the hotel was so not worth it! first probably cos we are black, they treat us funny, stare, snoop around. then they ask for our passports.....what on earth? the location is great cos of the train and bus station, buth the services were tooooo god damn poor. the staff, especially the receptionist was all so rude. i guess the only thing i liked was the breakfast! ps; only 2bout 2 computer systems with internet access, which we had to pay so much for, considering the fact that we paid for two rooms for a week! no form of recreation centre or entertainment.....its a place for the aged", "Date": "August 28, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Milan, Italy", "Title": "“Nice location, poor hotel”", "Author": "icemandvd", "ReviewID": "UR74934328", "Content": "I use to reserve this hotel because of its location, only for business purpose; morever, the Metro and Bus station is really close to it. Service is essential, rooms are clean, breakfast is average. Indicated for business, but probably not a good pick for turism.", "Date": "August 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "2"}, "AuthorLocation": "italy", "Title": "“Four star - My Ars3!!::((((”", "Author": "ItalyBonnienclyde", "ReviewID": "UR68279613", "Content": "This four star establishment has a third world standard. The rooms are Tiny!! Firt they tried to put us in a loft room where there was approx 1 metre of space where you can stand uprght!! Then they tried to allocate us to a roo that had no space around the bed!!! What part of four star do they not understand!!??? The staff are totally incompetent a bunch of italian manuels from faulty towers. Were advertising world cup games in the patio garden but due to the \"crazy\" bar manager not reading the world cup schedule the games were not even showing. At reception they blamed each other and suggested i walk 1KM to a pizza returant to watch an England match. Basic aenities like an Iron would be nice!! Im not used to having to carry one on my holidays- And the service is so surly here my heart beats if dare disturb the staff for anything- Only for the strong hearted!!!!", "Date": "June 22, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "London", "Title": "“Avoid! Not a 4 star hotel. Terrible.”", "Author": "mec_uk", "ReviewID": "UR64940590", "Content": "I stayed at this hotel for 2 nights on a busines trip as it is in the business district. Our passports were taken when we arrived and they did not even say what for, or when we would get then back. The lift was tiny (just big enough for 2 people) and very old. The decor of the room was very dated (think 1970's - and I am not exagerating) all the fixtures and fittings were old, there was a tiny TV and even though I had requested a double room (at a cost of €200 per night) I was given a twin room. It was the end of the May (around 25 degrees) and I had a east facing room, so the room was hot (as the air conditioning did not work) and in the morning the room was unbearable with the sun shining through. Ridiculously old blinds that you have to draw closed, a terrible breakfast and rude staff (apart from the barmen) make it one of the worst places I have ever stayed in. Seriously, avoid at all costs.", "Date": "May 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Avoid at all cost - not a 4 star hotel!”", "Author": "VikDiv", "ReviewID": "UR64374716", "Content": "We stayed at this hotel for a few days and upon arrival we were treated very rudely by the receptionist. Upon checkin she demanded our passports, didn't say what for and didn't say when she would give them back when I questioned what she needed to keep them for and can I have them back! The tiny rooms were really dated and there was not any air conditioning so was very hot in our rooms. It was also very noisy. I wish I checked this site before booking and now I always will before booking any hotel as pictures on booking sites make it look really good. Breakfast was nothing special either", "Date": "May 17, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Leuven, Belgium", "Title": "“Avoid this hotel”", "Author": "Tanchick", "ReviewID": "UR62103403", "Content": "Luckily I didn't pay for this - my company did. The room was tiny, with tiny old tv, and didn't look very clean either. The walls seem to be made of carton. Don't even hope to get any sleep while your Italian neighbours are watching football! Wake-up call on the phone didn't work. Called reception to notify about this and asked to wake me up at 7:30. The phone rang at 7:00. Breakfast is a full self-service: all, salt, napkins, silverware you have to get yourself. Juice comes in plastic cups and tastes like plastic, too. When my secretary tried to cancell the rest of my stay they said that I could check out if I like, but the whole amount will be retained anyways. It cost € 1180.00 for 8 nights. There are wonderful and cheaper hotels in the neighbourhood!!! And everytime I was at reception, there were people complaining about the rooms.", "Date": "April 21, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Firenze", "Title": "“Bad experience with Credit Card”", "Author": "stefano32", "ReviewID": "UR57074121", "Content": "The hotel allow third parties tu use its name logos and all info that can give you the idea to deal with them and the you book giving the data of your card to others. In case of problems they simply anwer saying that this site is not their official site. Have a look and site www.hotelamericanpalace.com.", "Date": "February 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "1", "Rooms": "1"}, "AuthorLocation": "london", "Title": "“Do not stay here realy run by theives!!!!!!!!!!!!!!!!!!!”", "Author": "chezpete", "ReviewID": "UR54555893", "Content": "We stayed here for 4 nights.First morning 210 euros stolen from wifes purse during 20min period at breakfast.Staff said it was usual and did nothing.reported to police station,they did nothing!!! except appear at hotel for their free breakfast and coffee next day.No manager there to complain to, was away! convenient Eh!This hotel appears to be RUN BY THEIVES alongside the corrupt police.REALY REALY DO NOT STAY HERE. Even to eat out you have to travel by metro as there are no eateries even close.", "Date": "January 28, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Venice", "Title": "“Miserable tiny single room”", "Author": "ziachecca", "ReviewID": "UR52844469", "Content": "It was not my first time in Rome and this has definitely been the worst hotel I've stayed in. My colleague and myself both had a tiny room where we could barely walk through. The staff hasn't been nice at all, excluding the concierge, who was a friendly man. The first impact, as we took a look at the entrance and the corridors, was positive. Breakfast room and common areas are nice, but the rooms we have been provided were probably the most miserable ones we have ever slept in. I can't believe they were 4 stars rooms!! Tv and other elecrical devices cables were hanging everywhere, and I am not kidding! I could barely walk to the bathroom as the bed was just invading all the available space. As I left the hotel, I could see inside othe rooms, as waitresses were working with open doors and I have to tell they were generally bigger than our rooms. My company paid quite a lot for the room, and I think it was totally overpriced. If I need to go back to Rome, I'll stay in any other hotel but this one, which is also located in an unpleasant area.", "Date": "January 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Auckland", "Title": "“Worst experience ever!”", "Author": "caleypl", "ReviewID": "UR52031833", "Content": "EUR is a terrible area to stay, if you're going to Rome for a holiday, go to my reviews and stay at the Hotel Saturnia, it's MUCH better and cheaper than this place! I had read the reviews online before booking this hotel, however it was the only place even close to where we needed to be for a convention, so if you're thinking of opening a new hotel in the area I say go for it. We were put into a single room, where there was a single bed affixed to the wall and they used a piece of wood and added another single bed next to it to make an uneven double bed which was two different heights! This was APPALLING! To add insult to injury the shower was SO filthy, I have never seen so much mold in my entire life! It was as if it's never been cleaned. The reception staff were rude, and had no manners. They all need to learn how to speak English considering the name of this hotel. Breakfast was so bad that we didn't have it for the majority of the time we stayed there. We couldn't wait to leave and it ended up making our trip to Rome horrible!", "Date": "December 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Kent, England", "Title": "“Not 4* but as per website”", "Author": "DestinyKent_England", "ReviewID": "UR48359453", "Content": "Sold to us by Thomson as a 4* but I would expect more from a 4*. The room was tiny - very little room to move around. Bathroom had all amenities but very cramped. There were 2 of us & on day 3/4 we finally got 2 bath towels - changed daily and room cleaned daily We did have a safe but no air con in the room. The staff were polite and helpful. The breakfast arrangements were good and as mentioned on other reviews, the same every day but with plenty of choice. On the day we arrived it was nearly lunchtime and we had the lunch buffet for 7.50 euros. The buffet was open to anybody and was well used by the locals and business people and offered a good choice and as much as we wanted. It is located at the end of the Metro line and probably not the best location for a visit to Rome - however a short 5 minute walk to the line & acess to Rome via the metro was on the doorstep. However, there is nowhere other than the hotel in this vicinity to eat or anything to do in this area so essential to stay the day in the centre and eat before returning. We did not use the restaurant in the evening. We bought a 3 day tourist travellor pass (advertised in the hotel) for 25 euros each which proved very useful giving us unlimited use of boith metro lines and the open top bus giving us easy travel around the centre without having to keep buying tickets. Would not recommend as a 4* or as an ideal hotel for a leisure city break due to location. We were surprised to see a high police presence (having breakfast there every day) and parking several vehicles outside the front of the hotel.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "florence", "Title": "“I'll never stay here again”", "Author": "jesterius", "ReviewID": "UR47385334", "Content": "I stayed here for about 4 days and the staff was very rude, the rooms unclean and the amenities non existent. We'll never return in this hotel.", "Date": "October 21, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "London", "Title": "“Avoid this hotel if you can. There are hotels with a similar price tag located more central.”", "Author": "nukoshka", "ReviewID": "UR46070477", "Content": "Upon arrival they tried to put us into a single room with a further mattress squashed into it. There was no space left, even to get around the bed to the bathroom, mind you put a baby cot as we were travelling with a baby. Then they moved us to another room, also tiny, but at least there was about 40cm to the wall and we managed to put our son’s pop-up baby cot for him to sleep. The room was very old, dirty walls, bathroom about 15 years old, chipped tiles, grey sink and toilet. There is only central ventilation in the hotel which is turned off at 10pm and considering that the room is so tiny, after 20 minutes it gets very stuffy and hot. And we were not even in the summer. No idea how people cope when it is really hot outside. You cannot open the window, only the balcony door, but if you are unlucky to get the room facing the motorway, you will not be able to sleep as trucks and cars pass by all night long. Also I caught a cold because of the open door. When we asked to move at least to the other side of the hotel, we were only offered the same single room they tried to put us initially. If this was a 2-3* hotel – would not be surprised. No idea how they keep their 4* rating.", "Date": "October 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "CT", "Title": "“Great location for a good value”", "Author": "Shaps2", "ReviewID": "UR42689398", "Content": "My daughter and I accompanied my husband on his recent business trip to Rome. As he had to travel to a neighboring town each day this hotel was chosen to enable him to easily hop on and off the highway. Had we been traveling for pure pleasure I would have chosen a smaller hotel that would give the flavor of the Italian culture. This hotel is run as a business so it is not warm and fuzzy as some of the reviews of other hotels indicate. However, I would not hesitate to stay at The American Palace again. It was across the street from the Laurentina Metro stop (last stop on the blue line) and the bus station and had a taxi stand next door so transportation to central Rome is easy. My daughter and I used the Metro every day to travel into historical Rome, usually to our favorites stop, the Colosseo. The trip cost 1 Euro and took less than 15 minutes. I read many negative comments on this site about the included breakfast. While the same food is offered everyday, there is enough variety that no one person could eat all of the items at one breakfast. I stayed 8 nights and ate different foods each morning. While the food is not gourmet, the free breakfast saves the expense of one meal out - leaving more money for delicious late night dinners and gelato. As we were 3 peole for part of the trip we had a suite with a bedroom and my daughter slept on the couch. When she left the hotel did not make us move to downsize but did reduce our nightly rate which I thought was very nice. The staff were polite, again not warm and fuzzy, but we did not have any issues with bad attitudes -something that was mentioned several times in other reviews. A bonus of staying outside central Rome for this trip was that our stay in Eur let us experience a bit of the residential part of Rome. I would definitely recommend this hotel and stay here again.", "Date": "September 18, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "nottingham", "Title": "“Its a no no”", "Author": "happywanderer0", "ReviewID": "UR32913090", "Content": "Having travelled extensively, this has to be one of the worst 4 star hotels stayed in. Booked through Thomson, thinking it would be ok. It can only be described as 2/3 star. Expensive for what we got. Room and breakfast adequate. Cleaning leaves a lot to be desired! Bathroom needs total refurbishment. Got balcony-great!! no furniture?! Staff-surly and totally dont want to know. Plus side- there is a great supermarket just down the road towards the metro station and a great pizzarie (eat in or take away) Advice- use room, with fridge and self cater!!!", "Date": "June 22, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "DFW", "Title": "“This was no palace..trust me”", "Author": "thezackman", "ReviewID": "UR32530213", "Content": "First the good... The location is right across the street from the metro station, where you can take to subway right into the center of Rome. The hotel also has parking if you drove in to Rome. so..that was a good thing. As for the rest... I thought the staff at the front desk were kind of...well A-holes. Everytime i asked them a question they seemed like they were very bothered by my questions. They were not welcoming at all. When I was crazy enough to ask a question in English(at the American Palace) i was looked at with a puzzled and confused look. Sorry...my fault...right? The walls were pretty thin...(and being a non-smoker) i could smell the smokers in the room next to us pretty well. Also, the breakfast was kind of like pouring a bag of sugar down your throat. So...if you're into that kind of thing, then you're in luck at this Palace.", "Date": "June 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "tlv, Israel", "Title": "“great stay great location great rates and service”", "Author": "Ella35", "ReviewID": "UR32507559", "Content": "we stayed 4 nights and enjoyed it vary much. clean and compfortable, nice staff (speaks eng. ;-) ) the metro is 3 min. walk and takes you in 15 min. to center breakfest is boring- same every day! for the price of one night in the center of rome, we got 4!! and spent it on Ice cream.. If you r not spoiled too much thats the place. anyhow from about 8:30 to 23:00 we were stroling rome - and enjoyed it", "Date": "June 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Tampa, Florida", "Title": "“Average hotel that does not meet up expectations”", "Author": "tenCA951", "ReviewID": "UR31429002", "Content": "(Review is from November 2007) My girlfriend and I were very much looking forward to our Rome trip and we didn't let the inconveniences we encoutered ruin that. The hotel was much further than we expected and we foolishly got ripped off by taking a cab. We took the metro back and if we knew about simple this was, we would have taken the metro to the hotel. When we first saw the hotel, we were a bit nervous about what we were paying for. It is located in the suburbs with no tourist attractions located nearby. Additionally, it's not that great to look at from the outside or the inside. It is, however, located right next to the metro which helped in saving us some money by being away from the center. Quick note on the metro- make sure that they're not doing any unexpected construction at night. We had to walk a bit on our way back from the center until we reached a metro that wasn't under construction. The rooms are very bland and small. We've traveled through Europe plenty to know that European rooms are smaller but this was smaller than expected. Plus the room decor was very bland and the air conditioning was faulty. The restaurant was very good, albeit overpriced. I'm sure that it is overpriced because they expect Americans to stay there due to the name. I recommend the swordfish, it was delicious! The restaurant was also very nice. The continental breakfast provided was pretty standard and if you choose to, there are plenty of markets to stock up on food to save some money. Service was very good and they provided plenty of suggestions. We walked on our first day to Rome's tourist area. Let me warn you- it is a long walk so if you're not up for it, take the metro. We however started early in the morning and always enjoy a good stroll. Rome was great to see amazing sights. Yes it's dirty and crowded, but it's still worth venturing. I would possibly stay here again if I cannot find something reasonable closer to the center and more comfortable. Other than that, I would look elsewhere.", "Date": "June 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Fawlty 4 star American Palace”", "Author": "bergy1001", "ReviewID": "UR30634735", "Content": "We booked this hotel off the back of the photos and the price before reading reviews on the hotel. This trip was our dream honeymoon to Rome and having read reviews after we had booked, we were expecting the Honeymoon from hell. Reasons for booking:- didnt want to be in the centre of Rome with all the hustle, bustle and noise but wanted good transport links into city centre. Location of hotel could not be better as Metro is just across the road and only 15/20 mins to city centre. Upon arrival (11.30 a.m) we were told that we could not check in until 2 p.m.. Basil lookalike and his sidekick Manuel could not of been less helpful in directing us to the supermarket and Metro but as we had a few hours to kill we braved it ourselves. The supermarket is just up the road and we used this regularly to purchase water, wine and nibbles. As a rule you will pay anything from 1.50 - 2.50 euros for a cold bottle of small water from stands and a full 1.5 litre bottle from supermarket was 0.35 euros. Just pray your fridge works in the hotel room. Ours didnt and tried the leaving the door open trick but that had no impact. Couldnt be bothered to complain having read other reviews and the lack of urgency to problems from Manuel & Basil. On the first night we didnt feel like going into the city centre as been up since 2 in the morning. We decided to eat in the resturant. DONT do it !!! we waited a good hour to finally get our meal which was very nice. However, we had a main course each, 2 side dishes and water and it came to 49 euros !!! The wine is ever so overpriced, 16 euros for half bottle!!! you can get a half decent bottle of Frascati from the Supermarket for 3.50 euros.. You do the maths.. The other thing is that they give preference to local Italians over guests and this is blatantly obvious to all!!! Breakfast is only cold meats, bread, cereal, fruit, yoghurt and very continetal.. We had no problem with this as if u want a full english, go to Spain. Unlimited amounts so you can get a good fill before you then go out and treak the city. The hotel was very clean but it seems as though the resturant and bar were run as a seperate business. We insisted upon a double room at the back of the hotel having read reviews of how noisy it is at the front. This was just perfect as we ended up with a suite room which was very large and comfortable. If you can, request the same as the normal double rooms are very small apparently. The maids did a great job every day and left the rooms spotless. Even though we renamed the hotel \"Fawlty American Palace\" we had a pleasant time there and for the cost would recommend. Its not a four star hotel and at best a good 3. Doubt we would stay again but location good for transport and a good base to start from.. not much else around the hotel to do but if like us you are only using it as somewhere to sleep, get refreshed and have breakfast then its just fine..", "Date": "May 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Not up to 4 star”", "Author": "lale1996", "ReviewID": "UR28253999", "Content": "Stayed in this hotel for 2 nights. Breakfast was not bad - coffee machine was not brilliant. Only a choice of cold rolls with ham or cheese, croissants, fruit and yoghurts. The room was very nice - we were on the 5th floor - nice and quiet apart from the room next door had people singing in it until 1am! Television with 1 English news channel. Plenty of lights. 2 large balconies but no where to sit! No duvets. Blankets. Easy to get to from the main Termini in Rome to Laurentina and when you come out of the station it is just up the road. Good supermarket nearby which you can stock up on drinks for your mini fridge in the room (far cheaper than hotel prices). Excellent to get to Colloseum from.", "Date": "April 18, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Haute Savoie, france", "Title": "“Definitely not a 4 star.”", "Author": "cejc", "ReviewID": "UR25558980", "Content": "The positives: the room was clean, the furniture new, the reception staff efficient. The negatives: the (single) room was tiny. The temperature gauge on the (old) radiator was missing, the table map did not work, the door to the bathroom did not close, the windows were single glazed and rattled, the room door afforded no sound insulation and conversations at the end of the corridor sounded as if they were in the room, the gym was small and stuffed with machines (no treadmill though, nor TV). The worst: the night I ate there, there was no menu, no prices, choice from waiter for the second course was \"steak, chicken or pork\", we were offered no bread, no water, no salt / pepper...; the breakfast the next morning was frankly dreadful and seemed to be as cheap as they could possibly get away with - bad orange juice out of a machine (ie not fresh orange), horrible coffee out of a machine; the cheese was plasticky; there were no teaspoons (soup spoons had to be used to eat yoghourt and stir sugar into coffee); you had to find your own table, ask for plates, join long line for the coffee machine. The hotel was busy and I was left wondering who would choose to stay there (I was working nearby) : it looked liked German coach trippers. There appears to be a dearth of good hotels nearby. Stay here if you absolutely have to, but eat elsewhere and as someone else said, don't expect a 4 star hotel.", "Date": "March 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Feldkirch", "Title": "“The Hotel was worth what we paid for although the rooms were small”", "Author": "rufmyri", "ReviewID": "UR16565748", "Content": "Well the hotel was not a typical four star hotel but it was worth the money we paid for our room. The room was very small but clean. We also had a tv and a hairdryer in our room. The staff were very friendly and helpful and even ordered us a taxi without charging an extra fee for it. They also sopke English very well. The food was not bad and for breakfast there was a cold buffet with croissants, roles, fruits and cereals. However it was very crowded and we had to just had to sit at a table which still had dirty dishes on it. For dinner they ask you wether you want water and they will charge you for it. Its not very expensive though and cheaper then water in Austria. The metro is also very close and within 20 minutes you are at Trevoli Station. There was also very good gelateria 5 minutes away. By the taxi stands you turn left and on the right side. We went there twice and it was always full of locals. There are no other Restaurants close so either you eat in the Restaurant there, eat in town or go to a Pizzeria which there are enough of close to the Restaurant. I think that the hotel was worth what we paid for it and the location is also not bad because you are located a bit out of town.", "Date": "June 1, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Bucks, UK", "Title": "“Road Noise and aircon - beware”", "Author": "kevinsedgwick", "ReviewID": "UR15462918", "Content": "When travelling to any country, we all like a nice hotel with good facilities in a decent location. Well this isnt it. 4 star, hardly would be a 2 star if quality was measured. facilities, well it has a bar and a restaurant - but beware the restaurant isnt always open as they book it out for private functions and in this area everything else is closed by 9pm - unless you want an ice cream!!! Location - this is good in that it is the end of Metro B tube line - Laurentina station. Means you always get a seat and its around 25 mins to Termini or Colosseum. The hotel is 3 mins walk to the tube. Location - Bad. Its on a 3 lane main road and the road noise is terrible unless you get to the back of the hotel. Room - just big enough to swing a cat in. I didnt know they still did 12 inch portable TV's either and the channel choice was poor and not aligned to the hotel guide. Bathroom adequate. All in all, good location for me as i was working 5 mins walk away but high road noise throughout the night and lack of aircon will be horrendous in summer months.", "Date": "April 29, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Birmingham", "Title": "“Fine if you don't mind sleeping next to a motorway!!”", "Author": "Lou033", "ReviewID": "UR12259193", "Content": "The noise from the traffic outside could be heard over a resonably loud TV. The TV channels consisted of three English channels two of which were news channels. The bins were emptied at 12.30 in the morning and then again at 2.30 the same morning by a diesel lorry (very noisy!!!) The room was tiny but bearable. We had booked a New Year break and the restaurant was closed the entire time except for the \"breakfast\" which consisted of nothing that needed cooking!!! The bar was open but firstly you had to find the barman and then when there are only two of you sitting in the bar it seems a bit pointless!!! Outside the hotel there is very little (except a few beggars) and you need to use the metro to find any civilisation! The metro system is easy to negotiate but is covered in graffitti and again there are more beggars. The bald headed man on reception was helpful giving us advice on the metro and giving us a map. We booked our holiday through Thomson Holidays. It appears that they no longer accept bookings to this hotel - I wonder why???", "Date": "January 2, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Unfriendly staff and tiny rooms”", "Author": "Peanutchina", "ReviewID": "UR8190304", "Content": "We arrived at Laurentina tube station and yes the hotel is very close, but when we got to reception the guy on the desk seemed totally uninterested and nonchelant. The room we were given was so small you could JUST walk around the bed on all 3 sides. When my partner went to reception and asked if this was the standard room size (knowing there were bigger rooms opposite ours because the cleaners had the door open) we were told that all the rooms were this big. After pulling them up on this we got a larger room 3 days later. The standard of the decor and service does not befit a 4 star hotel, closer to 3. The desk staff were also quite stroppy and unhelfpul. We were told all the shops were closed on Sundays, only to find everything open in town mid sales! Breakfast was mediocre with stale croissants and coffee from a vending machine type dispenser. It is very close to Laurentina line B station, but this line has no air con and all the trains are covered in graffitti. We also managed to come out of the station one night to see a guy with a stab wound staggering around outside which security just ignored! Overall, not impressed with the hotel at all, even less so the staff.", "Date": "July 19, 2007"}, {"Ratings": {"Overall": "2.0", "Value": "1"}, "AuthorLocation": "houston, tx", "Title": "“Looks can definatley be deceiving”", "Author": "kriptonian7", "ReviewID": "UR6589159", "Content": "The hotel itself is nice. looks good, nice setting, cute little outside patio to eat breakfast on. The breakfast selection is large, but not spectacular, get there early or it will be gone. Rooms are clean, and staff is for the most part cordial. i actually got more helpful information from the lady around the corner at the Tabbacci stand. Example, i asked the hotel staff some questions about the area and they tried to sell me a map for 9 Euros and All i asked for was directions to the Banco Roma The rooms are small. I know alot of americans say this when it comes to European hotels, but i have stayed in many, and by comparison, very very small. We had a hard time putting two average size suitcases in the room. You can lay across the room longways and touch each wall toe to fingertip (5'9\"). Room had a nice little balcony, but we were on the street side, and it was very load all times of day and night. A/C I think was for show only. The best attribute about the hotel is not the hotel itself, but its location. It is set on a business block that is compariable to a small outside neiborhood mall here in the states. The street next to the hotel has a variety of small cafes, a gelato shop, pharmacy, clothing, tabacci (stamps, magazines, cigarettes, ect..) And about 5 banks that are perfect for currency exchange. (do not use the hotel, their rates were outrageous!) Also the hotel is located about a 5 minute walk from the subway station. Very nice, but it is about a 25 mintue ride into the heart of Rome. All in all it was an ok stay but i would", "Date": "January 13, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "South Wales", "Title": "“Don't Stay Here”", "Author": "Scott_Victoria", "ReviewID": "UR6168925", "Content": "Just returned from the worst holiday of our lives. Not only was the hotel a disappointment but my wifes handbag, which contained all of our money, credit cards and her mobile phone was stolen with us being out of the room for only ten minutes. No safety deposit box in the room and no help from the hotel until we met with the manager the following day.", "Date": "November 23, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Scotland", "Title": "“Expedia advertise it as 4 star.......Realistically its only 2 star!!!!!!!”", "Author": "Ulysees31", "ReviewID": "UR5772722", "Content": "I tend not to complain about hotels as I use them often for work, but come on expedia, this hotel is not a 4 star property!! The 1st room provided was barely big enough to fit 1 case let alone 2. After some polite complaining we where moved to a bigger room and thank the staff for that. Unfortunately the AC was naff and more of a noise than a convenience. The rooms where clean but the mini bar was pointless and many refreshments where supplied at a third of the price from the nearby supermarket. The breakfast was fine as long as you arrived before the coach loads and if you sat long enough the continental fare was replenished. The restraunt was closed for the entire duration of our stay.....or should I say all of August, nothing in the website to state this, August is a Roman Holiday. No fault of the hotel, but it should be advertised at a lower star rating. The plus point is that it is literally a stone throw from the metro which drops you off at all the main areas of intrest for a decent sum of money for unlimited travel- Buses, metro and trams. If this hotel was properly advertised at the star rating it deserves I may have given it a decent review but this is certainly not a four star hotel, maybe the suites, but not the general rooms.", "Date": "September 5, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "London UK", "Title": "“Oh Dear! Don't Stay Here!”", "Author": "merylmel", "ReviewID": "UR5710770", "Content": "Just came back on 25th August after a week at this hotel. Why should you not stay at this hotel? Let me count the whys: The rooms are TINY. The hotel advertises 'air conditioning', but in our room, 401, it was so ineffectual, we could not sleep the first night. When we complained about it we got a shrug and were told that the hotel was full so the aircon didn't work so well. The hotel lobby was well air conditioned 'though, so I thought this was illogical. They made no suggestions to address this problem and I had to ask for a fan, which was the only thing that made the room temperature bareable. It made a lot of noise and meant we had to walk over the bed a lot. The so called minibar consisted of a quater bottle of sparkling wine, 2 cans of soft drinks, 1 beer, 2 small bottles of water and 2 small fruit juice cans, all of which were warm. No food. We eventually realised that the casing around the fridge was hot to the touch and that opening it made the fridge work better, but I think there is a real health and safety issue here. The reception staff, apart from the blonde woman, were very good at avoiding any contact with you and were extremely brusque when they were forced to acknowldge you. The hotel could not provide me with an iron so I was forced to send some items to be ironed and the hotel lost them, forcing me to wear dirty clothes in the meantime.. Eventually they found them and, when I checked the list, they had altered the tarrifs without telling me, charging me more. I left a clear plastic bag of underwear in the bathroom and they threw it away! When I complained I was told I must have left it 'Near the bin'. Hard not to in a floor area of 3 feet square. Room 401 and 2 other rooms that we saw had dark marks and stains on the walls and were in dire need of redecoration. The hotel advertises a 'free breakfast' but, if you want eggs or bacon, you have to order it for your room at 5 euros each - when we sampled this delight, it was hideously inedible. I mean, really, don't. The breakfast downstairs included bread that was stale by 10am, 'coffee' and 'juice' machines that produce liquids almost but not entirely unlike coffee and juice. The bar area is advertised as open until 11.30pm but it was left unattended most of the time and closed by 10 on at least 2 occassions. Also, the restaurant was closed all the time that we were there. On the small plus side, there is a beautiful tiled court yard with nice tables and chairs surrounded by lime trees. The linen and bathroom were all very clean and they knocked off 15 Euros when I complained at the end of our stay. But still, I shall never set foot in this awful hole again.", "Date": "August 26, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "UK", "Title": "“Have stayed in better B&B's!!”", "Author": "Chelle1981uk", "ReviewID": "UR5580755", "Content": "My boyfriend and I have just got back from our holiday in Rome. We stayed at this hotel for 4 nights - do not be fooled when it says \"3 stars\". Our room was rather small and the breakfast was awful! It stated that breakfast was served between 7am and 10am. On our first full day in Rome, having got to the airport very early in the morning, we went for breakfast at 9.30am - bad idea! All that was left was cereal and dry bread buns! No croissants, no toast - nothing! And the kitchen people were clearing everything away. The tea machine wouldn't work either. The next morning we went at 7.30am and it was very BUSY - lots of food but extremely busy so I suggest you get up early for a decent breakfast! The staff on reception were very un co-operative and far from polite, they were also very unhelpful. There was only one guy there that would say \"hi\" and \"please\" and \"thank you\". The only good thing about the hotel is that it is 2 mins away from the Metro station and there is a bus stop right outside the hotel. No restaurants are in the nearby area so you're better off going into a place called Barberini (change at Termini to Linea A) - the restaurants there are fantastic and really cheap. Overall this hotel was one of the worst I have stayed in so be advised if you're looking for a nice 3 star hotel - don't stay here!!", "Date": "August 9, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "2.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Cumbria, England", "Title": "“Clean but cramped”", "Author": "A TripAdvisor Member", "ReviewID": "UR5437409", "Content": "We have just returned from a 4 day break and thought this hotel was clean and reasonably comfortable although the rooms are rather cramped. The Metro is a short walk away but across a busy main road, trains are frequent and the journey to the centre is around 15 - 20 minutes. We purchased a ticket for 4 Euro each, this lasted all day with unlimited journeys and we found it a convenient if crowded way to get around. We stayed on a B & B basis, breakfast is a buffet which is pretty average and the one night we had dinner in the hotel was a disappointment as both the service and the food were poor. Would look for a more central location next time.", "Date": "July 7, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Los ANgeles", "Title": "“Good Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR5410877", "Content": "and it took about 27 euro to reach the hotel. The staff was friendly and the hotel seemed nice. The rooms are kinda small but I guess its fine. The metro station was just across the hotel and the Vatican city station and the Collesseum is not too far away... Also the trains run late in the night so you can come back late. They serve breakfast in the morning which is pretty good. They have a restaurant inside which is open late too. Also there is a pizzeria near by where I went and bought food at about 1 AM. I would recommend the hotel...And yeah Rome is totally WORTH it.", "Date": "June 29, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "2"}, "AuthorLocation": "United Kingdom", "Title": "“Room over the front doors and by the lift”", "Author": "A TripAdvisor Member", "ReviewID": "UR4735094", "Content": "Room at front over front doors and main road. Very noisy. Also right next to lift. In dire need of updating. Food excellent though, good breakfast. Most staff helpful. Had ordered a taxi from the airport to the hotel, they forgot so had to get one myself. First night there, they would not let me eat in the restaurant because they had groups! I had just arrived from another country and was sent up the road to greasy joes to get something by the restaurant manager. I had a kebab and ended up with Diahorrea.....I kid you not!!! OK if you are on a budget.", "Date": "March 26, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Quezon City, Philippines", "Title": "“Average Hotel”", "Author": "geminitraveller", "ReviewID": "UR4046646", "Content": "Stayed at this hotel in conjunction with our tour. It's quite far from the city attractions but it's a few minutes walk to the metro. The rooms are average but it has a nice restaurant near the lobby where you can get great food at low prices.", "Date": "October 24, 2005"}], "HotelInfo": {"Name": "TOP Hotel American Palace EUR", "HotelURL": "/ShowUserReviews-g187791-d205038-Reviews-TOP_Hotel_American_Palace_EUR-Rome_Lazio.html", "Price": "$66 - $272*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Laurentina 554</span>, <span class=\"locality\"><span property=\"v:postal-code\">00143</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "205038", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/08/0c/080c261857bda495b9396b87508251e95large.jpg"}}