{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "durham", "Title": "“first time in rome”", "Author": "roxycook", "ReviewID": "UR128327733", "Content": "fantastic stay at the hotel clodio a very warm and friendly hotel the staff were excellent, especially Carmine who give us some great tips. a good choice was on offer for breakfast lots of pastries and if you asked the waitress they would bring you a capachino ,I would recommend this hotel for anyone who likes to walk as it is a 20minutes from the vatican walls .", "Date": "April 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "5"}, "AuthorLocation": "basel", "Title": "“Good for what it costs”", "Author": "ericlaudia", "ReviewID": "UR127280487", "Content": "Good distance from the center, near to public transportation and walkable distance to center, even with baby buggy.. Personnel outstanding, definitions of cleanliness vary depending on who is on duty. I would definitely stay here again, we have the suite though, which is pretty newly remodeled.. Don't know about the rooms.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Fantastic stay”", "Author": "Tony N", "ReviewID": "UR123938045", "Content": "I was staying at the Hotel Clodio for a long weekend and after asking for a nice room at the reception, i was assigned to what i was told being a newly furnished room. The room was very spacious, and with some nice amenities like Nespresso coffee etc. The bathroom was very nice as well as the terrace. I was travelling with my partner and we enjoyed every moment of our stay. The breakfast was also totally satisfactory", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "atlanta", "Title": "“Nothing Fancy”", "Author": "kendr390", "ReviewID": "UR122250328", "Content": "If you need to rest your head this is an average hotel. Nothing fancy about it at all. Elevators are slow and SMALL so no more than 2 people w/luggage at a time... no luggage you can fit 4. Thats about on this hotel. The breakfast was very good and a good assortment of pastries, beverages and even had bacon and eggs.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Bologna, Italy", "Title": "“It’s not a 4 stars hotel without a renovation in the rooms!!”", "Author": "albyIMF", "ReviewID": "UR120068164", "Content": "I stayed in Hotel Clodio in the first weekend of October 2011 for work. The hotel is located just below the “Montemario” hill near the headquarters of RAI. The hotel is officially a 4 stars hotel but when you get out of the elevator I can’t find immediately my room …. My room hasn’t have the door as the others rooms because it was in renovation … so I check all the other room numbers to be sure that the horrible door was effectively my door room. The room is quite spacious but the furniture is old and you have the sensation that all the furniture would be renovated and not only the door!! The hotel has a nice terrace on the roof which is divided in 2 parts: on the left side you have nice sofa and low table, on the right side there are some tables and the chairs very old!! Please renovate all the terrace!! The terrace is just below the “Montemario” hill and you can see a nice view!! The breakfast in nice with a lot of good food where you can meet some Italian TV famous people. The hotel is not a 4 star hotel without a renovation in the rooms!!", "Date": "November 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Calgary, Canada", "Title": "“Authentic Charming Italian Hotel”", "Author": "Rocks_to_travel", "ReviewID": "UR118593227", "Content": "I had the chance to stay at the Clodio hotel in Rome in September, 2011. The hotel is located in a residential area about 1.7km directly north of the Vatican. The hotel is frequented primarily by Italians and there were very few non-Italian tourists at the hotel. The hotel is on a quiet side street and has a very unassuming front to it. The staff is quite friendly and speak English perfectly (probably other languages too). There are two different sized rooms available that I am aware of. I stayed in quite a large room that had a couch and a very large private patio overlooking the street. The rooms are very clean and well appointed in a typical European manner. Internet WIFI is available from the hotel for 4 Euro/day. They have a very good continental style breakfast that includes many breads, pastries, cold meats, fruit as well as scrambled eggs and ham. I am not sure if they have a full restaurant as I never checked it out. They do have a rooftop patio. There is a breakout/conference room for groups up to 20 or 30 on the main level. There is also a bar that opens around 7PM on the main level. There is lots of couches and seating space just off of the lobby. As far as location, it is not the most convenient to the main tourist attractions (except the Vatican). The Vatican is approximately a 20 minute walk away. Otherwise the Coliseum is over an hour walk (about 5.2km). A taxi ride is approximately 12-15 Euros to the gates of the Coliseum. This walking will have to be your fitness regime as there is no fitness centre that I am aware of in the hotel. I would highly recommend this hotel if you want to avoid touristy hotels. Ask for room 110 if you can get it, it is worth it.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "los angeles", "Title": "“great hotel, amazing location and helpful staff”", "Author": "vrotelli", "ReviewID": "UR56801617", "Content": "Was really impressed with the rooms and service at the hotel. It is located in close proximity with many of the landmarks in Rome. The staff is very curtious, helpful and very knowledgable. Loved the breakfast to start the day off on the right foot. It was one of my favorite hotels during our European excursion. I recommend the room with the balcony so that you can take in the beauty of Rome.", "Date": "February 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Kansas City, MO", "Title": "“HOT HOT HOT”", "Author": "MissKris816", "ReviewID": "UR45901585", "Content": "I was miserable during my stay at this hotel. After walking around in the humidity of Rome, I often found it warmer once I got to my room. You could hear the air conditioning, but nothing came out. Several of my girlfriends also said their rooms weren't air conditioned. I was finally moved to a room with air conditioning, but it was at the end of my stay. The location is good, but save your money for a hotel with working amenities.", "Date": "October 5, 2009"}], "HotelInfo": {"Name": "Clodio", "HotelURL": "/ShowUserReviews-g187791-d205020-Reviews-Clodio-Rome_Lazio.html", "Price": "$111 - $1,324*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Di Santa Lucia 10</span>, <span class=\"locality\"><span property=\"v:postal-code\">00195</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "205020", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/a3/b5/a3b56bcbe30d1e1420ea1d1d4c28f6fa1large.jpg"}}