{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Liverpool", "Title": "“Stayed one night”", "Author": "StuartLiverpool", "ReviewID": "UR127350329", "Content": "We stayed just one night and can't say we were very impressed. There was no safe in the room and one lamp didn't work. The lock on the door was sticking so it was easy to get locked out. The decor was very old fashioned, faded glory, and the corridors in particular looked very tired. We would not rate this as a four star hotel in the UK. There was an ironing board and dirty washing in the corridor for the time of our stay. On the top floor corridors paint could be seen peeling off the ceiling. Breakfast was OK but overall we felt disappointed. The position was good for all the attractions.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ringsted", "Title": "“Nice Hotel”", "Author": "TwoDanesRingsted", "ReviewID": "UR127279280", "Content": "Very nice little hotel in the heart of the city. Very friendly staff. Nice continental breakfast. Will be back in the near future.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“A great home base in Rome”", "Author": "alexNewJersey", "ReviewID": "UR127085302", "Content": "This hotel is in a historic building in a central location 5 min. to Piazza Navona and Pantheon. Our room, a triple, was spacious, high ceilings, comfortable, clean. The bathroom was roomy, very clean. It was a street facing room but shutters and thick windows kept street noise to a minimum. No ear plugs necessary. The beds were comfortable. My daughter loved her daybed. The hotel front desk staff were proffessional and helpful. They called taxis for us every day. The breakfast was served in a below-street level dining room. Breakfast was more than adequate - cappuccino, ham, cheese, juices, pastries, fresh fruit, cereals. We had the habit of returning to the hotel every afternoon for a siesta before dinner. There are many great restaurants nearby. Hotel Tiziano was a restful respite from the bustle of Rome. Good value for the money.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edinburgh", "Title": "“Week end stay at Tiziano Hotel”", "Author": "Caroline S Posted by an Easytobook.com traveler", "ReviewID": "UR126474215", "Content": "Hotel has a very good central location - ideal place to stay for exploring Rome. Deluxe rooms are very spacious and comfortable. Continental breakfast was good.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "", "Title": "“Smelly room”", "Author": "Soothed", "ReviewID": "UR124137976", "Content": "Selected this hotel because of its location near Pantheon. That was a good decision but it was located on a busy street so it was noisy. The room was big and good for a family with 2 kids. However our room was smelly and it also had a leak in the bathroom and a very smelly fridge. Breakfast was also very basic. Given that it is Rome however where hotel standards appear very low it may be difficult to find anything better for the money. Even so I would definitely not stay again at this hotel.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“True Italian hospitality and a great escape from the cold Nordics”", "Author": "Regina N", "ReviewID": "UR122649602", "Content": "I have stayed at this hotel many times, on my own when in Rome on business, with my kids from the time they were small until now when they are teenagers, as well as with friends for weekend getaways. The location is probably the best in Rome with everything within walking distance. The lobby is beautiful, the rooms are nice with comfortable beds and nice bathrooms. But what makes this hotel unique are the people who work there. Mostly the same people that were there 10 years ago - and that tells you something! The place feels more like an extended home than a big hotel. Once I needed some things to be sent to Sweden that didn't fit in my bag - they sent them for free and the stuff arrived the day after I came back. Don't know any other hotel that would do that. I can't wait to be back there!", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester, New Hampshire", "Title": "“Would stay here again”", "Author": "Fred E", "ReviewID": "UR121295301", "Content": "Just wanted to let you know how wonderful the Hotel Tiziano in Rome was. The location was perfect and the staff were great. Would definitely stay there again.", "Date": "December 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bedford, Massachusetts", "Title": "“fantastic location, excellent service”", "Author": "dolly s", "ReviewID": "UR120492371", "Content": "we found the Tiziano to be attractive and very comfortable. It's most important assets are its central location, and its extraordinary service. You can walk anywhere in Rome including the Trevi fountain, Piazza di Navona, the Pantheon, etc. You can walk to any of the attractions including the Vatican. The staff provide great service. Everyone goes the extra mile. For example, they were willing to open the breakfast room an hour early for us when we were taking early excursions. They also were willing to look at our postcards to make sure we had addressed them correctly for mailing. We ordered a special luncheon at the hotel which was excellent. they do not usually serve luncheon but you can order meals if you like. The dining room where the special meals are served is very attractive. On the whole an extraordinarily positive experiece.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New Preston, CT", "Title": "“Great location”", "Author": "kerryann91", "ReviewID": "UR119147860", "Content": "This hotel is in a great location, all our favorite spots were within walking distance - Campo Di Fiori, Piazza di Navona, Forum, Colleseum, etc. The front desk was helpful. Our only issue was the shower water temperature, went from scolding hot to freezing cold with no control over it. We didn't tell the front desk so not sure if they could have fixed the problem or given us a new room. Overall had a great experience here.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Location, location. location”", "Author": "ElienTelAviv", "ReviewID": "UR118565362", "Content": "The hotel is perfectly located and very clean. Inspite it's somewhat modest interiors and lack of dining room it's an amazing value for a short stay. Especially if you are not able to walk much it is the best position in the city. Public transport , short distances for taxi (to Vatican tour) and ancient Rome aroundth corner (Pantheon which is amazing). Really very good and there is such a variety of everything that we really did not mind the humbleness. There is a computer with internet and they charge for internet acess.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "mississauga", "Title": "“No 4 star hotel!”", "Author": "lovesanibel09", "ReviewID": "UR118524673", "Content": "Stayed here for 3 nights in September. Extremely small room for 3 people. Our beds were literally side by side with no space in between, we had to crawl over a bed to get to the middle bed. Bathroom was very dated and needed serious upgrading, tiles were chipped and patched, no hook, cupboard door coming off hinges, etc. Walls in the bedroom were marked, curtains were filthy, very dark. Breakfast was good, although tablecloths had holes in them and there seemed to be no rush in getting anyone coffee. Afternoon concierge was extremely helpful as was the evening gentleman. Morning staff seemed to be more interested in chatting than being helpful. On the plus side, the location is excellent --- within a few minutes walk you are in front of the Pantheon --- lots of restaurants, shopping, walking distance to Trevi and Spanish Steps. Linens and towels were very clean. There are lots of other hotels in the vicinity and would try someplace else next time.", "Date": "September 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Whitchurch, United Kingdom", "Title": "“Excellent Location”", "Author": "hstaunton1", "ReviewID": "UR118384465", "Content": "OK lets get the star rating out the way for those of you who feel its all about the rating. It is a 4 star Italian Hotel. Now if you want to compare that to a UK standard then lets assume this Hotel is a very good 3 star. The decor is old fashioned, but the rooms are huge with fresh linen bedding changed daily. The air conditioning was superb as was the lovely cold marble floor to help cool those hot burning feet after a long walk. The bed was absolutely massive and we had 4 superb nights of uninterrupted sleep, refreshed each morning and raring to go! The downside to the huge room was the very small en suite with small shower. However to be honest once inside the shower there were no problems, as the power shower was quite superb. All in all the Tiziano is superb, the staff are fantastic, the location is unparalleled. We got a fantastic deal (under 700 eur) and have no complaints whatsoever.", "Date": "September 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Best kept secret...”", "Author": "TouringOT", "ReviewID": "UR116679410", "Content": "This hotel was the place we crashed in following a long flight to Rome. We immediately felt right at home when the front desk asked about our trip and gave us our funky room key. We walked into our room and were pleasantly surprised by the beautiful and classic design. The high cathedral ceiling gave the room an airy feel and the air conditioning cooled us off. We had a triple room with a double bed, a single bed, and a convertible chaise lounge. Large windows gave the room light with a view of the busy street and double-paned windows kept the noise to a minimum. The bathroom was clean with fresh towels, soaps, and shampoos. The shower head was also a hand-held with adjustable settings. Altogether a tasteful and comfortable room! As for the location, you couldn't ask for better. We walked everywhere and the furthest place was Vatican City at 30 minutes. We strolled about during the evening hours when the weather was cooler and were able to visit the sites such as Trevi Fountain, Colosseum, and various piazzas. Excellent location for the explorer!! No words can describe the hotel staff. They were courteous, helpful, and even kept us company as we waited for some tour guides. We had some strange requests and each one was taken seriously and fulfilled. Well worth it for the reasonable price! Enjoy your stay...", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Ghent, Belgium", "Title": "“terrible experience”", "Author": "mihaela p", "ReviewID": "UR116669308", "Content": "Perhaps we were just very unlucky, but our experience with this hotel was a very bad one! From outside looks impressive, and perfectly situated, in the heart of the old Rome. But we have received a horrible room, very dark, small, with no entrance hall, so, after opening the door, you are in the middle of the room. .The cleanliness was another problem, and the breakfast was served in a basement, consisting in very poor food. We had to eat somewhere else. In fact, the hotel doesn't deserve the four stars, maximum three and the price we have payed was far too much for the quality and services we have received. The only one nice experience we had in that hotel was one of the employee at the reception, an american who gave us a lot of tips about the city.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Riyadh, Saudi Arabia", "Title": "“It's not bad but, relatively expinsive”", "Author": "Mansouras", "ReviewID": "UR116590489", "Content": "It is an average hotel, The best thing is the location. If u can get a good price, it could be a good choise", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Valley Center, California", "Title": "“Our Roman home”", "Author": "jrgkvv", "ReviewID": "UR115813282", "Content": "Our family of 4 had an amazing stay at the Tiziano. I know Rome extremely well (I was born there) and I can honestly say that there is no better quality/price/location combination in town. the room was spacious and hosted the 4 of us very comfortably, the building is beautiful, the included breakfast is sumptuous with a huge selection of food and drinks available (including great cappuccino made to order). the staff is very well trained, gracious and attentive. And then there is the location, steps from the pantheon and Piazza Navona and Campo dei Fiori, adjacent to Piazza Torre Argentina where you can hop on a cab or catch several buses that will take you in minutes to all the other downtown Rome tourist attractions such as the Colosseo, Fontana di Trevi, Piazza di Spagna or the Vatican. We stayed for three nights visited all of the above and wished we stayed at the Tiziano longer. Highly recommended!", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Carrollton, Tx", "Title": "“Great Value. Wonderful Location”", "Author": "SoonerOK", "ReviewID": "UR115230105", "Content": "Tiziano Hotel in in an ideal location for visiting a majority of the tourist attractions in Rome. Our rooms were clean and very comfortable. The staff was extremely helpful and the hotel offered WIFI which we found was the exception in Italy. The breakfast provided a great start to our day and offered a variety of items. We loved our visit and would highly recommend this hotel. Great value! Wonderful Location.", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "london", "Title": "“Great location and incredible value”", "Author": "aubreyosborne", "ReviewID": "UR114933532", "Content": "Just got back from a month in Italy, and this hotel was definitely a highlight. The location was perfect - a 5 minute walk from my favourite place, Piazza Navona, with an abundance of shops and restaurants close by. In addition, everything was within a 25 minute walk; The Coliseum, The Vatican, Trevi Fountain & The Spanish Steps making the city feel very walkable and pleasant. Ask the staff for their recommendations on sights and restaurants, as they were always helpful with planning our days. Although our rooms was not modern, it had italian character and elegance with a balcony off the front end and rich moulding around the ceiling. The space of the rooms, cleanliness of the hotel and all around service will keep me coming back!", "Date": "July 1, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Rome, Italy", "Title": "“Lovely”", "Author": "asromanwy", "ReviewID": "UR114905899", "Content": "Very good hotel good staff and very good quality. In the heart of the city!!", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto", "Title": "“Absolutely Amazing”", "Author": "Lamloom99", "ReviewID": "UR114878692", "Content": "Our stay at Hotel Tiziano in Rome was absolutely perfect. The location is incredible which saved us a lot of money on transportation. The rooms were clean and quite spacious by European standards. Above all the service was exceptional through and through.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Vancouver", "Title": "“Highly recommended!”", "Author": "chique-chique", "ReviewID": "UR113907852", "Content": "A charming, modest hotel in the heart of the city, within easy walking of all the major sites. It's the former family home of Pope Pius X11, evident in the painted ceilings and artefacts like the holy water font on the second floor. I shared a triple room with two other women friends. The room was spacious with plenty of cupboards, and a soaring ceiling, which together with large windows at both ends, made air-conditioning unnecessary. The hotel staff could not be more helpful--in a few short days they felt like family. Breakfasts are generous with loads of fresh fruit, gorgeous cheeses like bufalo mozzarella and burrata, serrano ham, a selection of breads and cereals, etc. The hotel has wi-fi which didn't always work with our iPhones but there is also free computer access. In short, a delightful, comfortable and well-priced stay. Will definitely be back.", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "niemodlin Poland", "Title": "“Excellent place & we will be back”", "Author": "ulaula1", "ReviewID": "UR113364825", "Content": "Excellent hotel, central Rome, English Spoken, staff all helpful & very friendly, great breakfast, air conditioning, rooms all very clean with tasteful decor. Walking distance of all sights + Vatican City, near trams & buses for those who cant walk everywhere. Room rate Euro 220 Standard double", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Arlington, Texas", "Title": "“Great Hotel In Center of Rome”", "Author": "squevedo", "ReviewID": "UR113237619", "Content": "This is a wonderful hotel and a delightful place to stay. I have used this hotel for several years and am always impressed with the professionalism and warm reception of the management and the staff. The owner and manager are very personable and friendly to all their guests. The hotel staff are always very cordial and attentive to your requests and needs. The breakfasts and lunches are always well served and the foods are wonderful as well. The interiors of the rooms are very well maintained and have very modern facilities. The hotel is also located right in the heart of the historic city with many great restaurants and shops nearby. The rates are extremely reasonable. I will always use this hotel.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "1.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Over priced in perfect location”", "Author": "Lilind", "ReviewID": "UR112771742", "Content": "The only positive thing I found about this hotel is the perfect location. 2 min. from Piazza Navona and Palazzo di Venezia. 10 mis from Cita di Vaticano. There cannot be better location for a hotel. However it's far from it's claimed 4 starts. Actually 2 stars are more appropriate. Rooms are old and smelly, air ventilation loud and not efficient, difficult to sleep at night as it gets too hot. Beds not comfortable. TV sets come from early 80's and impossible to watch any channel. Forget international channels as they do not exist. Bathroom was missing toilet paper. Entire decor of the room is old and need refreshment. The room was on the 4th floor and to get there is a challenge as well, you can either wait for one small and very slow elevator which takes ages or take a journey on the never ending stairs. Very basic continental breakfast with not much choices and overall combined with €160 price tag per night is definitely not worth it , even if location is so good", "Date": "June 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "5.0", "Location": "5", "Service": "5"}, "AuthorLocation": "Richfield, Utah", "Title": "“the best location in town”", "Author": "dogdenit", "ReviewID": "UR106603522", "Content": "I staied at the Hotel Tiziano with some friends and we have been very happy with the location, the room, with the great buffet breakfast. The staff was vwery helpful and friendly I choosed this Hotel after I saw the interview with the owner Mr. Giuseppe Molinari. His presentation of the Hotel was wonderful. I surely raccomand this Hotel", "Date": "May 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Somerset", "Title": "“Good hotel in an excellant location.”", "Author": "Nicole040", "ReviewID": "UR103294738", "Content": "Stayed here for my 40th b'day so was a bit disappointed to be put in a small room which wasn't the cleanest. Asked to be moved and got put in a much better room overlooking the main street where we could watch all the action. Staff were helpfull all around. Breakfast unfortunatley wasn't up to much with little choice if you left it too late to eat. Excellant location to see the whole of Rome on foot, and only 10 mins or so from the restaurants. Take a good pair of walking shoes as we walked about 12 miles a day rather than getting a bus etc. - found that we saw more that way. Remember that parts of the Vatican will be closed on Sundays. The restaurants directly around Navona are expensive so venture down the side streets for a more authentic atmosphere.", "Date": "April 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chester", "Title": "“Overall - very satisfied.”", "Author": "CheshireRockFan", "ReviewID": "UR99995562", "Content": "I was actually booked into the Hosianum Palace but received notice four days before I was due to fly that they were no longer able to accommodate me and the alternative was the Hotel Tiziano. I feared the worst - I'm like that - but my fears were laid to rest when I arrived at the hotel. The hotel itself is smart throughout and the room was absolutely fine - a good size for a single traveler. The bathroom was in good order and clean. Location of the hotel, on the Corsa Vittorio Emmanuelle II, is ideal. The Vittoriano is a short walk south east of the hotel and beyond that the Forum and Colisseum. A 10 minute walk to the North is the Pantheon and a couple of blocks west of that the Piazzo Novono. A further 10 minutes North again is the river bank from where you can see the Castel St Angelo and St Peter's on the other side. Being on such a major thoroughfare it's very easy to find your way back to the Corsa Vittorio and then the hotel itself. Staff on the front desk are friendly. Only real quibble I had was the lack of fruit juice in the morning. The orange (cordial?) available was pretty poor frankly. In summary I would recommend this hotel as a good place to stay if you're planning a visit to Rome though try to get a good deal via a site comparison web site if you can.", "Date": "March 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Washington, DC", "Title": "“Average hotel great location”", "Author": "dacjr1", "ReviewID": "UR88463776", "Content": "Nothing special here. Breakfast dining room was bleak at best, as was the breakfast. The libation, however was great for those looking for value conscious sightseeing.", "Date": "November 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“great location and pleasant service”", "Author": "AGA55", "ReviewID": "UR70853650", "Content": "This is a very nice option for a short stay. the location is wonderful and the price not that bad. The breakfast is simple, but fresh and nicely presented. the staff makes you a fresh coffee which in my opinion is better than the one you get in the coffee shops across the city. The weakness of this hotel is their beds. In overall I would definitely recommend this hotel.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Great location, friendly staff, good hotel”", "Author": "ItalyPerfect", "ReviewID": "UR68957436", "Content": "The location couldn't be better; walk everywhere in the center of Rome, or if footsore, many buses are nearby. The helpful desk staff will always respond to transportation questions. The hotel is very well maintained. Everything in ship shape. Air conditioning perfect. Satellite TV and internet in the room very handy. Our room was perfectly quiet. I suppose the street side rooms would experience traffic noise, after all this is right in the center of a busy city. You cannot expect silence if you want to overlook the street. Nice breakfast buffet. We couldn't be happier with the hotel. And kudos to the always friendly staff.", "Date": "June 28, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great location - that's about it”", "Author": "NewtravelerHawaii", "ReviewID": "UR63459221", "Content": "Perfect location - walking distance to major sites, shopping, and restaurants. Hotel itself is ok - relatively clean. Rooms are incredibly small (even for European hotels) with the bare minimum in furnishings. Not really worth the price. Breakfast buffet was very good - with nice selection of fruits, cereal, and breads. Some staff were warm and helpful, others were far less so. Fairly good for just sleeping and showering.", "Date": "May 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jerusaelm", "Title": "“Amazing Location –very descent hotel”", "Author": "Onyx1968", "ReviewID": "UR61810980", "Content": "We stayed in the Hotel Tiziano for 4 nights on a B&B deal. The Hotel is clean and very comfortable. Although it’s located on a busy street (Corso Vitorio Emanuelle 2nd) the room was quit and comfortable. The best feature was that because of its location the Tiziano is minutes walking distance from any thing you want in Rome. Pizza places restaurants shopping and even a pharmacy and a supermarket are just 1 minute away. If you need public transportation there is a variety of bus lines right outside although we preferred to walk to the landmarks in the centro storico (even to the Colloseum -20 min. very easy walk) . Breakfast was filling (an assortment of cereals cakes some fresh fruits and juices as well as the regular ham and cheese (which we don’t eat cause of dietary restrictions) coffee was freshly brewed/cappucciano as well. . We will definitely recommend it to friends. The only drawback was that they charged 5 Euro for 24 hours of wireless internet", "Date": "April 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tennessee", "Title": "“Great location, terrible service”", "Author": "justinstelter", "ReviewID": "UR55171468", "Content": "This could quite possibly be the worst service desk 'service' I've ever received. I really can't complain about anything else at this hotel, but this just ruined the overall experience for me. The gentlemen that worked on Jan 22nd and Feb 3rd (not sure if they were the same guy) were terse, unhelpful and just plainly rude. I hope others get better service.", "Date": "February 4, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Australia", "Title": "“Average Hotel in a good location”", "Author": "Heiners", "ReviewID": "UR52668644", "Content": "The strengths of this place is the location near the Piazza Navona which is located within 300m walking distance. The service was average with the staff seeming quite uninterested in us. The room was fairly basic but a good size. It would be good if you needed a room for 4 people. Bigger than average. I probably would not stay again but it did the trick on my first visit to Rome.", "Date": "January 5, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Staten Island, New York", "Title": "“Nice Hotel for 4 People”", "Author": "dustygirl26", "ReviewID": "UR44202369", "Content": "We stayed at Hotel Tiziano for two nights in August and were very surprised to find a room that was so large in Rome that it accomodated four beds (2 doubles and 2 twins). The little alcove leading to the bathroom was lined with wall-to-wall closets and the bathroom had two sinks. The shower definitely was in need of re-grouting, which made it a little of a turn-off. The patio and the bistro set was an added bonus, but we really didn't use it because of the heat. Thank goodness it was air-conditioned because August is too hot in Rome. The daily breakfast was wonderful and had a big variety of choices to eat except for eggs. It was in a location that you were able to walk either to Vatican City or to the Spanish Steps. As far as the staff went, we only had conversation when we checked in and out. We didn't think they were so friendly or accomodating. It would have been nice to return at night and hear \"Are you enjoying Rome or Can I recommend a nice place for dinner, etc.\". Nothing, not even good night. Anyway, the Hotel is a good place to stay if you want to be in the center of Rome and are happy to have a large room, which is hard to find in Rome. Plain, comfy and at $300 a night, a little over-priced are how I would describe it, but the location was very convenient.", "Date": "September 24, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Belgium", "Title": "“overrated hotel”", "Author": "demandingBelgium", "ReviewID": "UR38158200", "Content": "We (family of 4) stayed at the Tiziano for 6 nights during the summer. We expected a four-star hotel, but found it to be three-star, at the most. Neither the rooms, lobby nor \"restaurant\" (more like a dining hall, down in the basement) had been \"recently refurbished\", as we expected. We chose it because they offered a family room. Old, chipped wooden furniture, and the tiniest of bathrooms. No carpet. We had it changed for a slightly smaller room, with a bigger bathroom and window on a noisy street. Hotel location is close to main bus routes, on a busy avenue. No amenities.", "Date": "August 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Arkansas", "Title": "“Wonderful!”", "Author": "momof2girlsArkansas", "ReviewID": "UR36512090", "Content": "We stayed with a large group of college students here for 3 nights. I'm just sorry we didn't have more time to relax in our room. We had a HUGE family room on the back with a private terrace. Perfect for our daughters aged 7 and 9. Location was great, rooms were so comfortable. We had been staying in budget hotels, so the Tiziano was a treat. It was great to come back to the comfortable cool room after spending the day trailing all over Rome.", "Date": "August 2, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Philadelphia Area", "Title": "“Do Not Stay Here!!!!! It Is Disgusting!!!!!!”", "Author": "Buffalo66", "ReviewID": "UR35141798", "Content": "Do not let the photos fool you. The is by far the worst place I have ever stayed in my life. The hotel is old, dirty, smokey and gross. There are huge holes in the floor hidden under small carpets. The hotel carpets in the entrance are full of stains and dirt. The rooms need a complete make over. It is on a REALLY busy main street that is very hard to cross. The main street has noise all night long from the bar across the street, the roaring buses, and ambulances. It was so nasty I did not even want to touch anything from the mini bar. The halls are full of smoke. The service it pitiful. They did not show us around, did not point out where breakfast was, that there even was an internet room, they basically just gave us the room key - that's it. Plus when we first entered our room - our complimentary robes were placed INSIDE the bidet!!! The shower head fell off when I took a shower and clocked me on the head. I asked to change rooms and they refused. (they did fix the problem though). We were also promised the room on the web site - a nice, new, spacious, clean room with a terrace. However, we were given a super small, old, dusty, gross room with a balcony that the doors were so rusted shut that they squealed like fingernails on a chalkboard to open. Once you opened the doors it was so loud that you had to get back in from the street noise. If you have ever been to Las Vegas...this would be like the Imperial Palace (nice back in yesteryear, but gloomy, gross, and depressing now). This hotel was VERY expensive and was a total rat hole. The breakfast was also SO NASTY that we paid to eat at a cafe ever day that we stayed. The fruit came out of a can, the juice came out of a machine, the croissants were old and rubbery. My advice is...stay ANYWHERE in Rome but here. Any place near the Pantheon, Trevi Fountain, or the nicer area which is near the Spanish Steps. I was a hair away from changing hotels and if I was in Rome for more than 3 days this time around I would have sacrificed the deposit and stayed elsewhere. This place made the hotel in \"Big\" with Tom Hanks look like the Ritz!", "Date": "July 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Tel aviv", "Title": "“great location!!!!”", "Author": "flowingnow", "ReviewID": "UR33759390", "Content": "it is the best location. everything is near and you can walk by foot to all the place. the breakfast is good :) has fruit, Croissant, bread, mineral water, coffee, toast, cereal. it was great for me because of the fruit and the cereal they have there!! the hotel is simple. but you travel rome most of the day so the hotel is great for your needs. They were very friendly also! there is a very good resturant near the hotel. one minute walk (or 30 seconds even..). you cross the road, walk to the right side, turn right and it's there, a little inside. it's called: aspettando IL PANE everything there is fresh, such a good food and great people!!! Via Monterone 14 Rome. Tel -----------", "Date": "July 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "California", "Title": "“Great location, just okay”", "Author": "JandGCali", "ReviewID": "UR30116801", "Content": "I stayed in this Hotel for one night on my way back from a business trip before departing Rome. I have to say that this hotel is in a great location. It is true that you don't have to take public transportation to get to many of the tourist sites in Rome. You have dozens of restaurants to choose from within a block from the hotel. My room was clean and comfortable. It was very old, but not run-down or dirty. My room was right on the street and I didn't hear much noise so that was a major plus. Overall, I think this hotel was just okay. If you want to shell out the money to stay in a prime location than this hotel is a nice option. However, if you want to save some money and use public transportation (trams, metro) then stay farther away from 'downtown' and still have a great experience.", "Date": "May 16, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "TA", "Title": "“Great Choice- Centeral location and friendlly Stuff”", "Author": "pacolon", "ReviewID": "UR29807523", "Content": "We stayed in the hotel between 26.4-30.4, The hotel is in the middle of Rome allows you to travel by foot only ( no need for busses underground etc). The stuff is very friendly especially one of the reception clerk (sorry i dont remember your name - PS take the flight with your girlfriend to barcelona). Thank you all for your hospitality, we enjoyed Rome a lot Shahar & Livnat Israel", "Date": "May 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Dallas, TX", "Title": "“good hotel, quiet, great location, friendly staff”", "Author": "CountessCeprano", "ReviewID": "UR29718484", "Content": "I felt very secure as a single female traveler at this hotel. The front desk staff was very accommodating. The location is absolutely splendid. I had a single room ... small but clean and efficient, a cute and modern bathroom, and a small private balcony. I was surprised at how quiet the location was ... my room faced the back of the hotel, which might have had something to do with that. The walls were not thick, but the clientele was pretty quiet. Breakfast was very good and complimentary. I would stay here again.", "Date": "May 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Rome, Italy", "Title": "“Would recommend to anyone!”", "Author": "HoffSMC", "ReviewID": "UR29315441", "Content": "Had a wonderful stay in this hotel, located in downtown Rome. I traveled alone and was pleased to have a pleasant welcome at the desk when I arrived. The room was clean and cozy and had all amenities that I would expect from a four star establishment. The breakfast was delicious - full and complete, unlike some other Italian establishments which serve only coffee and a cornetto. The service was wonderful, as the staff was able to accommodate my request for tickets. I would stay here again in a heartbeat and can't wait to go back!", "Date": "May 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Kent, England", "Title": "“Good location and friendly staff”", "Author": "albiwan", "ReviewID": "UR20464522", "Content": "We booked the hotel on the day we needed to check in so got a good rate. It's a superb location with very friendly and helpful staff. The rooms are a good size, but the bathroom was a bit tired. Breakfast was okay, but the room lacked atmosphere. Our room was at the front of the hotel on the 2nd floor and very noisy.", "Date": "September 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Westlake Village", "Title": "“The BEST location and a nice Hotel”", "Author": "HopeItHelpsYou", "ReviewID": "UR15828221", "Content": "We read the reviews and were a little concerned... but it was great. YES its not the Four Seasons but it was clean, neat and in a Historic building from 1500's. Our room 311 had a beutiful balcony with furniture and full sun everything was spacious but a smaller bathroom. We arrived at the train station and the ride was about 15 mins with a little traffic to the hotel. The location if you want to see all the sights is perfect. We would walk for hours stop back for a rest and then head out again. You can walk to everything and the taxi stand is outside and so are all the bus stops including the open air tour buses. We were five people (3 kids) and they set up an extra three beds for us where most hotels told us we had to have two rooms with five people. The staff were very helpful about the things to see and do. The included buffet breakfast was fine and the lobby had English newpapers to read which was nice. We were only in Rome for 4 days so if you want a great location this was perfect. We didn't really spend a lot of time in the hotel anyway. I would have to say it was a good hotel, great location and fair prices for Rome.", "Date": "May 9, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "new jersey", "Title": "“very tired!”", "Author": "lovetotravel2070", "ReviewID": "UR15412513", "Content": "What can I say, I still talk about our visit here! I have many photos of the dirt and holes in the carpet etc. I have travelled through many cities Europe, USA, Australia & NZ and this was by far the worst. It needs to be completely updated, and a good steam clean. The staff were friendly and seemed unaware that the hotel has seen better days ( about 20 years ago). I really wanted to change hotels and really should have. But who wants to have to do that when you have limited time in Rome. I rated this hotel as terrible because dirt can be avoided,and for the money it cost they could at least clean it.", "Date": "April 27, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "chester UK", "Title": "“Perfect location but not a 4 star hotel”", "Author": "Unquerasum", "ReviewID": "UR14422916", "Content": "We have just returned from our holidays in Rome. When we booked the Tiziano Hotel we were looking for a good location in the city centre. It was a bit overprised (230Euros per night) but we thought we could have a treat. The public areas in the hotel such as reception, waiting lounge and breakfast room were pretty good. However, once that we took the lift to go to the rooms things started changing. The carpet on the lift and corridors needed to be changed. It was really worn off. The corridor that was leading the rooms had dirty walls and it was decorated with big plastic plaques on both sides of the walls. The room was quite spacious but the decoration was kind of old fashion, sixties......dirty floors full of dust, dirty furniture, dirty and stuffy bathroom (hair was left in the bathroom from previous guests or stuff) dirty marks on main door and bathroom door, chipped door handles. The furniture was a mix match of units most of them chipped. The walls were also dirty even there were pieces of cellotape for some reason (probably left behind by previous guests). There was no welcoming pack. The fire awareness sign behind the door had a broken glass. Bathroom soap, champoo, shower cup etc weren't replaced at all. Not sure how this hotel got the 4 star but for sure in other place would be no more than a 2 star hotel. I wouldn't go back again. I have attached some pictures.", "Date": "March 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Granger, IN", "Title": "“Great Stuff for us!”", "Author": "reeljig", "ReviewID": "UR14180563", "Content": "We were delighted with our room. Large room for the 4 of us (2 adults and 2 children). Bathroom smaller but perfectly useable. Perfectly located withing walking distance of all that we would want to see and do. Breakfast with meats, rolls and fruit was perfect start to get us going. Staff was very helpful and friendly. We thoroughly enjoyed our visit and the hotel only added to that.", "Date": "March 10, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Overpriced, loud, good location”", "Author": "FlyingFast", "ReviewID": "UR10081374", "Content": "Ciao! We had one room with 2 twins for 230 Euros/night for 3 nights (approx. 320 USD). Rooms are very plain with a tiny shower (2x2), but room was clean. We requested a quiet room and were advised that they gave us a very quiet room. Awakened each morning from 7am to 10am by chairs being pulled across the floor in the breakfast room below. This must have been the loudest room in the hotel just up the stairs from the lobby. First morning thought the people next to us were talking loudly (6:30am) but turns out it was the TV (thin walls). On Monday morning, the maid was vacuuming the lobby at 6am, and I had to go downstairs and remind them that we were trying to sleep. On the postive side, this is in a good location, on a main street and close to Campo de' Fiori and Piazza Navona, with a taxi stand 2 blocks down. Reception staff was very nice. They are not really equipped to make reservations or check on hours for you (i.e. no concierge), so you are paying for 24/7 staff without the amenties. Overall I thought this hotel was overpriced, especially given the noise. It's classified a 4-star due to the 24/7 reception staff and onsite restaurant (which was closed while we were there). Remember that the star rating doesn't equate to the U.S. system. If you're a sound sleeper and like a no-frills hotel, this would be ok, but if you like to sleep past 6am, I recommend you keep looking.", "Date": "October 15, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "chicago", "Title": "“Find a Better Hotel”", "Author": "worldtraveller070", "ReviewID": "UR8228701", "Content": "Me and my family of four just returned from our 10 day trip to Italy. The tiziano was our least favorite hotel. We had two double rooms, one with a queen bed for me and husband and another with two twins for our girls. It was very small, the space was tight and the rooms did not have a pleasent arouma. The bathroom was small and outdated as was the rest of the hotel. It looked clean, but it did not feel clean. I was weary the entire time about the cleanlyness. The street the hotel is on is very noisy and the surroundings were dirty. The only thing this hotel is close to is the Piazza Novana. If I return, I would stay near del corso street.", "Date": "July 24, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Grumble ......Grumble......”", "Author": "CiaoMilano", "ReviewID": "UR8209725", "Content": "We were not happy with this place……from the grubby hotel exterior and its position right on one of central Rome’s busiest, dirtiest and noisiest streets to its depressingly gloomy reception/lounge/bar area. Top this off with an even gloomier DEFINITELY THREE STAR double room overlooking the noisy road (which kept us in a state of semi asleep for most of the night) and the less than satisfactory offering at breakfast (compared to other hotels in the area). Certainly not value for the Euro 280 we paid. In fact we would go so far as to say (based on all the hotels we have stayed at in Rome) that Euro 150 was what the room was worth - and only then, in peak season. Before writing our Tripadvisor reports we always check the hotel website to make sure what they offer is really what we poor souls are actually getting…….We were shocked to find photos of beautiful rooms with balconies and vistas on the Hotel Tiziano website. Unfortunately, we never sighted these rooms – maybe you need to ask for them. For our Euro 280 we could have stayed at the much better value Hotel Ponte Sisto and for a bit more of a splurge the absolutely lovely Albergo del Senato – both better positioned in this great area of Rome. Plusses for the Tiziano hotel?…..once you cross the busy road it is close to Piazza Navona, Pantheon etc etc – if you don’t cross the busy road you are just near Campo de’ Fiori and Trastavere…..oh…one more thing……the staff were extremely nice.", "Date": "July 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hoboken, New Jersey", "Title": "“Diamond in the rough”", "Author": "Niffer56", "ReviewID": "UR8017275", "Content": "We didn't have a reservation in Rome, went on a whim. As we drove around and found the area we wanted to stay in, Tiziano was the 2nd hotel we stopped in (first was sold out). They were so accomodating & helpful. Location was perfect! Hotel staff were friendly & welcoming.", "Date": "June 27, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Loved this Hotel!”", "Author": "dlpicha", "ReviewID": "UR6819922", "Content": "Booked through Venere.com for my parents - age 71. It was their first trip to Europe. Tiziano Hotel - Rome We loved this hotel. Our room was very spacious and always clean. The continental breakfast is great, with meats, fresh fruit assortment, pastries, and fresh bread. The staff was always cordial and very helpful. The location is convenient, Very close to the ruins, Piazza Navona, which has shops, restaurants, beautiful fountain and entertainment. Good people watching and the restaurants were not that expensive. Also near the hotel is a beautiful church, which I would recommend for the beautiful artwork on the ceiling and 5-6 separate altars. It is St. Andreas, which also has mass on Sunday. We walked to the Spanish Steps and many other attractions. If we were tired, we took the little trolly. We are 71 and could walk almost anywhere we wanted for sightseeing. Some tour buses will pick you up at your hotel. We did that for the Vatican tour.", "Date": "February 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ann Arbor, MI", "Title": "“Wonderful spot”", "Author": "treetownie", "ReviewID": "UR6574258", "Content": "These gentlemen went out of their way to help me when my reservations at Smeraldo \"disappeared\". Great location, right on Corso Vittorio Emanuel, a very short walk to P. Navonna, the Pantheon, Area Sacra, P. Venezia, terrific little restaurants and coffee bars. (Try restaurant S. Anna on Via S. Anna off Avenula, south of V. Emanuel and west of Largo Argentina.) It will take you 20-25 minutes to walk to the Vatican. Hotel is a beautifully renovated small palazzo, rooms and baths are reasonably sized (for Rome) and impeccably clean. Staff is extremely helpful and gracious. Room 102 has a balcony overlooking V. Emanuel. If you need internet services, use Internet Port around the corner on Avenula, across the streetcar tracks, rather than the much more expensive place across V. Emanuel from the hotel.", "Date": "January 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Tiziano Was Everything We Were Told”", "Author": "romalover", "ReviewID": "UR6108093", "Content": "We stayed here last spring break. We have a friend who works for a college study aborad program in Rome, and the Tiziano is her permanent residence. She recommended it to us, and we absolutly loved it. It is a very Eurpean hotel, not Americanized at all! They have a computer with internet access available to guests, and a wonderful, light breakfast. The rooms were lovely, the bathrooms were very clean. They were just the right size. I stayed with a friend of mine, and there was pleanty of room for both of our thngs. I have recommended this hotel to dozens of friends since, and all who have gone have just loved it! It is also located very well, close to many major tourists attractions, and wonderful resturants!", "Date": "November 11, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Harrisburg, PA", "Title": "“Perfect location, nice staff”", "Author": "gpmtrixie", "ReviewID": "UR5417149", "Content": "This was a perfect choice for our family of mom, dad, 9 and 11 year old kids. We had one room that overlooked Corso Vittorio Emmanuel II, so it was busy and loud with cheering Italians on the day Italy won their last game of the first round of the World Cup, but that made us feel like we were in the middle of the excitement. The room was spacious as was the bathroom. The A/C was good and necessary! The breakfast spread had a lot of variety and was kept well-stocked. The reception staff got a kick out of the kids requesting our room key in Italian and gave them a \"bravo/a\" when they got close to the correct pronunciation. We were 15 minutes walk or less from just about every big sight -- Vatican, Colosseum/Forum, Spanish Steps, Trevi Fountain. Very close to Pantheon and Piazza Navona. I would definitely stay here again.", "Date": "July 2, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "wirral", "Title": "“Great location but very quiet”", "Author": "heathergill", "ReviewID": "UR5295997", "Content": "We chose this hotel because there was a special offer on from one of the Internet sites for the time we wanted to go. It was a brilliant location and we had a fantastic taxi journey at night there from Ciampino airport. Our family room was very spacious and comfortable and so quiet considering the central location of the hotel. Breakfast was good.", "Date": "June 3, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Tampa, FL", "Title": "“Tiziano was OK”", "Author": "CorrieC", "ReviewID": "UR3992601", "Content": "The best thing about the Tiziano was the Location. It was perfect, about a 15 minute walk (at most) to any of the sights, a bus stop right outside the door and a tram stop around the corner. And, there are lots of restaurants just minutes away. The room was on the small to average size but clean, although our double did not have a stall shower, just a tub with no shower curtain (my husband was less than thrilled). My mother came with us and had a great single, newly refurbished w/a stall shower on the 4th floor which was much nicer than our room. They did supply soap, shampoo, etc. however the scent wasn't all that plesant, so I was glad that we had brought our own from home. There is no clock in the room (odd) and while there is a phone, you can't call from room to room. The bed was hard, but not uncomfortable and our room was on an alley and didn't get much if any street noise. Note, the hotel is on a very busy street (Corso Vittorio Emanuele II). The air conditioning was great, very cold and not really loud. There was a TV with 2 english language channels and a small refrigerator stocked with water and soft drinks. The hotel has an computer with Internet access. We used it on and off a number of times each day and they charged us between 3E and 5E each day, which we felt was very reasonable considering that the internet cafes typically charge 3E for 30 minutes. The front desk personnel were accommodating, but not friendly. The breakfast was pretty good, there was a wide variety of choices: fruit, pastries, rolls, yougurt, cereals and some meat and cheeses. The coffee was good and the wait staff were nice. We booked our room at the last minute (3 weeks out) so probably paid more than we should although the hotel did give us a sizeable discount (~30%) because we were staying for 7 nights---I did ask for the discount on booking, and there was no issue upon check out. We used thier 'car service' to pick us up from FCO when we arrived in Rome, it was kind of pricey 60E especially when I found out that the driver wasn't affiliated with the hotel, they hotel was just the middleman in this case. I made a reservation with airportconnection[-] to get us back to FCO and they were great 44E for a Mercedes S class and our drive was about 30 minutes early. Overall our stay at the Tiziano was good.", "Date": "October 4, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Mashpee, Massachusetts", "Title": "“Comfortable Hotel”", "Author": "kesp80", "ReviewID": "UR3945794", "Content": "My husband and I stayed for three nights, and although the room was small for the amount of money we spent, we were very comfortable. We had a king sized bedroom facing the Corso Vittorio Emanuele, and thought that we would hear the constant traffic.The recent implementation of soundproof windows blocked all sound and the shutters that were closed at night, made the room very dark, which made us catch up on our sleep. The bathroom was bright, clean, well kept and tiled. There was a marble top sink, which had enough space to hold your toiletries and a glass enclosed tub/shower, which by the way, had a terrific shower head. This hotel is centrally located to all sites. The Pantheon and Piazza Navona are about a five minute walk.The Trastevere area was a pleasant 15-20 minute walk. The bus and cable car station is right on the corner.The only time we used public transportation was to visit the Vatican The continental breakfast was terrific and the coffee strong. The breakfast room held about ten tables or about 50 people. The waitstaff were very pleasant. We experienced very helpful hotel managers. They work many hours and seem to be very dedicated to your needs and we really felt that they wanted us to have a great time in Rome. All in all, we had a very pleasant stay at Tiziano, and would stay there again.", "Date": "September 28, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Ann Arbor, Michigan", "Title": "“Very Pleasant Stay”", "Author": "AnnArbor", "ReviewID": "UR3616678", "Content": "Ideal location just a few hundred yards from both Piazza Navona and the Pantheon, with many outstanding restaurants and good shopping nearby. Vatican, Colosseum, Trevi Fountain, and Spanish Steps are all walkable, though the hotel is also located near a major bus interchange and taxi rank. The rooms, though not sumptuous, are very comfortably sized and appointed, especially for the price which we thought was a real bargain. Best continental breakfast of anyplace we stayed in Italy. Most of all, the service was excellent. The desk personnel were unfailingly friendly, helpful, and informative. We'll go back the next time we're in Rome.", "Date": "June 28, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "england", "Title": "“Perfect for sightseeing & shopping”", "Author": "pat&Harry", "ReviewID": "UR3605998", "Content": "Have been to Rome many times and the hotels are hit and miss. If you chose one outside of the historic city centre a fortune can be spent on taxi fares. Found this hotel by chance and the location is perfect. It is possible to walk everywhere. The Pantheon is within a couple of hundred yards and the Vatican & Forum equidistant. For the less able a taxi rank is very close by & a bus stop is outside the hotel. The hotel staff are most helpful. The rooms have all the usual facilities & are clean & comfotable. Hotel rooms in Rome tend to be small but this one fits the bill perfectly. Will definately return.", "Date": "June 23, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "4"}, "AuthorLocation": "San Francisco, CA", "Title": "“Okay stay”", "Author": "rose2nomad", "ReviewID": "UR3517196", "Content": "Prior to my visit, I was looking forward to my stay at Hotel Tiziano, but left the establishment disappointed. Let me start with the good points of the Hotel. It is in a fantastic location - close to everything. There are wonderful shops and restaurants nearby. The hotel entrance was impressive, the rooms were clean, the ceilings grand. The complimentary breakfast was wonderful. The downside to it all? The front desk person was unapproachable. He did his job, but made one feel incredibly unwelcome with his standoffish demeanor. I dreaded every moment I had to pass by the front desk, and that feeling alone just doesn't hold well for what's supposed to be a 'relaxing and enjoyable' stay. Besides that unfortunate glitch, I still I had a fabulous time overall in Rome. And when I do go back, I will find accomodations elsewhere.", "Date": "June 1, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Lech, Austria", "Title": "“Very central, easy to reach all sights & shopping with a short walk.”", "Author": "helloeverybody", "ReviewID": "UR3419003", "Content": "We were very impressed with the location of the hotel. We ate out in the area every night and were able to have a few drinks on the way home. Rooms are normal double rooms, clean and hot water. Staff were freindly and helpful. Could definatly recomend!!!", "Date": "April 27, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Great location, friendly staff, good hotel.”", "Author": "A TripAdvisor Member", "ReviewID": "UR3087928", "Content": "Myself and my husband stayed at this hotel for eight nights over the New Year 2005. The hotel could do with refurbishment but it is clean and the staff are very friendly and helpful. When we were unhappy with the internal room we were initially given there was no problem in switching straight away to a room with a view over the sreet. The street is very busy and noisy though so the rooms on the higher levels are to be recommended. The buffet breakfast was very good. The best thing about the hotel is probably its location, just a few minutes walk from Piazza Navona, the Pantheon, Campo de Fiori and not too far from the Campidoglio.", "Date": "January 26, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "jerusalem, israel", "Title": "“great place to stay!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2820486", "Content": "this hotel is located in the heart of the historic center, which means that EVERYTHING is just a few minutes away! the rating of 3 stars suits this hotel. its not a luxury hotel, but its clean and comfortable. the breakfast consists of cheese, salami, bread, jams, cornflakes and some wonderful pastrys. plus, the staff brings you some hot cofee. the staff are very helpful and nice. in conclusion, i recommend this hotel for those who went to see rome and not the hotel. enjoy your stay!!!", "Date": "November 12, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Bradenton, FL", "Title": "“Great central location”", "Author": "JJJTC", "ReviewID": "UR2616761", "Content": "Great location -central to all the sights and really close to the Pantheon. Huge room with king bed and a twin bed. Decent bathroom-glass enclosed shower but the shower had terrible water pressure . Breakfast was good and the people at the front desk were nice.", "Date": "October 3, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "whitehouse Station, nj", "Title": "“Hotel Tiziano June 6th, 2004”", "Author": "wendy1957", "ReviewID": "UR2182785", "Content": "Arrived June 6th, 2004. A room with one king bed and two twin. One window opened up into the alley and one window opened up into where building equipment. Dust very thick on blinds, beds hard as a rock, and the noise, very bad, all night long. No restaurant, breakfast was a very hot room and horrible. The bar they list, good luck trying to find someone to get you a drink. Internet in a small room, like closet, which they charge a fee. Very busy street in front of hotel. Overpriced. Run down. Did not like at all, but tolerated for the 3 nights.", "Date": "June 11, 2004"}], "HotelInfo": {"Name": "Tiziano Hotel", "HotelURL": "/ShowUserReviews-g187791-d205152-Reviews-Tiziano_Hotel-Rome_Lazio.html", "Price": "$144 - $1,310*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">110 Corso Vittorio Emanuele II</span>, <span class=\"locality\"><span property=\"v:postal-code\">00186</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "205152", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/d3/f8/d3f810cca1a27f792206aa568928deea7large.jpg"}}