{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Madrid", "Title": "“Bad service at reception.”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR139377330", "Content": "I didn´t get good service at the reception. The personal didn´t help us to book a cab and they only spoke spanish.", "Date": "September 4, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Edinburgh, Scotland, United Kingdom", "Title": "“Bronze in the Golden Mile”", "Author": "John J", "ReviewID": "UR134929252", "Content": "Perfect location in Madrid's Golden Mile, but shame about this hotels service. Initially put in a Smoking Room, I eventually changed to a twin room which I was informed meant \"Double\". I was then served an under cooked burger. Turns out that was a blessing in disguise, I then had a great time by keeping away from the hotel until bed time!", "Date": "July 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Mandello del Lario, Italy", "Title": "“Conveniently located”", "Author": "Paolo B", "ReviewID": "UR134511023", "Content": "This is a good hotel with swimming pool. It's well located and you can go walking on the most interesting places in Madrid. It's a little old and need a refurbishment. Breakfast hall is small and you often need to queue up to sit on a table.", "Date": "July 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Just Ok Hotel”", "Author": "marcus232", "ReviewID": "UR133946528", "Content": "Stayed 2 nights in this hotel and thought that the room was comfy and clean. I read some of the other reviews and agree that this hotel needs some refurbishment. The rooms seem very dark and old. The bathroom is large but in my room but the shower is poorly designed. It was extremely difficult to keep the water from leaking out and spilling all over the bathroom floor. I don't know why the bathroom shower was designed like that. Another complaint that I had was the internet connection was abysmal. They advertise free-Wifi in the lobby but it was so slow it was frustrating. Also, you had to get a new pass every 30 minutes. I don't understand this. It is just a hassle for the customers as well as the workers. The good thing about the hotel is the area. Salamanca is a very safe, clean, and high end area. It reminded me quite a bit of Manhattan. The hotel is tucked away in a quiet street off Calle de Goya so noise is fairly low. I paid about $100/night for the hotel and wouldn't really pay any more than that. You are pretty much getting a lower end hotel in a very high end area so the price is probably fair.", "Date": "July 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Good central business hotel”", "Author": "NiceFoodPlease", "ReviewID": "UR132960890", "Content": "Comfy and clean but not much else. You don't even get bottled water in your room. Still, it had a comfy bed and was ideally placed for the office", "Date": "June 28, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“3* Stay....Great Location”", "Author": "Connie M", "ReviewID": "UR132649545", "Content": "My friend and I obtained a great deal and stay was c80 euros per night, this hotel provides excellent value for money. The hotel is in a fantasic area, you can walk to most of the museums (Reina Sofia, Museo del Prado, in about 10 minuts), there are also great shops in nearby Serrano (2 minutes), high street plus high end designer boutiques, Madrid city centre is a 5-6euro taxi ride away. A number of metro stations are close by, Colon, Serrano being a 2 minute walk away. The hotel also has pool which was not open when we visited (1st week of June). Do not expect any form of luxury at this hotel. Hotel is standard, rooms are quite small however clean and practical. 3* hotel in a great location. Overall a good hotel.", "Date": "June 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Great value + well located”", "Author": "KevinBLondon", "ReviewID": "UR131891305", "Content": "I travel regularly on business to Madrid and have stayed at a number of other hotels in the city. Given price (you can often get for cEuro100) it is excellent value. Don't expect anyhting swish or particualrly modern in the decor (it's very similar inside to a number of Madrid hotels with lots of wood panelling) but everything works well. Good size rooms and helpful staff, most importantly very good location for sights or in my case business and close to good bars/ restaurants in evening. Smart cafes for breakfast just round the corner and if you like to run, park close by (give the gym a miss - is small and the equipment a little tired)", "Date": "June 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Amersham, Bucks", "Title": "“Good Hotel and Excellent and very helpful Staff”", "Author": "sidj6", "ReviewID": "UR131513065", "Content": "We stayed here end of May 2012. It is functional and does the job. For Salamanca and also getting round Madrid it is the perfect distance. Comfortable hotel and does the job of shower and bed. There is a bus which takes 10 mins to take you to downtown Madrid past Gran Via. There is an excellent and very helpful tobacconist round the corner from the hotel. The best ! Retiro Park is 10 min walk from it. Serrano is the nearest Metro line. The ticket office TEYCI is right behind the hotel, just perfect. We like to shop at local markets and found one round the corner called Mercado De Lapaz. Found a store who do Italian ice cream and pasta in the market. Amazing and lovely we brought some home with us. Pasta that is. Found a very very good Cafe round the corner called \"El Rincon De Goya\" Lagasca 46. Breakfast of Churros and the bread with Tomato is simple and lovely. The dinner I had there was quality.", "Date": "June 7, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Milano", "Title": "“Location”", "Author": "volubilis", "ReviewID": "UR127419132", "Content": "In march i spent a weekend in Madrid, The hotel is very well located,close to all the most important attractions. The building is modernthe ,rooms are spacious and clean. The breakfast is excellent.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "St. Louis", "Title": "“Great hotel in a perfect location”", "Author": "SanjBha", "ReviewID": "UR125894315", "Content": "I just stayed at the NH for a conference in downtown Madrid. The location was perfect. The neighborhood is very safe and very enjoyable to walk around. The plaza mayor was about a 15-20 minute safe walk and there were way too many great restaurants in walking distance. My favorite was a modern tapas restaurant named Lateral. The rooms were clean and modern. My only irritation was wifi which was free in the lobby alone.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“Good hotel for businesstravellers”", "Author": "chatoga", "ReviewID": "UR125854468", "Content": "Good hotel, good service, great location and fantastic breakfast", "Date": "March 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Uxbridge", "Title": "“Better signage needed to find hotel !!”", "Author": "UncleDom", "ReviewID": "UR124672510", "Content": "Stayed here for 2 nights last weekend & arrived late & found the hotel a a bit hard to find at night. It is set back from the street right by the Melia Gran Hotel Felix by Colon metro. Once checked it all was ok. Good location right by metro and bus stops to Gran Via & Sol. Room was good sized & beds were very sleepable. There was also great shutters/blinds on the windows so it was totally dark at night & or the morning sun. I was on the 5th floor looking inwards with nondescript view but it was very quiet. Bathroom was large & had a tub which is always nice, only a small amount of toiletries & shower gels but these were replaced the next morning. Room was very clean & modernish, lots of wood. Flat screen tv & small fridge with minibar for your water. Did not have breakfast in the hotel as was in the rate, there are 2 coffee shops on Goya a few doors from the hotel both open on Saturday & Sunday morning for your coffee & croissant fix. Would recommend and probably would stay again if in Madrid. Fab cake shop on Calle de Genova offering cake & cava for 6 euro in the afternoon, nice treat before flight home, sorry cannot remember the same, it also did fab quiches & sandwiches & filled rolls. Did have drink at roof bar on Oscar Roommate hotel - drinks for 2 came to 24 euro for G&T and Vodka & coke !! ! Shocking.. Do snack at San Miguel market, it is wonderful & cheap as are the Museo del Jamons on Calle Mayor & Paseo del Prado - everything is 1 euro!!!! Very busy & great atmosphere.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Philadelphia", "Title": "“Needs an Update”", "Author": "misteri0ustraveller", "ReviewID": "UR120818374", "Content": "My room was ok... I would say this hotel needs to be a refurbished a bit. You have to pay for wifi, but like most NH hotels, you can get it for 30mins in the lobby if you ask the front desk for a password. Beware of one of the waitresses at breakfast!! Basically as mean as it gets!", "Date": "November 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Needs Refurbishment - Great Location”", "Author": "mx_pie", "ReviewID": "UR120613397", "Content": "It's simply embarrasing when you find a fantastic location and the hotel is just plain sad. That's what happened in NH Sanvy. There is no better location: Columbus Square in Madrid, right next to the Serrano shopping area and Castellana (main artery for Madrid). The place was probably an OK hotel back in the day, but the fact is that it isn't anymore. The entrance is small and old fashioned, filled with staircaises and no ramps (no straight access for handicap). The property also has many graffitti-like writing on the doors of the elevators... it's just sad. The service was good, not the best but pretty good, I didn't enjoy, however, the fact that they said my room number out loud. That makes me feel uncomfortable (although there were no other guests there at the time). The room furniture looked very weared out but the bathroom was fantastic, as well as the amenities. But the thing that made my stay worth my while was breakfast!! Really surprisingly good!! The problem is, though, that the food does not compensate the rest of the stay... it's a hotel that urgently needs a refurbishment.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Great hotel in a great hotel in a fantastic city”", "Author": "RichyP2000", "ReviewID": "UR120465898", "Content": "Stayed 3 nights in the NH Sanvy and was very impressed with the high quality of the hotel. My room wasn'tparticularly large but very clean and welcoming. Overlooking an internal courtyard meant that there was no discernible noise and I slept very well. The reception staff were always helpful and the breakfast was plentiful. Being close to the Serrano metro station meant easy access to get anywhere around the city.", "Date": "November 11, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Miami, Florida", "Title": "“Robbed in the lobby upon check in”", "Author": "Lexi S", "ReviewID": "UR118025101", "Content": "On Sept. 3rd, 2011, upon arrival in Madrid and check in to this hotel at 9am, my husband's backpack got stolen from under his mom's feet while she was checking in to the hotel at the front desk, as he brought our luggage into the hotel. The Tumi backpack contained laptop, cameras, chargers, eyeglasses, drawing pens and pencils, among many other valuables. The worse part is that the hotel claimed NO responsibility, saying that this was a result of carelessness on our behalf. To make matters worse, the reason we had made reservations here was because they claimed to have handicapped showers in some of their rooms for my 82 year old mother-in-law to use. And when we checked in they claimed to not have available. Needless to say, we immediately proceeded to look for another hotel to stay which offered the handicapped showers. We found the Hotel Felix Melia, right down the street, which offered the appropriate shower, as well as 24hr security in the lobby and the restaurant/bar as well. We had a suberb experience at the Melia. So if you decide to ever stay in the NH Sanvy, please never leave your belongings unattended anywhere in the hotel premises, not even in your room.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Firenze", "Title": "“Convinient location in Madrid, rooms little bit small”", "Author": "stefano32", "ReviewID": "UR115708695", "Content": "The hotel location is not bad, the distance to the centre require a taxi but the trip is quite short. The hotel is small with a simple lobby and resurant, it is well organized and the breakfast is good. The rooms are clean but a a little bit small. The staff is efficient and kind. The solution is OK for a convinient hotel in Madrid with a good standard.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Half Moon Bay, California", "Title": "“Excellent location with a few draw backs....”", "Author": "MadridClydo", "ReviewID": "UR114983806", "Content": "I stay at many NH Hotels and know pretty much what to expect. My family and I stayed in 2 rooms for 3 nights. This hotel was slightly disappointing, and many things could easily be made better. The rooms were average and OK. The bathrooms were above average size. Also, for being in a city, it was extremely quiet. The breakfast was also pretty good except for finding a container of moldy garlic for pan con tomate. A lot of the fruit was either unripe or over ripe. The kiwis were like pieces of wood. What was strange were stairs leading up to the elevator in the lobby, so we had to heft our luggage up stairs to get in the elevator. There was not even a ramp for roller bags. The would be a good suggestion for the hotel Also, the beds were really hard and uncomfortable. They made me sore. Lastly, we asked for extra pillows 3 times and finally got them the last night. The pool area was disappointing as well. It is an area with lots of potential, but it seems a little run down with some sun chairs as well as tables and chairs. They could develop into a very nice area if they wanted to. Internet was free in the lobby and 17€ in room. A little expensive. On the positive side, this hotel is really in a great location to walk or metro to key sites in Madrid. It was also very quiet for being in a city.", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Nice place, although stinky and expensive”", "Author": "Kelvin20", "ReviewID": "UR113941490", "Content": "Nice hotel, large room, very fine bathroom. But the whole building smelled like cigarretes and garbage. At night the smell was worse, we put perfume all over the room. It's not a cheap hotel also, they charged us for breakfast and the bill was pretty scary. Don't know if I'd return, but the location is good and the room is comfortable.", "Date": "June 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good hotel. Good location”", "Author": "Gazjay", "ReviewID": "UR110599708", "Content": "Stayed here for two nights. Good hotel. Doesn't look much from the outside. Nice modern rooms. Great location close to two Metro stations. 40 mins from airport, 15 mins from Bernabeu, 15 mins from Opera area. Very nice high end shops near by.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brunssum, The Netherlands", "Title": "“Very Mixed Review”", "Author": "Pisces49", "ReviewID": "UR85331556", "Content": "This is a modern, clean hotel. Pros: The housekeeping staff do an excellent job. The breakfast is excellent and varied; continental, but hot breakfasts are available on request. Cons: The reception staff is surly, unhelpful, uninformed and seem to have only one answer to any question: No. The temperature in our room was 25.5 C on arrival and there is no indiviual temperature control in rooms. Management doesn't seem to have any oversight on staff performance. The breakfast organisation is dismal at peak periods; there is insufficient space and no room for overflow; the staff couldn't keep up and were also abrupt. Maintenance is obviously not a high priority, as there was a number of defects in our room. On the whole, the hotel is over-rated and I would not stay there again.", "Date": "October 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Middle of the Road. Good location.”", "Author": "mam8806", "ReviewID": "UR81632453", "Content": "Although I got a good deal on priceline, it was decieving because I bid on a 4-star hotel and this is more like a 3-star by American standards. But it's sufficient and quiet. Internet is extra. However, location right next to the Serrano metro station and tony shopping street made it better. A new Pain Quotidien around teh corner made it even better.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Surrey", "Title": "“Standard hotel, clean room and good location”", "Author": "AuntyMG", "ReviewID": "UR75150063", "Content": "A standard hotel, clean room. Has a good swimming pool on the roof. Aircon was very good.", "Date": "August 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Standard hotel and close to the center”", "Author": "spinnea", "ReviewID": "UR73811691", "Content": "The room was tiny and the bathroom not cleaned every day. It was pretty quiet even though it's so close to one of the bigger roads. The hotel is close to several metro stations and well connected to the city center and the airport. We didn't go to the restaurant and bar. There're way enough other opportunities only several minutes away.", "Date": "August 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "France", "Title": "“Great Stay”", "Author": "jsfountain", "ReviewID": "UR67498000", "Content": "Won this hotel on a bid on priceline. Great value as we stayed for more than half off the normal price. Family of 4 (2 children ages 6 and 2). We only used the room and none of the other services the hotel had to offer. They had breakfast there but we always had each of our meals outside the hotel. The room was very clean and very quiet. We never heard anyone once we got inside our room. The size was plenty for a family of 4. The bathroom was large enough and the air condition worked very well in the room. Lots of TV channels. The hotel is in a quiet area even if it is located on a primary avenue. Hard Rock Cafe is right next to it. We easily could walk into the city center of Madrid from the hotel. It took us only 10-15 minutes to walk there (walking with small children). There are regular city buses that are just in front of the hotel on the primary route that take you into the center of town as well. Reception and staff seemed very nice and ready to help. I would stay here again and recommend it! A really great deal using priceline!", "Date": "June 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Not worth the price”", "Author": "Carine_10", "ReviewID": "UR65828350", "Content": "The rooms were nice, and the hotel is in a good location, walking distance to the center. Heating did work and A/C was running regardless of thermostat setting, making it for a very cold room. The shower hose was loose and leaking, not the kind of service expected from a 4 star. Wifi was not free, except in the lobby for the first 30 minutes. Staff was unhelpful at check-in and did not provide alternative parking options to their full parking. Parking was27 euros/day (hotel parking) or ~30 euro/day in the alternate parking we found.", "Date": "May 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "san diego", "Title": "“Decent hotel for the price”", "Author": "Delano", "ReviewID": "UR60683050", "Content": "We stayed at the Sanvy for one night. It was a bit difficult to find because the entrance is sort of on a side alley and the hotel takes up one portion of a much larger building. The room was decent but a bit small. The \"double\" room was really two twins pushed together. The TV was mini (but who really watches TV in Madrid). The bathroom was big, however we had no hot water in the morning and had to take cold showers. We had to catch a flight, so no time to complain to the front desk. We got a priceline rate of $80/night, and for that price, it was a good value. Clean, decently comfortable and close to the metro. However, I would not consider it a \"4 Star\", and would have been disapointed in it if we paid $100 or more per night.", "Date": "April 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Nothing Special”", "Author": "JulietBravo", "ReviewID": "UR50359603", "Content": "I got this hotel at $100/night on priceline as a 4 star and felt a bit jipped. it was ok. clean, but nothing special. location was a good 15 min walk to sol, gran via and plaza mayor etc though very near 2 metro stops and directly adjacent to a fun hard rock cafe. the gym was a tiny room. the bedroom was quite and tiny too. the reception did their job but was not very friendly about it and the cleaning staff tried to enter our room three times in the morning without knocking or such 20 min apart knowing we were still inside. it's not a bad hotel, but you can probably do better.", "Date": "November 30, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Lisbon", "Title": "“Good Hotel very Central”", "Author": "MouraPT", "ReviewID": "UR27986615", "Content": "Very good and central hotel, the rooms is good but small. Breakfast is good, and people is nice.", "Date": "April 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Great Hotel”", "Author": "ma_sp11", "ReviewID": "UR16836983", "Content": "I stayed 3 nights at NH Sanovy. It's clean, confortable, the bed and the bathroom are great! It's a bit expensive for a South American citizen. The back rooms' view isn't very nice, however the front ones are wonderful!", "Date": "June 10, 2008"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Unfriendly Reception Staff”", "Author": "Ed L", "ReviewID": "UR5359978", "Content": "Pros - This is a modern business hotel in a reasonably cebtral location. The rooms are of a fairly good size and the bed is comfortable.Breakfast buffet is good Cons- Very off hand and reception staff . I gave them the benefit of the doubt after a very curt checkin without a smile or thank you. On departure they tried to charge me for breakfast when I had booked b and b. When I pointed this out the receptionist said 'show me'in a curt manner. Surely the hotel should knowwhat rate has been booked?When she realised she was wrong she said the rate I had got 'doesnt get breakfast' - no apology.", "Date": "June 19, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Phoenix, AZ USA", "Title": "“A quality hotel”", "Author": "VickiLH", "ReviewID": "UR4896373", "Content": "I stayed at the Goya 3 property of this chain in late March 2006. I had a great experience and can easily recommend this hotel. The room (a mini suite) was spacious, and nicely done with hardwood floors and tasteful furniture. The bath was also large and done in marble. The front desk staff was always helpful, and someone could generally speak English if asked. The breakfast is quite nice, but not included in the price of the room and a bit pricey. The hotel is located close to two metro stops, high-end shopping and several attractions.", "Date": "April 4, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Unknown", "Title": "“Best Breakfast I have had”", "Author": "A TripAdvisor Member", "ReviewID": "UR1481530", "Content": "NH Sanvy...someone said its central, its not really. For more central stay on the Gran Via, however its central enough, close to Plaza Colon and about a 10-15 minute walk to the Gran Via with all its shops and restaurants. Close to Teatriz Restuarant though which is very very swish and superb. Sanvy had tiny cramped rooms and not very good facilities. OK bar, OK reception, no gym. The bath water was also a bit lukewarm and brown when we were there and they seemed to be having problems with air-conditioning. But the thing that really sells Sanvy is its breakfast. Honestly second to none of the 8 or so hotels I have stayed in in Madrid. The restaurant also is superb, very high quality and good size portions compared to say the Bauza, which has a bit over priced food for tiny portions. I would recommend Sanvy for a one off, just to experience the breakfast then stay somewhere more central.", "Date": "November 11, 2003"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "New York NY", "Title": "“Expensive and small”", "Author": "smwe2000", "ReviewID": "UR1442686", "Content": "This hotel is in a very expensive area of Madrid. All of the sites require a taxi to reach them. The rooms are small and the breakfast which is not included is very expensive but lavish. The hotel gives you lots of little perks like poetry books and mints but it doesn't make up for the tiny rooms and paper thin walls.", "Date": "November 9, 2003"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "4", "Service": "1", "Rooms": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“mixed review”", "Author": "KyleWeeks", "ReviewID": "UR1387763", "Content": "I had a very mixed experience with this hotel. On the positive side. - Good location: close to some nice shopping and the subway. - nice rooms - lots of hardwood However, there were also several negatives: - the street outside can be very noisy. One night there was a loud parade, complete with a marching band, that went on until 2AM. - The staff was not very helpful. They had a problem with their credit card machine and insisted that I pay cash. When I told them I did not have that much cash, they asked my top go to an ATM. I asked if I could exchange a traveller's check, then I could pay in cash, but they refused to allow me to cash a traveller's check. The matter was finally resolved after 30 minutes in which they ran through my credit card through on a series of smaller charges, but I almost missed my flight due to the delay. - The staff is unable/unwilling to call a taxi for guests. They make you go to the street to hail your own cab. Do to the problems I had with the staff I would not stay here again.", "Date": "October 14, 2003"}], "HotelInfo": {"Name": "NH Sanvy", "HotelURL": "/ShowUserReviews-g187514-d206970-Reviews-NH_Sanvy-Madrid.html", "Price": "$109 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Goya 3</span>, <span class=\"locality\"><span property=\"v:postal-code\">28001</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "206970", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/eb/10/eb10c280f9ce3585d02d87c0cfef476a7large.jpg"}}