{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brooklyn, NY", "Title": "“They Almost Got A Stellar Review...”", "Author": "Deltared01", "ReviewID": "UR128083073", "Content": "...until checkout time and the woman at the front desk spoiled it. Now my stay will forever be marred by my checkout experience. PROS: - Great location: 2 blocks from Arc de Triomf metro stop, less than 10 mins walk to Placa Cataluyna/La Rambla/Casa Battlo. Less than 10 euros to La Barcelonetta, but easy transfer via Metro. - Energy Efficient: need room key to turn on lights - Helpful staff: Most front desk staff spoke English, so it was easy to communicate and get directions. Provided wake up calls and held our luggage until our room was ready. CONS: - The walls are super thin. We could hear everything in the hallways from our room. - The shower: it's completely strange how it only covers half of the bath. A taller/bigger person will unavoidably get the bathroom floor wet. - Internet: it's almost 11 euros per 24 hour period but the service was spotty and sometimes slow. - Bill: this was the reason they didn't get 4 stars...at checkout, they charged me for a drink that I supposedly had at the bar. I explained that there had been a mistake, that I'd never been at the bar because I didn't even know there was a bar. The clerk kept insisting that it was my bill, even after I pointed out that someone had written a different room number on the top of the receipt. I ended up having to pull out my ID with my signature to prove that it wasn't me. All this for 3 euros! It was a bit offensive. GOOD TO KNOW FOR AMERICAN TRAVELERS - There is no converter in the room. You can charge your phone in the lobby for 1 euro for half hour or 2 euros for a full hour. We bought one at a hardware store for 1,35 that worked with our iPod, iPad, Blackberry and two different types of camera batteries. - There's no iron in the room. You have to send your items to the laundry. - The TV has only 3 English-speaking channels: BBC, CNBC, Russia Today. Last one isn't a big deal, but if it's rainy and you want to stay in, your TV viewing options are limited. -", "Date": "April 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Northampton", "Title": "“Average”", "Author": "Peter1Northampton", "ReviewID": "UR127911043", "Content": "This is a well located hotel for the Gothic quarter and the port. The rooms are reasonable but quite hot event with the air con on. The floors in the room are wood veneer so you hear everything on the floor and the walls are quite thin. It is quite noisy at night. There are no bathrobes in the rooms as per the description on the main site, breakfast buffet is reasonable.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Shrewsbury, United Kingdom", "Title": "“Well worth the stay”", "Author": "ChloeNorris11", "ReviewID": "UR127820823", "Content": "My partner and I stayed at the NH Podium for four nights during the easter weekend. After arriving at the airport we found out our plane had been delayed nine hours so we were gutted to have lost one of our days in Barcelona. However, the reception staff were very welcoming and helpful. The rooms are very large and cater for every need. To my dispare I had forgotten a razer and I noticed they provided; soap, a tooth brush, shampoo and a razer and shaving cream. The hotel was cleaned every day to a very high standard. There was a hair dryer which was very useful also. We often asked a lady behind reception for directions towards attractions and she was very helpful and spoke fluent English. We didn't eat at the hotel once because there was many nice places to eat out, especially in La Ramblas (Tapa Tapa), La Rambles was a 5-7 minute walk away from the hotel and you can catch the Metro so that you can experience all of Barcelona. We visited most places in Barcelona in 3-4 days. The only criticism I have is that the room that we stayed in had two seperate single beds put together and they moved apart very easily. The walls are very thin between each room so you can hear your next door neighbours slightly at time to time. (Running water etc) I would recommened anybody to stay at NH Podium.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“Not quite as I'd hoped”", "Author": "Rose823", "ReviewID": "UR127152746", "Content": "Me and my partner stayed 2 nights at the NH Podium (31.3.12- 2.4.12). The positives were the roof top pool, which was superb to soak in after a long day exploring. The hotel itself is situated in a great location, a short walk from many tourist spots and central to the coach station for transfer to Gerona Airport. The thing that really disappointed us about the hotel was how noisy it was. The walls were so thin that you could hear your neighbour cough, doors closing and just people generally moving about, was enough to wake you, even my partner who is a heavy sleeper! On this note due to 2 nights bad sleep I wouldn't stay here again, even with the luxury of a roof top pool. Next time I'll shop around, plenty of choice. Sorry NH Podium :(", "Date": "April 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "4.0", "Value": "4", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Mixed Feelings”", "Author": "Aidan S", "ReviewID": "UR126186393", "Content": "Me and my partner arrived on 5th March and stayed for 4 nights. It was a mixed experience. Some pointers that any potential visitors to this establishment might find helpful: - Despite warnings by the very friendly and helpful hotel staff to be sure that we placed any towels in need of replacing on the floor of our room, we discovered to our alarm that the same towels had just been rehung -- old masquerading as new. Bodily secretions from the previous day proved the telltale sign. Upon reporting this matter to the hotel staff, the intimated that they knew exactly which employee was responsible for the debacle, and that they would be duly reprimanded. I stopped getting mints on my pillows. - Whilst the pool enjoys a brilliant, secluded location atop a building in the city centre, we found to our surprise that someone had left, what I later found out, the locals termed a 'turdburger'. I fear someone had a little too much fun the previous night. Nevertheless, I reported this and the deposit was promptly cleared up. All in all though, a great experience and I would visit again. 4/5", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Lovely hotel, great location”", "Author": "Paul W", "ReviewID": "UR126040666", "Content": "This was my first time booking Barcelona. I found this hotel on Late Rooms site and committed due to it's positive reviews. The hotel is in a fantastic location, only a 5minute walk from Placa Catalunya. Its also just a single road walk so very easy to find. The first impression of the hotel is the grande entrance and nice furnishing of the bar/waiting area and reception desk. We arrived at 1pm and were able to check in 1hour early which was very pleasing and an indication of their efficiently. The room was very lovely. Nice sized bathroom, nice make-up/sink/wash area and a really nice spacious bed/rest area. The interior was really modern and impressive. We did not eat or drink oat the hotel, simply because we wanted to experience everything in Barcelona. Definitely recommended and a great price.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“well located and well featured”", "Author": "morants", "ReviewID": "UR124953139", "Content": "stayed at the podium during weekend. room is rather comfort and featured with everything you may expect from a 4 star hotel. the location is great. just 10m walk from the gotic Q and 20 m walk to the rambala. TV screen is so small that you can hardly see something. the stuff was very corectly, with poor english or understanding about what the city can offer or giving recomendations.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Great stylish room - excellent breakfast buffet”", "Author": "PamK45", "ReviewID": "UR123163540", "Content": "Room was modern and clean, with wooden floors and separate changing area. TV didnt have a massive choice of English channels (just the news channels) so if you are there for a few nights and want to have a quiet night in one night then take a book. Breakfast buffet was one of the best I have experienced and is served until late at the weekend so you can have a lie in. Although it was November when I stayed the weather was fairly warm and there is a lovely root terrace with a pool - however it was quite obvious the pool wasnt cleaned during the winter so unfortunately you couldnt have a swim. Location was excellent as it was in an area of Barcelona that was fairly quiet, but just a 2 minute walk from the metro station, and you could walk to La Ramblas in 10 minutes.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Pleasant little hotel”", "Author": "carolithe", "ReviewID": "UR120579727", "Content": "Stayed here in a Standard Room for one night, found it to be quite modern, clean and had all the basics. Comfy twin beds with crisp sheets, wooden bedside tables & desk, big windows with thick curtains that block out the light, lovely well-lit marbled bathroom area with stone floor and stone bench for the sink, a shower/bath, closet with electronic safe and a free toiletries kit (sponge, shower cap, citrus hand soap, body milk, shampoo, shower gel, razor, toothbrush). After checking in, we discovered that we'd been mistakenly placed in a room on the smoking floor, but when we pointed this out to reception staff they immediately fixed us up with a room on a non-smoking floor, which was fantastic. Had no problems communicating with staff, they all spoke excellent English, which was greatly appreciated as we didn't speak Spanish or Catalan! The hotel is about 5 mins walk from the Arc de Triomf metro station, easy to get to from Barcelona airport - we caught the Aeroport RENFE train to Barcelona Sants and changed to another RENFE train on platform 8 that passed through Catalunya and then Arc de Triomf, took about half an hour. (Aeroport trains seem to run every half hour.) Behind the Arc de Triomf is a really lovely park, with access to the Zoo, and the Gothic Quarter is just next to the park so the hotel is quite close to some great places to wander. Didn't try the pool, or the hotel breakfast - instead we wandered out and found a lovely artisan bakery near the metro station & across from the Arc that did great pastries (can highly recommend the canya xocolata which is like a chocolate puff pastry roll). The only downside was that the walls aren't very soundproof, so you can hear your neighbours' doors opening and closing during the night, this may be an issue if you're a light sleeper like my boyfriend is.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne Australia", "Title": "“Great Location/room & staff”", "Author": "FionaJM", "ReviewID": "UR120475474", "Content": "Had to find a hotel that was quickly as the one we booked was simply too noisy and we are so pleased we went here (it was around the corner from where we had booked and where our friends had been able to get a quiet room). Marc at reception knew exactly what I meant when I requested a quiet room, he directed us to the rooms facing the rear (it was great to see the old architecture of Barcelona). Rooms facing out onto the street can be noisy and if you are at all bothered by the sound made by scooters then ask for a rear room. Room was spacious including the bathroom. The bed was a little on the hard side but not like sleeping on the floor as it can be in some european beds. Shower pressure was good. While you can hear people walking in the hallway and their doors banging shut overall it is still a restful place. Internet is not free though but there is a refridgerator in the room. We did not try the restarant or bar but the bar seemed very popular. The rooftop pool was great .. just remember to bring towels up from your room though. It was an easy walk to Las Rambles and La Sagrada Familia. There is also a well stocked supermarket under 5 mins away.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Petersfield, United Kingdom", "Title": "“well located hotel with great facilities”", "Author": "bjf56", "ReviewID": "UR119988379", "Content": "stayed five nights and highly recommend everything about the hotel! very clean spacious room, proper bar area and lounge area, lovely rooftop terrace, rooftop pool (although we did not use due to the time of year!). The breakfast is excellent so try to get a rate to include this! staff helpful at all times. very close to Arc de Triomf metro although not mentioned on hotel page! a good 10 - 12 mins walk from Placa Catalunya but an easy walk so the airport bus is a good option.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "herzele", "Title": "“NOT FRIENDLY AT ALL”", "Author": "schermen", "ReviewID": "UR119282823", "Content": "business trip, hotel desk reception not friendly at all, breakfast was good but very expensive !!! hotel also too expensive next time back to actual hotel !", "Date": "October 14, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Nice, clean and good location”", "Author": "Middlesex292", "ReviewID": "UR118225857", "Content": "Visited Barcelona early September 2011 and stayed here for 4 nights. Breakfast is a must out and about with many places locally to choose from. Hotel was clean and comfortable but not over friendly however lacked the more personal touch. Room air conditioning not that great. Very expensive room service and breakfast but enjoyed the more enjoyable and reasonably priced evening meal in the restaurant with excellent service. Well situated hotel within easy walking distance to most of the places to visit. Take the fantastic, hop on, hop off official tourist open top bus to visit the rest or even to revisit. Great way to see the city from the centre. We would recommend the hotel for it's location, facilities and cleanliness.", "Date": "September 17, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“Good location, don't bother with breakfast”", "Author": "UkLorelai", "ReviewID": "UR118164802", "Content": "The location is good, a short, safe walk from the old town. There are plenty of cafes and small supermarkets around the hotel. The closest Metro stop is Arc de Triompf, which also has a light rail link (RENFE) to the main Barcelona Sants station (closer than the stop advertised on the hotel's website). The hotel rooms are quirky and split-level, they are quite small but spotlessly clean. All the staff were very polite, but not particularly helpful. There didn't appear to be a concierge desk. The roof-top pool area is only open from 10am. It is quite attractive but plays music all day, albeit fairly quietly. The pool is really quite small, it looks deceptively larger in the hotel's photo. The pool has no shallow end. Breakfast was quite poor considering the price. You can request a hot breakfast (if you can find a waiter to order from) but clearly the English Breakfast concept is still (perhaps rightly) not the norm. Given the number of cafes within a short walk I would recommend room only.", "Date": "September 15, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Berkshire", "Title": "“OK - good position for exploring and nice rooftop pool”", "Author": "whooker", "ReviewID": "UR118149968", "Content": "Stayed for a short break in July 2011. Wanted a convenient hotel, with a pool to relax for a few days. NH Podium fits the bill - it's well located- about 15-20 min walk to Las Ramblas which is great if you don't want to be too close too! El Born is the place to be though - we would walk down to the El Born area for dinner each night (about 10 mins) . A lively and cosmopolitan area, realtively safe and laid back with some great Tapas and Wine Bars - and so much nicer than the Ramblas areas..", "Date": "September 15, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Nice hotel with close location to centre of city”", "Author": "Gottogetaway01", "ReviewID": "UR118131883", "Content": "Stayed for almost a week in August after a cruise. Beautiful roof top pool area. Quiet (except for families who let their children (not under 5) scream and yelp continuously while playing for hours on end) and clean. Drinks and food very expensive. Spent each night in the pool area despite this as after families left, it was quiet and peaceful. Hotel itself very quiet on a quiet intersection. Only about an 10 minute walk to the centre of the city. Used the quick and cheap airport shuttle to get back to the airport from there. Friendly staff. Free internet for only 5 minutes per day. Overall a good hotel for a tourist stay in Barcelona where you out all day and good for an late afternoon siesta on pool deck before heading out. Would recommend.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Luxembourg", "Title": "“Junior 'sweet'”", "Author": "LuxembourgHoney", "ReviewID": "UR117966872", "Content": "Our family of 4 (2 adults, children aged 4 & 1) stayed in a junior suite for one night. I can recommend this room for a small family or a couple in need of a bit more space. There are 3 main areas within this suite: sitting area with sofa bed, TV, tea/coffee facilities, armchair and side tables; main bedroom with very comfortable king size bed, a second TV, desk, minibar, side tables and stool; and a bathroom area leading from the main bedroom - this had a separate washbasin area with sliding door storage/wardrobe opposite. Then through the door to the bathroom with medium-sized bath with shower above, toilet and bidet. Plenty of toiletries were provided in this suite. If you require a baby cot as we did, it might feel a little tight for space when the sofa bed is pulled out, however, you may not spend so much time in there to become a huge problem. For us, it was a proper family room, in that there was separate areas for adults and children when required - provided by a sliding partition door between bedroom and sofabed/sitiing room. A TV in each area also allowed the kids to be entertained by the children's programmes and not be bored with the news channels etc. Unfortunately, the signal was poor on several channels on both TVs. The availability of a kettle is also invaluable to a family with a baby or if you just want a hot drink without leaving the room. We ordered room service, which took a little too long to arrive, but the quality of the food was very high and tasted delicious. Breakfast as stated on other reviews is expensive, but again, high quality and tasty. Typical continental breakfast choices with scrambled eggs, bacon and sausages as a hot choice. Although, this hotel (in particular the junior suite) is expensive it was a relaxing treat for our family and we would love to do it again. (Side note for families with under 4's - there is a small play area around the corner from the hotel on the main road and others within 10-15 min walk in the City Park through the Arc de Triompf).", "Date": "September 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Nice hotel, helpful staff, not best location for tourist”", "Author": "Mark_25_25", "ReviewID": "UR117928279", "Content": "The hotel was very nice with a great rooftop pool and seating area. The room was acceptable but beds were not very comfortable (as is typical in Europe). The a/c didn't seem to cool the room very quickly and as is custom in Europe wouldn't run unless you have your key in the power slot. Everyday when we returned from sightseeing we had to wait quite a bit for the temperature to cool down to a comfortable level. However, the room was clean and overall acceptable. This location proved to be a bit further out then I prefer. It is close to the Arc di Triomphe metro station but in most cases it required changing trains to get to where you wanted to go. Not terrible but I prefer to be just on the fringe of the local activity.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "london", "Title": "“Lovely hotel will definitely return”", "Author": "bulkaibublik", "ReviewID": "UR117532380", "Content": "We stayed in NH Podium for 5 nights in August 2011. Enjoyed every minute of it. Lovely room- superior- with a king size bed and very comfortable matress too)). Staff very helpful and pleasant. Roof terrace is absolutely amazing. we spend hours sunbathing and swimming in the pool.Would love to come back next year. The hotel is centrally located within a walking disctance to all major attractions and 20 min walk to Port Viel and the beaches.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ireland", "Title": "“Great Hotel, Great Location, Will definitely return”", "Author": "MB2704", "ReviewID": "UR117260762", "Content": "We stayed for 5 days in the NH Podium in Barcelona. The hotel is in a fantastic location for exploring the city, and for easy access to the beach. We walked everywhere but on occasion used the metro which is located very close to the hotel and very easy to navigate. The hotel staff were very friendly and helpful, we enjoyed the roof terrace with swimming pool during the day, and at night it was a lovely place for a night cap in the terrace bar. It is a short walk to La Ramblas - no more than 10 mins with lots of shops and little cafe bars along the way. We plan to return to Barcelona next year and to the NH Podium.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel, would go back”", "Author": "london090868", "ReviewID": "UR116618087", "Content": "Nice hotel, just 10 minutes walk from the Centre of the City and a short taxi ride from the Port. Rooms were clean and comfortable, good bathroom facilities with complimentary toiletries. Rooftop terrace offered a great place to relax and chill out soaking up the day time sun and evening sunset - open until midnight", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Suisse", "Title": "“Very good hotel right in the center of the city”", "Author": "LesLoulousSuisse", "ReviewID": "UR116579375", "Content": "we spent 2 nights in this hotel with our children. These are the good points of this hotel : - Well located in the old town - Very nice swimming pool on the roof with breathtaking view of the city. - Excellent breakfast with excellent choice. - Modern and clean rooms - Indoor parking - 4 elevators so no watiting time ...and the bad points : - Noise isolation is very poor between the rooms. - Reception is a bit cold. - No communicating rooms for families with children. An hotel we would certainly recommend.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "wirrral merseyside England", "Title": "“Great hotel”", "Author": "blackdevil", "ReviewID": "UR116561580", "Content": "Just to let you all know if you are planning a break to Barcelona anytime you will not go wrong if you manage to stay at the NH Podium hotel in the Eixample area of the city. It is only ten minutes walk from the hotel to the centre and to the top of the las ramblas. The hotel has a large pool on the roof,sun deck,tables and chairs all around and a bar set in the corner plus a gym,changing rooms,shower rooms,showers on the roof outside,and to cap it all two saunas (do you need any more? ). We got a great deal with breakfast (continental ) but lots to eat,great room,large bathroom and a balcony, staff very helpful and security on the door of a night. On the morning of departure they opened the breakfast area early just for us at 07-45 . We highly recommend this hotel you will not be disappointed . The only problem we had is the taxi drivers outside talking in the early hours but tell reception and they will deal with it ASAP.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“perfect for central Barcelona break”", "Author": "David M", "ReviewID": "UR116537453", "Content": "We arrived at 9am, off a cruise ship, and the staff were extremely helpful in stowing our luggage until we could check into the rooms, and providing us with a map and advice. The smallish pool at the top is refreshingly cool and open late. Tiny Sauna. Didn't use the gym. Booked a double plus a twin and got two adjacent twin rooms, but not a big issue in the scale of things. The hotel is in a pretty quiet area, very close to the metro, or about 20 minutes walk from the Segrada Familia (which opens at 9am and I suggest getting into the queue by 8:45 at the latest - this is in August). Street cafes for breakfast 2 minutes away. For Brits, don't expect tea and coffee in the room. Taxis siut outside the hotel and the fare to the airport was 33 euros, for four of us. Thoroughly recommended.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“Excellent !!!”", "Author": "186342Sparky", "ReviewID": "UR115497538", "Content": "Lovely hotel, very clean and comfortable room with a balcony and the staff were welcoming friendly and helpful! Location good as we like walking, and pool on the terrace delightful with a bar and nibbles after a busy day. Location good 10 minutes to bus station and La Ramblas,5 minutes to Arc De Triomf and a further 5 minutes to the Zoo. 10 minutes further you reach Port Olympic with a great selection of bars and restaurants. Word of warning dont eat at the Arc De Triomf bar and restaurant on the corner the other side of the road before you reach the Arc De Triomph we ordered pizza and it was charred black at the bottom and uncooked on the top we sent it back uneaten and asked for the bill only to find they did not speak english? There were also a few drunks including a woman and child by this time and the guys were shouting at every woman who passed making them & us feel very uncomfortable, several people had already got up and left. We offerred to pay for the fries and drinks and two heavies came at us one with a very large stomach and mouth to match. We werent offerred a replacement meal and as they were getting very nasty we asked for the police to be called, fortunately they came quickly and the matter was settled. I would never recommend that place to anyone terrible!!!! There are some lovely places to eat so go right from the hotel and not left!", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Oslo, Norway", "Title": "“Enjoyed it”", "Author": "amaze79", "ReviewID": "UR114959304", "Content": "Nice hotel in the city centre, not far from the Ramblas (5-10 in walk). Large outdoor area on top floor, with sun terrace and a pool. Not so crowded. There is also a bar with reasonable prices, try \"Tinto de Verona\" (red wine with lemon soda or casera - summerwine). Had a room on the 4 th floor, nice decent size. Cheap minibar. A bit noisy from the hallway/aisle.", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Dallas", "Title": "“Disappointing, but tolerable”", "Author": "Texman", "ReviewID": "UR114852675", "Content": "On the advice of our travel agent, we booked the NH Podium Barcelona hotel for two nights as part of our two week Mediterranean tour in early June--assuming that as a member of the NH group of hotels, it should provide reliable accommodations. The positive features included its location within easy walking distance of attractive boutiques, department stores, and Catalonia Square--central Barcelona--as well as Las Ramblas; situated in a predominantly residential area thereby avoiding the more noisy main thoroughfares and intimidating traffic; and, general overall cleanliness. The two double beds were comfortable. The bathroom amenities were well presented and included the recurring European hotel offerings of a small bar of soap, shower gel, toothbrush with toothpaste, shower cap, disposable razor, shampoo, hair conditioner, and installed hair dryer with more than adequate generous guest towels--quite nice actually. The negatives: ?Inexperienced or at least inattentive front desk staff that practically ignored my standing there attempting to await acknowledgement of my presence despite having no other guests in queue. Tiny elevators that were slow to respond to their call. Split level rooms that required guests to step UP into the bathroom--which in the nighttime darkness, seeking not to awaken my wife by turning on a light, posed a definite safety hazard. Nonfunctional air-conditioning...upon leaving the room. Your room key card was required to be plugged into a central switch within the room to power on the electrical fixtures such as lights, television and air conditioning. Leaving the room necessitated your removal of the keycard, thus turning off all the electrical accessories. After a busy, tiring hot day of touring to return to essentially an unairconditioned hotel room toasting at 28-29 degrees Centigrade was most intolerable. The thermostat in my mother's room could not even be set lower than 24 degrees Centigrade--forcing her into bed essentially unclothed with her window open. It was well into the wee hours of the night before she actually became comfortable enough to actually sleep. The bell captain/bell hop lost a piece of our luggage--even though clearly marked with two labels as belonging to me. Eventually the suitcase was found in another guest's room later that night. That hotel guest was kind enough to deliver my luggage directly to our room, thereby avoiding the hotel staff, which was greatly appreciated. The breakfast provided with the room reservation was a continental style buffet, with toast being the only warmed food available other than coffee or hot water for tea. My mother requested cranberry juice which was unavailable. Some of the food selections were unfamiliar to us. It would have been thoughtful to have included signs identifying the food presented. I doubt that we shall ever return to Barcelona; but for sure, we will not return to the NH Podium Barcelona.", "Date": "June 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Great Location”", "Author": "db1174", "ReviewID": "UR113884388", "Content": "I would stay here again in Barcelona--primarily for the location. It was on a nice, quiet street, but very accessible to all of the sights including Casa Batllo, Sagrada Familia, and the Gothic and Born districts. The rooms were nice, but the stairs were a little tricky at night. Plus, whenever the neighbors opened their door, it sounded like someone was breaking in and whenever they flushed their toilet, it sounded like the room was flooding. Their \"free\" wi-fi was available in the lobby with a provided password that only worked for 30 minutes and they would only allow one password per room. If this hotel was in a bad location, I might not return, but the location made it worth it.", "Date": "June 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Barnsley, United Kingdom", "Title": "“Another good NH Hotel”", "Author": "Alqan", "ReviewID": "UR106835301", "Content": "We were there for my 50th birthday and had a really good time. The hotel is clean and well appointed as are all the NH Hotels we have stayed in. The location is about a 10 minute walk from the top of Las Ramblas in a relatively quiet are not far from the zoo and so is perfect for all the sights. We would definitely recommend the Podium to others.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Nice quite downtown hotel”", "Author": "Bigbuddahbud", "ReviewID": "UR103583175", "Content": "We stay 3 nights in this hotel we actually already know for its famous solarium and breakfast. We arrive on friday night at 9 but there was only one person at the front desk so we had t wait a bit...(10 min) We ask for a smoking king size bedroom, we had a smoking room but with twin beds... SO we called the reception and they moved us to the appropriate room. Rooms are nice with openable window, it's quite clean and well insonorized. However, there were noone at the front desk at any time and that shouldn't happen in a 4stars hotel. Even if the staff is friendly, it looks like there is no enough employee...In addition, internet is not included and even if most hotels doesn't includ internet, it's a shame to pay 8€ an hour for wifi. And finally, we had our beakfast we used to love for its richness (39€) but the actually changed the formula so there is no more \"bocadillos\" and the breakfast is not as good as it use to be. So it's a nice downtown hotel, 5 min away from plaza catalunya an 2 min away from Ciutadella parc. I recommend this hotel if you can find a good promotion (less than 100 €).", "Date": "April 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dusseldorf, Germany", "Title": "“Very good hotel for business and sightseeing”", "Author": "khmarch11", "ReviewID": "UR100604218", "Content": "I had organized a business event for my company at this hotel and we were very pleased with the quality of the rooms, breakfast, lunches and all services provided during the meeting. The staff was attentive and friendly, our requests were fulfilled quickly and satisfactorily. It is a modern, clean and well equipped hotel and a perfect location for a walk to the city centre.", "Date": "March 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bristol", "Title": "“NH Podium usual good NH standard”", "Author": "BristolAna", "ReviewID": "UR92174819", "Content": "We stayed at the Podium for 5 nights over Christmas. This hotel is in a good quiet location handy for Pl Catalunya, buses, metro, Palace of Music, Opencor mini supermarket, atm and pharmacy. We took the Aerobus from the airport to Pl Catalunya (8.75€ return) and then walked to the hotel about a 10min. On our return we used the bus to Catalunya and then picked up the airport bus. On arrival reception attended to us efficiently, we had requested a quiet non smoking room and we were offered a room on the 3rd floor with balcony and large bed. The room was spotlessly clean, the temperature control worked well, flat screen TV, fridge/mini bar, safe (large enough to take a net book), good shower over the bath, toiletries and plenty of storage. We didn’t eat breakfast in the hotel instead we used the excellent café/restaurant opposite (Scorpio) for coffee and toast with tomatoes and oil. We ate one evening at Hugo’s just a short walk away, good food in a relaxed setting. This is our 4th stay here so that shows how we feel about the hotel. We agree with other reviews that the free 30mins of wifi in the lobby isn’t good enough for a 4* in this day and age. Travellers expect to access information 24/7 especially when weather affects transport.", "Date": "January 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Surrey", "Title": "“Great modern hotel in central location, ideal for Ramblas”", "Author": "surreylady50", "ReviewID": "UR87772464", "Content": "After arriving to no reservation, inspite of an e-mail confirmation, an upgraded room was hastily found, and we were very impressed. Our room overlooked the street and the Scorpion cafe opposite, and was one of the two-level rooms, with a good sized bedroom area and a dressing and sink area. The bathroom was clean, and the amenities kit provides was very impressive, including razor and shaving cream, toothbrushes and paste, shampoo, shower gels and creams and all of a good quality. There was a good sized safe in the wardrobe which was important to us. What was so good though was the location - a ten minute walk to the top of Ramblas and in the other direction a short stroll to the Parc de la Cuitadella, and the Arc de Triomf. We used the little bakery round the corner from the hotel for coffee and pastries in the morning so can't comment on the breakfasts. When we return to Barcelona we shall definitely stay here again,.", "Date": "November 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Wells, United Kingdom", "Title": "“Very Spanish - in the best possible sense”", "Author": "wellensian", "ReviewID": "UR86061312", "Content": "The whole place is a symphony in marble..............deep Pyrenean green marble in the lobby, white marble throughout in the bedrooms. You really knew you were in Spain...even the corridors had that agreeable faint smell of old-fashioned Eau de Cologne that all Spaniards used to favour. Staff were most obliging: I asked for an exterior room with balcony if possible, and they had a very good room available, if i did not mind going on the smoking floor. In the event, I reckon that nobody had smoked in the room for months, so no problem. The room was the most unusual and original I have stayed in for a long time. There was a marble-floored corridor, leading to an area with wardrobe and marble topped basin area (with fresh flower). A separate door led to the rest of the bathroom. At the end of the corridor was the door to the bedroom, which opened into an area 5 feet above the bedroom floor, so that the first item was a marble staircase leading into the body of the room. Even the workspace was marble topped, and the other furnishings were modern and interesting. I was told that some singles are rather small and that I had the best available at the time. This is the sort of hotel I really like, respectful of the 19th century exterior, while modernised yet characterful inside. Facilities were remarkable for a city centre hotel, with even a swimming pool on the roof.", "Date": "November 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Miami, Florida", "Title": "“Very noisy!”", "Author": "GELD_1978", "ReviewID": "UR82192408", "Content": "If you plan to sleep after 8am, this is not your hotel. You can listen to the cleaning ladies rolling the cart and moving beds all over our floor. Also, everytime the elevator comes, a bell rings, yes a bell as in a doorbell, I know, makes no sense to me either. Room service is a joke! They present you this fancy menu bragging abouth their 24hours food. I call at 4pm and they couldn't even made a sandwich, the bartender answered saying the kitchen was closed, hello, that's why room service is for! No ventilation in the rooms and bathroom. The A/C only works in the bedroon itself. Bathroom and closet are hell if you visit in summertime. The only good thing about this hotel is the personel, I can only recommend them to find jobs somewhere else. Don't come to this hotel, try the AC Hotel. Excellent location, service, etc....", "Date": "October 5, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Scotland", "Title": "“Fantastic hotel”", "Author": "DinkyDavros", "ReviewID": "UR81656683", "Content": "Loved this hotel and do intend returning. We had a junior suite which was huge, had lovely toiletries and was spotlessly clean. Best of all was the terrace and pool area. With it's chilled out music and comfortable furniture, it was the perfect place to relax after a hectic days site seeing. Location was perfect for us - ten minutes easy walk into the old quarter, but set in a nice quiet area away from the hustle and bustle. Good metro links - 2 within 5 minute walk. There is nothing really around the hotel in terms of cafes or restaurants which was a bit of a drawrback, but there is an excellent cafe called Scorpio just across the road where we ate a few times.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "france", "Title": "“Abit noisy but overall good especially the pool and terrace”", "Author": "hoppalongkate", "ReviewID": "UR79613505", "Content": "Well located so you can walk practically everywhere, and a real plus is the pool and sun terrace after a sweaty day sightseeing - especially if you are with children. The reception desk staff varied tremendously - we had an unhelpful rather snotty woman one time and a really nice friendly man another... The room was lovely and the bathroom excellent. The biggest drawback is that it is very noisy - both the internal soundproofing between rooms and the noise from the road. However we would go back. The pool, although small, was great and I think the kids would have gone mad in Barcelona without a few hours there every afternoon and that's why I have given it 4 stars and not three.", "Date": "September 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "1.0", "Value": "5", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“Nice hotel but don't like the split levels”", "Author": "DEBORAH2004", "ReviewID": "UR79202706", "Content": "We were a group of travel agents visiting the city before boarding the Celebrity Cruise line ship for a Mediterranean cruise. The location of the hotel is excellent. It is modern and clean and the staff courteous and accommodating. However some rooms have two levels. The bathroom and closets are on the higher level and the bedroom is on the lower level. The six stairs are made of marble and are slippery. Everyone in our group had to leave the hallway lights on the all night for fear of slipping on those marble stairs. Every time one needs to change close or go to the bathroom it requires going up the stairs. Other than that the hotel is nice. I would recommend this hotel only with their regular on level rooms.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“I would stay here again!”", "Author": "kyle63", "ReviewID": "UR77545736", "Content": "Hotel is very clean. The staff is very helpful. I have always enjoyed the NH chain of hotels. The room was very clean and quiet,and the bed was comfortable also. I honestly cannot say any thing negative about this hotel. In my party there are two adults and two teen-agers and the NH Podium had a room able to accomidate all four of us. I would stay here again!", "Date": "August 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“Excellent hotel, perfect location & great value”", "Author": "SSKA", "ReviewID": "UR75022635", "Content": "This is an excellent hotel! Very modern and chic with spacious rooms all fully air conditioned. The roof top pool and bar is lovely and is great after a day walking round the city for a bit of R&R. The location is perfect it is a 10/15 minute walk from Plaza de Catalunya & La Rambla, round the corner from Arc de Triumph and 10/15 minute walk from Parc de la Ciutadella/Zoo. We booked on a website booking.com who gave very competitive prices and required no deposit or upfront payment. The only negative I would say about this hotel is the price of breakfast it is €19 per person for breakfast additional to your room rate which in our case for a family of 3 €57 for breakfast is ridiculous! There are lots of little cafes and tapas bars located around the hotel which serve lovely food and coffee for approx €15 TOTAL for a family of 3! There is a bar/restaurant opposite the hotel called Scorpion which is great, lovely food and excellent value. When you have spent a day walking around the bussling city and fancy a quiet dinner/drink within staggering distance this place is perfect! We will definitely return to this hotel if we re visit Barcelona!", "Date": "August 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Very nice hotel,clean and pleasant staff”", "Author": "fayzel_10", "ReviewID": "UR73122668", "Content": "Podium hotel was very nice hotel with roof top pool. This was lovely to have instead of the beach at times. Although it was difficult to get a sun lounger if you went mid afternoon.I would love to visit again but I would have to change 2 things. Firstly I would ask for a another level floor. The room was on the first floor based at the front of the hotel. This unfortunately proved to be very noisey outside, especially as the taxi drivers always gathered there speaking until early hours of the morning. And secondly the hotel mentioned complimentary tea and coffee, this was only available in the lounge area between 5.30am- 7.30am . So if your not an early riser you missed out. It was located in a good area and could easily walk to catalunya .", "Date": "July 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Great hotel, good location!”", "Author": "Lingaro", "ReviewID": "UR70666405", "Content": "I stayed here during the Worldcup Final at the weekend. The hotel is just 10 minutes walking distance away from Plaza Catalunya in a quiet street. The room was clean, modern, the staff friendly. On the rooftop there is a nice bar with swimmingpool.Free wifi in the lobby, 9 euros for 24 hours.I would definitely stay here again. F", "Date": "July 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cambridge, England", "Title": "“Great hotel, great location”", "Author": "Lips_10", "ReviewID": "UR66205625", "Content": "The hotel was in a great location, a 5 minute walk from the bus station, a 10 minute walk from La Rambla and a 15 minute walk from the marina and beach. It was located down a quiet side street away from heavy traffic and noise. The hotel itself was very clean and tidy. It had a roof top pool area with a sun terrace. The rooms were a nice size and were well eqipped. The rooms offered a safe at no extra cost. I would definately recommend this hotel.", "Date": "June 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "bristol", "Title": "“Great location and Hotel”", "Author": "bigpantsBristol", "ReviewID": "UR64111170", "Content": "Stayed here for 3 nights as a package for the Spanish Grand Prix- room very modern on two levels and bathroom great with all the usual shower gels/shampoo etc. Breakfast I thought was of a good choice although hubby abit fussy with his choice of food ,lots of fresh fruit, bread rolls and continental foods not much in the english breakfast range so for those that are not adventurous you might struggle for something to eat. Great location for dinner walk about 10 minutes and you are on the Las Ramblas street and numerous bars,cafes and restaurants. Overall great weekend only one snag the roof top pool bar service is not open until 1st June which was a shame as the weather was so nice whilst we were there and it would of been nice to have a drink and soak up the sunshine.", "Date": "May 14, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Rooms": "3", "Value": "3", "Location": "3"}, "AuthorLocation": "Switzerland", "Title": "“Just good, nothing to complain about.”", "Author": "Travel_Lover80", "ReviewID": "UR44356061", "Content": "My friend and I stayed for an entire week and really loved it. Staff was nice, not overly but we did not want to communicate with the staff but explore the city. Metro stations are just 5 minutes away from the hotel, and walking to the city center it's about 10 to 15 minutes. On the way you get to see Barcelona and its houses and street life. Way better than staying in the smack middle of it all. The pool was small but enough, after all it is a city vacation and not a swimming/sunbathing vacation (for that you are definitely in the wrong hotel). We went up to the pool to relax, and then enjoyed some drinks up on the roof which was amazing. Breakfast was perfect. It had everything you would expect being and dining in Spain. We were not disappointed and would definitely recommend it again. Not to single travelers because alone it is quite some walk but it was definitely a great hotel...clean, nice, quiet and still so close to everything.", "Date": "September 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Roseville, ca", "Title": "“Quite hotel close to city center”", "Author": "armjan", "ReviewID": "UR42015925", "Content": "We booked this hotel through priceline and for the price we paid it was better than expected. The room we got was pretty big for euro standards, very clean and made up daily. Roof top pool was great and clean. Wi-Fi was not free, but I used my mobile boingo account for my iPhone. Staff was nice and helpfull and all front desk employees spoke fluent English. The location was great, we walked almost everywhere. At night, if we were too tired to walk, taxi ride to the hotel from the center was less than 5 euros. Two things were little annoying. The quin bed was really 2 twins put together, and if that wasn't bad enough, they had wheels on them so the bed was all over the room. Second is the fact that you have to use your key to turn the lights and AC on. We were only given one key and every time we left the room, the AC was turned off and the room would get hot when we came back. Overall, we liked it and would probably come back.", "Date": "September 15, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Odense, Denmark", "Title": "“Great roof top pool, nice rooms”", "Author": "Rueskov", "ReviewID": "UR33895861", "Content": "Central location near metro. Big, clean and quiet rooms made up every day. Big flatscreen tv, minibar and a safety box (free to use) in room. Big bathroom with shampoo, vanity kit, soap etc. Ask for tooth brushes and tooth paste in reception if needed. Medium sized roof top pool great on a sunny day. Towels provieded on the terrace. Gym and sauna. Great breakfast with cereals, cava, really good cakes, eggs and bacon and juices. Aircon cools your room to 23 degrees Celcius (as far as I remember). Booked a weekend extender package: Stayed two nights in a double with a late check out Sunday (5 p.m. according to website but staff seemed a bit impatient when we hadn't checked out at 2 p.m. and asked if we were staying one more night) and a free minibar (not refilled on the second day but plenty of beer, soda and water, small bottles of gin, rum and whisky plus some crisps) at around 208 Euros (limited offer, check availability and conditions). Good deal.", "Date": "July 4, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "new york", "Title": "“Lovely, great value, decent location, but . . .”", "Author": "newyorkerwanderlust", "ReviewID": "UR31121695", "Content": "This is a nice, comfortable hotel that's in a decent location (I disagree with the previous poster -- it's near the Arc de Triomphe, which is reasonably safe. If you want to avoid loiterers stay out of any city). Rooms were very big and clean. The terrace pool clean and scenic. But it's not entirely up to snuff on service/amenities. No power adapters for foreign visitors. Breakfast isn't included -- which, for a hotel this nice is a little tacky. There's a temperature limit (around 70 degrees F) to which you can cool your ream (cheap and tacky). No business/computer center, which makes checking in on your flight, say, pretty tough. And the WiFi they offer is outrageously expensive (19 Euros a day? Seriously?). It's a nice hotel, and the staff was very nice to me. But it's just not a 4 star.", "Date": "May 29, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "3"}, "AuthorLocation": "new jersey", "Title": "“Rude, Obnoxious Staff That Tried To Cheat Us..Dont Stay Here!!”", "Author": "rsm06", "ReviewID": "UR30831355", "Content": "If you want to deal with RUDE, OBNOXIOUS Staff then you've found the place for you. Also, they don't believe in customer service here. If you find yourself having to stay here, my word of advice is be ready to talk back and fight with the staff as their obnoxious attitudes, roll of the eyes and desire to help anyone but themselves will definitely put a damper on your vacation. Also took a cab to this hotel at night and less than a block from the hotel there were homeless/druggies loitering. NOT SAFE to walk around this area at night.", "Date": "May 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“comfortable hotel at good location”", "Author": "rabby7", "ReviewID": "UR18907429", "Content": "I spent in NH Podium 2 weeks in July-August 2008. Hotel has a convenient location just 3 min from Arc de Triomf metro and 4 min from Urquiaona. My room (No 111) was spacious enough with a 6 steps stairs between a anteroom and a bedroom (see photo). It has a small balcony above the hotel entrance. The soundproof was not perfect, but the district is quiet. Breakfasts were included in my tour and I enjoyed them, elegantly served, with fresh fruits, meat (ham, bacon), cheese, milk, pastries, milk products, corn flakes etc. You can ask to prepare eggs, sausages or some other hot dishes. Of course, it’s rationally to save 18 euro a day and have a breakfast in several cafes around. A swimming pool (medium size), a solarium and a simple gym at the roof is available free of charge. Hotel has easy and quick check-in and check-out and friendly staff at the reception. Internet is rather expensive (10 euro per hour, 22 euro per day or 88 euro per week) and had problems with connection at weekend evenings. Or you can get free 15 min / day of internet at lobby.", "Date": "August 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Yorkshire", "Title": "“Really nice hotel”", "Author": "EMMLEE", "ReviewID": "UR18043507", "Content": "Really enjoyed this hotel it is well placed for amenities and a short walk to the metro etc. The bedroom was clean and spacious with a dressing area also. I shared a double room with two other people and there was plenty of space. The breakfast was varied with plenty of choice. The roof top pol was lovely and so was the sun lounges/ table and chairs. I never ate anything other then breakfast at the hotel though but it looked quite expensive. Overall highly recommend.", "Date": "July 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“best stay, more comfy and nicer then some 4*s out there in Europe”", "Author": "zakmillion", "ReviewID": "UR7716033", "Content": "i have stayed in so many hotels in my travels. and this humble rated hotel is absolutely the best and most comfortable place i have stayed in. highly recommended.", "Date": "May 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Helsinki", "Title": "“Nice hotel in a decent location”", "Author": "dondiegoHelsinki", "ReviewID": "UR7710957", "Content": "I stayed in the NH Podium a few weeks ago, and I am usually a very cautious person about hotels and prone to critique since I have worked in the hotel industry in 5* hotels for about 10 years and recently started working for a large multinational where I have to travel a lot. The location of the hotel is really good, about 10minutes walking to the El Corte Ingles department store, the Ramblas and a short metro ride from the exhibition areas of Montjuic and also Gran Via. It was about a 3 minute walk to the metro station, and Barcelona really has a nice metro network. You're never far from anything. Its not a luxury hotel, but a good upscale one with all the amenities. The room was quite big with a nice view of the front side and looking on pretty old buildings. They had a small but adequate gym and a roof toop pool area, although the water was quite cold in the pool. But the warm sun compensated for that. The breakfast was good and not too expensive, but I wished they had more different kinds of cheeses and more vegetarian options, but then again spain is big on meat. The staff was really nice and helpful, and did their best to help me out and delivered as promised. My only complaint is that the soundproofing is not that great, and you can hear your neighbours TV going on. But I hear from a friend of mine who used to stay in Barcelona quite a lot that the soundproofing is not that good all over Barcelona. So I would stay here again on business or if travelling alone, but my wife is a light sleeper so maybe not with her. Overall I recommend this hotel for business people and tourists alike as the price level was not too bad even if I was staying there during a large exhibition. Then again I booked quite early. But if you are one of those who wakes up with the slightest sound, choose some place else. Personally I liked it and would recommend it to my friends.", "Date": "May 29, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dallas, TX", "Title": "“Modern hotel, great for business or tourists”", "Author": "alissa024", "ReviewID": "UR7237866", "Content": "We stayed at this hotel at the expense of another NH hotel (Duc la Victoria) over booking. So we were lucky in the fact that our daily rate didn't change. This 4-star hotel is very sleek/modern, clean and comfortable. Not to mention its great shower and beds! The hotel is only a 10 min walk from Placa Catalunya and not even a 5 min walk to the closest metro (Uranquioa). We found taxis to be rather cheap so all in all location wasn't even an issue. There isn't much excitement going on around the hotel, i.e. restaurants or shopping, but it is well worth the stay for the luxury of the room (esp when luxury isn't a well-known commodity in Europe) I would recommend this hotel to anyone who can afford it!", "Date": "March 28, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Milan, Italy", "Title": "“Good hotel at a reasonable price”", "Author": "colbuck", "ReviewID": "UR5205651", "Content": "The Hotel is in a very quiet location, close to Arc de Triomph metro station (2 minutes walking). It takes about 10 minutes (or 2 metro stops) to reach Plaza de Catalunya. The neighbourhood seemed safe: we were 2 girls and walked back to the hotel at 11 p.m. without any problem. The lobby is very stylish and the room bigger than average. The bathroom offered a wide range of amenities (comb, toothpaste and brush etc...) And candies on the reception counter are irrestible! The pool on the roof is also worth the visit. I made the reservation via (--) as the NH website showed no availability for the date I had chosen.", "Date": "May 24, 2006"}], "HotelInfo": {"Name": "NH Podium", "HotelURL": "/ShowUserReviews-g187497-d206920-Reviews-NH_Podium-Barcelona_Catalonia.html", "Price": "$135 - $237*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Bailen 4-6</span>, <span class=\"locality\"><span property=\"v:postal-code\">08010</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "206920", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/48/ae/48aee324cbd2a187c96202d9f01a34658large.jpg"}}