{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Excellent location, good service and comfortable rooms”", "Author": "Dan T", "ReviewID": "UR128379210", "Content": "We had a three night stay at the Cristal Palace in December 2011. The staff were very helpful and friendly and rooms we spacious, clean and comfortable. The location of the hotel is excellent. Very central and with metro stations and bus stations in easy walking distance. Great place to stay in Barce!", "Date": "April 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Location": "5"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Don't be fooled”", "Author": "shrilka", "ReviewID": "UR127853208", "Content": "the first day when i arrived they gave me a terrible room that had a window to other wall, basically there was no window, the room was very very small, there was no air conditioner...in the morning i asked for new room and they game me without any problem new room, that was much much better!! much bigger, with the view to the street..so dont be hesitate to ASK for a nEW room on the day of your arriva cuz the rooms are really different from one another!!", "Date": "April 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Graz, Austria", "Title": "“Very good hotel for city trip”", "Author": "Igor U", "ReviewID": "UR127431491", "Content": "The hotel is situated in the heart of Eixample - the district of modernist architecture and the shopping area. Two Gaudi's buildings are nearby. The place of Catalunya is in 2 blocks. The rooms are spacious and comfortable, the wardrobe was big enough for comfortable week-long stay, but the heating system in the bathrooms didn't work in the whole hotel.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Moscow, Russia", "Title": "“Not too bad”", "Author": "Redpol", "ReviewID": "UR126383206", "Content": "This is an ok hotel in a good location, its between upper Rambla and Gracia, just above Cortes Catalanes. We did not take breakfast mainly because we prefer to enjoy local food, not hotel universal stuff to fill in your stomach. Becides, there is a wonderful bakery - cafe just 2 minutes away on the cross of Deputacio and Rambla, called Rambla 31 - wonderful fresh juices, sandviches, pastry and salads. We had breakfasts there all three mornings. As correctly noted by previous reviewers, the service at the hotel is quite poor. At check in they did not bother to mention that the safe needs a key (instead of usual digial lock) and that you have to come downstares to pick it up and return it on check out or you will be charged 20 euros for loosing it. They did not bother to ask if we need wifi passwords (which other hotels do not do too but after walking to get our safe key it was a bit too much). They were of no help with suggesting place to eat. Nor they bothered to help you with your laggage. And, hey, do not put your plastic hotel card near the phone - we had to come back down to reception to recharge them three times (could be more, if I had not asked the reception for the reason). And if you do care what you see out of the window please note that the opposite building is under construction. These were few downsides but since we did not spent much time at the hotel they did not bother us too much. However, I would not go there again. There are so many other hotels in the area.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“A good hotel, well placed”", "Author": "Gaby_stec", "ReviewID": "UR125488152", "Content": "A good 4* hotel, well located, close to the Ramblas, Casa Batlló and Casa Mila. Tourist Bus station at 100 m. Catalunya square is very close (here is the end line for Tourist Bus and the Airport Bus).", "Date": "March 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "MOSCOW", "Title": "“Good location”", "Author": "MoscowPavel", "ReviewID": "UR125077970", "Content": "It was our 1st expirience with Eurostars. Upon arrival, the person on Reception couldn't find our reservation. I had to open my laptop and showed the confirmation from the Hotel, but it didn't work out! We had to call another person to fix it - we got the same rate and same room. Room was good, but nothing special. We stayed on a 3d floor, but we felt a smell from the smoking 2d floor. The location was perfect to explore Barcelona by foot. We easily walked in an old city. We got a advise from consierge to have a lunch, but we've been disappointed about food and too much crowd. the soundproofing of the room was not so good - we could hear our neighbors. Parking was convinient, but expensive. We also had breakfast and found it average, even the selection was OK.", "Date": "February 23, 2012"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Staff tried to steal 115 euro from me.”", "Author": "DutchTravel9", "ReviewID": "UR124721026", "Content": "I stayed here in middle of November and paid on departure. Over six weeks later, by end of December, they took 115 euro of my credit card. After several emails from me, they refunded. However, they ignore my claims to compensate me for my time and efforts spent on this. It is clear to me that this not an error, but an attempt to steal money from me. Many people won't notice this on they credit card bill, and the worst that can happen to them is that they have to refund, so they just try. This is clearly fraud. They also ignore my questions. I should also mention that when I arrived in November, they tried to put me in a very small cheap room, while I had booked one of the most expensive rooms.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Best location , good service and clean”", "Author": "ananLAX", "ReviewID": "UR124016228", "Content": "we stayed in this hotel Feb 2011. The location of the hotel is excellent and perfect to explore barcelona. You can walk to most of the attractions like casa batlo, Casa Mila, La Rambha m passig de gracia etc., Taxi is cheap in barcelona we took taxi to sagrada around 6Euro familia and Gaudi park around 10Euro. There is a bus 50 near the hotel to espanya and poblo espanyol and very convienient. The service was very good, they booked tours for us to go outside of barcelona and gave suggestions for restaurants and what ever we needed. The rooms are very clean with reasonable size and looks exactly what you see in their web site photos and also reasonably priced.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great location”", "Author": "pstylist", "ReviewID": "UR123683545", "Content": "Just back from a stay in this hotel. Location was excellent but the personality of the staff left a lot to be desired! I found the male staff unwelcoming & they didn't seem at all interested to be there. There was a female staff member who was lovely & very helpful so the others could learn a lot from her. Overall, good stay, nothing amazing.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Piraeus, Greece", "Title": "“So and so...”", "Author": "Tatianna P", "ReviewID": "UR123681422", "Content": "We stayed three people and we were charged as triple room, but the room space was enough for two and not for three. However, the room was nice and clean. The bathroom was very good equipped. The price was high, but it was very close to rampla and to the center.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ft. Lauderdale", "Title": "“Excellant location, great experience”", "Author": "rmbt58", "ReviewID": "UR122592671", "Content": "This was a great hotel. huge bathroom, lovely room with a king sized bed, lots of closet space. We were just a short walk north of the Placa de Catalunya and very close to the Ramblas. Very close to the metro. We enjoyed the food at the hotel restaurant. Just an excellant location.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mas", "Title": "“Perfect stay”", "Author": "dan p", "ReviewID": "UR122406954", "Content": "The hotel is perfectly placed for the beach, the underground and the Gothic area. The staff was friendly and caring, they gave us many suggestions about what to do and where to eat. The room was clean, spacious and the bed more than comfortable. Very quiet and relaxing. Breakfast was delicious with a large variety to choose from. Me and my wife, we both enjoyed our stay very much.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Good location but not a good place to stay”", "Author": "Mike S", "ReviewID": "UR122033886", "Content": "We had an inside room and it was very small and only a fan. Very noisy and didn't clean room until 6 pm.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Stone, United Kingdom", "Title": "“Good location comfortable rooms”", "Author": "sparky_112358", "ReviewID": "UR121807139", "Content": "As a hotel for a business stay this fits the bill, bed was comfortable with enough room to work and breakfast was plentiful. The central location will appeal to all travellers.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Great location. Good breakfast. Tiny, HOT rooms.”", "Author": "N0Name1", "ReviewID": "UR121440496", "Content": "Great location one half block off the Ramblas in downtown Barcelona. Room rate was very competitive for this location, but the room was very small, and very HOT with no way to cool it off. This was in November, and it was very hard to sleep. There was one window which opened to a light shaft (a 3-meter by 3-meter open space that lead up to the roof) plus a tiny window in the bathroom that opened to the elevator shaft, but even leaving them open all day, the room was HOT HOT HOT. There was no AC available, and no fans at the front desk. In the summer, the AC might be activated, and the rooms could be cooled off, but I would not stay here again in the winter. The breakfast buffet was simple but good. The bed was comfortable. There is no clock in the room. This was a problem, as SpanAir had smashed my travel alarm INSIDE my luggage! The in-room internet was not working for a day or two, but eventually got fixed. As a backup, there was wireless available in the lobby, but with several users on it, it was so slow at times to be worthless. Did I mention the room was very small? It would be very cramped for two people, although the bathroom was big enough to have two sinks. The TV had limited selections in English, and even more limited in other languages. This is in contrast to another hotel I'd stayed at just previously, that had a good selection of channels in all major languages. What's great about Eurostars Cristal Palace is it's location and price (at least at the time I was there, in late November). The younger front desk staff was enthusiastic and helpful, and one young woman went out of her way to help me find a voltage adapter so I could plug in my shaver. (Unlike many European hotels, the Cristal Palace does not have a 110V outlet available in the bathroom.) The young man in the breakfast area, from Morocco, was very pleasant and personable.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "OC, Cailf", "Title": "“Great location”", "Author": "fijigirlprincess", "ReviewID": "UR119020995", "Content": "This hotel isn't \"luxurious\" but certainly is comfortable, clean, and in a perfect location. Quiet too since it's one block off the major cross street. Our room had two sinks in the bathroom and a desk so for a European hotel it was spacious. Beds were comfortable though could have used an extra pillow / quilt maybe.", "Date": "October 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Lincoln", "Title": "“Great location, would stay again!”", "Author": "tink1201", "ReviewID": "UR117048593", "Content": "Really good hotel, got it at a good price compared to some of the others that I looked it.The hotel was clean and modern. Lovely rooms with wooden floors and huge, clean bathrooms which were well equiped with shampoo, shower gel, hairdryer etc. Good location - easy walk to Placa de Catalunya and the top of the Ramblas. We walked all the way down to the port areat too, which is easily done. The aerobus to/from the airport arrives regularly into and out of Placa de Catalunya and cost 5 euros 20 one way. You can also get the tour buses from here. The hotel was in an area where I felt safe walking late at night, however, there are not many restuarants or bars near by, but you can eaily walk to some.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "2.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“maybe 1 star”", "Author": "or g", "ReviewID": "UR116902750", "Content": "the double room was small, air condition was not working, you have to bring your own shampoo the whole place is old and stale. the breakfast hardly tastey. we had to beg for a better room at least to have an air condition. the staff are not friendly they are aware of the status and are helpless. the only good point is the location. we will never go back to this hotel. 3 sleepless nigths.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "2.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Edmonton,Alberta,Canada", "Title": "“Average hotel with lack of service”", "Author": "Mina_trip", "ReviewID": "UR116358754", "Content": "It was an ok hotel. We checked in to 4th floor backside room first: no wifi coverage and awful view. We asked to change the room.New room was better: internet coverage and street view. We paid for Barca pack ( room with FC Barcelona stadium visit). They told us to go and buy our ticket and they will pay us back! we waited in the line up for an hour which could not be the case if they had the tickets ready for us. Not friendly staff, you have to ask three times for anything you need.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Excellent location”", "Author": "DolceVita08", "ReviewID": "UR115924125", "Content": "We stayed at Eurostars Cristal Palace in May 2011 as a pre-cruise hotel. The location was very central; right next to the upper part of La Rambla. Clean room, great continental buffet style breakfast with more than enough choices to satisfy all tastes. We were very happy about our stay here and would return again. Not far from Ciudad Mondal where we ate lunch...the best tapas in Barcelona right on La Rambla.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Lima, Peru", "Title": "“Adequate, but next time I would look for something better”", "Author": "SDBLima", "ReviewID": "UR115740593", "Content": "The location of the hotel is very good, between La Rambla and the Paseo de Gracia, which have a lot of restaurants and shopping. The hotel is very quiet, and the breakfasts are good. However, the room we had for my wife and I was very small, and the bathroom was older. Our children were in a slightly larger room next door but not adjoining. I think next time we will investigate further to find something a bit more modern and spacious. The hotel staff was helpful with the luggage and providing directions.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Great location, comfortable and pleasant”", "Author": "ohadisrael", "ReviewID": "UR115689238", "Content": "We were three friends from Israel, And although we've seen acts of anti-Semitism by Arabs who were there, Do not let it affect us. The location was just excellent, room clean and comfortable fifth. Breakfast a bit disappointed, we did not seventy, but we overcame that too. Overall would recommend to everyone.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "1"}, "AuthorLocation": "kildare", "Title": "“Only ok!”", "Author": "d-smyth", "ReviewID": "UR115589084", "Content": "Myself and my fiance stayed here 4 days after a week in Salou for a city break and sightseeing before going home. On check in found the staff very cool. Dont expect smiles or a welcome. The room was clean but very small and claustrophobic. It was ok for us but anyone with morebaggage would have found it a bit tight. The only window had no view unless call a wall two meters from it a view (cue claustrophobia). If this would bother you I would request a room with a terrace these appear to be roomier too! None of these things were a dealbreaker as we werent spending much time in the room with being out and about during the day. However the first day our room was cleaned when we got in at the end of the day the universal adapter we had (which I had left plugged into my hairdryer in the wall) was missing very frustrating as with phones to charge etc it was an essential item. Needless to say the staff were useless when asked about it and we never got to the bottom of where or why it was gone. The cleaner didnt speak any english and having talked to 3 different staff on reception we were fobbed off and made feel ridiculous! One thing that has to be said is if your a light sleeper be warned the walls are paper thin you can hear doors slamming, shower from other rooms, cleaners battering (yes BATTERING) the floors with the hoover first thing in the morning. I would be known to sleep through anything but even I found it a bit wearing and my partner who is a very light sleeper was getting frustrated by day 3!! That aside it has to be said otherwise the hotel was located perfectly a small walk to plaza catalunya and top of the ramblas, metro station very close too (worth getting a 4 day pass for 21 euros for unlimited trips on train and bus tram etc). Some lovely places to eat if you exit to the right of the hotel and cross the road heading for Catalunya station. However if you like your coffee's big go to starbucks most cafe's and bars serve very small cups where you get little more than a mouthful or two. There were two computers downstairs left of reception that were free to use internet which is helpful. Tea/coffee facilities would have been nice but again not a dealbreaker. Overall I wouldnt stay there again unless very short term. With the metro being so good and regular good hotels can be got for better value and comfort a little further out with little time to get in and out of the city.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "San Miguel de Allende, Mexico", "Title": "“Great Location, Small room, View of Light well From My Room”", "Author": "iltevere", "ReviewID": "UR115166338", "Content": "This hotel is very well located close to many attractions. My particular room had absolutely no view, and the bathroom was a bit humid. The room itself was small for the price. I was also very surprized that they did not provide irons, so I couldn't press my business shirt! It was just OK, but I think I'll try another place the next time I'm in town.", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Bra läge och helt ok hotell”", "Author": "SaladaVerde", "ReviewID": "UR113384918", "Content": "The hotel was in a perfect location, close to restaurants, shopping, turist attractions, public transportation and airport shuttle bus. Good sized room, very clean and with free internet was a plus. The hotel staff was friendly however it could do with a better guest relationship approach. Free internet throught the hotel, as well as a garage were available. Overall a very good hotel.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Great Location”", "Author": "Mary70124", "ReviewID": "UR113304655", "Content": "Great location! Small and quiet hotel with a friendly and helpful staff. Comfortable beds. Bathrooms could use a little updating.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellent in every way”", "Author": "KiwipomLondon", "ReviewID": "UR109195267", "Content": "Stayed here for a few days on a sightseeing visit. It promised peaceful 4-star quality accommodation in a good area, handy for the best that Barcelona has to offer the tourist. Though not cheap, it was good value, satisfying our every requirement (let's not nit-pick!). It's perfectly placed for a walking tour of Gaudi and other Modernista architecture, or up-market shopping along Gracia. Place de Catalunya is just a short walk away for transport links in all directions and the better end of Las Ramblas, if that's your thing. We didn't eat at the hotel, but the little cafe-bar straight across the street was great for breakfast, and if you fancy a really good tapas bar, you can't do better than the one on the same street, just the other side of Gracia, with the sunflowers outside. Get there early unless you want to wait ages for a table, or even a seat at the counter. There are plenty of other eateries nearby, especially if you want to pay a bit of a premium for pavement people-watching. If you particularly like stylish eating, though, make a point of treating yourself to lunch at La Font del Gat when you visit Montjuic. A most enjoyable 3-course meal with a drink for !3.20 euros is a steal, but you're definitely Scrooge if you don't pay a modest 10% extra for a table on the terrace with a parasol and friendly professional service in such a beautiful setting.", "Date": "May 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“great location but rooms a little tired”", "Author": "huddyPoyntonCheshire", "ReviewID": "UR107159786", "Content": "Hotel is in great position to explore the city. Rooms/bathrooms could do with refurbishing. Beds comfortable.Try for a room overlooking the rear courtyard as cool and quiet. Avoid adjoining rooms as you may be more involved in your nieghbours activities than you may wish. Super little cafe 1 minute across the room.Overall pleasant stay.", "Date": "May 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dartford, United Kingdom", "Title": "“Great hotel for a fabulous city”", "Author": "silverfox1973", "ReviewID": "UR101883226", "Content": "Had a lovely few days here recently, very pleasant hotel with excellent staff. Think it was their first experience with a reasonably small tour group (26) but they did very well. Hotel is well situated and convenient for sightseeing etc. ( Sally & Graham - if you ever get to read this, sorry we didn't get a chance to say goodbye, we lost you at the airport! Thankyou for your company during our trip)", "Date": "March 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Spain", "Title": "“Excellent hotel, Excellent location”", "Author": "worldtravellerSpain", "ReviewID": "UR100370579", "Content": "Excellent location, friendly staff, super nice beds, what more can you ask for", "Date": "March 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“A Pleasant Stay”", "Author": "HolidayTraveller6253", "ReviewID": "UR98570429", "Content": "we arrived late to the hotel (after 7pm) due to a unfortunate transportation debacle at the airport (hired charter Aero City didn't show up). Luckily the A1 bus was availabe for 5 euros and took us to within walking distance (5 mins) of our hotel. We were given a smoking room and when asked to be moved to non-smoking, hotel was very good to move our luggage and with no problems. We faced the front street but noise was minimal and didn't disturb our sleep. Location was excellent and we walked from the top of the Eixample shopping boutiques down to the harbour - very nice aquarium and history museum. Plenty of Tapas bars to try and I recommend the chocolate and churros treat.", "Date": "March 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice hotel and good value.”", "Author": "craggyislander", "ReviewID": "UR98241569", "Content": "Great location too-would stay here again. Just went for the room so can't comment on any of the food there but overall good value for money.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Netanya, Israel", "Title": "“A great hotel, prime location, 1st class hotel !”", "Author": "Arik2808", "ReviewID": "UR90706175", "Content": "Hotel located just 5-7 minutes, walking distance from Plaza Cataluna, near the Gracia, in a very cool area of the city. Hotel is very central, near the hotel there are many shops, tapas bars, pubs, a lot of restaurants etc. The room is very large, large bath rooms with hot tab ( in fact is a jakuzzi, but look like bath ). Hotel is clean. Nice staff and nice breakfast. The room can serve a couple for a romantic weekend etc.", "Date": "December 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Excellent Hotel very friendly, great location”", "Author": "concap09", "ReviewID": "UR85707726", "Content": "Due to a friends weeding we booked almost the whole hotel. All the staff was very friendly. The location is brilliant, only a short distance to the main shopping street and la rambla. The room was very spacious and the bathroom was clean and had everything we needed. I can only recommend this hotel. Thanks again", "Date": "November 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nicosia, Cyprus", "Title": "“VERY GOOD LOCATION”", "Author": "natasa2010", "ReviewID": "UR83444344", "Content": "Very good location in the center of the main city. Just off the main Avenue - Paseig de Gracia, and just 8 minutes walking from the Catalunya Plaza where the attractions starts (La Ramblas str., Gothic Area streets, Restaurants, coffee shops etc. and especially the main kiosks for the 'Tourisic Bus Tours'. The only negative thing is that the wall of the room is too thin..and you can hear 'next room' talkings, noises etc. Breakfast is OK nothing too special . The safe box in the room is chargable 5 euros/ cleaning is very OK and 'watch out ' to lock and put the sign outside your room door 'do not desturb'..otherwise they cleaning lady opens the door anythime!!!", "Date": "October 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kingsteignton, United Kingdom", "Title": "“GOOD POINTS BAD POINTS”", "Author": "devonroamer", "ReviewID": "UR78812922", "Content": "After having stayed a few days at this hotel I am surprised by some of the comments and the crudity. The hotel was very clean, spotless rooms and a fantastic bed. The breakfast was large with plenty of hot and cold choices. Great bed, rotten view of a shaft, but hey ho, you are not meant to be in the room all day, are you? The air conditioning in the hotel broke down and the public rooms were oppressive but once this is fixed I am sure it will be OK. Good position near the Ramblas and the Gaudi house. All in all, a typical city centre hotel catering for coach parties, business and long weekends.", "Date": "September 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“fantastic room, fantastic location”", "Author": "miranda60", "ReviewID": "UR65879651", "Content": "The location is fantastic not too far from The Ramblas but still in a quiet location. I went may bank holiday weekend so was busy i was only a 5min walk from the Ramblas and i did not hear any noise. My room was on the ninth floor with a balconey and was fantastic. The room decor was black and white with LCD tv, air con,mini bar and balconey with table and chairs. The staff during the day was very freindly, but at night seemed a bit miserable, but did not effect us. I would go back to this hotel.", "Date": "May 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Newport Beach, CA", "Title": "“Great Location”", "Author": "So-Cal-Girl-9", "ReviewID": "UR64348110", "Content": "This hotel is in a great location. It is close to everything, but not quite in the Gothic area which can be a little scary. I stayed here with a girlfriend and we both felt safe walking around this area at 2am. We can't say the same for the Gothic area. One night we took a wrong turn in that area & soon were running into some scary looking men trying to sell us cans of beer! If your rate includes the breakfast buffet, that is nice as there are not a lot of breakfast options nearby.The room was a bit small, but it is Spain! The bathroom was large for Europe standards & everything was very clean & new. Overall, I would stay here again & recommend it to my friends & family.", "Date": "May 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Great location - tired 4 stars”", "Author": "GalwayKilkennyDuo", "ReviewID": "UR64148392", "Content": "This hotel is in a fantastic location, 5 minute walk to Place Catalunya and just around the corner from the quiter Ramblas Catalunya with lovely tapas bars, restaurants and shops. The staff were very nice and helpful and it was great to be able to leave our luggage when we checked out as our flight was a late evening one. The bed was very comfortable and the bathroom was a good size/ We found the hotel very quiet but it was only on the last morning that we realised that the rooms next to us had been empty for the 3 nights we stayed as we could hear everything they said. The hallways were very 1970s and a lick of paint and new carpet would make all the difference but the rooms were stylish with good fittings and flat screen TV etc. We didn't dine there as we had a room only rate of 100 per night (booking.com), breakfast was 18 euro per head so we headed to the locals cafes on the Rambla Catalunya across from the hotel. Would stay again", "Date": "May 14, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Good location”", "Author": "DublinMurray", "ReviewID": "UR63326022", "Content": "The room we had was very nice. But having roomcleaning at 6.30 pm knocking at the door after a long day sight seeing is not on. The staff were not very friendly. They should be delighted to see tourists in the hotel. When we asked where the 50 bus stop was we were informed that the number 50 did not service the area. Our tour guide had told us it did. Anyway we found it ourselves. (Just a little thing but annoying).", "Date": "May 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Super Location”", "Author": "João P", "ReviewID": "UR56221351", "Content": "The location of the Hotel is great. Hotel in general very nice. Staff could be more friendly (exception to restaurant staff very nice and friendly). It was a good stay. The hotel doesn't have pool or health club.", "Date": "February 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Porto, Portugal", "Title": "“Great center hotel!”", "Author": "Power_guido", "ReviewID": "UR54859905", "Content": "Great hotel, in the center of the \"action\", near ramblas and Plaza Catalunya. The room was superb, with a great design, a king size bed ( one of the best where i´ve sleep ), and the bath was huge and extremely clean. The staff was professional and nice. The breakfast was good but expensive. If you can, you should reserve bed and breakfast. The hotel also have a luggage room, very usefull so you dont have to carry your luggage after check out. It´s a regular 4 stars hotel, were you pay what you get. Will comeback for shure!", "Date": "January 31, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Vienna, Austria", "Title": "“Good for 2 nights, not longer.”", "Author": "alechjo", "ReviewID": "UR53619437", "Content": "There are basically 2 good things and a lot of bad things to say about this hotel. Let's start with the good things: - The hotel is very close to Placa de Catalunya, which is the main hub in Barcelona. When arriving at Barcelona Airport, just take the Aerobus directly to Placa de Catalunya. - There is also free Wifi available in the hotel rooms. But: - We had a room directly behind the elevator and every time the elevator is moving you hear it through the thin walls. This can be very annoying. - Our standard room was very small. There was not even enough space to put a second suitcase. The bed was only queen size. - Small was also the bathtub. On the one hand, the bathtub was equiped with massage jet streams, but the tub is so small it is only useful for kids. - There is no way to control the room temperature. Only the fan speed is controlable. - Breakfast is quite expensive, I would recommend to buy breakfast somewhere else. To conclude, I would recommend this hotel only for the weekend (one or two nights), but definitely not longer than 2 nights. All in all, this hotel seems more like a good 3-star hotel than a 4-star hotel.", "Date": "January 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "liverpool", "Title": "“rock n roll....”", "Author": "hartage", "ReviewID": "UR42434349", "Content": "nice place, good staff, get room 904 with the balcony.", "Date": "September 17, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Toronto", "Title": "“A good choice for €59 - €79/night not a penny more, and bring own soap, washcloth, and tissues....”", "Author": "Bywalec", "ReviewID": "UR39651907", "Content": "Have been to Barcelona a few times already, both on business and for leisure so the scene is not new to us. Due to a medical conference in town, finding a hotel with available rooms was a bit of a chore, however with the help of the internet, we were able to find the Eurostars Cristal Palace just two weeks before arrival. Shocked by the rate (€450/night), we hoped for a luxo-wannabe hotel (like the Crown Plaza) and the location was definitely good. We had stayed at the Eurostars in Leon (which we liked a lot and found to be a good value for money). We expected a welcome jug of water with fresh mint in it upon arrival, a traditional welcome. Well, not so fast...this is the metropolis of Barcelona and they have their “dignity” here and this gets in the way of customer service sometimes.... We really should have felt lucky that our rate was only €450, given that the “regular rate” posted at the front desk: €800/night!! A quick check of the real life going rates for this property revealed an average rate of €89 in the summer and €115 during the fall. So our rate was 5 times the going rate and this was without breakfast. We “shamed” the manager into throwing in breakfast (€12 value) for nothing. This was about OK for the price – (prefab scrambled egg-like substance), but overall edible stuff. The room was reasonable size and freezing cold (AC was either on full or off – hot and sticky). Cheap laminate paneled floor thudded terribly, but was clean. The beds were reasonably comfortable and no bed bugs (on Googling the hotel, one reviewer complained of “Una habitación con chinches). The bath tub was so narrow that a 120 lbs woman would not extricate herself out of it after a bath, but again, clean. The all in one – shampoo, body gel and Holy Water was all we got with the tub, not even washcloths. One square inch by ¼ thick of clear blue soap (pretty color) and new soap only once the original bar has well worn down. Don’t ask for any tissues either! Toilet paper? Yes! Tissues? No! There was a bidet however, a welcome luxury in this hot climate. The Wi-Fi internet did not work the entire time and the manager insisted that it was my computer’s fault (same one that was connected to Wi-Fi just a few hours ago in UK). The crowd of people with their laptops in hand waiting to plug in to the one available Ethernet cable in the lobby nook (“business centre”) proved otherwise. We were dazzled though, by the midsized flat screen TV and ample wall outlets for computers, handy chargers etc. All in all we were disappointed that this budget business hotel managed to charge like the LeGrand in Paris and deliver like a Holiday Inn Express in an industrial area somewhere in Europe. We learned our lesson though; - the Catalans have taken the art of rip off to new heights for the hospitality industry!", "Date": "September 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "City Hopping", "Title": "“Excellent choice, fab location for a sightseeing trip to Barcelona!!”", "Author": "FunTraveler093", "ReviewID": "UR38840666", "Content": "This hotel is an EXCELLENT choice for a trip to Barcelona! It is conveniently located near the Passeig del Gracia and the Place de la Catalunya...with lots of restaurant choices nearby. I found that we were far enough away from Las Ramblas for it to be clean and comfortable. Busy during the day, but not too loud at night. Anything and everything you need to access in Barcelona is convenient, whether by walking or by metro (stop is just a block away). Our room was fairly large, with a nice big closet, hardwood floors, and a much better deal than some of the other hotels nearby. We had a beautiful street view with floor-to-ceiling windows, a large, really comfortable bed, minibar and beautiful marble bathroom. It was also really clean. We were thrilled to not have to lug our computers along. If you don't want to pay for wireless in your room, there is free wireless on two computers in the lobby. But those can be busy during peak hours, but were usually free in the evenings. The only downsides (and none are too serious): There is no in-room control of temperature, just a fan system with low-med-high choices, so it can get a little hot, particularly in the morning with the sun beating in. But we were there during a heat wave and it was just a tad uncomfortable, but not unmanageable. The only toiletry provided in the bathroom is body wash (no lotion, shampoo or conditioner). And, if you don't order the breakfast in advance with your reservation, you can't add it the morning of-- no matter, though, because there are plenty of places to grab breakfast nearby! (Word to the wise: don't stay far away from the center of Barcelona if you can stay here! It's worth the extra few bucks to be close to the \"happenings.\") But those are all small complaints... I would definitely, definitely stay there again...location, quality-for-price is unbeatable!", "Date": "August 26, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Sofia", "Title": "“Good hotel, great location, but very slow housekeeprs”", "Author": "irenapSofia", "ReviewID": "UR38671783", "Content": "The hotel has absolutely perfect location, near to the heart of Barcelona, placa Catalonia and all the transport services. Although being in the center of the city, it is not noisy and it is ok to open your windows. The breakfast is great, rich and has everything for every taste. It is clean, BUT the big BUT are the housekeepers. We were leaving the room around 9.30 a.m and coming back around 2.30 p.m and for all that time they could not clean our room. And between 2 p.m and 4 p.m when it is normal to rest in your room and take a bath they were starting to shout on the corridors and to knock on the doors. Even one day we had to leave our room for half an hour and wait in the lobby, so that they could clean. This was the most annoying thing for me. I have never seen such a slow housekeeping For sure the hotel does not deserve 4 stars, it is a normal 3 star hotel in my opinion. And if I am again in Barcelona, I have nothing against using them again. (except housekeepers)", "Date": "August 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Derwood, Maryland", "Title": "“Clean, comfortable, good location.”", "Author": "happy35i", "ReviewID": "UR35206878", "Content": "Room: Housekeeping did a good job as we returned to a room that was consistently clean and supplies replenished every night; flat screen TV; Internet access from room; perhaps because we went in the spring season, but they had no AC (thankfully, the weather was perfect and we kept the windows open) Front desk staff: definitely not the most cordial I've met; didn't address our A/C issue Location: walking distance to the underground metro station; close proximity to shopping and dining; safe", "Date": "July 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "athens", "Title": "“Clean rooms but hot!”", "Author": "giokab", "ReviewID": "UR28626098", "Content": "We stayed in the hotel on our trip to Barcelona..The rooms were exactly the same with the pictures of the official site and all the rooms were very clean!But not everything was perfect..For instanse,the air condition didnt work..with result the room being extremely hot.So we had to open the windows to make the atmosphere cooler!But then,wierd and annoying sounds were heard..Also the rooms view was the abatjour..Not such a great view for a room who costed us 150$!And when we asked the person in charge of the hotel he gnored us and the problem remained unsolved!", "Date": "April 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Oradea", "Title": "“excelent location, good services”", "Author": "Oradea-mary", "ReviewID": "UR28482351", "Content": "we stayed four nights in a room with 3 beds, breakfast included (excelent breakfast - bufet, coffee, fresh juice, tea, milk, hot food, cold plates, fruits a.s.o.). room was ok, average size, bathroom clean with toiletry, but the towels were worn out (they were white originaly, but they did not look clean, as they were greyish). bedsheats were also not too white. the hotel has an excelent location, two blocks from Gracia road, 4 minutes to Plaza Catalunya and Rambla. Near hotel, on Gracia avenue is the stop for Aerobus (A1) to airport, coming till late in the evening, every 5-6 minutes, cheap (4,50 euro). We arrived late in the evening, took a taxi from the airport. There was a long queque for taxis but it went quickly, and till hotel costs 25 euro (with one big luggage). for lunch you can eat good menues, at any restaurant where you see \"Tourist menu\", costs between 10,50-12 euros (starter, main course, desert, a glass of drink). I suggest to take the \"Barcelona Bus Turistik\" hop on hop off busses for sightseeing, it costs 21 euro for one day (from morning till evening). It has 20 stops at the main attractions. you can hop off, visit, then take another one. they are coming every 5-7 minutes. (There is another firm operating busses with the same system, but different name, but this is the best one). When you board the bus you get earplugs (different languages, for the explanations), a map of the stations, and a little book with different coupons you can use as reduction at entrence-fee at different attractions ! use them, as entrence fees are quite high ! Do not miss to visit the Palace of Catalunyan Music, guided tours every hour ! And if you want a cruise on the sea, take a Golondrinas (in front of the Columb statue), but not for 35 min but for 1 hour and a half ! worth! Casa Batlo worth visiting in the morning , when there are not so many people there (3 minutes from the hotel). Enjoy Barcelona !", "Date": "April 21, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Newcastle Upon Tyne", "Title": "“Perfect Location BUT grumpy staff!”", "Author": "KRoNewcastleUponTyne", "ReviewID": "UR27557712", "Content": "Stayed here over last weekend with friends. We had booked a triple room and stipulated three separate beds. This was confirmed by the hotel manager, Mr. Antoni, before arrival. However as soon as we arrived they tried to give us a double and a single! They did not apologise but finally relented that there had been a mix up and after much tapping of the computer and gabbling in Spanish managed to find us a room with 3 beds in it. The rooms are a decent size with super comfy beds and pillows. They are clean with a good size bathroom. The best bit is the location. It is just up from Catalunya Square and very close to Ramblas and super restaurants and shops. Just one other little niggle though. The rooms are extremely hot. There is no ventilation at all bar opening a window which isn't ideal on a busy central street. Once again when we asked about ventilation we were fobbed off by a grumpy manager who told us that there was no need for air con as outside night temperatures didn't warrant it. Think they need to go back to the drawing board on customer relationships and the odd smile wouldn't go a - miss either!!", "Date": "April 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Nice Room,Good Location”", "Author": "Rathcoole24", "ReviewID": "UR23248241", "Content": "Great loaction 2 blocks from Plaza Catalunya so perfect for sight seeing if you want to be near everything but dont want to stay around the noisy Las Ramblas.Airport bus €4 one way and stops at the end of the road (get off at the stop after Plaza Catalunya) The rate we got included breakfast which was served till 11am. The hotel was fine for a weekend break, would consider this hotel a good 3* then a 4*.", "Date": "January 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“good location, good rooms, nice personnel”", "Author": "superged", "ReviewID": "UR19013979", "Content": "we had booked a double, which was changed to a triple the day before our arrival (located next door to the hotel main entrance). very friendly staff, excellent room (soundproof, good size, perfect bathroom). the location, close to the Gaudi houses and to the metro access, is perfect.", "Date": "August 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dundee, Angus", "Title": "“Location, Location, Location!”", "Author": "Thebairds", "ReviewID": "UR17347060", "Content": "2nd visit to this hotel and once again an enjoyable stay. No its not a \"palace\" but its not a dive either. It is.....a busy, clean, extremely well located city centre hotel (which means the views are of other city buildings ! duh!) with friendly and helpful staff. This is an excellent base for anyone contemplating sightseeing in Barcelona...just off the Passeig de Gracia, about two blocks up from Plaza Catalunya. You can take the bus from the airport and walk up from the square or take the train and walk down a couple of blocks to the hotel. The train station on Passaig de Gracia links you to the main train station at Sants and is so convenient for visits to Girona, Madrid or even Parc Adventura (1hr 20mins). Be warned though if you want to go anywhere via the AVE fast train you must book in advance as they are extremely busy. Plenty of restaurants and tapas bars around the hotel and the shopping of passaig de Gracia 2 minutes away! Our air conditioning worked perfectly well...often too well and we had to turn it down! Room was cleaned dailly with a change of towels and bedlinen. Staff at reception were helpful as were those we had contact with at the bar. Can't comment on the food as we did not eat in the hotel...to many choices outwith! 5 mins walk to Ramblas, Gothic quarter and Bus Turistica Tour main stop in Plaza Catalunya. Basically this is a very well run tourist class hotel which could not be better situated if it tried. Why do people want 5 stars facilities etc for a 3 star price???", "Date": "June 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Forest, UK", "Title": "“Good location, hotel very average”", "Author": "Sharkswimmer", "ReviewID": "UR14705493", "Content": "My wife and I just returned two days ago from a 4 night stay. We chose Barcelona for a short break because of very cheap Ryanair flights from Bournemouth, near where we live, and not having been to Barcelona before, we thought we should give it a try. Hotel first: Functional, clean, comfortable. Our room 204 on 2nd floor, overlooking street, bit noisy but what do you expect from a city hotel. Staff were always there and seemed to be doing their job well enough, I don't always expect bright, smiley faces, simple courtesy is good enough. Did not use the bar, never seemed that busy. Did not eat at the hotel either so, as you can gather, our requirements were for a hotel in a good location with a clean & comfortable room in which everything worked. We got that, although we do have a couple of gripes about the hotel. The walls are very thin. The couple next door were clearly (and in the lady's case very audibly) enjoying a romantic getaway (good for them) I just wish I hadn't heard it all. Also, on Thursday afternoon we heard a street protest and looked out of the window to find there were about 40 or 50 protesters with banners and leaflets, loudspeakers etc, protesting against the hotel! No idea why, so we went out and when we came back it was all over, my wife asked at reception if it was likely to happen the next day, and reception said in matter of fact fashion \"Oh no, it only happens on Thursdays\" - what's that all about? The real advantage of the hotel is the location - just north of the gothic quarter in the upmarket shopping and commercial district. A brisk 20 minute walk to the port, 5 minutes to the Placa Cataluyna, 10 minutes into the gothic area, and 15 minutes in pretty well any direction, safe streets, nice shops and some decent eateries, with close walkable access to some of Gaudi's finest to the north and north east. If you're still with me, our views of Barcelona: Big, noisy, with too much traffic (even La Ramblas has two way traffic with a pedestrianised main thoroughfare right down the middle, frankly a little tacky, don't really get what all the fuss is about), generally more expensive than we expected, overall not hugely impressed with Barcelona. Simple tapas lunch for two near the Picasso museum in guide recommended eatery, with two tiny glasses of house wine each, with coffee, 40 euros, not great either. Good steak dinner for two with bottle wine & coffee, 90 euros (try Viento del Plato, imported Argentinian aged steaks). Gothic quarter is quaint enough with its alleys and squares, but no more so than many southern European historic centres. North of the gothic quarter is laid out in a block pattern, USA style, with wide avenues and streets, designer shops, a few bars, restauarnts, business etc, where the hotel is. Sagreda La Familia is basically just a construction site inside, don't pay to go in, see it for free from the outside. Tip for tour bus users, don't go for the big orange route (as we did), instead go for the red & blue bus routes which are more flexible and you are more likely therefore to use. Both are about 25 Euros for two days, hop on and hop off. We won't rush back to Barcelona, anywhere in Italy is better, but if we do find oursleves there again, Cristal Palace would be a reasonable base.", "Date": "April 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "cliffside park, nj", "Title": "“excellent location”", "Author": "ldjs", "ReviewID": "UR14604281", "Content": "Just returned from 6 nights/5 day stay. Excellent location, close to everything, but on a quiet street in an uspcale district. The rooms are very small and extremely hot-had to sleep with open windows in March and heard many complaints about heat from other guests in the hotel as well. The beds are very firm, however the size of room and the hard beds are not unusual for hotels in Europe. The hotel was very clean, bathroom in our room 605 was modern and spotless, the towels were changed daily. The front door staff was not too friendly, but professional and helpful with tour and show reservations. Complementary use of computers is a benefit, make sure to request to print the boarding passes if you wish to do so, since there is no printer generally, but exceptions are made for boarding passes. We did not eat at the hotel, but the bar was pleasant enough after day of sightseeing. Overall, hotel is functional and clean, but at best 3 star. Would recommend for travelers who plan on sightseeing and spending littel time inside if you can get a good deal. Once again, location is amazing.", "Date": "March 28, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "3.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "long island, ny", "Title": "“Honeymoon Gift”", "Author": "tripster74", "ReviewID": "UR13692128", "Content": "It was on our Honeymoon that we got to visit this hotel. Usually, when we travel we stay at the Marriott. It provides the standards we're accustomed to. Clean, soft beds, great service & modern conveniences. Our stay at the Eurostars was a wedding gift so we didn't have a choice. We did check the reviews and a lot is right. The location is convenient without being too much in the middle of it all. And since we stayed slightly off the beaten path, we got to see more of Barcelona for it. I have heard about the standards of some of the hotels in Europe; small rooms, small beds & thin walls. So when we got there, we were grateful we had a large bed. The room however was on the small side. The bed was as hard as a rock and had a wire sticking out of it, a spring perhaps. We noticed it was actually two twin beds pushed together as opposed to the king size it was disguised as. This made getting over jet-lag that much more difficult. The people at the front desk were not very nice unless we spoke spanish and even then they always made me feel like I was bothering them. Although it seemed like a nice hotel from the outside looking in, I do have higher standards and found this one to be subpar. Then again, I've never stayed at another hotel in Europe, but next time I am definitely choosing a Marriott if just for a good night's sleep. After all, that's what hotels are for.", "Date": "February 19, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Excellent Location!!”", "Author": "gemmyjam", "ReviewID": "UR12583576", "Content": "Originally we'd plan to stay at a different hotel in the Gothic Quarter however after doing a bit of looking around we got a good deal at the Cristal Palace. The location was fantastic right in the L'Eixample area of the city & a two minute walk from the Passeig de Gracia where both the aeroport bus stops along with both the tourist bus companies. It was literally around the corner from the famous Casa Batilo & close to Placa de Catalunya. The only downfall to the location was that the L'Eixample area seemed to be one of the expensive areas for food & it was sometimes difficult to find breakfast (unless you ate at the hotel) The hotel itself was of a very high standard with an impressive lobby & the rooms were very clean & nice. We arrived at midnight & the reception staff were very helpful we were given a twin room & when we explained that we had booked a double they were happy to move us however it would be the following day & the staff were happy to move our luggage when we did move. The odd thing was that there was no kettle in the room but coffee & cups so if you wanted a morning cup of coffee you had to go out into the hallway & use the fancy coffee machine. Overall the hotel was great & you couldn't fault it so If you want a great location with a clean & friendly hotel then i would recommend the Eurostars Cristal Palace.", "Date": "January 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Good location for exploring the city”", "Author": "Cardiff2", "ReviewID": "UR10610886", "Content": "We made a last-minute booking for this hotel and we weren't disappointed. We were given an apartment in the building next door to the main hotel, and it was very clean and spacious, with a nice lounge. It was reasonably priced, compared with others in the city. The hotel is a few minutes walk from the hurly burly of Las Ramblas, and in a slightly quieter location than many others. It's also very near to the bus station at Placa Catalunya. There was no city view - only a panorama of the workmen refurbishing the building opposite - not that we minded. They seemed to read newspapers a lot... As we weren't in the main hotel we chose not to use any of its facilities, and so can't comment on them. The staff seemed very competent and pleasant. Unfortunately, the hotel has the skinflint policy of charging for a safety deposit key (admittedly very small, though). That's just a trivial pet hate. The location was fine for walking to all the usual attractions - such as the Sagrada Familia and the Gothic District. In the L'Eixample district behind the hotel are a few coffee shops and bars which are ideal for breakfasts and snacks. We had a late departure and thought about extending check-out for a few hours. The price was 80 Euros, so we declined. In summary: we had a comfortable stay in a good quality room. We don't know what the main hotel rooms are like, but the apartments were fine. We'd definitely recommend them.", "Date": "November 5, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Leiden, The Netherlands", "Title": "“Excellent location”", "Author": "baron1953", "ReviewID": "UR10589822", "Content": "This 4 star hotel is exactly on its 4 star mark. The quality, cleanliness and amenities of the rooms and public area's are just as they should be. The rooms are slightly smaller than expected, but that is more often the case in European city hotels. The view is frontside into the busy and noisy city. At the backside it is quiet! Breakfast is good but not outrageous. Bread was consistently not well baked at all. All efforts were made to keep up with the stream. The hotel location is great, close to Plaza Catalunya and one block from the famous Gaudi designed Casa Battló. Taxi rate with two suitcases from the airport was €28, and just €21 to the airport.", "Date": "November 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Great Location, Nice Staff”", "Author": "ocarrollm", "ReviewID": "UR8706255", "Content": "This is a perfect hotel for a weekend in Barcelona. Really good location and you won't need to use public transport or taxis at all unless you are heading out of the city eg airport or Nou Camp. The rooms are nothing special but are clean and comfortable. The reatuarant and bar in the hotel aren't really up to much but there's lot's about. I've returned here about three times already and have no compliants. The staff are really friendly and make an effort to be nice!", "Date": "September 13, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "manchester", "Title": "“great location - to overpriced”", "Author": "luckyleelee", "ReviewID": "UR8422269", "Content": "Boyfriend & I have just returned from a weekend stay at Cristal Palace. We booked this hotel after reading reviews on tripadvisor. The main thing we wanted was location. This was exactly what had been reported on here and was correct. It was excellent for walking about. The hotel we felt was very basic for the price we paid, far too expensive. I had requested a room on a low floor which was taken note of. The room was small, with twin beds pushed together instead of a double. Apart from the bin having the previous guests rubbish in it was very clean. I told the maid about the bin not being emptied and she cleaned it immediately. The staff spoke a little english but were helpful when I asked for directions and about the airport bus. The only main problem was the saturday I could not sleep because of the noise from the road and the traffic outside. Sunday night was quieter. We would reccommend this hotel for location but not for value for money. Thank you for the people who advised on here about the bus touristic which was excellent the best way to get around. My boyfriend was very disappointed because we went to the barcelona football stadium and it was closed for the tour. We went at 4pm on sunday but it closed at 2.30 that day. The cable cars were very good with a wonderful view. Apart from not seeing the stadium we had a lovely time. Also thank you to the person who suggested fresh & ready bakery they sell the best ham and cheese croissants i have ever had. Other advise I give is watch your bags and pockets at all time. We went prepared for pickpockets and avoided a scam because we had read about it. A lovely romantic weekend with lovely memories we will cherish.", "Date": "August 14, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Orlando", "Title": "“Enjoyable stay at the Cristal Palace”", "Author": "twopul", "ReviewID": "UR7818590", "Content": "6 of us booked 2 rooms before and after a cruise that left from Barcelona. I made the reservations through the hotel website and experienced no problems. The hotel staff was polite. and courteous. Check-in was efficient and we were quickly escorted to our rooms. The rooms are average in size but comfortably fit 3 of us in each room with the help of a rollaway bed. The rooms were clean and quiet. The breakfast buffet had several selections from dry cereal to eggs. The front desk staff was helpful at directing us to several good area restaurants. The Hotel is centrally located in the city with an easy walk to Las Rambles, Placa de Catalunya, and the Bus Turistic stops. There are plenty of nice restaurants and bars in the area. On the day of our departure we had an early Sunday morning flight. We requested 2 taxis for the six of us at 5:30 in the morning. They were waiting for us when we checked out.", "Date": "June 9, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Kent", "Title": "“Excellent Hotel in a great location”", "Author": "JanineTaylor37", "ReviewID": "UR7476101", "Content": "We stayed in this hotel for 3 nights celebrating our 10 yr anniversay. The hotel was in an excellent location and was close to many of the main attractions. The bus stop and metro station are minutes away and its very easy to find. The hotel staff were very friendly and we was given a warm welcome, our room was very large with a lovely bathroom and jacuzi bath and was very quiet. Breakfast was a buffet and was very nice with a large variety of food that would suite any taste- again the staff were very friendly and the service brilliant as they were constantly refilling things when they were getting empty, it was very good that it was until 10.30am. It was very handy to have computers that were free to use to guests staying in the hotel. I would highly recommed this hotel to anyone who is going to Barcelona and it made our stay a very memorable one.", "Date": "April 27, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "ibiza", "Title": "“well situated”", "Author": "paulaIbiza", "ReviewID": "UR7259065", "Content": "Stayed for 2 nights in the cristal palace. .great room very friendly and helpfull staff. This hotel is well situated for all major attractions of barcelona its close to bus routes and metro. all which make getting around the city easy and fast. would highly recommend this hotel .We didnt use the restaurant at all but the menu looked really nice and well priced. We will definatley stay here again.", "Date": "March 31, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "leeds, uk", "Title": "“Four Star????”", "Author": "phw76", "ReviewID": "UR7253927", "Content": "I really would not recommend this hotel. It has a good location only a short stroll from main attractions. However, the rooms are tiny with very poor amenities. We had several problems with the room. The staff were unhelpful and none of our problems were addressed. Compared to other 4 stars this hotel is seriously below par and i think other hotels in the area would offer better value for money.", "Date": "March 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cardiff,Wales", "Title": "“Outstanding Location”", "Author": "CityhopperCardiff", "ReviewID": "UR7246330", "Content": "This hotel must have one of the best locations for the centre of Barcelona, not only is it only a ten minute walk to the fantastic Ramblas with there great street entertainers and bars and resteraunts the hotel is down a side street ensuring that it is quite at night. Staff are very friendly and accomodating and the hotel rooms are large and clean with marble floors and feel more of an apartment than a city centre hotel. Overall an excellent visit and the choice of this hotel was the icing on the cake", "Date": "March 29, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "london", "Title": "“Stay somewhere else”", "Author": "CheesygrinLondon", "ReviewID": "UR7179119", "Content": "Yes well thankfully we didnt spend too much time in the box room next to the waste water/toilet pipe which you could hear....not very nice.....there was a window but very dark and rather dire... Good location i suppose but on the whole not too special....avoid", "Date": "March 17, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Bradford, West Yorkshire", "Title": "“Great 50th weekend!”", "Author": "CazBradford", "ReviewID": "UR6894503", "Content": "We stayed in Barcelona for 4 nights in January 2007 and would highly recommend the Crystal Palace. The staff were very helpful, the hotel was clean and well cared for, recently refurbished, and the rooms were ample in size and a great location for the underground system, tourist bus and La Ramblas. Some minor niggles about the hotel were that the room was so warm that you needed the window open all night, which was OK as there wasn't any significant street noise. If you like hot food for breakfast then there wasn't a great choice - frankfurter sausage, fatty bacon, sloppy scrambled eggs and half tomatoes with a bit of cheese on, however there were ample cereals; cakes; fruit; croissants; yoghurts etc. which more then made up for the poor hot food choices. Don't expect a great view if you have a room at the back of the hotel as 1st-8th floors look onto the back of a building. Poor amount of hanging space if you are going for longer than a few nights - just one small single wardrobe providing coat hangers that unclip from the rail, and x3 small drawers. Take a kettle if you like a cuppa first thing in the morning too as this hotel doesn't provide one. None of the above spoilt our holiday, as I said these were just minor niggles, overall this is a great hotel in a superb location - between the Pg de Gracia and Rbla de Catalunya, only about 5 mins walk to the Placa Catalunya where the tourist bus, ticket office is and where you can pick up both the blue and red line buses, also the top of La Rambla. There are 2 metro stations close to the hotel's street on Pg de Gracia + a tourist bus stop for the red line (which you need to visit the Segrada Familia) We had a wonderful time in Barcelona and found their transport system so refreshingly organised and easy to use. Looking forward to our next visit!", "Date": "March 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tipperary, Ireland", "Title": "“Extremely Pleased”", "Author": "xienc", "ReviewID": "UR6892161", "Content": "Lovely hotel, friendly staff. Have computer area at your disposable with internet free of charge. Rooms were spotless. Restaurant a bit pricey but it's so close to many restaurants and bars. Would definately recommend this hotel.", "Date": "February 28, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "London", "Title": "“Not so special, where were the crystals?”", "Author": "Minz007", "ReviewID": "UR6814886", "Content": "In winter, our rather small hotel room (apparently 4 stars?!) was VERY hot all the time. No airconditioning added to the frustration. Staff were alright, but advised us the market was shut on Sunday when in fact one or two local ones were open (we discovered ourselves). I don't understand how they rated this 4 stars. Overall I cannot complain though - maybe I am just comparing it to 4 star hotels I have been to that are much more glamorous.", "Date": "February 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool", "Title": "“Fantastic Location!”", "Author": "Bingy10", "ReviewID": "UR6635993", "Content": "We went for a short break to Barca and had a lovely time at the Cristal Palace Hotel. I can't really fault much about the hotel. The rooms were spacious, beds comfy, lovely clean bathroom. Our maid was amazing and left the room absolutely spotless and pristine. The receptionists were very helpful too. My only slight complaints were that the lobby bar was quite expensive (for two poor students anyway) and the coffee machine on our floor was broken. But these are trivial complaints and it would be expected for a hotel of this standard to charge higher than average prices for drinks. The location is perfect, 5 mins walk to Las Ramblas, lots of lovely restaurants, bars and shops!", "Date": "January 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canada", "Title": "“Great Value and Location”", "Author": "kyflex", "ReviewID": "UR6527824", "Content": "Got the hotel for 63 Euros a night plus taxes off their website. We stayed for 4 nights. There was a discount for booking 3 or more nights of about 20%. The location was convenient, close to shopping, transportation and La Rambalas. The hotel room was nicely decorated and clean and modern. The floors were marble tile. The walls can be a bit thin and we could hear the neighbours talking and the TV. Hotel staff generally very helpful and friendly. There is one computer connected to the internet in their \"business centre\" but it wasn't working properly. It was a great value for the class of hotel and I would recommend it to anyone else.", "Date": "December 31, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK,KENT", "Title": "“Fantastic value and great location”", "Author": "EAGLES06", "ReviewID": "UR6166092", "Content": "Stayed at this hotel on 2nd November and have to say it was great value and a in an ideal location being only one block away from the Las Ramblas so just a few minites walk away. We only stayed one night but would like to have stayed longer in in this fantastic city. I upgraded to the Romantic room and it was a mere 125 Euros including a bottle of Cava in the price. Next time i may stay in one of the suites which are accross the road but have seperate bedrooms and loads of space and just 150 euros a night. We walked quite a way down to the marina and ate in a fantastic restaurant part of the Monchos group! check out this link apparently the one with the buffet is the best which was recommended to me by somebody who lived there for 4 years :- ---. Also we had a lucky night in the Casino which is located in the ARTS Hotel on the marina and people can get in with jeans etc which is strange but handy to know. Enjoy Barca but be carefull of the pick pockets and also the ladies with babies who approach you as they are all in on a scam that may leave you with less items that you went out with.", "Date": "November 22, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "dublin", "Title": "“central but only a 3 star”", "Author": "charly45", "ReviewID": "UR6148065", "Content": "This hotel is in a fab location in las ramblas it is spotlessly clean the view from our room was of the back of derilect buildings, but it is a city hotel , the breakfast was ok, but i think its only worthy of a 3 star rating.", "Date": "November 18, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "norfolk", "Title": "“superb hotel”", "Author": "paulmar", "ReviewID": "UR6033534", "Content": "This was our 4th visit to the city but first time at this hotel as we have stayed before at the Avenida Palace just around the corner. We are glad the (more expensive) Avenida was full as we chose this alternative purely on location and reviews and we were not disappointed. We will certainly stay here on any future visits to this wonderful city as we found our courtyard facing room quiet, spotless and with plenty enough space for a city hotel room. The bathroom was very spacious and well appointed. Staff were helpful and the breakfast (included in deal) was super with everything you could wish for. We have since recommended this hotel to several friends and clients.", "Date": "October 31, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wirral", "Title": "“Can't go wrong with this hotel.”", "Author": "YourBard", "ReviewID": "UR5592635", "Content": "The Cristal Palace is a clean, spacious hotel with individual controlled air-con in the rooms and a super location. Handy for everything. If you don't get breakfast included go out of the door of the hotel and turn right and right again at the corner. There are a few places on the next block up (towards Diagonal) which do lovely breakfast cakes (St Jaume) is a specialist cake bakery and has some cracking things on offer. For the Brits (like me) who like a cuppa in your room... take a travel kettle and t-bags! This is common in many european hotels... they just don't get the idea of \"tea when i fancy it\". A very minor issue in an otherwise really nice hotel. You'll enjoy it. I found the staff all helpful... (some of the American comments suggest that they may be grumpy... not so but they won't kiss your bum either, you are in Barcelona, sort stuff out for yourself!) Pete and Family. Wirral. UK", "Date": "August 9, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Great location, value, especially for family”", "Author": "brian796", "ReviewID": "UR5497210", "Content": "Stayed here for 3 nights in July with my wife, 13 yo son, and 10 yo daughter. We booked a family room, which was outstanding. Very spacious. Second floor had two twin beds pushed together in a large bedroom, TV, a large bathroom with full bath/shower, and sink. The first floor had a bathroom with a shower and sink (no full size bath), a small alcove with a twin bed, and a large living room with a TV, small desk, two couches, and windows opening to the interior of the city block. We had no noise problems whatsoever, although I suspect that's because we were on the interior of the block. The kids really enjoyed having some privacy and their own beds. The location is great, it's 1/2 block from Passeig de Gracia, two blocks north of the north-end of Las Ramblas, two blocks north of Plaza de Catalunya, and one block from a Bus Turistic stop (hop-on/hop-off). We ate breakfast at the cafe across the street. The owner spoke a little bit of English, but my rusty Spanish definitely was useful when ordering. There is a computer downstairs in the lobby with internet access, but since it is popular, expect a short wait and don't expect to be able to spend long on it given others waiting. Several minor complaints about the room... 1) Other than the bathrooms, everything is very open, so everyone can hear everything despite the large size 2) The TV controllers for the 2 TV's would sometimes affect both TV's. So someone watching TV downstairs, for example, could end up changing the channel or such on the one upstairs. One night, one of our neighbors ending up turning on our TV during the middle of the night while we were asleep. 3) The kitchen is locked and they will not allow you access to it. The family room location is literally next door to the main location. It's probably about 30 feet from the lobby entrace to the adjacent entrance. You need a key to get into the adjacent property, and they only have enough keys for one per family, although the front desk is happy to come let you in if the group gets split up. I definitely recommend the hotel for its location and value, especially for families. We would stay here again.", "Date": "July 22, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Edinburgh", "Title": "“Great for families with teenagers”", "Author": "Ian&Susan", "ReviewID": "UR5465833", "Content": "This was a perfect hotel for a family with two teenagers - we can't stay anywhere with just one room and two double beds anymore. We stayed in a junior suite, which had two rooms - one room with two good sized beds, and a living room with two smaller beds. We picked the hotel on a recommendation from another family with teenagers. The suite was lovely - clean, comfortable, nicely furnished. Couldn't fault it in any way. We didn't have any problem with noise, either. The bathroom was really nice, with a powerful shower! The location is excellent - close enough to La Ramblas (which we found a bit tacky to be honest), and round the corner from a red and blue 'bus touristic' stop - handy if you plan to tour the city this way. The location meant we were able to have a siesta back in the hotel every afternoon, when the heat got too much for us. Also round the corner from an airport bus stop.", "Date": "July 14, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Toronto", "Title": "“Great stay, would go back again.”", "Author": "Gototoro", "ReviewID": "UR5412172", "Content": "We stayed in the Cristal Palace for 4 nights. I must admit that there was some noise problem as I could clearly hear people from the next door showering, coughing and spitting. But it only lasted for a while in one night. The rest of the nights were ok so we were fine. The hotel room was huge in European standard, as well as the bathroom. It was clean and modern. It had turn down service at night, which was nice. The staff spoke English well and was generally helpful and friendly. We did have some problem with the TV but they sent someone up to fix it the same day. Location was perfect, just off Las Ramblas. Overall experience was great, with this price for a 3-4 star hotel in Barcelona we would definitely recommend it.", "Date": "June 30, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "San Francisco, CA", "Title": "“Noisy but great location”", "Author": "carlossf12", "ReviewID": "UR5343041", "Content": "The location is ideal, just a few blocks from Las Ramblas, the Gothic Quarter, and lots of shopping. The neighborhood felt safe and there were plenty of restaurants within walking distance. The accomodations were fine and the room was clean. However, we heard lots of noise in our room every night until about 2 or 3am. The sounds appeared to come from the neighboring building and not from within the hotel. All the noise really put a damper on our stay. Other than that it was a satisfactory stay. On a side note, the hotel offers parking for 16 euros a day.", "Date": "June 13, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "South Africa", "Title": "“Great Location”", "Author": "DebbeChristy", "ReviewID": "UR5325749", "Content": "As all mention, you cannot find a better location for exploring the city and I would definately recommend the hotel. However...... the walls of the rooms are PAPER thin and you can hear everything in the room next door. It really is very disturbing! So, if are are a light sleeper OR plan on making a lot of noise... Look elsewhere!", "Date": "June 8, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Cambridge, Massachusetts", "Title": "“Solid hotel with central location”", "Author": "Dave7702", "ReviewID": "UR5286951", "Content": "The best thing about this hotel is its location, as mentioned by numerous previous posts. It is just outside the main tourist areas of Las Ramblas and the Barri Gotic. It is only 2 blocks from the nearest subway station (Passeig de Gracia) and is next door to the Rambla de Catalunya, which has numerous restaurants, cafes, etc. The room we booked, a double, was pretty basic. I would place it as an average size in relation to a New York City hotel, though the bathroom was pretty large. The bathtub also doubled as a jacuzzi. No baclonies are available at this hotel. The staff were all very friendly, and while some has excellent language skills (Spanish, French and English) others were a little more spotty.", "Date": "May 31, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Location, location, location”", "Author": "k99js06", "ReviewID": "UR5022055", "Content": "After much research, my boyfriend and I opted for the \"Cristal\" and found it to be a really pleasant home away from home in BCN. The room was much bigger than we expected, was kept impecably clean, and had a lovely view onto a quiet plaza behind the hotel. The location was absolutely subperb; far enough from the hustle and bustle of Las Ramblas to be quiet, but only a quick walk in any direction to some of BCN's most popular attractions, not to mention two metro stations. We walked EVERYWHERE from this hotel, and felt very safe at all times. The neighbohood is great. The staff spoke perfect English and were very pleasant. The in-room hydromassage tub was an excellent bonus after long days on foot; we filled it up with hot water and had our own private hot tub/foot massage. Also, the lobby had two computers with free high-speed internet access, which was great. Had no problems getting a room on a non-smoking floor. One thing that would have been nice was an iron for our travel-weary clothes; there was an ironing service available, but no in-room iron and board. Also, no clock in the room, though this is apparently the norm in many European hotels. The walls were generally thick enough, although one night, a neighbor had a crying baby that was definitely audible. Finally, the BBC TV channel was out all but one day of our stay, but after all, we weren't there to watch TV (!). We found a great package deal on Travelocity that included our stay at the Cristal (what you'll need to call it when you tell taxi drivers where to drop you off) and our flight, so it was also an excellent deal. Would stay there again in a heartbeat.", "Date": "April 30, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "england", "Title": "“Easter Break”", "Author": "mellymel", "ReviewID": "UR5010111", "Content": "Have just stayed at the Cristal Palace Hotel over the Easter Holidays. The Hotel is situated near to Plata de Catalunya Sqaure at the top of the Ramblas. The bus from the airport stops in the square and it is only a five minute walk from there to the hotel. There are plenty of bars, resturants around the square so no need to travel far to eat and drink, and there are 3-4 metro stations around the Hotel. The Hotel itself is in a quite street away from the hussle and bussle. It has large spacious bedrooms and bathroom - and we had three beds in the room but it still didn't feel cramped. The shower was wonderful - very hot and powerful good to wake you up to get back out around the city. Barcelona itself is a fabulous city with so much to do and look at - already looking forward to travelling there again. The tourist bus is great, you can hop on and off all day at all the major sightseeing points - good way to find your bearings.", "Date": "April 26, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Wilmington, Delaware", "Title": "“Super Hotel”", "Author": "Howard S", "ReviewID": "UR4312708", "Content": "We stayed at the Cristal Palace from Dec 25-28 and were very pleased. The room was very high grade. We found it quite clean and with good quality furnishings. The roll-way for our teenage daughter was in place and set-up on our arrival. Front desk is very pleasant and helpful. Breakfast in the restaurant is good and a fair price. Location is excellent: one block off of the Gran Via and Passeig de Gracia. We walked over to Placa de Catalunya with ease (5 minutes) and strolled the Gran Via in the evening. Casa Battlo is an easy walk as well.", "Date": "December 30, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "New York", "Title": "“Highly recommend the Cristal Palace”", "Author": "jaju", "ReviewID": "UR4159200", "Content": "We stayed at the Cristal Palace over the long Thanksgiving weekend this year. We are a family of four (with 2 kids) and we stayed in one of their Jr Suites/duplex apartments. There was plenty of room for all of us to each have our \"own space\" (see the pictures I posted with this review). The Jr. Suites are in the building right next door. It is a very nice neighborhood; very safe with nice shops and restaurants nearby. The staff at the hotel were all very pleasant. We did not eat at the restaurant; instead we bought food at nearby markets. Please note that although the duplex suites have kitchens, there is no refrigerator, plates, etc and no coffee maker, so don't plan to cook in this room. There is coffee available in the hotel, but also a starbucks about a block away, if you feel the need. The Cristal Palace is well located with four metro locations within a block and the Casa Batillo and Casa Mila only a short walk away. We were very happy with our choice of the Cristal Palace and highly recommend the hotel to you.", "Date": "December 2, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Phoenix", "Title": "“Great Location”", "Author": "billyandme", "ReviewID": "UR4030030", "Content": "We stayed 4 days in advance of our cruise, and one day at the end. After reading the reviews before we left I decided to book this hotel. The rates seemed reasonable, although varied during the time of our stay, (btwn E147 - E179, and the location can't be beat. It is on Deputacion, one block from Passaige de Gracia, and one block from Placa Catalunya. Anna at the front desk took very good care of us, but I can't say the rest of the staff was over eager to make one feel welcome. Only one night of our reservtions came with breakfast, but I wouldn't pay for it if I had to. There are plenty of cafes around the area. Our room overlooked the back and was very clean and quiet, although not overbearingly large. The room came with robes (nice touch) and a whirlpool bath. Ask for a room in the back. Our vacation did not start well at the airport upon arrival. We landed in terminal A and our luggage was at terminal B, but no one told us..along with other Americans on the flight. When we asked staff at the airport to point us in the direction of the baggage claim, they did not speak English, nor were they interested in helping. The cab drivers on the all in all do not speak English, and a cab should only cost you around E20-25 to the heart of the city. It cost us E24. Please be aware, that there is a different rate on the weekends (higher), and that they charge you $2 for every bag placed in the trunk. In fact we think the cab driver taking us to the airport on Sunday really took us for a ride even though the traffic was nearly nil, the meter read E3.75 before we drove away from the curb, and the ride back cost us E31.75 with one less bag in the trunk. I think the hotel location was great, but if it is any indication of a European hotel, it was probably pretty good.", "Date": "October 17, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Brooklyn NY", "Title": "“Barcelona in August”", "Author": "Poetessnyc", "ReviewID": "UR3843586", "Content": "It's been said before, but allow me to reiterate . . . the Hotel Cristal Palace's location is absolutely perfect. We got everywhere really quickly; rarely had to take a taxi. (Only twice, returning from Port Vell/Barceoloneta). We walked right out of the hotel, down two blocks to Placa Catalunya, onto the Ramblas and right down to the Port. The hotel is one block above Gran Via (a primary east-west route, connecting Placa Espanya and Placa Catalunya, and along which the aerobus from the airport runs), and thus, two blocks north of Placa Catalunya. You can catch a bus on Gran Via that runs all the way up Montjuic to the Fundacio Juan Miro. The hotel is Located between Rambla Catalunya (the CALM Rambla) and Passieg de Gracia (main N/S boulevard with Gucci, Chanel, Zara, and spectacular modernisme buildings, including Casa Battlo.) We were no more than two minutes walk to either Placa Catalunya station or Passeig de Gracia station, so that we could connect directly to the four major metro trains in BCN. Also, Passeig de Gracia has a commuter rail station, at which you can the line that goes south to Sitges, for a day trip to a gorgeous beach town. You are also a stone's throw from the BCN tourist center. When we'd go to the old city, and had become pleasantly overwhelmed by the cacaphony, stepping out into L'Eixample was like breathing clean air. And arriving at the Cristal Palace (whose name I could not say without a giggle) and stepping through the strange semi-circular automatic doors, was yet another level of peace. The hotel itself is quite comfortable -- if you, like me, have read all the other reviews, you'll read that there is a tad bit of noise that commingles from room to room, and that the rooms are small, but it's nothing a city dweller isn't used to. The room we stayed in was well planned, with a low and small scale decor and huge, double glazed windows that made it seem much larger. As for street noise, the new windows completely eliminate it. Expect cool polished marble floors throughout, huge bath with double sink, big tub, gentle A/C, freshly ironed linens daily, careful and considerate room service and housekeeping. (If you sleep past noon, your room will still be cleaned.) Most of the guests we met were mature folks (of all ages) and the hotel is set up to handle people keeping all hours. The desk staff speak many languages, and are helpful. I was concerned about privacy in such a small space, and yet I never felt intruded upon. Ice machines would be a nice touch, but you can ask at the desk for a bowl. The hotel has some free newspapers (including the Herald Tribune in English, with an El Pais English insert) located back by the breakfast area. I never did figure out the espresso machine centrally located on our floor across from the lift. Frankly, I don't think it adds to the charm of the hotel. In Barcelona, if you drink coffee, cafe con leche is one of the most sublime pleasures. Why would we give that up for a powdered creamer and coffee from a foil-wrapped tablet? By all means, try the chicken and avocado sandwich via the 24-hour room service. The mini-bar is reasonable! The Pictory resturant on premises is expensive and elegant, and we didn't try it, but one day when we wandered in in search of the chicken sandwich, the waitress was gracious and helpful as she settled us in the bar area and presented us with a room service menu. And THEN we ordered a pitcher of sangria made by the barman in the most skillful way: it was amazing, with spices, anise, fresh fruit, cold: a perfect beverage for a steamy summer BCN afternoon. We didn't do the breakfast -- there's a cafe immediately across the street and another one to the right, as you walk out, where they have fresh-squeezed oj (zumo) and if you ask nicely, they'll make you a cheese omelette. Also, on Passeig de Gracia, on the corner, the Vaca Paca has a 10 euro buffet libre dinner. As we were on a tight budget (spending $1000 each for 12 nights in BCN) we took advantage of it once or twice and it's well worth it. My sister and I spent 12 nights, cheek by jowl in BCN on a limited budget, and felt pampered and protected at the Hotel Cristal Palace. We would surely stay there again, if we have the opportunity.", "Date": "September 5, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Hong Kong", "Title": "“Great location”", "Author": "cychan", "ReviewID": "UR3806414", "Content": "Great location with metro, train, brand shoppings and all sight-seeing route close to the hotel. We were upgraded to a suite but it's not the same hotel building. We think we should be informed for such as there was no security guards downstairs and we have to use our keys to open the doors downstairs. It should be an apartment but it's quite nice with a private balcony, and spacious as well. You may refer to my photos attached for the room itself. If you're looking for great location and reasonable price, this may be your choice.", "Date": "August 25, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "leicester, england", "Title": "“loved it, a clean friendly helpfull hote”", "Author": "Anisha04", "ReviewID": "UR3445174", "Content": "We arrived by taxi from BCA airport (30 euros). I was on holiday with my husband and our two sons. We checked in and were taken to the junior suite in a building next door. The suite was amazing, spacious with two single beds downstairs, 1 shower rooms with a toilet and 1 double bed up a spiral staircase, with a large area for storage and a large bathroom. The suite was very clean with its own adjustable AC and daily maid service. The hotel staff were very helpfull with advise and could all speak english. This hotel is located in the perfect location for shops, cafe's, bars and a 5 minute walk to catalonia square. Ladies look out for deals from the handbag shop opposite the hotel she cuts her prices in the summer by 75%. The metro was just around the corner and it took you every were.", "Date": "May 6, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "4"}, "AuthorLocation": "England", "Title": "“Great Service, Lovely Room, Super Breakfasts”", "Author": "If_only_I_were_rich", "ReviewID": "UR3296703", "Content": "A really good hotel in a great location. Staff were friendly and very helpful and kind indeed. The room we stayed in was very clean and with a nice decor and a jacuzzi style bath that worked. The breakfasts were superb with a huge selection of foods and drink, including healthy alternatives e.g. soya milk. The room was relatively quiet althought the view was not excellent, but considering the location that was a small sacrifice to make. Definately highly recommended to others.", "Date": "March 23, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Northampton", "Title": "“Enjoyed Cristal Palace”", "Author": "smjak02", "ReviewID": "UR3267092", "Content": "Enjoyed recent 3 night trip to this hotel. The room was fine. We had a large private balcony area with a table and chairs which would have been great in summer. You had to be careful closing the sliding window at night otherwise there was a wind noise. We were at the back of the hotel and it was quiet. The breakfast buffet was fine although for those accustomed to a bit of leniency on the closing time or a warning of things disappearing at closing time you wont get that here! Most of the staff were excellent. Enquiries about a restaurant were met with assistance with the reservation, and it was good too. We did encounter a sarcastic, lazy barman. He tried hard not to serve us at all. On return one night he told us the bar was closed despite there being a sign showing it was open for another half hour. He then chatted to the reception staff before condescending to take our money. The other staff deserve a more enthusiastic colleague This was good value on my 6th trip to the city staying in a different hotel of similar standard each time. I would stay here again if I am lucky enough to return to this fantastic city. Excellent location walked a lot of places near enough to metro for further travel.", "Date": "March 11, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "", "Title": "“Watch your wallet & phone”", "Author": "A TripAdvisor Member", "ReviewID": "UR3234484", "Content": "This hotel is in a good location & very quiet. The only problem we had was the maid stealing my mobile phone & money from my wallet. The attitude of the staff when we reported that my stuff has been taken was not very good they thought we were just making it up. This is not a 4 star hotel more like 2 or 3. You will find a better hotel for the same price per night in Barcelona.", "Date": "February 28, 2005"}], "HotelInfo": {"Name": "Eurostars Cristal Palace", "HotelURL": "/ShowUserReviews-g187497-d206937-Reviews-Eurostars_Cristal_Palace-Barcelona_Catalonia.html", "Price": "$103 - $439*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Diputacio 257</span>, <span class=\"locality\"><span property=\"v:postal-code\">08007</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "206937", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/7f/63/7f639a391d0d637cea38c0b30623b3495large.jpg"}}