{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kyiv, Ukraine", "Title": "“Fit us very well, but could be better”", "Author": "Olena A", "ReviewID": "UR128129878", "Content": "Very convinient location (few minutes by walk from plaza Espana). Clean room with all basics things that you could need (bath, hairdrayer, shampoo, quite convinient bed etc). Very quiet street outside. What is true that room is small, walls are thin, but so far we were walking, eating and drinking all the day - we were sleaping like dead so no chance to disturb us with any noise. So if you are planning the same trip - 3-4 days with active walk and tasty food and wine - it will fit you perfectly as well", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Winchester, United Kingdom", "Title": "“Quiet Hotel, five minutes from Plaza Espana”", "Author": "ali3240", "ReviewID": "UR126913863", "Content": "We stayed here when my partner ran the Barcelona marathon in March. The location was perfect, in a quiet, residential street just two blocks from Plaza Espana and the metro. The hotel is a well run, modern, business type hotel, the staff were really helpful and allowed us to have a late check out on the Sunday morning with no problems. This is not the hotel for you if you want to be right in the middle of Barcelona with restaurants and bars on your doorstep but if you want a good night's sleep I would highly recommend it.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cyprus", "Title": "“Good price, clean, basic”", "Author": "dinos_p", "ReviewID": "UR122890967", "Content": "LIKES It's a 7-10 minute walk away from two stops Espanya (which is slightly more near) and Rocafort. Friendly staff, good facilities, clean and most of all safe. Breakfast is nice and has the basic options. DISLIKES Internet was kinda slow and sometimes was not even working at all. We stayed there for six days and we had cooked eggs and sausages only for the first day. The other cold choices were pretty good but the \"disappearance\" of the hot items was kinda weird.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Warsaw, Poland", "Title": "“Good time in Barcelona”", "Author": "PaK83", "ReviewID": "UR122614421", "Content": "Almost all the descriptions I've read before were true. Pros: Good location, close to airport bus stop, metro, Montjuic (incl. Magic Font, Estadio Olimpico etc.) and big commercial centre with restaurants, bars and shops. Clean, staff speaking English. Price resonable. Cons: Construction of room doors and lockers make them loudly slaming every time they are closed, unfortunately also in the middle of the night. The room is very small without any place for the travel case, so you have to leave it in the middle of the room and jump through it. And finally: take care about your bocadillos, dulces and frutas because of pharaoh ants. Unfortunately had problems with too soft and floating mattress and did not sleep well.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“Decent Location”", "Author": "Ljcalgary", "ReviewID": "UR119116712", "Content": "Location was quite good. Quiet enough, but close enough to some good things. The hotel was quite small, but there was 24-hour reception, and a decent view from some rooms. Our room overlooked a fitness center's soccer field, which was neat. We had to move rooms because our room became overrun by ants (but that could have been because we had some food sitting on the dresser). They moved us without hesitation and were very apologetic. The staff was friendly. The rooms were good, except the showers could have been a little cleaner. It also bugs me when showers/baths have mould in the corners (as many seem to in Europe). Overall, we liked it.", "Date": "October 9, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great little hotel”", "Author": "danmom0", "ReviewID": "UR116470319", "Content": "Small hotel - close to sant station and joan miro park. great location. close to a host of amenities. printed our boarding passes for free. you can leave your luggage there during your last day. lovely terrace for breakfast. small rooms. basic. spotlessly clean. friendly and helpful staff. very good value for high season. we had no complaints. walls are a bit thin - but not enough to make it uncomfortable. highly recommended for the price.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“Nice and strategic hotel”", "Author": "Herry_72", "ReviewID": "UR112541853", "Content": "This is quite a nice hotel, in a quiet neighbourhood, with service with a smile. Close to Arenas de Barcelona mall (where they have shops, supermarket and food court), Espanya metro station (10 minutes walk), Rocafort metro station (10 minutes walk), Airport bus stop (near Plaza Espanya), mini market (just across the hotel), fruit shops (5 minutes walk), park, and lots more. Hotel room is small but clean.", "Date": "June 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Essex", "Title": "“Excellent location, clean hotel, helpful staff”", "Author": "EssexGirl02", "ReviewID": "UR106256018", "Content": "Stayed at this hotel for 4 nights. The room although small was very clean and had modern decoration, very good value and the location was excellent. Flat screen tv, air con, telephone and nice bathroom. 5 minute walk from Espanya metro, equal distance to las ramblas and new camp which was a half hour walk or easy ride on metro. Staff spoke english (as did most of barca) and were very welcoming, efficient and helpful. I would recommend this hotel to anyone who visits barcelona. We will definately be returning. Hotel offered food but we didnt try it as plenty of bars and restaurants in surrounding area.", "Date": "April 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "england", "Title": "“Mixed feelings - good hotel but with issues”", "Author": "iwyswug", "ReviewID": "UR85468906", "Content": "Recently stayed at this hotel, which I chose after reading the generally postive reviews on this site. Starting with the postives, the hotel is well located, in a quieter area of Barcelona. On a previous visit I had stayed in the main Ramlas area and the noise didn't stop 24 7, so the fact that the hotel is quiet, but well within walking distance of two main underground lines is great. Being in a more local neighbourhood also meant that there were plenthy of cheaper bars and places to eat (handy as we didn't have breakfast included with the hotel). The staff spoke good English and were alway very helpful, and the room was very clean. Although the bedroom was small, it did have a TV and a good size bathroom. However, there were unfrounately two main issues, which have been highlighed in other reviews. THe first problem was that we had one of the dreaded \"courtyard\" rooms. This meant no outside light, or air. The room was always pitch black and felt stuffy - we had to set an alarm as it was completely black in the room at 10am! The other problem was also the door slamming. It is impossible to close the door without slamming it, and this went on throughout the night. Although we did get used to it, it made the first night's sleep very difficult, and this together with the dark room did put a bit of a dampener on an otherwise very pleasant hotel.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "South Shields, United Kingdom", "Title": "“Good, Very clean & friendly hotel”", "Author": "Southshields_DAVE", "ReviewID": "UR83149682", "Content": "This is hotel is in a good location if you are travelling into Barcelona by air as it is only 10 mins walk from the main train station in Barcelona, Estacio Sants, In which you can get the renfe train direct from the airport Terminal 2 into Barcelona Sants, Train takes about 20 mins and only 3.00 euro's each way, Yes, As per other reviews, The hotel is out of the city and about 25 mins walk from the main tourist areas, Las Ramblas, Passaig de gracia, Placa de catalunya etc.., However, This reflects in the great very favourable online rates, Although the walk into the city is quite pleasant as it is along a main road with stacks of bars, cafes, eateries etc...., However, Rocafort metro station is only 2 blocks away approx 5 mins walk which from there is then only 3 stops into the main city metro Catalunya, 2.40 euro's each way or T-dia ticket is 6.00 euro's and you can have unlimited travel for one day in order to sweep up all the tourist sites and the metro's run until 2.00am,This hotel is at the right end of the city for Font Magica and the Olympic stadium which are only 10 mins walk away, Overall, Very clean, Friendly and very competitive online rates, Very much reccomended and would definately stay again if in Barcelona.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sacramento, California", "Title": "“Clean and Friendly, but not in the heart of the city - not a bad thing!”", "Author": "KimbK", "ReviewID": "UR64211525", "Content": "We had a great stay! The room was nice and clean! Even had a refridgerator. The people at the front desk were very helpful and nice. Spoke very good english. The hotel is only 3 stops from Placa Catalunya (La Rambla). 3 blocks to the metro, in a safe area. We liked not being right in the heart of the city, for safety and noise reasons. Since this is not a super touristy area, the restaurants don't speak much english and there aren't a ton of restaurants, but again you are a 5 minute metro ride from restaurants. We felt safe walking from the metro at night. There is a supermarket, smaller market and bakery within 2 blocks. Will come back!", "Date": "May 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Dorset", "Title": "“Good hotel but away from main tourist areas.”", "Author": "CaroleDorset", "ReviewID": "UR47106158", "Content": "A friend and I stayed at this hotel for 4 nights. We had a room at the front of the hotel and found it quiet and very clean. Breakfast was €11 + tax extra but not worth the money and this was the only meal available. There was no bar nor anywhere to get a drink of cup of coffee in the hotel, although there was a mini-bar in the room. My friend was expecting tea/coffee making facilities in the room. There were plenty of places to get a continental breakfast in the area but a lack of good eating places for an evening meal. It was about 20-30 mins to walk to Las Ramblas and 10 minutes to the Metro Station at Placa Espanya.", "Date": "October 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "uk", "Title": "“mixed feelings”", "Author": "jaimie_es", "ReviewID": "UR24178258", "Content": "We spent a couple of nights at the NH Sant Angelo over the New Year period. This is a modern property with stylish rooms, clearly aimed at business travellers. Sants Railway Station is a mere 15 minute walk from the hotel. The Rambla is a 30 minute walk, or 3 stops by Metro (from Rocafort to Catalunya on Line 1). Unfortunately we got an interior room on the first floor, depressingly dark, looking onto some sort of covered courtyard almost devoid of natural light. It was not exactly the world’s biggest room either, with barely enough space to walk around the bed, and just one bedside table. The bathroom was a more decent size, oddly fitted with two separate sinks (perhaps too pretentious for such a small room, we thought). Sound proofing seemed a bit of a problem too: from our bathroom we could hear a pin drop in the bathroom next door. Not a pleasant experience. Ouch! The cold buffet breakfast was definitely the highlight of our stay. There were cereals, yoghurt, cold meat and cheese cuts, a selection of freshly cooked pastries (delicious), fruit and fruit drinks (lovely peach juice), plus tea or coffee on request, and free newspapers. Would we return to the NH Sant Angelo? Difficult to say. We would not mind, if we had to, but with so many other hotels all around Barcelona, we would most probably try somewhere else next time, perhaps even another NH hotel.", "Date": "February 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Fabtastic Hotel!!”", "Author": "GinaRibena", "ReviewID": "UR20953225", "Content": "Monjuic is quite a lovely district and this hotel is a delight.. Helpful and perfectly mannered staff made our stay even greater, and I wouldn't hestitate to book here again on my next visit.. Barcelona is just an amazing City and I can't wait to go back.. (and sorry to the Americans we woke up...I promise not to let him have Sambucca again!) ;-) The Joan Miro park about 30m away was a wonderful place to sit, drink, and chill watching the locals .. I would take some strong painkillers with you to Barcelona..You will get a neckache looking up at everything..Its mind-blowing..and please do take the lift up the Sagrada Familia for the most amazing views...The lift at the back of the Cathedral is a lot less of a wait..(45minutes..as opposed to the lift at the front to the right of the entrance..which was 1½ hrs...) Placa D' Cataluyna (abit like Trafalgar Square in London) is such an amazing place...Usually live music outside The Hard Rock Cafe..Panpipes one night...A super Spanish Rock band the next day..la Rambla (las Ramblas) is absolutely buzzing and has something for everyone...though eating is nearly twice the price of places just off of it... Do the Bus Turistic, though its a bit of a scrum to get on the open top deck..but WoW...so very worth it !! Barcelona has won our hearts, so go stay at the Sant Angelo..and enjoy it for yourselves :o)", "Date": "October 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Surrey, UK", "Title": "“Excellent Hotel!”", "Author": "hanwellhavoc", "ReviewID": "UR20876921", "Content": "Stayed 3 nights at the NH Sant Angelo, and what a wonderful stay it was! Check in was very efficient and polite, and very helpful. Our room was large(unlike some other reviewers?), spotless and tidied daily. The breakfast buffet is great...fresh fruit, cereals, pastries, a few hot options, toast, juices, tea, coffee, yoghurt, etc. Free soap, shower gel, shampoo, conditioner, comb, razor and foam, toothbrush and paste, chocolates and mints. Lovely soft fluffy towels. Large TV. Fridge(mini bar). It is a few minutes walk from a couple of Metro stations and the bus stop is around the corner. It is in a lovely part of the city..near to everything but without the noise of being too close to Las Ramblas. All in all, we had a brilliant stay, and would definetly stay here again. Thanks!!!!", "Date": "October 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Would recommend it”", "Author": "ccwh", "ReviewID": "UR14501278", "Content": "My boyfriend and I spend a long weekend in Barcelona, and were trying to find an affordable but comfortable hotel within reach of the main Las Ramblas area of Barcelona. We went on many review sites including Trip Advisor, and settled on the NH Sant Angelo based on the reviews given which said that it was a comfortable, and above average hotel. The hotel was easy to reach from the Arc De Triomph bus station (which connects to the Barcelona Girona airport) and it is less than a 10 minutes walk from the nearest Metro station. There are 3 Metro stations close by, along with Sant railway station. From the nearest Metro station, it is about 10 minutes to Las Ramblas (on the Metro) and about 20 minutes walk. The only drawback would be a slightly undersized room but this seems to be typical of most European hotels. The pics shown are accurately descriptive of the hotel, and the receptionist staff were all very friendly and instantly provided us with bus timetables when requested. The best thing about the hotel was the breakfast which came included within the price. It was a buffet breakfast, and consisted of pastries, croissants, cereals, yoghurts and drinks, juices, fruits, cold meats, scrambled eggs and chorizos. This was one of the widest array of choices in a buffet breakfast that we've had so far for the level of hotel. We would recommend this hotel if you are searching for an affordable and comfortable hotel with a good level of service.", "Date": "March 24, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“loved the buffet breakfast”", "Author": "albatroz", "ReviewID": "UR5616658", "Content": "I've recently returned from Hotel NH Sant'Angelo in Barcelona. The Hotel is nice and the staff at the reception are friendly and helpful. The buffet breakfast was very good with several qualities of bread, yaourts, cheeses, juices etc. The only drawback was the size of the room, which was really rather small when compared with the photos in the hotel site. I was rather disappointed with that. Furthermore I could ear whatever was goin on the next room's bathroom. Considering everything it was a good experience and I woudn't mind staying there again.", "Date": "August 16, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“Lovely hotel NH Sant Angelo”", "Author": "nit2202", "ReviewID": "UR5076436", "Content": "We have just returned from a weekend break in Barcelona with 2 friends. We booked through an online hotel site. The hotel is in the city centre next to Joan Miro park and we paid £60 per night per room. My friends had been to other NH hotels, and this was just as nice & clean, decorated in a contemporary style. Breakfast was not included (like most of the hotels in Barcelona). It is located 5 minutes walk from Sants train/metro station & 3 minutes walk from Espanya & Tarragona metro stations. We bought 3 day travelcards for £13 and thus travelled throughout the city. The nearby restaurants are authentic Catalan, but this means Spanish only menus. We definitely recommend staying here if going to Barcelona.", "Date": "May 15, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“Easy to get to, Clean and efficient”", "Author": "A TripAdvisor Member", "ReviewID": "UR2771470", "Content": "Stayed at this hotel for a long Weekend while in Barcelona on holiday. Was the cheapest I could find which belonged to a reliable chain, although I had never used NH before. Hotel was absolutely spotless, in a good location- about 5 minutes walk from the Metro station where trains run till 2am Fri/Sat and midnight the rest of the week. Room was small but well furnished and comfortable, it looked out on an internal 'space' but for the price we paid was good. A/C was a bit dodge but couldn't be bothered asking for another room and moving stuff, opened window instead. Not all staff spoke English and this hotel certainly showed it was a Spanish chain, however I speak minimal Spanish and got by. Certainly would stay again.", "Date": "October 21, 2004"}], "HotelInfo": {"Name": "Apsis Sant Angelo", "HotelURL": "/ShowUserReviews-g187497-d206931-Reviews-Apsis_Sant_Angelo-Barcelona_Catalonia.html", "Price": "$86 - $164*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Concell de Cent, 74</span>, <span class=\"locality\"><span property=\"v:postal-code\">08015</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> (Formerly NH Sant Angelo)</span></span></address>", "HotelID": "206931", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/ca/28/52/fachada.jpg"}}