{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "uk", "Title": "“Good Price”", "Author": "UkNicko", "ReviewID": "UR128418943", "Content": "I am a frequent traveller to Barcelona.This was our first time to this Hotel, usual Hotel unavailable booked via 'Unitrave' from Fri 21st April to Sunday 28th April 2012, 2 rooms three adults, Hassel free friendly check-in given a complementary map and allocated rooms 205 & 208, my room 205 had no natural light and even with the curtains open the view from the window was a wall, room lights needed on to see. Twin beds comfortable/sheets and blankets and a choice of pillows,A/C ok/minibar/safe/TV unable to hear and remote would not increase the volume gave up. On suite good.(bath very slippery) would need a non slip mat whilst showering. Room 208 my colleague said he hit his head a couple of times whilst entering the bath, rail protruding.The hotel staff friendly and helpful, its just a little far out from my usual roaming area.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London", "Title": "“Good value hotel near the main sights”", "Author": "mauat Posted by an Easytobook.com traveler", "ReviewID": "UR127746922", "Content": "Hotel was a near to the main sights of Barcelona without being in the touristy area. Decor a bit dated but staff were friendly.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Ballymena, United Kingdom", "Title": "“worst hotel ever!!!”", "Author": "Darren B", "ReviewID": "UR127089817", "Content": "My wife and I chose to end our honeymoon in this hotel. Terrible idea. The room was unlike any four star hotel we have ever stayed in...the carpet was stained, the bathroom was dirty and had a disgusting smell, the noise from the surrounding area & guests was unsettling and the staff were very unapproachable and unhelpful. I never write reviews on websites but felt compelled to in the hope that other honeymooning couples would avoid repeating our mistake by ending their honeymoon on such a low. We left for the airport early just to avoid spending any longer in the building. We expected much more from a hotel in its location, especially following a recommendation from our travel agent friend. Would not recommend it to anyone. Ever.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vitoria", "Title": "“USUAL TRIP TO BARCELONA”", "Author": "JORGE B Posted by an Easytobook.com traveler", "ReviewID": "UR124606642", "Content": "I was a frequent customer of this Hotel but I didn't visited in the last three years. I felt as if I just left it a few days ago: personnel efficient and kind, good service and very clean. Iy's not a fancy hotel, but a very good option to be downtown in a comforable and clean place.", "Date": "February 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“4 lovely days at Balmoral”", "Author": "Sjaske", "ReviewID": "UR119761286", "Content": "We stayed at Balmoral for four nights and have been really pleased with our stay. The rooms a small but with a really nice atmosphere, a lovely bed and really clean and tidy. The staff at the hotel are really friendly - even the room-cleaners said goodmorning and smiled when we met them. The breakfast is really good and worth paying for; fresh friut every morning; bananas, oranges, pineapple, grapes etc. Boiled eggs, spanish omeles, scrambled eggs, sausages, bread, a various of cheese and meat, salmon, croissants, yougurt, really nice fresh juices, coffe, tea - etc etc .. We really enjoyd our first meal every day in the restaurant!! The hotel is Nice located. We enjoyd that it was near the center of Barcelona, near the mainattractions but still located away from the noise and in a quit, clean and beautiful part of Barcelona. If we were to visit Barelona again we would definitly book a room at this hotel again!", "Date": "October 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Best for short stay”", "Author": "Fega1964", "ReviewID": "UR119596287", "Content": "Good to stay three-four days, breakfast is not special, it,s well located, by foot you can get to Gaudi,s all building.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Athens", "Title": "“First trip to barcelona”", "Author": "JoannaVou", "ReviewID": "UR119549097", "Content": "The hotel is perfectly located in a very good area that is so close to the centre but so far from the noisy and touristic atmosphere. Clean and comfortable with helpful staff. Avoid lower floors (I stayed on the second floor) because you can hear the metro but because most of the time I was out I didn't mind.", "Date": "October 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Warrington, United Kingdom", "Title": "“Our second visit and we liked it even more”", "Author": "smplayareal", "ReviewID": "UR116961899", "Content": "If you want a good value(by Barcelona standards) hotel in a quiet area of the city then this is for you.You will need to be prepared to go on the metro or take a bus unless you are a keen walker as the hotel is not in the centre.For us this was a plus as we liked to escape the crowds especially in July.Pay extra for a balcony room it is worth it.We had a lovely terrace and enjoyed a bottle of wine early evening after a long day of sight seeing.The rooms are quite small but beds are comfy and it is clean.We had breakfast which was lovely,good choice,however it is not worth the extra money really,just convenient.I would stay here again if we do ever go back to Barcelona again.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Utrecht", "Title": "“great location and quiet”", "Author": "JS88", "ReviewID": "UR115655901", "Content": "hotel is oké. Not very nice but perfect for a weekend in Barcelona. Metro stop close to the hotel, busstup in front of the hotel and you can walk to al lot of sites in 15 minutes. Good beds and you can choose youre pillow. In the area lots of shops and nice restaurants.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Dunblane", "Title": "“Don't judge a book by its cover....”", "Author": "DunblaneScully", "ReviewID": "UR113705011", "Content": "We stayed for 3 nights over the Formula 1 Grand Prix weekend. The hotel is reasonably close to the centre with the Sagrada Familia not very far away. The reception staff were efficient but not particularly friendly apart from 1 receptionist who was very helpful in finding a great restaurant for us. The hotel is clean and the bar and front reception are presentable.However, I did have 1 major problem with the hotel in that it did not provide an iron/ironing board. I rang the reception and they informed me that the hotel does not provide such items and that the ironing service ( chargeable) they do provide was not available over a weekend. I found this very disappointing for a 4 star hotel. To sum up, it's an ok 4 star hotel, but there are better in Barcelona.", "Date": "June 15, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "ireland", "Title": "“Not a 4 star Hotel”", "Author": "mlodyosiem", "ReviewID": "UR104989919", "Content": "Positives - Reception area looks nice, marble on the floor, two couches in the corner, entrance to the diner, two elevators. - Good food, breakfast is really nice, good choice in meat, cheese, drinks (really fresh juices), bread and others. Also had a beef stew in the afternoon and it was delishes. My advise is eat the food in the hotel cause the food in the city is usually rubbish. - Barca TV, as one of our must do in Barcelona was to go and see the match having Barca TV was cool, unfortunately it was in Spanish or Catalan so we couldn't understand anything. - Air Conditioning - it was boiling hot in Barcelona, good thing to have in such heat. Negatives - One of the elevators doesn't work, and the one working is very slow to arrive (we used stairs most of the time from 3rd floor). - Rooms, we booked two rooms (301 and 302), they were small for a 4 star hotel, and what i couldnt' believe in was that in the bathroom (which also is not a 4 star hotel standard) there was a window and when i opened it and my mate opened the window in his bathroom we could see each other... that is just obscene. Also the double beds weren't actually double beds just two single beds put together, and one of the wheels on my bed was missing so when i moved to the side of the bed the whole bed moved with me. - TV, NOT A SINGLE CHANNEL IN ENGLISH or any other language! - Staff (Bartenders, Waiters) - they did not have any English! how are you supposed to communicate with them. Also the staff was unfriedly, but i guess all spanish/catalan are the same. We spent 5 days in Barcelona and we didnt meet many friendly people. - Price, we paid 110 euros per night, it's so not worth the money. General - Location, is just off the start of Rambla de Catalunya, and Diagonal which is a nice street with palms, so not too bad", "Date": "April 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Business-oriented hotel, big rooms, very clean, FREE wi-fi”", "Author": "blazerbryant", "ReviewID": "UR92583971", "Content": "Balmoral Hotel was the best hotel we stayed at during our 2 week holiday around the Mediterranean Coast. It is located near the Diagonal metro stop, an easy 10 minute ride downtown. Its a little non-descript on the outside, but has a nice (if a little sterile looking) lobby. We did not eat there but the restaurant/bar looked nice. The mirrored elevators were small (by American standards, but not European). Our room on the 7th floor was the largest we had in Europe, and seemed to be a standard unit. There was a large marble-lined bathroom, new fixtures and large mirror. The room was spacious with two full-size beds, which were very comfortable. There is slightly wider sitting area at the window, with a large closet with safe an mini-bar. The TV was flat panel, maybe 40 inches, but ALL CHANNNELS were in Spanish or Catalan (no British or American channels), and NO English subtitles. Also, the TV was by the window, so you have to look sideways from the bed to see it, otherwise you are facing a bare white wall. However, there was FREE wireless internet, available strongly in the room - the password is printed on a card by the TV. Free internet is nearly unheard-of in Europe so that was good. Service and cleaning were perfectly normal and efficient. The overall-impression of this hotel was a business-friendly, exceptionally clean, but sort of generic establishment.", "Date": "January 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seixal, Portugal", "Title": "“Really what we were looking for”", "Author": "Crisque", "ReviewID": "UR85997377", "Content": "We liked the hotel very much. The rooms are big and cozy. The location is great, central but not messy, it's near Plaza Catalunya, the Ramblas, but not in the middle of the confusion. In fact the place is very quiet and safe. The staff is friendly and nice and promptly gave us a map with all the interesting places signed. We just found breakfast quite expensive and we prefered taking it in Caffe di Roma quite across the street.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Business Hotel with a great location”", "Author": "BDBSouthAfrica", "ReviewID": "UR85484499", "Content": "No surprises, previous reviews indicated that the hotel was a standard business hotel and so it was. The hotel lacked character, was not warm, funky and fun but rather functional . The front desk staff were efficient and pleasant, all in all the hotel represented good value for our stay. The hotel is located outside of the touristy areas in a more upmarket area with some of the best shopping in Barcelona. Easy to access great eating places with a short ten minute walk. The room was comfortable and clean.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Rio de Janeiro, RJ", "Title": "“Internet was NOT AVAILABLE in the room.”", "Author": "Anatereza", "ReviewID": "UR84628302", "Content": "Positive points: Location is OK. Nice staff at the front desk. Breakfast is OK. Negative: The hotel is definitely not a 4-stars hotel. The desk in the room was too small and all occupied by the TV, impossible to work. NO INTERNET IN THE ROOM, although the hotel announced free wireless all over the hotel. There were 2 PCs in the lobby for all guests, which could only be used before 11pm. Not good for business travellers.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Modern, clean and friendly.”", "Author": "jonnystarbuck", "ReviewID": "UR82555153", "Content": "Stayed for two nights on a sightseeing trip. It takes about 20 minutes to walk to the main Plaza Catalunya, but there is a Metro station and a sightseeing bus stop 5-10 mins away on foot. A taxi from the hotel to the Plaza Cat. cost just under €6. I really don't get the review dated Sept 2010 where the hotel is described as tired. The lobby is decked out in neutral colours, with a nice clean glass door frontage and marble all over the place. There are smart soft furnishings and dark walnut coffee tables. In my view, it's really nice. Our room (602) was again clean and sleek. The bathroom is well fitted with very modern white ceramic fittings. The floor is green marble and the walls are all cream ceramic tiles. One reviewer has posted a photo of a load of horrible looking pipes. Well, in our bathroom, there was a very tidy opaque glass UPVC window which was on an internal wall. Curiosity got the better of me and I opened it. Therein I found said horrible looking pipes. I found that not opening this little internal window again was a very effective method of not seeing the pipes!! We were lucky with the view I guess - we were on the front of the hotel and looked out at the gorgeous buildings on Via Augusta. Yes, you can hear the traffic outside but it did not prevent me from sleeping and I would not describe it as excessively noisy. Last thing. There is a wellness centre on the top floor. There is a sun terrace with loungers, and a few CV machines. There's also a Sauna. The terrace is a very well appointed space if you want to soak up the sun. I have paid about €90 per night here and I think it's really good value. A similar hotel in London, based on quality of accommodation and proximity to the centre, would be well over £200 per night. And being London, it would rain.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "New York City, New York", "Title": "“Not even close to a 4 star hotel..maybe 2 or 3.”", "Author": "modernartobsession", "ReviewID": "UR79971502", "Content": "Don't believe the 4 start rating. Its not correct, maybe 2 would be more correct. This hotel is old and tired. It badly needs an major face lift ASAP. The beds are from 1960..as are the Lobby, rugs, drapes, furniture and bedding. It's on a noisy block..and the room I was in had constant car noise all nigh long. The minimal staff was nice, but there was no doorman..no baggage clerks or concierge. No dinning after a cheap buffet breakfast, and no room service. I don't know how it has 4 stars but it must be from 20 years ago.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“good value for the price”", "Author": "travellingkate024", "ReviewID": "UR78905877", "Content": "My partner and I stayed at the Balmoral Hotel for 7 nights during our trip to spain. We paid between 77 and 87 euros a night which was a good deal in my opinion. Rooms are not fancy, but clean. The one annoyance was that the internet was constantly down and the business centre is closed after 10pm. The hotel staff are not the friendliest, but the hotel is in a great location just off the Diagonal, close to Passeig de Gracia. It was nice to be a little ways from Las Ramblas that is a tourist zoo virtually 24 hours a day. If I was to return to Barcelona I might try and stay a little closer to the water since we loved going to Barceloneta at night, but for the price, the hotel is a fine choice.", "Date": "September 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Great Hotel & Great Location”", "Author": "TravellerDT", "ReviewID": "UR76940738", "Content": "VIsited just last week. Hotel was great location and safe. It is not in the busy touristy La Rambla but just a 5 min walk to Diagonal station which gets to just about anywhere. Also 5 min walk to bus stops and to the Passeig De Gracia main street where you can walk along to view the 2 Gaudi monuments and shop along the way. Takes a half hour walk to reach the Catalunya/ La Ramblas area. Nice and scenic walk. Rooms were clean, toilets were clean, amenities were great. Great hotel. Hotel reception staff were not as friendly but its ok, as hotel was nice. But staff were quick to respond to needs like extra pillows and luggage assistance and calling cabs for hotel. Great place for short stay in Barcelona. Very safe and shops are all around. Plus just a nice 20 min walk to the Sagrada. will come back again!!", "Date": "August 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "London", "Title": "“Disappointing stay”", "Author": "Nag_hos", "ReviewID": "UR75576143", "Content": "I would not recommend this hotel to people going on holiday mainly for its location and it is not the standard you would expect from a four star. We first stayed in this hotel a year ago when there was an issue with water supply for a whole day where there was no water in entire hotel. So we were invited back to stay for 2 days free in the hotel this year. I initially thought this was a good gesture from them but after checking in I would have prefered to pay for a room in a 2 star closer to Las Ramblas. My opinion of the hotel did not improve from the last time I was there. They put us in a room at the back where there was not enough room to move around. Also the bathroom was too small and poorly lighted for a 4 star. The hotel is completely without charater and you would hesitate to sit and chill in reception which looks nothing like a hotel reception more like an office reception. I think this hotel is mostly suited for people on business trips. We moved to a 2 star hotel 2 days just off Las Ramblas and I was more relaxed and at ease with my surroundings. The bathroom in the 2 star was twice the size. The room was airier,same size as the 4 star and the bed was just as comfortable. I would therefore never stay at Balmoral again as I do not think it is comparable to a 4 star and I can stay in a comparable 2 star for much less.", "Date": "August 17, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Very Noisy and bathroom had mould growing out of it”", "Author": "sammy12345", "ReviewID": "UR75236332", "Content": "This hotel is further away from the gothic area and other tourist attractions. The hotel was very noisy I thought I was staying in a youth hostel, would not recommend if you are looking at relaxing quietly. Also the bath had mould growing out of it.", "Date": "August 15, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Moscow, Russia", "Title": "“Nice hotel, conveniently located”", "Author": "Marassa", "ReviewID": "UR67786563", "Content": "Booked through the internet, got a huge room with all amenities on the top floor, could see the spires of Sagrada Familia in the distance from a spacios balcony. Contrary to what TA database says, parking is NOT free, it's EUR15 a day, not that bad for the center of Barcelona. The underground parking is very cramped. Did not try their breakfast, we prefer to have breakfast in town. Free and perfectly working WiFi. All in all, very good choice.", "Date": "June 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Antwerp", "Title": "“Good for location to centre”", "Author": "Cay", "ReviewID": "UR67289545", "Content": "This Hotel is great for walking into the centre and to see all the various sights. We personally did not need to take the metro at all, although we had very tired feet after a few days! The city of Barcelona was fantastic, the architecture amazes at every turn. The lobby of the hotel is very smart and our room was clean and comfortable, we had a room looking out onto the wall of buildings, but as we were out during the day this was not a problem. There was free wi-fi but as we were on a top floor the signal did not always work. The bathroom was nice finished in marble. The airco worked well although too noisy to keep on at night and it did then feel rather warm in the room. The hotel hallways were very warm. We did not have breakfast in the hotel, there are a lot of very nice patisseries nearby where you can sit and eat and get drinks etc for less than the hotel charges. The reception staff were not always so cheerful, not welcoming you as you come back to the hotel. However there was a young girl on reception on our last evening who was very friendly and helpful. There was a porter that helped us with our luggage into the taxi on our last morning (leaving at 5am) and this friendly help made a nice final impression of our stay. Good value compared to city hotels.", "Date": "June 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Rome, Italy", "Title": "“Good Quality and Location”", "Author": "fipenna", "ReviewID": "UR52848829", "Content": "This hotel was quite a good surprise. I booked over the internet, and didn't really like the fact that breakfast was not included in the price, but as it was a kind of last minute booking there was not much to do. The hotel location is very good! Walking distance (not more then 15 minutes) from the main turistic spots in BCN, like the Sagrada Familia church, Plaza Catalunya (center) and the La Pedreira. The rooms are well sized, far from claustrophobic, the decoration is neutral and there's enough space on the closets. The service is great. My wife didn't feel well and needed to go to a hospital, they not only have indicated and excellent hospital but also helped on making exceptions on the menu served for dinner, etc, making a tough situation less complicated. Would definetly recomend this hotel to anyone.", "Date": "January 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "France", "Title": "“Modern, comfortable and quiet hotel in a good area”", "Author": "amateur2urist", "ReviewID": "UR38338995", "Content": "I stayed in this hotel for the first time on a business trip and liked it so much that I returned again last year for a holiday and plan to do the same again this year. The hotel has a classic, discreet feel to it and the rooms are comfortable and quiet. The room I stayed in is a small double room with a nice balcony that you can sit out on when the weather is good, which it usually is! What struck me most was how quiet the room was even given the fact that it is situated in the middle of the city and the hotel is surrounded at the back by large apartment blocks. I am sure there are more \"characterful\" hotels nearer the tourist areas but I suspect they would be noisier. There are several buses that stop outside and two metro stations within easy walking distance. You can walk to the main shopping areas and there a lots of nice cafés and restaurants nearby. I found the staff pleasant and helpful even though I don't speak Spanish ,especially Ariana who is delightul. I hope this hotel moves higher up the list.", "Date": "August 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Amsterdam", "Title": "“Nice 4* star hotel with spacious room”", "Author": "WBarts", "ReviewID": "UR31494757", "Content": "Nice spacious room with a big balcony. Confortable beds. A 5 to 10 minute walk to subway 'Diagonal' and a bus stop in front of the hotel. Only Spanish TV chanels and no watercooker / tea facilities in the room. The men at the reception were a bit grumpy (not sure if this is 'Catalonian style'); it would we nice if they would just say 'hello' when coming back to the hotel in the evening time. The girl at check-out was very kind. Overall a good choice for a stay in Barcelona.", "Date": "June 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Italy", "Title": "“A great hotel in BCN”", "Author": "Jacopone", "ReviewID": "UR29891333", "Content": "I have been many times to Barcelona both for business and for turistic reasons. This april I was for the first time in this hotel with my family. It was a great experience. Staff is very very very kind and usefull, the hotel is clean, rooms are large althougth they do not have much charme. The hotel is located in an area that is a bit as far away from the medieval part of the city, but if you consider visiting Pedrera, Caca Batillo etc. the hotel it is really at walking distance from these buildings. But the best thing is that with a very short walk you can reach the area of Gracia which is one of the best palces in BCN to have a dinner and a short night walk in the most charmy area f BCN. The hotel is easy to reach both if you are arriving by car or train (direct metro line from the train station SANTS). This is really a great solution both if you are in BCN for turism of for business.", "Date": "May 13, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bursa, Turkey", "Title": "“good location, decent price”", "Author": "gumerzeci", "ReviewID": "UR22432083", "Content": "Besides good location, fair price and meeting the standards of a 4 star hotel, it was great to find free internet available. I think the hotel should inform the customers who have a car about the discounted parking fee in a better way.", "Date": "December 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "England", "Title": "“Better than expected”", "Author": "KK&RP", "ReviewID": "UR19278648", "Content": "A fairly long walk from the main 'Ramblas' (30 mins?) and also, therefore, the old quarter but closer to the cathedral and still a wide range of Tapas bars within easy reach. For a top destination like Barcelona we felt that 120 Euros for two nights in an above average hotel was excellent value.", "Date": "August 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boston, MA", "Title": "“Good safe location”", "Author": "thumper1", "ReviewID": "UR19201465", "Content": "The hotel was in the business and shopping district. It had free internet access and a refrigerator in the room. The metro was not far away -- about 5 minutes -- and there were good restaurants nearby. We especially liked Mussol right around the corner on Diagonal Ave. Flash!Flash! had good frittata style omelets, but rolls to accompany them cost 2 euros each.", "Date": "August 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Long island, ny", "Title": "“Just OK”", "Author": "BROWNIE32", "ReviewID": "UR18389337", "Content": "The hotel was tucked away in a quiet area of Barcelona in the financial area. A five-10 minute walk to the nearest Metro and Bus Turistic stops. The rooms were neat and clean. The free continental breakfast was OK. What I was most annoyed with was the blase attitude of some of the staff. Depending on who was at the desk, service or questions about the city could be like a trip to the dentist. They did not go out of the way to offer advice. Also, don't look for restaurants near the hotel. Most better places are located in more lively parts of town. The best part was the hotel had a reasonable price. Pre booked at $205 per night.", "Date": "July 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Epsom", "Title": "“Upmarket convenient location”", "Author": "epsomladies", "ReviewID": "UR15178750", "Content": "The hotel was exactly as expected - good standard, clean and ideally situated in an upmarket neighbourhood away from the crowds but close enough to public transport to allow us to move effortlessly around the city. We found the metro cheap, efficient and easy - Diagonal being the closest to the hotel. Reception staff were friendly and helpful when approached but seemed reluctant to look up from their computers to pass the time of day - a greeting and a smile makes a big difference. The rooms were kept spotless with clean sheets and towels every day - full marks to the cleaning staff. We didn't eat breakfast at the hotel because of the comments made in previous reviews - there are lots of lovely cafes within easy walking distance at half the price. Barcelona is an expensive place to visit - to save money take the bus to and from the airport - only 4euros compared to 25euros by taxi.", "Date": "April 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Europe", "Title": "“Great Hotel, Great Location”", "Author": "R225", "ReviewID": "UR14509654", "Content": "We have just return from a 5 day mini-vacation in Barcelona, Spain. We booked 4 nights at the Balmoral Hotel, and we are very pleased with this Hotel. Great Hotel, very clean room, breakfeast was great, private parking (13 euro's/day). Near all public trasnportations (3 min walk to the Metro/bus station) which will take you right to all major attractions. Barcelona is a wonderful city, will go again soon!", "Date": "March 25, 2008"}], "HotelInfo": {"Name": "Balmoral Hotel", "HotelURL": "/ShowUserReviews-g187497-d206935-Reviews-Balmoral_Hotel-Barcelona_Catalonia.html", "Price": "$95 - $198*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Augusta 5</span>, <span class=\"locality\"><span property=\"v:postal-code\">08006</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "206935", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/7a/95/4a/hotel-balmoral-barcelona.jpg"}}