{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "París, Francia", "Title": "“Good service, breakfast and quality overall”", "Author": "Aeolom Posted by a NH Hoteles traveler", "ReviewID": "UR128180965", "Content": "Liked this hotel. Price wise it was worth it as well. Had a problem with my room (door didn't open) and this was appropriately dealt with by staff. Staff at reception was friendly and helpful. Would go here again. Close to train station.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good value for money”", "Author": "AUSTUK", "ReviewID": "UR126379551", "Content": "The rooms are adequate, however being a room for 3 they just put an extra bed and there was no space to move. However for the price compared to other hotels in Barcelona it was good value. Breakfast was over rated and there is no room service unless if you want to order in pizza!", "Date": "March 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Nice decor but terrible beds”", "Author": "FamilleDiF", "ReviewID": "UR125562533", "Content": "Was with my husband (he was on a business trip) and we had a nice, modern decor room. The beds were totally awful, you basically sink in them. I loved the hardwood floors but given that the isolation wasn't very good, they probably should have chosen carpet flooring. You could hear people in the next rooms, as well as people walking in the hallway. It seems like a half-hearted renovation: the elevators were quite ancient, and our magnetic keys had to be replaced pretty much every day. Breakfast buffet OK (there is no restaurant or bar, just a breakfast room) with some hot food which is not the norm in Spain. Wi-fi is free in the (small) lobby, although only in 30 minute increments so you have to keep asking for a new code. On the other hand, good price for value, extremely convenient to the metro (Les Corts), with super easy access to Sants train station, and Fira on Placa Espanya. Very quiet, relatively upscale neighborhood with lots of local shops, bars, and cafes. Police station a block away so assuming it is also quite safe!", "Date": "March 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Good discount hotel in the Barcelona sub urbs”", "Author": "Eremie", "ReviewID": "UR122587035", "Content": "Though the hotel is further away from the city centre, it has a good metro connection. The rooms are however old and there was a lot of dust underneath the bed. The beds have wheels and roll away when sitting against the wall. Next to the beds there are no plugs for charging your cell phone, something that I really missed.", "Date": "January 5, 2012"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Great hotel, but not centrally located”", "Author": "bp487", "ReviewID": "UR113131225", "Content": "The only major drawback of this hotel is its location. It is in a nice area, though I doubt one would want to spend a lot of time exploring it given all Barcelona has to offer. While the hotel may not look far from central Barcelona on the map, it will take at least 35 minutes (10 minutes walk + 25 minutes ride) to get to the city center due to the metro line located close to the hotel taking a very indirect route. We found this is generally the case for all of Barcelona's metro lines, however. Other than location, NH Les Corts is an excellent mid-range hotel. We found the rooms to be quite large, especially by European standards, newly renovated and perfectly clean. Thirty minutes of free wifi is offered in the lobby each day, while in room access costs about €8 per day. Free in-room access would be nice, but considering the price the hotel charges in a rather expensive city like Barcelona we didn't find this to be an issue. Overall, I would recommend the hotel to those who are looking for a nice hotel on a budget. While it is nice to be a in a location where one can conveniently stop by the room throughout the day, this is going to be hard to accomplish for less than €70 per night in Barcelona.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Get by”", "Author": "Peggy_Pegster", "ReviewID": "UR90554668", "Content": "It's not an ultra modern or boutique hotel but certainly get by...I mean Barcelona is so exciting , tons of sight-seeing, activities - you really won't spend lots of time in the hotel. It's actually not too small, great if you are there alone - it gets a little cram if you share it with someone. The toilet didn't work for the last 2.5 days of the one week stay, couldn't flush, they couldn't fix it , although they offered to change the room - I was really too comfy to change ...4 days staying in the same room with stuff all over the place - the last time you wanna do is to include packing into the itinerary in SPain! Good thing is they aren't too pushy of getting us out of the room , although they try by insisting at first telling us there are major changes need to be done to the room. After that I realized that they have asked several other of my colleagues to moved out of their room as well.....hmmmm.... Their balconies face directly at a residential building opposite - so remember to draw your curtains! Very simple reception, very simple breakfast - there are scramble eggs and sausage links and of course all the cold cuts: breakie european style. Went there, realize my electrical adaptor does not fit into the Spainish wall plugs (not because of the prong type but because of the shape of the plug)....try to get one in the reception and they ran out of them apparently. So I went to several shops asking for an adaptor with my broken spanish...they don't have them in supermarkets, I have to walk 7 minutes to a Chinese run shop that sells everything. The subway station is round about 7 - 10 minutes walk away - if you are going during autumn, remember to bring an umbrella, else you will end up like me totally soaked in a thunderstorm as I find my way back to the hotel in the night.... It's not a fantastic hotel, but certainly can get by - was in this hotel as when I was there, there's a 10, 000 delegate conference occuring at the same time as a festive season in Sept when they celebrate for the end of summer ...so do book early if you are planning to go Barcelona during the peak season!", "Date": "December 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "South West England", "Title": "“Not central but still a good place to stay”", "Author": "JonnyBerlin", "ReviewID": "UR82734100", "Content": "This hotel is not central but has great transport links fight to the heart of the city.....Underground - Green Line 3 and Bus 66 are the best (both 1.30 Euros) ask for Placa Catalunya when you get started...its the \"city centre\" and at the top of La Rambla. The hotel is on a street corner with loads of traffic but this was no problem and it was quiet in the rooms. The hotel and room was spotlessly clean and efficiently services daily. The hotel staff were friendly, helpful and mostly english speaking willing to give loads of detail about the city....just ask. The breakfasts were far too expensive and it was much better to go to one of the many local cafes to get a great breafast for a third of the price!. There are loads of Restaurants and Bar all around. The bars stop outside eating and drinking at midnight when it all moves inside to you want to stop. There is great shopping 5 mins up on the Diagonal... Camp Nou is really easy to walk to and if you want to do an open-top bus a stop is within easy walking where you can also get the tickets - this is a stop for both the blue and red routes - BBT (Barcelona Bus Touristic) was the best and cheapest option. Barcelona is a great city and to see it all this turned out to be a great base!!.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Huddersfield", "Title": "“Great Hotel”", "Author": "Dimpaler", "ReviewID": "UR46825452", "Content": "Great Value for money and a very clean and comfortable Hotel in a reasonable good location and not too noisy/busy", "Date": "October 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Madrid", "Title": "“Good, like most of NH hotels”", "Author": "PilarBravo", "ReviewID": "UR24125885", "Content": "I've been in NH Les Corts several times on business travels. The hotel is very clean, and the rooms are good, with a nice terrace. One of the problems of this hotel, is, like most of hotels in Spain, that you have to pay for wireless internet connection, 15 euros/day. This becomes expensive for a one week stay, specially if you need internet connection all days. This hotel has two main good things: the breakfast, although a little bit expensive, is quite good, and the beds are extremely comfortable. NH hotels beds are made specially for them, and they are quite nice. The location is good for business purposes, but for leisure is not a good choice, as the subway is more than 10 minutes walking from the hotel.", "Date": "February 2, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Malaga, Spain", "Title": "“good value normal NH standards”", "Author": "curatokid", "ReviewID": "UR6818306", "Content": "Stayed there for a long weekend and found the usual good NH standards, not much around in the area but did walk to Camp Nou in about twenty minutes, it is too far to walk to town center, the Barcelona open top tourist bus stops about ten minutes away, we used taxis to get into centre cost about eight euros, hotel room very clean and bathroom only had shower, breakfast very good in a very comfortable dining room, the restaurant is only open for breakfast at weekends, all the staff were very helpful and friendly, yes I would stay there again.", "Date": "February 20, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "San Jose, Costa Rica", "Title": "“If you are a tourist, don't stay here”", "Author": "danielmh", "ReviewID": "UR5603598", "Content": "The hotel is fine and clean by 3 star standards. Limmited services, huge charge for the in-room Internet and rude staff. Non service oriented. VERY far away from most tourist attractions.", "Date": "August 12, 2006"}], "HotelInfo": {"Name": "NH Les Corts", "HotelURL": "/ShowUserReviews-g187497-d206929-Reviews-NH_Les_Corts-Barcelona_Catalonia.html", "Price": "$83 - $129*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Travessera de les Corts 292</span>, <span class=\"locality\"><span property=\"v:postal-code\">08029</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "206929", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/48/10/48102a9e67f87ca4fb0a56565797e1336large.jpg"}}