{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Southampton", "Title": "“Great hotel!”", "Author": "JDay77", "ReviewID": "UR140076612", "Content": "The Abascal is a great place to stay. The staff are very friendly and more than happy to help with any requests. We have 2 double rooms and 1 premium room. The 2 double rooms were spacious and very comfortable. The premium room was stunning with a fantastic terrace balcony were we enjoyed dinner with a beautiful sunset. The best bit had to be the breakfast which had anything from fried eggs to cakes to hams and cheeses. Would recommend this hotel for business or a weekend away.", "Date": "September 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Location": "3"}, "AuthorLocation": "Moscow", "Title": "“Good, but there should be more interesting places in Madrid”", "Author": "alyonam", "ReviewID": "UR137608227", "Content": "The room was less in size and much more gloomy than in NH Berlin, but it's still a decent place to stay. It is situated in a nice business and residential area, not in the very center of the city, but you still can reach Prado by foot in 30-40 minutes (public transport is available, too). So, it's really good, but I'd say that in Madrid you can easily find more character and cheap small hotel in the historic center.", "Date": "August 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Barcelone", "Title": "“Good location, small rooms and super breakfast”", "Author": "Lluis", "ReviewID": "UR134813812", "Content": "The hotel is located in the Abascal Street in Madrid, closed to the Castellana. There are a lot of taxis and also the subway in closed to the hotel. The building is so nice. My room was not big, just one bed. The breakfast is the best of the hotel: everything was delicious", "Date": "July 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Essex, UK", "Title": "“Clean & comfortable - and quiet!”", "Author": "DXB2GB", "ReviewID": "UR134258143", "Content": "This is a great business hotel - it's peaceful with no screaming kids. My room was clean and was a good size. The staff at reception were a bit clueless on distances to other hotels and attractions (e.g. I was told my colleague's hotel was 1.5hours walk when it was about 20mins away) and it's a shame the wireless was only free in reception (and very poor signal for the most part). Good location; close enough to shops and museums.", "Date": "July 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Met all our needs”", "Author": "Kevtamuk", "ReviewID": "UR132264009", "Content": "We stayed here for 3 nights as part of a trip which included a concert in the Bernabeu Stadium - the hotel was chosen for its proximity to this primarily We were offered the standard upgrades on check in, but as we had no intention of spending much time in the room, as this was our first visit to Madrid, we declined. The room itself was clean and tidy with a very large bathroom. Looking at previous reviews it appears we were lucky with our standard room in that we had a view of the sky as we were on the 7th floor but again we knew what to expect so we weren't disappointed. A nice touch was the bottle of water and a fresh strawberry, chocolate combination that was there the first night. We found the bed very comfortable and it was good that there was a choice of pillows if those on the bed weren't to your liking. We found the staff to be friendly and helpful. We didn't have breakfast but were offered it at a special rate but as we had plans for the mornings we decided not to take this up so we cannot comment on the quality of food offered All in all for the amount of money we paid for in advance we couldn't fault this hotel and it met all our requirements..", "Date": "June 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brisbane", "Title": "“Nice Hotel Nice Area”", "Author": "Molkentin", "ReviewID": "UR132209664", "Content": "We Stayed at this hotel 3 nights & found it good Room was not large but adequate decided not to an upgrade as we were out most of the time & did not think the upgrade was worth the money Breakfast was fine no complaints Got a bus one block up into the centre of town to do some shopping Very easy Good restaurants close by", "Date": "June 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Good Hotel”", "Author": "danale1965", "ReviewID": "UR132040464", "Content": "I stayed at the NH Abascal for 4 days during a business trip. The hotel itself was fine, very clean rooms, decent amenities, friendly staff, quiet. The beds were a little too hard for my taste but in a hotel, too hard beats too soft any day. Unlike other reviewers the breakfast was just average, it was fine, but nothing at all special. There isn't a lot of natural light in the rooms, it's true but unless you are planning to spend a lot of time in the room it's not that big a deal. I didn't think much of the surrounding area in terms of restaurants or anything, there are some tapas bars and restaurants but nothing really special. Our hotel kept trying to get us to some supposedly fabulous Italian restaurant but I really wanted Spanish food. But the hotel is very close to the metro and the center of town with way more fun options is only about a 10 minute ride. Two small things which I didn't like. The bathtub/shower was quite narrow and it was nearly impossible to shower without getting a puddle of water on the bathroom floor and the other is access to wireless Internet. There is wireless but it costs 17.60 per day but then when I checked out they were advertising unlimited wireless upgrade for only 5 Euros per day, it would have been nice if they would have offered it at check in and when I tried to get them to credit me, they didn't speak enough English to do it. But other than that it's a nice hotel.", "Date": "June 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Foster City, California", "Title": "“Do not upgrade”", "Author": "SHADDACalifornia", "ReviewID": "UR130219670", "Content": "Lodged here as part of a bus tour. Everyone arriving early, before the mandatory 2-night stay, was offered an upgrade. EVERYONE. 20Euros extra a day (on top of an already expensive 260E room) brought nothing more than a larger space between the foot of the beds and the dresser. Upgraded rooms was located at the front of the hotel - bordering on a VERY noisy avenue. And no, it was too soon to get AC so the windows were our salvation and our curse. Did I mention the terrible lighting? Or the broken TV? Or the coffee maker that wasn't refilled after our first night? Aside from the location near the Metro and a rather nice selection of tapas bars, it was a bust. Do not upgrade; save those Euros for the tapas bars!", "Date": "May 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sintra, Portugal", "Title": "“Very good hotel.”", "Author": "Posted by a NH Hoteles traveler", "ReviewID": "UR129174035", "Content": "The Hotel is amazing, very pretty and well decorated. Staff very friendly, room conditions very good and confortable, in the bathroom they have champoo, shower gel, soap, bathing cap, paste and toothbrush, kleenex, hairdryer and so on...when we arrive to the room we had waiting for us a welcome tray with strawberries and chocolate truffles and a bottle of water. And all stuff in the mini bar was for free... The breakfast has a huge variety of products..it was all very good. We enjoy it very much. Definitely recommendable.", "Date": "May 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Good standard good value”", "Author": "bam4d", "ReviewID": "UR127116330", "Content": "I usually stay in more central, more expensive hotels of the NH chain in Madrid, but we got a great price for this hotel and were impressed by the standard of the rooms and the service. It is near to the metro and there are lots of restaurants in this area within walking distance. It's not the very centre of Madrid, but it's a great area slightly further north with a lot going on.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great breakfast and location”", "Author": "Daquito", "ReviewID": "UR126900623", "Content": "We stayed in this hotel last weekend and we were quite happy. It's not in a very touristy area which for us is actually a good thing. It is walking distance of a few touristy sights and also great restaurants and tapas bars nearby (highly recommend Alboran). Breakfast was just lovely. Worth staying here. On the downside, our standard double room was quite small and we had some problems with the bathroom. There was a broken tile in the bath that made the floor look like a swimming pool after showering! We did tell the hotel and hopefully they'll fix this. The room had a very strong smell when we arrived of some product, like an insect killer/repelant product which was very strong and although the room and everything looked clean, the bathroom didn't smell like it had been cleaned at all (someone had used it before we arrived!). No natural light as there was only a very small window to an interior patio (our room was on the first floor). I must say I stayed a while ago in one of the nicer rooms on the ground floor and it was a lot more spacious and had more natural light. All in all this hotel is a good option for its value, breakfast and location.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Best place for those who like eggs for breakfast”", "Author": "mmp2003", "ReviewID": "UR125540247", "Content": "It's a nice place though if you don't know Spanish it may be a little bit difficult. As everywhere in Madrid it's hard to find a person speaking English well. Also there were some problems at the reception when they wrote Russian last names. It was too hard to do it correctly for the stuff. We needed a document from the Hotel after the trip as it was a business trip and our Firm had to be sure that we lived in the Hotel. So be attentive at the beginning while receiveing the card with your name written. Ask the staff to correct it immediately. Later it can make a problem. The breakfast were fantstic. The cooks cooked eggs in different way and they all were very tasty. We had dinners there too. It was delicious. There are no free Internet that makes business trips not so comfortable. Location is good. Underground station is close and in 15 minutes you may occure in the center of the well known tourist city.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cheshire", "Title": "“Business Trip - November 2011”", "Author": "MDG534621", "ReviewID": "UR122481503", "Content": "I stayed in the NH Abascal during a recent business trip. First of all the positive aspects of the hotel. Location was excellent, plenty of bars, restaurants within a short walking distance and within a neighbourhood that always felt safe and welcoming. The hotel rooms did not suffer from any external noise and for sleep and rest the hotel was pretty much ideal. It was facilities whilst awake that let the hotel down somewhat. The rooms were dark with very little external light coming into the room that I had (Standard Room Type, 506 if I recall correctly). The gym facilities were laughable and really did not warrant a mention on the website. NH Abascal certainly wasn't the worst hotel of its type that I have stayed in but then I think for a similar cost there are better hotels available. Watch this space I have just booked to stay elsewhere for a business trip in January 2012. I will let you know how this compares.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Ignore the review below “I'll never come back” 29 December”", "Author": "gemma-jemima", "ReviewID": "UR122430715", "Content": "My partner and I stayed 28th Dec 2011 till new years day and we thought the cleanliness was spot on given our room was tidied and cleaned daily! The reception staff were very helpful with any questions we had, directed us to a local cyber cafe and even took a few pics of us by the Christmas tree! So I don't know which staff the people in the previous review were served by! The hotel is really close to the tube and has 3 or 4 busy night clubs/bars on the same block, but you wouldn't know, as they're sound proof and we didn't see many people hanging around outside them. The hotel menu prices are what you would expect from a 4* hotel in a capitol city centre but the food is delicious and worth the price! If you want cheap and cheerful get a B&B outside the centre! The rooms were spacious enough for a short break and included a fully stocked mini bar (prices were the same if not cheaper than local bars). Hair dryer and TV worked fine, the beds were very comfy- actually temped to take the pillow home with me! If ever we're in Madrid again we'll definitely be stopping at Hotel Abascal!", "Date": "January 2, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Vigo, Spain", "Title": "“I'll never come back”", "Author": "jesusgomezf", "ReviewID": "UR122212599", "Content": "Very bad service, bad car park, bad cleanliness, no help for parking, expensive breakfast, tv does not work well, very bad recepction staff, good location. I have stayed here two year ago and then the hotel was good; today it is a bad option.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“UPGRADE”", "Author": "Marcia M", "ReviewID": "UR121543521", "Content": "When we arrived we were asked to upgrade for a great bathroom. So we had a look and did, however we felt ripped off having already paid top price for the room. There was a problem with the plumbing that didn't get fixed over the 3 nights we stayed there. One of the problems was that often the desk clerk didn't speak any English. The location is nice and quiet, but a good walk from the main area, however there are restaurants within walking distance. The breakfast was good and generally the staff helpful. It was our first visit to Madrid and we were surprised that few people have any English, however most people are friendly and the food great.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "UK", "Title": "“Not the best location for central Madrid but ....”", "Author": "travellingforfun72", "ReviewID": "UR120698399", "Content": "... as I was turned away from their sister hotel Hesperia Emperatriz down the road I was grateful to have somewhere to stay for the 4 nights. I was there on business and it was an OK location for the Feria de Madrid as the Metro station was 400 yds down the road. But there was not much happening restaurant wise in the area around Gregorio Maranon. The first room they gave me was over the air conditioning units and really loud, so I asked to move rooms and they did so without any hesitation, the next room was overlooking the centre of the hotel and despite the odd shape was really quiet and perfect for my needs. Don't think that this place has a good gym, I went down one evening to find a delapidated treadmill - that proceeded to give me electric shocks, a kind of bike, a kind of stepper, weights bench without weights!! All very high tech - NOT, more of a box ticking facility than actual facility! I went for a run outside instead! The lobby having free wifi was great, though not business service level - but perfectlky adequate to check e-mails and facebook! I didn't really use any other facilities - the bar shuts at 11:00! The check in staff appreciated my basic Spanish but were very able to speak English themselves! Word to the wise - when travelling to the airport please either catch a cab or guard your belongings with your life - I travelled round Madrid no problems until I had my suitcase with me in rush hour, and proceeded to be pickpocketed between Gregorio Maranon and Nuevos Ministerios - 1 stop on line 10!", "Date": "November 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Evanston, Illinois", "Title": "“Perfect for what we were looking for”", "Author": "JennyW99", "ReviewID": "UR120532514", "Content": "I was in Madrid for business staying at the very nice Gran Melia Fenix, but decided to change hotels for the last nights of the trip for sightseeing. Even after changing from deluxe accommodations, the NH Abascal was perfect for what we wanted. We got a great price through Priceline. The staff was friendly and helpful, and the hotel lobby and room were very clean. We could easily walk to two different Metro stations, as well as a bus stop. The neighborhood and hotel was pretty quiet, and as two female travelers we always felt safe. Our only complaint was that we wanted to sleep in after a late night out on Saturday, and the housekeeping staff was incredibly loud. Our room was right next to a storage closet, and it sounded like they were constantly throwing something against our wall. Overall, this hotel offered a great value.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Perth", "Title": "“This a pretty ordinary hotel in a average location”", "Author": "ozandy", "ReviewID": "UR119581507", "Content": "Had three nights here in September and we were asked at reception whether we wished to upgrade. We went for a Junior Suite at 25 Euros extra per night, but apart from the size of the room everything else was disappointing. The cleaning was very average. A/C was inefficient and depite double glazing the street noise was shocking.Other people in out part said their rooms were tiny and very hot because of the lack of decent A/C. The beds and pillows were very uncomfortable. When you are paying top dollar for thse places you expect better than this. Be lucky to rate 2 stars in Australia! On the upside the breakfasts were good.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Maastricht, The Netherlands", "Title": "“Disappointing”", "Author": "RIck W", "ReviewID": "UR119111295", "Content": "Stayed in this hotel in August and was rather disappointed. Booked this hotel through the NH Hotel website and was marketed as one of the upscale hotels of NH in Madrid however did not meet expectations. Check in was alright and as suggested by previous reviewers it is worth to check out upgrades and upgraded to a junior suite myself. The lobby area is rather small but stunning loved the ornaments etc.. however the rooms are located in an extension and are blandly style and one does not recognize anything of the old grandeur of the building. The room we stayed in was not spic and span as you might expect, dust under coffee table etc. In addition we found the boarding passes previous guests under the writing pad. Stereo set did not work and TV too small to watch TV from the bed. We did feel that the room overall was tatty and could use an update. Breakfast extensive and provided all the things you could possibly think of one negative is that personnel at breakfast bring for some guests coffee whereas other guests have to take it themselves at the buffet rather confusing All in all decent stay but they need to work on the small details and the hotel needs renovation.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Marana, Arizona", "Title": "“This hotel missed the mark”", "Author": "l1106410", "ReviewID": "UR118394657", "Content": "Our stay at this hotel was part of a Spain/Portugal package tour. My first impression was, \"Are you serious?\" The lobby looked like a dive on 42nd Street, Manhattan. Absolutely non-descript. When we checked in, without even seeing the room, we were asked if we wanted an upgrade. Since we like to travel in the best fashion we can, we agreed to a 15 Euro (approx. $21) per night. When we got to the room with the bell boy, I said, \" I can't imagine how badd the room would be without the upgrade.\" We could hardly move, it was so small and spartan, to put it nicely. One chair, no table, no radio, no clock. I've stayed in better Holiday Inns.. Later, when we met the tour director for our group orientation, i saw that the lobby bar chairs were filthy. They were threadbare at the top, grimey and not appealing at all. I will say, the included breakfast was great in a lovely dining room with extremely good service. They had eveerything you could ask for. I don't know how much the breakfast would cost because everything was included in the package price. As we got to know our fellow travellers, we found that everyone was disappointed and, you can bet, the tour company will hear from me. I won't mention the company name here because, over the next 15 days, we stayed in some great places. It was just this one hotel that missed the mark.", "Date": "September 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Stafford, United Kingdom", "Title": "“Excellent”", "Author": "Ian M", "ReviewID": "UR117699337", "Content": "My first choice from now on for business trips to Madrid. Convenient, comfortable and excellent staff. My recommendation to anyone staying here is take an upgrade cheap at the price.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“Very nice stay - hotel has character”", "Author": "Av007", "ReviewID": "UR116590783", "Content": "Nice hotel in a quiet area of City. Metro is very close so no problem getting around. I was visiting for CL game at Bernebeau and hotel is within walking distance. Double room was nicely furnished and very comfortable. The lobby has a pleasant bar and nice open air courtyard in back. Service was excellent. Would have no hesitation staying here again on future trips to Madrid.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Alegrete RS", "Title": "“Nice place”", "Author": "AlegreteRSGuga", "ReviewID": "UR116492757", "Content": "It's a beautiful hotel, I've heard it was a Lebanon embassy.The price is good and the hotel is just two blocks from the subway station.The staff is very friendly.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Havana, Cuba", "Title": "“Very good business hotel, well located”", "Author": "dienteperro", "ReviewID": "UR115966677", "Content": "I stayed recently during a business trip in this hotel, the service is outstanding. Everything was according to what one expects: cleanliness, security, food, attention... just two things was on the bad side: 1. the don't even ask for smoker/no smoker room and sent me directly to a smoker one; 2. the furniture needs a recycle, mainly the upholstery.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "", "Title": "“Comfortable Stay in Boutique Hotel”", "Author": "Mme_X", "ReviewID": "UR115224229", "Content": "Quick summary: this was a very comfortable stay, good service. Some might prefer to be a little more centrally located, but it was a quick walk to restaurants, good shopping. Check out the upgrade levels as a nomimal fee often results in a much nicer room. We were here for business purposes, but built in a few extra days for touring Madrid. The location was selected to be near to the company's offices. While there are good options for restaurants and shopping, and a really nice district isn't too far a walk, you might prefer to take a cab or excellent metro system to the major museums. We also liked this section as it seems less frenetic than being right downtown. One thing to know about NH Hotels: this company seems to buy older properties and renovate them to modern standards for a good business class hotel. Since we've stayed at more than one, we've learned to ask about upgrade options and checked a few out. Here, a standard room will likely be small and have a window on the interior atrium. For slightly more than that, you get basically the same rather small room, with an outside window. For slightly more than that, we got a very spacious room with an outside window, separate dressing area, etc. Room #504 is classified a junior suite, but I'd describe it more as a spacious room with a sitting area with sofa, chair, good work desk, etc. The general decor is sleek and modern, e.g. wood floors; blond wood furniture; neutral tones. The king bed was very comfortable, but the bedside reading lights could be brighter. Also: there were the duvets that are often found in hotels these days, which I find too warm, even with the AC cranked up. (Have managers noticed that the AC bills have been higher with the adoption of duvets?) There was a coffee/tea maker, but we often just got tea replaced unless we asked. In-room safe. A nice refrigerator where you could put in a few of your own bottles, in addition to what was in the mini-bar. In this type of room, there is a separate tub and shower in the bathroom, and lots of nice toiletries. The sink is in a dressing area that has an open closet, i.e. no doors that hide the contents of what you brought. Excellent housekeeping throughout. Very helpful, friendly, and professional staff at the desk for tourist help, recommendations, etc. There is free wifi in the lobby, using password codes in 30-minute increments. This works well enough, unless you are in the middle of something when the time runs out. It costs 10+ euro if you want it in the room on a 24-hour basis. There is a nice cocktail lounge for drinks, tea, etc. The breakfast room and restaurant are pleasant. The breakfast buffet has a nice array of breads and parties, fruits and juices, meats and cheese, etc. There are newspapers in the lobby, but all in Spanish. Seek out the steak restaurant La Lenera, a 10-minute walk away. Very good food, and it opens at 8:30 (good to know in late-dining Madrid.)", "Date": "July 10, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Panama City, Panama", "Title": "“Just OK.”", "Author": "JMI75", "ReviewID": "UR113762617", "Content": "The hotel is very old, the elevators got out of order very frequently. Fitness center very basic.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Buenos Aires, Argentina", "Title": "“Though at the outskirts of Madrid, the Metro takes you everywhere!”", "Author": "Cristina S", "ReviewID": "UR113223108", "Content": "Metro is cheap and takes you all arround Madrid. This hotel has excellent service and commodities.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Wheeling, Illinois", "Title": "“meets expectations”", "Author": "JEFFfromChicago", "ReviewID": "UR113093554", "Content": "the rates and location are great. keep in mind a few things, though: 1) as is typical in Spain, the air conditioning never seems to be cool enough, the low/medium/high settings enable you to adjust fan speed but the temperature is fixed.. 2) the inner courtyard rooms are very small it may be worth paying a bit extra to get more size and breathing space. 3) street traffic is loud but that is typical for Madrid. a few other things about the hotel.. The breakfast is absolutely outstanding and first class. Easy access to two metro stops. You can get a cab within seconds. Hotel service is just fine. Wi-Fi works great. All in all, not a bad hotel..", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Northampton, Massachusetts", "Title": "“Ubicacion Perfecta”", "Author": "LMworld-traveler", "ReviewID": "UR109742714", "Content": "Great hotel. Perfect location near La Castellana, but far enough from the busy, noisy part of the city. The bus and metro stations are really close to the hotel. Very clean, spacious rooms and bathrooms. Hospitality was great. I would recommend this hotel and I will stay there again.", "Date": "May 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "sydney australia", "Title": "“A decent hotel in a nice area”", "Author": "julphil", "ReviewID": "UR107358164", "Content": "This is a decent hotel in a nice area although it is at least a 30 minute walk to Prado museum, Plaza Mayor, etc. An easy walk or there are buses or metro. The only thing I didn't like abou this hotel was the room overlooked an atrium and you could here the lift constantly. No iew of outsode. Good breakfast and free wi fi in lobby.", "Date": "May 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Balzan, Malta", "Title": "“Very Comfortable stay”", "Author": "Trevordg", "ReviewID": "UR106655742", "Content": "My wife and stayed at this hotel for three nights in April. We opted for a Junior Suite which was located on the ground floor in the garden area. The room was extremely spacious and comfortable. Not only, but the service throughout was excellent and the breakfast offered ample choice. The Hotel is located at almost a 10 minute drive from the center.", "Date": "May 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Great Hotel-magnifico! Quiet neighborhood near Gregorio Marinon subway. Amazing front desk staff.”", "Author": "Fattycrab", "ReviewID": "UR96766324", "Content": "I stayed at this hotel in Dcember for business for over 12 days. The hotel was perfect as it was low key and a relaxing place to rest after working. The staff is the best feature of this hotel and they are attentive to the guests as well as very friendly. The chain was having SERIOUS problems with their website and they did their best to assist me. The room was clean and very typical of spain. Wood flooring, modernish flooring and a wonderful marble bathroom. The window did not havea view but it was large with light-blocking drapes. In room safes, a mini fridge and of course a TV meant that it was comfortable for more than a few days. The only glitch is their silly wifi system which is free for thirty minutes only in the lobby. A daily rate of 17 Euros is frankly criminal and not acceptable. Neither are the screaming maids, BUT, they are nice and clean the rooms until they are spotless which is great. The NH Abascal is not smack in the center of Bourbon Madrid but then again, if you ahve travelled to Madrid often, you know better. Being in the center, near Sol or the Gran Via is getting a skewed vision of Madrid. I compare the NH Abascal to a hotel that would be found in Kensington, the Upper Eastside or the 7th Arrondisement - understated but efficient. The metro stops nearby connect one to those areas within minutes. Try it.", "Date": "February 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "jersey city, nj", "Title": "“Decent stay”", "Author": "jmgo", "ReviewID": "UR92191042", "Content": "We stayed at NH Abascal only because we won it through Priceline. It's a little far out from the center of the city, but it's close to 2 metro stops (Gregorio Maranon, Alonso Cano - same line). It does not take too long to travel to the city center. Amenities include a gym and a private safe. There's no mini-fridge available. We had a double room which consisted of 2 twin beds pushed together. The room wasn't quite large and there seemed to be a lingering smoke smell from past guests. The bathroom, on the other hand, was quite large; a bidet and full bath were available. The hotel is located in a rather residential area, with other hotels nearby. Generally, it's a very quiet neighborhood. Since we were situated towards the back of the hotel, we were lucky that we didn't hear too many drivers enthusiastically honk their horns on the night that Atletico Madrid won the UEFA Europa Championship. I recommend only if you can get a price that's significantly lower than what is published. Otherwise, if you're a tourist to Madrid, I may recommend staying at a hotel much closer to the city center.", "Date": "January 8, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Berlin, Germany", "Title": "“4 stars - why oh why?”", "Author": "nellcote", "ReviewID": "UR91843888", "Content": "I stayed at NH Abascal with my husband for 5 nights. We arrived late from the airport (the arrival itself was easy, since the location is good) and for some reason our reservation could not be found - maybe because my husband had just upgraded the booking so that we could enjoy breakfast every morning. We were happy to hear that they could find us a room anyway, but once IN the room, the feeling soon faded away. It was just unbelievably noisy! The room was located right above the sliding doors of the hotel entrance and you could here every single car and truck driving by as if you were outside on the pavement. As a bonus you could also hear all the people in the neighbouring rooms. The room was also freezing cold. After a few hours of sleep, we got up and asked for another room. We were offered a junior suite for an additional 15 euro charge per night. Since this room was really quiet (facing the inner courtyard), we were happy to pay extra. Unfortunately this room did not seem to have any air conditioning and the air got really stuffy very fast... And the beds. Oh dear. Could they possibly make more noise when one is just turning over? The bathroom was OK (and really big), the TV seemed to work just fine, the minibar seemed to be as old as the building. And you could still hear all the people in the corridor and in the neighbouring rooms. As others have already mentioned, the free wi-fi (30 minutes in the lobby) is pretty laughable these days. It's very slow and obviously it's hardly pleasant to use your laptop sitting in the drafty, smoke-smelling lobby. All and all - even if you find a good deal for your stay, you may end up paying extra for a less noisy room, wi-fi, breakfast etc. Everything seems a bit run-down, the only good thing being the practical location. Plus the breakfast, which was actually quite nice!", "Date": "January 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Virginia", "Title": "“It's ok.”", "Author": "wel0ve2vacati0n", "ReviewID": "UR91332236", "Content": "We stayed for three nights with other family members plus teenagers, there were 8 of us. We had 4 rooms. We wanted to be closer to the center of the city but a bit quieter. The hotel was easy to get to from the airport by taxi. It cost us about 30 Euros per taxi to the hotel but it cost us about 20 Euros to get back to the airport because of the airport surcharge and was from T4 which adds another 4 or 5 euros. The hotel lobby was small but with character. The carpeted floors were dirty. The rooms were ok. The rooms were a bit dark and can use more lamps. One of the rooms we were given smelled of smoke even though they say it's a no smoking room. We asked for another room and were shown a jr. suite for a 15 Euro upgrade per day. The jr. suite had a small sofa and a coffee table and very spacious. There was not enough lighting in the rooms at night even with all the lights on. The mattresses were on softer side by our standard. The bathrooms were nice and clean. If your angle your shower door inward bit more, water wont splash out to the floor as much. If you are picky like me with toiletries, bring your own. However, they did have everything you would need. The only thing that bothered us was the housekeeper coming into the room as they knock. There was enough restaurants right around the block for us to eat and shop for snacks. We had no issues with getting free internet in the lobby. You just need to get the access code from the front desk when you run out of the 30 minutes. There was no limit of how many you get.", "Date": "January 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bari", "Title": "“Great value for an excellent hotel”", "Author": "Mariella83", "ReviewID": "UR76060512", "Content": "We stayed at NH Abascal for 7 nights. We arrived at 2 a.m and had absotutely no problems in reaching the hotel (the metro works until 1.30 a.m and it takes no more than 20 mins to get to calle José Abascal). We were welcomed by the staff and in a few minutes we could reach our rooms, which were extremely clean and tidy. The bedroom was fully equipped with flat tv, armchair, big cushions on a very elegant bed. Bathroom brand new, spacious and full of toiletries (toothbrush and toothpaste, soap, shampoo and shower gel). superlative international breakfast with an excellent choice of brioches, cakes, biscuits, jams, cereals and fresh fruit, various kinds of cheese and spanish cold cuts (jamon, chorizo and lacon), fried bacon and the famous spanish tortilla (omelette with potatoes). Staff extremely kind and helpful. The hotel was very beautiful, with precious marble decorations on the walls and floors, and a pleasant terrace garden where it was marvellous to rest after a boiling hot day in Madrid. Outstanding value for NH Abascal, where we will certainly come back next time we fly to Madrid. Highly recommended!!", "Date": "August 20, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Great for business, mediocre otherwise”", "Author": "mgharavi", "ReviewID": "UR63753114", "Content": "The 4-star rating this hotel gets is a bit of a stretch. Its rooms are adequate, albeit small. The bathrooms are large and convenient. American travelers will love that the power outlets are built to accept American standard plugs as well. If you're traveling for business in the area the location (predominantly commercial) is great. But for a sightseeing trip like the one my family went on, I'd recommend a hotel closer to the city center. Subway station is about 2.5 blocks away, and the subway in Madrid is very convenient. Via rail, the city center is only a few stops away as noted by other reviewers. The back of the hotel did have some nice outdoor space (common area), which was very relaxing. My experience with the hotel staff was very poor. With the exception of one lady who worked the morning shift (who was great), most of the staff cared very little for customer service. Also, internet access (relatively slow connection) was very pricey, and you only get a free 30-minute voucher if you're in the hotel lobby. Some front-desk attendants were reluctant to give you more than one if you needed more time. The \"gym\" was ridiculous. Just an old bike, a treadmill, and a weight set that is probably older than me and is broken. Locker room consists of one male and one female stall, a la department store fitting room. All in all, in my next trip to Madrid, I won't be staying here.", "Date": "May 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great staff, facilities but not-so-big rooms”", "Author": "DeAj", "ReviewID": "UR61334419", "Content": "My husband ,I and our 4 yr old son stayed at NH Abascal for 2 nights. The location of the hotel is not bad at all as mentioned in some previous reviews. It is just 4 metro stops from Grand Via. Staff is very friendly and helpful. Free internet access in the lounge area is useful. The cons are- very expensive breakfast and not-so big rooms. We booked it via priceline and got it for $77 . I wouldn't complain much.", "Date": "April 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“Good hotel close to metro”", "Author": "justagirl12345", "ReviewID": "UR58073087", "Content": "Good hotel. Not in the old town, but close to 2 metro lines. Access to all the tourist attractions is easy. Nice room. Large bathroom with bath, bidet and toiletries. Beds are fine. No noise from outside. Aircon was not working but we visited Madrid in March, so no need to use it. Room service is expensive. Fridge in the room, no tea/coffee making facilities. Breakfast ok; quite expensive (20 euro)", "Date": "March 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Beautifully restored building, great staff.”", "Author": "Brunikev", "ReviewID": "UR46946867", "Content": "Found this hotel on Priceline, bid $65 and won--and what a deal at that--especially for Madrid! True, the hotel is located a little out of the center of town, but is close to three different metro stops so getting around was really easy. Sure, it would have been nice to be in the old town, but it would have cost twice as much. And this hotel is nice! Well decorated rooms, clean, professional staff and a beautiful lobby made for a great stay--I'd recommend to anyone not bothered by the slightly out of the way location.", "Date": "October 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Ft. Lauderdale, FL", "Title": "“Never again”", "Author": "SoFLTraveler", "ReviewID": "UR39972005", "Content": "This hotel was too far out of the tourist area, located on one of the most uninteresting streets in Madrid. It is a converted bank/embassy with comforable although uninspired rooms. There were only two English channels on the TV. The small staff seemed friendly and helpful. The breakfast service was fair without any eggs--there was a Spanish Tortilla. They did have a decaf expresso machine. If you have business in the area I would stay here, but it's a poor choice if you are a tourist.", "Date": "September 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Great value for the business traveller”", "Author": "rafkam", "ReviewID": "UR25560932", "Content": "Very efficient hotel, typical of the NH chain, this hotel caters to the business traveller as it’s in the business district, on a busy road, a short walk from a metro station and the Castellana. Check in was very efficient and my colleague and I were upgraded to a suite, as the hotel was full. They have a very transparent paid-for upgrade policy, where it costs around EUR 25 to upgrade to each following category (there’s 4 in total). The room was massive, the room décor was a bit sterile but as it’s a business hotel, it shouldn’t be an issue; most important, the bed was very comfortable. Despite having a street-facing room, I wouldn’t say traffic noise was an issue, but then again, I was having early starts. The room featured a huge bathroom with lots of complimentary toiletries and a very big balcony with a sunlounger which I unfortunately failed to make use of. The building itself is beautiful on the inside, as it’s a converted embassy. The bar is nothing special, but it was fine for watching Real play Liverpool on TV. The breakfast buffet had a good variety of food. Will definitely stay here again on business, but maybe not such a good location for a holiday. At EUR 100 per room it’s definitely a steal. My only complaint is that the lift was old so there was a bit of waiting involved at peak times.", "Date": "March 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Finland", "Title": "“I went back and stayed at the airport”", "Author": "Suomessa", "ReviewID": "UR24352143", "Content": "It is a but of an unfair heading because I went back to stay at a gleaming new airport Hilton. However, I would not stay at this hotel again. It is old, uninspiring at best, and terrible value for money. It is a solid 2 star hotel and having not stayed in the NH chain before, I would not do so again. I don't even know how it is possible to charge so much for such a poor experience. It clearly hasn't invested any money in renewal in the past 20-30 years. I should say, the service was fine and I cannot point to anything dramatically wrong (except for the tiny, old TV that didn't work). It was just the sum total of the tiny room (smallest I've seen), 1970s carpet (its age, not its style), underground breakfast in a windowless bunker and the kind of old-fashioned mustiness that gave me flashbacks to roadside motels I experienced as a kid. I don't know Madrid well but it seems like a go-ahead place. There must be better hotels in the center than this. It is a cheap-Charlie experience at 5 star prices.", "Date": "February 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "California", "Title": "“Great Hotel”", "Author": "lov2travelaround", "ReviewID": "UR16468034", "Content": "This was a favorite hotel on our tour. Our first nite in Madrid was at Melia Galgos, which was not as comfortable. This hotel has a great garden area and a fun bar. The food was good and the rooms were very comfy. Very helpful staff that could speak english too. A few restaurants around the corner. Took a taxi to the main plaza and it was about 5-6 Euro. I would stay here again.", "Date": "May 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Rio de Janeiro", "Title": "“Lobby more charming than rooms”", "Author": "brazilianwanderlust", "ReviewID": "UR13299098", "Content": "This is a business hotel located in a business area of Madrid, close to EFE news agency. The lobby is very imposing, much more interesting than the rooms, which are bland and a bit boring. If you are coming to Madrid on vacation I guess there are better areas to stay. But all in all this is a very good hotel for business travelers.", "Date": "February 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Lake Mary, Florida", "Title": "“Nice Hotel - Poor Location”", "Author": "cabowong", "ReviewID": "UR8472852", "Content": "We spent our first week at this hotel. It is located in the financial district of Madrid (not recommended for tourists). We mistakenly selected this hotel as we thought is wasn't located to far from the tourist attractions and offered at a value. The hotel rooms were spacious and very clean. The staff were pleasant and spoke English. We found a better hotel for tourists at the Vincci Centrum for less money.", "Date": "August 22, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Kent, UK", "Title": "“Good business hotel”", "Author": "Mrs Teee", "ReviewID": "UR6052854", "Content": "I stayed here for a business trip and it is good for short stays but not sure about a long tourist stay here. There is internet, use of mobile charger and desk. Bed comfy, bathroom small but clean, room overall rather small. Lunch we had there was very tasty and the courtyard is pretty. However breakfast isn't that good, chairs in public areas not that comfy and bar staff hard to track down! Reasonably well located if OK with short taxis journies or metro trips.", "Date": "November 3, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great Hotel”", "Author": "khjohnson", "ReviewID": "UR3789140", "Content": "I have stayed at several of the NH hotels in Spain and have been very pleased with each and every one of them. The staff is very helpful and friendly. The restuarant in the hotel is under renovation right now but I have a tendency of not eating at the hotel restaurants anyway apart from a coffee. The rooms are clean. My room was at the back of the hotel, with no view, but it was quiet.", "Date": "August 19, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Milan, Italy", "Title": "“Wonderful hotel at great prices in a great location”", "Author": "cla114", "ReviewID": "UR2879475", "Content": "I travel for business quite often and I must say this hotel has the best price/quality ration I've ever seen. Ask for a non smoking room, otherwise can be stinky. For the rest it's just great, it has a good location, near the business area but not far from the center, superior rooms are just great, I had a marble bathroom which was huge, all types of services in the room, and all for 115 Euros. Just a great deal. You can book on the NH Hotels internet site and you will save some money compared to Expedia or others (they were selling the same room for 139 or so).", "Date": "December 14, 2004"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Montreux, Switzerland", "Title": "“Not quite up to standard”", "Author": "nroskilly", "ReviewID": "UR2789234", "Content": "The hotel is close to two metro stations, but sits on a busy road - so ask for a room at the rear if you don't like street noise. The building is impressive, being a converted embassy, but the hotel is aimed at the business market, so it lacks service refinement. For example, during our three-night stay in October 2004 a conference glogged the restaurant and we needed to eat elsewhere - no real hardship in a town like Madrid. Also, our room (which was rather small) had not been prepared properly upon arrival - the bath was dirty and a ripped dressing gown hung in the bathroom. We complained and were met with a rather frosty reply: \"all the rooms are small\" and, \"the manager is too busy to talk to you now\".", "Date": "October 27, 2004"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Relaxed and totally professional hotel”", "Author": "joecaDublin", "ReviewID": "UR2607284", "Content": "The Hotel was clean, fresh and a totally enjoyable experience. The staff were couteous and helpful at all times. They made you feel welcome the moment we arrived. I will certainly be staying at the Nh Abascal Hotel again in the near future.", "Date": "September 29, 2004"}], "HotelInfo": {"Name": "NH Abascal", "HotelURL": "/ShowUserReviews-g187514-d206971-Reviews-NH_Abascal-Madrid.html", "Price": "$91 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Jose Abascal 47</span>, <span class=\"locality\"><span property=\"v:postal-code\">28003</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "206971", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/7b/d5/7bd5b6fb41f480b3a3aa4fb257b768b16large.jpg"}}