{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Excellent location and price”", "Author": "TexanRose", "ReviewID": "UR127136419", "Content": "My wife and I often visit Barcelona and we usually choose hotels close to the city center. This time we stayed at Hotel Barcelona and we were quite impressed with it. The location is amazing (in Paseo de Gracia a few steps from Catalonia Square) and considering the rate/location/quality it is a bargain. The rooms are quite bright and considering the location not noisy at all. Without any doubt we will be satying at this hotel when we come back to Barcelona.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Awesome location, that's it!!”", "Author": "AMoyet", "ReviewID": "UR127097744", "Content": "If you are handicapped move on. No real reception area, rooms are basic but roomy. A/C was not available since they claim it is seasonal. It was warm outside and inside. Open windows were an option during the day to cool the room but not in the evening with all the noise from the street. Not a 4 star in my opinion.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Great located hotel but should be renewed”", "Author": "Jorch67", "ReviewID": "UR126448606", "Content": "I chose this hotel by it's perfect location next to plaza Catalunya and all nearby services around (restaurans, cafeterias, transportation and so on.. Aerobus 1&2 stop is about 200ft away :) Hotel looks very old from outside and it's sound insulation is poor like about 75% of south european hotels seams to have. Room itself is ok size for one person but for two persons there would be small problems to fit two luggages open at the same time. Room is clean and seems to had somekind of renovation in last few years. Service in this hotel is mystery, there is bar in downstairs but there is no information what so ever in the room when it's open and whats available there. People in reception is polite and very quiet persons and you don't get any info about anything without asking of it. I'm almost shure I'll be using this hotel again but the star rating should be dropped to 3-stars!", "Date": "March 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Hong Kong, China", "Title": "“Great location but the place is quite old”", "Author": "LaradY", "ReviewID": "UR125113381", "Content": "We stayed here for business. The hotel location is great : few steps away from plaza de Catalunya, so that you can go out in the evenings and still be close to the hotel. Rooms are quite spacious and equipped with basic facility. Furniture and fittings are well maintained and clean but belong to the fifties. The Tv is only showing Spanish programmes so don't expect to see the news in english during your stay. Breakfast is a decent buffet. Service is amiable and efficient. Overall ok but not for that price I believe.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“Didn't meet my expectations”", "Author": "salatapi", "ReviewID": "UR121906750", "Content": "I had stayed at two other HUSA hotels in Seville and Madrid and they were perfect in almost every way. When I got here, though, I realized this would be a different experience. It's not bad, the location couldn't be better; but even though it has been remodeled like it's shown in the pictures, it still has an old \"feeling\". We had booked two non-smoking rooms but one of them smelled like \"disguised\" tobacco and the smell didn't go away even after three days of having the window open. The beds were a little hard too. Everything else was good.", "Date": "December 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cairo", "Title": "“Perfect location and friendly staff”", "Author": "Ramy_Ahmed", "ReviewID": "UR121897837", "Content": "Perfect location 1 min walking distance to the heart of Barcelona, all public transportation and touristic attractions, friendly staff and reasonable quality", "Date": "December 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "France", "Title": "“right price/service & great location”", "Author": "glag", "ReviewID": "UR121107117", "Content": "Spent two nights there on a business trip. Perfect location and nice service.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“amazing location,good rooms good service”", "Author": "Idanama", "ReviewID": "UR119790765", "Content": "We stayed in husa barcelona for 8 days, the thing about barcelona is location, husa has it. it is near the rambla about 2 minutes walk , it is very close to the metro station. The breakfast is nice, feels like home :) the staff is very polite and helpful! the only thing that we didn't like is that you need to wait few minutes for the hot water in the showers and there is no heat mode in the air conditioner.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Weare, New Hampshire", "Title": "“Extremely Noisy - even with earplugs!”", "Author": "NHBookworm", "ReviewID": "UR106200441", "Content": "I guess it depends on what you're used to. If you live in a city and can sleep with a lot of traffic noise, then you wouldn't mind this so much. I always travel with one of those portable sound machines and earplugs. I usually don't need them, but I used both at this hotel and with the window/slider firmly shut and locked, the noise and vibration from traffic all night made it impossible to sleep. The mattress was cheap, hard and uncomfortable. It was a rough night. We had family in another room and they had the same experience. If you decide to stay here anyway, ask for extra pillows as soon as you check in - both to make the bed more comfortable and to block your ears; bring your own conditioner and soap; bring earplugs; also ask for extra towels since they're very thin so you'll need more than one. Breakfast is included and edible if not tasty. I don't remember ever staying in a worse hotel than this. Seriously.", "Date": "April 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NY", "Title": "“Excellent!”", "Author": "logan33961", "ReviewID": "UR104842931", "Content": "Stayed for 3 nights, front desk was very accommodating. Hotel is situated in City center. Block away from Catalunya Square and 2 blocks from La Ramblas. Our room was big and clean, but the hotel is not handicap and stroller friendly. Do not use taxi going back to the airport. There are Aerobus available every 5 min starting 5:30 am, just a block away from the hotel Husa and it will cost 5.30 euro each person compared to taxi that will cost 24.00 euros and a maximum of 4 passengers only in a taxi which they strictly enforce. Tipping anywhere is optional. Buy a 2 day pass for hop on hop off tour its cheaper, only 30.00 euros. Preferably use Barcelona tour company.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Larnaca", "Title": "“Great Location.Very noisy at night”", "Author": "kalypso4", "ReviewID": "UR101419460", "Content": "Stayed here for 3 nights. The room was very hot so we had to open the window and as the streets are cleaned and rubbish removed at night, there was a lot of street noise until about 4am. Great location for getting around. Mini bar was poor. Room & bathroom were clean and adequate. Great cafes opposite. Taxis are cheap. Give the driver the address rather than name of Hotel as they use GPS.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location!!”", "Author": "floserrano", "ReviewID": "UR98081738", "Content": "The location of the hotel is excellent!! Near the aeroport bus stop, just off Placa Catalunya, near La Rambla and there's a nice coffee shop just across the street called \"Bracafe\". The room is spacious for the three of us, and the bathroom is huge! The room is clean; there's a mini fridge,a roomsafe and the bed is comfortable. The staff speaks english so that is very helpful. I would definitely go back...", "Date": "February 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Right in the Heart of Barcelona”", "Author": "Peggy_Pegster", "ReviewID": "UR81425742", "Content": "Great location, big room (it was a suite), with a big bathroom! Everything is right at the doorstep....we were staying in a suite with huge balcony overlooking Placa Catalunya! You get the occasional traffic noise from the main roads below..otherwise, we slept really soundly.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Delhi, India", "Title": "“Very central”", "Author": "Anil-from-Delhi", "ReviewID": "UR70980673", "Content": "Centrally located next to plaza catalonia and Ramblas, this a quite nice property with basic amenities. Good value for money and comfortable to stay in. Generally quite location even while central. Walk to the metro, Ramblas, Gothic quarter or not very far from Sagrada familia. Get down the hotel to take a bus ride to La Roca Village for some low cost high fashion shopping. We also took a ride to Park Aventura, which was fun.", "Date": "July 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Altos, CA", "Title": "“Great hotel, great location”", "Author": "Gilmann", "ReviewID": "UR70677918", "Content": "Family room was quite suitable for family of four, while main beds were quite comfortable, the sofa bed was...well a sofa bed. Great value though. A/C was having a bit of trouble keeping up with July heat.", "Date": "July 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Skegness, Lincolnshire", "Title": "“Great value Graet location”", "Author": "JCA01", "ReviewID": "UR63961875", "Content": "If you are looking for a central hotel, look no further! The location is ideal just off Placa de Catalunya. Aero bus stops only 150 metres away 5 euros each way. Plenty of food options near by and they are well versed in English. The Hotel is clean and the staff all speak English. Not the most palatial rooms we had a 7th floor with balcony and could look over Catalunya square 45 degrees to the right. Will stay again next time in Barcalona.", "Date": "May 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "england", "Title": "“Great Location”", "Author": "seafront100", "ReviewID": "UR60744334", "Content": "The best thing about this hotel is the location. Really easy to get around from here as buses, metro, tourist buses and taxi's are all close by. We had a superior twin room with a balcony. Room ok. Mini bar,TV with basic channels. The hotel bar was not open while we were there. Breakfast was the same every day, basic continental style. Coffee came from machine. Very small lobby. Staff were helpful. I am sure you could get the same service anywhere around the area. Nothing very good nor very bad to say.", "Date": "April 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Enjoyed Our Stay”", "Author": "valbres", "ReviewID": "UR53026667", "Content": "GREAT location. Shops, restaurants, Metro stations, Las Ramblas--everything is just a few steps away. Clean, comfortable, refrigerator, room safe, WI-FI. Nicer than I expected and a bargain for the price. Great coffee shop across the street too, Bra Cafe (Bra as in \"Brasil\"--not brassiere)", "Date": "January 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Toronto", "Title": "“Amazing Location, Good Rooms”", "Author": "mbilal84", "ReviewID": "UR40202170", "Content": "I cannot stress on the location in this matter.. its just PERFECT.. right in the centre.. by the la ramblas and Catalona square.. its about a 10 minute taxi ride from Barcelona Sants train station and about 20 minutes to the airport. There is a bus that run strictly for the airports right by the hotel and its 5 Euros per person.. its a express bus so no stops on the way deifnatley worth it else you will spend about 35 euros on a cab ride. the buses are very roomy and brand new so enough room for you luggage. I did not have any noise issues unless i decide to leave the windows open. But honestly there are no noise issues or safetly issues. Front staff is very helpful and speak fluent english. Rooms were above average. The only thing one thing i did not like was the price factor. i think it was a bit over priced. But seriously, considering the location it makes up for it. The metro is literally 2 minute walk.. there are also tourist buses passes that you can at a 2 euro discount and the tourist buses stops are about a 2 minute walk as well. I would recomend you get a pass for the double decker tourist bus as its a one day pass for 19 euros you get from the hotel and its valid for a full day of travel with unlimited hop-on and hop-off. Its the best way to discover Barcelona as it stops at every attraction and you could choose to stay on the bu too and they have guided audio that can walk you through everythign and tell you about every attraction. Washrooms were decent and very clean. No other issues in the hotel or the rooms. Free wifi.. The rooms have a nice spacious balcony with a table and a chair set up so you can get an a mazing view and enjoy a good cup of tea. I would highly recommend it.. honestly book it in advance and get a good rate but definately stay here because of its location. Would i stay here again? DEFINATELY.. its worth it!!", "Date": "September 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Run away”", "Author": "londontravellista", "ReviewID": "UR39986372", "Content": "I am researching for my future trip to Barcelona and just noticed that Expedia still advertises this hotel on their site despite the numerous problems I encountered in the past. OK, the hotel has a great location right near Las Ramblas but so do many other hotels nearby, lower priced. Negative things: - if there is a day party in the square, the music can be clearly heard in the room (top floor with good views from the balcony) but no double glazing - so headache, all the way - the hallway on the top floor is very narrow with an entrance in the room you would expect in a 2 star hotel, very weak-easy to break through door, a basic room with the lines of a 2-3 star hotel and a shady bathroom, definitely not 4 star Conclusions: maybe others had better experiences on the lower floors but if you want quiet, safety and peace during your Barcelona trip - probably would be best to stay from the hotel, just the way I will in the future.", "Date": "September 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Co. Galway", "Title": "“GREAT LOCATION & VERY CLEAN!!!”", "Author": "cunga22", "ReviewID": "UR37550686", "Content": "Located just off Placa de Catalunya & short walk from Las Ramblas. The hotel is well kept & very clean. The hotel doesn't have alot going on (i.e. music in the bar etc) but there is no need to hang out in the hotel because there are so many great bars & restaurants in Barcelona. Overall I was very happy with my stay & would recommend this hotel to friends :-)", "Date": "August 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Libertador", "Title": "“Completely satisfied with the Husa Barcelona”", "Author": "Libertador", "ReviewID": "UR37291316", "Content": "My wife and I spent four days here and we were very pleased with the hotel. Staff was friendly and responsive. Free Wifi was nice and the location is on a quieter side street only yards away from the Plaza Catalunya where you can begin your strolls down Ramblas or hop on the subway to hit anywhere in town. I spoke with several locals during our stay and when I mentioned to one where we were staying he said \"oh, that a four star, probably the best value you can get in Barcelona and in the best location.\" Parking was available at a nearby lot for 20 Euros a night. I'd definitely stay there again, although I wouldn't take the staff's recommendation to eat at the Catalan place down the street (El Glop).", "Date": "August 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Israel", "Title": "“Good Location, Good Service, Had a good time”", "Author": "Udi-B", "ReviewID": "UR36420832", "Content": "The hotel staff was extremely nice and helpfull and it made the stay much more comfortable and pleasent. Very good location (just next to plaza catelunya). Breakfast was satisfactory besides the coffee (no espresso or latte). Rooms are spacious, overall, I would recommend this hotel to my friends.", "Date": "August 1, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Arizona", "Title": "“Disappointed with Husa Barcelona despite nice location”", "Author": "K_Christo", "ReviewID": "UR35561218", "Content": "Husa Barcelona was disappointing. I would definitely try another hotel before this one again. There are many beautiful hotels near Husa Barcelona that it would be worth the extra money to go elsewhere. The TV did not work, the hotel computer did not work, and there was no Wi-Fi; there was no alarm clock and they forgot TWO wake-up calls which delayed our sight-seeing quite a bit; you have to ask for soap/shampoo. It was not a relaxing place to call home for a short visit. The shower was nice, but bring your own soap! The location isn't bad as it is within walking distance of the top of La Rambla, but there are probably ten hotels that are just as close. Check out Avenida Palace first.", "Date": "July 23, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "wexford", "Title": "“Location but thats all”", "Author": "bond1970", "ReviewID": "UR31585579", "Content": "Firstly good location, no doubts in the middle of everything. However the lobby is tiny, the service is average. Not much happened in the hotel, you would very rarely see anyone around at all. I think they had a bar but no one seemed to be serving. I was confused at what i was staying in to be honest, very starnge. A holiday is made by the place you stay and this place was dead. where were the staff. The rooms are a diaster. The rooms were smelly, the floorboards were lifting, but the biggest thing were the thin walls. I mean you are lying down just about to go asleep and next thing you think someone is having a pee on you. Next doors toilet was next to our beds wall. I couldnt believe it, the noise is so clear its hard to get out of your head. I was never so glad to get out of there.", "Date": "June 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "york", "Title": "“Location good, but never 4 stars!”", "Author": "matthew7York", "ReviewID": "UR29520490", "Content": "This hotel is OK. Its clean and tidy and the rooms are comfortable, if rarther small. The location is good - just off Catalunia Square, at the top of Las Ramblas. The hotel should never be rated 4 stars though. I would say its a good 2 star hotel. There is no pool, no bar, to balcony, no tea/coffee facilites, and the reception area is tiny. The breakfast at €15+tax was not great. The hotel was very noisey at night.", "Date": "May 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Great location, helpful staff but sparse amenities. Is it really 4*?”", "Author": "Lizconsultant", "ReviewID": "UR27166579", "Content": "The location is great - close to Plaza Catalunya and Las Ramblas and also to Gaudi's La Pedrera and Sagrada Familias. The reception staff were also really nice and the housekeeping staff do a great job of keeping the rooms spotless. But, the lack of a photo of the lobby in the Hotel details is a clue. The lobby is tiny! There is no hotel bar and we also had no mini bar in our room. Honestly we are not alcoholics but are used to being able to enjoy a quiet drink in the evening in our hotel! The restaurant is limited to breakfast although to be fair the area is awash with great places to eat in the evening but again it is nice to have the option of dining in the hotel. There was also no sign of the in-room WiFi and the hotel's single PC with Internet access was not working - a pain if you want to print off your boarding cards in advance! I don't believe this hotel with its limited facilities is 4*!", "Date": "March 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "orlando", "Title": "“loved this hotel”", "Author": "natasha-neil", "ReviewID": "UR23593553", "Content": "Great location! close to everything! Few metres away from Metro and the Ramblas... Desk staff helpful but not very knowledgeable. Would stay there again.", "Date": "January 15, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dorchester", "Title": "“Good hotel, great location”", "Author": "dorchcouple", "ReviewID": "UR20964730", "Content": "We stayed for three nights at the Hotel Husa Barcelona in October 2008. Found the hotel on lastminute.com who had a special offer of stay two nights and get the third night free so a real bargain and a great location just off Placa Catalunya at the top of La Rambla. We were on the 7th floor and had a balcony which was a great addition to the room. Bit noisy being at the front of the hotel because of traffic but that would be the only down point. Bathroom was OK, though shower could have been more powerful. Not sure that it is really 4 star as stated but definitely a good 3 star. Could do with a bit of a redec in places as some furniture was looking a bit tired. Would definitely recommend at the price we paid but a bit expensive if we had paid full price.", "Date": "October 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cumberland", "Title": "“Top spot!”", "Author": "sheepshagger", "ReviewID": "UR18489064", "Content": "Nice looking building looking over the Plaza di Cataluna. First rate rooms, excellent en suite (unlike many Barcelona hotels, the bath is a decent length). And off season it was really good value for a 4 star hotel -only €80 per night.", "Date": "August 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Central Location”", "Author": "Travelsl0ts", "ReviewID": "UR18435886", "Content": "Centrally located hotel which is in a side street off Placa Catalunya. It is not on the square as described in some websites! Rooms are spacious, simple and clean. Not luxurious but adequate. Separate toilet and shower/sink rooms. Room service very good. More of a three star than a four star hotel but fine for a visit to Barceklona for a few nights. Staff were always courteous and helpful. Didn't use breakfast facilities as I thought it was a bit expensive at 14 euros per person. Plenty of other options for this outside. Would use again but not if you are looking for a bit of luxury to your stay.", "Date": "July 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Norfolk", "Title": "“Husa Barcelona Is Awesome”", "Author": "nseaman", "ReviewID": "UR16638052", "Content": "I have stayed here twice and it is the best value for money hotel i can find bang in the centre of Barcelona ! The rooms are clean and tidy and very spacious The hotel staff are great and very helpful with everything Book this hotel for a hassle free city break in the best city in the world BARCELLLLOOONNNAAAAA !", "Date": "June 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gilbert, Arizona", "Title": "“Wonderful hoel with a great location!”", "Author": "worldtravellover", "ReviewID": "UR8851237", "Content": "My husband, myself and 7 mth old daughter stayed at the HUSA Barcelona from Sept 16 to Sept 20, 2007 in room 511. We were lucky enough to get a room with a balconey, as not many of them have one. We spent the majority of our evenings sitting out on it watching the people down below. I think all the rooms ending in an -11 or -12 have balconies, which I highly recommend. The room was very spacious and clean. The breakfast buffet was a delicious continental spread and the dining hall was well taken care of by the attendant. The location was outstanding, near the top of the La Rambla...we walked from the hotel to the Sagrada Familia, Torre Agbar and to Port Vell. Pretty much all of the sites are within walking distance of the hotel. The staff was friendly enough, but there was, at times, a breakdown in the language barrier; their English not being all that great and my Spanish not existing at all. Despite this small problem they were very helpful and answered our questions to the best of their ability. I only found a few things disappointing regarding the hotel and that was: the size of the lobby compared to the picture on the internet, no handicap ramps for our stroller and the lack of a bar even though there was a sign saying that the bar was on the first floor. I posted a picture of what I think they may consider a bar (vending machine with beer in it). ;-) Regardless of these small flaws we loved the Barcelona, will recommend it to friends and will definitely stay there again.", "Date": "September 22, 2007"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Great Location, Simple and Friendly Hotel”", "Author": "OphirBY", "ReviewID": "UR8255389", "Content": "The hotel is a simple 4 star (actually 3 stars in my opinion) located smack in the middle of the Plaza Catalunya, Barcelona's tourism center. 5 Minutes walking from Las Ramblas, 10 minutes from the Barri Gotic (old city), 20 minutes from the Segrada Familia Cathedral. Subway station is nearby, maybe 3 minutes walking. Bus to the airport is also nearby about 2 minutes walking. The hotel is simple, with a small lobby. Rooms are large and adequate and face the street which can be very noisy at night. Air condition, TV and other amenities work fine, but the room still seems very simple. The staff are extremely friendly and take their time explaining everything in detail.", "Date": "July 29, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Aussie in London", "Title": "“Great location, comfortable room”", "Author": "Puginspace", "ReviewID": "UR8138202", "Content": "The hotel is in a great location. Less than a minute's walk from Placa Catalunya (where the airport bus begins/ends) and only a couple more to Las Ramblas. It is also very handy for the Exiample area. Our room was spacious, much more so than many European hotels we have stayed in. Both room and bathroom were very clean. Staff were friendly. I would stay here again on a second visit to Barcelona.", "Date": "July 17, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“Split decision”", "Author": "lexycal", "ReviewID": "UR7707908", "Content": "We stayed at the Husa Barcelona from May 20 - May 25th 2007. For the price of the room you expect a doorman to at least help with the bags...nope. The front desk people were friendly enough and helpfull with tourist information although the morning front desk mananger seemed to have a really bad attitude most days. It was really nice that the hotel offered breakfast each morning from 7am-11am free of charge. Great location to all shops and La Ramblas (great tourist walk). The bad part was the room. It looked much better in the pictures on the website. You could hear the people on the balcony clear as a bell in your room. The doors are pretty thin as well. Oh and don't let me forget the bed bugs. From the first day to the last they got worse. My arms were eaten alive. I really didn't know what was bitting me at first because it was one or two bumps. By the end of the week my entire forearm was a mess. Upon checkout I told the front desk person and guess what.. for the first time it seemed they didn't understand english. Word for the wise when traveling remove all covers from the bed and request new ones. All in all not a bad place to stay.", "Date": "May 28, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Espoo, Finland", "Title": "“Location good, otherwise only ok”", "Author": "pinkilili", "ReviewID": "UR7641315", "Content": "I stayed a few nights at the Husa Barcelona with my hubby. The room was spacious, on the top floor, with a nice little balcony. The decor was very neutral, your average hotel style, didn't make an impression. The biggest problem was the bathroom which smelled damp and mouldy - it was an extremely strong smell, which really had an effect on the atmosphere of the room. In the end we decided to change hotels. The lift didn't always work but I'm not complaining since walking the staris is good excersice :) The breakfast was nice, you'll be ready to tackle the sights after it. The service at the front desk was friendly and we were always greeted with a smile. Husa Barcelona is located right in the city center on a quiet side street. It's a walking distance from almost all the interesting sights and there's a metro station close by. Check out the small bar right opposite the hotel if you want to stay away from the really touristy bars :) No English was spoken there but don't worry, you'll get your point across! Barcelona is such a wonderful city with so much to see that you won't be spending much time in the hotel, so locationwise I'd say go for the Husa but if it's atmosphere you're after - forget it!", "Date": "May 18, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stansted, UK", "Title": "“Good location”", "Author": "Sue60", "ReviewID": "UR7245428", "Content": "We liked this hotel,(24-28 March 2007). It's so well located near the top of La Rambla, we walked to the cathedral, Casa Battlo, Casa Milia, the sea, Palau de la Musica. The staff were pleasant & helpful & spoke English as I'm ashamed to say we only had a few words of Spanish/Catalan between us. We were on the 7th floor & our rooms had outdoor terraces with chairs & tables. Our friends in 707 & 710 had a good view over Placa de Catalunya but we had asked for a quiet room so were put further along the street, away from the busy square. The double glazing was good so the rooms were quiet . They were comfortable & clean with a pleasant breakfast room.There was a buffet of fresh & tinned fruit (this could have been a bit more imaginative),4 types of cereal, yoghurt,cold meats, cheeses, breads, hard boiled eggs, scrambled egg, bacon & sausage, various delicious looking croissants & pastries.So plenty of choice. We'd have used the terrace more if the weather had been warmer,as there's a great market about 10-15 minute walk away off la Rambla so you could buy lovely fruit etc. If your room doesn't have its own there is another terrace with tables & chairs on the 7th floor. It was a good base & we got the 4th night free, booking with Expedia. We'd certainly consider this one again if we go back & there's lots to do & see that we didn't have time for. Do look after your money & cards in Barcelona. Our friend who travelled separately from us had her purse taken from the bottom of her zipped-up bag that was over her shoulder, at the bus station as soon as she arrived. At the police station she met someone else who had her bag taken when she put it down to get her case out of the bus, & at the hotel was someone else who had something taken while she was out. My neighbour had her bag snatched from off her shoulder last year. It's worth having a bag or camera on a long strap that can go across your body & you can hold it on the front, with the opening on the inside.I had small amounts of money in different zip pockets in my bag & in a body belt, & didn't take a purse. The hotel room had a safe, 10 euro returnable deposit for the key. Don't be put off going to Barcelona though, hope you have a lovely time.", "Date": "March 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York Area", "Title": "“Loved it!! Recommend it warmly”", "Author": "dream_e", "ReviewID": "UR6802691", "Content": "The hotel staff was very friendly and nice. Our room was cleaned every day. The breakfast was delicious. The room was a little spartan but it was well worth the good rate we received. The location is amazing. We easily walked everywhere and the metro station is just across the street. See if you can request room 710. It is a smaller room with one King sized bed. However, it has the most lovely balcony with a gorgeous view of the old city. We stayed up on the balcony people watching for hours. It was magnificent.", "Date": "February 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Great Hotel”", "Author": "stew1975", "ReviewID": "UR6725158", "Content": "Excellent little hotel in a great location for the bars and restaurants of Barca. Would def go back!", "Date": "February 1, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Newcastle, England", "Title": "“Excellent Location”", "Author": "geordiepalie", "ReviewID": "UR6018516", "Content": "We have just got back from a mini-break , 3 nights in Barcelona. When we arrived at this hotel the staff were helpful. We were welcomed and given our key to our room. Our first expression was this wasn't a 4 star hotel. The size of the rooms were spacious enough, the decor was a bit let down. The bathroom and W.C was separate. The hotel maids were very good, cleaned rooms everyday, clean towels available everyday and also changed our bedding in the duration of our stay. The location was excellent as it was very accessible to the centre of catylan square and fanstatic shops located near by. Plenty of restaurants within walking distance. We had arrived by taxi as we weren;t sure of location, but travelling back we took the Airport bus which is literally few minutes walking distance from the hotel and it only cost 3.75 euro's per person. This was our second visit to the beautiful city and I can say the location was perfect. We had breakfast booked separately which we stayed for one morning. Many choices available. The beds were comfortable but we found it was it abit noisy with traffic late at night and early in the morining which woke us up. There was a mini-bar available but no coffee facilities in the room. Not to worry as there plenty of coffee houses located near by, and one across the road. There is also a theatre across the road, we were lucky we had a room with trees giving us privacy from the bright lights. I would recommend this hotel for it's location and average cost £70 for the night.", "Date": "October 27, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "2", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Israel", "Title": "“Good hotel, Excellent location”", "Author": "Ori_S", "ReviewID": "UR4972854", "Content": "We spent 5 days at Husa Barcelona hotel for a family vacation. The room was big enouch with 2 beds combined to a double bed and one bed for the child. The room was clean and the bathroom was well equipped. We had a nice balcony facing the street and a minibar that we did not use. On the downside there was no English channel on the TV. Even the CNN was in Spanish, and a coffee maker in the room could be a nice addition. The breakfast that was included in our rate was just excellent. It included 3 types of fresh juice and a nice choice of hot drinks. Eggs, bacon and sausages, a selection of cheeses and cold meats, vegetables and fruits, cereals and excellent morning pastry and cakes. The staff was very friendly. On top of all that- the location of this hotel, right at the Place de Catalunya, is just great. It is a minute of walking from many good restaurants, bars and shops as well as a metro station. Very convenient to take a short rest after walking down Ramblas avenues. We would certainly recommend this hotel to friends going to Barcelona.", "Date": "April 14, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "London England", "Title": "“Good Value, Good Location ”", "Author": "A TripAdvisor Member", "ReviewID": "UR4953544", "Content": "I don't know what some people expect, but I found it excellent value for money. We paid £516 for a twin room for five nights - it was recommended by a travel agent - a proper travel agent not just one who hands out brochures. We were a bit surprised at the minute size of the reception area having looked on the web site it looked quite spacious. One of the young men behind the desk took our cases - perhaps because we were two ladies on our own - put them in the lift and we set off to our room. The lighting system is rather eccenric, every time we turned something on we turned something off, but it just amused us. The bathroom was small with over the bath shower and vanity unit with a big mirror and excellent lighting - handy for make up etc and a hair dryer. A plus point was the separate loo and bidet across from the bathroom, very rare for a hotel of this size. It was just a minute from Placa Catalunya with buses and Metro close by plus El Corte Ingles department store which to us spoiled Londoners didn't have any of the style we are used to. We asked the receptionist on the first night to recommend a restaurant fairly close by and he suggested one about 20 years away which was excellent Catalan food. He didn't give us a card or tell us to say Jose sent us so that he would get a kickback. The breakfast was very good with plenty of choice of breads, cakes, cereals, jam, honey, ham, cheese even olives! Tea was a bit weak but we had taken the precaution of bringing a few English tea bags with us. There was bacon and scrambled egg for those who have to have the hot breakfast. On the morning of our departure we struggled down to the mezzanine level with our suitcases - one of the guys came out from behind the desk and said we should have left them in the room and they would have fetched them later. he luggage room was full, we went back after lunch to get our bags, they ordered a taxi for us and took our bags out to the taxi. We did wonder on our first evening where the bar might be, but as there was a very nice little bar bang across the street, it didn;t really seem to be a problem. They have conference facilities there - maybe the bar is opened then. We seemed to have had a totally different experience from others with the staff, but the Spanish are a sort of insular race they are not like th Italians who always want to make a fuss of you. Another point unless you are paying top dollar you are always going to find city hotels in Europe small - I have stayed in dozens of hotels all around Europe and for value for money and pleasant service - I would rate the Husa Barcelona quite highly Perhaps some times if you approach the staff in a courteous way they will be more courteous and helpful to you. A FREQUENT TRAVELLER LONDON", "Date": "April 9, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Cologne", "Title": "“central - not more”", "Author": "planettom", "ReviewID": "UR4163806", "Content": "I can only say the same then I read before, it's not a 4 star hotel. It's a middle 3 star hotel. The area at Pl. Catalunya is perfect. My room was small and the TV has no german channels. If you get a good price to stay there it's ok. Last time I was also in some other 3 star Hotels in BCN, they were better.", "Date": "December 5, 2005"}], "HotelInfo": {"Name": "Husa Barcelona", "HotelURL": "/ShowUserReviews-g187497-d206927-Reviews-Husa_Barcelona-Barcelona_Catalonia.html", "Price": "$137 - $253*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Caspe 1-13</span>, <span class=\"locality\"><span property=\"v:postal-code\">08010</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "206927", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/cb/42/ac/room-terrace.jpg"}}