{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "home", "Title": "“The hotel that made our trip a sucsess”", "Author": "orentw", "ReviewID": "UR127174649", "Content": "This hotel is located out of the city center what make it quite and warm place to come back to after a long walking day in the beautiful city of Barcelona. The staff especially the front desk of the hotel gave us good recommendations for places you can not find on the web, only local knowledge like they have. All the places the front desk send us were really great local places very authentic. The flamenco show, fish restaurant, the mall were all great. Thank you all at Laumon hotel you really made our trip great", "Date": "April 3, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sofia, Bulgaria", "Title": "“Modern and cheap hotel”", "Author": "Yavor", "ReviewID": "UR125839893", "Content": "It is a new , modern hotel. 5-minute walk from a subway station and in a quite neighbourhood. Prices were really good. The only problem was the room size - too small for 2 adults and a child so pick carefully", "Date": "March 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Devizes, United Kingdom", "Title": "“LOVE THY NEIGHBOUR”", "Author": "jobberdave", "ReviewID": "UR124765790", "Content": "On the surface this is a great hotel with stylish contemporary interiors, with friendly staff, easily within 20 mins of the centre of the city. However, the contemporary approach means hard surfaces which mean noise travels around the Laumon. If neighbours are loud you can hear every word. And whilst the aircon system is fantastically inobtusive if people smoke in their bedrooms you will be smelling it too.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Very nice modern hotel”", "Author": "Luke4508", "ReviewID": "UR121194304", "Content": "The hotel is less than a year old. Very nice modern interior. Perhaps not the best location, but the Barcelona metro is very cheap to get around and there is a station extremely close. I stayed on the first floor, so I didn't have a view. I heard some rooms have terraces. I thought it was amazing value for money.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Chattanooga, Tennessee", "Title": "“Excellent hotel away from the crowds, close to the Metro stop and 10 minutes from the center city!”", "Author": "bdkidsrn", "ReviewID": "UR116896157", "Content": "My husband and I are just completing our 1st trip to Barcelona and are staying at the Hotel Laumon. This is a new, modern hotel for the traveler interested in clean, efficient and quality service. We are visiting our daughter in the Sant Andreu neighborhood which is away from the Center City of Barcelona. The La Sagrera Metro stop is only 2 blocks from this hotel and 8 stops from the city center or 15 minutes. The neighborhood is a nice , quiet residential area with very good restaurants within a block or two. The service at the hotel is excellent, courteous with a good English speaking staff which was helpful in giving directions and other info. A adequate breakfast was provided in the hotel's dining area which included fresh fruit, cheese, meat, pastries etc..the room is a bit small for some tastes but large in comparison to other hotels we have stayed at in Europe. With a separate full bath-shower and large closet. We will stay here on our next visit!", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Scotland", "Title": "“Barcelona - A splendifirous city”", "Author": "Chrisandpat1", "ReviewID": "UR116717550", "Content": "For us as over 60's and overweight the time of the year meant it was too hot and we had to queue for every site we visited, sometimes for nearly two hours eg the Nu stadium and the Basillica. In most places toilets were inadequate for the crowds that gathered. However Barcelona is a city not to be missed the buildings are wonderful and La Ramblas is vibrant at all times of the day! We were grateful that Hotel Laumon was quieter and out of the centre - a haven after very busy and full days and only a stones throw from the Metro.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Limassol", "Title": "“A new and nice hotel in Barcelona!”", "Author": "tourist1025", "ReviewID": "UR110787811", "Content": "As a personal opinion, this can be a very good option for tourists in Barcelona. Laumon Hotel was just opened this year (not even taxi driver knew its location). Hotel it is very clean and room size acceptable. Staff was very friendly and helpful (an A plus for Elizabeth) and speak very good English. Metro station Sagrera is only 200 meters walk and from here you can go to city center in 10 -15 minutes. Good and non expensive breakfast, but you can enjoy a lot of caffes in the area. And if you are lucky, a bird will wake you up every morning - best music - We want to come back for sure!", "Date": "May 31, 2011"}], "HotelInfo": {"Name": "Hotel Laumon", "HotelURL": "/ShowUserReviews-g187497-d2079966-Reviews-Hotel_Laumon-Barcelona_Catalonia.html", "Price": "$91 - $156*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">C/ Monlau 8-10</span>, <span class=\"locality\"><span property=\"v:postal-code\">08027</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "2079966", "ImgURL": "http://www.venere.com/img/hotel/5/4/7/4/354745/354745.jpg"}}