{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Good option to explore HK Central”", "Author": "KiwilExplorer", "ReviewID": "UR139866133", "Content": "Nothing like living like a local - The Mercer is situated in Shueng Wan - buzzy by day and quieter in the evenings.....3 min walk to the MTR & Trams + 5-10 mins up the hill to Soho's bars & restaurants plus great local food nearby. Enjoyed a 1 bedroom suite with great amenities - love the Nespresso and complimentary minibar + wifi. Room spacious by HKG standards. Staff pleasant. Only down side was the breakfast - needs improvement as it appeared had just come out of a box. Would consider another visit.", "Date": "September 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“Good hotel but small details make it average”", "Author": "ARessano", "ReviewID": "UR139222020", "Content": "Small details can make a difference for the good and the bad. Overall, the hotel is a good one. Competitive prices, rooms are of good size and nicely decorated and location is excellent. Staff was very friendly although sometimes service was a little bit lazy (we asked for some ice and we were just told to use the small ice cubes in our mini bar). However, the hotel could improve in some details that easily turn off the guest: (i) when i booked my room directly at the mercer website i was not told that the some areas of the hotel were undergoing renovation (swimming pool, restaurant, lobby, etc). Although the front office quickly upgraded us to a suite as i complained about this, I still think an honest advanced warning is the best policy; (ii) rooms need proper window blinds; the one we had barely covered the entire window and thus we woke up early with the morning sun light; you wont get a satisfied guest if he/she cannot sleep properly (iii) while our bedroom tv set did not have any international channels nor a dvd, the other tv in the kitchen included all these features; for such small rooms i dont see the need for two TV sets but if you insist on this \"luxury\" i am certain the guest will enjoy it much more while relaxing in bed;", "Date": "September 3, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Skipton, United Kingdom", "Title": "“Might be good when it is finished...”", "Author": "Nick P", "ReviewID": "UR138729075", "Content": "I was booked into the Mercer for 6 days from 27th August and arrived at midnight. the hotel is shrouded in scaffold and there is extensive building work in the reception area, worst of all is that the floor areas were covered in dust. It was also hot with no air con and I was offered no assistance with my 3 cases. I'm not precious, but the service was very poor. The room was fun and 'designer' but finishes were cheap and showing their age (and I believe the makeover was only finished 6 months ago) All in all I wouldn't go back, the area is a little dark and dreary although close to Soho and KLF.", "Date": "August 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Osaka, Osaka, Japan", "Title": "“Old-style HK at the doorstep”", "Author": "Paul S", "ReviewID": "UR138169126", "Content": "This is a wonderful part of town. Small shops. Sense of history. And the sense that it won't last another five years. Development is all around. A short walk away from famous eating and shopping precincts, and bars. The hotel is charming. Free (modest) mini bar. Breakfast is very well planned: not a large choice, but very satisfying ... A blend of Asian and Western flavours. Helpful front desk staff. The Mercer understands what is meant by a boutique hotel and it delivers.", "Date": "August 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Friendly, Helpful, Well-located”", "Author": "Victor L", "ReviewID": "UR137133356", "Content": "The Mercer's staff is very friendly and helpful. The hotel is very well located near Central Hong Kong. The small suite we had was very well thought-out and very efficient. You couldn't really ask for more from a small hotel in Hong Kong.", "Date": "August 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Great hotel; just avoid during renovation”", "Author": "Antoine S", "ReviewID": "UR137044904", "Content": "Hotel location is absolutely great, right in HK center. The rooms are quite big. I went there in August 12 and the hotel was under renovation: no restaurant, no pool, much noice, dirty,.. And if you would like to enjoy HK nightlife, this hotel is even greater!", "Date": "August 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“The mercer is a lovely hotel”", "Author": "Minnie112", "ReviewID": "UR136943819", "Content": "The staff are lovely and very helpful. The rooms are big by HK standards and very well refurbished. The location is excellent. However, the pool is unavailable due to hotel renovations so if this is important to you, check that it is finished before you book. We has a mini kitchen with a microwave which was nice", "Date": "August 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Macau", "Title": "“Great Boutique Hotel”", "Author": "Litoscc", "ReviewID": "UR136789968", "Content": "We've stayed at The Mercer, a small boutique hotel, on a recent weekend trip to Hong Kong. The location is great, right opposite to the ferry terminal, but still on a quiet street and just a 2 minutes walk from Central and all major shopping malls. We didn't explore the hotel, but we were very impressed by the quality and cleaniness of the room, as well as with the helpful and attentive staff. Unfortunately the pool was being renovated, so we couldn't try, but everything in the room worked perfectly. Beautiful modern yet cozy set-up and very well equipped! The absolute very best thing about the room, was no doubt, the bed, which helped us miss the breakfast. We had a very good stay, no complains. We will most likely be staying at The Mercer on our future trips to Hong Kong.", "Date": "August 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Fantastic business stay”", "Author": "mikedeh", "ReviewID": "UR136568388", "Content": "I stayed for 2 nights at the Mercer on a business trip in early July. Although a small boutique hotel, every thing about the Mercer was fantastic. The location was convenient for me for both business and night life. Things like a free mini bar (amazing) and free WiFi made my stay very, very good. The breakfast buffet is not massive but was more than adequate. My only small complaint was that my bathroom had a sink that was not under a mirror which made shaving a bit tricky. Overall a brilliant stay and I would highly recommend it.", "Date": "August 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“My Stay at the MERCER hotel”", "Author": "htiggastyle", "ReviewID": "UR136530679", "Content": "Even though when i pulled up to the hotel there was construction going on, once i arrived in the lobby, the staff at the check in counter were really nice & helpful. There was a nice citrus smell in the lobby & elevator. The Suite that i stayed in was well layed out & well furnished w/simple modern furniture & appliances, i especially like the coffee machine. The amenities were all real good. The room was comfortable, it reminded me of my New York apartment. I was looking forward to swim a little but it was under renovation as the lobby & the staff told me that they were building a japanese restaurant w/a 3 star Michelin Chef, which i was really excited about. The Breakfast had a small selection but the items were with good ingredients which i didn't mind at all. Over all the staff at the MERCER hotel were really nice, helpful & mindful of my needs. I really liked the location, it was very convenient as it was only 2 blocks away for the Train station. I would definitely recommend it to my friends & i will also stay here again next time that I'm back in Hong Kong - which is quite often because even though i'm from NY, i oversea my company's China office so I spend 10 months out of the year in Mainland China, so every month i usually take a long weekend in Hong Kong to relax, eat & shop.", "Date": "August 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Great Service at The Mercer Hong Kong!”", "Author": "AmandaSee", "ReviewID": "UR136486407", "Content": "I stayed in The Mercer on my recent business trip to Hong Kong. I was extremely impressed by the quality of service provided by the staff in The Mercer, they are so professional and extremely attentive and helpful. I would like to particularly convey my sincere appreciation to one of the Managers at the Front desk, Kris Tan. His helpfulness, professionalism, attention to detail and customer needs really impressed me a lot. The staff and management of The Mercer, you have done a great job on keeping your guests happy! Amanda from Sabre", "Date": "August 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "China", "Title": "“Small boutique style hotel in Sheung Wan”", "Author": "Goingnutsinchina", "ReviewID": "UR136461879", "Content": "The Mercer is a small boutique style hotel located in Sheung Wan on HK Island. This location is an up and coming area about a 10 minute walk to Central. It's a little out of the way for food or coffee etc., although there are convenience stores located closeby for snacks. The hotel has a very small reception area consisting of only one desk so sometimes there is a bit of a wait for check in /out. The rooms are small and comfortable but the decor is a bit HK glitzy. Breakfast is adequte, but the breakfast room is small so go early to get a seat.", "Date": "August 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Love to stay at here”", "Author": "Someplaceelse_12", "ReviewID": "UR134701917", "Content": "Very nice boutique hotel in Sheung Wan / Central area on Hong Kong island. Convenient 3 minute walk to MTR subway station. Situated on a quiet street but just steps away from countless shopping and dining options. Staff very professional and helpful. Room is big and nice decor. Would certainly stay there again on future.", "Date": "July 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Modern, clean, conveniently located boutique hotel”", "Author": "jwfromSF", "ReviewID": "UR133977152", "Content": "Modern highrise hotel only 3 blocks from Sheung Wan and 12 blocks from Central MTR stops on the Island Line. Friendly, attentive staff. Cozy, clean, well appointed rooms. Free WiFi and breakfast. Available fitness room but no pool. Would definitely return.", "Date": "July 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "cambridge", "Title": "“brillant value and service! but no pool :(”", "Author": "dchar", "ReviewID": "UR133891141", "Content": "i was wonderfully surprised by the mercer. check in was seamless and they even sent a concierge to introduce me to my room. plus free wifi, breakfast, and minibar! it is very conveniently located in an up and coming HK neighborhood (LKF is overrated and just a couple blocks away!). the room was very comfortable as were the beds!", "Date": "July 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Convenient, Clean”", "Author": "jengems", "ReviewID": "UR133565239", "Content": "The hotel is extremely convenient, hotel staffs are very friendly and helpful. The only downside for me are the pillows which is not very comfortable. Other than that everything else is excellent.", "Date": "July 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Trendy and comfortable for a long stay”", "Author": "HKB2011", "ReviewID": "UR132005557", "Content": "Great location adds to the charm of this newly opened boutique just off Central.. Location is great and walkable to MTR, Tram and buses... and nice stroll to the Central shopping areas. Rooms are comfortable and well layed out and on the larger size compared to a hotel room of a similar standard. Rather cool sofa in the lounge made for good late night TV viewing.. while enjoying the free mini-bar... a nice touch..", "Date": "June 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“1 of the best reviews in HK”", "Author": "Or_Kuntzman", "ReviewID": "UR131493494", "Content": "great stuff, great rooms, location is great - near to Soho area", "Date": "June 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Small but perfectly formed”", "Author": "thisisbeaker", "ReviewID": "UR131205544", "Content": "Stayed here for a night en route to London from the Philippines. My room was compact, but it wasn't a problem. I actually liked all the glass - very contemporary. Room was spotless. Complimentary mini bar was a nice touch. Location is good - close to plenty of restaurants. Staff were friendly. Breakfast was pretty good too.", "Date": "June 3, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Loughborough", "Title": "“Weird rooms - good service”", "Author": "Patchpup", "ReviewID": "UR130813305", "Content": "I stayed her recently when on business. Hotel in quite a strange part of Central although close to my office. Close to lots of restaurants and bars but not as upmarket as Soho or Lan Kwai Fong. I was very excited to be told I was in a one bedroom suite......until I got into it. The room was very small split into 2 rooms by a glass partition. The first room was a small kitchen/dining/seating area.....nicely furnished with a weird purple sofa that was a waste of space. Second room was a bedroom with a king size bed a small desk. The bed took most of the room up but was comfortable. Both rooms had large flat screen TVs. Bathroom was fine except clear glass wall seperating from bedroom. The breakfast was fine with service excellent.", "Date": "May 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Sheung Wan Shuffle”", "Author": "Dezzydez", "ReviewID": "UR130192870", "Content": "We stayed here earlier in the year and was pleasantly surprised. After a horrible experience at a nearby Ovolo Serviced Apartment, the Mercer was bliss and matched our expectations of a smaller HK hotel. We booked a small \"suite\", which had a separate living/kitchen area. It was compact but adequate space for 2. Room decor was average, (not my cup of tea) but it was new and clean. Housekeeping was to a high standard and I felt the staff on the whole were very helpful and polite. Location for us was fantastic. Within walking distance to Soho and Central. Sheung Wan itself is a lived in neighbourhood, as its an old part of town so doesn't look particularly new or pretty. There are lots of local businesses and residents going about their business so if you do not like a local neighbourhood vibe then don't stay here. The metal noise comes from a nearby recycling business and can only be heard during the day. The gay bar is very discreet and only really comes alive during the weekend. Get a higher floor and you should have no issues with noise. Its very quiet at night but a very safe area. The immediate street surrounding the hotel (in a triangle) are full of fantastic cheap eats. We found a small dim sum joint, Japanese ramen and lots of Chinese options too. If you are adventurous, check them out. You won't be disappointed. Oh, the beds are incredibly comfortable too.", "Date": "May 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“Enjoyable stay”", "Author": "jolol", "ReviewID": "UR129208301", "Content": "It was great to be greeted by the very efficient staff. The room was spotlessly clean and the interior design fabulous. The bed was comfortable after a long flight with finest linen and pillows. It has to have one of the best location for anyone’s trip to Hong Kong with the metro just a stroll away. The breakfast was a highlight also with a fantastic selection and such refined services. We loved it all and will definitely stay there again.", "Date": "May 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Modern and efficient”", "Author": "foodgrl", "ReviewID": "UR127103193", "Content": "Boutique, luxury hotels are my thing. The Mercer Hotel is absolutely lovely. It lies within the very humble area of Sheung Wan, which is humble in comparison to the very bustling areas on Hong Kong Island like Central and Soho. The concierges at the Mercer are absolutely trained to offer an upgrade during check in. If you can afford it, ask for a calculator, do the conversion and buy the upgrade. I was able to upgrade from a king standard room to a suite for $71 per night. It may sound like a lot, but if you are traveling 16 hours on a plane to a \"far away land\" why not pamper oneself. The small suit had a very efficient and modern design. The pocket doors were sleek and the bathroom was very well done. The major pitfall of this hotel is that there is nearly service free. There are cleaners who do a fantastic job, but there is no real kitchen and the complimentary breakfast is kind of strange if you are gearing up for a long day. I only mention this because when you fly halfway around the world for 16 hours with an 11 hour time different and aren't mentally prepared to figure out how it all works when you arrive...you might be hungry. Otherwise, the design itself was fantastic.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“HORRIBLE neighborhood!! Impossible to sleep here”", "Author": "Peter M", "ReviewID": "UR127063953", "Content": "This is a so so hotel with a HORRIBLE HORRIBLE neighborhood!! During day time, there are metal hammering from the junk recycling shop across the road, & at night, annoying loud noises from the gay bar next to the hotel. It is IMPOSSIBLE to get a decent night rest here. I will never come back and suggest this hotel to no one, if the NOISE-POLLUTION problem remains.", "Date": "April 1, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Melbourne", "Title": "“Clean, modern and ok location”", "Author": "goony51", "ReviewID": "UR126882505", "Content": "Boutique hotel, clean with good features. Basic breakfast but adequate. Very close to MTR station. Helpful staff. Neighbourhood is not as glamorous as some of the big brand hotels. Ultimately would stay again", "Date": "March 28, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“A lot of money for little satisfaction”", "Author": "Traveller1455", "ReviewID": "UR126686647", "Content": "This hotel was more of a youth hostel in a far but up and coming location. At this price you would expect a much much more comfortable residence. The breakfast was terrible. The room fit out was very poor. And ikea blinds dividing internal spaces. There is with no doubt that this hotel will have to drop its prices and star rating. I booked the hotel on another site because the reviews were good, they must of taken down the poor reviews. The only redeeming feature was the nespreso machine.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Beijing", "Title": "“There are better hotels for the money”", "Author": "OfficiallyForeign", "ReviewID": "UR125434007", "Content": "This was my 6th visit to Hong Kong and I think there other hotels that offer a better value than The Mercer. Cons: They seemed to cut corners everywhere and added up, it really took brought the value down. We stayed in the 1-bedroom suite. The bathroom door was see-through and if you wanted privacy you had to pull down a shade from the inside. Very cheap and strange. The curtains were not cut appropriately so it did not keep the light out... also the fabric was thin and cheap so even if they were cut right, I doubt they would have done much. Breakfast was very simple. Some toast, salad, juice/coffee, muffins/danish. Pros - great location. Less than a 5 minute walk to the MTR. Attentive staff. Overall, comparing this hotel to others I've stayed at I just don't think it's worth the money. The Butterfly Hotel chain, for example, offers a significantly less expensive rate but is just as comfortable.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne,", "Title": "“Compact Comfort”", "Author": "helenwheels55", "ReviewID": "UR124917588", "Content": "Stayed for three nights at The Mercer Hotel in the Sheung Wan district of Hong Kong. It is very close (5 minute walk) to the Sheung Wan MTR station (in a straight line) and near the heart of many major shopping malls and interesting streets and alley ways. This is all great if shopping is on your to do list but learning your way around the maze of streets and stair wells is quite a bit tricky. I had to use the The Oasis building which is very green as a landmark to get my bearings and after a day felt relieved I wasn't quite as lost. I had to attend the Convention Center each day and the rail system took me there without any trouble (four stops) on the rail system. The Hotel was clean and comfortable. A continental breakfast was served each morning in the 1st floor breakfast room. This was adequate with pastries, cereal, juice and cheese, meat and salmon offered along with chinese buns and salad. Coffee and tea as well. Rooms offered free wi-fi and although the view wasn't anything to rave about the room was tastefully decorated and all facilities worked well. The staff at the desk and the breakfast room were helpful and friendly as much as the Chinese ever are!", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Alkmaar", "Title": "“Wonderful Hotel”", "Author": "E749b", "ReviewID": "UR123344561", "Content": "The Mercer is wonderful boutique hotel. Staff is friendly and helpful, and most importantly the rooms are beautifully decorated. Especially the executive rooms on the higher floors are very nice, large for HK standard, and with great extra's such as a little kitchenette, free drinks and an espresso machine for free use. It's in a relatively quiet street, but still only a short walk to the subway. The only disappointment is the breakfast; free but very basic", "Date": "January 20, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "UAE", "Title": "“Not Too Bad means good? I dont think so!!”", "Author": "explorer2727", "ReviewID": "UR123193841", "Content": "Stayed at The Mercer in November 2011, The hotel is in a quiet area but close to IFC and Central Hong Kong. The welcome/arrival was not great, no transpiration arranged (booked in advance), front office staff rude and a bit unorganized. No all of them are speaking well English. The building is new with some constructions in progress (pool area), lifts are nice and rooms as well. I booked a suite with separate kitchen and living area, including mini bar, WIFI and complimentary breakfast. I love the bathroom, well designed and organized. The bed is comfortable, facing the LCD 42’’ TV, I must say that the TV is a bit to low compared to the bed, once you are in the bed you can’t watch the TV properly. Rooms are cleaned every day by Housekeeping staff, Breakfast was poor, small indoor area with a poor selection of food. Service staff is not friendly and the overall atmosphere in the room is inappropriate and cold. Is not an Hotel for Family due to the high number of “accompanied ladies” in the area. For a couple of nights on business trip is ok and a good alternative to a “branded” hotel such Four Seasons……", "Date": "January 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Location": "4"}, "AuthorLocation": "Lisboa, Portugal", "Title": "“Excellente location and value in HK”", "Author": "Eduard0_PT", "ReviewID": "UR122806811", "Content": "Really enjoyed our stay. The hotel is new, the decor is modern and trendy. The room is of excellent size for HK. Very confortable and high tech. We had breakfast included in our rate. It was ok. Basic, nothing special. 2 sorts of fruit (melon and watermelon, always), 2 juices (not freshly squeezed), some bread and cheese, cereals, yogurt and some chinese dumplings. Besides this, I totally recomend it!!", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Doha", "Title": "“Boutique charm and personal service at Mercer”", "Author": "Dave S", "ReviewID": "UR122804471", "Content": "Centrally located, but tucked in a backstreet, like all 'hidden gems' should be, this beautiful slick friendly city hotel epitomises my first choice hotel formula. Be prepared for the sights and sounds of the old city (not a fraction of the original, but authentic). Who wants a theme-park? Taxis may not find it without GPS, and you'll get lost looking for it even after a couple of days, but each turn brings a new restaurant or unexpected vista. Clean bright modern rooms and clean bright modern proud staff with service but not servility make you feel at home and welcomed.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Staffordshire, England", "Title": "“Great rooms in central location”", "Author": "JonoLion", "ReviewID": "UR122364491", "Content": "I stayed in the Mercer for 3 nights in a suite room. The hotel is in Central, but in a quiet street - easy for access to the underground or walking to the waterfront and the quays. Everything is just walking distance. An excellent base for Central. Rooms are very spacious, clean and well equipped. The huge bed was really comfortable. For such good rooms and central location, the hotel is very reasonably priced. Free wifi. The Mercer is a sister hotel of the Lang Kwai Fong Hotel just round the corner. I would definitely stay here again. Dont bother with breakfast as it just comes on a tray and is pretty useless. Just go to one of the many nearby cafes.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "london", "Title": "“Boutique hotel in Hong Kong”", "Author": "peejay_london", "ReviewID": "UR122364230", "Content": "Great location in Central – only a short walk from Sheung Wan station. There is a courtesy bus, or it’s only a quick cab drive away from Hong Kong station if you arrive there from the airport (make sure you have the address for the cab driver, as it’s a bit hard to find). This is a great hotel if you want to stay near Soho/Hollywood Road – although the location might not be for everyone as it is on a busy, small street slightly away from the main shops. The rooms are comfortable, large for Hong Kong and a nice modern design. In the suite there is a small kitchen, with coffee machine and some free drinks in the fridge. Wireless was also free, and worked well. There were only two rooms on our floor, and the view is great out to the high rises of Central. They served a nice breakfast, which was included in the price. The pool was hard to find – and small – so don’t choose the hotel based on doing a lot of swimming. I would certainly stay here again.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "San Francisco, California", "Title": "“If you like to flush your toilet with sewage this is the place for you”", "Author": "StanLee0413", "ReviewID": "UR122260193", "Content": "I booked this property based on 4 star reviews and its new construction. The hotel is located in a quiet, perhaps too quiet, area of Hong Kong. While only a 15 minute walk to many sites it's not for the unseasoned American traveler. The rooms are fine, but don't expect 4 or 5 star services. I checked out a day early after being grossed out by sewage in my toilet flush. When I left I asked the front desk about the problem and he shrugged that they maybe were doing maintenance on the system. There was no apology and I left one day short of a prepaid visit eating my third night but happy to leave.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Sexy Digs”", "Author": "smacdvanbc", "ReviewID": "UR122201028", "Content": "I really liked this hotel. It's a small boutique property with about 60 rooms.. Location is great for repeat visitors. Literally 1 minute from Sheung Wan MRT station. Close to Hollywood Road, Cat Street, and within walking distance of Central and Mid-Levels escalator. Rooms are chic. Beds very comfortable. Large bathrooms with full bath, regular and rain shower. Suites (most rooms are suites) have a kitchenette and living area with tvs in both the living room and the bedroom. Breakfast, wifi, espresso machine, and minibar are all complimentary. Service is efficient and free shuttle offered to and ffrom Hong Kong Airport Express Station.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tokyo, Japan", "Title": "“Good Boutique Hotel”", "Author": "Whall21", "ReviewID": "UR122012875", "Content": "I stayed in the Mercer Hotel on a business trip in early November for four nights. It is in a pretty good location where you can walk to the Ferry Port and other train stations. Since it is new hotel and a little tucked away in a small street, a lot of taxi drivers could not find the location. Overall though, the rooms were comfortable and with a touch an artsy feel to the design of the room. The continental breakfast was descent, but nothing special. They claimed that they have a pool, however I was not able to use it due to some water problems. Also my TV was not working for most of my trip, however I think it was a hotel wide problem - since the TV in gym was not working very well either. Considering the price of the hotel, I think it was a pretty good choice for the value.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Shanghai, China", "Title": "“Overall Good”", "Author": "TD726", "ReviewID": "UR121688565", "Content": "Stayed at the Mercer for three nights at the beginning of November. Overall our stay was very pleasant and staff was great. The room was well appointed and suited our needs perfectly. The glass bathroom door was a little odd, but overall the room was very nice (we were staying in the one-bedroom suite). The location was great and we were within walking distance from pretty much everything we were looking for. The biggest problem that we had with the hotel was the lack of a restaurant or room service. We have an 18 month old and at times she is a cranky pants and can't hold off sleep until after we eat. On one of the nights my husband had to sneak out (so we wouldn't wake her up) in order to go get food as there weren't any options at the hotel. The hotel does, however, have a decent breakfast buffet that was included in our room. The other big issue for us was finding a babysitter. I had been told that they hotel had a babysitting service that they used for guests. When I inquired about pricing we were told that it was 800HKD/hour! We weren't expecting anything cheap, but since the most we had paid at a hotel was 20 Euros/hour in Paris I was not expecting it to be that much. Due to the babysitter issue we weren't able to go out as we had hoped. C'est la vie! A minor note, but we found the pool to be VERY disappointing. Our daughter loves to swim, but the pool it TINY and situated between the buildings and looked dark and dank. It also was not heated so despite the 80 degree weather the pool was too cold for even my husband to brave. In the end we found the hotel to be quite nice and we really enjoyed our stay there. I would definitely stay again, but this time look into babysitting elsewhere!", "Date": "December 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Nice boutique hotel”", "Author": "Monica F", "ReviewID": "UR121022872", "Content": "Stayed for three nights early November. We were upgraded to a suite on arrival, which was much appreciated. The rooms are very modern and well appointed though the bedroom area was a little tight. The breakfast was a nice way to start the day and having water, coke and juice in the room was a nice touch. Fitness center was quite small. Pool was hard to find and dark. Location was great - two blocks to the subway, walking distance to SOHO and ferry terminal, yet away from the crowds and expense of Central. Be advised, walking to the ferry terminal with luggage requires climbing stairs to a footbridge to cross the street! My only complaint is that the staff, though friendly and well meaning, led us astray a couple of times. Suggesting we walk to the ferry terminal with all of our luggage was one example. Another was when we asked them if they knew of a travel agency where they spoke English. We were directed to the travel center in Kowloon with three floors of agencies. Yet we were hard pressed to find one that had material in English, let alone an agent who actually spoke English. Finally, I asked the front desk for assistance in making a collect call to the U.S. They called the telephone company to find out how, told me to wait in my room and they would let me know but they never did. For a hotel that clearly caters to an English speaking clientele, I think they need to work on this.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“A Gem in Hong Kong”", "Author": "Nigel R", "ReviewID": "UR120898216", "Content": "We spent four nights in this new boutique hotel. The room was comfortable with a lovely king size double bed. The daily rate includes two waters, two cokes, two coke lights, an orange juice and two beers which are in the mini bar in the room. The continental breakfast, which is also included in the rate, is really good with the bonus of dumplings or such like thrown in. The hotel is two blocks from the MTR and a 15 to 20 minute walk from the Central piers. In the immediate area there are many little chineses restaurants including the street ones in Stanley Street. Try Shing Kee.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bangor, United Kingdom", "Title": "“mercer - excellent value”", "Author": "john g j", "ReviewID": "UR120486943", "Content": "4 nights my wife & I excellent room bathroom superb staff always friendly & helpful breakfast now served in 1st floor breakfast room and it was good plenty of fruit juices cereals toast pastries coffee etc 2 min to MTR (underground) and 2 mins to walk to Soho loads of restaurants ; tremples and curio shops all in all a v good location. Their free transfer to and from Airport Express terminal ( H Kong) worked a treat", "Date": "November 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Guadalajara, Mexico", "Title": "“Great Hotel - great value for money”", "Author": "GlobetroterCostaRica", "ReviewID": "UR119900932", "Content": "We did stay in this hotel for 2 nights mid July just as the operation was in the opening stage. The Guest Room is well appointed, here foremost for long staying Guest including a small kitchen. The bed and bathroom do offer all amenities needed including 2 TVs sets in kitchen and bedroom. Breakfast was served in the room and including in the price so was the Internet. The location of the hotel is good, close to the underground and within walking distance to the Center of Hong Kong Business district. We enjoyed our stay here very much, and this hotel does offer a great value for money if you are looking for a nice hotel outside the 5 star level.", "Date": "October 30, 2011"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Worst customer service ever! No help and rude.”", "Author": "Stol91", "ReviewID": "UR119463316", "Content": "I had the misfortune of having a flight interruption prevent me from making my scheduled flight to Hong Kong from the states. There was literally no way for me to arrive in Hong Kong on the day of my reservation. I called the hotel to cancel my reservation and to explain the situation in order to receive a refund. I was told that I had to call back in three hours. After calling back, I was told that they would not process a refund and that to discuss further, I would need to speak to a manager. When I asked to speak to the manager, I was told the manager was in a meeting and I would need to call back again later. After calling back a third time, I was told that the manager was unwilling to allow the refund. I asked to speak with them, but was told the manager was in another meeting and could not / would not speak to me. The decision had been made. I then went on to inform them that between the prior call and this third call, I had been able reroute my trip to include a stay in Hong Kong for a date five nights out from my originally planned arrival date. I asked if, given that they would not allow a cancellation, would they at least move my reservation and apply it to that date. Without hesitation, I was told that the hotel would also be unwilling to accomodate that request. I politely pointed out that the manager had not heard this alternative, but was again shut down and told this was against policy. Mind you, this is all in spite of the fact that my initial reservation had occured less than 24 hours prior to this. What a golden opportunity to show some flexibility and earn a life long customer (I travel to Hong Kong frequently on business). Instead, I certainly would recommend any major brand over them for just such a reason. If you need any assistance or flexibility - forget it.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Sydney, Australia", "Title": "“Taxi's cant find it...”", "Author": "Simon M", "ReviewID": "UR119279745", "Content": "The hotel is ok, I stayed in a suite on the upper levels and the room was adequet, clean and for Hong Kong hotels at the price large. The hotel is very central and within walking distance of the Central Business District- which is lucky because no taxis can find this place. The general neighbourhood is pretty crappy. Would I stay again, probably not.", "Date": "October 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Captain Cook, Hawaii", "Title": "“What a great find!”", "Author": "KOA002", "ReviewID": "UR117773232", "Content": "The Mercer is a boutique type hotel in an excellent location within a short walking distance of the ferry terminal as well as the MTR rail station in Hong Kong. We lucked out and got an upgraded room since they were fairly full and because we elected not pay extra for it when we first checked in, they gave it to us anyway since we had made reservations. The upgraded room was very clean, modern and trendy and included a kitchen/small dining area (with a sink and small refrigerator) which led into a small living room/TV viewing area. The refrigerator stocked with bottled water and sodas (Coke) was free and replenished everyday. There was plenty of room in the refrigerator to put juices or other items you could purchase at a small grocery store a couple of blocks away. The bedroom and bath area was small but big enough to fit a king-sized bed, a small desk with chair (with free internet and connections), two nightstands on either side of the bed, a flat screen TV and a cozy closet that had a safe, a hair dryer as well as an iron and fold-out ironing board. On the other side of the closet wall was the bathroom which included a tub as well as a walk-in shower. It was unique in that both were in the same enclosed area separate from the toilet and sink area but the showerhead was right next to but outside of the tub. Our original reservations included breakfast delivered to our room at whatever set time we chose upon checking in. We were given a list of choices and decided upon a couple of Danish pastries, fresh fruit, yogurt, orange juice and coffee. Although it may not sound like much, it was quite filling and satisfying particularly the fresh fruit...thankfully it wasn't canned fruit cocktail! The gentlemen that checked us in were very pleasant, efficient and helpful and once even offered me an umbrella to use for the day because it was raining as we were leaving to go sightseeing. All in all, this was a really, really nice and convenient place to stay at and would definitely consider returning here in the future.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Shenandoah, Virginia", "Title": "“Beautiful Hotel, convenient location!”", "Author": "trsces", "ReviewID": "UR117770878", "Content": "We spent 3 nights at the Mercer and absolutely loved it! We were in a smaller room, but that was fine for us. The hotel staff were excellent - extremely helpful, professional. The daily breakfast is a delight - pastries, fruit, cereal and salad. It's a perfect selection to get your day off to a good start. The pool is now open! It's small, but looks nice and clean. We used the workout room and the equipment is good. The best part <for us> was the location - it's in walking distance from Cat Street, Hollywood Street, the Peak Tram, subway line, IFC Mall <dining/shopping> and the harbor pier. One note - we did NOT use the complimentary shuttle from Airport Express, thinking it was just as easy to lug our stuff 1 more subway stop and walking to the hotel. This was a mistake. The subway station was super-hectic and trying to work our way through with luggage was not good. We took the shuttle as we were leaving Hong Kong and it was definitely the way to go.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“The mercer - great service, would love to stay there again.”", "Author": "nicky_sim123", "ReviewID": "UR117256707", "Content": "We got upgraded to a suite when we checked-in and it was a spacious suite, bearing in mind that we were in HK. We had a great stay there, bed was very comfortable. TV channels were boring but they had a small DVD library which was nice. When we made several requests during our stay there, pillow change, cleaning of kitchen top, fixing the safe etc. All our requests were promptly served. Service in HK is generally very good, and the mercer is one of those places. Location was very good in HK island, within few minutes walking distance to SOHO and mtr station and quite close to the star ferry terminal as well.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Philadelphia, PA", "Title": "“Perfect Location, Brand New, Nice Value!”", "Author": "J1PA", "ReviewID": "UR116875410", "Content": "Very modern, comfortable hotel. We were upgrade to a suite, room had everything you could want as a traveler. Free wifi, adapters, safe, closet, iron, 2 lcd tvs, big comfy bed, free breakfast-in-bed!!!! Only complaint would be that the bed sheets are a bit coarse (if you have sensitive skin). Stay here before the prices go up!!! This hotel is in a very good location, reminds me of SoHo, N.Y. -- away from all the noise and touristy spots, but only minutes to all when you take the metro. A few steps from Sheung Wan MTR stop. When you arrive at HKG, take the airport express (buy the octopus card! you can use it on buses & mtr etc.) to Central station, then walk to the line that goes to Sheung Wan. Take A1 exit, turn right, walk down to 7-Eleven on corner, turn left across intersection and walk about 4 mins to hotel on corner. Enjoy!", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cologne, Germany", "Title": "“One of the kindest supports we have ever received.”", "Author": "crocac", "ReviewID": "UR115641170", "Content": "The hotel is very good located. It is one minute away from the nearest subway station. It also has a great view (attached photo). The support we have received was phantastic. The breakfast was brought to our room, the mini-bar was inclusive and the laundry-service works well. In addition to that all our wishes have been fulfilled. All together is to say, that this has been one of our best accommodations we have had on our trips.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great new hotel”", "Author": "mlt85", "ReviewID": "UR115472133", "Content": "Originally booked Lan Kwai Fong hotel, and got moved over to the Mercer as an upgrade. It was a pleasant surprise, however, as the suite is well designed, modern and clean, with everything brand new - the staff told me it had only been open a couple months - and the space is very generous, especially compared to other hotels in Hong Kong. The free minibar and breakfast are a nice touch and I'm already planning to use The Mercer on my next visit to Hong Kong.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "toronto, Ontario, Canada", "Title": "“Nice hotel with great service and good location”", "Author": "starrynight2011", "ReviewID": "UR115405928", "Content": "This is my 5th time to HK but first time staying in Sheung Wan area. Found a new boutique hotel on internet which offers great rate. Room is spacious, new, clean with DVD to borrow. Almost everything is included in the room rate, internet, local calls, minibar and breakfast. What a great deal! very close to MTR and restaurants around the area. Sheung Wan is a unique area with a good mix of old and new, great designer store and art galleries. Will stay again for sure! But the swimming pool is not ready....", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Sydney", "Title": "“Loved it and we will be back”", "Author": "CyndifSydney", "ReviewID": "UR115002157", "Content": "We stayed at the Mercer for 3 nights in early June, the 10th to the 13th. We loved the location as it was close to Soho and great restaurants and the rooms were well designed and very comfortable. Service was excellent and we enjoyed our experience. The bathroom was great and we loved the toileteries. there is a kitchenette for making your own snacks and the room was great and spacious.", "Date": "July 4, 2011"}], "HotelInfo": {"Name": "The Mercer", "HotelURL": "/ShowUserReviews-g294217-d2081304-Reviews-The_Mercer-Hong_Kong.html", "Price": "$227 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">No.29 Jervois Street, Sheung Wan</span>, <span class=\"locality\"><span property=\"v:locality\">Hong Kong</span></span>, <span class=\"country-name\" property=\"v:country-name\">China</span> </span></span></address>", "HotelID": "2081304", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/34/10/f7/one-bedroom-suite.jpg"}}