{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Easton, PA", "Title": "“great value”", "Author": "ayoungpretender", "ReviewID": "UR119420064", "Content": "This hotel is in a great location. It is right by the end of La Rambla and there's a metro station right across the street. The rooms are clean and comfortable and many have views overlooking the plaza. The staff was friendly and they were able to accommodate us without reservations. Overall, a very good value for a nice, private room in a great location.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Good Location”", "Author": "worldwoman", "ReviewID": "UR89297885", "Content": "We stayed here in mid-November 2010. It is at the end of the Ramblas (a 1.5 km walking mall to the port), across the street from the Metro, Visitors Information, buses and the bus to the airport - what a great location. Rooms were small, some street noise but not unbearable. Free wireless internet was available in our room but the signal strength was week. It was fine in the lounge. No breakfast but lots of places nearby. Desk staff was helpful re the laundry locations, copying service, etc.", "Date": "December 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Great location at a good value”", "Author": "Liketotravel38", "ReviewID": "UR82797300", "Content": "We stayed in this hotel for 4 nights. My wife and I had a double room and my mother-in-law had a single room. Location. Location. location. The greatest asset of this hotel (at this price) is its location right at Plaza Catalunya. Walking distance to almost everything and easy subway access for the few more distant sites. Airport bus stops right at Plaza. Plaza Catalunya and Las Ramblas are the heart of Barcelona where so much of the energy and activity seems to revolve. The hotel was what we expected for a 3 star European Hotel and certainly met our needs (location and cost were highest priority for us). Our double room was clean and comfortable albeit small (as expected). Bathroom was clean (and very small). Our room had a small balcony overlooking plaza Catalunya. There were a couple of quirks with the hotel but they really did not bother us much. Plaza Catalunya is noisy almost all night (especially during our stay since there was a festival and concert in the plaza every night). There is a nightclub across the street and people congregate in front of the club. May only be open weekends (not sure). The balcony has a heavy sliding glass door in addition to heavy wooded doors. When everything is shut, it blocks 95% of the noise so really no problem. However, I like to keep the window/door open a bit overnight for some fresh air. In that case, it was very noisy. But, a pair of earplugs solved that problem and I slept soundly (wife sleeps through anything). On one night there was also a bit of noise from the adjacent room for a little while. The biggest problem was that my mother-in-law's room developed a strong sewer odor after the second day. The hotel was fully booked and they did not have an alternative room. She had to keep the bathroom door shut and the windows open. Since the window of this room faced an interior courtyard, noise was not so much of an issue. We had no such smell in our room, which was just across the hall. Assuming the smell in the single room was an aberration, we would stay in this hotel again. We loved the location. Staff was friendly. Price was right. When we travel, we only use our hotel rooms to sleep and shower so a luxurious hotel is not worth the extra money for us.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Sydney", "Title": "“Great location, shame about the rest...”", "Author": "eurotripSydney", "ReviewID": "UR51322765", "Content": "Fantastic location Not very clean- no clean towels each day Very noisy", "Date": "December 16, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "London", "Title": "“Disappointing and not good value”", "Author": "HotelsExpert", "ReviewID": "UR46996421", "Content": "Looking for budget accommodation in the city centre we read the reviews for Hotel Ginebra and decided to stay there. It was extremely disappointing - location is just perfect and it is not too noisy for a city centre but the place is NOT a hotel but just a simple hostal. Room was clean but really small, simple and run down and for the price we paid (€ 65 with no breakfast) we could have stayed in one of the many hip hostels in Barcelona.", "Date": "October 16, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“Not a hotel and not worth the money”", "Author": "ViaggiaBene", "ReviewID": "UR45812566", "Content": "I stayed at Hotel Ginebra for 3 nights after checking this on Tripadvisor and I was not happy at all. Location is fantastic and incredibly convenient - and that is it. This is NOT a hotel, but a simple basic hostal or pension. My room was clean but really tiny and very noisy. Hotel Ginebra is an old big apartment converted in a pension and when I was in the room I could hear noise from all other rooms and from the rest of the big building. As they are on the third floor, guests must use a doorbell to get in and I could hear the buzzer all through the night. I think this hotel is absolutely not worth the money - for these prices you can find better accomodation, even in a city as expensive as Barcelona", "Date": "October 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "1"}, "AuthorLocation": "New York, New York", "Title": "“Great location, amazing view, friendly staff, convenient ... but very \"cozy\"”", "Author": "ElenaAP", "ReviewID": "UR37376890", "Content": "This gem is located directly on the Plaça de Catalunya – which made it incredibly convenient and accessible via public transportation. The building (like so many in Barcelona) is beautiful. There are a lot of small shops and cafes very close by (La Rambla!), so you will have no shortage of food choices. I had one of the best sandwiches of my life just down the road at Café Vienna (if you go there, you will quickly see which one it is and what I mean). Staff was very friendly. Beer, water and soft drinks were available for purchase at the front desk, which was convenient after coming home late night. Like other hotels in Europe, double occupancy meant two single beds, so we somehow rearranged the bedroom furniture to push them together (the room is small, so admittedly it was a struggle!) Why a 4 and not a 5: the room and bathroom are very, very small. I have a high tolerance for limited space, but this was definitely pushing it for me. Also, the elevator to get to the hotel entrance is super small (two people with minimal luggage barely fit) and feels a little shaky. Overall though, I highly recommend this hotel to the budget-conscious traveler who wants to be in a good location. You can’t go wrong.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Essex", "Title": "“GOOD LOCATION AT A REASONABLE COST”", "Author": "G_GEssex", "ReviewID": "UR27981817", "Content": "We have just returned from a 4 night stay at Hotel Ginebra, Barcelona. This hotel is located in a fantastic position at the top of Las Ramblas over looking Plaza de Cataluña. This square is where the airport and tourist attraction busses depart from, as well as a Metro station which is very convenient. The airport bus costs 4 Euros 25 cents each and the Bus Touristic is 21 Euros for a day or 26 Euros for two days. To access the hotel you have to press the buzzer and the receptionist lets you into the building. There is then a lift to take you to the 3rd floor, or a lot of stairs to climb. When leaving the hotel, you need to return your room key to the receptionist when you leave the hotel, and if they are away from the desk, there is a bell to ring for service. Upon return to the hotel, once they have buzzed you into the building they are waiting at the hotel door with your room key. We had a room over looking Plaza de Cataluña and the room was nice and quiet from the street noise. The 4 layers of shutters/doors keep out the noise and light! The hotel walls did seem to be rather thin so, as some noise was heard from the rooms either side of us. Our room was of a decent size although the bathroom was a little small with a wooden folding door separating it from the bedroom. The whole hotel was very clean, with maid service everyday cleaning the rooms. Bathroom towels are replaced as and when you want them like most hotels and only soap is provided, so toiletries are required. Regarding electrical sockets as previously mentioned, there was one socket in the bathroom and one where the television is plugged in. However, the television is placed high on the wall towards the ceiling so the plug is not very accessible. The rooms do not have safes unfortunately, and we did have some doubts about the safety of our personal belongings, however we experienced no problems in leaving things in the hotel or out and about this large city. We did not have to pay for our accommodation until we departed and the hotel sells hot/cold drinks for 1 Euro 30 cents which are added to your bill and paid for on departure. Overall an enjoyable stay if you are looking for a reasonable priced hotel to use as base if you are planning on being out all day sightseeing with friendly staff at the Hotel Ginebra.", "Date": "April 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "New Zealand", "Title": "“Very Average”", "Author": "dunedintraveller", "ReviewID": "UR21578576", "Content": "We stayed for 5 nights in October this year. The room was really tiny and reasonably clean, but very tired decor. Great location, but at 87 Euro without breakfast, it was the most expensive room in our 3 week long trip through Spain, and I have to say, my least favourite. Nice and quiet from the street noise. The Cortes Inglese (not sure of the spelling!) department store on the other side of the square has great food for a picnic lunch, and bottles of water for 37 Euro cents", "Date": "November 5, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“How to get to Ginebra from the train station and tourist bus review”", "Author": "JudyJudyJudyH", "ReviewID": "UR20875574", "Content": "Loved the location of of this hotel. We too booked based on Tripadvisor reviews so I thought I'd try to add my own review as well. We took the train with Europass and it was good for the train that brought us right to Plaza de Catalunya. We had to show them our Eurorail pass and they told us the platform to go to. It really was the metro I guess. Then when we got off we had to show the tickets to get a card to let us out. So no worries. We took the one out to the right but the left exit there is an escalator up so if you have bags take the time to find it. Both exits are exactly across the street from the hotel. What could be better? The hotel is on the third floor and we had room 403 which overlooks the plaza. Twin beds and they were comfortable enough but not great of course. But they DID have A/C. You have to ask them to turn it on in your room - but it worked GREAT!!! What a surprise after five star hotels with little or no A/C since it is Fall now. Go figure. The tour buses are right outside your door on the Plaza and we bought 2 day tickets for Bus Turistic. There is also Barcelona Tours but for some reason they were empty and ours was always full. They don't go as many places. The green line didn't run since it was October but theRed and blue line worked great. Just covers so MUCH space it can be daunting to ride for one hour just to get to themuseum you want to visit. But well worth the E26 we spent for two days. Hard Rock Cafe is across the square and hate to admit we ate there but we did. Haven't found any great restaurants yet (one more night to try). We are doing the Flamenco show tonight and will post separately on that. Getting to the Ginebra Hotel is EASY as pie (the airport bus also dropsoff in the Plaza - and picks up too). Even with luggage it was good. There is an elevator at the hotel that is larger than I expected. We fit with our luggage easily with room to spare. They do sell water, coke and beer for very cheap at the hotel (E1.2 - OMG that seems cheap now!). The hotel was clean, clean, clean!!! A walk down La Ramblas is really an easy walk. Just walk straight down and ythen to the left at the harbor and you are at the beach! We did take a break near the port and I laid down using my purse as a pillow. My sister wasn't paying attention to her purse for a moment and a guy came up and snatched it right up. I sat up right when he did it and yelled her name. He dropped it immediately and walked slowly to his bike and took off while the Spanish folks around screamed at him. They came over and reminded us to be careful. SO BE CAREFUL! She had her passport in that purse! Yikes! Enjoy Barcelona and we highly recommend Ginebra as an inexpensive great location. Bring your own shampoo and toiletries. If you need fancy - don't stay here. Our bathroom was spotless with a shower, toilet, sink and bedet. Again very CLEAN!", "Date": "October 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Italy", "Title": "“Perfect for a short getaway!”", "Author": "Barbarella71", "ReviewID": "UR20139377", "Content": "We chose this hotel thanks to the previous reviews we read here. Infact when we arrived there all was exactly as said: central location, easy access from/to the Airport, etc. It’s also very safe because it’s on the third floor of a building so people must go thru a doormen at the entrance, and then thru the hotel receptionist who’s always there 24h day. Also friendly staff (they don’t speak English though); we had a late night departure flight, and they kept custody of our bags all day long. So I just want to add a couple of tips: Noise – yes… but from the inside! Outside traffic noise is well stopped by the windows, while inside walls and doors are very thin, so people arriving and talking late at night can be disturbing. Anyway there are only few rooms, so there isn’t much back & forth. But if you want to avoid an irritating night awakening, ear plugs are definitely suggested. Beds – definitely not the best bed I have ever slept in…. if you are a couple you may want to chose separate beds, because they are REALLY small and two persons can barely spin! Eventually considering the room rates, it’s the best solution you can find in Barcelona, and if yours is a short getaway that is the best solution. Plus it’s definitely very clean, and that was the most important thing for us.", "Date": "September 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Malmö,Sweden", "Title": "“Wonderful”", "Author": "Citytraveler76", "ReviewID": "UR18243500", "Content": "We stayed here for the Springsteen Concerts at Camp Nou, this hotell is perfect for all, great location, and than I mean great. The tourist buses (the red line and the blue line) is just 2 minutes walking time away. The Metro is even closer, just 1 minute or less. The airport buss is also just 2 minutes walk away. The Hotell is small, the rooms are small, but cozy and keept clean every day. The hotell is is on the 3rd floor on the building and we figured the only have 7 rooms to choose from. Our was room 405 with a small concrete balcony with views over the Plaza Catalunya (busy almost all night). The Crew working there was helpfull and always there 24/7, they had no bar (they closed it down 10 years ago) but they offered beers for 1 euro (estrella) and some other soft drinks includeding water. Just across the plaza in a big shopping mall there is a supermarket located underground. Buy your food whatever it might be, sallads, sandwiches, snacks. And also a great selection of wine, beers and visa versa and bring back to the hotell. They dont mind. Around the corner small pubs and bars are located, prices are everything from 5 euro to 20. Mcdonalds and burger king is just 1-2 minutes away. ATM machine is just 1 minute walk away. And Tourist info is also located in the plaza. I had my doubts before leaving to Barcelona about safety and location, but this place was just the best on our tour these past 7 months following the Springsteen Tour. Would we stay here again ???? YEEES. For 4 nights we payed 320 euro.", "Date": "July 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Maidstone", "Title": "“Great Location, Low Price”", "Author": "Orphis", "ReviewID": "UR15032135", "Content": "Hotel Ginebra is located on the plaza de Cataluna and is really about the ideal location for any sightseeing in Barcelona. It is right on top of a major subway stop, and within 500 feet of the airport bus and tourist buses. The hotel is on the 3rd floor and you ring the bell and ask to be let in. I would recomend you take the elevator up as it seemed to be more than three floors if you walk up. The rooms are very clean but small and rather basic. Most of the rooms look over the plaza but they do have a room that has no view and is very quiet. The walls are not the thickest but with only 10 rooms there is never much going on outside the room. The staff do not speak much english, so dont expect any recomendations for restaurants, but they are nice and did try to recomend a restaurant but it was lost in translation. They do have a communal room with a larger tv and large table that could be nice for a larger group to play cards or have a nightcap. I never saw it being used except for guests who left luggage in the room after they checked out so they did not have to carry it around on their last day. They also sold beer, soda, water, etc... for 1.50 euros which is quite reasonable for a hotel. Booking the rooom requires you to search for the hotel website on google and to email them direct. They got back to me the next day and confirmed a single was availble for 40 euros a night. I cannot see staying anywhere else as the room is just for sleeping and the price cannot be beat. Also, the hotel and room were cleaner than about any other hotel I have ever stayed in and if ther housekeeping was very good. The value for 40 euros is amazing and I don't really understand why the rate was so low and how they can afford to stay open when they only have ten rooms and have someone working 24 hours a day.", "Date": "April 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "inglesa en barcelona", "Title": "“clean and cheaper”", "Author": "sky1976", "ReviewID": "UR12488534", "Content": "excellent location, very clean and cheaper", "Date": "January 10, 2008"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Too small and noisy”", "Author": "Ivt", "ReviewID": "UR4592365", "Content": "I stayed at this hotel for one night. Room is extremely small (I mean really small - I hardly remember staying in a smaller room, and I'm used to european and not US standards). No conditioning, which is important in Spain even in Sep. Room was blocked with scaffolding. Because it was really hot, I was almost swimming in my bedsheet. Advantages: cheap, right in the center. So, in cool season it might be option to consider. Next time I just rented an appartment, I think it's a much better option in Barcelona if you stay for more than 3-4 days. Toilet bowl contains smth like shredder, which produces loud noise and you can here it from other rooms as well. Noisy. Smell isn't good. A girl which showed room to me, asked me to wait, ran before me and deodorazied it. I didn't help. Furniture seems old, and in bad condition.", "Date": "March 8, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "2", "Service": "4", "Rooms": "2"}, "AuthorLocation": "Bournemouth", "Title": "“Only for Littlies”", "Author": "A TripAdvisor Member", "ReviewID": "UR3944544", "Content": "Great location, but not for the \"larger\" family. Our room was tiny, and the en-suite was for shorter persons only. If you share a room, it better be with a very close friend! Unfortunately due to exterior refurbishment, the whole building was covered in a tarpaulin, so we got all the noise, none of the view. But the staff were very helpful and friendly, and the beds were clean. What more could you expect for the price!", "Date": "September 28, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Francisco, CA", "Title": "“Great location and price! Nice people too”", "Author": "A TripAdvisor Member", "ReviewID": "UR2608227", "Content": "I stayed at the Hotel Ginebra for seven nights in Sept. 2004 and thoroughly enjoyed my stay. I found it fairly quiet as I had a single room that faced inward and did not share a wall with another room. The room was clean and housekeeping kept it that way. The hotel has a prime location and the price met my budget. As a first time visitor to Barcelona and Europe I found the staff to be friendly and enjoyed the intamacy of only 12 rooms. I would definitely stay there again.", "Date": "September 29, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Oslo, Norway", "Title": "“Inexpensive hotel with excellent location”", "Author": "A TripAdvisor Member", "ReviewID": "UR2298627", "Content": "My sister and I stayed in Hotel Ginebra for five nights during a vacation in June 2004. The location was excellent, just off Placa Catalunya. The room was clean and the towels were changed every day. Another review on the site said the room was small and the hotel noisy. Our room was big enough - we were out all day shopping or sightseeing and just needed a place to shower and sleep. For this there was plenty of space. When the people in the room next door spoke we did hear them quite well, but we were not at all bothered by noise. We paid 75 Euros per night. Considering the location and the prices of other hotels with available rooms, this was inexpensive. All in all we were very happy with our choice of accomodation!", "Date": "July 14, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Portland, OR", "Title": "“tiny and loud, but great location”", "Author": "A TripAdvisor Member", "ReviewID": "UR1789646", "Content": "I booked a room here after reading a review in the Time Out guide book and stayed for 3 nights in 3/04. It's a great location; the family that owns it is super nice, but the rooms are tiny and noisy. I could hear entire conversations from the people staying in the adjacent room. I can't say that I'd stay here again, but if the noise and lack of space don't bother you, it's a great location and not too expensive.", "Date": "April 17, 2004"}], "HotelInfo": {"Name": "Hotel Ginebra", "HotelURL": "/ShowUserReviews-g187497-d208589-Reviews-Hotel_Ginebra-Barcelona_Catalonia.html", "Price": "$119 - $237*", "Address": "<div class=\"amenFloat\">", "HotelID": "208589", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/15/f9/fb/hotell.jpg"}}