{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Zagreb, Croatia", "Title": "“excellent location”", "Author": "BoyZagreb", "ReviewID": "UR128469661", "Content": "greatest advantage of the hotel is good location Although our room had a view on the main street there were no problems with noise furniture is a bit worn but clean room satisfying breakfast all staff does not speak English The hotel will be closed from November to March to renovations", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "India", "Title": "“Central location. Brilliant service. Moderately priced.”", "Author": "OnceInALongWhile", "ReviewID": "UR127614980", "Content": "Granvia is a good hotel in central Barcelona. Location: Barcelona is a moderately large city by European standards, and any tourist would want to get the most out of their visit by choosing a hotel as close as possible to the monuments/museums in the city centre. Hotel Granvia is located on one of Barcelona's main roads, the eponymous Gran Via. Even better, it is just about 100m north east of the Placa de Catalunya, the primary square and bus terminus in Barcelona. The Las Ramblas shopping-and-cafes street is only another 100 metres away, and the La Pedrera (Barcelona's most famous Modernist building and one of the most important museums) is only about 5 minutes' walk northwards. Going by the location, Granvia is a brilliant choice. Room: Clean and efficient. European standards of room size apply of course, meaning that the rooms will never 'meet' one's expectations of size, let alone exceed. Together with the room's small size comes the problem of cardboard walls, which may be disconcerting for light sleepers. I woke up one morning hearing my phone ring, but in fact it wasn't mine, it was actually the person's next door. This is normal for Europe, so it shouldn't come as a surprise to some travelers. My room had adequate cupboard space. The toilet was clean and the shower worked well. There were no free electric sockets in the room, so I had to disconnect the TV and twiddle my thumbs as my laptop got charged. Equally disappointing was the view from the window - there's a whitewashed blank construction wall about 10 metres from the hotel's west-facing wall. Service: Staff was very courteous and helpful. On arrival I wasn't handed the standard form that hotels normally ask guests to fill in. The elevator is large enough for heavy luggage. Wi-fi was free and worked very well; speeds were good enough to support voice and video chat on Skype, but Youtube videos took time to buffer. The breakfast spread was good and came free with three nights' stay. In summary: Highly recommended. Tip: Granvia is part of the Nunez i Navarro group (nnhotels.com), a chain of 5-10 hotels in Barcelona (perhaps other cities as well?). If you are looking for a hotel with similar service values but in a different location, you might want to check out their other properties.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Port Orford, Oregon", "Title": "“Wonderful stay at the Hotel Granvia”", "Author": "bicyclebetsy", "ReviewID": "UR127044811", "Content": "We recently stayed 5 nights at the Hotel Granvia. Because of a recommendation in the 2012 Rick Steves guidebook on Spain I booked online directly with the hotel. It was just what we wanted: quiet, comfortable, wonderful location and great breakfast. The staff was courteous and helpful. We asked for and got a lovely room in the back of the hotel overlooking the patio. It would have been even better if it had not rained. It was very easy to book online. In fact, I had to go back and change the booking when I noticed that I had only booked a room for one person. The directions included in the booking enabled us to take the Airbus into Plaza de Catalunya, and walk to the hotel with our luggage. Because of our early flight out we asked for a wakeup call, which was done by a real person, and a taxi, which was at the front desk when we came down at 4:30 A.M. The room was a little worn, but very clean and comfortable with a good bed, and room to move around. There was a safe, and free wifi. The location was wonderful: We were able to walk to the port on Las Rambles. To the Barcelona Cathedral and Barri Gothic. To the Palau de la Musica Catalana for a performance. To the Picasso Museum and to Antoni Gaudi designed apartments of the Casa Mila and the Casa Batllo. For the Sagrada Familia, Park Guell, and Montjuic we used the Hop-on Tourist bus accessed at Placa Catalunya. The subway was nearby, but we did not use it. There were several dining options available close by. I would recomend this hotel to anyone on their own in Barcelona. We would certainly stay there again. Mary E. Bures", "Date": "March 31, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Rohnert Park", "Title": "“Excellent Stay”", "Author": "ygwhitty", "ReviewID": "UR126762744", "Content": "We werent sure what to expect upon our arrival in Barcelona since we had only seen photos of this hotel. We were so pleasantly surprised! The location is right in the middle of the city and pretty much all the places you want to visit. Streets all of full of shops, Las Ramblas 10 minutes away, and 2 of Gaudi´s most famous work just blocks away. Carlo at the front desk was so helpful on our first day...gave us a map and explained the city area along with the metro system. Very clean rooms and cleaned daily. Breakfast was always good and the coffee was the best. It was a great value and would stay here again.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "West Sussex", "Title": "“Good location, good hotel”", "Author": "LifeOfRileeee", "ReviewID": "UR126634202", "Content": "I used this hotel recently as a base for a week's holiday in Barcelona. I was very pleased with the location and the facilities. The hotel could not be better located in my opinion. Not right on Las Ramblas but a 5 minute walk away from the start of it. Also a 3 minute walk away was Placa ce Catalunya where you could get a bus directly to the airport, use left luggage facilities and book excursions and trips at the Tourist Information office. There is also a metro station right outside the hotel entrance. I didn't use it myself but the hotel has a beautiful sitting room full of chandeliers and lovely furnishings. The single room I had was not massive but big enough for my purposes. Shower was always hot, wifi was always fast and working and my room was well cleaned every day. My breakfast was not included so I only had it once (it was very good but I didn't want to pay €10 every day) - instead I went round the corner to a cafe above a bookshop on Pau Claris where you could get a light breakfast for under €5. Overall, a very good hotel with an excellent location.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Your experience may vary (greatly) depending on your room”", "Author": "Japan_Expat_07", "ReviewID": "UR125553009", "Content": "I tayed here for a conference and had a mixed experience. Generally speaking this is a nice, European style hotel in a fairly good location. It's close to Las Ramblas, but not right on it, so you don't get the crowds. It is close to several metro lines, so getting around Barcelona from the hotel is pretty easy. The staff is nice, and they do make an honest effort to be helpful. The rooms are typical European, and many (if not all) have two single beds. The beds are very, very firm, so depending on your personal preference, that'll be either good, or not. The rooms are clean but have minimal amenities. On the downside, the walls are thin. I could actually hear the person next door snoring as if they were next to me. Note that this hotel, like so many others in the region do not have irons in the room. The hotel will press your shirt for you, and they do have laundry services as well. They have a fridge with the usual stocked items of beer, wine, soda, and water. The biggest issue, and what will impact your opinion of this hotel is that the rooms differ widely in their acceptability. The room I was originally assigned was on the interior of the hotel, overlooking a closed up 'courtyard' that overlooked the glass roof of the lobby area. As it was winter, the hotel had shut down the A/C, but unfortunately by doing so, they removed any possibility of air circulation, or fresh air. The week we were here was warm, but there was no way to cool down the room, and when I asked the hotel, they said to open a window, but due to the fact that the interior courtyard is totally closed off, there is no possibility to get fresh air. The second big problem I had with the room was that the sewer smell came in through the bathroom. Again, without the ability to circulate air, this made being in the room very unpleasant. When a new room opened up (3 days later) it was on the outside of the hotel and had a view of the external courtyard. What a difference! Fresh air, no sewer smell, a nice view of the courtyard. Fantastic! Check below for what rooms to ask for, and what to avoid. In general, make sure you do not get a room on the interior part of the hotel. To help you, here are the rooms you should ask for: 110, 111, 112 (all have small balconies) or 210 (my room), or 213. When making a reservation, be sure to ask for a room on the back side of the hotel. Rooms on the side will have no view, and rooms on the front will have the street noise. Rooms to avoid are 116, 211 & 212 and any interior rooms on the 3rd or 4th floors (I didn't see a room layout map for those floors) As for the rest of the property, the breakfast is a simple buffet, but good. They have a small internet kiosk area, but I didn't need to use it as they have excellent wifi coverage throughout the hotel. Lastly, next door is a small tapas bar that is open late and has good food and some local beer that is nice.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Gdynia, Poland", "Title": "“Good location”", "Author": "bezetka", "ReviewID": "UR125224011", "Content": "Impressive location and very good price, Small window facing air shaft.Skimpy pilows,bathrooms are very tired. Annoing noise from the building next door-from 8am to 7pm. I don't recommend.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location, awesome breakfast”", "Author": "JubilantBeggar", "ReviewID": "UR124493815", "Content": "The location of Granvia is excellent. Literally outside of your doorstep is the subway, which allows you to quickly travel all over Barcelona. Within a couple minutes you can walk to the Ramblas and Playa de Catalunya (great people watching spot and drop off point for the airport bus). If high end shopping is your thing, you are only a minutes walk away from Chanel, Armani, etc. If you want to see one of Gaudi's masterpieces, Casa Mila is a 5 minute walk up the road. The hotel was running a promotion during our stay, so they included breakfast in the room rate. It was excellent! Pastries, meats, cheeses, fried eggs, bacon, espresso machine, breads, fruit, yogurt, milk and cereal, 4-5 different kinds of juices, etc. Easily the best breakfast I've seen provided by a hotel in Europe. The rooms were clean and the price was right. The walls are thin, so we could hear a yelling little kid next door, but that's par for the course in Europe. The building next door is performing construction, so from about 8am-7pm you can hear a fair amount of construction activity. We wer gone most of the time, so it wasn't a huge bother. All that to say, we'd definitely stay here again if we find ourselves in Barcelona.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Beautiful Hotel”", "Author": "Aidaco", "ReviewID": "UR123283483", "Content": "We stayed for two nights after our Mediterranian cruise. We were very happy to find this hotel. Beyond my expectation. Great location, walking distance to the square, La Rambla, Tourist bus, etc. Reasonable price for a great hotel. Breakfast was good, Staffs are friendly, helpful and polite. I would definitely stay again in this hotel next time I am in Barcelona.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "tucson,az", "Title": "“Perfect place to stay for a Barcelona Holiday !”", "Author": "artemis_zeus", "ReviewID": "UR123110123", "Content": "My daughter and I stayed at this lovely hotel in November 2011 and absolutely loved it ! It is the perfect combination of an ideal location to visit Barcelona, and a historic gem oozing with character and atmosphere ! Our room was beyond our expectation - huge and well appointed (see the pics). Our breakfast was included in our on-line direct book reservation and it was a delicious and money saving way to start our long days of visiting this incredible city. The hotel has a royal yet intimate feel and I felt like I was living in a period movie. You can get a hip modern hotel anywhere in the world, but this atmosphere is unique and historic. When I return to Barcelona I wont look any farther than the HOTEL GRANVIA.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Nice Cozy Hotel”", "Author": "ilikehawaii", "ReviewID": "UR122333801", "Content": "I stayed in this hotel for 9 nights with my ten-year old daughter. The hotel has a very convenient location - close to Metro, buses, and lots of sightseeing spots. The front desk staff are very friendly and helpful. Breakfast buffet has a variety of pastry, bread, hams, eggs, fruits, juice, coffee, and tea. The room we had is small, but big enough for us. The bathroom is clean. There are a safety deposit box, TV, wi-fi, and a fridge in the room. We stayed at the street side with a mall balcony, which was requested by me when making the reservation because we'd like to see the Christmas lights on the street. The noise level is acceptable to me, but if you have a low tolerance level with noise, you may want to stay at the other side facing the garden. We would like to stay there again.", "Date": "December 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Feels More Like a Hostel”", "Author": "BinkieM", "ReviewID": "UR122300246", "Content": "The hotel is very small and feels more like a hostel than a hotel. I took a chance on a single room and it was TINY. I am not a big person, 5'4\", average weight. The worst part was the shower. It is impossible to call it a bathtup because it was no more than 3 feet. It was difficult to step into. The first room I went into had a window that faced an airshaft and wall, absolutely claustrophobic. So I went to a second room which particially faced the patio. It was not an unobstructed view, this room partically faced the airshaft and wall. There is another review that calls this room 1950 decor. I would agree. I generally like old-fashioned but this was well below \"shabby chic.\" The key to the room was very old fashioned they should convert to magnetic keys. The location was good and the service was acceptable. I would not go back.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Shreveport, Louisiana", "Title": "“Nice place!”", "Author": "Sara923", "ReviewID": "UR121929417", "Content": "I stayed at Hotel Granvia with my mom and dad in late November 2011. The location of the hotel was very nice! It was walking distance to Paisaje de Gracia and Plaza Catalunya/las Ramblas (don't worry, las Ramblas is actually a safe place, despite comments otherwise). The metro was nearby. Plenty of nice shops/restaurants. The hotel was charming inside. Internet access was free. We initially had a balcony room facing the street but requested a room further away from the street for less noise. It was perfect...no issues with noise there! We never had breakfast in the hotel, but a few other guests we had talked to said they enjoyed it. The cleaning service was nice and the individuals at the front desk were helpful with directions. Some were more friendly than others though. I particularly liked Carlos. All in all, this was a nice stay in Barcelona!", "Date": "December 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "belgium", "Title": "“old Europe charm + location”", "Author": "kikaan", "ReviewID": "UR121640449", "Content": "This hotel dates to the 30's . It has kept all features of that age without appearing worn or derelict. The breakfast hall looks like a ballroom. There is also a huge \"salon'\" which could be the background for a film about European nobility at the turn of the last century. And : it is situated right behind the corner of the very center of Barcelona on a broad boulevard.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Great location in city centre”", "Author": "Earwigo321", "ReviewID": "UR121445991", "Content": "Location 9/10 - Very central, shops, underground, airport bus and old town all within 5 minutes walk or less Rooms 6/10 - All are rather old and worn but large and have everything in them one would expect. Lighting was poor in our room and there was only a tiny window which made the room a bit depressing Beds 5/10 - Small and not that comfortable Bathroom 6/10 - Bath and shower but again rather old Public areas 8/10 - Very grand and palatial - see this video on YouTube http://www.youtube.com/watch?v=qzd1L5eK_eg Breakfast 8/10 - Plenty of choice in a very grand setting Staff 8/10 - Polite and helpful, spoke good English Value for money 8/10 - We paid £80 for a twin room B & B in November but would only return if the price was no more than £100.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oslo", "Title": "“Nice hotel, good location”", "Author": "VacationOslo", "ReviewID": "UR121422992", "Content": "This is the second time I'm staying at this hotel. The location is perfect, close to the airport bus, near La Rambla and close to train/metro station at Placa Catalunya. The public area of the hotel is very nice. The rooms are a bit worn. The beds are hard and noise from both the hallway and the street outside is noticable. If it is disturbing would be individual I guess. The rooms may need some rehabilitation, though the rooms looks clean, and there is wooden floor, as we are used to in Scandinavia. Wall-to-wall-carpets is not very nice I think. The breakfast was nice and was included in the hotel price. It was also possible to buy breakfast for approx 10-11 Euros pr person if it wasn't included in the hotel price.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Pass On This One”", "Author": "cokeguy72", "ReviewID": "UR120879740", "Content": "Hotel room was very cramped - even by European standards - and the bed was nothing more than a thin matress on top of a wooden base. The courtyard view was nothing more than a \"void\" in the middle of the hotel's square layout. The hotel is located very close to desirable Ramblas area but the noise, unsafe surroundings, and old & dirty exterior make this a bad choice. Better hotel choices exist only a block or two away.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Leamington Spa, United Kingdom", "Title": "“Not what is portrayed by its website”", "Author": "Simon L", "ReviewID": "UR120656039", "Content": "Booked a double room for 3 nights, got given a twin room and told there were no more rooms left when I went back down to front desk to enquire about changing. It may have been a nice room once - perhaps in 1950. Not a nice antique room or a modern room, just one with 1950s veneered wood and broken fittings, and the lighting of a hospital for atmosphere. There was a light above each bed, but only one switch to operate both, so it was all or nothing. Room was airless but the windows opened in to some kind of roofed atrium, and not a pretty one at that, so no air circulation. The aircon had no effect in moving air around. TV was in a different 'room' that could not be seen from the beds, and there was no chair to sit on in that room to watch it, so lucky I only wanted to see a weather forecast. Breakfast was good, front desk staff were friendly. That was the best of it - checked out after the first night (and so got charged for breakfast.)", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Pedro Garza Garcia, Mexico", "Title": "“Excellent”", "Author": "alexsep", "ReviewID": "UR120594585", "Content": "We chose Gran Via to stay five days prior to our cruise. It is an excellent hotel with a very good location near Plaza de Calunya and las Ramblas, near the metro an train station. Our room was simple but comfortable and very clean. The staff great, breakfast very good. October 23 to October 28 2011. Alejandra", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moorestown, New Jersey", "Title": "“Great location, great value, great staff”", "Author": "curley207", "ReviewID": "UR119873105", "Content": "We stayed for 4 nights, 2 of which were the Romantic Package (includes a bottle of wine and a wonderful meal at one of the other hotels in the chain). Our room was spacious for Europe and very comfortable and clean. The location was perfect - we walked to the Palau de Musica de Catalana, Gaudi's Casa Mila, and Las Ramblas. Only a block and a half from Placa de Catalunya where the Aerobuses stop from the airport - don't get a taxi from the airport - the taxi was about 34 Euros, the bus was 5.3 Euros each and stopped so close you could easily walk to it in less than 10 minutes. The staff was wonderful and helped us with dining and suggestions about getting around town. The metro is a 2 minute walk and we got a 10-ticket card which we both used for 5 round trip tickets. The metro is really easy to use and we never felt unsafe. Because of loud construction next door, we asked to be moved for our last day and we were moved to the former library - a huge room with chandeliers, a fireplace, and a separate sitting area. The staff was very accommodating. The breakfast had so many choices, it would satisfy just about anyone. We would stay there again if we went back to Barcelona. When you go, check out what is going on at the Palau de Musica - it is a magnificent building - one of the most beautiful concert venues I have ever seen.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Palma", "Title": "“Good location”", "Author": "Laura R", "ReviewID": "UR119537847", "Content": "The building is lovely, great location minutes away from Plaza Catalunya & centre. The room we had was nothing special but fine for a night. We had a small balcony which was very nice. It must have been a beautiful home in it´s day.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tampa, Fl.", "Title": "“Great room in the heart of Barcelona”", "Author": "Hotguymike", "ReviewID": "UR118998521", "Content": "My wife and I stayed here in May 2011. The room was spacious for Europe, and a bargain at $120 Euro a night. Breakfast was included and was well stocked with eggs, ham, cereals, fruit, tea/ coffee, juices, etc. Free wifi and computers were available. View was nothing to write home about, just an ugly courtyard, but I requested that so that we would have quite nights, which it definitely was. The street view rooms are lovely, but louder (in- laws stayed in one). The location is prime- only five minutes walk from Placa Catalunya and bus to the airport. Several metro lines are all very close, so it is simple to get anywhere in the city. I would absolutely stay here again.", "Date": "October 6, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Norwich, Norfolk", "Title": "“Beautiful building, perfect location”", "Author": "typographer", "ReviewID": "UR118099576", "Content": "My wife and I stayed at the Granvia last summer for a week: my cousin came along with us and she booked a single room (one of the reasons we chose the Granvia, as so many hotels do not have single rooms). The first impression was great: a real 19th century Barcelona mansion, the kind of place I'd always wanted to stay in when I was bringing groups of art students to stay in very basic hostals. Staff were extremely helpful: the senior man at reception spoke very good English and all staff there were very happy to order taxis for us and provide information on local restaurants. The room was fine, with a window onto the internal airwell which itself faces onto the roof. We had very little awareness of street noise, despite being on one of the main thoroughfares across the city. The communal lounge was magnificently appointed with chandeliers, paintings and handsome furniture (also internet access provided). This opened onto the roof garden, a large space with a shady loggia for evening drinks. We did not take our breakfasts at the hotel, but only because we were on a budget and it was rather expensive (11 euros?), but the dining room was as elegant as the lounge. We found a great cafe round the corner on Pau Claris, above a bookshop, where we had a buffet breakfast every day in pleasantly bohemian surroundings. The location is difficult to beat: I have visited the city on more than a dozen occasions and really think this was the best area to stay in, only 100 metres from Passeig de Gracia for the posh shops and street cafes, two of Gaudi's greatest works just a few blocks away, Placa Catalunya round the corner and you are also at the centre of the transportation hub. We would return to the Granvia without hesitation.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "New Jersey", "Title": "“More than satisfied”", "Author": "NJ_Bettan", "ReviewID": "UR117788102", "Content": "We had a double room that overlooked the main street. Muffled street noise but not a problem at all. Very happy to have air conditioning as it was hot and muggy outside. Marc was very helpful when we needed to print our boarding passes. Breakfast was included in the price - would not have purchased it otherwise - very good start to the day. All of the staff was friendly.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“excellent”", "Author": "fedeida Posted by an OctopusTravel traveler", "ReviewID": "UR117387515", "Content": "superb location a few steps away from almost everything in town, very good staff, reasonably priced. the only weak point is breakfast, which is a bit pricey, but there is plenty of coffe shops nearby. great feeling from its old-fashioned allure: in other words it's more like being hosted by a healty family rather than staying in an hotel. unmissable!", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Centreville, Virginia", "Title": "“loved the hotel”", "Author": "Jeff N", "ReviewID": "UR117180915", "Content": "We had a triple room that had ample space for three. The room had all the amenities we needed. The courtyard was a nice place to relax. The staff was extremely friendly and helpful. The location of the hotel was great.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Excellent value in superb location”", "Author": "Sarget", "ReviewID": "UR116798191", "Content": "We stayed at this hotel pre and post mediteranean cruise from Barcelona. We had been to Barcelona before and knew that most reasonably priced hotels in a good location close to the Las Rambala are either extremely noisy or very basic hostel style. I stumbled across an exceptional deal with Hotels.com.au and we booked 2 double rooms with private bathroom and basic small fridge for my husband and I and my 19yo daughter and her 2 girlfriends. The Hotel is a short distance from Paseig de Gracia metro direct transport from the airport (buy a T10 multitrip if you are there for a few days) and is conveniently located for local supermarket shopping to pick up small goods and breads, alcohol anything you need, as well as walking distance or a couple of metro stops to major attractions such as Las Rambalas or the Magic Fountain. Gran Via has very attentive staff that will advise you on busses and attractions as well as well as a palacial character sitting room and massive outdoor courtyard to enjoy an alfresco lunch of small goods and fresh bread and Cava that you can pick up from a supermarket nearby. Overall for just over $100 per night for a double and $120 for a triple room (without breakfast there are plenty of nearby coffee/pastry shops nearby) this was exceptional value! If you are looking for clean quality 3 star in exceptional location you will not be dissapointed!", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Annapolis, Maryland", "Title": "“Fantastic hotel for a great bargain - Stay here for sure - especially with kids!”", "Author": "vicg5349", "ReviewID": "UR116767044", "Content": "We stayed at the Hotel Granvia for 6 nights and it was absolutely perfect. The hotel is gorgeous as it is an old bourgeoisies palace built in the 1870's. Our room was a family room (2 adults and children ages 9 and 7 years) and it was huge and gorgeous. The staff speaks English well and were very helpful with everything. There is free internet access through a hotel computer and free WiFi in the rooms. The location could not be more perfect. It is 2 blocks from the Placa Catalunya which is the center of town (and tourism office and the Corte Ingles Department/Grocery Store) there is a metro station a half block away (Passeig de Gracia station) and the art nouveau block begins a half block away also (the Passeig de Gracia street). All of the best restaurants we experienced were in this area and could be walked to and it is far enough away from Las Ramblas to avoid any hint of seediness. The hotel has a stunning salon and we paid for breakfast to be included and the breakfast was also great. Each morning a large selection of pastries, chocolate and plain croissants, eggs (scrambled and fried) and chorizo and ham you could slice yourselves. There is a gourmet coffee maker where you put your cup and get delicious coffee. The salon opens to a courtyard that also has some small playground equipment to the side (small slide, seesaw, etc) -- this was a great break for our kids after sightseeing. We have traveled quite a bit and I think it was an incredible deal for a wonderful hotel that I think exceeds the 3 star rating for sure!", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Yokohama, Japan", "Title": "“Nice location, breakfast, service, and reasonable. But, the elder staff is sometimes impolite.”", "Author": "mako7", "ReviewID": "UR116045763", "Content": "I stayed over 7 nights at this hotel. It was a reasonable hotel. The hotel is located at the central area of the city. And, the breakfast is included in the price and good. The young staffs are kind and supportive. One problem is that an elderly staff is sometimes impolite. For example, when I forgot my room key in the room when checking out, he complained much about it. ( The key was soon found in my room.)", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“A great experience”", "Author": "Romashka3", "ReviewID": "UR115796746", "Content": "We enjoyed staying in this hotel. It’s a former 19th century mansion that was some rich family’s residence, and staying at the hotel definitely transported us back in time (in a good way). The common areas are beautiful – antique furniture, paintings, glass cases with books, photos and memorabilia; the décor didn’t feel fake and forced. The room was spacious, clean, adequately furnished (chairs, table, nightstands), the AC worked fine, the wireless internet was fine, the TV was helpful in late evenings, the big window opened to a quite inner court. The bathroom was nice – with daylight and enough counter space, a little stand for toiletries (what a great idea!), with all the usual amenities (hair dryer, toiletry packs). Location was great – short walk to the subway, a Bus Turistico stop, Las Ramblas. We found the younger personnel to be friendlier, very accommodating, speaking good English. The older man we saw at reception desk was a bit brusque. Our reservation included a free breakfast, which we loved: good variety and quality, it seemed like it could please and accommodate just about anybody’s tastes and habits. We used a bottle of water from the minibar that was billed to us at a higher price at the end, but when we mentioned that the price we saw was less, the bill was adjusted in a completely courteous manner, with no conflict whatsoever. Overall, an interesting and a well-run hotel that we would definitely choose to stay at again.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "St. Louis, Missouri", "Title": "“We loved this spacious grand siecle hotel”", "Author": "etatsunis", "ReviewID": "UR115634982", "Content": "Our room for three was very spacious. Good air conditioning. Excellent buffet breakfast. Very helpful people at the reception desk. We left some items in the room by mistake when we left but, with several emails from the US, those items were retrived and mailed to us. This is a former banker's home (or palace) from the late eighteenth century. That old fashioned style has been maintained. We loved that. Some many not.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Great location but beware the 'free breakfast' they make you pay for”", "Author": "jtsperansky", "ReviewID": "UR115404285", "Content": "Great location just a few steps from the metro station. Central to many restaurants, bars and shopping. Easily took the metro to all locations of interest. I had booked a room online which included 'free breakfast' as part of the room rate. However, I was billed 10 euros a day for breakfast. We argued this with the front desk when we checked out, asking how free breakfast can cost 10 euros a day, but he pretended not to understand and after 15 minutes we got frustrated with him and just left. On top of this, the buffet was terrible so we only tried it for only the first morning. However, we were billed for breakfast for all the days we stayed at the hotel. Front desk agent said we have to pay for breakfast everyday whether we eat there or not. How is any of this 'free breakfast'?? Check your bill for added charges like this.", "Date": "July 15, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“great location, decent hotel”", "Author": "Tpmp1620", "ReviewID": "UR114700519", "Content": "Hotel Granvia is built in an old mansion, so not the modern feel you might get elsewhere in Barcelona. The hotel was very standard, but also very centrally located. We were able to walk most places and the few times we needed to take the metro, it was just outside our door. Additionally, the hotel was an easy walk from the airport bus that drops you in Placa Catalunya. We left on a bit of a sour note as we learned on our last day while checking out that breakfast had been included in the price of our room. For obvious reasons, we would have appreciated learning that upon checking in.", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“wonderful stay”", "Author": "mialope", "ReviewID": "UR114687357", "Content": "My wife and 3 daughters and other relatives stayed at the Granvia for 4 nights,the welcoming by Carlos at the front desk was excellent,Carlos was always helpful and made our stay a comfortable and enjoying one,always willing to assit. This hotel is very centrally located,very nice clean rooms,a lovely breakfast room with good selections. Thsi is a well managed establishment with a great staff at all levels,Carlos deserves all the congratulations for his outstanding services,will surely return to Hotel Granvia.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "florida", "Title": "“a special hotel”", "Author": "galdaldoc", "ReviewID": "UR114230257", "Content": "We spent three days at H Granvia and found it to be a great hotel in a terrific location. It is within walking distance of many sites and the metro and bus connections are also close by. Staff was very friendly and helpful. The breakfast buffet was more than ample. I recommend leaving the main area of Las Ramblas and investigating some of the side streets. There we attended a guitar concert in a church, saw Roman ruins and stopped at an art fair in a small plaza. Check out the jazz at Casa Fuster; the food there was exceptionally good. The park near the Picasso Museum is lovely and the zoo within the park is very modern with a wide variety of animals. There are great chocolate & pastry shops in that area.", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Ames, IA", "Title": "“Faded gem”", "Author": "williedillo", "ReviewID": "UR114114674", "Content": "We chose this hotel based on location and the offer of free breakfast if you stay more than two nights. The public spaces of the hotel are just as attractive as the web site suggests. You have your breakfast (which is very good) under huge crystal chandeliers and the hotel has a very attractive terrace out back for drinks in the afternoon or evening. But, the room was below that standard. Based on the recommendation of a popular guidebook, we requested an interior room to avoid street noise. That was not a wise choice--the room was small, musty, and drab. Unfortunately, we could not move to anything better as the hotel was full. If we go there again, we'll ask for a back room facing the terrace--got a glimpse of one when it was open for cleaning and it looked very nice.", "Date": "June 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Great Hotel,fantastic location,breakfast galore”", "Author": "benearme8", "ReviewID": "UR112511917", "Content": "Hotel Granvia is a great choice ! Front desk are very helpful with directions, booking tours and greets you. Our room is spacious and quiet overlooking the courtyard. Bed is comfortable, bathroom is very clean. This hotel is in a great location. Very accesible on buses from airport and back. Closeby to La Ramblas, restaurants, coffee shops, grocery, department stores. Breakfast here is amazing plus the breakfast room is beautiful as well as their living room and courtyard. The only problem we experienced is the wifi in our room is not always working, especially at night when you wanted to check your email before bed. We hope they can put a better wifi service next time. But other than that, this hotel is great and we will stay here again !", "Date": "June 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Jemison, Alabama", "Title": "“wonderful small hotel”", "Author": "basaffi", "ReviewID": "UR111769314", "Content": "we were a family of three adults, stayed here one night. this was a great, small, unique hotel. we stayed here one night after a cruise and found it to be very comfortable. we arrived early and they had a salon where we could wait until our room was ready. we used it for a short time and then decided to leave our luggage with the front desk while we explored the many things close buy. it was more of a business area than previous areas we had stayed in, but was very near Las Ramblas and easy to reach other areas of the city. Our room was ready much earlier than they had thought, the front desk took our luggage to our room while we were out exploring. the room was a little small for three, but we were able to get by without any problems. we did not eat breakfast there because we headed early to the airport which is about twenty minutes away. we enjoyed walking around the neighborhood and we very much enjoyed the friendliness of the staff.", "Date": "June 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southfield, Michigan", "Title": "“just what we wanted!”", "Author": "sophiatravels", "ReviewID": "UR110379379", "Content": "Its a lovely older hotel: Very clean, safe in the room, modern bathrooms, a courtyard and great deal on breakfast. The staff are very nice. The Granvia is perfectly positioned for access to the metro and the train station for the airport. The Granvia is just a few blocks away from Las Ramblas, The Casa Milà, the Barri Gothic district (walked to the music center to hear classical Spanish guitar, church on Sunday too). We walked to most everything or hopped on the metro (its awesome). I had to say it was a tiny bit noisy as we could hear the neighbors a bit and some renovations during the day but everyone was generally quiet, except the birds in the courtyard (but i liked them, my partner , not so much) We has a great time in Barcelona and the Granvia was a good part of that, thank you! Jane and Steve", "Date": "May 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great all rounder”", "Author": "jockeygirl", "ReviewID": "UR110305441", "Content": "The rooms are more like a suite than a hotel room. The hotel is quite grand and it is run very professionally. Breakfast all you could ask for, good fridge, storage and bathroom. We were not sure whether we asked however we were accommadated at the back of the hotel so it was very quiet. Great value in a great city, our only fault is that we underestimated Barcelona and intend returning next October and will definetly stay in this hotel.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Montreal, Quebec, Canada", "Title": "“Old World Elegance”", "Author": "MTM45", "ReviewID": "UR106364355", "Content": "Staff was wonderful and helpful. Location is central and perfect for exploring by foot or public transport. Excellent value.", "Date": "May 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good choice in excellent location”", "Author": "Keen_traveller079", "ReviewID": "UR106352801", "Content": "We were so pleased we chose the Hotel Granvia. Having never been to Barcelona and chosen this because of its low price on the internet, we arrived with a little trepidation but were really impressed. It's not a luxury choice, but it's great value for money and its location is excellent. If you're after somewhere where you can get a night's sleep and some decent breakast in a central location, I'd recommend this. The reception staff were incredibly friendly and helpful, the room was clean and the breakfast buffet was excellent. The room we stayed in was basic - which was fine for what we were after and frankly much nicer than most you would get at this price. The TV reception wasn't good, but that didn't bother us because we didn't spend much time in there so we didn't mention it to the staff. And impressive as the communal areas - reception and hallways - still are, it does feel as though it's lost a little of its grandeur. Location is the biggest selling point. It's only a short walk to Placa Catalunya, the Ramblas, Gaudi's Casa Battlo, and bus and metro stops are a stone's throw away. You can easily walk to the Gothic Quarter in 15 minutes. If you're after luxury and have got the cash to pay for it, stay elsewhere. If you want great value, brilliant location and a warm welcome. go for the Granvia.", "Date": "May 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "maryland", "Title": "“Great Value, Great Location”", "Author": "watermelontravel", "ReviewID": "UR105503437", "Content": "The hotel Granvia was a very pleasant place to stay. It is very convientently located off the Aerobus route from the airport. The staff was pleasant and helpful with recommendations. The rooms were very clean and comfy. We had a room right on the street and while there was some street noise, it did not bother us. The hotel has a charming courtyard where we took our morning coffee!", "Date": "April 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Don't stay in an \"interior\" room”", "Author": "bac48", "ReviewID": "UR104975266", "Content": "We stayed 3 nights in this hotel which is well situated in the city. We were given an \"interior\" room - away from road noise!! I would have settled for road noise, instead we got echoed noise of cleaning staff from quite early in the mornings. Room was quite small but bed comfortable. Bathroom tiny but lots of hot water. Front reception staff were always helpful with suggestions and tips on what to see and the best way to get there. The breakfasts were quite good in a lovely room . We used the garden area and the salon (free wi fi). The elevator was broken on one of our days there and walking up 3 flights of stairs was not what we wanted after a day of sight seeing.", "Date": "April 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "syria", "Title": "“perfect location, good 3 stars hotel”", "Author": "marwan1975", "ReviewID": "UR100727717", "Content": "me and my friends spent 5 nights in hotel granvia ,2 weeks before.. location is really perfect, one block from passiege de gracia, 3 minutes walk to placa catalunia and 6 minutes to la rambla. public areas in the hotel are really magnificent, old and charming.. front desk people were nice, tried their best to help , but couldn,t help me at all to get tickets for barca football match against arsenal..which i managed by myself our courtyard facing twin room was small , clean (except heavy dust covering the old tv ), decent minibar ,safe and very comfortable beds. the free wi fi was a good bonus breakfast room was charming and nice, breakfast itself was excellent ..plenty and fresh. overall ..if you are looking for a decent 3 stars hotel in the very heart of barcelona.. and with 100 euoros per night.. hotel granvia is an excellent choice.", "Date": "March 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Warfield, Berkshire", "Title": "“Great Location”", "Author": "cazziebeebee", "ReviewID": "UR100392124", "Content": "Stayed 2 nights here in March. Hotel location was excellent. Close to the Ramblas and the bus drops offs at Catalunya Square. Twin room was spacious and clean, but was at front of hotel so lot of traffic noise. Breakfast was very good and the staff always courteous. One problem was the very thin walls you could hear everything from the next room - TV, talking, etc, and while we were there, we were up til about 3am listening to the general chit chat of a load of America girls who seemed to have congregated in the room next to ours. The weather was really awful with heavy rain. On the morning we checked out, we got caught out in the rain and soaked through to the skin. The hotel staff were very helpful and let us use one the smaller rooms to dry off and change before heading off again to the airport. We thought this was very good.", "Date": "March 16, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London, England", "Title": "“Getting on a bit, but never fails to please”", "Author": "alexmac", "ReviewID": "UR99620013", "Content": "Back to Granvia for the umpteenth time and its as great as ever; how does this place survive in the 21st Century. Great, elegant spacious communal areas with the same traditional faded grandeur, wonderful baroque chandeliered and mirrored breakfast room (with a very generous buffet presentation with the highest quality ingredients including brandy for your coffee if you´ve had a hard night!); and the same charming, efficient and helpful staff. If you don´t mind the hum of traffic noise ask for a high ceilinged room at the front- number 103 is good in that it has a rare balcony). And with Plaza Cataluña only 2 minutes walk away, the hotel is perfectly located to explore thge whole of Barcelona by foot. Notthe cheapest at around 100 Euros a night, but great value for a short break", "Date": "March 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brownsville, Texas", "Title": "“Charming stay in a charming building with an outstandingly charming staff!!”", "Author": "ruthie99", "ReviewID": "UR96980206", "Content": "The bulding is charming beyond words, in a safe and central area....the bedrooms are smaller and plain but with comfortable beds and very clean. Bathrooms are great... An older mansion converted into a smaller hotel (only 52 rooms). The salon and dining areas are just beautiful..... The staff was consistently and genuinely the politest and most helpful of any hotel I've stayed in from Asun Pajera (manager), the gentlemen at the front desk (Juan, Carlos , Ricard, Manuel and Xaviar) to the ladies who cleaned the rooms and served breakfast. We had a personal emergency at one point and the staff went out of their way to assist us...... When we checked in we were greeted by Carlos with \"this is your home, allow us to help you in anyway that we can...\" and that is exactly what happened.. Thanks Hotel Gran Via for a great three weeks! thanks to Rick Steves for an excellent recommendation!", "Date": "February 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“great place”", "Author": "DEN2551", "ReviewID": "UR93933555", "Content": "stayed at the grandvia jan13-15 and 18-30. arrived in the morning, room was ready great after an all night trans atlantic flight. this place is a gem, close to everything, great sfaff always helpful, especially richard and juan. would and will recommend the grandvia to all my friends", "Date": "January 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santa Monica, California", "Title": "“Excellent hotel in excellent location in exciting Barcelona”", "Author": "HappyTraveler4248", "ReviewID": "UR89460260", "Content": "We stayed twice in Hotel Granvia in late November and early December. The staff was very helpful, especially Xavier, Juan and Mark. Checkin was very quick. Both of our rooms were spacious and very comfortable and quiet, as they faced the back patio. The beds were a little hard for us. The rooms and bathrooms were very clean. The breakfast was extensive and delicious and worth the price. The location is superb, out of the conjestion of the Old Quarter, 2 blocks from Placa Catalunya and on major bus routes. The Passeig de Gracia train station was also very close. Restaurants abound in the area. The Modernista art trail is within walking distance or for Sagrada Familia an easy subway or for Park Guell an easy bus ride. The staff was also happy to keep one of our bags, while we were in other cities in Spain. One could not ask for a better hotel in a better location in Barcelona.", "Date": "December 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Corrales, New Mexico", "Title": "“Excellent location, helpful staff, pleasant atmosphere, great breakfast buffet.”", "Author": "LindaYCarlos", "ReviewID": "UR88470055", "Content": "It was an easy walk from Placa De Catalunya where the Aerobus terminated. Good location for catching the sightseeing bus which takes you everywhere you want to visit as a tourist. Hotel staff was very helpful in giving us instructions to find the train that would take us to the Sants train station. Breakfast was served in a very elegant setting and the salon room was also impressive. The room was comfortable enough and we enjoyed our stay, in spite of several days of rain.", "Date": "November 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lansdowne, Virginia", "Title": "“Very nice hotel conveniently located in heart of Barcelona”", "Author": "rahmani1000", "ReviewID": "UR87795134", "Content": "Overall very nice hotel, excellent location, clean rooms but fairly expensive breakfast. It is highly recommended! we were very happy with our stay there.", "Date": "November 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "cheam", "Title": "“gret location.great value”", "Author": "croge", "ReviewID": "UR87048062", "Content": "just returned from hotel granvia,arrived thurs evening,cab straight from airport,27 euro,good reception staff very helpful.Rooms fine two large single beds enough wardrobe space,bathroom very clean.lovely little courtyard for coffee.Hotel just around the corner to las rambles,bus stop outside no 56 bus straight to football stadium,lots of restaurants,bars within area.Asked reception staff directions etc,always happy to oblige.Have had a wonderfull three days break at a very good price,fitted in so much because of central location,and to top it all weather 22 degrees!Booked with expedia,flew easyjet and no complaints whatsoever!", "Date": "November 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leamington, Canada", "Title": "“Good value-Great location”", "Author": "brickwall26", "ReviewID": "UR85432664", "Content": "Well situated,just north of Las Ramblas.Reasonably priced,very clean.front desk helpful and friendly,nice breakfast available,the rooms are small but more than adequate for our needs,would definitely stay there if we were to return to Barcelona.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fremont, California", "Title": "“Comfortable & well-situated”", "Author": "m0neymaven45", "ReviewID": "UR84965220", "Content": "Stayed at this hotel on 3 separate occasions - twice with spouse, once alone. Most convenient to airport bus at Plaza Catalunya, a good 3-block walk, close to restaurants, shops, and Las Ramblas. On the 2nd reservation, we arrived to find it was cancelled due to a credit card change since making the reservation. The desk clerk arranged a taxi (paid by the hotel) to another more upscale hotel at the same rate for the night, then made sure we had a room on our return the next night. Although the other hotel was modern and luxurious, I preferred the ambiance of Hotel Granvia and its particular character. Our room was comfortable, a/c worked fine, we found staff courteous and accommodating. In the summer, the interior rooms are cooler than the ones facing the courtyard.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oslo", "Title": "“Perfect location”", "Author": "VacationOslo", "ReviewID": "UR84465518", "Content": "Great location near Aerobus and Placa Cataluna. A bit worn hotel, but nice staff. The room had", "Date": "October 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“Exceptional Quality”", "Author": "CharlieVVancouver", "ReviewID": "UR84008522", "Content": "My first visit to Barcelona was met with a great deal of research. I was looking for a hotel that matched the historic area. I selected the Hotel Granvia. The picture of the room on their website was exactly as the room appeared. An email was sent a few days ahead to confirm my reservation. I arrived tired. The checkin was short with a great assist in bringing the bags to our room. The staff answered all my questions concerning directions. They even allowed our bags to remain after checkout while we toured the Barri Gotic area prior to our cruise.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Happy we stayed here!”", "Author": "BonAppetit09", "ReviewID": "UR83795270", "Content": "We stayed here two times - at the beginning and end of our cruise. We were so lucky that they let us check in very early after our cruise. The staff was very friendly and helpful. The rooms were comfortable and clean. There is a charming courtyard, where we sat after a long day of sightseeing. The location was ideal - not only walking distance of many sights, but there was a Metro station right there.", "Date": "October 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "cumbria", "Title": "“Great Location.”", "Author": "strongy39", "ReviewID": "UR82489624", "Content": "Woulld definately recommend this hotel, good value for a lovely hotel. Reception staff above and beyond good. Rooms very clean and bed very comfy. Have stayed in other central Barcelona hotels which were not a patch on this one. Location is spot on, metro and bus stop just outside and within 5 mins walk to placa catalunya and the ramblas.", "Date": "October 7, 2010"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Jersey City, New Jersey", "Title": "“Overbooked- they made us move to a different hotel, nowhere near the Granvia.”", "Author": "Dori020", "ReviewID": "UR82189778", "Content": "We arrived at Hotel Granvia to spend 2 nights in Barcelona for our honeymoon. When we checked in, we were rudely informed that there were no rooms left - despite having made our reservations 3 months before. They moved us to a hotel that they assured us was very close. It was not. It took 10 minutes to drive to the new hotel, which was very nice but not anywhere near where we intended to be! No apologies were ever offered- in fact, the man was clearly annoyed with us and the entire situation. He was beyond rude. When we got to the 2nd hotel, we had to switch to a non-smoking room since Granvia didn't provide our reservation information. Took about 2 hours of our time, total. They then told us we could stay at eithe rhotel for the next night. Since we only had 2 nights in Barcelona, we decided to just stay at the 2nd hotel, only to be told at the front desk that Hotel Granvia was wrong and we had to get out. It took nearly 10 minutes for the situation to be resolved, during which time they mentioned that we had booked on Expedia and that was why we were the people who were bumped. Clearly, we were considered 2nd rate travelers for paying a discount room rate.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hollywood, Florida", "Title": "“Loved the character and location! Only thing missing was helpful staff!”", "Author": "ashporta", "ReviewID": "UR79638192", "Content": "Loved the hotel, our room, beds & bath, spacious, character, location, clean, really unique and fun to stay at! The front desk staff just seemed annoyed, each member of our party asked a question or two during the stay and all came to the same conclusion that maybe these people should not work in customer service, they just seemed annoyed all the time to be working in a hotel and were not very helpful or concerned with helping guests. This hotel would be perfect if they hired one happy staff person per shift :) Would still stay here again because we got our questions answered by friendly locals :)", "Date": "September 15, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Perth, Australia", "Title": "“Wouldn't stay here agin if you paid me”", "Author": "bianca984", "ReviewID": "UR78522672", "Content": "Arrived after a full day of travelling and arriving late at night all we wanted was a clean room and a shower. The room smelt terrible of fresh cigarette smoke then I went to have a shower and the shower didn't work. I spoke to reception and they said it will be fixed asap. The next afternoon only after heading down to reception again to do alittle more complaining did something happen. The only good thing about this hotel is the free internet access but i wouldn't risk your clothes smelling of ciggie smoke for that! Pretty sure the maintenance men or the room cleaners have no problems with smoking in your room.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“central hotel located within walking distance from La Rambla the city Hub excellent value”", "Author": "culturvore", "ReviewID": "UR78138996", "Content": "Beautiful historic hotel with large salon and outdoor patio and free internet! Great value bed only. Breakfast not required as there is a fantastic supermarket in La Rambla with excellent prices. Reception staff extremely helpful. Room very clean with large open-out pension- styled windows which were wonderful to open to get the early morning sunshine while having your own breakfast from the fridge in the room.Alternatively sit out on the patio.The hotel only has three floors and was very quiet and peaceful during our stay. The location could'nt be better placed /right beside the metro, on the bus route/ and a 10 minute bus ride no 45 from around the corner to the right for the beautifully breathtaking beach with plenty of restaurants here. Generally the food is of a high reasonably priced quality with lots of varied cultural restaurants within the city.Mind your belongings wherever you are in Barcelona!!!", "Date": "September 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "VOLOS, GREECE", "Title": "“Best location, great service, good facilities.”", "Author": "gavolos", "ReviewID": "UR76906559", "Content": "All about this hotel is location. Situated at the center of Barcelona, one block away from Placa Catalunya, the hotel offers instant access to public transport and all nearby major sights and a lot of good restaurants and tapas bars. The reception was very warm and helpful. We had booked a triple room (for us and our young daughter). When we arrived, we were informed that our room was not available (due to plumbing problems) and we were offered a double plus a single rooms with no extra charge. That was very honest of them.The rooms were spacey, clean, however their decoration is a little outdated. The hotel occupies a 19th century building with a fabulous hotel entrance, staircase and a first floor where the lounge and the breakfast room are situated. Overall a great choice.", "Date": "August 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Loud, cramped, and rude, despite location and history”", "Author": "citybythelake", "ReviewID": "UR72488088", "Content": "The hotel's public amenities are beautifully appointed, and it's obvious it's filled with history. It's also in a good location, close to Plaza Catalunya, on the Gran Via, and a block from Passeig de Gracia. However, the desk staff were rude and our room was subpar. We had to share a double bed, the bathtub was mini, and the AC barely worked. The first night there was a wedding party going on in the courtyard below, and afterwards the revelers moved into the room next to ours, staying up all night partying and smoking. We had noise and cigarette smoke wafting into our room all night because we had the window open due to the AC not working well. They offered free, in-room wi-fi, but it only worked sporadically. Overall, a disappointing experience.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baku, Azerbaijan", "Title": "“I like it!)))”", "Author": "Stranger-girl", "ReviewID": "UR72448641", "Content": "Hi everyone! In July 2010 my husband and I had a few unforgettable days in Barselone.We stay at Hotel Gran Via. This is a 3 Star hotel, so to the minor problems, such as 2 days idle elevator, we did not pay attention! The main thing for us was the magnificent location of the hotel! In general, we liked the hotel!))) Firstly - beautiful architectural building of the hotel, in the second -responsive staff, and third, although a small but very nice and comfortable hotel room-with Gran Via st. view. I also have advice for future guests the hotel-if you do not like something and so on..., contact the reception area and they will help! To all friends I certainly advise to stay at the hotel, when they will visit Barcelona!!!)))", "Date": "July 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oslo", "Title": "“Good value, bad service”", "Author": "fixOslo", "ReviewID": "UR71317273", "Content": "We arrived for a one-night stay on our way home. Family-room booked in advance over the net. The room was ok, clean with four beds, two folded down from the wall. The air-conditioning was not working. The room had windows to the Grand Via, and there is a lot of noice. The hotel has a lovely and special interior, it is a pleasure to walk the stairs and sit in the outdoor terrasse. The location is also good, close to both the old-town and the Ramblas. My main objection is the service. The man at the front desk was incredibly rude, inattentive and tried to make us pay for one more night, refusing to look at the reservation confirmation I had printed out before we left home. He was devaluating and made us very angry. He was also on call when we arrived, making us wait for 10 minutes while he arranged some papers behind the desk. I have stayed at the GrandVia Hotel before, and liked it very much. This time the stay was a dissapointment, and I will chose another hotel next time.", "Date": "July 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Elmira, New York", "Title": "“Great location and value”", "Author": "scienceteech", "ReviewID": "UR69550663", "Content": "We arrived at El Prat early on a Thursday and also easily found the Aerobus to take us to Plaza Catalunya. It was an easy 2 block walk from the drop off spot to Hotel Granvia, even with luggage. We were greeted nicely and smoothly checked in. We were given information on the Barcelona Hop On Hop Off bus but it wasn pushed on us and we were not interested. We had reserved the family room for the four of us and it worked out well although only due to the large sitting and luggage-closet area and large and well-appointed bathroom, not due to the sleeping arrangements. Two very small double beds (kind of like 1.5 twin beds) were pushed side by side for the four of us. It was tight but we managed. The very large shower bath and sink area made up for it. This was a great location for walking to almost any place in Barcelona, and made even better with one of the Passeig de Gracia metro stops right outside the hotel door (and the Catalunya stops only ly due to the large sitting and luggage-closet area and large and well-appointed bathroom, not due to the sleeping arrangements. Two very small double beds (kind of like 1.5 twin beds) were pushed side by side for the four of us. It was tight but we managed. The very large shower bath and sink area made up for it. This was a great location for walking to almost any place in Barcelona, and made even better with one of the Passeig de Gracia metro stops right outside the hotel door (and the Catalunya stops only 2 blocks awayly due to the large sitting and luggage-closet area and large and well-appointed bathroom, not due to the sleeping arrangements. Two very small double beds (kind of like 1.5 twin beds) were pushed side by side for the four of us. It was tight but we managed. The very large shower bath and sink area made up for it. This was a great location for walking to almost any place in Barcelona, and made even better with one of the Passeig de Gracia metro stops right outside the hotel door (and the Catalunya stops only 2 blocks awayly due to the large sitting and luggage-closet area and large and well-appointed bathroom, not due to the sleeping arrangements. Two very small double beds (kind of like 1.5 twin beds) were pushed side by side for the four of us. It was tight but we managed. The very large shower bath and sink area made up for it. This was a great location for walking to almost any place in Barcelona, and made even better with one of the Passeig de Gracia metro stops right outside the hotel door, and the Catalunya stops only 2 blocks away. We had asked for a quiet room when reserving and were given one on an interior courtyard that was definitely quiet. We ate dinner 3 nights at the cafes on Rambla de Catalunya, a very easy walk from Hotel Granvia. This was not our favorite hotel of our trip to Spain but it was a very good way to start. The building has charm, the hotel staff was very competent and easily agreed to store our luggage 'for as long as we want' on our last day in Barcelona, and we felt we got good value for a large city hotel (we did not take the breakfast ).", "Date": "July 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Largo, Florida", "Title": "“Great location, great service”", "Author": "DKVogel0810", "ReviewID": "UR66018905", "Content": "We arrived at Barcelona Airport and were sure we were going to take the Aerobus outside the T1 terminal (arrived Delta). Took the Aerobus to Catalunya - had some communication issues on the bus and weren't really sure where to get off. We figured it out!! Once off the bus at Catalunya we weren't sure which direction to go in. Well...get off the bus walk forward 2 streets and take a Right. Past the Corte de Inglis department store (by the way it has a grocery store on the bottom floor - buy water here it is cheap). The hotel is clean and simple. We had no problems. We were able to book tours at the hotel front desk. We did the wine cava tour and it was well worth the money. We did Monserrat on our own and should have done the tour. They did ask for our key when we left and kept it for us while we were out. No chance to loose it this way. There is a restaurant a few doors down with good beer. Also, go left out of the hotel to the end of the street and go right. There is a restaurant called Divinius which is very good. Also - Farggi (right around the corner) has fabulous desserts and coffee. If you leave the hotel and go right go to the end of the street and turn right - go two blocks and there is a starbucks. Most things are close and you can catch the hop on hop off at Catalunya as well. We also purchased our tickets for this at the front desk. They were very very helpful. The elevator at this hotel only holds 3 people at a time - so note this. A few drawbacks....towels are not soft and nice (a little rough) room is bare and not homey. This is a very standard european room. If you do get a room facing the front of the hotel it will be noisy - make no mistake. This didn't bother me - but it would most if not used to it. If you are looking for a clean, resonable and overall great location for a european hotel - then book this one. Do not book it if you are looking for a modern, amenitie filled cushy US type chain hotel. I would most certainly stay here again if I visited Barcelona. ENJOY!", "Date": "June 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Marathon Shores, Florida", "Title": "“Fantastic Hotel”", "Author": "madeingermany", "ReviewID": "UR65359322", "Content": "First you can't beat the location of this hotel. On the Gran Via in the middle of everything. A short walk to the Las Ramblas, and the Port, and walkable to everywhere else Segrada Familia, Picasso Museum, etc. This old mansion converted to a lovely hotel that is absolutely gorgeous and a surprise. Breakfast was great and worth the money and the breakfast room is pretty awsome. Our room was a surprise. We booked a double and a single (for our friend). Our double was very big and with a balcony. The single was very sufficient but more importantly they were both very clean. We coudn't be happier with this hotel and feel we lucked out on this one, Barcelona hotels can be very expensive and this was worth every EURO.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“WOW what a splendid hotel!”", "Author": "jacquidougliss", "ReviewID": "UR64705532", "Content": "What a surprise, I knew the location was good but the hotel was a real shock it is lovely the staff are helpful even with our volcanic ash problem they did everything possible to make our stay perfect. We would of liked a bar or some mini wines in the mini bar just to have whie getting ready for the evening and the use of an iron would of been great but in the scale of things this hotel was a real find!", "Date": "May 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ogden Dunes, IN", "Title": "“Grand old elegant Hotel in a perfect location.”", "Author": "Ursula021", "ReviewID": "UR64056489", "Content": "The location is perfect, right in the heart of Barcelona. Steps from the Passeig de Gracia and Catalunya Plaza. The hotel is on The Gran via Cort...the heart of the city. Subway, airport bus, and tour bus are within 2 blocks... plus great restaurants. Older couple, we were very happy with everything.", "Date": "May 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Cheap Hotel - Great Location”", "Author": "Aspasia79", "ReviewID": "UR58733002", "Content": "Hotels in Barcelona seem to be a little expensive but with Granvia you can get a bargain. If you need a relatively cheap and clean place to sleep after all day walking and indulging in Barcelona's life, Granvia is for you. The building itself is used to be a state house I think, it has beautiful features. Two floors elegance I would say. The leading staircase is spectacular. Unfortunately the rooms are not on those two floors...after the main entrance you expect the same beauty in your room but that's not what you get. But still nice rooms. Not the biggest rooms, but comfortable. Our room had windows to the back not to the street so it was quiet. We had view of other buildings. The room was really warm, I don't know how could it be as the heating wasn't on, the sun didn't shine (we had snowy weather in March!) The service in the hotel was satisfying. There was free internet in the room, it was fast enough.", "Date": "March 16, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Irish Aussie", "Title": "“Great lobby, shame about the shabby room”", "Author": "DJ-Travellers", "ReviewID": "UR53708403", "Content": "Cannot fault the hotel location. Hotel lobby is nice and the Salon was so European and we really thought we would be in for a treat...until we saw our room. The bedspread was very shabby and a chair in the corner of the room was filthy we didn't dare touch it! Had a nice balcony overlooking a nice courtyard. Shame about the full ashtray on the balcony from the previous night.", "Date": "January 17, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Ankara, Turkey", "Title": "“a nice hotel”", "Author": "Dilvink", "ReviewID": "UR52146941", "Content": "comfortable, clean, located at the city centre, 100 mt to metro station and placa catalonia...", "Date": "December 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Allentown, PA", "Title": "“Convenient Location”", "Author": "TnsTrvlr", "ReviewID": "UR51863780", "Content": "We spent 7 nights at this hotel at the beginning of November. We would like to acknowledge Carlos (evening desk) and Juan (day manager) for their extraordinary assistance in making our stay very, very pleasant. Carlos was very helpful in answering all of our questions about Spain and Catalonia, he also tried very hard to help me with my camera adapter (having inadvertently left my adapter in the US). Juan does take a little getting used to, but was extremely helpful in helping me save many euros by telling me the discounts offered by bus turista. The location is superb, within walking distance of Placa Catelunya (heart of Barcelona) and some of Gaudi's buildings. The Hotel is like a grand old dame who is showing her age. The common areas, such as the salon and the terrace, are elegant, but the room furnishings and the bathrooms could be improved. Coffee makers in the rooms would be appreciated. We did get a special rate for staying more than three nights, and given the weakness of the US dollar, that made the hotel a good value.", "Date": "December 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Kansas City", "Title": "“Excellent Value and Quiet; Central Location”", "Author": "skkc", "ReviewID": "UR49934644", "Content": "I stayed at Hotel Granvia for 3 days after completing a Medit. Cruise. The hotel is lovely, the front desk gentlemen are friendly and helpful, and the hotel has free internet service (only 2 PCs, so there can be a wait). The bedroom is very basic and rather dreary, but the bathroom is clean and spacious. I really appreciated the peace and quiet in the room; I slept all night and even took an afternoon nap, uninterrupted by street noise or hallway traffic. The location is in city central, close to the metro, hop on/hop off bus, shopping district, restaurants, Las Ramblas - a GREAT location! I will stay there again.", "Date": "November 23, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "New delhi, India", "Title": "“Great location, basic facilities.”", "Author": "Abjee", "ReviewID": "UR49480717", "Content": "The hotel has the right location for tourists with the subway, tourist and airport bus hub 5 minutes away. The eating places and interesting old city areas are within walking distance. There is no room service in the hotel and reception though understaffed provides basic level of services. The buffet breakfast was good and the room rent reasonable. It would be very useful if they provide electric kettle and tea/coffee in the rooms. I like to drink a lot of tea and had to buy tea bags and dipped them in warm water from the taps in a glass. It was far from satisfying.", "Date": "November 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Copenhagen", "Title": "“Perfect location and really nice hotel”", "Author": "KarinCopenhagen", "ReviewID": "UR49471854", "Content": "I would recommend this hotel to everybody travelling to Barcelona. A few minutes walk from everything, really nice rooms and good service ..... and a very competitive price. We'll definately stay there again if/when we come back.", "Date": "November 18, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Swampscott, MA, USA", "Title": "“Reasonable expectations make for a fine visit”", "Author": "beachmama94", "ReviewID": "UR49184162", "Content": "The best thing about the Hotel Granvia is the location for transportation--one block from the Passeig de Gracia subway station, two blocks from the Placa de Catalunya subway (and the Barcelona Turiste tour bus), and 3 blocks from the station where you get trains to other locations in Spain. It is a short walk to the Rambla, the Berri Gotic (old town) and the waterfront. The location more than met our expectations and allowed us access to most of the sights. Using the \"hop on, hop off\" Barcelona Touriste bus on the first day of your stay will give you a great overview of the city and allow you to \"hop on and hop off\" at sites that are of interest of you. Money (21 Euros) very well spent as you can spend the whole day (or 2 days for a few more Euros) touring the city this way. (with good narration about the sites). Expectations you bring about what a hotel should be will color your stay at Granvia. If you expect the kinds of amenities that are found in most American hotels (an abundance of big, thirsty towels, robes, double sinks, tons of toiletries, thick comforters, king size beds, a sitting area and a bed covered in throw pillows, and a flat screen t.v. and large lobbies) you will be disappointed in the Granvia. You might not want to stay there. But if you want a certain old world charm of a former 1800's former mansion--polished wood floors, beautiful wood paneling, a sweeping marble staircase, a Spanish courtyard with tile and columns, palm trees and places to sit--and a clean room with few pretentions, this is the place to stay. We were able to stay 6 nights at a special rate which didn't break us financially given the exchange rate at this time. Since we spent so little time in the room it really didn't matter if we had thick, plush towels and the other things. Instead, we were made to think about the excesses we sometimes have come to expect in hotels in the US and how simpler really IS better for everyone. We didn't NEED all the bells and whistles. We had a wonderful time exploring the city and visiting with our son who is studying abroad in Barcelona.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Hunter Valley, Australia", "Title": "“Doesn't live up to it's website description”", "Author": "Zoe005", "ReviewID": "UR48547934", "Content": "Didn't get off to a great start as we were asked unfriendly desk clerk to \"please wait 5 minutes\" before we could check in. The first room we were given was tiny and gloomy and the small double bed was rock hard. We asked for another room and were moved to a twin. Beds were not much better, furnishings should have been replaced years ago. Our room was not \"soundproof\" as advertised, as it had the old style windows which don't keep out noise. On our 4th night a film crew moved in to make a movie and took over the whole hotel keeping us awake all night until 6 am when they left. While they were there we weren't allowed to access the lounge area, the computers or the terrace. (we were offered a discount for that night). It was also advertised that there were two English channels on the TV but this was not the case, there was nothing in English not even CNN! We got sick of handing in our key every time we left the hotel, and then having to wait around to get it back, so in the end we just kept it with us. Also it was ludicrous that we had to pay 2.50 euros per day to use the safe. About the only good thing about the hotel was its location but beware of the parking station next to the hotel - it cost us 35 euros to park our hire car overnight.", "Date": "November 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Toronto", "Title": "“Perfect place to stay in the heart of Barcelona”", "Author": "pippin23", "ReviewID": "UR48428765", "Content": "Wonderful hotel, excellent desk staff, particularly the daytime guy that's been there for 34 years. He is fantastic. Rooms spare but quiet (if you are at the back). Can't say enough about the location.", "Date": "November 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "YORKSHIRE", "Title": "“Great Location, Nice rooms, good breakfast”", "Author": "XROTHERHAMX", "ReviewID": "UR47502060", "Content": "Location could not be better - quiet street but only short walk to main square, Ramblas and central loactions. Our room had limited natural light but loads of character. I sent an e asking if there were hair dryers provided (there were) but did not get a reply. Loads of bars and restaurents very close. Best to check price of drinks before ordering, where ever you go, as they seem to make up prices. Prices for drinks varied widely from similar establishments. Two day toursit bus rover ticket is better value than for one day and can be used to hop on and off at many loactions. Three computors in hotel with free internet access. Breakfast has lots of choice, is in a nice big uncrowded room and is good quality food. Has hot plate of bacon/sausage etc.. Hotel price did not include breakfast but I thought it did - bets check this as breakfast is a whopping 11 euros each. I would recommend this hotel....", "Date": "October 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "California", "Title": "“Greate Location - Just OK Otherwise”", "Author": "wutdhec", "ReviewID": "UR46300689", "Content": "Excellent location, close to all the good stuff. Room is outdated and very spartan; same could be said for the hotel. But, at about 100 euros, it was a good value. Highly recommend having breakfast at Navarro's around the corner and down the street toward the Plaza Catalunya. I don't care much for the whole business of letting them hold on to your key when you leave the room, but I guess thats common in Europe. The safe deposit box was extra charge of 2.50 eu per day...kind of silly. The minibar prices are really reasonable. Beds were a little tired, but I slept OK...location was quiet for me (room towards the back). Stay here to save some money and be in an acceptable if plain room in a great location. Don't stay here if you want to feel like you're in luxurious place.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Fantastic location but nothing else”", "Author": "Renata_23", "ReviewID": "UR39706716", "Content": "This hotel is located in a very good location! You are close to the main square, La Ramblas and the stops for the \"hop-on-hop-off\" buses. I was not pleased with the hotel for the price that I have paid for. The internet is free but I was not able to get it on the 3rd floor. We tried to put our belongings into the safety deposit box, but the reception had no key for it. Also, the TV has a horrible reception and there was no English channels. I got fed up and asked to be moved somewhere else. After one night, I moved to the 1st floor. The internet was working, TV had a better reception and I got the key for the deposit box (for two days, I had to pay 5 Euro extra in cash). If I would come to Barcelona again, I would not stay at this hotel. The bed is horrible and for the 3 nights that I have spent in this hotel, I did not sleep well at all. I guess, I am use to the Western style hotel and this one would not get the 3 star hotel from me. If you do not care where you going to sleep but the location is important to you, then this is the hotel for you. Otherwise, I would not recommend it.", "Date": "September 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Great location, affordable, grand decor, nearby parking”", "Author": "Samella", "ReviewID": "UR38518106", "Content": "The hotel is exactly as it says on its website. Perfectly located for Plaza Catalunya, and the heart of the city. As we needed parking for our rental car, this suited the bill as it meant we didn't need to navigate the streets of Barcelona, as there is a parking building alongside it, and as it was on the main road off the motorway from the south, it was easy to find. The decor of the salon was amazing and there was free internet access, as well as an outdoor terrace. We had a triple and two doubles - the only issue is that the triple had one fold out bed added but it was still comfortable enough. The rooms were clean and the bathroom clean with hairdryer, plenty of towels etc. Would definitely recommend for an affordable, centrally located hotel, and would stay again.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Beautiful elegant hotel in central location”", "Author": "marybbloom", "ReviewID": "UR37484632", "Content": "I enjoyed Granvia Hotel. The room was nice and elegant also the staff was helpful and friendly. Price was reasonable", "Date": "August 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Perfect location, ideal for us!”", "Author": "Bobadoba", "ReviewID": "UR37345382", "Content": "First of all, after reading some reviews regarding items being stolen, Barcelona is renowned for petty crime and I know scores of people who have had items stolen. But having visited this beautiful city around 5 times, this time for 10 nights, I can quite honestly say I have had absolutely no trouble at all. While I completely sympathise with people who do have items stolen and who have been mugged, you really do have to make sure that valuables are kept in the safe at all times or on your person, as I have heard of break ins and robberies at so many Barcelona hotels, not just this one. Hotel Granvia was incredibly easy to find having taken the Aerobus in complete darkness. It's a fairly small hotel and the reception is helpful, if not over-welcoming and friendly. The services offered by the hotel stop at dry cleaning and an expensive breakfast buffet (11 Euro, make sure you go early before much of the food is gone otherwise it really isn't worth this cost!), but we noticed that the staff do their best to make what they offer as good as possible. My boyfriend was disappointed that the breakfast buffet was out of Serrano ham one morning, so mentioned this to the staff member on duty who immediately cut him around 10 more slices! Also, we requested a double room with a terrace although we didn't know whether or not this would be possible, and after the first night in a twin room due to limited availability were upgraded to a large room with a terrace and double bed which was wonderful. The TV didn't work, but we weren't on holiday to watch TV and didn't mention this to the staff, so couldn't say whether or not it would have been mended. The interior of the building is fairly grand and some of the larger rooms used for meetings and breakfast are beautifully decorated. The courtyard is lovely and well maintained, and the hotel is cleaned immaculately every day. Our room was always spotless and very tidy when we returned from a day out. I would agree with some previously reviewers about some elements being dated, for example the display cases full of Barcelona souvenirs and guide books from 1994 are not so great! The location of this hotel is absolutely fantastic. It's a short walk from the Placa de Catalunya and the top of Las Ramblas, and the Passeig de Gracia metro stop is less than 100 metres from the hotel. This is one of the main stops in Barcelona, and almost everywhere you want to visit in the city is within 4 metro stops (direct) from this stop. You can also connect to the Passeig de Gracie Renfe (train) station from this stop, from which you can travel to places like Sitges for the seaside, Port Aventura for the theme park and Barcelona airport. To walk to the beach from the hotel takes around 20 minutes or 10 using the metro, and a taxi from somewhere like Port Olympic to the hotel costs around 10 Euro. Choose this hotel if you are happy not to have a restaurant, spa, pool etc on site, but instead a comfortable bed, clean room and brilliant location. Try eating somewhere like the highly recommended Txapela tapas bar near the Placa de Catalunya (but be prepared to queue in the evenings!) and buy bocadillos (Calamari with hot mayonnaise was a firm favourite, for only around 3 Euros) and tapas from the excellent bar next door to the hotel . Can't wait to go back!", "Date": "August 11, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Denmark", "Title": "“Our bag was stolen in the breakfast restaurant, staff and management did not care!!!”", "Author": "CondorCaruso", "ReviewID": "UR36106044", "Content": "Our bag of great value was stolen in Granvia's breakfast restaurant - the thieves could enter and leave the hotel without notice of staff - no staff in the restaurant during the theft. Management took afterwards no responsibility of the restaurant. GO ONLY HERE IF YOU CAN DON'T CARE ABOUT YOUR THINGS.", "Date": "July 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Leeds, UK", "Title": "“Granvia Hotel - decadent lobby ,big stair cases, with grand reception rooms”", "Author": "ClarelLeeds_UK", "ReviewID": "UR34512943", "Content": "Located 5 minutes from Place de Catalunya the Granvia hotel provides very comfortable and spacious accommodation. From the street the hotel doesn't look particularly promising but inside you get a very pleasant surprise. Originally built as a palace for a Spanish noble family the hotel boasts a very decadent lobby ,big stair cases, with grand reception rooms in which you can relax and eat breakfast. The bedrooms are very comfortable, very clean and of a good size and quiet!. The hotel doesn't have a bar but each room has a very reasonably priced mini bar, and you can take your drinks into the large enclosed court yard. Break fast is good with excellent coffee. The staff are friendly and helpful. Would definitely stay again. Tip- make sure you don't get confused with the Gravia Hotel also in Barcelona, we did and turned up at the worng hotel to start with.", "Date": "July 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“An undiscovered gem of a hotel in Barcelona”", "Author": "Texas-Vagabond", "ReviewID": "UR31308356", "Content": "After staying one night at a much pricier hotel which was noisy and well worn we went looking for a quieter hotel still near major attractions and found Hotel Granvia. This little gem of a hotel was sparkling clean, superbly friendly and most convenient. Very charming old mansion of a place but updated to all the modern conveniences. Our room faced the back terraza with plants and tables where we stopped at the end of each day to open our bottle of wine and rest our tired feet. Breakfast at 11 Euro per person was actually a great value because it included a wide assortment of meats, breads, eggs, fruit, juices, coffee, etc. We enjoyed 3 nights here and wish we had found this our first night. Just one block away from El Corter Ingles, the best department store/grocery store in Spain. Two blocks from the top of Las Ramblas and one block from all the tour bus stops, metro, etc. Really a great value. The hotel staff was extremely friendly and helpful and fluent in all languages.", "Date": "June 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Colorado", "Title": "“Loved the terrace and great location near the airport bus, train/metro and the sightseeing bus”", "Author": "SOLAColorado", "ReviewID": "UR30520740", "Content": "A good value for Barcelona. The terrace was perfect for relaxing. WiFi throughout. They offer two computers for guest use. Breakfast is a full buffet with unlimited coffee. I had a very comfortable, clean room for one person. The hotel staff was helpful.", "Date": "May 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Fantastic - Highly Recommended”", "Author": "SionHill", "ReviewID": "UR27166553", "Content": "A party of 3 of us have returned from Barcelona and stayed at Hotel Granvia 642, 08007, Barcelona and have had a wonderful stay. Talk of location - just off Catalyna Square and 2 minutes walk from Las Ramblas. I would highly recommend this hotel.Our room was spotless and we asked for a quiet room which we got even on one morning the rooms was so quiet we overslept. The staff were wonderful and so nice and helpful. Free internet access in an amazing sitting room. Fantastic character in this wonderful hotel. Breakfast at E 11 was well worth it with really lovely fresh fruit, breads ect. We are looking forward already to our next visit and will certainly return.", "Date": "March 31, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Portsmouth, England", "Title": "“Centrally located hotel with a touch of grandeur from a different age....”", "Author": "Pompeyperson", "ReviewID": "UR24603987", "Content": "The hotel is situated at the Passeig de Gracia end of the Gran Via and so you can easily walk to the Ramblas. It is a lovely old 19th century building, probably originally a merchant's mansion. So if you like modern clean lines in a hotel, this is probably not for you. But the rooms are large, beds are comfortable, the bathroom has everything you need (altough a few more toiletries would have been welcome, but that is only a small point). We could hear the traffic noise from the street below but it didn't prevent us from sleeping; there was no noise from corridors or other rooms. We didn't eat breakfast there, as there was an extra charge for it and not being lovers of big breakfasts, we preferred to grab a coffee and a cake in near by cafe. As we had arrived in Barcelona on a busy weekend with no hotel booking, and having tried other hotels in the area only to be told that they were full, we were probably lucky to get this hotel for 107 Euro per night. You could probably get it cheaper with an advance booking. But anyway, Barcelona is expensive.", "Date": "February 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great hotel and helpful front desk”", "Author": "BPfromTO", "ReviewID": "UR21535423", "Content": "After reading some of the comments regarding traffic noise , I requested for a quiet room, facing the courtyard. The room was nice and comfy and not a stir was detacted during my 7 days stay. The full hot breakfast , which was included was good and plentiful. The day time staff , Juan, was the most helpful person in town. He speaks excellent English! I certainly will come back to Barcelona, and I will definitely stay here again", "Date": "November 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Auckland", "Title": "“Great place”", "Author": "AucklandNZTravellers", "ReviewID": "UR21072907", "Content": "This place was lovely for our 3 night stay in early October. It was quiet at nights, and located about 10 minutes walk to Las Ramblas and 5 minutes walk to the Hop-On - Hop-Off bus. We heard to stay in the Las Ramblas was very noisy and glad that we did not. This was well located with lovely comforts.We had 2 rooms, and they were both spacious. Breakfast was great (while you had to pay extra for it). The staff was very helpful, however one person at the desk did \"tell\" off another in front of us, and it was rather embrassing. That said, it that did not distract us, as both staff members were extremely helpful to us.", "Date": "October 21, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Great Location”", "Author": "kardex2dog", "ReviewID": "UR20365013", "Content": "Stayed in Barcelona at the Granvia for 4 nights. The hotel has a lovely lounge - old and elegant. The staff were all very nice - some spoke english but let us practice our Spanish which was great fun. The room was plain but very clean. The location of the hotel was fabulous. We were able to walk to the Plaza Catalunya and explore the Rambles and the old area very well. The room faced a large street so was a little noisy which was fine when we closed the window. I would recommend this hotel - clean, simple, and safe.", "Date": "September 25, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Brighton", "Title": "“Absolutely the worst experience I have had in a hotel”", "Author": "Hodgie72", "ReviewID": "UR18414436", "Content": "I booked a 4-night stay at the Gran Via on the recommendation of a friend. Upon arrival the receptionist completely ignored me and continued to stare at his computer despite the fact that I was stood in front of him. Eventually I was shown to a twin despite explicitly asking for a double. Back at reception the extremely rude receptionist informed me that 'its a double, but its not a double - understand?' Well, no, but I did when I was shown the room - the bed was about four feet wide and the room itself resembled a monastic cell. Back at reception I was told to take it or leave it, and that my partner was too big for the bed, not that the bed was too small. I took the twin for 1 night and checked out the next day, moving across Placa Catalunya to a lovely, friendly modern hotel for about 5 euros more per night. Even checkout was a horrible experience, conducted largely in silence with the receptionist gesturing for my credit card and pointing at the screen to show the amounts (and yes, he spoke English). I should point out that I am not difficult to please and have never felt the need to write in these terms before, but this place is an absolute shambles. My recommendations to The Gran Via are: Sack the receptionist and ensure he is never allowed to talk to the public again. Buy some decent furniture.", "Date": "July 30, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Horrible experience!”", "Author": "emjorden", "ReviewID": "UR18275775", "Content": "The hotel staff was incredibly rude and disrespectful. On 2 ocassions, 2 different staff members attempted to brush off my husband and I because they did not think we were guests. When my purse was stolen on the subway, the front desk denied they had a phone book (which he later brought out after he realized we were guests) and was reluctant to look up the US consolate phone number on the internet for us. Not to mention they knowingly gave us a room without airconditioning. When we asked the hotel to fix it, they said they couldnt get anyone out there that day so they gave us a new room across the hall. That night they knowingly put another set of guests in the horrible hot room.", "Date": "July 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stamford, CT", "Title": "“Great hotel, great location and nice staff”", "Author": "GreywolfStamford", "ReviewID": "UR18234791", "Content": "My wife, myself and my two year old girl stayed here from June 30th to July 6th and had a wonderful time. The staff was professional and several members of the staff were absolutely fantastic. Senor Gomez, Manuel and Rafael were great. The location is perfect and close to everything. You can walk to so many places it is great. Las Ramlas is 5-7 minutes away by foot. What a great street. The Hotel is an old palace and it shows. The service was excellent, the rooms were clean and breakfast was excellent. Overall we would definately recommend Gran Via and would go back again. We plan on going back again. AGH", "Date": "July 25, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Atlanta, ga", "Title": "“hated the noise”", "Author": "madambutterfly26", "ReviewID": "UR16899483", "Content": "We selected Hotel Granvia based on good reviews in a popular travel guide and reasonable price. I was a bit wary as to how busy the street Granvia would be so I requested a room on the back overlooking the terrace. The hotel replied that I would definitely get a quiet room on the back. I foolishly neglected to print this reply out and attach it to the usual confirmations. So we arrive ridiculously jetlagged and are assigned a room right on the front overlooking Granvia which has to be one of the busiest streets in Barcelona. Sleep was difficult to say the least. The hotel staff at Granvia are extremely unfriendly and almost unpleasant. I would not stay there again.", "Date": "June 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "The Wild West", "Title": "“Great location, good value.”", "Author": "GoddessT", "ReviewID": "UR16771384", "Content": "This hotel is grand and the public areas are beautiful. We had a triple room which was spacious, clean, and quiet, with a large closet, writing desk and in-room safe (extra charge). The beds however were too hard, basically a thin mattress on a hard board. Everything worked well in the bathroom, but there was a bit of foul odour from time to time. The eating room was lovely and the breakfast buffet was truly excellent (extra charge). Front desk staff were basically okay, although one young man rushed to carry my sister's suitcase up three stairways at midnight when she arrived by train. There is an elevator but it was briefly out of order.The location could not be better-walking distance to all the central highlights. Other than the hard beds, we loved this hotel.", "Date": "June 8, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "St. Louis, Mo", "Title": "“Modest Hotel in the middle of Everything!”", "Author": "wunderlustee", "ReviewID": "UR15818735", "Content": "For my first time in Barcelona, I picked this hotel based on location, price, and this review site. I am a single woman and I found this hotel to be absolutely convenient and extremely charming. The people at the front desk were very sweet. I had a room near the courtyard, meaning very little street noise, so it was a sanctuary of sorts after a day of walking and sightseeing. The ONLY drawback I can think of is that the walls between rooms were thin. It was rare during my 4 night stay, but I did hear my \"neighbors\" from time to time. Summary: Clean, Friendly, Reasonable, Convenient, Safe, Recommended.", "Date": "May 8, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Orlando, FL", "Title": "“Convenient and Quaint”", "Author": "LERAPA", "ReviewID": "UR14617536", "Content": "My daughter and I spent 2 nights at the Granvia while exploring Barcelona. We wish we had alloted more time. The location was very convenient--and what was not accessible by foot was easily reached via the subway station a block away. Furnishings were a bit warn, television selections were sparse, and the service at the desk was a bit cold, but overall the charm and convenience made for a very pleasant stay. Breakfast was very good, also.", "Date": "March 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Relieved”", "Author": "bluechick", "ReviewID": "UR13534186", "Content": "I stayed here with a friend in January 2008. We had just travelled from Madrid where we had had the tiniest room in the world in a noisy hotel. So when the desk clerk said we could have a twin room overlooking the courtyard which was quieter, or a twin room facing the street which would be noisier but bigger we were happy with either option. As it was we got a perfectly spacious room overlooking the courtyard. Not the shoebox I had envisioned! The decor is getting a little old but it was clean and roomy, in a fantastic location, and the desk staff were helpful and friendly. They also had free internet which was a bonus too. The hotel was a little bit more expensive than what we had hoped to pay but for what we got it was good value.", "Date": "February 13, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "berlin", "Title": "“Hotel Granvia is incredibly convenient”", "Author": "stephinberlin", "ReviewID": "UR12371022", "Content": "The hotel is very centrally located near many modes of public transport but also in walking distance to almost everything that we wanted to see. In fact, we walked everywhere except one time we took a bus. It is also in walking distance to the airport bus. Nice, clean, small hotel. Pretty entrance way and simple rooms.", "Date": "January 6, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Newcastle", "Title": "“Gran Via going down hill”", "Author": "SJCNewcastle", "ReviewID": "UR12259195", "Content": "We stayed at the Gran Via a few years ago and found it reasonably priced, comfortable and charming (our room was pleasantly furnished in an antique style). The location remains the same-only a couple of blocks from the Palca Catalunya-therefore incredibly central-just jump off the airport bus and you're there. However, things seem to be going down hill-perhaps they gave all the best rooms away by the time we got there, but we found our rooms a bit shabby, the furniture scruffed up and the drains in one room smelled. The day porter was not too impressed when we asked to change rooms. Prices have gone up too. It's sad to see what used to be a shabby chic former palace become more shabby than chic.", "Date": "January 2, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Charlotte, NC", "Title": "“Great location, horrible day desk clerk”", "Author": "jberk", "ReviewID": "UR10002341", "Content": "The location and cleanliness of this hotel is very good, but our entire experience was soured by a mean, rude desk clerk. I booked the room via e-mail on the recommendation of the Rick Steves travel book. The clerk told me that he had a room available but that I must send my credit card number. I did not feel comfortable doing that over e-mail so he told me to just send the last 4 digits. I did this and then did not hear anything else from him. I assumed everything was fine. When I arrived at the hotel with copies of the correspondence he started yelling at me and telling me he never got my e-mail. He had rooms available to accomodate us, but still felt the need to yell at me for what was probably his fault. We needed another night at the hotel upon our return from Mallorca a few days later and he again made a stink saying that a festival was starting that day and that they were completely booked. He made no effort to help find us a room elsewhere. I cannot believe this man is employed in the service industry.", "Date": "September 25, 2007"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Would stay at the Hotel Granvia again”", "Author": "travel_nut24", "ReviewID": "UR8580133", "Content": "We really enjoyed our stay at this hotel. It was very clean and our triple room was very big with tons of space for your luggage and storage. It was quiet, we were in room 208 which was very nice. We had a pretty big bathroom as well and the room was always spotless. It was reasonably priced for europe. We didn't take advantage of the breakfast, it was too expensive and we don't eat much for breakfast anyway. The location of the hotel is perfect, you couldn't ask for a better location. It's very central and close to everything. It seems to be in a very safe neighbourhood and we were able to walk to la rambla, gothic quarter and port vell without any trouble. Placa Catalunya is right around the corner with subway station and tourist information as well. There is tons of shopping in the area as well!! The staff was okay. They weren't rude, they just didn't speak to us unless we spoke to them first. It would have been nice to have them at least say \"hola\". We never had any trouble when we asked for a taxi and no problems storing our luggage at the front desk. We were there to see Barcelona, not socialize with the staff anyway, so it was fine. One downfall was the lack of info about hotel ammenities. There was no info book in the room (like every hotel I have ever been to) to tell you what services are available in or around the hotel. For example, we had no idea the hotel had a terrace until now when I read about it in someone elses review. I also discovered the internet on my own and assumed it must have been free for guests considering the computer is sort of tucked away on the second level. The staff made no mention of any ammenities either. Over all, we really enjoyed our stay. The hotel is very charming and nicely decorated. We found it to be very clean, quiet and the staff was just very business like. We would stay again.", "Date": "August 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Absolutely Great for a Solo Woman Traveler!”", "Author": "Travel_Chick5", "ReviewID": "UR8499973", "Content": "I went to Barcelona, Madrid, and Toledo at the beginning of the summer, and I stayed at the Granvia for four nights at the end of May. For a solo woman traveler, this place can’t be beat! LOCATION: The Granvia is located in the very safe Eixample area, very conveniently positioned about three blocks from the Placa Catalunya (where the airport shuttle drops you off). It was also within walking distance to the Barri Gottic and the Ramblas, but far enough away to be safe. There is a city bus directly across from the hotel that goes up to Montjuic and the Joan Miro museum, and another bus close by that goes up to Parc Guel. The hotel was also very close to several nice restaurants and shops – and it was near the El Corte Ingles, the massive department store that has a killer grocery store in the basement with everything you could ever want (including cheap bottled water, organic foods, fresh fruits, and yogurt -- which I badly needed after a week of consuming nothing but meat and beer). Best of all: I felt perfectly safe walking back to the hotel alone after dinner – even at 11pm or so. OTHER PERKS: Not only was the location great, but the hotel also had free Internet access (they have two computers in the wonderfully decorated parlor/drawing room upstairs, which you can access whenever you want to). There was also a lovely little area outside of the drawing room that had plants and benches. In the evenings, I noticed several guests relaxing outside with drinks, enjoying the nice weather. BREAKFAST: I really liked the breakfast buffet – it was well worth the money to me (I’m the type of person who absolutely cannot function without getting some food and coffee in my system before I leave the hotel). The buffet was huge, and from what I could tell, you could go back as many times as you wanted to in one sitting. I think it was 6-8 euros per day, but I can’t recall. There was this absolutely wonderful cheesecake-like baked thing that I just fell in love with, and lots of yogurts, fruits, cereals, and – of course – meat. I also loved the coffee machine – once I figured out that I had to hit the button 3 times to fill up the cup. There’s usually one woman working at the buffet to help you out – which is nice if you’re jetlagged, confused, and in bad need of caffeine like I was. STAFF: Overall, the staff members were great. It took a few days for them to warm up - as they were very professional - but eventually they did. I was particularly fond of the front desk clerk, who went out of his way to answer my questions on several occasions. The front desk staff and the security guards spoke fluent English, but the breakfast women and the maids did not. ADVICE: In general, don’t expect overly-effusive, “happy,” gushing responses from the staff in hotels and restaurants in Spain. The service industry in Spain is very professional, and they do their jobs efficiently and well. They don’t usually stand around or smile, joke, or laugh with you right off the bat. I noticed several Americans getting a bit huffy over this. My advice: don’t take it personally! These folks are at work, they’re busy, and they just want to do their jobs (the goal of which is to serve you your food or give you your hotel bill, not to become your best friend). It took me awhile to “get” this at first, but once I did, my trip went much smoother. I think it’s helpful to know this in advance. That way, when they ARE friendly and helpful (which happened on many occasions) it makes it that much nicer of an experience. :) ROOM: I had a single room with a double bed. I requested a quiet room and it was exactly that. The bed was very firm, and very comfortable. The room was immaculate, for which I was very grateful. There was a mini-fridge stocked full of waters, beer, and nuts and a little form on the night stand that I filled out when I took anything from the fridge. They totaled it at the end of my stay (and it wasn’t really that expensive). There was also a safe deposit box in room as well, which they charged for by the day. Note: This occurred at EVERY hotel I stayed at in Spain, and wasn’t expensive at all. It was well-worth the $1-$3 a day for the safe. In this particular hotel, I told them up front how many days I wanted to use it for, and paid for it in cash. Last thing: I emailed the hotel, and then booked directly with them via fax and got a nice discount. Overall, I was very, very pleased with this hotel, and I would most definitely stay there again.", "Date": "August 24, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Groningen, The Netherlands", "Title": "“The tiniest room in the world...”", "Author": "eztur", "ReviewID": "UR8456688", "Content": "I've been to this hotel with colleagues. I had a single room, which was extremely small. The smallest room I've ever been in. The furniture was old and smelled a bit. The bathroom was small, and my bath tub was the usual width but only about a meter long. Very small! Breakfast is okay, but no more than that. The personnel at the front desk is not very enthousiastic, nor helpful. Their english was poor. I did like the airco and the fact that all our rooms were next to each other.", "Date": "August 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Olympia, Washington", "Title": "“Ups and Downs”", "Author": "Bobi73", "ReviewID": "UR8192985", "Content": "Our initial opinion of Hotel Granvia was very favorable. The hotel clerk was friendly, spoke excellent English, and made us feel very comfortable. Our triple room was spacious and reasonably clean. The bathroom was small, and the towels a bit thin, but packets of shampoo, etc. were available, along with a hair dryer. Wi-fi is included, though it was somewhat difficult to maintain on the 5th floor. (The rooms start on the 3rd floor) The \"bellman\" was friendly and helpful. This is an old, sparcely furnished hotel, and the beds were hard, but not awful.There is a nice parlor and an outside courtyard on the 2nd level, as well as the restaurant, which we didn't use. The desk clerk we had the next morning was extremely unfriendly, and then was yelling at us when we weren't ready to take a taxi that my husband had told him not to call yet. We returned to the hotel a week later for 2 nights and had the same unfriendly reception. We were extremely relieved to encounter another friendly clerk when we were checking out, but the attitude of the older clerk with thin black hair was enough to make us steer clear of returning. The price from the website and location were excellent; close to Los Ramblas, but very quiet. Definitely a hotel to consider, but take your thick skin!", "Date": "July 19, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Thousand Oaks CA", "Title": "“Great Location, but........”", "Author": "TooManyShoes", "ReviewID": "UR8076845", "Content": "Hotel GranVia has a wonderful location. The building and furnishings were a nice mix of new and Faded Lady. But the staff ranged from indifferent to rude. When we arrived before noon (because the ship docked quite early) to leave our bags and do a preliminary check-in, the man at the desk was actually angry! Who knows what was going on elsewhere in his life. Maybe he was acting out on the hapless tourists, but we will never forget his jaw-dropping rudeness. The GranVia staff were the only people in all of Barcelona who were rather unpleasant to us! Barcelona is a beautiful city. We will certainly go back. However, we will look for a different hotel next time.", "Date": "July 8, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Florida, USA", "Title": "“Loved this hotel -- Very comfortable and convenient”", "Author": "AJFlorida", "ReviewID": "UR8068916", "Content": "This hotel is on Gran Via street about 200 yards from Plaza Catalunya, 3 min. walk from Rambla, 5 min. walk from Casa Mila and Casa Battla, 30 feet from a Metro station and next door to a car park. You can't find anything more convenient. The rooms are spacious, clean and comfortable with a good AC. We stayed in a triple room where the third bed was built into a sofa and did not have to be squeezed in. The public areas were fancy and there was free internet. Con's: This is not a fancy 5 star hotel. Service is adequate but not much more. Reception is always too busy to help you too much and the Bellman is missing most of the time but all this did not matter much to us. Breakfast is fine but probably not worth Euro 13", "Date": "July 6, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pennsylvania", "Title": "“Great hotel, excellent location”", "Author": "NeverDriveInScotland", "ReviewID": "UR8042211", "Content": "Stayed here for 3 nights in June 2007 in a triple room which was quite spacious and comfortable with a large bathroom. Hotel's public areas are beautiful. Free internet available in the lounge. Staff was friendly. Convenient location within 5 minute walk of Placa de Cataluyna, Las Ramblas, Passeo de Gracia, airport bus stop, and cafes. Metro and public bus stop within a block. On our first afternoon while trying to rest, we were disturbed by very loud music during happy hour from around 4-6 in the afternoon. Otherwise noise was not a problem, although the walls seemed a little thin and we did hear other guests at times. Our room was on the interior so weren't bothered at all by traffic noise. My only real concern was the lack of electronic locks/key for the doors. A hotel of this caliber should have this safety feature. Overall our stay was pleasant and I would stay here again.", "Date": "July 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Connecticut", "Title": "“Hotel was great!”", "Author": "ttrail199", "ReviewID": "UR7754347", "Content": "We had a short stay at the end of May, 2007 at the hotel and really enjoyed it. The location was terrific since it was only a few block walk to Plaza Cataluna. Our room was large, it overlooked the bustling street and it was very clean. The staff was helpful. All factors led to a great overall stay. We would definitely stay there again.", "Date": "June 4, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Haworth, West Yorkshire", "Title": "“A Pleasant Surprise”", "Author": "LongWeekenderHaworth", "ReviewID": "UR7185823", "Content": "Got back from our 3 night stay at The Gran Via last night. After reading some of the previous mixed reviews we were wondering what to expect but were greeted warmly by the man on reception and our room (112) was absolutely fine - a fairly large room with ample storage space (including a small walk in wardrobe), a firm double bed, a balcony looking over the courtyard at the back , which proved to be a good choice as we couldn't hear the traffic from the busy road at the front of the hotel. We only had one pillow each and asked for 2 more at reception but they had not arrived by our return that first evening, but they soon sorted us out after a reminder. We had fresh clean towels every day and the linen was clean and of good quality The room was quite warm which we thought would perhaps be a problem in the summer months, although there was an air conditioning unit which wasn't working - it was probably turned off at a master switch. We were unsure of what to do for breakfast as most hotel's offerings of continental breakfast leave you still hungry, but we needn't have worried as there was such a reasonable selection of both hot and cold food of which you could have as much as you liked. The coffee was delightful!! The breakfast worked out at 10 Euros per head and the amount we ate would have cost so much more had we gone to the nearby cafes. Also the breakfast room was immaculate and very grand with 3 chandeliers and ornate furnishings The hotel was a bit dusty in the corridors and the carpets needed hoovering but overall it was clean. For a hotel of this age we were surprised that the walls were so thin, fortunately we had considerate neighbours. The hotel is close to Las Ramblas and ideally situated for the upmarket shops on Passeig de Gracia and the 2 Gaudi museums. The stops for the tourist buses are about a five minute walk away. Also the Metro is just 50 metres to the left of the hotel. Beware of the 7% tax which will be added to your bill on departure. If we were visiting Barcelona again we would happily stay at The Gran Via.", "Date": "March 18, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Funereal”", "Author": "flacoLA", "ReviewID": "UR6569486", "Content": "This gand old mansion has seen better days. We knew we were in trouble when we were greeted by the brittle, dried up Christmas tree standing in the lobby. The staff is sullen at best and the rooms where depressing. True, the public areas have a certain eccentric, faded-grandeur but they leave one feeling that Franco's ghost might appear at any moment. This all could have been laughed off if it weren't for the price.", "Date": "January 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Lovely Stay at the Gran Via”", "Author": "romaboots", "ReviewID": "UR6546646", "Content": "My husband and I have stayed twice at the Gran Via, once in Sept. 2004 and again in Sept. 2000. The location can't be beat as it's within walking distance of many of the major sites, museum and shopping. Our rooms both times were spacious with large comfortable beds and nice furnishings. On our second stay we had a room with a balcony overlooking the street and rooftops of Barcelona. The breakfast room is lovely and the hotel has a restored elegance that is very charming. The service was excellent and we highly recommend the Gran Via.", "Date": "January 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "maryland", "Title": "“very Beautiful hotel”", "Author": "lovetotravel-TA", "ReviewID": "UR6534446", "Content": "The Gran Via really has it all. It is absolutely lovely, clean, well located with a helpful staff. I have booked again for next year. Would not stay anywhere else..", "Date": "January 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“Beautifully restored palace”", "Author": "DiTone", "ReviewID": "UR5928182", "Content": "Altho' we knew it was a restored palace, we didn't expect it to be so well restored! It is jaw-dropping with its huge, museum-like space. The room with breakfast (the best coffee we had found in our entire trip) was a huge and beautifully appointed drawing room and even the computers available were in some sort of large and gorgeous room overlooking a patio area. Walking distance from most everything you would expect to visit in Barcelona - what a great and energetic city!", "Date": "October 8, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wynnewood, Pennsylvania", "Title": "“Great hotel in a fabulous city”", "Author": "jlsk", "ReviewID": "UR5907637", "Content": "We stayed at the Hotel Gran Via. What a grand hotel. It was 100% old world charm. Wonderful location. Staff and accomodations were top notch. Barcelona is beautiful and exciting. Lots to see. Great tourist bus system too.", "Date": "October 4, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NJ, USA", "Title": "“Basic, Clean, Great Location..........”", "Author": "Julay", "ReviewID": "UR5790081", "Content": "Nice little hotel in a great location as many other reviewers have mentioned. We stayed there for 3 nights in August. Looks like most of the hotel rooms have been renovated but left the beautiful charm of the old hotel. Room was small, but very clean with a full bath. Double bed. AC worked fine. TV in the room and also a mini-bar. Free internet on 3 computers in the hotel and 2.50 Euros per night for the key to the safe (not 7 Euros as someone else mentioned). I am Spanish (but live in the US) so may be they rip off the \"foreigners\". That would be a shame. My wife is 6 months pregnant so I asked the cleaning ladies for more pillows and they were very nice and gave me 3 extras. All in all a good deal for a decent hotel in a great location. Would definetly recommend.", "Date": "September 11, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "San Francisco", "Title": "“Why So Mean?”", "Author": "italymaven", "ReviewID": "UR5537069", "Content": "This hotel, with a good central location and adequate rooms, suffers from rude and hostile staff. We asked them to make a reservation at one place for dinner and they said it wasn't necessary. We got to the restaurant and there was no room. We asked for a reservation at another place, they said they didn't know of it and so we would have to find the phone number and call ourselves. Directions (if provided) were often wrong. On the plus side, breakfast was bountiful for a reasonable price.", "Date": "August 1, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "4", "Service": "1", "Rooms": "2"}, "AuthorLocation": "London", "Title": "“Great location, shame about the service”", "Author": "moushy", "ReviewID": "UR5376522", "Content": "Hotel Granvia has an excellent location - really near the Placa Catalunya and within easy reach of major attractions, including all 'modernista' buidings and Las Ramblas. The hotel itself was a little disappointing. This is european standard 3*. The first room we were shown looked out onto an enclosed internal courtyard. The courtyard had a glass roof so the air inside the courtyard was hot and stuffy - this made our room intolerable. My husband ended up sleeping on the cold wood floor to cool down. This first room was cramped, dirty and the air-conditioning did not work. When we went to ask for the air-con to be fixed we were told that it was not working in any of the rooms. We requested a room transfer and this was arranged. The second room was a definite improvement - much larger, cleaner and with a window that opened onto fresh air. The breakfast was of a good standard - plenty of choice. But, overall, the service really let this place down. We asked the concierge: 'can we have a cup of tea' (being english!) and his reply was a curt 'no' as he peered up from behind his newspaper. The lifts didn't work during our stay. The rooms were not super clean. The price and the location are great though.", "Date": "June 23, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Exellent Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR5375944", "Content": "This hotel is situated in an excellent location near Catalunya and between the pg. de Gracia shopping street and the lively Ramlas. The rooms are basic, some with half baths, ie. a small bath tub that allows standing room only - but the water pressure is good. Walls are too thin - I was lucky that everyone in the adjacent rooms were courtious and didn't make alot of noise at night. Didn't spend much time in the hotel, since the there is a lot to see, so I can't comment on other amenities. Didn't eat in the hotel. They charge you about 7 euros a day for the key to the safe in your room - ( i hate when hotels do petty things like that!) The rooms were cleaned every day and standard items were replaced. The reception staff that greeted me spoke English and was helpful. I would stay here again for the location and convenience. Barcelona is wonderful!", "Date": "June 22, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Birmingham England", "Title": "“Fantastic massive quad room, great location”", "Author": "A TripAdvisor Member", "ReviewID": "UR5366795", "Content": "We stayed at the Gran Via for one night only, we travelled with our two children and had a quad room.. I think we must have had the biggest room in the hotel - it was like an apartment minus the kitchen. Huge ceilings with grand double doors to enter - It had a living area with a huge fireplace, bookcases table, etc and there were four beds still with loads and loads of space. You had a walk in wardrobe area and then a huge bathroom. To top it all you had your own little balcony with chairs overlooking the roof terrace which to our amazement had a childrens old fashioned play area! Perfect!! Its such a shame we were only here for one evening. It cost us about 100.00 english pounds. We can't say what the other rooms were like but ours was like a palace - great location in the middle of everything as well. I can't remember what the room number was unfortunately - I know we had trouble finding it because the room number wasn't on the door and we had to ask", "Date": "June 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Honolulu, HI", "Title": "“Good hotel, great location!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5323663", "Content": "EXCELLENT location in the heart of town. Walking distance to many Eixample sights. About 8 minutes from Las Ramblas. Staff pleasant. Room clean and comfortable. Breakfast was good. My only recommendation is that you take a Spanish dictionary as not all the staff speak English, which is reflective of the Spanish population. They do all speak French. Price reasonable for what you get; location is everything. Safe neighborhood with nice restaurants around the corner. We would stay here again.", "Date": "June 8, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "San Francisco", "Title": "“Faded grandeur but with a lot of personality”", "Author": "ltmoira", "ReviewID": "UR5027562", "Content": "My father and i stayed for five days in Barcelona at this hotel and found it perfectly acceptable. It's not the fanciest place in the world, but the rooms were very pleasantly appointed and clean. The lounges and breakfast rooms, though, were quite beautiful and well kept. Also the hotel's location -- near Placa Catalunya, and the Corte Ingles, a short walk from both the Ramblas and the Passeig de Gracia -- was a major plus. We loved walking around Barcelona and the Gran Via was well situated for that. Owner Juan and his staff were very helpful with everything from dinner and theater reservations to finding a laundry. The breakfast was better than the average hotel selection, although, as always, you can certainly find a wide range of good breakfast places in that area for lower prices. We had booked a double with twin beds (not through an online service, but via email correspondence) and when we arrived, they had somehow put us down for a double with a single bed. Does no hotel in Europe understand what is requested when you ask for two separate beds? Nevertheless, there was no problem changing to a double with twin beds and we were given a room facing over the main street, but the noise did not bother us at all. For the price, we felt we couldn't have done better and were very pleased with our stay there.", "Date": "May 2, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“great location, a bit too noisy”", "Author": "bostonbased", "ReviewID": "UR4332441", "Content": "hotel location is super, close to many interesting areas/sites. staff were very friendly and helpful. smoking in public areas may be improved with recent no-smoking laws, but in December the entire hotel smelled of cigarette smoke, like most other places in Barcelona. free internet in hotel common room was very nice, but a couple of days really slow, internet cafe across the street was less than 1 euro for 15 minutes (high-speed access). walls and courtyards did not protect light sleepers from hearing normal tone-of-voice conversations in the next room or when a neighboring room had their courtyard window open. rooms nicely renovated, comfortable, firm mattress, and BBC on the television. did not try hotel breakfast, as so many cafe's nearby with affordable coffee, pastries, etc.", "Date": "January 8, 2006"}], "HotelInfo": {"Name": "Hotel Granvia", "HotelURL": "/ShowUserReviews-g187497-d208596-Reviews-Hotel_Granvia-Barcelona_Catalonia.html", "Price": "$107 - $193*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Gran Via de les Corts Catalanes 642</span>, <span class=\"locality\"><span property=\"v:postal-code\">08007</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "208596", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/3a/57/8e/hotel-granvia-barcelona.jpg"}}