{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Manchester", "Title": "“You get what you pay for but is in excellent location and staff give good service.”", "Author": "KrisHead", "ReviewID": "UR119364231", "Content": "This hotel in in the heart of Las Ramblas and is a short walk from the airport bus stop. We went for a room with its own shower which proved to be a poor decision as the sink and shower did not drain well. The sink drained so slowly we refrained from using it. However, we did have a balcony view over the roof tops of Barcelona, overlooking Las Ramblas. The staff were very helpful and advised on places to go to eat and to drink and how best to get to the North coach station. Don't expect too much, and you won't be disappointed. My advice is to treat it as somewhere to leave your bags and somewhere to sleep as you will be spending most of your time out and about in Barcelona.", "Date": "October 16, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Perth, Australia", "Title": "“Cheap and in the Heart of Las Ramblas”", "Author": "Michelle80Australia", "ReviewID": "UR109009644", "Content": "This hotel was great value, right in the heart of Las Ramblas and a short walk from the airport bus (which is always a bonus when pulling a 30kg suitcase). The rooms are tiny with barely enough room to squeeze past the bed and open the balcony doors. It smelt like vinegar (or some sort of cleaning product). You could hear the people party on Las Ramblas BUT it wasn't so bad that you couldnt get to sleep. The staff were friendly, free internet and lifts to get up up there. All in all great price for a bed and spend the rest of your money enjoying Barcelona.", "Date": "May 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sunsetblvd", "Title": "“A very nice budget hotel”", "Author": "Sunsetblvd", "ReviewID": "UR91992467", "Content": "I was very pleased with the Hotel Toledano. My room was small but clean and very quiet, with a private bathroom, TV and phone. It was on the third floor (one floor below the reception) and way in the back, so it was very quiet. The guys at the reception were very pleasant and helpful, which makes a big difference at a budget hotel. The man who worked during the day was especially helpful with tourist information, carrying my (rather heavy) suitcase, etc. I couldn't figure out how to get the free WiFi on my laptop, but there was a free computer in the lobby, so it didn't really matter. I would definitely return to the Toledano.", "Date": "January 6, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“old style charm in city centre at cheap prices”", "Author": "Melissacraggs", "ReviewID": "UR85418271", "Content": "Ok, so it's old, it needs a reno (bad) and it's not exactly spotless, but it had loads of charm, friendly service, cheap prices, hot showers and clean sheets. No air con was a bit of a bummer in summer, but otherwise loved the great location (aerobus from airport practically drops you there!) and atmosphere. Sleazy old motel, but worth a visit.", "Date": "October 31, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Awful, with ROACH in room”", "Author": "jennyhoya", "ReviewID": "UR16806114", "Content": "Terrible and dirty place. We had a roach in our room the first. The owner told us he would give that night free and then did not follow thru on that promise when we check out and paid. The 2nd and 3rd nights we spent in the hostal since we demanded to moved after the roach. That room was a little less stuffy. But you still felt dirty after you showered and the hall bathroom smelled very strongly of urine. Will never stay here again. The worst part of our trip.", "Date": "June 9, 2008"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "U.S.A.", "Title": "“Sufficient”", "Author": "europatraveller", "ReviewID": "UR11912736", "Content": "I wouldn't necessarily go back to the Hostal R. Capitol, as I found it a bit old and crumbly for my taste, but it has a couple of redeeming qualities: First, it is located right on the Ramblas, and there's hardly a more perfect location for those who enjoy bustling activity in their immediate environs. Second, I was extremely grateful that I was able to book the room shortly before 10:30 on a Friday night, arrive about an hour later ... and check out around 5:30 the following morning. The helpful gentleman at the front desk, on duty all night long, was undaunted by the unusual (but, in my case, necessary) hours. In short, this would not be my first choice for Barcelona accomodations, but if you need an inexpensive room in a pinch, Hostal R. Capitol suffices.", "Date": "December 23, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Nottingham", "Title": "“Cheap but maybe not so cheerful”", "Author": "AnneNottingham", "ReviewID": "UR10589464", "Content": "Just come back from a 4 night stay at Hotel Toledano. Room was very small with twin beds but acceptable as you don't go to Barcelona to stay in your room. Our Hotel reception was on the 4th floor but our accommadation was on the third floor like many other reports feedback. Our bathroom was the smallest you ever did see and was not particularly clean either. Need to be up early as it seems when others have the shower on as well the water pressure drops to a dribble. Next doors toilet flushing was enough of a wake up call - so no alarm clocks needed. Hotel walls were very thin so I wouldn't recomment this accommodation to a light sleeper. We paid 68 euros per night for the room, with then 7% taxes on top so the price was good and the location on the Ramblas was great. I would consider staying there again if there were no other availability but I certainly wouldn't want to take my 2 year old son.", "Date": "November 4, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Wichita, KS", "Title": "“Just fine for a place to sleep”", "Author": "srdshelly3", "ReviewID": "UR8613423", "Content": "I found the place to have an outstanding location, right on the Ramblas, for seeing all that Barcelona has to offer. I can't imagine going to an amazing city like Barcelona and wanting to spend a lot of time in a hotel. If you just need a place to sleep at a reasonable price in an unbeatable location you will be fine here. If you are a real demanding person who wants lots of amenities, you'll prefer to go someplace else. My room was clean, everything worked, and the people were unfailingly courteous. And the moment you step outside the front door you are in the heart of Barcelona.", "Date": "September 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“OK but I wouldn't come back”", "Author": "jimbo1683", "ReviewID": "UR8033770", "Content": "We stayed in the Hostal Capitol a few years ago and that was fine so this time decided to stay in the Hotel Toledano part of the building. Elevator was not working when we arrived so had to carry our bags up 4 flights of stairs. Checked in on the 4th floor but our room was actually on the third floor through another locked door saying Hotel Toledano. The room was half painted and half plastered and smelt of damp or wet paint or something. The room was quiet as it was at the back of the building away from the street but you can hear people in the other rooms. The bathroom was very dated and I didn't like to touch the shower curtain. On reflection, I don't think there was really any difference between the hotel and hostal rooms. We paid 70 euros per night which seems expensive for the standard of accomodation. There is free internet which is good but I wouldn't stay here again.", "Date": "July 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Alabama", "Title": "“Fun Place to Stay!”", "Author": "Hueytown", "ReviewID": "UR7925077", "Content": "We enjoyed our time in the Hotel Toledano very much. But first, there are a few things that need to be clarified about the actual hotel building itself: 1) The sign on the outside is glowing blue and reads \"Colonial\" hotel; 2) The HOTEL part where we stayed is very nice and seems to be recently renovated, but the HOSTAL part seems to be oriented more for broke college students, so some of the previous negative comments could perhaps have referred to the HOSTAL, and 3) The HOTEL room we got did not have AC, however, the room stayed nice and cool anyway with constant breezes from the balcony. The managers were very kind and helpful, lovely to chat with, and very accomodating of my need for refrigeration of my insulin. The fridge is in the office, which is manned 24 hrs per day, and they were always happy to get it for me and then put it back into the fridge. We had a street-side room (alley-side in truth) and although the partying got loud with the balcony doors open, it was perfectly restful. The room was spotless and modern, except the bathroom is probably the smallest I've ever seen. All amenities were clean and in excellent working order. Nice also is the free in-lobby internet connection.", "Date": "June 18, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Good Location”", "Author": "yytam", "ReviewID": "UR7403852", "Content": "This is my first time to Barcelona. I am not sure if the hotel is expensive in Barcelona. Compared with the hotel i stayed in Madrid, the hotel is a little bit expensive and the furnish is old. Besides, the room is quite small. The location is good. Next to the Metro station and lots of resturants nearby. Don't ask for a room facing to the main street if you can't sleep with noice. The room on the other side is very quite. The hotel provides free internet service. Frankly speaking, it's a budget hotel and don't expect too much.", "Date": "April 20, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Minneapolis, Minnesota USA", "Title": "“Never again”", "Author": "bikersusan", "ReviewID": "UR6027916", "Content": "The room was small, cramped and dark. It only had two small lights which made it difficult to read. When I booked the room, I asked for a room with a balcony...they said that they had a room available with a balcony and a view of the cathderal. The balcony view was on the backside of the hotel and I barely had a view of the cathderal. There was a small hole in the wall by the nightstand. The lock on the door was hardly adequate. I asked for a different room and they said that they had none available. The room was clean. Not worth 59 Euro a night, even though it was in a prime location. I would of changed hotels, but it was already paid for, and this was at the end of my trip and I was too tried to make the effort to look for another hotel", "Date": "October 30, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Madrid", "Title": "“Never going here!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4720783", "Content": "We are a group of 5 friends and we,re going to tell you our terrible experience at this HOSTAL. We arrived at the hotel, and how was our surprise when we saw that from the third floor in which is the Hotel located, the recepcionist lead us to the second floor when they have got the HOSTAL (with a different name). The prices for Hotel and Hostal were different, but when we paid the first night, we paid for the Hotel prices (in fact, in the Bank receipt, it appeared the concept with the name \"Toledano Hotel\"). We raised to claim, because they were accomodating us in a lower category that was not the one for what we had paid. At any moment we were conscious that you cannot request luxuries to a 1 star Hotel, but the rooms were more than dirty: you must have seen the hairs that were in the bath of our room... The recepcionist incriminate us saying that we have called him swindler, and that we had getting the room dirty just to annoy him. After 1 hour discussing with him, we found another Hotel, and he refused to give us the complaints book.. still we are regreting not to have called the Police. It,s incredible that still are places in which they treats the customer such a garbage.", "Date": "March 21, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "McKinney, Texas", "Title": "“Very Convenient”", "Author": "penners27", "ReviewID": "UR4691402", "Content": "My husband and I stayed at Hotel Toledano 3 evenings last July (2005). We had a change in our plans shortly before the trip needing to add a day to our stay, so the first night we were in a double (we got twin beds instead of the double bed we expected) without a/c and moved to a different double (twin beds again) with a/c for the last 2 nights. We paid 59€/night if I remember correctly. The air conditioner wasn’t the greatest (as with most a/c’s in Europe). It was slightly better than the first room with the fan and windows open. The room was clean and we were on the back side so it wasn’t noisy from the street. They have a computer with Internet service in the lobby for the guests, but waiting for an hour for a lady to finish writing her diary entry email to a friend was a bit tiresome. The staff was friendly and spoke English. If you’re looking for somewhere inexpensive to stay close to the action (located at the top of Las Ramblas at Placia de Catalunya) it’s a great find! We plan on returning to Barcelona one day and will likely stay at Hotel Toledano again. We'll just make sure to ask for a \"double bed\" when booking!", "Date": "March 18, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "London United Kingdom", "Title": "“Hotel Toledano”", "Author": "rickytherabbit", "ReviewID": "UR4387834", "Content": "Be aware of this place if booking over the phone or from their webpage. No warning of cancellation fees is mentioned anywhere! I booked a room one week in advance over the phone. The owner of this hotel took my credit card details and said I would be charged on arrival. However, when I called the day after to let them know of a change of plans, they took money illegally out of my credit card. The owner stated that all cancellations made before 15 days were subject to a charge 40EUR or more. I argued that I had only made the reservation the day before and had received no warning at all of these charges. His reply was \" I don't care\" and shortly put the phone down on me. Thankfully, my credit card company arranged to have the illegal withdrawal fully refunded to my account.", "Date": "January 25, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Hull, UK", "Title": "“Great value for an excellent location”", "Author": "A TripAdvisor Member", "ReviewID": "UR3898412", "Content": "We stayed at the Hotel Toledano and for only €69 per night we got a clean double room with a good hot shower and a balcony. The rooms are not massive but were a perfectly fine size for sleeping, getting ready and going out to enjoy the excellence that Barcelona has to offer - when you have a great city you don't want to spend your time in the hotel. The staff are very friendly and efficient and will organise any help you need during your stay (they speak good English too). The room was cleaned each day (properly cleaned too as we came back one day and the maid had moved the bed for sweeping under) and we were given plenty of fresh towels every day. The reception is good with 24 hour staffing. There are vending machines for drinks (the expresso is not bad for a machine either!) and the prices for these are very reasonable. The only point potential guests should consider is that you are right in the heart of the city so there is a lot of noise around you for most of the 24 hours in a day but then you don't go to Barcelona for a quiet weekend! Other reviewers have not given such favourable reviews but I suspect they were staying in the Hostal R. Capitol part. For me the Hotel Toledano was great value for money and I would be happy to stay there again.", "Date": "September 13, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Found on internet”", "Author": "A TripAdvisor Member", "ReviewID": "UR3240115", "Content": "Both the Hotel Toledano and Hostal Capitol can be reached via this site, and it's a great one with a virtual tour, webcams, photos, a map, directions, rates, booking info -- the whole nine yards. Owned by the same family for decades, they are an amazingly good value. For instance, we had a triple with balcony overlooking Las Ramblas and a sink for just $47 per night. (Note: We could have had an interior room with a bathroom, but we wanted the view, and the well-maintained communal bathrooms and shower were right next door anyway.) In any case, these accommodations are perfect for anyone who cringes at the thought of squandering hundreds of dollars a night to sleep. If you absolutely, positively must have luxury, go for the Ritz or Le Meridien (where the Rolling Stones stay when they bring their bad -- albeit burned out -- selves to Barcelona). On the other hand, if you're out and about for 17-hours a day and just need a room to leave your luggage, grab a little shuteye, and take a hot shower before hitting Las Ramblas again, they're right for you. Incidentally, reservations are always advisable, and using this link, getting them couldn't be easier.", "Date": "March 2, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Edison, New Jersey (USA)", "Title": "“A very AVERAGE stay”", "Author": "anadallip", "ReviewID": "UR2461359", "Content": "I have stayed at this hostal twice; once in 1997 with my mom, dad and sister and the last time this past July with my husband. Let me explain that both experiences were completely different. Hotel Toledano is really a HOSTAL, so if you're used to staying at hostales or pensiones in Spain there will be no problems. El Toledano provides a TV, bed, desk, airconditioning (a rarity, really, even if it spits out air at 85 F), and a bathroom with hot water. The first time we stayed, we were in a room overlooking the \"Rambla\" with a balcony. IT was a great room. We had a great experience. This past summer we stayed in the smallest double I have ever seen in my life. There was a little tiny window facing a wall, \"airconditoning\" that, quite honestly, was necessary because the window would have offerend no ventilation. A bathroom that probably would break fire stafety standards even in Spain. Mold all over the bathroom. One foot of space around the bed to WALK or PUT YOUR SUITCASE, not both at the same time. A TV and a very dirty comfortor on the bed. Since it was a hostal, and we paid only 45 euros a night, I accepted these conditions. When I complained to the staff after the first night- the sheets were not changed, the comfortor rolled up in a ball and placed under the DESK, the bathroom not cleaned properly, I was met with indignation. It IS a family run business, and of course the person at the desk will defend his family. Understandable. I will not stay here again unless I can get room with the balcony overlooking the Ramblas. For $20 more a night you can get a 3 star hotel on Expedia.com. This hostal is just not worth it.", "Date": "August 19, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Wellington, NZ", "Title": "“Good central hotel, free internet”", "Author": "dcwledzep", "ReviewID": "UR1810136", "Content": "I am at Hotel Toledano in Barcelona right now. I read the reviews on this site after I booked and was quite concerned. The room is small, but clean and everything works. Hot water. Toilet has powerful flush. Fine for me. They are located excellently on La Rambla, yet the room is quiet. Easy to find after dark from the Metro (Catalunya). Best of all they have free internet and are trialling Wi-Fi (doesn't work in my room but good at reception). Excellent value hotel in my opinion.", "Date": "April 22, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "devon uk", "Title": "“more than happy”", "Author": "webby208", "ReviewID": "UR1627916", "Content": "What are these people moaning about I've been to both the hostel and taken a lady to the hotel and both times it was very good for what i wantedSky TV bathroom in the hotel clean linen and the best location the person who had his stuff nicked should have put it in the safe which is provided at reception for free my advice GO GO GOWebby", "Date": "February 4, 2004"}], "HotelInfo": {"Name": "Hotel Toledano and Hostal R. Capitol", "HotelURL": "/ShowUserReviews-g187497-d208587-Reviews-Hotel_Toledano_and_Hostal_R_Capitol-Barcelona_Catalonia.html", "Price": "$44 - $72*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Las Ramblas 138</span>, <span class=\"locality\"><span property=\"v:postal-code\">08002</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "208587", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/7b/d1/7bd19b90717c5cb73e2cc56a7b3bea2f2large.jpg"}}