{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Cortez, Colorado", "Title": "“Dirty Dirty Diry”", "Author": "Tammy S", "ReviewID": "UR139111360", "Content": "This was by far the worst place I have ever stayed in. The rooms are dated, and need maintenance. The rooms are the dirtiest I have ever seen. I can't believe they have not been shut down. The best thing about this place is checking out!!!", "Date": "September 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Desert Hot Springs, California", "Title": "“Location is everything”", "Author": "voyager3388", "ReviewID": "UR138703099", "Content": "Location, location, location. This hotel is in my favorite spot in Waikiki. It has a nice lobby, free wifi, a cute little diner called Teddy's Burgers. We had the most inexpensive room, and it was basic, but clean and roomy enough. I especially liked that it had a separate room leading into the bathroom with a fridge, microwave, assorted dishes and glasses, and a separate sink from the bathroom. I peered into some of the better rooms and they looked pretty nice. The staff at the front desk were helpful and nice. So, 5 stars for location and price. 3 stars for the room.", "Date": "August 28, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“DISGUSTING!!!!!”", "Author": "Guidance48", "ReviewID": "UR137683922", "Content": "Disgusting, Filthy, Service Horrible ----- Saw two rooms - Yuck!!!!! Can't afford another hotel. They won't help.with sister hotel. Flying back to.Calfornia tonight. Better than staying in this.filth!!!!!!", "Date": "August 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Location, location, location”", "Author": "Chris W", "ReviewID": "UR136258651", "Content": "Because these are individually owned and maintained condos, they are not consistent. Some are just lovely and others are marginal. However, we have stayed here several times and the one time that there was a problem the management immediately moved us to another unit. It is nice to have a kitchenette and some of the rooms have balconies which makes for a good place to put the sandy beach toys to dry off. The prices are also extremely reasonable. The location couldn't be better! Walking distance to the beach. There is an ABC store right next door and several nice eating places also within walking distance. The zoo across the street gives you something different to do if you get tired of the beach. This is a great little spot at the end of the beach hotel area which makes it a little quieter and less crowded. This is our \"go to\" place whenever we visit Oahu which is every year or two.It is great for a casual visit if you don't need amenities such as room service and fine dining in a standard hotel.", "Date": "August 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore, null, Singapore", "Title": "“I strongly recommend Waikiki Grand!”", "Author": "isabellemalique", "ReviewID": "UR133334639", "Content": "I would like to recommend Waikiki Grand to anyone traveling to Oahu and staying in Waikiki. Rooms are great (always ask to visit first and before paying), prices are reasonable, staff is fantastic and location is perfect: one block from the ocean... nice corner of the seafront with Starbucks, surfschool, convenient store, etc. and everything else just a stroll away. i spent a week surfing and worknig in Hawaii and used Waikiki Grand as my base. It was just awesome.", "Date": "July 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Sydney Australia", "Title": "“Dirty and overpriced”", "Author": "chicken1979", "ReviewID": "UR131064602", "Content": "Got a room half price on a deal email. Looked nothing like website. Dirty, noisy, airconditioner blowing on me as I lied on the bed. Uncomfy bed and smelly balcony and bathroom. Never seen anything so horrible. Was supposed to be a $210 room too - no way was it worth that. Thank god the Hyatt around the corner took us in. At least I got a refund.", "Date": "June 1, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "San Jose, CA", "Title": "“Perfectly acceptable accomodation!”", "Author": "eyhchen", "ReviewID": "UR129564630", "Content": "I booked a Castle managed room and it was great. For the price point and location, it's an awesome deal! I got room 703 facing the back, very quiet. The unit is in decent shape. Clean bed, and bathroom! The hotel is literally 1 min walk to Waikiki beach!", "Date": "May 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Hamilton, Canada", "Title": "“not a 2 bdroom”", "Author": "M B", "ReviewID": "UR129427263", "Content": "well where do I start,,,In my opinion this was not a 2 bdroom as advertised one of the bdrooms it had a pull out folding door , The woman at the front desk had no idea about the free amenity we were intitled to as the ads says FREE amentiies to 50plus years old and all of us were over 50. As for 2 couples u would think they could have given us 2 double beds not 1 dble and 2 singles", "Date": "May 5, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Portland, Oregon", "Title": "“Condo 315 falsely advertised”", "Author": "Mary F", "ReviewID": "UR128491898", "Content": "I will first start by saying that this location was falsely advertised in every way. Photos on this site do not represent this unit (or the pool). The unit is extremely small and cluttered. It was so dirty with visible stains on the couch and patio chairs. We placed our own towels down to sit. The bathroom door was initially slid closed that I had to get help from the front desk to open it. The bathroom floor had hair and dirt that was in every corner. Expect no help from the front desk due to their disinterest in the unit. We paid for parking only to find frequently someone else parked in our spot. The pool is tiny and hidden between concrete buildings (ugly!). We left halfway through our stay as we couldn't stand it any longer. This unit is also right above the bar so don't expect to have and quiet evenings.", "Date": "April 23, 2012"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Oakland, California", "Title": "“Disappointment”", "Author": "Sixmileshigh01", "ReviewID": "UR126954405", "Content": "We walked into the room and immediately was disappointed. The windows had vertical blinds where almost half of them were missing which provided almost no privacy to the many buildings that faced the room. The kitchen area was a mish mash of various items of differing design eras. The couch was a faded velvet gold from the seventies which allowed you to sink half way down the floor when you sit in it. The overall appearance of the room was dirty, unkempt, and poorly maintained. The only good point about the hotel its proximity to the beach and restaurants. I strongly advise you to take a different hotel despite of its less expensive prices.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ontario, Canada", "Title": "“It all depends on the unit you rent!”", "Author": "V-Y2K", "ReviewID": "UR125963710", "Content": "I was quite surprise that this place did not get a high rating. Condo: Our Lanai had a great view of Diamond Head, Honolulu Zoo and a bit of the beach. The Bachelor pad was perfect for my Boyfriend and I. It was very very clean and newly renovated. The receptionists were also quite helpful if you ever needed any assistance. Location: Everything was so closed by.... Diamond head was about a $12 cab ride, 1 min walk to the beach and there's an ABC store beside it for any everyday needs you may require I would recommend to stay at this place to everyone!", "Date": "March 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Brooklyn, New York", "Title": "“it was OK”", "Author": "shlobb13", "ReviewID": "UR125516232", "Content": "we rented a condo herer from a private real estate professional. the location is great, but that was about it. the inside was old, the a/c very loud and the sink clogged.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Fabulous views - suite 1003”", "Author": "Vikimor", "ReviewID": "UR122235342", "Content": "Check out their website www.myhawaiibeachfront.com click on Oahu, this suite is Waikiki Le Ale A. As the website indicates, the views from the outside deck are spectacular. The suite is small, but perfect for a couple - you can squeeze in a small child, but no more. The kitchen was recently renovated and the large lunch counter was great. 2 small fridges, a toaster, small stove and microwave were included. Not a luxurious building, but the price was right and you have everything you need. 2 elevators, laundry facility in basement and parking is reasonable. The staff were helpful and the neighbors were friendly. The tiny pool is between the hamburger restaurant below & another building - practically never used. The beach close-by is ideal with good shade and a lifeguard on duty. All in all, we enjoyed our stay and we got to tour the whole island, which is what we set out to do. I would say for a week it was worth it, but do not expect anything high-end!", "Date": "December 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Gem of south Waikiki”", "Author": "lasvegaskarie", "ReviewID": "UR122193388", "Content": "Waikiki Grand is excellent when it comes to location and affordability! I was pleased with the views and location. The hotel itself has private owners per unit. Our unit was cozy and charming with it's decor and trim including the crown molding and fixtures. The owner did a great job providing us with everything from towels to cooler and boogie boards. There was a very entertaining night club at the hotel (for very open minded people such as myself) which plays excellent club music has some fantastic bartenders and served me the best mojito martini money can buy!!! The laundry room is in the basement and is clean and affordable- overall good clean friendly place located in south Waikiki that I felt safe and comfortable in!!", "Date": "December 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Good Location, Surly Staff, Dowdy Room”", "Author": "MarkLaurence", "ReviewID": "UR121961311", "Content": "I have stayed at the Waikiki Grand before but this time I found the place lacking in ways where it simply shouldn't be. This is a hotel on the more budget end of the scale so I don't expect the standards of a hotel like the Moana Surfrider. However, I found the staff here surly, unaccommodating and lazy. Both the main desk guy and the young woman spend their time sitting, glued to a computer and only bother to look up when you ask them a direct question. So much for the Aloha hospitality! The room, while obviously renovated was disappointing - no balcony with windows that didn't open. They were so filthy you could barely make out Diamond Head or the beach views. The air-conditioning was noisy and too powerful for the size of the room. The remote to the TV didn't work. I have stayed in Hawaii many times and really think it is worth spending a bit more and staying at a hotel other than the \"Grand\". As each room is individually owned you can never be sure of the facilities. The room is only serviced every 3-4 days and they don't even renew the soap or shampoo even though I was there for a week. The most disappointing part of the experience is the uninspiring staff who fail to understand that their job security is dependent on tourism not just the residents who live there permanently. You can do better for your staff in Waikiki.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Victoria, B.C.", "Title": "“Great Location & Good Value”", "Author": "guysteve98", "ReviewID": "UR121709697", "Content": "I cannot understand some of the negative comments. This was my fifth trip to Honolulu, & the first time I have stayed at the Waikiki Grand Hotel, & I will definitely stay here again. I spent 13 nights in Room 516, which was booked through the hotel pool. This is a condo hotel, & some rooms are booked through individual owners, so the quality & condition can vary greatly. My room was serviced every 3rd day. There were a few problems with the room I had, nothing earth shattering but I let the front desk know when I checked out, so that they could address it.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Antioch, California", "Title": "“Not for first timers...”", "Author": "none ya b", "ReviewID": "UR120513083", "Content": "Getting to the room as soon as I opened the door it smelled like smoke and a homeless person. Not trying to be mean, but that is what best describes the smell. There were six blinds missing from the window mind you this place has been booked since late Feb. early March, and it wasn't until late Oct. until I arrived. The A/C was loud and did not work that well. The power went out twice. Room service came twice in the course of two weeks, and at check in I was told that they would be there four times. Ran out of T.P and had to go to the lobby and get it myself, as well as throw out my own trash. There was a point in the trip that the front desk had been called to ask about the room service and I was told they had already come, but the trash was still full the bed was fixed how I left it, and there was no new towels or T.P restocked. mins. later a room service attendant was sent up to do it. The pool was also dirty and didn't look to be used during the whole duration of this trip, it also smelled like an uncleaned bathroom in the pool area. The upside about this place is the location, but that is really about it, the staff were ok but I would not stay here again unless everywhere else is booked up.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles, California, United States", "Title": "“Great Value, Decent Location, Fantastic View”", "Author": "SeaGold168", "ReviewID": "UR119808215", "Content": "This is a slight revision from my previous review. I wanted to word it a bit differently. To start, the Castle Waikiki Grand isn't a traditional hotel. The studios, one + bedrooms, and suites are privately owned condominiums. At least most of them are anyway. The decor, the appliances, and the furnishings in the rooms are the sole responsibility of the condo owner. Therefore some rooms are going to be nicer than others. I had a room on the 6th floor, that overlooked the Honolulu zoo. The property is directly across the street from the zoo. However there were no weird odors or loud noises. In the mornings I would sit on the lanai and watch the peach colored flamingos walk around. From the lanai, I had a fantastic view of Diamond Head and the ocean. To the east there was Diamond Head, and to the west was the ocean. I couldn't have asked for a better view. In the mornings and the evenings, watching the sun rise and set from the lanai was absolutely beautiful. My studio had been renovated like a year before, and it was very nice. I did not see one creepy crawler in my room. It was clean, roomy, had fairly new furnishings, had a decent sized lanai, a queen sized bed, a full kitchen (no oven), dishes, utensils, pots and pans, microwave, a full sized fridge, 25 inch flat screen television with cable. The kitchen counters were granite top, the bathroom was clean and nicely done., I paid around $100/night. I went to the local grocery store (I rented a car), and I prepared most of my breakfast and dinner meals in the room and had my meals on the lanai as I watched the various people walking by and the flamingos roam around their area at the zoo. Granted, it did get a little noisy at night, but the noise didn't go on all through the night. The building has a burger joint on the lobby floor, and an alternative bar on the 2nd floor, mainly for men, but this was not a problem. I was there alone for 5 days and did not have a problem coming or going. I did not see, or experience anything weird while I was there. Sure the building could probably use a paint job, but it certainly is in decent shape. There is also parking provided for a fee. As this is moreso like an Extended Stay type of hotel, maid service is not available everyday unless you pay a nominal fee. If I am not mistaken, after 5 days maid service is provided at no charge. In my opinion, if you want to save money, this is the way to go. Just be sure to inquire about the room prior to booking. Ask about the decor, and the condo owner in general. However, if you're one of those who like to stay at overpriced hotel chains and pay a ridiculous nightly rate just for the sake of saying that you did, be my guest. Sure, you get a few more perks with these higher priced chain hotels, but in my opinion, the extra that you're paying could be used for something else. Think about it, when you're on business or vacation, how much time do you actually spend in the room anyway? I like the Castle Waikiki Grand, I'm considering going back before the year is out.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Great Value and Fantastic Views!”", "Author": "jojowego", "ReviewID": "UR118785509", "Content": "I am very surprised at the amount of negative reviews of the Waikiki Grand Hotel, as I stayed there for a week and had a great room on the 6th floor with TWO private lanais. One that overlooked Waikiki Beach and the beautiful Pacific Ocean on my right, and another separate lanai which had incredible views of Diamond head volcano (which I hiked to the top of), and was on the left side. Kapiolani Park and the Honolulu Zoo are right across the street. I had never visited the islands before, and I was very pleased with my choice. My room was spacious and clean (although they are an eco-friendly property and as such DO NOT have daily maid service), there was a very lively and entertaining gay bar called Hula's on the 2nd floor, and they have a great rooftop deck with fantastic views. I think because they do have alot of owner-rented units on the upper floors, there is a great disparity between units, but all I can state is that my room on the 6th floor was a bargain to me in the Waikiki Beach district and I had an enjoyable stay at the Waikiki Grand Hotel. I also did alot of walking in and around the neighborhood and never felt unsafe. Aloha and Mahalo Waikiki Grand Hotel and Hula's!!", "Date": "September 30, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Seattle, Washington", "Title": "“Horrible stay with staff to match”", "Author": "E K", "ReviewID": "UR116834137", "Content": "By far the worst stay I have experienced in Hawaii. I could have stayed down the beach for the same rate and been treated like a guest in a hotel. Stayed 5 nights and they never made the room up once and had to argue the last evening for 5 minutes with a security guard for shampoo and soap for my last evening! I am shocked by the staff. They never once smiled. They seem to go out of their way to avoid eye contact with anyone entering the lobby, exiting from the elevator to the lobby, etc. They only look up if you stand at the counter. Wifi keep dropping service so ended up having tp go to Starbucks to send emails. First moring, I brought back a cup of coffee and a bagel from the Starbucks and sat in the lobby and as I began to place spread on my bagel, a man with a dustpan full of cigarette butts told me I had to leave as there is no eating or drinking in the lobby! I said that I was aguest in the hotel. He pointed to an obsecured sign and said \"no food or drinks\" you must go! I was shocked that i had to leave the lobby! The man stared at me untill I got into the elevator to go up to my room. The room was in great disrepair. The deadbolt did not latch but the worst was the A/C unit that sounded like a Boeing aircraft engine even on low. I never could silence it but I needed the cool air so I went 5 nights with little sleep. I tried to Iron the second morning, as their was an iron in the closet but no ironing board. I placed my shirt on the flat bedspread to make due and yep, you guessed it, stained my shirt as the irons sole plate was so filthy, it transfered onto my shirt. Honestly, it looked like a thrift store purchased iron. The location cannot be beat as it is right across from the zoo, right at the beach and the start of the great shopping area. By the way I am smoker, and the smoking area on the side of the hotel in the alley had a chain across it most of the time that said \"sorry, area closed\". I was totally mislead by reviews of this place. There are other nearby hotels that you can have coffee in their lobbies and I bet are better places to stay. Not customer centric at all!", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Sacramento", "Title": "“Great Location and Property!”", "Author": "CooperDuper", "ReviewID": "UR116631982", "Content": "We stayed at the Waikiki Grand hotel in unit 501 which was very smartly appointed with a lanai balcony, 27\" flat panel LCD TV, kitchenette with a 2 burner range, microwave, toaster oven and a very nice apartment sized refrigerator. The kitchen and bathroom have granite counter tops, the floors were a very nice tile and the walls painted a relaxing butter color. Everything was very clean and well maintained. We were happy to see recycle bins on each floor for our plastic/glass bottles and cans. The property is located by the zoo and was very convenient to the beach, multiple dining options and a Starbucks. While we love Starbucks, since the unit has a coffee maker we saved money by making our own coffee and breakfast each morning and would go up to the rooftop deck to enjoy the view and eat our breakfast. We love to use public transportation and the bus stop for several major lines was right out front so that worked out great for us. The next time we go back we would definitely stay here again.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "San Francisco, California", "Title": "“No frills room with cockroaches - but close to beach”", "Author": "Nomar88", "ReviewID": "UR115453866", "Content": "I stayed here for one week. The room is no frills, but decent enough - good sized and big bed. The main issue was that there were cockroaches (both big and small ones). I killed a bunch one night with my flip-flops. The next day I complained to the front desk, and they called out an exterminator. The cockroaches were gone for one night, but on the next night I did see one or two (the small ones); the big ones did not appear. I would assume the big boys would appear in a matter of time. I wouldn't want to deal with that on an on-going basis. Besides the roaches, there's pretty much no amenities. They say it's not really a hotel, but condos that are for rent. The big plus is that the hotel is very close to the beach and to other cool things to do (the zoo, the aquarium, Diamond Head, the Saturday farmers market). And it's pretty reasonable. Would I stay there again? No. I'd want to find a hotel with cleaner rooms, meaning no roaches, and more amenities for the guests.", "Date": "July 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“FANTASTIC! FUN! UNIQUE! VALUE!”", "Author": "Terch16", "ReviewID": "UR103199328", "Content": "FANTASTIC! FUN! UNIQUE! If you are any of those words listed above then this hotel is for you! This hotel is not for everyone though and that is ok! My partner and myself are low profile kind of travelers. We enjoy adventure but also a good deal. We could not pass up the fantastic deal at Waikiki Grand. The location is excellent (quieter and located at the end of Waikiki Beach right next door to the Honolulu Zoo)! They are an Eco friendly hotel which means they clean your room every 3 days! This worked well for us! Free in-room internet as well. Room 901 (which we stayed in) had a microwave, mini fridge, an electric top burner with pots and pans, silverware, dishes, cups, coffee maker (for KONA COFFEE). My suggestion: hit up one of the many local farmers markets located around town! Pick up some produce and then go fishing! Or, pick up some local fresh fish! A bottle of wine and dinner! Homemade Hawaii style! Kona coffee is much better than the Starbucks located right next door to the Waikiki Grand. Walk down the road and hit up Honolulu Coffee House instead! You will be happy you did so! If you are gay it is neat to know that Waikiki is gay friendly! YES! And they share the hotel with an excellent gay bar named, Hulas. Hit up the midday happy Mojito hour! You can sit in style and gaze at beautiful Diamond Head! Super close to Queens Beach(Gay beach) Great value for the money if you are low maintenance kind of people!", "Date": "April 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Fairbanks, Alaska", "Title": "“Killer location, great view, needs a coat of paint!”", "Author": "akranger", "ReviewID": "UR96928524", "Content": "Honolulu is full of terrible hotels that look just GREAT on the internet and then turn out to be real stinkers. Honolulu is FULL of expensive hotels that are nice, as nice as any downtown Hilton or Marriott or Hyatt Regency but no more. Honolulu also has its helping of laughably silly expensive hotels that have opulent lobbies, overpriced restaurants and pool terraces with guards to keep out the rifraff. The Castle Waikiki Grand Hotel is none of these. Its pool is not worth the trouble, it is behind the hotel and ground level and surrounded by tall buildings so it gets no sun, no big deal, you dont need the pool. The Grand has no restaurant or hair salon or gift shop. It does house Honolulu's biggest and best gay bar as well as a GLBT clothing/trinket shop. What the Grand has is an awesome spot at the end of Waikiki Beach, less than one block from the sand and one entire side of the hotel and the front has a view of the ocean and the extensive Honolulu Zoo and surrounding lush parkland. You wont get a view like this anywhere else except maybe at the Parc Hotel next door. This place is a mix of owned/rented small studio condo units that are lived in and hotel rooms. The rooms are small but clean. This building is old and in same cases looks like it needs some paint here or there. The lanais are perfect for all day sun and I mean from 7am-5:30p, nothing gets in the way of the sun since there are no more tall buildings across from the hotel. There is high speed wireless internet that worked fine and cable TV with medium sized LCD TVs- I stayed in two rooms, both had nice TVs. Both rooms I was in had refrigerators and microwave ovens, one did have a 2 burner mini stove and sink, the other one did not. All rooms have A/C which you will need if the day is sunny. Dont count on quiet in Honolulu, there is always street noise but my room on the 9th floor was much quieter than the one on the 4th floor. The front desk closes at 10p so dont find yourself needing something after that! The Grand is within walking distance of all of Waikiki shopping and dining, its just right around the corner in either direction. For quick food there is a Teddy's Bigger Burger right downstairs, its a Hawaii based burger chain. Starbucks is next door, McDonalds, Subway and Burger King are minutes away. The International Marketplace is about 10 minutes walk and there is a pretty amazing food court with every kind of Asian food you can imagine from Vietnamese, Japanese, Chinese, Hawaiian, Korean, sea food of every kind and, well, much more. In addition Lu Lu's is a nice place with lots of fresh sea food and salads right next door. The Aston has a nice terrace restaurant around the corner and a liitle further down is the main shopping area where you can find such appalling restaurants as The Cheesecake Factory, Jimmy Buffets Margaritaville and Cheeseburger in Paradise- I always say that there is nothing better after a hot day in the sun than a big creamy slab of cheesecake! Anyway, chooses the Grand for a great value and a great location and you wont even notice that the room doors like like they may be about 40 years old!", "Date": "February 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Omaha, Nebraska", "Title": "“Hands down, best for your buck!”", "Author": "corylong", "ReviewID": "UR89616714", "Content": "I was slightly nervous based on reviews about what I would walk into. I was prepped to ask for a different room. They gave me room 604, and when I opened the door, I was very pleased to find a very clean room. It wasn't huge by any means, but definitely comparable to a standard Marriott room on the mainland. The room had a king size bed, nice sized LCD TV, \"okay\" WiFi, microwave and good sized mini-fridge. If you're going with a family of 4, not the place to stay, but for 2, absolutely worth a stay. The staff at Hulas on the second floor was outstanding as well.", "Date": "December 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Victoria, BC", "Title": "“Body fluids everywhere!”", "Author": "craigers69", "ReviewID": "UR87436138", "Content": "My wife and I booked this hotel through the Priceline Negotiator. We were a little concerned that we got the room for $53/night but we figured we could spend the money we saved on other things. When we got to the hotel it was in a very sketchy part of Waikiki (near the zoo). The guy at the front desk was not very friendly. We were assigned room 804. We knew before hand after reading some reviews that we would ask for a different room if we were not happy. We went up to the 8th floor and it looked like a run-down apartment building. In the room was a tiny double bed (supposed to be a queen). The bedspread was old and worn with holes in it. The ceiling was falling to pieces, the drapes were tattered, the carpet was disgusting, the furnishings were old, the tub was grungy and looked like it hadnt been cleaned in years, the fixtures were falling off and the room smelled like death. The clincher for us was the couch and stools in the room which were covered in BLOOD and \"other bodily fluids\" everywhere. We went back downstairs and told the desk clerk that there was no way we were sleeping in that room. He huffed and made i seem like we were being unreasonable in asking for another room. He gave us room 822 and said that was the only other room that was avaialble. We went back up to the 8th floor into the new room. This room was slightly better but not by much. It had a king bed with and old soiled mattress, the carpets were just as gross and the curtains had the same blood and \"body fluid\" stains as the frst room. The room was musty and the A/C didnt work. The room looked over the inner courtyard area which is surrounded in low income housing with some very unsavoury looking tenants. The only upside (if there is one) is that it had a flat screen tv. The window locks barely worked. By this time it was very late and we were tired from a long day of travel so we decided to stay the night and get another hotel in the morning. In the middle of the night the bed crashed through the frame and onto the floor. The noise from outside was very loud with crazies and druggies shouting at all hours of the night. I was itching all night and barely slept. We were up and checking out of that place at 6am. The new guy at the front desk made no effort to correct our stay nor did he apologize for the condition of the room. The only thing he said to us was to contact Priceline about a refund. It seems like they are well aware that this hotel is disgusting. We aren't usually picky when it comes to our accomodations but this is by far the worst place we have ever stayed. We went to the hotel a few doors down to use their internet access to book a room at the Hilton Hawaiian Village which was absolutely amazing! Do not stay here, spend the extra money and book a nice hotel, it saved our trip thats for sure. My only regret is that I forgot to take pictures to post with this review but all we could think about was getting the hell out of there.", "Date": "November 17, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Palm Springs", "Title": "“Yep, going again”", "Author": "EvanPSP", "ReviewID": "UR84983218", "Content": "Love this place. Make sure to book an updated room. Awesome location. Go out, have fun at the beach, hit Hula's and crash here. Nothing better for $89/night and this comes from a Ritz Carlton junkie. Just do it and have fun.", "Date": "October 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Meeker, Oklahoma", "Title": "“Wonderful view and room.”", "Author": "angie196050", "ReviewID": "UR81482349", "Content": "Stayed in Ste. 1005. The room was everything and more and the view was absolutely beautiful. The owner was friendly and easy to work with and he visited us to make sure everything was okay. Would definitely stay there. Be sure to bring a hairdryer as this is not an item that the unit has, but with a jacuzzi tub, beautiful tile and all the kitchen amenities, that was not an issue.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Diego, California", "Title": "“Not bad, if you don't expect too much”", "Author": "becca-n-sd", "ReviewID": "UR77916807", "Content": "I just returned from staying in this hotel with a friend, who rated it much lower than I did. It's definitely not luxurious or even a 4 star hotel, but I felt it was clean (no bugs or other creatures, which was a big plus to me) and fairly large/comfortable (after we upgraded to a suite). The very best thing about the hotel is the view, especially from the 10th floor, which was where our room was located. Our first room (#501) was tiny, almost claustrophobic - especially for 2people (we would have been miserable there). So we decided to upgrade to a suite (#1009) and had much more room, incl 2 bathrooms - one for each of us. My favorite thing to do was relaxing out on the lanai while looking at the ocean or Diamond Head; there was usually a nice breeze, and it was lovely (except when the construction started at 6am at two sites across the street, the Zoo and a nearby hotel). We had several problems w/our stay -- incl no free Wi-Fi or internet access in the room, even though it was advertised; having to change our parking space every day; and the curtains in the room were in shreds making it impossible to open them to allow the breeze to flow thru. When we reported these issues to Jason, the manager, he was very helpful, deleting the parking charges and cost of room upgrade from our bill, and refunding my friend's charges for accessing Wi-Fi. All in all, if a lovely view/proximity to beach/cleanliness are important to you and you don't need free Wi-Fi/internet access or all the little amenities you get at a nicer hotel, then I'd recommend this hotel. I'd give it a 5 or 6 on a scale of 1-10.", "Date": "September 2, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“One of the worst hotels I've ever stayed in”", "Author": "fredsplayland", "ReviewID": "UR77856204", "Content": "I booked this as a package deal. The photos looked great. It's not a 5 star but we didn't expect that. The room we got on the 6th floor was smelly and tiny. Very old and tattered. It felt like a large closet. We requested an upgrade and they gave us a suite on the 10th floor for an additional $40 per night. The suite was large with a great view from the deck. The deck was shared and there were constantly people stroling up and looking in our room. One person even asked how we got the room and how much we paid. It was very weird. As thougth she had wanted it but coulnd't have it. The paint in the room was cracking. The curtains were tattered and torn and the drawstrings did not work. Not even one of them. The were cheap and dinjy. Most of the windows didn't work properly or wouldn't open and the AC was not enough to cool the room. There were no closets but had a good size wardrobe cabinet. The doors were held shut by toilet paper shoved in the middle. Noise was aweful and construction next door started at 6:00am. They promised free WiFi and there was none. On top of that the staff didn't know anything about that service. I got a lot of \"I don't knows\" Even pluging into the roughter didn't work. I had to pay for an outside internet service that my wifi found. Parking was a nightmare. We had to change parking spaces 5 times in the 4 days we were there. Someone was always in our assigned space. We even got questioned by security about why & where we were parked. Good points: No Bed bugs. The manager was very nice, professional, and attentive. He refunded our money for the upgrade and reimbursed us for the wifi we paid for...that is if the refund show up on my credit statement. I sure hope so. The view was great from the top floor. Location was great. Close to everything. Bad points: Poorly maitained, smelly, bad parking facility, no one of knowlege on staff after 10:00pm., Old broken furniture, torn curtains, noisy, windows don't work. I was not happy at all. Oh, one more thing... There is an incredible wall picture in rm 1009. I't a beautiful lady and I couldn't take my eyes off of it. Pretty spooky. Loved it! It didn't make up for the rest though.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“No frills room with excellent location”", "Author": "kkua", "ReviewID": "UR71912403", "Content": "I've stayed more than a dozen times since 2001. Under new management, their late check-out policies are abysmal. Also, they should consider half-day rates for checkout by 10p. Most flights to mainland USA are red-eye flights and it would be nice to take a shower and relax before flying back overnight. This stay was an overnight layover on my USA-Asia trip. Great location since it's less than 200m to the beachfront and easy parking by the zoo across the street. Laundry facilities are pretty standard. I wouldn't recomment stays over 3 days since the apartments do not have much room to spread out your belongings. Spotty WiFi but every room (since 2005) has a physical broadband connection. Can't do much about mold in damp areas... afterall, it's the tropics and humid year round. Enclosed are pictures of room 710.", "Date": "July 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“DUMP - DO NOT BOOK”", "Author": "ArmyChic", "ReviewID": "UR65856426", "Content": "This place is GROSS!!! Carpets are stained and sticky. Vents are full of dust and dirt. Very old and dated building. Blankets have holes. I've stayed in Motel 8's better than this!", "Date": "May 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Great Value Hotel in Waikiki”", "Author": "MarkLaurence", "ReviewID": "UR58564268", "Content": "I have travelled to Hawaii quite a few times in recent years and chose this hotel having checked it out on a previous visit. All of the previous reviews are correct - the quality of the room you get depends on who owns the apartment. I stayed in room 608 and it had been recently renovated with flatscreen Television, granite bench tops, full size fridge, great balcony, views of Diamond Head, the Park and the Ocean. Yes, there is a gay bar on the second floor but very little noise travels up and I found the people staying here to be friendly. The location is hard to beat with fantastic views and close to everything. I think the critical comments about this hotel are overstated. I found it clean and generally well-maintained. The pool is not much to speak about but the free internet connection, kitchenette facilities, location, and fantastic price make this a good choice. I booked this hotel online and everything went smoothly.", "Date": "March 14, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Subpar room & service + cockroaches, but great location & price”", "Author": "MartianMan", "ReviewID": "UR58310152", "Content": "Pros: (1) Great location, right across from Waikiki beach; (2) Great roofdeck for clear view of Diamond Head and ocean, perfect for viewing sunrise/sunset; (3) Good value (we paid $89/night incl taxes for a 4-night stay); (4) Hula's gay bar on 2nd floor Cons: (1) Cockroaches & bugs in bathroom & small kitchenette--gross!; (2) Old, used furniture, including subpar mattress; (3) No room service or regular housekeeping service; (4) Front desk staff not as friendly or knowledgeable as they should be", "Date": "March 11, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Westport, WA", "Title": "“Even better than we expected”", "Author": "Pahoagirl", "ReviewID": "UR57745888", "Content": "We knew the area and loved the bar so were excited to try the hotel. It's old and pretty laid back but it was perfect for our three night stay. No maid service but I am sure we could have gotten supplies/towels if we'd asked Great kitchen set up with dishes and silverware. Coffeepot but no coffee but ABC Store is just next door. Room was small but SPOTLESS! We've stayed in other Castle properties and this is not always the case We loved it for the value, the location and the fun", "Date": "March 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Australia", "Title": "“WARNING - If you are thinking of staying here - DON'T”", "Author": "HawaiiTraveller_10", "ReviewID": "UR54879826", "Content": "This place is REVOLTING! We stayed here twice, at the beginning and end of our trip to Hawaii - and we would never stay here again. Both units we stayed in were filthy and smelly. I had booked and paid for 2 adults and 2 children, only to be allocated a room with ONE double bed. Staff could not have cared less about this and were very unhelpful. We were expected to sleep on the floor. Definitely NOT a place to stay with the family, with the gay bar downstairs pumping until 2am and gay couples canoodling in the elevators. Swimming pool was revolting - there was no way i was letting the kids swim in that. Don't consider staying here unless you meet someone in the gay bar downstairs and hire a room by the hour.....", "Date": "January 31, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Chicago", "Title": "“The world's gone crazy”", "Author": "gioviano48", "ReviewID": "UR42943488", "Content": "Okay, I give up! Are people really that crazy giving this dump a positive recommendation? How did they get to their \"fabulous\" rooms? Were they completely oblivious to the filthy hallways, the rundown elevators(one was out of order). The seedy pool area and the ROACHES!!!!? I guess some people have no idea what a decent hotel is supposed to look like, or their standards are incredibly low. All kinds of red flags should have gone up when I saw the price, but being a first time visitor to the area, and only spending two nights in Honolulu, I thought it would be acceptable. My impression while driving around the island is that very little is done to maintain properties, the homeless frequent public areas and parks, and perhaps, had I gone to a resort away from Waikiki Beach, I might have found better lodging. If you want a tropical paradise, don't waste your time in Honolulu. It is just a big city with palm trees, crumbling infrastructure, and shacks for residences. My final thoughts are that locals have no sense of cleanliness, lack manners, and love/breed roaches...Mahala, but no Mahala. Thank God, I spent the remainder of the vacation on Maui, otherwise, if this was my only impression of the fiftieth state, then may a lava spewing volcano cover it over. Then maybe, they could start all over, although the roaches probably would still survive.", "Date": "September 19, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Oregon", "Title": "“710 Great Unit w/Cal-King sized Bed”", "Author": "enjoinghawaii", "ReviewID": "UR36265580", "Content": "We met someone in the elevator that said they were unhappy with their room, but ours was spottless with a wall mounted flat screen TV ( only local channels)- but who goes for the TV. Looks like a newly renovated room. The walk is 50 yards to the beach. And you have never seen Diamond Head until you view it from the Lania (forgot to mention the Ocean view). Internet was fast, but you need an ethernet cable or go to Starbucks on the corner. It has to be the best room for the price. the room is small the the King, but we spent most of our time gone or on the Lanai.", "Date": "July 30, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“#614: Million Dollar View for a Song”", "Author": "Fairblonde", "ReviewID": "UR29222415", "Content": "Why anyone would stay in a more expensive hotel when this place offers a million-dollar view at a bargain price is beyond me! Unit 614 is located next to the elevators but I never heard a peep - I was too busy sitting on the lanai gaping at the ocean view and occasionally turning to my left to gaze at Diamond Head to the accompanying sounds of the exotic birds at the Honolulu Zoo across the street. The unit itself is a cozy studio on Kapahulu overlooking Kapiolani Park (NOTE: this IS where the action is, with a gay bar on the 3rd floor. The noisy garbage pickup every morning can be annoying - pull the pillow over your head. It's over soon.) The kitchen has basic cooking facilities consisting of a microwave, two-burner hotplate, toaster, and coffeemaker plus a minifridge. Drawbacks: no kitchen sink, freezer compartment is very limited. Bathroom was nice and roomy with a square tub. The units in this hotel are individually owned, so you have residents and guests hsaring the space, which has the feel of a moderate-price apartment complex. This is no luxury unit and if you are looking for in-room perks and pampering, you want one of those pricier rooms elsewhere, but was comfortable and clean and oh-so-convenient; the view made it worth everything! (Not all units have this particular view, but the Diamond Head side does.) It was late April and I turned the AC on only once - Sheryl Crow played the Waikiki Shell and we listened to her voice drifting over the palms. I lived in Honolulu many years ago, and this sweet spot is primo tourist location with all the perks. An ABC Store just outside the open-air lobby has most anything you want. Grab a bottle of wine or beer and some snacks, then turn the TV to the local guide channel, close the cabinet doors, and enjoy real Hawaiian music while you bask in that million-dollar view!", "Date": "May 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Great studio apartment rentals”", "Author": "kkua", "ReviewID": "UR27650912", "Content": "Got a corner studio on the 4th floor. Checked in around 9p and the front desk was already waiting for me with a key. On a bus service (Roberts of Hawaii), I lucked out since I was the first drop off coming out of Hwy1, at the far end of Waikiki closer to Diamond Head. Great apartment with a working kitchen and a sofabed. Sad I didn't stay longer to use all the facilities since I'm on a 11hr layover. Rumor has it the adjacent property (Queen Kapiolani) will be managing it going forward. The rates will go higher if this happens. At the moment, the kama-aina (local resident) rates are higher than the promo rate of USD75 per night.", "Date": "April 8, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Gulfport, Mississippi", "Title": "“Dirtiest hotel room I have ever seen and I travel a lot”", "Author": "Anne E", "ReviewID": "UR25221961", "Content": "I reserved an ocean view suite - when I got to the room, it was a very small room, with a \"kitchen\" in the closet. You had to move the bed to get to the closet. I was told it was one of their \"larger\" rooms. The windows were so dirty you couldn't see out of them, there was dust and dirt on the floor. I didn't want to leave my luggage there let alone stay in the room. I was also informed the hotel was full and to check back on the weekend to move. I went down to the front desk and immediately upon complaining they gave me keys for 3 other rooms which were just a touch better than room 412. If I hadn't prepaid for the entire stay I would have left and went to another hotel. Be wary of this hotel, they are individually owned rooms and vary from pathetic to barely pathetic. I will NEVER stay there again or let my friends stay there. My worst travel experience in 30 years!!!", "Date": "February 26, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Ca.", "Title": "“Be Informed”", "Author": "Hikerca", "ReviewID": "UR22387425", "Content": "Be Aware that this is a Gay Hotel and Lounge. So be prepared, also its very noise and very old with bad pluming. lots of crickets in all rooms, you can smell the insecticide at all times. Bottom line stay away unless you are a gay on a budget !!!!", "Date": "December 2, 2008"}, {"Ratings": {"Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Location": "4", "Value": "1"}, "AuthorLocation": "Iowa City", "Title": "“What a dump!”", "Author": "long3view", "ReviewID": "UR22269824", "Content": "Worse sleeping room I have ever stayed in! Grungy. dirty, bad bed, poor pillows, TV remote did not work, poor service.Toilet did not work. There was a notice in our room that in a week they would no longer provide housekeeping services. You had to go to the desk for linens. Positives: Nice lobby. Great location. You are better sleeping on the beach.", "Date": "November 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Honolulu", "Title": "“Love 904”", "Author": "Kupa'a", "ReviewID": "UR21658335", "Content": "This room felt like Hawaii. the price was right and the room was spotlessly clean. I saw a few other rooms and each is individualize, but we still like this room the best. Great TV, wet/ bar and nice carpeting. The beach and main drag of Waikiki are within a 1/2 block away, and the zoo and one of Americas largest parks is just across the street. Though it's obviously not a 5 star hotel - for the price it can't be beat, and since I don't spend much time in the room- it was a clean, well-fitted, efficient place to hang my hat for 2 weeks.", "Date": "November 8, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "California", "Title": "“Horrible customer service”", "Author": "zorro95051", "ReviewID": "UR18687070", "Content": "We had a 6 night vacation planed and only stayed in this hotel three nights too long before checking out. The room was not what we expected and the way we were treated with such disrespect from the night security (Morales) who just happen to shoved his name badge in my face (twice) when I asked his name to file a complaint about him after he threatened to call the police on us while we were finishing up a smoke on the sidewalk after coming back from a walk. We were in front of the building getting ready to go back up to our room 1008 (horrible view). We are on vacation coming from another state where we did not know the \"strict\" restrictions on smoking in front of this jail (Waikiki Grand) and the way the night time security approached us and threatened us was just crazy. We even told him we were staying there and all he said was \"I don't care, if I see you smoking here again I will call the police for trespassing\". The next morning we woke up to find a rules and regulations notice on our door with the smoking law highlighted. Disrespectful and embarrassing. There is NO mention of “no smoking” in the front of the hotel. We talked with the manager (Don) of the building, this guy was not any better, before we could even open our mouths to tell him what happened, he said are you in room 1008 and we said yes, he said I talked to the security and that's that law! When we finally told him about the incident, all he did was just try to make excuses for this guy. Not once did anyone say sorry. When we mentioned that we were uncomfortable and thinking about going somewhere else, he just said you are more than welcome to leave and stay next door (which we did). Instead of trying to make things better he made is worst. We ended up staying in the next building (Park Shore Hotel) and what a beautiful view and the customer service was outstanding, and it was cheaper and cleaner. What a difference this made in our last 3 days of our vacation. As far as the Waikiki Grand... I highly do NOT recommend this place, the staff is rude and needs to go, and they need some major cleaning service and a customer service oriented security (night shift). And BTW they have security cameras everywhere it is like being in jail not on a vacation", "Date": "August 6, 2008"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great location for Waikiki Beach”", "Author": "Acrylikova", "ReviewID": "UR18060140", "Content": "We booked this hotel not expecting great things given the mixed reviews, but found the location perfect for us. It was an extremely short walk to the beach, had the park and zoo right across the road and Diamond Head only about a mile away. No - it wasn't terribly close to the shops, but nothing is really too far away from anything else in this place! The front desk staff were nice and friendly, our room was a little worn but generally well kept. It was a little noisy, but the louvre windows were great for getting fresh air into the room. Not the place for a pamper or romantic secluded getaway - but anyone who is expecting this sort of thing in Waikiki needs to be paying a whole lot more for their accommodation!", "Date": "July 20, 2008"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "5", "Value": "5", "Location": "5"}, "AuthorLocation": "Louisville", "Title": "“\"A Piece of Heaven in Paradise\"”", "Author": "ParadiseTripster", "ReviewID": "UR17986426", "Content": "First, you have to understand the concept of this hotel. It is an old hotel, built in the sixties, which has been converted into a studio condo hotel, in which private owners, own the units either for rental investments or for personal use. When owners are not using their units themselves, they can rent them through the Hotel service or through private management companies. I have stayed many times in the past 5yrs at this property, I have been to Hawaii 23 times. I can tell you from first hand experience, it all depends on who you rent from, whether or not you will have a good or bad experience. Let me explain. I have found the best units in the building are the ones managed by anyone other than Queens Surf!!! I recently stayed in unit 918, for 22 nights and it by far is the best most well maintained unit that I have had the chance to experience. Many times I have rented from Queens Surf vacation rentals and the majority of reviews I have read on this web sight are things that I have experienced as well. However, just to let people know, this is a great location in Waikiki, it is in the heart of everything, you can stay here with or without a car, just out the front of the building is all sorts of options for transportation, from taxi's to the major routes for the bus systems to shuttle services. As far as the hotel, you just have to do your research, you can find great units here, just don't limit yourself to only one option for the condo units. Google, Waikiki Grand, or look for other rental services at the Grand, you can find better and more reasonable units in this great quaint condotel property. I would suggest trying units 302,319,605 or 918. I have seen and inspected all of these particular units and they are of the best quality in this building and the most well maintained for cleanliness and well appointed with every amenity needed for your stay while in Hawaii. In the basement of the building there is also a laundry facility that is available 24hrs a day. This is very accommodating, now that the airlines are restricting the amount of luggage you can check free of charge. I truely hope this review will assist you in making your trip to Paradise a very enjoyable one. I have to say that I am a very picky traveler, I have a degree in the hospitality and airline career industry. I have worked many years in the business of travel myself and know what to expect for the value of my travel dollar. My only suggestion is once again, do your homework and research and I am sure you will enjoy your stay at \"THE WAIKIKI GRAND\"!!!!! Aloha, and Happy Travels to the Islands", "Date": "July 17, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Hawaii", "Title": "“Very Disappointed”", "Author": "diva96706", "ReviewID": "UR17387180", "Content": "The check in clerk \"Freddy\" was very unfriendly and had poor customer service. The lobby area was nice but the hotel itself is old and out of date. As I give my experience to you please keep in mind that I am pregnant during this time..... The first room they gave me had a dirty tub that didn't drain properly, so I they changed my room after dragging my items to a second room, the second room had dried up urine on the toliet and they woke me up first thing the next morning doing repairs on the elevator which was right next to my room! I also forgot to add when I went to use the phone to ask about all the noise I found out that my phone in my room didn't work. I went down stairs and was told they would send someone up. Three hours later... after not hearing from anyone I went back down stair and was told the phone company would have to come out but could not come out until the next day to fix the phone so I would need to move a third time, to a THIRD room this room was better but it still had bad plumbing. I just gave up but I will never spend my money there again!", "Date": "June 30, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Do your research! Waikiki is expensive!”", "Author": "Sublimerose", "ReviewID": "UR16270156", "Content": "It never ceases to amaze me when people expect more than what they pay for. Previous reviews of the Waikiki Grand highlight the importance of researching your accommodation to have a realistic expectation of what to expect. We spent 6 nights at the Waikiki Grand Hotel - I looked around and it was the best deal we could find for our budget (Originally I wanted to stay at the Royal Grove Hotel, but it was sold out). We were strictly trying to stay to a $100 per night limit. A few things to help anyone thinking of staying here..... Yes, there is a gay bar! But who cares really - you don't have to go if you don't want to. Some people are still very ignorant to the gay community - it's not like they are going to chase you down and convert you! In this day and age people really need to 'get over it'. Yes, there is noise - especially the garbage trucks! It happened twice during our stay. But hey - its $95 per night with housekeeping included! It's also Waikiki! Things happen at night here with people coming back from the nightclubs etc - stay outside of Waikiki if you can't handle the noise! Yes, the rooms are small. The carpet was very badly stained (we were in room 620) and the kitchen and bathroom was very small. But as I said before, we were using the room only to sleep and shower - it was clean and that's the important thing. However, as a note to Management the carpet needs to be replaced in this room as it is a bit of a joke, but not 'un-liveable'. If you are a young couple (of any sexual orientation) who would like some privacy and stay somewhere which is a few steps up from a hostel, this is the place for you! If you are older, have kids, don't like noise stay somewhere else and fork out the money for what you want!!! And remember..... you get what you pay for, so for $95 per night don't complain!", "Date": "May 21, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Illinois", "Title": "“Gay Bar in this hotel”", "Author": "062703", "ReviewID": "UR15498604", "Content": "Rented a condo for the week. Location was okay. We did a LOT of walking as the hub of Waikiki was a mile away. It would have been nice to know that the bar on the second floor of this hotel is known to the locals as the gay bar in Waikiki. There is even a gay flag on one of the poles at this hotel. Honestly, we felt like we were staying at a gay youth hostel. I would not recommend this hotel for families with children. The rooms are VERY small. My husband and I were very cramped just the two of us. We had both a queen size bed and a sitting area; except the bed was a murphy bed and you could either have the bed down and stack up the sitting furniture (some ended up on the lanai), or you could put the bed up and have somewhere to sit. We will not choose to stay here again, but it was a great learning experience for us as we learned to adjust our expectations and not let the bummer of a room ruin our vacation.", "Date": "April 30, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "hamilton, ontario", "Title": "“MEH...alright....SMALL ROOMS!!!”", "Author": "bengerz", "ReviewID": "UR14637223", "Content": "We stayed at this condotel end of February to mid March! What can I say?...its Hawaii, BUT our room was SMALLER THAN LIFE! Really good location, beautiful sunrises and sunset ESPECIALLY on the 10th floor. The best view i've seen in a long time! There is a \"GAY\" bar in the hotel, it didnt bother me being a girl, but my boyfriend found it a little uncomfortable when he heard some discussions outside the lobby. NOT SO APPROPRIATE! Other than our room being small *i mean 250 sq feet*...our trip was amazing! Lanais are always a bonus, and i will not stay at a hotel without one. Also, the full kitchen *minus the oven* was perfect and we saved a ton of $$$ on food. That is a HUGE recommendation! A lanai and a kitchen! The hotel was obviously built a while back and you can tell with the elevators and the plumbing, but those were small things we worked around and didn't let it bother us. The staff were nice. I wouldn't say they were the best, but they were informative. It would have been good if the staff greeted you with a hello once and a while. We have decided never to stay here again, because it is just too small for 2 people and 5 suitcases. But I would say we never had any SERIOUS problems with our stay! For those that do stay here, its a great location. A little far from the Int. Market Place, but with a couple HagenDaaz stores on your walk to the shops, its well worth the distance if you know what i mean! Happy travels and aloha!", "Date": "March 29, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Brandon, Vermont", "Title": "“Noise and roaches”", "Author": "lady frobisher", "ReviewID": "UR14611773", "Content": "Beware any rooms that have a view of Diamond Head and/or the water: you will hear every bus that travels Honolulu. Entering the small studio, we were accosted by an odor of either garbage or mildew thinly veiled with a plug-in room refresher. The A/C had to be run independently of any other appliance or else the fuses would blow. Early in the morning, the sound of garbage trucks and public transport. And then there were the roaches. On the positive side? Great location.", "Date": "March 28, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "California", "Title": "“Fantastic Location! Loved It All!”", "Author": "Tom039", "ReviewID": "UR11967759", "Content": "The WAIKIKI GRAND has the very BEST location in all of Waikiki Beach! Make no mistake, it doesn't get any better than this! Diamond Head, Kapiolani Park, the beautiful beach and ocean are all right there! Just 50 yards to the beach...or all of about a 30 second stroll....WOW! It is a hip boutique style residential hotel with a great \"beach vibe\" and open air lobby with very friendly people! Each of the studio condo units are privately owned, therefore, they reflect the owner's personality and style...which I find refreshing! No cookie cutter rooms here! And many of them come complete with kitchenettes, which is another great added bonus! They are also planning upgrades to the building in the near future....so it's only going to get better and better! You can't beat the rates, either! Search all of Waikiki and you will find no greater value with such a prime beachside location...than the Waikiki Grand! We are thinking of buying a vacation unit there and worked with some great Realtors who know every unit in the bldg. and gave us wonderful insight and guidance, as they sell most all units there. So if you are looking for a great experienced real estate team, contact David & Nick, well-known as \"The Dream Team\" at [--] and they can help you find the best deal, for sure. We are hoping to buy a unit there, rent it out when we are not using it, then call it our \"island getaway\" when we stay in it. Lots of the owners do exactly this and make it a great investment. I highly recommend the Waikiki Grand! If you are adventurous and enjoy a \"beachy vibe\" and love experiencing something different, then the Waikiki Grand is perfect! Aloha!", "Date": "December 26, 2007"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lake Tahoe (California), California", "Title": "“Loved the Grand - 2nd visit”", "Author": "linneams", "ReviewID": "UR11088153", "Content": "This is the second time I have stayed here. My husband and daughter (9yrs) stayed here in May in 2007 in 319 - wonderful newly remodeled unit. I was a shocked it was so nice. Great location to everything. This time we booked another unit with them as we know they are remodeled to the same standard and they are so nice. We booked 918 this time. I loved this location. Great views and an entire wall of windows. These guys (the owners of 3 units here #319, 605 and 918) are so amazingly professional and accommodating. They came in and did a midstay clean. The place looks so new. So did 319. Next time I will stay in the other one. We cannot beat the price and location. We bring my daughters Razor and zip all around the beachfront. We are actually going to look at some real estate here this trip. I cannot comment on the other reviews of the front desk as we have not have to interact with them as Pam and Alice take care of every last detail. -Oh little thing about the circuit breakers, do not have every appliances and the AC running at the same time as it tripped the breaker once. The man 'Lloyd' came upstairs and fixed it straight away. Just an fyi.", "Date": "November 27, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "San Franciso", "Title": "“I have a suggestion.... Don't ruin your vacation by staying here.”", "Author": "Latte_b", "ReviewID": "UR8825748", "Content": "At 3pm I waited over 25 miniutes for an unapoligetic clerk who simply said he was tending to something upstairs. My room was far below what was advertised on expedia.com. I was told I was being upgraded to room 419. The place was so noisey at 5 am garbage trucks empty endless trash bins located right below my window. The breakfast was mediocare not a continental breakfast but rater a boxed muffin and juice with cut fruit that was obviously not refrigerated! This place is poorly managed the room was filthy sand everywhere I couldn't go barefoot in my own room, the kitchenette was disgusting the dishes and flatware were greesy and there were roaches everywhere even in the shower.", "Date": "September 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Beulah, MI", "Title": "“Great room, great area”", "Author": "YeeMI", "ReviewID": "UR8489937", "Content": "We stayed on the Deck floor (10th flr) in 1004 and 1005. We had to take one room for 3 nights, the next for a week and back to fhe first room for our last week. This was due to our last minute booking for this vacation. We booked one room directly from the owner and the second room through the management company. Good rates for the studios. Both units were clean and well maintained. One unit was THE show place of the building. Breakfast and newspapers were delivered daily. The coin operated laundry room was located on the parking level. Our units faced the zoo and we could hear the baboons at night and early morning to add to the flavor of the islands. The beach and Kapiolani Park were one block away. We were treated well and would return.", "Date": "August 23, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "San Mateo, CA", "Title": "“Noise, no sleep, no parking...”", "Author": "dakine94110", "ReviewID": "UR8138866", "Content": "-Unit #914 is uninhabitable; the elevator nosie is constant since your unit is directly next to it, and the car arrival bell would wake the dead. What's more, the lanai door of unit #915 is directly next to your headboard, and that resident comes and goes more than the roaches and slams the door each time. I tried to speak with him about it to which he said \"whatever.\" What's more, upon arrival; the internet didn't work; no laundry room key in the unit; no remote for the TV. Each a small issue, but combined make it a miserable experience. -Unit #409 was super! for the first two days until complete demoltion and renovation began in unti #509!!! I was offered unit #1001 as replacement...until the construction worker at least, took pity on me and warned me that unit #1002 was next to be removated that week!!! -Parking is EXACTLY what the other user said; someone always takes your stall, expecially on week-ends as Hula's patrons arrive in numbers. The front desk is helpless, and will not tow. I have adopted the habit of \"borrowing\" a HPD red traffic cone to mark my stall when away from the building, well, that is to say once I got a stall as my first night SOMEONE ELSE WAS IN IT! -Don the Resident Manager is a complete waste of humanity. He is inept and unable to resolve any issues. May I suggest you stay at a real Hotel, such as The Hawaii Prince as I subsequently did...", "Date": "July 17, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Sal. Cal.", "Title": "“Racist staff would not stay here for all the tea in China!”", "Author": "melroseb-boy", "ReviewID": "UR8081094", "Content": "All my life wanted to visit the beautiful islands of Hawaii. Choose this particular hotel for obvious reasons. Did not complain about the pool that did not exist eventhough the website contained a photo of a beautiful pool. I was very insulted when a staff member questioned whether or not I was an actual residence of the hotel because I am an African American. I am in the process of returning to Hawaii & I make it a point to tell everyone of the rude racist behavior that I experience at this establishment. I would not stay at this terrible, run-down dirty hotel for all the tea in China!", "Date": "July 9, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Grand Rapids, MI", "Title": "“Had a Blast”", "Author": "mcpants8", "ReviewID": "UR7939005", "Content": "I loved it here! I went with my brother. We stayed on the frist floor in a very nice clean room. Hula's was great! We ended up making friends, and having a blast and even went a gay catamaran tour. I would recommend this place to anyone!", "Date": "June 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Happy to return”", "Author": "ynotc", "ReviewID": "UR7362658", "Content": "Having read some rather negative reviews, we were a little concerned that we had done the right thing in booking the Waikiki Grand. But email service from the staff was very reassuring and helpful. We arrived on an early flight and, as requested, our room (911) was ready. The check in staff were very helpful. The Grand is in an excellent location if you don't want to be surrounded by the hordes. Right on a beautiful park and with stunning views of Diamond Head, the beach - magnificent sunsets (see photo) - and of course the park with a first class zoo. Being woken by real monkeys chattering rather than the human kind was a great experience! The negatives? The room was tired with second hand furniture from a church bazaar - at least it looked that way. The 'phone was useless and no bedside lamps. But we didn't really care; the location more than made up for it. After a heavy day of activity, a cold beer on the lanai and that fantastic view, nothing else mattered. We did have several occasions to call maintenance and contrary to other's reports, can only say the response was excellent - immediately fixing the problem (blocked toilet - not nice, but it does happen). While we were there, the hotel introduced continental breakfasts which was a pleasant touch. The house maids were very pleasant and our room was always clean with fresh linen. At all times, the staff were friendly and helpful. I've stayed in 5* hotels world wide. This certainly isn't one, but I'd happily go back - in fact, we are: for Christmas this year.", "Date": "April 15, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Petaluma, Californiagal", "Title": "“Queen's Surf Vacation Rentals r da Bomb!”", "Author": "HIDiHoPetaluma", "ReviewID": "UR7259774", "Content": "We booked Queen's Surf before reading all the negative reports - then panicked, finding it too late to cancel under their 21-day cancellation policy. How HAPPY we are that we adopted a 'wait and see' attitude - our room was absolutely perfect for us: clean kitchenette, clean bathroom, and a stunning view of the beach/park across the street. Yes, the floors are tile and not carpeted. Fancypants this is not. But clean, quiet, great view - and of the bars we visited in HI, Hula's 2 floors down was our favorite for great view, ambiance, and friendly folk. Everything we could've wished for... and so centrally located that we enjoyed both quiet AND walking distance proximity to beaches, attractions, and anything we wished for - even an art show in the park across the street! Fellow guests encountered at the front desk seemed equally well pleased with their rooms:we heard no reports of unsatisfactory accommodations during our stay. Queen's Surf is highly recommended; it'll be our 'place of choice' whenver we return to Oahu!", "Date": "March 31, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "ohio", "Title": "“Unpleasant Experience”", "Author": "buckhntr", "ReviewID": "UR6908179", "Content": "Booked 4 nights in room #319. Could only stay 2 two nights. There were roaches on the ceiling, kitchen, and bathroom floor. T.V. didn't work. Gay bar on the second floor wasn't really what I was expecting. Didn't have much luck getting a refund. Very dissappointed in the whole experience.", "Date": "March 3, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Naples, Florida", "Title": "“A one star hotel”", "Author": "Redfish2", "ReviewID": "UR6833638", "Content": "We booked this hotel thinking it was a three star hotel and that our room would look like the picture that Expedia displayed. We saw two rooms and took one of them only because it had a king bed and the other had a double and that was all that was left. However, the bed had been slept in and the management told me to just pull up the covers as nobody had been there very long. So at 11 PM at night I asked for clean sheets and made the bed myself. The floor was tiled but felt dirty on bare feet and the white wall tile in the bathroom was all dirty. The tub had bad stains on it. The bed was very hard and uncomfortable and the spread was worn out. The bed and one table and two chairs(only) in the room looked like old Hawaii but too old. We were on the alley side of the hotel with three windows and there was noise(dumpsters, trucks, buses)all night long. This was room 420. We noticed other rooms that the maids were cleaning and some looked a little better than ours. It seems that in Honolulu one needs to spend a lot of money on a hotel or settle for an old seedy hotel. The hallways are worn and dirty. I would not recommend this hotel to anyone even though some rooms are better than others evidently.", "Date": "February 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Pleasant stay at Waikiki Grand”", "Author": "flipviet", "ReviewID": "UR6821508", "Content": "Note that the Waikiki Grand is a condo building. The individual units are owned by different owners that are rented out by the building management. Thus, the condition of the units, the emenities and their decor are different. This may explain the different reviews here. We have been to Honolulu many times and decided to stay at the Waikiki Grand on our recent visit (Feb. 10th 1007). The check-in counter persons were courteous; our check in and out was swift. We stayed on the 4th floor. The room was equiped with a fridge, microwave and a full kichenett (electric burners, sink, cooking utensils, pots/pans, plates, bowls, cups, knives, forks, spoons, etc. etc.), diswasher detergent, coffee maker and coffee packages. In addition to eating out, we used the kitchen quite a bit. The entire one side of the room was windows from top to bottom with double pane glass. It also has a temperature controled air conditioning unit. We like the breeze so we opened the windows most of our stay to allow the island air to circle the room. The room has recessed lighting in several places - a nice touch. The floor of the entire room and the bathroom is marble (or marble like?). It's a nice alternative from the usual carpet. The king size bed was comfortable. Room has TV and VCR player, alarm clock. Hot/cold water pressure was excellent. Breakfast (a muffin, croissant, fresh cut fruits and juice) were delivered daily with newspaper to our room. Room was serviced daily and towels (including soaps/shampoo) were replenished. Overall, our stay was pleasant. No issues or problems. It's \"Avove Average\" in the dollar/price range and its class of accomodation. We certaintly would stay there again! Likes: Great location; steps from the beach/park/zoo Nice comfortable room Hula bar on the second floor 80% straight shop in the lobby Great views from the 10th floor sundeck (you can sun tan there) Dislikes: No free wi-fi (though you can get free-wifi at hula bar) Pool is of no use (it's in a shaded area behind Teddy's burger).", "Date": "February 21, 2007"}, {"Ratings": {"Cleanliness": "3", "Business service (e.g., internet access)": "2", "Overall": "3.0", "Rooms": "2", "Service": "3"}, "AuthorLocation": "portland oregon", "Title": "“Friends of Dorothy”", "Author": "pdxreview", "ReviewID": "UR6521216", "Content": "If you are a gay beach fan, this little gem is conveniently located across the street from the gay beach on Queen's Surf. There's also Hula's right downstairs on the second floor where you can get your gay cocktails on after the beach (Sun afternoons are fabulous). This was our third visit to Honolulu and my first review of the hotel. The hotel itself is OK. It's a little dated but the condo rooms have been renovated in many cases. Ours was incredibly tiny with no place to store our roller boards but it had been renovated with marble-esque tile in the bathroom and an updated kitchenette complete with LCD TV. We really could have used a radio/CD player. There was none to be found anywhere in the room. I blew the dust off the Gloria Gaynor CD for this trip and found that there was no where to play it. Our oceanview lanai overlooked Diamond head. Definitely the best feature of the room. The worst feature of the room was an air conditioner which was one of those window units installed right at the headboard of our queen size bed. Kind of loud right by head every night. Also very cold. I was gracious enough to let the boyfriend sleep on the other side of the bed because she complains a lot when the temperature is not to her liking. They've added a comp (or should I say camp?) continental breakfast delivey @ 8am. That was a nice touch. So girls if you're in Waikiki for the beach and not necessarily the luxury, I wholeheartedly recommend the Queens Surf. Who sits around in the room all day anyway?", "Date": "December 30, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Montreal", "Title": "“Hated It !!!”", "Author": "JuliefromCanada", "ReviewID": "UR5964502", "Content": "We hated this hotel. As we got in we were greeted by a Security Guard who didn't even understand English ! We had five uninvited guests (Cockroaches) waiting for us in the room !! The washroom looked nothing like the photos ... I've seen better washrooms in third world countries !! The room we had looked nothing like the photos, the bed sheets were dirty and the bed was just discussing !!! With the help of Expedia we got a refund and moved to the Sheraton a few blocks down. Expedia was very supportive and gave us an excellent service !", "Date": "October 17, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Ohio", "Title": "“I Loved It!”", "Author": "travelwebb", "ReviewID": "UR5942850", "Content": "I had a great time in Hawaii this past trip and thought that the Hotel I stayed at \"The Waikiki Grand Hotel\" was a great place to stay. I have read these reviews and was weary, but when I got in the room it was very clean and the Ocean View was great! I would definetely stay here again! The crew they got working there are awesome! They helped me with all my questions and where I wanted to go. Thanks guys. Aloha!", "Date": "October 11, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Filthy, Feces, Unacceptable”", "Author": "HaddonNYC", "ReviewID": "UR5830334", "Content": "I stayed at the Waikiki Grand from August 1 -13th, unfortunately. It was was WORSE experience I have ever had. The condominium was filthy. The manager, Miho, was unresponsive. The first two days I spent cleaning the apartment. A few days after I was there, I flushed the toilet and all the feces from flusing the toilet came up in the bathtub. The next day, when the bathtub backup up again, I called the Department of Health. Manny, one of the staff members, screamed at me for calling the Health Dept. Because I had paid for the two weeks in advance, I was not able to get a refund. When I asked to be moved to another hotel, there was no response.", "Date": "September 23, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Maui, Hawai'i", "Title": "“No aloha at this hotel.”", "Author": "Native_Hawaiian", "ReviewID": "UR5558972", "Content": "I am a resident of Hawaii and I am embarrassed by the lack of customer service at the Waikiki Grand Hotel. Waikiki was booked and no hotel rooms were available. Since our favorite hotels were full, we booked 2 nights through a travel engine on the internet . Never staying at the Waikiki Grand Hotel, we didn't know what to expect. I called ahead to alert them that we were going to arrive late in the evening. When we got there, we were confused by the Private Parking signs under the hotel, but parked anyway thinking it was for hotel guests. Out of the elevator the 3 of us adults came (me+hubby+daughter), only to see the Front Desk clerk say goodbye to the Security Guard, even tho she sees us arriving. We were greeted by the Security Guard with a, \"Driver's license, please.\" Where's the aloha in that? Then we asked if we could park downstairs. He put the fear of God in us and said to move it immediately if you don't want your car to be towed away. We had to park across at the zoo or 5 blocks away. We ended up in the latter. Now it's 10:30p and we go up to the room where there's only a king bed ... for 3 adults? Hmmm, let's go back to the Front Desk. I explain the situation, he puts up both hands and says he can't do anything because he's only a security guard and he doesn't work for the hotel. There's also no manager until 9 am the next morning. By this time, steam hits the top of my head and I find myself yelling at the guard. All of a sudden he gets a brilliant idea to check the computer and call the FD clerk that left earlier. Luckily there was one more room that might be empty and daughter could sleep there until other accommodations could be made in the morning. To make a long story short, we got another room with a less than acceptable futon and double bed for the next night - hardly worth the money I was paying for. The parking nightmare never ended because the zoo, as well as other parking structures, were always full . No manager ever contacted us to make amends which goes to prove that there was no aloha extended at the Waikiki Grand Hotel. Don't stay there. Go elsewhere.", "Date": "August 4, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Scottsdale, Az", "Title": "“Loved the grand”", "Author": "deeph2oswimmer", "ReviewID": "UR5488776", "Content": "Great View Very affordabe nice staff clean I was treated so well at this hotel I have to recommend it. The Ocean View rooms seem to be the best value. For about $10 more per night you can get an oceanview instead of looking at a bunch of buildings. If you stay for 7 days the price is almost cut in half per night.", "Date": "July 19, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Best Hotel Room for the price in Waikiki”", "Author": "A TripAdvisor Member", "ReviewID": "UR5471483", "Content": "Although there are mixed reviews of the Waikiki Grand, I believe that if you get the right room, you will have the best bargain in Waikiki. We stayed in Room 908 which is the Direct Ocean View unit run by Waikiki Retreat. The view is absolutely magnificent. The only thing between the room and the ocean view is a small slice of queen kapiolani park (and the room is way above the treetops). the ocean can be seen from every part of the condo (except the bathroom). There is also a stunning view of Diamond Head. Being so high up and off the main road, its fairly quiet--we could not hear the bar on the 2nd floor. The unit is competely renovated with a/c, tile floors, a murphy bed and a small updated kitchen. bathroom is also clean and neat. The whole unit is very stylish. It took us a while to figure out how to boil water on the cooktop but we were successful. A definite plus to be able to cook in the room--there is a grocery store about a mile away (we reserved a parking space in the hotel so had access to a car). The beach is a two minute walk--extremely convenient. The only slight negative is that it is small so its only suitable for singles or couples. But that is understandable for the price. we paid about $125/night including all taxes which I think is reasonable for the views. The lobby is perfectly nice, the elevators and hallways aren't as attractive but this room is spectacular. Highly recommended.", "Date": "July 16, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "el cerrito, ca", "Title": "“$100 for Rm 511 was too much: we bailed. Room 914 for $100 a bargain.”", "Author": "ratNparrot", "ReviewID": "UR5436991", "Content": "Room 511 was NOT suitable for us at even $100/night. We would have left immediately had it not been a late-night arrival. My parents were in room 914 for the same $100 and they had a bargain as it's bigger, had marble floors and unlike our room, they saw no cockroaches. The higher you get in the hotel the nicer it is. the rooms WITHOUT views are DIRE. stay away at all costs. The night watchman is the only help after hours and he only comes by the desk every 20 minutes. There's a walkie-talkie on the desk he said we should have used despite it being labeled 'for emergencies only.' All those flowers you see in the website photos are the same 2 bouquets. No flowers in the room as advertised. Room 511 had a lanai that appeared never to have been washed, tiles falling off, doors that wouldn't close, the fridge defrosted causing a flood for us to clean up, we spotted 5 different cockroaches in the room.... there is a 1 inch gap under most of the doors in the hotel so it must be a bug superhighway. The bed smelled of cologne. The elevators are creepy, the gay bar on floor 2 is VERY busy and therefore there's a steady stream of heavily perfumed people running around. If you're perfume allergic: Stay Away. PARKING IS A NIGHTMARE. The lot is too small and if there aren't spots you are directed to other hotel parking lots a good walk away. Add $10/day to the price for parking. The plus side: great to be on this side of waikiki overlooking the zoo. They were willing to negotiate to $100 per room a week from high season. A couple of the rooms may be nice below but stay on the 9th floor or above is our suggestion. The nice gal at the front desk refunded our money graciously. For $10 more per night we moved to the Beachcomber and were MUCH relieved and preferred being able to walk to better food (Moana Surfrider Veranda).", "Date": "July 7, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Minneapolis, MN", "Title": "“Hated the Waikiki Grand”", "Author": "KellyZ", "ReviewID": "UR5044531", "Content": "The outside of the htoel looks okay, but the second you get on the elevator things only get worse. We had a decent view if the park, but there was a busy avenue right below the windows. We stayed on the fourth floor and the gay bar two floors down was loud until about 3 am on the weekend. Buses start up early, as well as street cleaners, and traffic in general. Even heard a homeless man pushing his cart by. There was a group of 7 loud, drunk guys outside until 4 in the morning with a prostitute, and someone else got beat up, which brought sirens and more noise. This avenue seemed full of drunks. This is a big deal when there is no air conditioning and the windows must remain open. Do not plan on getting any solid sleep and don't plan on sleeping past 6 am. The bed was cheap, the sheets smelled. I took the bedspread off and walked it down to make sure it was replaced. The lanai was gross, the bathroom was gross, the carpet looked and felt gross. This place is very dirty. It is also VERY overpriced. There are hotels closer to prime areas that are cheaper and MUCH cleaner. The zoo is also nearby, and I could smell faint animal smells. The pullout bed was a bunch of plywood nailed into a frame and a lumpy mattress was on top, with no blankets. At least you'll make yourself go out and do something, because very few people woulod intentionally stay there loger than they have to. I'm not picky, just like to get my money's worth. Stayed in a much better place in 2005, for the same money.", "Date": "May 9, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Phoenix, AZ", "Title": "“Great place for the price!”", "Author": "aztrvlgrl", "ReviewID": "UR5011632", "Content": "We stayed at the Waikiki Grand Hotel from Dec 29-Jan 5, 2006 and were pretty happy with our selection. We booked the room through a vacation rental website and did not realize that it was a hotel that catered to gay and lesbian couples and needless to say, my husband was not too happy when he found out. However, for only $100 a night (during new years) and to be right across the street from the beach, we were EXTREMELY happy with the hotel. Our room was actually a studio condo and was neat and tidy as advertised. We even had a stove, fridge, toaster and dishes, which was extremely nice. We hit the ABC stores multiple times for breakfast and snack foods so we did not have to eat out all the time. (another bonus is the Starbucks right there on the corner) The staff was extremely friendly at the Waikiki Grand and we never had a problem getting beach towels or chairs – they don’t even charge you for them like some of the bigger hotels. It was a simple hotel – no extras, but a good deal for the price. As far as the gay and lesbian scene – yes, there is a bar on the 2nd floor that caters to gay and lesbian couples, but we never felt uncomfortable during our stay. We saw many different types of people staying at the hotel, from younger, straight couples such as ourselves, to retirees, and families. The only negative during our stay was the location of our room. Our room faced the alley and since there are no “real windows” in the room, the noise from the street carried up to our room and we were woken up on a couple of different occasions in the wee-hours of the morning. The hotel is at the end of the Waikiki strip, but in easy walking distance to all of Waikiki’s beaches and shopping. We found many great places to eat and there are PLENTY of places to shop. The hotel is also across the street from the Zoo and Kapiolani Park. For the adventurous souls, you can take a long walk/jog all the way up to the top of Diamond Head for spectacular views. (make sure you do this early in the morning before it gets too hot) We also took the advice of another travler and made reservations at the Top of Waikiki for their sunset dinner - great advice. The food was excellent and the sunset was amazing. Happy traveling!", "Date": "April 26, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Dayton, OH", "Title": "“Better than Expected”", "Author": "HS_hstry_tchr", "ReviewID": "UR4453272", "Content": "My husband and I were a little leary of staying in this hotel, especially after reading some of the reviews on this site. After calling about room reservations, we were told that they couldn't give us a room number until check-in, but that we did have one of the better rooms. We wound up with room 911, which was wonderful! The view was great from the balcony, over the zoo, out towards diamond head, and right toward the ocean. You also overlook a park where we watched school groups eat and families play. Since he was there on business and I met him there for 3 days, we weren't in the hotel that much, which is how it should be for someone travelling to Hawaii. The room was great -- we had a coffee maker, refrigerator, microwave. The TV was small, but we never turned it on anyway. The room wasn't large, either, but for the two of us, as little as we were there, it was fine. We also realized on the second day that maid service is better if you tip. There was some balcony construction going on in the room above us, but there were signs warning us and encouraging hotel guests to schedule activities out of the hotel during certain hours (again, you're in Hawaii, who's going to be in the hotel all day??). Overall, a much better experience than expected, especially for the reasonable price.", "Date": "February 11, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "3", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“They Don't Deilver What They Promise”", "Author": "A TripAdvisor Member", "ReviewID": "UR4409997", "Content": "To anyone thinking of staying at this hotel, all I can say is \"buyer beware\". I was a repeat customer at this hotel and thought that we would try it again. After making an internet reservation though the Waikiki Grand website (they also go by the name of Queen Surf Rentals), we received an email confirmation to stay in Room 911 (one of their top-rated and nicest rooms). My wife and I (yes, we knew that it was gay-friendly, but that doesn't bother us as we're open minded Canadians) were very much looking forward to spending time in Room 911 as it is often described as one of the best in the hotel. When we arrived around 12:30 a.m. of January 23, I was greeted by a security person who not only couldn't find my confirmation, but also had difficulty communicating in simple English. After spending almost half an hour searching around the offices and making phone calls, it was finally discovered that my room was rented out due to \"an emergency\". Excuse me??!! The whole premise behind a reservation confirmation is to actually hold that room, not rent it out. Instead of enjoying a romantic 2 days in room 911, my wife and I were given room 509. Hardly the same room and quite frankly, a room that I wouldn't let my worst enemy stay in. Dingy, drab, and noisy. The next morning, we were moved to room 1002. Roomier and a nice view from the balcony. But the furniture was dirty and the place overall lacked any of the character, romance, or ambiance that we had looked forward to. Quite frankly, I don't think these people can be trusted. No one ever bothered to contact me to explain why we were not given room 911 or offer any sort of apology or explanation. As far as I'm concerned, they breached the contract that we agreed to.", "Date": "February 2, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Brisbane, Australia", "Title": "“..but I loved the Mai Tai's”", "Author": "KER_1952", "ReviewID": "UR4024150", "Content": "As the rooms in this hotel have different individual owners, the standards are also different. We had room 614 which was roomy, clean, good size bathroom, TV, fridge, coffee maker...all the things you would expect. Great view over the zoo to Diamond Head and the beach. Great for gay travellers as the best gay bar in Hawaii (Hula's) is located on the 2nd floor and Queen's beach is just a few minutes walk. Will stay there again next year.", "Date": "October 14, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Unknown", "Title": "“Loved It So Much..... I Bought The Unit !”", "Author": "A TripAdvisor Member", "ReviewID": "UR3984982", "Content": "I stayed in #1009 (penthouse/roof). It was truly paradise. Unbelievable view of the beach and Diamond Head in one stunning panorama. Tans look great against the white sheets, gentle trade winds blowing through the louvered windows. A quick walk to Waikiki Beach to surf, snorkle, and sun; to Kalakaua Avenue with shops and restaurants, or to Kapialani Park & Zoo. The unit was roomy, no fighting for bathroom (2) and had a kitchenette for making quick snacks, with fridge for cold beer to enjoy on the lanai while watching the sunset. While there I watched movies on the big screen on the beach, saw & bought from the art fair in the park, attended the Spam Festival on Kalakaua. Didn't ever need the car. Next time won't even rent one.....just shuttle down from the airport. Can't say enough about it.....it was an incredible stay!", "Date": "October 2, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Do not stay here with faimily”", "Author": "A TripAdvisor Member", "ReviewID": "UR3983940", "Content": "This place is old and run down - OK if you are trying to save a lot of money - but stay next door at the Queen Kapiolani if that is the case. Also, this place caters to those engaging in \"alternative\" lifestyles - so beware if you are bringing the kids, and you do not want them exposed to this.", "Date": "October 2, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Tropical room and setting”", "Author": "A TripAdvisor Member", "ReviewID": "UR3659051", "Content": "I recently stayed at a wonderful location in the Waikiki area. I have stayed at several locations in Waikiki from Hilton Vacation Village($269) to the Sheraton properties ($185-$374). I have also stayed in several properties away from the beach (4-5 blocks $97-$145) The Waikiki Grand Hotel is a smaller hotel with the best location for your vacation dollars. The room I stayed in (618) was recently upgraded with a Hawaiian/tropical flair. This studio/room was fantastic. It has a view of the City/Diamond Head. The room's decor was similar to other rooms costing $190 or more in the area. The room was immaculate. Imagine awaking to the sounds of the beach life at your door step. The property is just steps from the hottest corner in Waikiki, the beach, Starbucks and great dining. The room and property in general are in great condition and are a great bargin.", "Date": "July 11, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "San Francisco, California", "Title": "“Unimpressed”", "Author": "Matt89", "ReviewID": "UR3519000", "Content": "My partner and I stayed here for 4 nights in May of 2005. Let me start by saying the location is amazing! This is by far, the best aspect of the hotel. Based on the description of the room on the website and other guest reviews, we were expecting much more. We did have a nice visit to Honolulu but just felt the hotel was a little underwhelming. While the staff was not rude, they were not particularly that friendly. Manny however was nice and helpful. I could not help but feel the rooms were slightly dirty. The shower curtain in Room 409 absolutely needs to be changed. I will say that the price of $115 seems quite good for what we received. I think the next time, we will stay at a place a little more upscale. Thanks!", "Date": "June 1, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“My favorite hotel room ever!”", "Author": "cabbagemagic", "ReviewID": "UR3292180", "Content": "I had a great experience here, during my first visit to Waikiki. I had a city view room, and I didn't feel like I was missing out because I couldn't see the ocean. Our room was very clean, and had much more character than a boring generic hotel. The bamboo bed frame and feather comforter were a nice touch, in addition to the nice amenities in the room such as fridge and coffeemaker. The location was great; there is only one street between the hotel and the beach. I also liked the area much better than some of the other areas of Waikiki. It's at the end of the strip but seemed a close walk to everything. It was awesome to have Hula's bar right downstairs, too. Staying here felt like a treat, and it seemed a real bargain compared to the prices of comparable rooms. I don't get to vacation often, and this place offered exactly what I wanted.", "Date": "March 21, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Arizona City, AZ", "Title": "“Depends on your room number”", "Author": "azjoe35", "ReviewID": "UR3166093", "Content": "My wife and I stayed here in 1999. The first room we were assigned was terrible. It was sooooo small that there was no room for our suitcases and the TV sat sideways to the bed. The bed sank in the middle, the so called beach view was by looking at an angle out the window behind the TV. Room also sat just over a bus stop so that was heard all the time as was the early morning soda truck delivery with the loud roll-up doors. I am not one to complain as like most, I don't expect to spend much time in the room. However, I was feeling that I had nowhere nice to escape for rest or if the weather turned bad. We went to the front desk and the next day they were nice enough to get us in a suite on the roof for the same price, which was a 1000% improvement. Much larger, full regrigerator, dining table, microwave, sofa. I rate the help of the staff really high (again that was in 99) Without the first room I would rate it much higher in value. With the risk of that included I must rate it neutral.", "Date": "February 6, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Manitoba", "Title": "“Not great”", "Author": "Skryppy", "ReviewID": "UR3084403", "Content": "We stayed at this hotel for 17 days. The staff was wonderful, but the hotel itself was just \"ok\". We had problems with noise all night long on one floor. People coming and going and doors slamming. When we said something to the staff, we were told that they were washing clothes. Everynight, I don't think so. So we didn't get much sleep here. The view from the balcony was fabulous but we had to switch rooms half way through due to the longer stay and they were booked up for Pro Bowl. We had no view except the back of a building from here. The pool was not working the whole time and we were not compensated for it in any way. The cleaning was not good iether. As they are owned by other people and just rented out, the cleaning is pretty much up to you. They will make the beds but that is just about it. There is not any restaraunt in this hotel at all and the bar is not what we expected and would not go there again. Would not stay here again unless we have to.", "Date": "January 25, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Chapel Hill, NC", "Title": "“Location and Price=Great Value”", "Author": "Chplhill", "ReviewID": "UR2841438", "Content": "Have been to Hawai'i 7 times and have stayed anywhere from $75 to $400 plus rooms. The location is the best in Waikiki I think. Ask for an OCEANVIEW room, and one that has been renovated. You have the best view in Honolulu (direct view of the Park and Diamondhead, and across the street from the Park beaches...absolutely one of the best views in Hawaii. I generally do not care for Honolulu, but when I have a day or two, I will stay here. YOU NEED TO CALL IN ADVANCE AND RESERVE YOUR PARKING WITH THE HOTEL AS IT IS LIMITED. There is a gay bar on the 2nd floor, that is filled with locals. I don't think that straight families would have any issues, (I didn't) but if you are a homophobe stay elsewhere. Also, you need to know that a portion of this is apartments for 20 somethings. That is why you should BE SURE to request an oceanview room. These are the true hotel rooms. The location can absolutely NOT be beat. If you have teen children who want to roam, (WITHOUT YOU) the main drag of Waikiki is here, and the beach, park, zoo, and aquarium are right across the street. Would recommend this hotel and will be staying here again. The rooms are small. Don't expect a room the size of a Hampton Inn or a business hotel. This is Hawai'i. Rooms at at a premium, and if you want a very elaborate room, go elsewhere....and expect to pay a lot more. Rooms hold 2 people comfortably...any more than that you would be pushing it. If you want to go to the beach and roam around Waikiki, then this is perfect for you.", "Date": "November 22, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Fantasitc location! Great price, Best views”", "Author": "A TripAdvisor Member", "ReviewID": "UR1907522", "Content": "I recently stayed in a hotel that I enjoyed and I felt I would share this hotel jewel for anyone wanting affordable lodging in Waikiki with spectacular views. The location can't be beat. It is in the the recently renovated Waikiki Grand. I strongly recommend staying in unit 911. Being on a higher floor, you had no street nosies, just supurb scenery. It had breathtaking views of the Ocean and Diamond head. It is the last building near the corner of Kalakaua and Kapahulu, so you have an unobstructed view from your bed and lanai overlooking the lush greenness of Kapiolani park and you can have a beautiful view of the beach from this room. I can't say enough about this view because it has to be one of the best in Waikiki. The beach across the street is Queen's surf beach and the city has just completed new landscaping and paving so there is a beautiful new promenade to walk along . Also on weekends they have Free movies on the beach there. They set up a 50 foot screen and everyone gathers on the beach and buys food from the stands located temporarily for the show. You can even watch the movies from the Lanai of the room I was in. The 24 hour fitness facility is just around the corner on Kalakaua. So entertainment, shopping, movies, botanic gardens, aquarium, zoo are all within a 15 minute walk! There is a Denny's and Starbuck's on the corner, it is also where the bus from the airport stops. The Lyon Arboretum and its rainforest palm collection is a 5 minute bus ride away. You can stay at the Queens surf and have no need for a car rental. But if you do want to rent a car and explore the other parts of this beautiful island, there is parking underground here. That is very important because parking spaces are very rare in Waikiki and so it is difficult to find a space if it isn't provided and they ticket and tow readily in Waikiki. The Queens surf is a vacation rentals type of lodging.. These units are in the Waikiki Grand hotel and vary in size, view and price. Most of the units have been remodeled and have gorgeous limestone floors with track lighting, new tropical furniture, crown moldings and look very fresh and upscale. They all come with a refrigerator, coffee maker, beautiful duvet covered beds that are changed daily! The rooms are spotless!! There is a new fantastic laundry facility in the basement with a free color TV and large folding areas. The ocean is across the street. There is also an open air limestone floored lobby and it is a great place to sit and watch people. Besides from the best location and best view, friendly service and spotless rooms, the thing that makes this place outstanding is the price. The prices vary depending on how long you are staying, if you need a full kitchen, or want that million dollar view of the extinct diamond head looming over the lush tropical greenness of the zoo and Kapiolani park. Rooms go for between $60-$125/night. That is incredible! Just explain to one of the people at the front desk your needs, (Liz is great) if you are on a budget or whether you want to go all out and they will make sure that you get a wonderful room at the absolute BEST value. For the view, cleanliness, location, facilities, and price it is unbeatable. I've had friends that have been back twice and with those prices were able to stay longer the second time and really felt at home, comfortable, beautiful views, everything a convenient short walk away. It made for a very enjoyable vacation. With all the upgrading and new landscaping the city has provided to the nearby area, this part of Honolulu has become wonderful. Perfect for sunning, swimming, socializing and shopping. It is not grass-shack-isolated-tropical luxuriance, but it is big city fun, excitement, activities, cleanliness, safe friendly and Great prices.", "Date": "May 10, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great value and location”", "Author": "GayTwosome", "ReviewID": "UR1703464", "Content": "First, re one of the earlier reviews...Queens' Surf (in the Waikiki Grand building) is NOT the only gay-owned property in the neighborhood. However, it is the only one (in my opinion) with the best location. The check-in process at the front desk was the same as any hotel with friendly and courtesy service. But do not consider booking anything but an ocean-view room, which actually faces the park more than the ocean. The view from you balcony of Diamond Head every morning as you have coffee and the view of the surfers returning to their cars in the evening is well worth the small difference in price from the city view room. The imaculately clean and white studio we had (#414) was perfect with a tidy kitchenette with every possible item of utensils, dinnerware and cookware...plus a coffee pot and microwave and fridge. We do agree with the earlier review that there is some noise from the elevator, but that happens in any hotel. We requested, and received promptly from the front desk, a small fan which we turned on at night to mask outside noise. It worked perfectly and our sleep in the very comfortable bed was undisturbed until the sun started streaming in the next morning. Hulas, the largest gay bar in town, was on the second floor but the music from the club never disturbed us. In fact, we could not hear it even when we were on the balcony. And it was very convenient to pop in for a drink or a cruise whenever we wished. Queens' Surf beach is a 5-minute walk away and the execellent and very-gay-friendly W Hotel bar is a 10-minute walk. Situated on the far East end of the the main drag in Waikiki, the property is out of the press of the main tourist trade. Whenever you are ready to head to the beach, the front desk hands out large towels and beach chairs. They are yours for the day free of charge. There is also a large and recently renovated coin laundry room in the basement with new washers and dryers that have digital timers, plus a large flat-screen TV to help pass the time. This property was the perfect place to relax, play, or just enjoy the best of the beach and the city. We will be back every February for at least a week.", "Date": "March 3, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Unknown", "Title": "“Wouldn't recommend”", "Author": "A TripAdvisor Member", "ReviewID": "UR1546736", "Content": "This is a great location and the price is good. The front desk staff are very friendly but completely incompetent. The maid service is terrible. If you want good service and a clean room do not stay here.", "Date": "January 12, 2004"}], "HotelInfo": {"Name": "Castle Waikiki Grand Hotel", "HotelURL": "/ShowUserReviews-g60982-d208960-Reviews-Castle_Waikiki_Grand_Hotel-Honolulu_Oahu_Hawaii.html", "Price": "$115 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">134 Kapahulu Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">Honolulu</span>, Oahu, <span property=\"v:region\">HI</span> <span property=\"v:postal-code\">96815</span></span> </span></span></address>", "HotelID": "208960", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/14/70/1470619335e6143947ec3cf0e19b72cc4large.jpg"}}