{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Location is tops”", "Author": "Suewynn", "ReviewID": "UR123293981", "Content": "Can't beat the location if you want a Bloomsbury location. Our room, Number 6, was small, but quiet and adequate. The bathroom was tiny and was obviously added to the room which made the floor space smaller. However we used the big shower that was outside the room and right next door. No problem for us. Breakfast was just fine and came to the table in a matter of minutes. The coffee was always refilled promptly. Oh, and the price was reasonable.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "newcastle upon tyne", "Title": "“good enough for £72 a night inc breakfast!”", "Author": "exaceface", "ReviewID": "UR121598070", "Content": "I recommend this hotel for it's location - quiet and near tube stations at Russell Square and King's cross. Breakfast room is small but my bacon and eggs were fine. i'd book here again.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Staffordshire", "Title": "“Fawlty Towers still exists!”", "Author": "jschwa1", "ReviewID": "UR121564133", "Content": "The Jenkins is in a reasonable location in a building with character, but should be so much better. The staff generally appear to have been trained by Basil Fawlty, but maybe not quite as extreme. You are not asked what you want for breakfast, but told what you are hitting unless you object. The room was clean but the free standing shower unit was cramped and only just had enough water to be usable. Kettle lead too short, so it had to go on the floor, wi-fi only worked occasionally.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Dumfries, United Kingdom", "Title": "“Poor B&B NOT a hotel!”", "Author": "Carol H", "ReviewID": "UR121547752", "Content": "Cons: There was no reception area so the booking-in details were done downstairs in the kitchen! Our room was in the annex on the ground floor through a very narrow short passage with a door that could not open fully as it hit the door of the tiny bathroom/toilet and was extremely difficult to open from the inside as there was only the small Yale snub to hold, ie it needed a handle as well. The two rooms shown in their brochure looked much nicer than this one or else the photos were enhanced!!!The hottest the water ever became was warm - not much good for me as I like a hot bath especially in December! The large bed had no headboard, the sheets and blanket were short and there was only one beside table and light. An old TV was on top of an empty old small fridge. The sink was opposite the bed but had no towel rail. The built-in cupboard was so narrow that the hangers had to be turned on an angle to close the door though there was a good safe in there. Wifi was very slow. Breakfast was 0800 to 0900 (no good if an early start was required) and there was very poor selection for breakfast though the service was fast. Everything was done on the cheap especially considering the price and the fact that there was plenty of proper small hotels nearby. Pros: It was clean and warm. The staff was OK. Good quiet situation near Euston. Overall: I would certainly NOT recommend this \"hotel\" (should be classed as a B&B!!!) to anyone especially as it was overpriced for the little one got for the money.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Barrow-in-Furness, United Kingdom", "Title": "“Unsure”", "Author": "SilentTr", "ReviewID": "UR121364008", "Content": "I usually stay in this area when in London, but couldn't get a booking at my favoured hotel. I had an en suite room at the Jenkins which was clean and tidy. However, I was a bit surprised to have to go and buy toiletries as the hotel only provided one very small cake of soap. Breakfast was OK but if you're a trencherman, expect to have to fill up later. TV in room was old-style box with no freeview. As I paid almost double than at another hotel the following night, (which was more welcoming) I feel that perhaps a re-evaluation wouldn't come amiss", "Date": "December 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Canada", "Title": "“Great location - but tired”", "Author": "blueskydreamer", "ReviewID": "UR120297985", "Content": "We wanted a location near Kings Cross and Euston and this was perfect. The area is safe and very convenient. This is the hard part - I really want to, but I'm afraid I wouldn't recommend this hotel. It was old, tired and therefore appeared dirty. Our bedspread had stains on the underneath and made us question if it had been washed. The shower was really awful - it was built in to the corner of the room and was not nice to use. The towels were thin and the only toiletries were a bar of Pears soap. The owners and staff were lovely, and breakfast was standard. There is a Premier Inn across the road from Euston station. I just did a quick search online and was surprised to find that if you`re lucky you can get some really good rates. That`s where I would stay next time. Jenkin`s was cheap by London standards, but I`d pay a bit more next time for a better quality. Sorry Jenkin`s - it seemed like such a cute hotel with great potential, but I`m sorry I couldn`t fall in love with you.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Fargo, North Dakota", "Title": "“Too Cold”", "Author": "Tom C", "ReviewID": "UR120237317", "Content": "The hotel was very cold. The central heating did not work in late October. It was promised when we arrived that the central heating would come on, but the central heating did not come on during the time we were there. A number of rooms are situated below ground level and only have single-glazing. The period of architecture lacks the layer of insulation brick typical of European accomodation. For these reasons the rooms are colder in October than you might first imagine. The hotel, despite are requests for the room to be warmer, are making some very conservative decisions about heating (and profit). We became very ill as a result of staying in this cold hotel. Indeed my wife has been in hospital with an acute infection of her sinuses that has spread to her blood. On bringing this relevant concern about my wife's health to the attention of the owner, Sam Bellingham, he has inappropriately questioned my integrity, and inappropriately expressed amusement. Further Mr Bellingham wished damnation upon me. In sum, the accommodation and the manner in which you can expected to be treated mean that the Hotel Jenkins cannot be recommended. There are a number of guesthouses and hotels situated in the neighbouring Georgian Crescent. Best regards, Tom Campbell.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chester, United Kingdom", "Title": "“Excellent hotel, Excellent location............pretty much Excellent.”", "Author": "GrahamandSiobhan", "ReviewID": "UR120108571", "Content": "My Girlfriend Siobhan had wanted to go to london for sometime to look at art galleries and since I had never been and wanted to look at tourist things, we decided to go and after looking online for a hotel (and after booking and then cancelling a pretty grotty looking one), We came across the Jenkins hotel which had pretty good reviews and wasn't too expensive. We booked a double room with breakfast included for Â£198 for 2 nights. The first thing I liked about this hotel was how close it was from London Euston station, literally 2 mins walk and we were there. The hotel itself is situated in a lovely quiet area away from the busy main road which is a definate plus. The lady who welcomed us in was very nice and explained everything we needed to know. We stayed in room 8 and it was very tidy and clean with a comfortable bed, fridge, safe and basic tv. The shower room and toilet was a bit small (struggle to fit in if taller than 6 ft) but it makes all the difference having one to yourself instead of sharing. After seeing the room we decided to go and have a walk around and try to find somewhere to eat. The one thing that was noticable was that the area did seem to get busier, louder and if honest a bit more grotty the closer to st Pancras station (pretty sure seen drug dealer and prostitute!!!) you get. Finally after seeing the hotel that we had previously booked and cancelled (no names), we were even more pleased that we had booked the Jenkins. In terms of eating, there is a small but excellent indian about 30 seconds from the hotel called the Woburn Tandoori which cost less than Â£30 for a starter, main and drinks for 2 which for students on a budget was a real godsend. The breakfast the next morning was excellent with a full english on offer and tea/coffee. Overall for a young couple on a budget, The Jenkins hotel was a excellent choice and we would stay there again.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "tyne and wear united kingdom", "Title": "“excellent location for a London hotel”", "Author": "vallico2008", "ReviewID": "UR118564904", "Content": "There is a quirkiness about the old building and the staff which I loved. They are welcoming and friendly. When I arrived they were busy cleaning and I mean cleaning, I saw someone on their hands and knees scrubbing a bathroom floor. The hotel was spotless. Single room for one night, just fine, small but comfortable and the only downside is that there was an unpleasant smell from the drainage hole in the shower, which bothered me and it would be worth investigating the drains. A comfy bed, best night's sleep for ages actually! The room overlooked the little park, there is very little traffic so it's so quiet. The room had tea making equipment, a fridge and a safe. An old telly with a few channels but that doesn't bother me at all. The wi-fi worked non stop and is useful when you are a business traveller. Small dining room, cosy, whatever you ask for is instantly cooked and brought to you. It is in an excellent area for eating out, great mix of different types of food, good pubs and pub food too, and for walking to the tube and the British Museum and Euston and Kings Cross.", "Date": "September 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Portland, Oregon", "Title": "“Good Old Jenkin's Hotel”", "Author": "Paula H", "ReviewID": "UR117722545", "Content": "Over the last twelve years I've stayed at the Jenkins five times. Each time I have found Felicity and Sam to be very welcoming, friendly and helpful. The rooms are all comfortable and well cleaned. If I return to London again, I will stay at the Jenkins again; it's near The British Library, The British Museum and St. Pancras Station. The rest of the neighborhood now feels like home, to me. But it has to be said that the WiFi leaves a great deal to be desired; if that's important to you, you won't be happy. The TVs need to be upgraded and not many stations are accessible. At least on the lower floor, reception is not very good.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Invermere, Canada", "Title": "“lovely hosts and a great location”", "Author": "Whatever342", "ReviewID": "UR117043626", "Content": "There were 3 of us (1 adult, 2 teens) in our little room, and although it was tight it didn't really matter because we weren't in London to stay inside a room. They aren't the big North American chain hotel rooms we're used to, but who wants the same thing every time. Our room had three single beds (a tad on the firm side), a small tv and a tiny shower/ toilet stall. The room and building were clean and well cared for. You must be able to climb stairs carrying your luggage as there is no elevator. Full English breakfast was served in the small dining room at the bottom of the house, and although we didn't have to wait for a table, a couple of others did. The hosts appeared to work very hard to keep things moving quickly in the morning though, so they didn't wait long. There are only about 3 rooms per floor, so noise didn't seem to be a problem even though the hotel was full. The location was great; on a quiet circus, very close to the King's Cross station. Over all, a very nice place to stay.", "Date": "August 21, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“No room at the Jenkins, though promised one!”", "Author": "aberl00n", "ReviewID": "UR116448319", "Content": "Didnt actually stay there as although they took three days to respond to email enquiring about accommodation when I phoned to reserve and pay for the one they said was reserved the lady I spoke to said they had none - this wasn't that long after receiving the email. The lady was offhand and the three plus day delay in responding to enquiries did not seem to bode well. Might get the opportunity one day of seeing if it really is as good as they claim....", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Tampa, Florida", "Title": "“Great location!”", "Author": "jlc0227", "ReviewID": "UR113841253", "Content": "I stayed here with a friend during a trip to London, and we both loved the location. It's a quiet street, but you're right off Euston Road and only a 5 minute walk from either King's Cross or Euston Station. It's also within walking distance from some great restaurants and the Brunswick shopping center, which has a Boots Pharmacy and Superdrug (incredibly convenient when you realize you've forgotten to pack anything). We were also able to easily walk to the British Museum, British Library, and Charles Dickens House from the hotel as well. Breakfast was very good and the staff is quick and efficient, but nice. We were pleasantly surprised by the spaciousness of the room, but be forewarned that the bathroom is tiny, even by London standards! The Jenkins also does not have an elevator, so be prepared to climb a lot of stairs. Like many smaller hotels, the rooms are close together so if you have a noisy neighbor, it could make it difficult to sleep. However, those are only small complaints. The cleanliness, value, and location more than make up for them. I'd definitely recommend Jenkins to anyone planning a trip to London.", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Boulder Creek, California", "Title": "“nice enough...”", "Author": "cheryl_CA", "ReviewID": "UR113510779", "Content": "I stayed here for 5 days in May. Room was smallish, bathroom (en suite) was tiny, but manageable. Staff was...efficient. Breakfast was a fine way to start the day (but also very...efficient); I didn't linger over coffee or plan my day in the small dining room. Neighborhood is quiet, pretty, safe. And so convenient to 2 underground stations AND the St Pancras rail station! Very close to the British Library (less than a 5 minute walk), maybe 15-20 walk to the British Museum. A pleasant pub (Mabel's Pub), other take-out places all just a few minutes away. This was a good value for a London base. I would definitely consider staying here again, but I would also investigate some of the (many) other hotels in the neighborhood as well.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Arlington", "Title": "“Great location, bad shower. Overall good value.”", "Author": "dud1117", "ReviewID": "UR90664462", "Content": "Location is great. 3 minute walk to Russell Square tube stop one way and 5 minute walk to St Pancrass/Kings Cross the other way. Which was a huge benefit since I was there sightseeing for 10 days. Quiet neighborhood mostly students. Easy walk to British Museum also. Breakfast is between 8-9 am so if you sleep late you miss it. I found out I am not a big fan of English breakfast. At least the sausage and beans they served. Bacon was ok but different that U.S. style. Although the scrambled eggs and toast were fine. Room was small with tiny tv (4 stations) and even tinier shower. The bed however was excellent. I was on the top floor in room 11 which is bit of a hike with bags (no lift). Staff is friendly enough. Overall good value for the location.", "Date": "December 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Quiet yet handy to Underground, would stay again”", "Author": "LaCorsaire", "ReviewID": "UR86676253", "Content": "Marvelously historic small hotel/bed and breakfast a short walk from the British Library and the train station to Paris and King's Cross Station (used for Harry Potter's Platform 9-3/4) which connects directly to Heathrow via the Picadilly line. No WiFi, but it's free at St. Pancras, which is great for people-watching as the train arrives from Paris. Ask for a room on the British 1st or 2nd floor rather than the 3rd if you have any problem with narrow twisting stairs, although the rooms are fine. I had Room 11 which overlooked the small park across the street and I could hear Big Ben at night it was that quiet. Sandwich shop out on Euston Street (where you turn right to get to King's Cross or left to get to Euston Station where you pick up train tickets to the rest of England). Felt very Jane Austen-ish. Lots of students in the area, and it felt safe and rather cozy. Cab found it, no problem. Shower was adequate, but do not put down the bath mat as the floor fills with water during a shower although it did drain away quickly after. I think it was a boat bathroom as it's very small but functional. Taps are a bit tricky on the top (third) floor, but if you wait lots of water will come out anon. Good water pressure. Not fancy, but very convenient and friendly and quiet. Good value for London. Hearty breakfast cooked to order, too, with fruit available later as well. TV got four channels, good reading lights, wonderful duvet. No sitting room for all the guests in the evening, but the breakfast room was very pleasant.", "Date": "November 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“Great Location, simple & basic”", "Author": "LuckyCountry15", "ReviewID": "UR77209917", "Content": "The Jenkins Hotel is a little B&B in Russell Square on the Piccadilly Line. It is basic, clean & comfortable and the staff were very friendly and so helpful with everything from recommending plasces to eat to printing out our boarding passes. Free wifi was available but could be unreliable at times especially in the later part of the day. The room we had was very simple with a tiny \"bathroom\"...this may be typical of B&B's so I won't criticize.The location was fantastic being a short walk to Russell Square Underground in one direction & Kings Cross & Euston Road the other. There are plenty of good pubs, supermarkets & restaurants nearby. The hotel is in a quiet neighbourhood, but you can hear people walking around from the floor above you. London is very expensive and so this hotel is good value. Look at their website for more details.", "Date": "August 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oregon City, Oregon", "Title": "“Excellent location, great breakfast!”", "Author": "JEL77", "ReviewID": "UR74652374", "Content": "What a pleasant surprise to turn the corner and discover this beautiful, quiet place, with flowers everywhere, just a short walk from The Tube. Gone is the fast pace and noise of the city, here at peaceful Cartwright Gardens. The building is old with charm, and the breakfast is great. The small double we stayed in had a tiny bathroom, cramped like a motor home, but the bed was comfortable, and the place was clean. The twin room on the first floor was also clean and comfortable, but the bathroom was very small, with inadequate shower guard. Even so, we would return, and recommend The Jenkins to friends.", "Date": "August 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Long Beach, California", "Title": "“I'd stay there again”", "Author": "SoloTraveler45", "ReviewID": "UR64762757", "Content": "Unless you want to pay a ton of money, London hotels are always hit-or-miss. I was definitely happy with this one. The room was fine; the bathroom incredibly small. But the location is fantastic -- right in the middle of Bloomsbury near 3 major Tube stations that serve different lines. The surrounding neighborhood is quiet. The breakfasts were great, and the staff was very helpful. I don't begrudge them the bathroom; I've found that most London hotel bathrooms are disappointing. I'd definitely stay there again.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Average hotel in good location”", "Author": "AnotherHiker", "ReviewID": "UR63936990", "Content": "We wanted a hotel next to the St Pancras train station, and this one is on a quiet, curved road across the street from a park. We liked the location and the beautiful flower baskets on all of the doorways of the street. We were in room 5, and thought it was large for a relatively inexpensive London hotel room. We had a tiny balcony, and I always like a room with tall windows that open to a view. The bed was king-sized. The room decor was a little worn but that does not matter to us. The bathroom was odd, as mentioned before, but it did work. There was a sign that said to flush the toilet if the sink did not drain - but the room was reasonably clean. Breakfast was traditional full English and the staff were friendly. The dining room was smaller and in the basement, but we did not plan to linger there anyway. I was a little worried after reading some of the other reviews, but this was the only hotel on the street with a vacancy and we had no complaints about it. It would not be our first choice hotel but it was better than many others.", "Date": "May 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Maryland, USA", "Title": "“May Be Less Than You Expect”", "Author": "Maryland_USATraveler", "ReviewID": "UR48100445", "Content": "Almost 40 years ago as a college student we stayed nearly a month at a nearby hotel on Cartwright Gardens, a fine London location, and stayed at a few other adjacent properties since that time. This time we stayed at the Jenkins Hotel because of its recommendations, including Frommers. I have to say while the staff was pleasant, the breakfast fine, and the facilities well-maintained, it was less than I expected (or may less than I need now that I am no longer a college student). Our first assigned room was at the top of the hotel, a long, many story hike up narrow stairs to a bare-bones garret with miniscule bath. We were switched to a main floor room which was much larger but again quite bare-bones. The two biggest drawbacks: a modular bathroom as small or smaller than on a typical cruise ship, along with an annoying odor, and a teeny-weeny breakfast room. As stated, most things were fine, and the location is pleasant, but if you are looking for something more than a college experience, I would suggest you consider alternatives.", "Date": "October 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“Great value and Charm!”", "Author": "Tracy10tf", "ReviewID": "UR46692023", "Content": "This hotel was the best value for the money that we could find. It is in a fantastic location near Russell Sq and within walking distance of many sights and also within 2 blocks of a tube station. Yes, the rooms are smaller than most US hotels but this hotel was built in the 20's or 30's, so of course they will be smaller than what you may be used to. We only slept in it and went out morning to night so the size was not an issue. If you want a typical American shower, ask for it. Tthe breakfasts' were great - hot meals of eggs, bacon, beans, toast and/or cereal and fruit. The best part was the friendly service of the great girls who took care of us. It was wonderful to come back from a whole day out wandering the streets of London to have a chat about what we did that day. I wholeheartedly recommend this hotel for its location, price and personal service.", "Date": "October 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Seattle", "Title": "“Great Base for Exploring London”", "Author": "kmwagner", "ReviewID": "UR46301759", "Content": "We chose the location for its proximity to the British Museum (it was still quite a hike) and the British Library. We were pleased to find it was also close to the Eustace station of the Underground. It was easy to combine underground/bus/walking to get to the places we wanted to see. We found an excellent Indian restaurant (Depa Tandoori) right down a nearby street and an internet facility next door to the restaurant. This made it quick and easy for us to print out our boarding passes on our last day in town. We deliberately chose this room (number 10) from other reviews on this site, so we knew that it would be a hike up to our room. The room was large and comfortable with closet space and shelves for storage. The windows and floor were a little bit crooked, which we considered a tribute to the age of the building. I loved the shower! It was basically a rectangular-shaped tiled room with a shower head at the far end. The toilet was in its own little closet and a large sink was in the bedroom. This configuration was very convenient for two people to negotiate around each other while getting ready in the morning. Breakfast was very good and the service was quick and efficient. My husband and I loved London and we would definitely stay at the Jenkins again if we were lucky enough to go back for a visit.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Evansville IN", "Title": "“Terrific hotel for stay in London!”", "Author": "Fearantaighe", "ReviewID": "UR45922984", "Content": "My wife and I spent three nights at the Jenkins. We go to London virtually every year and this is far and away our favorite hotel. We will book there every time we go if we can. The rooms are nice and the breakfast is very good. The staff were extraordinarily helpful to us.", "Date": "October 5, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Palm Harbor, Florida", "Title": "“Great location / Value”", "Author": "teamwaffle", "ReviewID": "UR30247503", "Content": "This hotel was located in a wonderful location. It is near a major tube station with direct access to all lines. Check out Mabel's Pub around the corner while there. We spent way too much time at that place. The rooms are nice (especially for the price) with all of the expected appointments. We were upgraded to a larger room when we arrived, so some of the others might be quite tiny (as other reviews stated). For the price and location though, you can't beat it. If you are visiting London and need a place to throw your bags, get a good night's sleep, and be able to get anywhere quickly, this place is great. It's not luxurious or large, but who cares? If you are like us, you'll be out late enjoying everything London has to offer!", "Date": "May 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Milwaukee, WI", "Title": "“Quite Charming and Clean”", "Author": "Clotheslover", "ReviewID": "UR29408754", "Content": "I stayed at the Jenkins in April and liked it just fine. The bathroom is not big, but I've seen smaller bathrooms in apartments in the U.S. The place was clean, safe, charming, and a nice breakfast was included as well. The location was fabulous. I definately would stay there again. The big windows were very nice.", "Date": "May 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "San Diego", "Title": "“Small, convenient, budget”", "Author": "LJHSViking", "ReviewID": "UR28803742", "Content": "The Jenkins Hotel in London's Bloomsbury district, close to the Russell Square underground station and the British Museum, is exactly as described on its website and by travelers who have posted reviews on Trip Advisor. The price was the only thing charming about the place. The little pre-fab bathrooms installed in the corner of the rooms were just dreadful, and often odorous. Each guest received one bath towel--no hand towel or washcloth. Staff were helpful when called upon, but otherwise there was no sense of anyone's presence as there is no lobby. The breakfast was somewhat unappetizing, so after the first day we stuck to juice, coffee and toast. The big plus here was that we were on the go constantly and the location is very convenient. There are a wide variety of pubs and food shops to choose from and the pubs were lively and convivial. The hotel is also close to St Pancras Station, where the Eurostar will take you to Paris or Brussels.", "Date": "April 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Delaware", "Title": "“Hot water, please!”", "Author": "sd_ud", "ReviewID": "UR28109186", "Content": "Friendly staff and typical basic but adequate breakfast. We stayed in a room on the ground floor that was rather tight to enter (door opens to about 60 degrees before hitting a wall) but adequate once inside. A plug-in heater was provided, and necessary, to keep the room warm. The major complaint was the lack of hot water. We heard someone else complain about it our first morning, then we had no hot water the two mornings after that. So it seems consistent and affects more than one room. This really delayed us one of the mornings. So you may want to shower at night. Note that there is no internet access.", "Date": "April 15, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "British Columbia", "Title": "“Liked it Just Fine”", "Author": "JackBC", "ReviewID": "UR23237327", "Content": "My wife and I stayed for a full two weeks in October and we were very pleased with the hotel. The room was comfortable and kept clean and the location was terrific. We had read the reviews and frankly our bathroom was just fine. We asked for a ground floor room because my wife has mobility problems and the lack of a lift would have presented some problems. We enjoyed our breakfast every single day of our stay and only wish the dogs had visited a little more often. The owners and staff were courteous and helpful and the price (for London) was great.", "Date": "January 3, 2009"}, {"Ratings": {"Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Vancouver, BC", "Title": "“Decent for the Price Point”", "Author": "OffTheBeatenPath", "ReviewID": "UR22218355", "Content": "The Jenkins is probably the best hotel in its price range that I've experienced during my stays in London. $200 a night (Â£89) does not go very far in London. As outrageous as that may seem, it's a fact of life if you want to visit London. The location is good; we chose it for its price and proximity to the British Library, where one of us was working. It's a short walk to either Russell Square or St. Pancras / King's Cross stations, so we had easy access to many different Tube lines. Our room (#5) was decently decorated; the curtains and bedding seemed relatively new. The room was clean and spacious, had a working hair dryer, tea kettle, TV, and refrigerator. The street is reasonably quiet at night, and the curtains did a good job of blocking light. As mentioned in previous reviews, our bathroom was built into the room, not a separate room. However, it was not a plastic cubicle (I had one of those for a year in an apartment in Munich, so I know my plastic bathroom cubicles). It also was not a shower stall in the middle of the room -- which I've seen in hotels of this class in London. I do have to say it's the only time I've seen linoleum used as the tiling in the shower, but the shower was fairly spacious. My only real complaint was the noise -- whenever the toilet was flushed or the shower was in use, the pipes made a ton of noise, so there was no sleeping in while the other person took a shower. Photos of the bathroom are attached. It may be different in other rooms in the hotel; I can only vouch for our room. Breakfast was decent -- eggs, bacon, sausage, cereal, yogurt, fruit, coffee or tea all included in the price of the room. It's a very small breakfast room, and the two large dogs do circulate through the room and beg. This did not seem to bother most guests, who appeared to be dog lovers, but if you are not a dog lover you may have a problem with this (I'm neutral on dogs but felt that given the size of the room, and its use in food service, the dogs should have been kept out). All in all, for the money I felt the Jenkins was a good value.", "Date": "November 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bisbee, Arizona", "Title": "“Ridiculous Retrofit Bathroom.”", "Author": "jyphoto", "ReviewID": "UR17321852", "Content": "It could have been worse but the ridiculous excuse for a bathroom was a sort of tiny plastic cabinet in the corner of the room. Also the floors were the squeakiest I'd ever experienced in a land of generally squeaky floors. I would definitely not go back.", "Date": "June 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nova Scotia", "Title": "“Enjoyed the Jenkins.”", "Author": "jokli", "ReviewID": "UR15269990", "Content": "I stayed at the Jenkins Hotel in Jaunary 2006. I chose it because it was halfway between the British Library and the British Museum, it was an old Georgian building, and in the photograph of it there were three dogs on the doorstep. I had a very enjoyable stay. Because the hotel was not full, they automatically upgraded me to a very spacious room with a king-size bed. I was on the top floor with a beautiful window looking out over the Crescent and a lovely tree. It was very quiet and restful. The fridge in the room was a great plus for keeping milk for tea, sandwiches, fruit and juices. I had the owner's dogs in the dining room with me most mornings to split my toast with. I know if any guest had objected the owner wouldn't have allowed them in, but the dogs were charming and well-mannered and were a wonderful addition to my morning. Within a two-minute walk of the front door, there is a little inner city business neighbourhood with a laundromat, grocery store, bakery, photo shop, etc. I walked London every day for ten days, and the hotel was convenient for all my sightseeing I would recommend the hotel to anyone wanting an inexpensive London stay, and would stay there again myself.", "Date": "April 23, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Reno", "Title": "“Don't Leave Your Belongings”", "Author": "KC2000", "ReviewID": "UR11461370", "Content": "Our stay was mostly pleasant, although we went with our family (6 persons; 2 Seniors, 2 Children, my husband and I) and had 2 rooms on the 1st floor and one on the 12th. We left behind a set of Bose Noise Cancelling Headphones in the safe in our room (when our door accidently closed and locked us out on the morning of departure at 6 am) . Despite repeated attempts to contact the management to make arrangements to get the headphones sent to us (at our cost), we received no response. We left a note by the computer on the morning we left (6 am- no one on duty) and tried many, many times by email. We can only assume that someone at the Jenkins is enjoying good sound. Our stay ended up costing way more than the daily rate we paid!!!! The headphones cost $300 USD. Please check your room carefully upon departure.", "Date": "December 10, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "West Lancashire, UK", "Title": "“Not the Ritz but fine”", "Author": "Edburga", "ReviewID": "UR10850137", "Content": "A friend made the booking and then I read the reviews! Some trepidation followed. For:- It is cheap, it's clean, it's very quiet, it feels very safe, the breakfast is plentiful if not exciting, the rooms have all the amenities one would want- including tea & coffee, the beds are comfortable, it's in a brilliant location for tubes and other London transport, the staff, who seem to be members of the same family, are typical of us Brits i.e. polite but fairly distant and business like; they don't know you so they're not immediately going to be your best friend! Against:- It's definitely no frills, there aren't any public rooms like a residents' lounge for example, the amenities in the rooms are a bit 'amateurish' e.g. old style t.v. no satellite or anything like that, hairdrier hanging by it's wire from a hook on the wall, no staff to look after you; it's a simple family run concern. The main thing to comment on is the 'bathroom' that I notice has been a theme running through many reviews. BE UNDER NO ILLUSION you do not get a 'bathroom'. The facilities comprise a pre-formed plastic cubicle about 1.5 mtr square which sits in the corner of your bedroom and has in it a lavatory, small wash basin and miniscule shower tray. The shower hose actually comes from the sink taps. Incidentally, you have to use the shower to fill the kettle as it won't fit under the taps! So you certainly have the faciilities for washing but they are basic and 'cosy' to say the least. As has been said before, you get what you pay for. Â£89 in London is a snip. You expect to have clean, warm facilites and at the Jenkins that's what you get. For one or two nights, it's fine. However if you want one-to-one service and a power shower I suggest you look elsewhere and dig deeper into your pockets.", "Date": "November 16, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "wisconsin", "Title": "“Nice staff can't make up for those bathrooms”", "Author": "melinda03", "ReviewID": "UR10038695", "Content": "My boyfriend and I (early thirties) stayed at the Jenkins in July. We enjoyed the location a lot. The staff were calm, helpful and pleasant, but I wouldn't go so far as to say \"warm\" or \"friendly.\" The rooms were clean, bright and plenty big enough for two. The breakfast was average. The tiny bathroom was enough of a nuisance to make me think I would never choose this hotel again. I know everyone here must sound like American divas when we complain about the bathrooms, but please believe me, I am NOT a diva and I really disliked them. Yes, this hotel is a good bargain, but there are other hotels on this very street where you can most likely get another 10 square feet of shower space for maybe $10 more, and it's going to make your trip so much better! I would strongly recommend that the Jenkins hotel lower their prices to make up for those bathrooms. Until then, I would recommend all visitors to choose a different hotel.", "Date": "October 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "California", "Title": "“Nice little hotel”", "Author": "gwhizrd", "ReviewID": "UR8272743", "Content": "This is hotel is clean, convenient and (for London) inexpensive. True, the bathrooms are small (I think they're the same size as on a cruise ship), but so what. I use a hotel to look at the inside of my eyelids. The owner is helpful and the breakfast was fine. We would stay here again.", "Date": "August 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ashburn, Virginia", "Title": "“Brilliant for the Money - and Then Some”", "Author": "LovetheUK", "ReviewID": "UR7407686", "Content": "I have read all the reviews on the Jenkins over the last 8 months as I planned my trip to London, and I have to say I have to mildly disagree with most of the complaints listed below. Both my husband and I had a lovely time. And got a great night's sleep, every night. I have rarely received such a warm reception at a private hotel anywhere. Sam and Felicity both were gracious, warm, and genuinely helpful. They were extremely knowledgeable and answered all of our questions and offered great local information. The property is from the 19th century and as such all of the rooms are configured differently. I was able to get a good look around and there are a great number of variations. In response to most North American's desires for private bathrooms the owners have nicely converted a small corner of each room into a private bath. I found it spotlessly clean and completely serviceable. Yes, it is small, but certainly provided everything I needed. To note - the suite on the third floor had a very large built in bathroom. If you require that much time/space in there - just book that room. Or just ask for the specifics you want and I'm sure you'll get what you need. We had room 12 on the third floor, facing Cartwright Gardens. It was quiet and perfectly suitable. And very clean. We really appreciated the refrigerator stocked with drinks, the tea kettle with tea service on top, and a safe in the closet for our valuables. Two things you won't get in any UK hotel at this price - or even for a lot more. (Book room 12!) Breakfast was great , ample, and served by the owners: eggs, sausages, bacon, beans, toast, tea or coffee and orange juice. As well there is fresh fruit, yogurt and cereal as well. Climbing the stairs to the room after such a huge meal was hard! If you care to eat outside the hotel I'm sure you'll get all of the above and a chunk of blood pudding and pay 6-8 Pounds each. Felicity has two adorable labrador retrievers (Georgie and Tiggy) who visit every so often. They both wag their tails all the way through breakfast while begging for handouts. You won't find that anywhere else. The location of the hotel can't be beat - it sits between no less than three tube stations: Euston, Kings Cross/St Pancras and Russell Square. Depending on your Underground destination you have access to six different lines within an 8 minute walk. The British Museum is a 20 minute stroll away. And airport transfers are a breeze - Sam can arrange a private taxi to Heathrow for 26 Pounds. For evening entertainment and good grub: O'Neills was a great Irish pub around the corner, and the Lamb is another British classic about 15 mins away. Carluccio's in Brunswick Square has great, outdoor, Italian dining. We will certainly stay here again when we return to London. And have already told all our friends we felt so at home we didn't want to leave. Bravo Sam and Felicity!", "Date": "April 21, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Washington State", "Title": "“Will not stay again!”", "Author": "Boots2go", "ReviewID": "UR7395698", "Content": "Originally planned to stay at the Jenkins for 4 nights left on the third. The good: It is about 10 minute walk from the tube station and that will connect you to all the sites of London. The Hotel was pretty cheap. Room 10 has a â€œrealâ€� shower and bathroom(private). Was quite. The Bad: The Boiler broke on the second morning there we had no hot water and no heat. Third morning (said the boiler was fixed ) still no hot water or heat in our room. Breakfast was the same food every morning ( not very good ). The dogs (and I have two) begged so much that it was irritating (the dinning room very small). Room had no extra towels and no amenities such as, soap, shampoo, or anything extra. Overall the Jenkins Hotel was very shabby and only a few steps up from a youth hostel. I thought that it was overpriced, even at 85 pounds a night. If you need help or have questions there was noone around to help you. The only time I saw anyone was when we checked in/out and at breakfast. When asked a simple questions none of the hotel staff could help. Would I stay again .....no, I think that I can find better accommodations next time.", "Date": "April 19, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "England", "Title": "“You get what you pay for....”", "Author": "LoubelleG", "ReviewID": "UR7153191", "Content": "I find it hard to criticise the Jenkins hotel when I paid Â£85 for a double room, with breakfast as i think this is cheap for London. We just wanted somewhere to sleep with a lock on the door convenient to a tube station and Euston and that is what we got. For that reason I find it hard to complain about the ancient wardrobe and drawer/desk units that are in deperate need of replacing (Ikea for example are so cheap these days), the complete lack of atmosphere and the tardis like bathroom. I think potential visitors should know that it is not ensuite but as has been previously said, a plastic box put in the corner of your room similar to an aircraft. The shower was awful. A tiny piece of plastic to stand on with a shower curtain wrapped around you that stuck to your body when it got wet. How anyone over 5'5 copes I dont know. I would rather share a proper bathroom with another room than use this again. The full english breakfast was nt up to much. One other couple asked for bacon and eggs for breakfast and so were served one piece of bacon and one egg (ie the full english without the baby tomato sausage and beans). The kettle doesnt reach the table so you have to put it on the floor, the tv didnt work properly and you have to get on your hands and knees to use the safe (it is on the floor under the desk chair) The staff were very nice and friendly and the hotel was clean. As ive said, I wanted a room with a lock and a tube station. Next time though I will be prepared to pay double and stay somewhere else.", "Date": "March 13, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“Quiet, like home”", "Author": "SingingRaccoon", "ReviewID": "UR6820989", "Content": "My wife and I stayed here for three nights in Apr 2006 on our first visit to London. We like B&Bs, and the Jenkins is as nice -- for the money --as any here in the States. We stayed in the ground floor front room. The bath is small, tacked on to the front parlor and raised six or so inches to accommodate rework plumbing. Brace yourself getting in the tub. Otherwise, room was very comfortable for what we wanted it for...sleeping, although I will never get used to the thin English mattress. Wonderful breakfast and staff. Close to Russell Square, Euston, Kings Cross (we picked the Jenkins for a easy train connection to Cambridge), and bus stops. Like home...you get a key to the front door. Could not find a decent pub nearby. Lord John Russell was passable, but does not have a selection of brews for more than one visit, unless you are a \"one-and-done\" drinker. Several places to eat nearby in all price ranges. We used a bodega down the block for wine, beer and snacks. Would we go back...sure. My wife still smiles when we reminisce about our visit to the Jenkins. You cannot buy that kind of memory.", "Date": "February 21, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Virginia", "Title": "“Watch out for the bathrooms”", "Author": "OldGal&Todd", "ReviewID": "UR5800769", "Content": "While the location was outstanding, we too had trouble with the \"train-size in room bathrooms.\" We were on the top floor, quite a climb with luggage (4th or 5th floor), and the room was fine, but the shock was the \"ensuite\" bathroom made up of some kind of metal or plastic. When you attempted to turn the shower on via the taps, the water \"surged\" and I got completely scalded on one side of my body, which did not make for a pleasant experience. I actually screamed for my husband to rescue me but he was sound asleep! I think when booking the owners should make clear to the prospective client what kind of bathroom is available and that some of the bathrooms are definitely not normal bathrooms. Excellent breakfast although other clients appeared to treat the breakfast room like their house. One man appeared at the table barefoot, not particularly appetizing, and no hotel staff member said anything because he was the same way the next morning.", "Date": "September 14, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Moorestown, NJ", "Title": "“Great”", "Author": "Moorestowners", "ReviewID": "UR5329115", "Content": "Fabulous - we were totally delighted with the Jenkins. Despite the warning of the tiny shower/loo facilities in the room, it turned out to be fine. We had a choice of a smaller top floor room with a view of the crescent park/tennis courts or the larger room on the floor below, which we chose (never missed the view). The owners and staff were very kind and the breakfast was great. We stayed for three nights and would definitely go back. The location is just far enough from the action to be comfortable, yet close enough to walk to a lot of places.", "Date": "June 10, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "UK", "Title": "“showering in a Dr Who \"Tardis\" never again”", "Author": "dilligaf53", "ReviewID": "UR4732084", "Content": "Having been in the Hotel & Catering industry for a long time now, & not enjoying staying at large impersonal hotels, I tend to search out the small & homely venues. This hotel is ideally situated, quiet surroundings and clean. BUT I also have to admit that I do not like to shower in what was a Dr Who Tardis thing. The only way I can describe it, that it was a plastic all-in-one box, with a measily shower head attached to the basin (very small) taps. An enclosure only somewhat larger than the toilet on an aircraft! On entering this plastic \"box\", it wobbled horribly making me feel quite sea sick, and the toilet seat cover did not stay up, no matter how hard I tried, it kept falling down on me whilst sitting on the toilet. A man would have no chance! :O) The electric sockets (the only 2 in the room) were firmly hidden away behind an antiquated desk/dressing table which had to be moved first before you could even attempt to use a socket so as to boil water in the little kettle which was provided. Even then the lead didn't reach the socket. The room was quite bare and devoid of all \"atmosphere\", the pillows were hard and uncomfortable - so all in all, a bit of a mish mash disaster. Breakfast too left a bit to be desired. We were most disappointed, and I really did expect a whole lot more from this little family run hotel. We will not be staying there again.", "Date": "March 25, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Good basic B&B type hotel.”", "Author": "cl8855", "ReviewID": "UR4418502", "Content": "Stayed at the Jenkins way back in 2000, but found it a really good value. Easy location to just about anywhere. OK rooms, small bathrooms of course, but nice folks and decent breakfasts.", "Date": "February 6, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Los Angeles, CA", "Title": "“A Great Place to Stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR3738030", "Content": "My husband & I stayed in the hotel for nine days & really enjoyed the location, staff, & the room. Although there is no elevator in the hotel, the appropriately named Karrie helped us take our luggage up to the second floor. Our room over looked the tennis court park across the street, where we had a nice view of large trees, squirrels, & birds right in London. The location is excellent: only a short walk to Euston Station, the British Library, St. Pancras Church, & the British Museum. Plus a laundromat, restaurants, & stores are close by the hotel. The room had every thing we needed: refrigerator, hair dryer, TV, bathroom, electric kettle, & a selection of teas & coffee. Every morning we had a good breakfast that carried us through a morning of walking & sight seeing. The best part of the hotel, however, is the friendly & helpful staff.", "Date": "August 4, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Menlo Park, California", "Title": "“Jenkins Hotel OK but not great”", "Author": "CalKat", "ReviewID": "UR3695312", "Content": "We stayed at the Jenkins Hotel for 2 nights in early July. I chose it because I wanted to be near the British Museum and I wanted our daughters to experience a B&B. Our room (#8) was quite small with a tiny bathroom created out of part of the room; shower was attached to the sink, as described in other reviews. Our daughters' room (#10) was very large with a large normal bathroom, but it was on the very top floor with many flights of stairs to climb. The beds are not the normal twin size beds we are used to in the states. I don't know what they are, but two of them pushed together in our room equaled a double bed. Breakfast was good, but they did not serve any fruit. The proprietors were friendly and pleasant. On the second morning, two black labs, Tiggy and Georgy, visited everyone in the breakfast room hoping for treats. The hotel is a quick walk to either Kings Cross or Russell Square tube stations. There is no A/C but there were fans in the rooms, which kept us sufficiently cool at night during a warm season in London.", "Date": "July 23, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Detroit, MI", "Title": "“Great Place”", "Author": "portonovodeb", "ReviewID": "UR2783172", "Content": "I have stayed at B and B's all over the world. The Jenkins Hotel was clean; the breakfast was great; the people working there were friendly and helpful. The neighborhood is interesting and convenient to many other places.", "Date": "October 24, 2004"}], "HotelInfo": {"Name": "Jenkins Hotel", "HotelURL": "/ShowUserReviews-g186338-d209142-Reviews-Jenkins_Hotel-London_England.html", "Price": "$138 - $284*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">45 Cartwright Gardens, Bloomsbury</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">WC1H 9EH</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "209142", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/bc/5f/36/jenkins-hotel-thumbnail.jpg"}}