{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Davao City, Davao City, Philippines", "Title": "“Super Sweet Hotel”", "Author": "MattAussie", "ReviewID": "UR127961211", "Content": "I have stayed in many hotels in Singapore this is on of the top places I have stayed at I had a great time but most of all enjoyed my stay in Singapore for business. I have been to Singapore for many business trips so I know what most hotels are like. I booked on their website www.parcsovereignhotelsingapore.com for the best rate. This is a good idea rather then showing up without a booking as it can sometimes be overbooked", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Fabulous Stay - Amazing Location - We always felt welcome!!!!”", "Author": "parklane44", "ReviewID": "UR127854418", "Content": "We stayed in the Parc Sovereign April 2012. We booked two rooms an Executive and Triple. The check-in process was quick and easy and the rooms where ready on our arrival at 2.00pm. We where aware of the size of the rooms from the website and communicating with other guest via Tripadvisor before booking, but where surprised as they seemed bigger than our expectations and we thought really good value in terms of Singapore hotel pricing (especially when travelling with teenage children). The rooms where well designed and looked very stylish with the wall coverings, silk orchards and taffeta curtains. There was more than enough space for our suitcases, laptops and toiletries. The two rooms where on the same floor as we requested and we had lovely views of the surrounding city. It was a pleasure to stay in a room that looked exactly like its website picture! The rooms where immaculately clean and the tiled floors felt far more hygienic than carpet. The bathroom was more of a wet room, but the design allowed the water to drain quickly and this was never an issue (I actually quite liked the bathroom as it was really functional). A bonus was an iron and ironing board. The toiletries supplied where also good quality and practical. The pool was also great and again larger than it appeared in the hotel pictures. A steam room, sauna and children's play ground was also located near the pool, great inclusions for a hotel in this price range. Service from the desk staff at the hotel was outstanding, Bernard was only too happy to assist us with internet and printing. Also when we passed staff in the corridors they always greeted us with a smile. Finally the biggest bonus is the location, minutes walk to Bugis shopping, food outlets and the MRT (which was a major cost saver as we used it instead of taxis). Our next visit to Singapore will definitely have the Parc Sovereign as number one on our list.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Not worth your time or money!Small rooms rude staff and expensive even by Singapore standards food”", "Author": "Mishspry", "ReviewID": "UR127334092", "Content": "Booked two rooms 1 for 2 people 1 for three clearly stating ages of children, checked this and was reassured all good arrived at hotel to find 1 bed in each room despite the second child being 8 years old as stated at booking time staff refused to assist having to wait 2 hours foe the manager who basically said bad luck. Refused to supply extra bed or refund and after 20 minutes arguing begrudgingly offered to upgrade to a different room at extra $100 a night which he dropped to$70 . When we finally made our rooms so small no extra bed was possible , fridge didn't work and to get enough towels was almost impossible.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "manila", "Title": "“Great for MRT riding visitors”", "Author": "princesscat09", "ReviewID": "UR126373250", "Content": "This hotel is very accessible from 4 lines of the MRT namely the Green Line, Purple Line, Red Line and the Circle (Orange) Line. It is closest to the Little India Station of the Purple Line and for visitors who intend to spend a lot of time in Sentosa Island and Universal Studios Singapore, this is is very ideal. You only need to board from the Little India Station and alight at the HarbourFront Station of Vivo City Mall and from there you can take the $3 LRT to Sentosa Island or the $1 Sentosa Boardwalk, either which way you choose in going to the island will be an experience in itself. From the airport this hotel can be accessed from the Bugis Station of the Green Line. From the Bugis station, just find Albert St. which is easily recognizable due to its paved walk way. The whole street is close to traffic with lots of stalls. From the Little India Station, you will need to take EXIT A, then walk towards Selagie St. you will pass by an India Movie house and reach an intersection from there you will cross towards Albert Village Court Hotel, walk through the Albert Village Court Hotel Courtyard and you will see Parc Sovereign. Note that once you get out of the station you will see the neon sign of Sim Lim Square, walk towards this building until you reach the intersection where you will cross to Albert Village Court. The hotel rooms are very simple, small and basic. No fuss, no decor, sparce and oftentimes cold and hard. Rooms and hallways are not carpeted so try getting a room at the end of the hall or else you will hear people passing through the halls or opening their doors. The staff are very accommodating and knowledgeable with directions so its best to ask them before leaving the hotel. Room service is fast and iron, iron boards, extra pillows, towels are brought to you immediately. The worst problem we had with the rooms were the showers and toilets which were poorly constructed. When the showers were used, the whole bathroom would be flooded and would take time to dry. If you wore shoes going inside, your room would have wet footprint. Yes the rooms will be very small and crammed, but ive stayed in Singapore hotels which had room far worse than Parc's so I think the rooms being clean outweighs its size. It wasnt the best value for money deal but it wasnt too bad due to its location which saves one from the trouble of walking too much and the sense of security which Albert St. can offer.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Pecatu, Indonesia", "Title": "“Terrible Value”", "Author": "Joseph S", "ReviewID": "UR125967822", "Content": "Photos from their website are obviously meant to fool the potential customer into thinking they are getting quality. This hotel was clearly created by someone looking to maximize their own return on the investment, while giving as little as possible to their customers. The rooms are so small that it is impossible for two people to move around at the same time. One person must get on the bed while the other passes. The bathroom is impossibly small, constantly wet. Noise from ANY door on the same hall, or footsteps from anyone walking down the hall, can be clearly heard inside the room, making it impossible for a good night sleep. The \"fitness\" room is as small and barely equipped as is possible, while still allowing the hotel to claim they have a fitness room. Same the with the children's playground. Tiny and nothing to it. They claim to be four stars. I have stayed in hotels around the world and would give them two stars at best. We left feeling conned and annoyed. I would never go there again, and hope they are discovered for the frauds they are.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "North Coast NSW", "Title": "“Very small rooms”", "Author": "A-Hamilton", "ReviewID": "UR125608227", "Content": "The rooms here are so much smaller than the photos indicate ! We had to leave our cases in the hallway and climb over them to reach the bathroom. The chair is in front of the desk jammed between the bed and the wall which blocks the \"chiller\" and \" dressing table \". Hard beds !The bathroom is too small to accommodate a full shower screen so the whole room gets saturated when you use the shower - you have to leave clothes etc outside so they remain dry. We used the ironing board which only just fitted between the bed and window, 18 \"? Breakfast in the restaurant was different, all the used plates from earlier diners were piled up in the centre of the table which you had to share with 6 /8 other people. The room was too small to be worth considering and the hotel could not seriously be considered 4 stars or even 3 for that matter.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bandar Seri Begawan, Brunei Darussalam", "Title": "“Good Value By Singapore Standards”", "Author": "Alster2409", "ReviewID": "UR125396769", "Content": "Singapore is very expensive, we all know that. I usually avoid transit stops there for this reason. However when I saw this hotel on Agoda at under 100 Singapore Dollars, I gave it a try. The place is clean modern and well located. Bugis MRT is around 10 minutes walk away and Sim Lim Square is less than 5 minutes walk if you are up for buying electronics. It is also respectable unlike some of the cheaper hotels in Singapore. Air conditioning worked well and the bed was comfy. The rooms are very compact and the bathroom especially the shower stall is tiny. Room is sparsely but modernly furnished in a pleasing style. OK for one or two people for one or two nights stay where you are not going to spend a lot of time in the hotel. It does have a nice pool area and location itself is quiet and pleasant.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Good stay for sightseeing”", "Author": "SwiftPilot777", "ReviewID": "UR125273513", "Content": "The standard room is a bit small. the room has a small chiller, a small cabinet and a safe. The bathroom is quite small and tends to flood, they provided toiletries and towels. There are 2 extra pillows inside the cabinet. Its good that their plugs are universal, perfect for travelers. The noise from the hallway can be heard inside the room. They have a nice lobby and they boast a lovely swimming pool, they also have a small gym, sauna and steam room. I can say that for the price you get what you paid for. It's just fine for travelers who will have the whole day devoted to sightseeing only crashing in for the night. It's near little India and it's 1 km away from Mustafa (a 24 hour mall-supermarket) There's a small Chinese restaurant beside the lobby but we were unable to dine because we opted to eat elsewhere. The staff didn't smile much but they delivered good prompt service. The price of internet is a bit steep, but they do provide a complementary 15 min access each day.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Good Location,Sad Hotel”", "Author": "Mustafa1982", "ReviewID": "UR124850347", "Content": "Visit this tiny shoe-box styled hotel which employee's staff who do not believe in smiling only for their location.Located next to Sim-Lim mall(electronics haven),Mustafa market(Cheap Mall),Bugis Market(Chinese Shopping lane) and 10 mins walk from Dhobi Ghat station that connects you to every place in Singapore. You cannot stay in this room without bumping into your partner.Dirty room,you can see the dirt on their mirrors.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Perth", "Title": "“Location”", "Author": "durawah", "ReviewID": "UR124052578", "Content": "New hotel, excellent location but with dreadfully small rooms. I think the website indicated a refrigerator in each room, but it turned out to be a very inefficient chiller unit which did not work at all. Even though you were supplied with coffee and tea, the room being so small and having only one chair, you were compelled to sit on the bed to drink your coffee. The shower screen had no door and consequently water went all over the floor and toilet. The pool area was compact but adequate, with suitable outdoor chairs and tables. During a very hot day the lack of shade could be a problem, but the heat was not an issue during our stay there. Staff were very friendly and attentive, the rooms definately let the noise in and contrary to what the website said, the view of the city was non existent. I don't think it was necessary good value for money, especially with no breakfast or free wi-fi, but the pool and location made it just that bit more tolerable. I doubt if we would stay here again.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "California City, California", "Title": "“Great Hotel”", "Author": "Patricia M", "ReviewID": "UR124047313", "Content": "The Hotel Lobby is elegant. The Check-in and check-out process is fast. The reception staff, especially Siva and Lisa were always accomodating and warm. These guys rock. The rooms were clean but the walls were stained and the bathroom although small comes with good amenities. The chambermaid on our floor (can't remember his name); we stayed on the 10th floor was good. This Hotel is best described as a functional Hotel with no extravagance.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Jakarta", "Title": "“Worth revisit”", "Author": "Jhsan", "ReviewID": "UR123678380", "Content": "Clean,rather small but w/ good svc & location is just ± 8-10mnt walk to bugis str,junction&mrt,which is only one stop to esplanade,marina bay,raffles, suntec, so that time is not wasted on distance Just that n cable svc,but doesn't matter since going bcask to hotel just to crash", "Date": "January 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dallas", "Title": "“Clean, efficient, acceptable”", "Author": "tangojohnDallas", "ReviewID": "UR123645179", "Content": "I was attempting to book at the Albert Court Village but found it to be unavailable during the dates my family was visiting Singapore. The Parc Sovereign was an acceptable alternate choice in this convenient location near Little India and the excellent Bugis shopping and dining area. The rooms were as small as posted by others but were also clean and modern. The swimming pool and workout areas with sauna and steamroom were very nice for a three star hotel. The room had a small balcony overlooking a courtyard between the hotel and the neighboring apartment building....no view of the city. The staff were competent and friendly. My room had a very small refrigerator which did not work and for some reason could not be replaced although I asked. I thought the room had no closet until the third day when I realized it was hidden in wall panel with no surrounding frame....deliberately done to keep the room's clean modern look. Wish I had realized it earlier! Everything about the Parc Sovereign was good for the rate of approximately $85 US per night until I saw the room my brother got just across the street at the Albert Court Village Hotel for a rate of only $12 more per night during the same dates. Money well spent. My hotel was just fine but by comparison, came in a distant second.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Manila, Philippines", "Title": "“Basic and good location”", "Author": "JanieOctia", "ReviewID": "UR123590485", "Content": "The hotel is walking to distance to Sim Lim Square and Bugis Street and to some key spots in Singapore but since is fairly new, not all cab drivers are familiar with this hotel. Instead of asking them to bring you to Parc Sovereign, just ask them to take you to Albert Court Village Hotel, which is next door. The room is very basic and has very little space. For an overnight's sleep, it should be enough but if you have kids with you, I don't really recommend this hotel. Wifi is also not free which is a little frustrating. There's a 7-11 near the lobby that's open 24-7 so that's a plus. I got a deal from Agoda which is 50% discounted that's why I booked this but if you're paying their normal rates, I wouldn't highly recommend you stay here.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“average”", "Author": "Neill29", "ReviewID": "UR123563769", "Content": "Its a ok hotel but for the money i would have expected more. no breakfast included and to have WIfi was a small fortune and can only use a certain amount of hours a day. rooms are small but that was ok and the toilet smelled bad! it was not clean enough, the walls were dirty and after my wife had a cup of tea her lipstick was still on the cup the next day. We also had to ask for toilet paper . the location was very good, next to the Mrt and the tour bus drops off close by! also nice and close to Bugis night market, short walk to the top of orchard road.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Hong Kong", "Title": "“You (almost) get what you pay for”", "Author": "Melissa K", "ReviewID": "UR123535767", "Content": "This hotel was only okay. Nothing fancy, but it wasn't a budget hotel either. I was only staying one night, and I was thankful for that. The staff was friendly, though. The room was small, and relatively clean. The walls were thin - I could hear kids crying from rooms down the hall. NO free wi-fi. Um, hello!? In this day and age? And with the price as expensive as it is for a standard room? To me, that was unacceptable. The connection didn't really work in my room, and they didn't do anything to credit all of the time I spent trying to connect. You can't hook up more than one device to the wi-fi either, and need to use the time you've got all at once, or you lose the money. Not happy. The location was good. - close to Little India and lots to do within walking distance; easy to get to MRT station as well. Next time I go to Singapore, I will not be staying at the Parc Sovereign.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "singapore", "Title": "“Value for money hotel”", "Author": "chopeta", "ReviewID": "UR122971567", "Content": "We stayed at an executive room at a reasonable price Pros > good location, near sim lim (electronics haven) & shopping & eating area > nice pool but small gym > hotel is between little india mrt station & bugis but nearer to little india (arnd 250 meters) > nearby the hotel is an eating area, aston's express is a must try (sirloin steak priced at S$12 with 2 side dishes) > the room is clean & comfortable (though the bed is not as soft but we don't mind) > nice smelling hallway :) Cons > not sound proof, can hear the closing of doors from other rooms > not carpeted", "Date": "January 12, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Zamboanga, Philippines", "Title": "“New & clean hotel in great location!”", "Author": "TravelChicPh", "ReviewID": "UR122903874", "Content": "We booked online in this hotel for 3nights through Agoda for a holiday after our trip from Kuala Lumpur, Malaysia. Pros: It's a new hotel perfectly located in the heart of Bugis. Very accessible by taxi and just less than 10min walk between Little India and Bugis MRT stations. Particularly convenient for tourists as almost all of the basic needs are within walking distance such as restaurants, hawker centre & fruit stall, Sim Lim Square for gadget needs, Bugis Junction for affordable shopping/souvenirs, bazaars like OG Albert, BHG & more are nearby, there's also a Chinese drugstore, and a 7 eleven store is located just below the hotel. Our room in the 5/f was small & simple yet superbly clean & comfy, free of cigarette smoke & 2 spare pillows were available in the closet. Cons: 1. What we didn't like is that we were asked to pay SG$100 for deposit and for room cleaning since we requested for a Non-smoking room. 2. They don't offer free wifi, so if you really want to use the net, then just pay, its SG$6 for 2hrs. 3. The very small bathroom is flooded when using the shower! (No partition between shower & toilet). 4. Walls, I think, are made up of thin wood because you can hear banging of doors from the other room. 5. Hotel staff is not so welcoming. All in all, we had a nice stay since we only settle for the night. I would still recommend it to my friends especially to those who are first timers in Singapore due to the proximity of the location and I'm giving a 3 star rating out of 5, to be fair, since we really didn't encounter major problems except for the cons listed above. Besides, it’s a pretty good value compared to some budget hotels in Singapore if you opt for good location, cleanliness and comfort since everything else in Singapore are expensive.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Malaysia", "Title": "“Clean hotel,walking distance to MRT Station”", "Author": "icarolyap", "ReviewID": "UR122349116", "Content": "Just nice for SGD138nett (booking.com) . Clean and comfort hotel.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "brunei", "Title": "“New but tight!”", "Author": "mummytraveller64", "ReviewID": "UR122077192", "Content": "Stayed 3 nights in this hotel in October while on a business trip with hubby. Booked this hotel because of it's location (we had to be in the Bencoolen area) and price ($158p/nite after tax, room only, booked online). Pros: - new hotel, shiny, clean. New fittings, new furniture. - location: convenient if you have to be in the Bencoolen/ Bugis/Little India area. - lots of food all around. Huge variety of cuisine to suit all budgets. Good Bar-B-Q Steamboat at Albert St Mall opposite Sim Lim Square (100m from hotel). Good fruit stall across the road from hotel (sit and eat fresh durians & mangoes). - nice pleasant walk (15mins) along Albert St Mall to Bugis Street & Bugis Junction for great shopping. Cons: - very hard and cold ambience throughout (lots of tiles, marble and plastic). - very very tight room. We had a Superior Double without any space to lay out our luggages (tiny boxy wardrobe not friendly). After we laid them out on whatever floor space we had, we could hardly move around! Would recommend paying a bit more for an Executive Double or Twin Room with a bit more space. - very tight bathroom, whole bathroom gets wet during a shower. Not enough towel rail space, no hooks. - strange unpleasant odour in room at times, probably from the toilet - very very hard bed, could not sleep well. Woke up with backaches every morning. - no free wifi. We paid S$20 p/24hours for 3 days, but signal strength was bad! - nearest MRT stations are not that easy to access, Little India MRT: 10mins walk (dusty with lots of traffic & roadworks), Bugis MRT 15mins walk (pleasant walk but lots of human traffic). Plenty of taxis around but be aware of huge surcharges during peak hours. Will probably not stay here again, the hard bed is quite an unforgettable experience.", "Date": "December 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "", "Title": "“New and pleasant staff, but unhappy with a number of things”", "Author": "Inspector6adget", "ReviewID": "UR121415013", "Content": "I guess it is only a 3* but it wasn't up to scratch! Negative; - Had to pay a taxi order fee - only single device access for Internet use and not cheap - no hangers for trousers - dirty under the bed, very dirty! - mould in fridge - some TV channels not working - Multi gym broken Positive - decent pool - pleasant staff - new Location is ok, east enough to get everywhere, although a long walk to a lot of the 'sights'", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Good for its location n friendly staff”", "Author": "groovy73", "ReviewID": "UR121242141", "Content": "Rooms were not fantastic but it was ok for its size.... not a shoe box unit..... location was superb there is a 7/11 near by and is in between of 2 train stations. One is the North East line and another one is the East West line..... Price was ok but the staff were fantastic with all our queries and especially this front desk staff called arab. he was very helpful with all queries we had. There was another malay girl as well as chinese guy but I had forgotten their names.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Shrewsbury, United Kingdom", "Title": "“Satisfied”", "Author": "DebRags", "ReviewID": "UR121088141", "Content": "Our stay was for 4 night’s end of September. It is well located, 5 minute walk to the Little India area with great Indian food & clothing market close by, however not air-conditioned! The MRT (underground transport system) is within 5 minute walk. Taxi took about 20mins from Airport, as it’s a newish hotel, wasn’t that well know to most Taxi Drivers so tell them it’s near the Le Salle Arts College or Albert Court. Rooms we also found small, but clean, functional and contemporary in design (website pics are reflective), efficient air conditioning. There are tea and coffee facilities and a tiny drinks fridge with complimentary bottle of water provided each day. Be advised very little clothing space and had to remove a chair from the room to fit our 2 medium sized suitcases in. We couldn’t access wifi in our room but there is internet access in lobby and is reasonably priced. On the roof there is a long narrow pool, steam and sauna and small gym, but not much room for sun lounging, very little shade area; seating was limited to only 2 sun beds and 2 round tables with 4 x chairs. There is also a small child’s climbing frame and play area. We paid £75 per night and would be happy to return but only for a few nights as the room is too small for any longer. I echo previous comments in respect of the close by Food Court, situated by turning right from hotel, walk through pedestrian area with La Salle on right and the Food Court is on your left down some stairs and shops above it. I agree it doesn’t look much from the outside, but inside it is kept clean, efficient, excellent air conditioning, great variety and standard of food and cheap, lots of local eating there so a good sign of the quality of food. We ate there at least once each day. I would also recommend the Curry Restaurant in Albert Square next door to hotel. The MRT is impressive cheap, clean, efficient, easy to understand & air-conditioned. Tip – when you purchase tickets from machine you will be issued with a plastic style ticket, you will be paying $1 deposit on each journey which fully refundable, so make sure you reclaim after each journey, you simply do it via the ticket machine. Can also recommend visiting Santosa Island and taking the cable car over the harbour to get there, aim to spend the day there.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "sydney", "Title": "“Shiny bargain”", "Author": "amak4u", "ReviewID": "UR120978239", "Content": "Singapore rooms are pricey right? Well this hotel seemed new and offered a sharp deal hence I went along. And it didn't disappoint. Good family accomodation but in small rooms. Friendly staff, nice gym, pool and kids play area. Theres a restaurant and 7-Eleven in the building with plenty of food options handy. It is bang across Sim Lim Square (the electronics hub) and short stroll to a big shopping mall under construction and Little India. And its only a short $5-10 taxi ride to most tourist places. Its a real good option for those on a budget but otherwise I'd have preferred staying in the more touristy precincts of Marina or Clarke Quay. The other minus was I booked online indicating a family of four but instead got given a room for 3.", "Date": "November 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "bolton", "Title": "“Hotel good,avoid breakfast”", "Author": "damaite", "ReviewID": "UR118964880", "Content": "Hotel was good and in a great location,Albert court is lovely and you are only 3 mins from Little India and the mtr. The staff were helpful and the pool is clean and welcome relief from the heat, Yes the rooms are small but we didn\"t go to Singapore to spend much time in the room. The shower is powerful and you have to be careful not to flood the bathroom,I would have rated it higher if it wasn\"t for the breakfast-a Chinese restaurant attached to the hotel serves breakfast at 15 Singapore Dollars per person, Give this a wide berth,it is more for Asian tastes than western,no fruit,cereal ,toaster did not work properly. Totally inadequate breakfast,from a restaurant that seems to do well at night as a chinese restaurant,not suited to morning breakfasts. Overall not a bad hotel.", "Date": "October 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Kuching, Malaysia", "Title": "“Travelling with family”", "Author": "ladyfynn75", "ReviewID": "UR118918082", "Content": "Location is good. The room is extremely small, there were 3 of us in one room, my husband,my 3 year old and myself. All slept in 1 bed. We were there for 5 nights, the worst 5 nights of my life. Breakfast was pathetic. The chef should be ashamed to show his face to the diners.Toilet constantly emitted unpleasant smell. Room service was bad. Went out in the morning and came back late in the evening, the room was still not made up despite having the \"make up room\" sign! The only thing I was thankful for was for the pool, despite small but it was always empty. Do not bring big bulky luggage or too many luggage if you intend to stay in this hotel. THERE AREN'T ENOUGH SPACE!!!", "Date": "October 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cebu City, Cebu City, Philippines", "Title": "“Satisfied and definitely returning...”", "Author": "Daryl V", "ReviewID": "UR118747445", "Content": "Greeted with a warm welcome at the Front Office and was amazed by how elegant the interiors was. Check in was quick. Room is small but it sure was clean and comfy. Albert Street is a quiet location and is nearby various establishments. I am definitely coming back =)", "Date": "September 29, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Kuala LUmpur", "Title": "“Nice Hotel, unfortunately poor service.”", "Author": "NorhashimahHashim", "ReviewID": "UR117725334", "Content": "Good hotel location, unfortunately the room was not properly tidy up. We found 'adult stuff ' in the drawer . Just imagine we have young one's with us. On the day we check out, we was been accused for something that was done by earlier occupants. The supervisor rely on the 'cleaner' statement without checking ! He was just standing still without 'heart' to calm the situation. Suggest that the staffs to be sent for training.", "Date": "September 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Never stay here again”", "Author": "030912v", "ReviewID": "UR116662797", "Content": "My 7 other guests were booked on a earlier flight to singapore from HK and made specific arrangements with front desk staff I should have access to my room at 9 pm. On arrival I was refused a room as my Name had not been entered in the computer and no msg left by afternoon staff. I had to wait over 2 hours for the group to return from Dinner to get access. The Room was just double bed size, impossible for 2 people to sleep on unless married or Lovers. The bathroom is smaller than the Head on a boat. I ended up sleeping on the tile floor. Next day when asked for anothe room I was quoted best price $188, twice the package rate. Is Noisiest Hotel o have stayed at as is super thin walls, tile floors and low ceilings. Next morning a women 10 rooms away talking on her cell phone, woke everyone on that floor. Breakfast was terrible addition of Asian food, with no cereals fruit or juice. The front desk staff arrogant and non apologetic for their or the hotels overpriced shortcomings", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“Bad service and really small rooms”", "Author": "psagar", "ReviewID": "UR115954506", "Content": "The only redeeming feature is the location which is 10 mins to major shopping centers in Singapore. The receptionist are very dour and start calling you at 11am to remind you leave the room at noon. Breakfast is basic and has a very budget feel. The rooms are really small and the gym is tiny. Best to spend a few extra dollars and stay at a better place.", "Date": "July 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“Tiny room with awful breakfast”", "Author": "gomed", "ReviewID": "UR115941173", "Content": "Located at the end of Albert street next to Albert Court Hotel. Subway about 15 minutes walk. 5 minutes walk to Sim Lim and 10 minutes to Albert food court. Room was very tiny and clean. I don't think it was fit for more than 2 persons. Pool was nice and the worst is the breakfast. Good value if you looking for clean and new hotel. We booked at SGD160/night.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "San Fernando Pampanga, Philippines", "Title": "“new hotel ,enjoyed our stay”", "Author": "filipinaLady", "ReviewID": "UR115827146", "Content": "the hotel is new so you can expect new soft comfy pillows ,bed and linens. the swimming pool , fitness gym , sauna and steam bathe are added pros to like this hotel. negative comments i can say ; 1. front desk too slow on check-in ,based on our experience it took more than an hour and 20minutes before we got our rooms 2.their buffet breakfast is always the same, from day 1 to day 4 and they put their tasteless lolly juice on a big jug dispenser without ice. when i asked the head waiter why not cold he said their ice delivery is always at noon time. but over all we enjoyed our stay since the hotel is just a walking distance to bugis junction and sim lim square.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Hong Kong", "Title": "“Small but clean and tidy”", "Author": "Manson_T", "ReviewID": "UR115356262", "Content": "The location is excellent, just near to Little India. Although the room is quite small, all the facilities are new, clean and tidy. The hotel provides 15-minute free wifi services for guests. It is fair enough. The complimentary breakfast is quite OK and fit to budget travellers.", "Date": "July 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“My experience and view of this Hotel”", "Author": "Mervin64", "ReviewID": "UR110697603", "Content": "Overall the Hotel was new and clean as when I was there the hotel have yet to be officially launch. The location of the Hotel was convenient with two MRTs station nearby (5 to 10 min walking time) The sad part was the service provided by the hotel staff was totally unacceptable, slow, not helpful and no caring to the hotel Guess. According to the front desk staff an one hour early of check in or an one hour late of check out will be charge for another day of fee which was unfriendly and very expensive. Do not understand why the hotel was so calculative as there was vacant time between 12pm till 3pm which reserve for the house keeping the clean the room.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Makati City", "Title": "“My Hotel Nightmare”", "Author": "jabberback51", "ReviewID": "UR108026495", "Content": "I arrived in Singapore at 11:30Am and was met by a taxi driver arranged by my tour operator. It took about 30 minutes to travel from the airport to the hotel. When I arrived at the hotel at Noon, I asked to check in early if possible (normal check in time is 3PM). I was told that there was a charge of $147.50 for early check in. This was quoted at the normal daily rate, not the price I paid with my package. I declined to pay the additional charge and sat in the lobby for 2 1/2 hours. At 2:30 PM an Asian Couple arrived and checked in as I watch them pay with their credit card. So I was disturbed that they had allowed this couple to check in while I continued to sit on the couch. I walked up to the front desk and demanded my room, after seeing the couple check in. The employee saw tha I was in no mood to discuss it and complied to get me a room. When I arrived in the room, the room was a total wreck. I turned and looked at the hotel employee and said this was unacceptable. He agreed and went down stairs and got me a new room. My new room was ready and I had no complaint. At 8PM I decided to retire early. Sometime later I was awakened by this banging noise on my door. It turned out to be the night latch that someone was opening and closing the door. I jumped out of bed undid the night latch and saw a drunk man an a hotel employee standing outside my door. I happened to notice that the man was holding a hotel key. I looked to the hotel employee and asked why I was being woken up and what this gentleman was doing with a key to my hotel room. He said that he was told the room was empty and he had helped this gentleman bring up his luggage. I informed him that it was very obvious that I was staying in the room and to please not disturb me again. The next day I went on a tour which included a lot of walking. This was ok except that the humidity was very high and I never stopped sweating. However, the driver of the tour bus was outstanding. He saw that I was not use to the weather and getting very hot he made me comfortable and offer his further assistance if needed. When I arrived back at the hotel, I purchased 2 days of internet service as I had mainly come to Singapore to rest. I also asked to speak to the manager so that I could inform him of the previous nights incident. I was told the manager was not in. I asked that they have him contact me we he arrived. I went to my room and disturbed to find that there was no bottled water, tap water is not always advisable to drink. So I took a shower and went to a store and bought water. The food in the hotel was not very good, especially the provided breakfeast included in the price of the hotel. The food had no seasoning that I could taste and the selection of food was sparse. The breakfast was not an international menu. I ate their only 1 more time and ordered off the menu. The foor was unremarkable. I went to the mall, there were 2 within walking distance and did some shopping. Again it was very humid. I purchased more water and returned to the hotel. As I entered the door I noticed the front desk handing some bottled water to some hotel guests. This was my 2nd day at the hotel, so I asked if the hotel provided bottle water in the rooms. They said yes. So I asked them why my room had no bottled water for 2 days? The auditor said He would bring the water up to my room himself right away. I went upstairs and turned on the internet and watched TV for more than 2 hours. No water arrived in my room. So I called back downstairs and asked if they would bring up my water. Shortly thereafter my water was delivered. I asked if they had laundry service available? The gentleman said yes just fill out the laundry request and put my clothes in the bag provided. I asked what bag and what laundry list as I had seen nothing like this. So this person check for both and found neither. He left and came back with both. When he handed them to me, I asked him if he had a pen as there was no pen or paper in the room. Also I asked about the manager and why he had not contacted me. Of course the hotel employee said he did not know. I called the Tour Operator and told them of my experience so far at this hotel. She said she would contact the Sales Manager and have him contact me. It about 30 minutes later the Sales Manager called asked to meet me downstairs. I agreed and sat down and explained to the sales manager, Patrick, all the problems I had encountered. Patrick thanked me for my \"good feedback\". He said that he would investiagate my concerns and get back with me. Bottom line, he never called me back. Prior to my checking out I asked to speak with him and he said, Yes, we are sorry. Turned and walked away.n I said loudly in the hotel lobby, Excuse ME? is that it. He said yes and enetered his office.", "Date": "May 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“good location with bad services”", "Author": "tree5", "ReviewID": "UR106906300", "Content": "A very good location where its only less than 10 minutes walk to Bugis MRT. you get a lot of local delicacies on your way to MRT, food, clothes and many more. basically you name it, you get it. We arrived at 1pm at the hotel check in desk and requested to check in (as they said check in time is 3pm). We asked if there is room available for us to check in due to the long and tiring flight since last midnight. We were told we will be incured charges if we wish to do so. Spoke to the manager and finally they allow us to do so. What is the problem for us to check in earlier into OUR room while you have empty room? Are you trying to sell your room in between the 2 hours for day users?! Room is dirty. Urine staine on toilet bowl, bedsheet with stain and dust and hair everywhere on table top and floor....when we requested to clean the room again, we were treated very very badly by the room attendance...he physically dump the pillow on the floor and nagging all the way... i will not stay here anymore with the price (SGD 225 for twin sharing per night through travel agent)!", "Date": "May 4, 2011"}], "HotelInfo": {"Name": "Parc Sovereign Hotel", "HotelURL": "/ShowUserReviews-g294265-d2093622-Reviews-Parc_Sovereign_Hotel-Singapore.html", "Price": "$108 - $187*", "Address": "<div class=\"amenFloat\">", "HotelID": "2093622", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/e8/6f/e86f1f944e64fb8f8da3a8bb7604682d2large.jpg"}}