{"Reviews": [{"Content": "Cheap, clean, and convenient I've stayed at the Ohana Waikiki Malia several times in the past year. Though some of the rooms need to be updated (old carpet, tired bedding) I've found it to be clean and good value for the money.Reading some of the other reviews puzzled me. The lobby is clean and modern, not at all institutional, as another reviewer has said. The staff has always been helpful and polite.What I like most about the hotel is the willingness to give extended checkout at a reasonable price -- $10 per hour. My stays in Honolulu are stopovers on long trips. I generally check in about 4 a.m., and check out at 4 p.m. Other Waikiki hotels want entire night's fee for a checkout time this late, instead of the $40 I pay to the Malia.I think it is good value for the money.", "Date": "Nov 21, 2008", "ReviewID": "UR848860294", "Ratings": {"Service": "4", "Business service": "1", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "3"}, "Author": "2Nonna"}, {"Content": "Good value for Waikiki We stayed for one night, for a mini-Waikiki vacation. The rooms were clean, the staff pleasant, and although there is no pool here, the desk staff directed us to sister hotels 3 blocks away where we could use the pool. They give you a great coupon book upon checkin, and we used some of them. The AC was excellent--in fact, we were too cold and had to turn it off! There is a bit of traffic noise from the street below if you get a room without a view--but this is the middle of Waikiki after all. And the view of the lights of Waikiki that we could see from our room was great. Close to shops, restaurants, and clubs. We left the car parked and took advantage of the baggage courtesy check when we wanted to stay past checkout time. The only thing they could improve would be to give better directions to the parking garage. The Kuhio St. entrance is very steep and narrow; we left some rubber! Lewers is better. Very safe hotel, friendly staff, nice, clean place, would definitely stay again.", "Date": "Sep 8, 2008", "ReviewID": "UR375243002", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "localgirlHawaii"}, {"Content": "Ohana Waikiki Malia - Excellent. Marg. Melburne Australia.       1/8", "Date": "May 17, 2008", "ReviewID": "UR240295743", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "ScotMelbourne"}, {"Content": "It's okay for the price Stayed at Ohana Malia on Kuhio Ave for our last night, $99 rate. Previous to this, we were at the Ohana Waikiki Beachcomber on Kalakaua for 3 nights/$129. Friendly and proffessional staff. Stale old rooms, 70's decor, very dated and in need of and update. For the rate it was decent and clean...comfort wise, I preferred the Beachcomber. Liked the pay internet service in the lobby since we didn't bring our laptop. If you don't use up your paid minutes you can write down an access code and use the unused time later on. Dined at the IHOP next door, fast friendly service. Bus stop for Diamond Head was across the street and free trolley depot behind the hotel. Convenient location.Okay if you are on a budget or spend most of the time at the beach. We opted for late check out since our flight wasn't until 9pm. $10/hour charge for each hour after the normal noon checkout time. However, frontdesk forgot to notify housekeeping of our 6pm departure and we got a knock on the door at noon from the housekeeper.Would stay again if on a tight budget.", "Date": "Apr 24, 2008", "ReviewID": "UR956948726", "Ratings": {"Service": "2", "Business service": "5", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3", "Value": "-1", "Rooms": "2", "Location": "5"}, "Author": "mimimorang"}, {"Content": "Convenient My family of five stayed at the Waikiki Malia for a soccer tournament. We requested a crib for our infant and to have a room near the laundry room because I was planning on washing soccer uniforms every night. Both requests were fufilled. Another plus was that we were located near an ice machine which is very convenient for us to fill our coolers for the long day at the soccer fields. The parking stalls were also in very close proximity to our rooms. This made it convenient for us to lug the soccer and baby gear to our van each morning. We stayed in a suite. The master bedroom was roomy enough to place the baby's crib right in next to me. The separate room allowed my sons to sleep through the night without being awakened by their sister's crying in the middle of the night. I requested two twin beds for the living room. This was a big plus because I didn't have to listen to the boys fight all night long, he's touching me..he's hogging the blankets The rooms were clean. The beds were okay but I am used to sleeping on Tempurpedic mattresses at home. IHOP is right downstairs. No need to find a restaurant in Waikiki and then find parking or have to pay for parking. This was very convenient.Parking was a bit scary at times. The parking garage ramps are steep and narrow. We have officially named this the soccer hotel. It is perfect for families traveling for tournaments. I would not stay here for vacation but we will definitely stay here again for our future tournaments. I prefer the Doubletree or Ala Moana for vacations but the Malia is perfect for our next soccer tournament.", "Date": "Mar 11, 2008", "ReviewID": "UR844560844", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "bluekanati"}, {"Content": "Very Cozy  I didn't think this hotel would be that good because of all the negative reviews that it received but in reality, this hotel is great! It is an older building and the furniture is olden, but its still clean and very cozy. We stayed in the building that had 8 floors, not the 1000 unit one and it was very quiet. The lanai had a nice view from the 5th floor and at night when you shut the window and curtains, there isn't any noise. Housekeeping washed our dishes everyday and changed the bedding every 2 days, but when we called them they changed it everyday.  they even give pool towels, just ask.When we had to leave, the front desk even booked a taxi for us.Next year, we're defiantly coming here again!", "Date": "Feb 29, 2008", "ReviewID": "UR428973727", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "xLISSA"}, {"Content": "Less than 12 hours here was still too long       Greasy windows.", "Date": "Jan 5, 2008", "ReviewID": "UR893025170", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "Hutchcore"}, {"Content": "Nasty I can't say anything was really nice about this Hotel. The rooms are dark and very old, they are not at all sound proof and the road noise is extremely loud. The lifts are very old and quite scary. There is no swimming pool and no internet connection in the rooms, you have to go to the lobby to connect.Certainly do not recommend it.", "Date": "Jul 31, 2007", "ReviewID": "UR206444961", "Ratings": {"Service": "3", "Business service": "1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "ladybug25"}, {"Content": "Budget Accommodation Very poor Hotel by Waikiki standards.Given that this is a very popular holiday location I was expecting a much better hotel experience.Firstly it was hard to find, I hired a car to get around and drove past the hotel a number of times before I found the entrance. I had to squeeze the car into the very small car park.The staff were not rude but really didn't go out of there way to be over helpful.The rooms were very old fitting wise. It was clean but run down. I didn't feel safe on the balcony and felt that the tv was very small given the size of the room. I was woken up a number of times by people coming and going from other rooms on the floor and by the light that comes in under the door.The location was OK, a bit of a walk to the beach.I was expecting a lot better for the money I spent, but I see this as a learning experience and won't book through a travel agent again!", "Date": "Jul 3, 2007", "ReviewID": "UR505644446", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "3"}, "Author": "iac0n"}, {"Content": "Good, clean comfortable and central We booked a package from Australia and only had a choice of 3 hotels in Waikiki - I chose this one because it was out of the main beach area - which from previous visits I knew was very busy. To be honest after reading the reviews here I was dreading it - people had mentioned stains, dirty carpets and bed bugs!!However I was really pleased when I arrived - we got there early (10am) and was told the room was ready - we were on the 12th floor - the room was large and airy with a huge window (the balcony is very small) and I have absolutely no complaints and would stay there again without doubt.The hotel is very central - the free pink tram has a terminus in the DFS building behind and you are within walking distance of everywhere. I only had a couple of encounters with staff downstairs and they could not have been more helpful. All in all a very good quality hotel.", "Date": "Apr 29, 2007", "ReviewID": "UR318869035", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "mollybairn"}, {"Content": "Very satisfied Stayed 5 nts. Hotel and room was very clean and spacious. The staff helpful and courteous. Great security. Location excellent. Great deal for the money. Would stay there again and recommend to anyone.", "Date": "Apr 11, 2007", "ReviewID": "UR532147015", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "NYSavvytraveler"}, {"Content": "Shabby Even For Budget Waikiki We booked this hotel through United Vacations. We travel to Hawaii nearly every year. This was the first time we have stayed at this hotel, though we have stayed at an Ohana brand hotel before.Our room--1516--had lots of problems. The air conditioner in that room is about to die, as evidenced by the constant loud rattle of the fan. We didn't use it much because it was so noisy, and it had a bad odor. The carpet is very worn and stained. The refrigerator door is hanging by one hinge and must be lifted to get it to close. We also didn't use the dresser drawers because they were disgusting. When we notified the front desk, we were told the brown, smeared stains were paint. It looked quite a bit like something else, and the drawers were musty-smelling. The entire room was dusty. My parents were staying in the room next door, which had an OK carpet, a nice refrigerator, a working and quiet air conditioner, but still musty in the dresser drawers.If you like to sit on the lanai, stay elsewhere. The Malia's lanais are so tiny you can't even get a chair out there. The Malia is on Kuhio, a busy, noisy street. If noise bothers you and you choose to stay here, bring earplugs or buy some at the ABC Store across the street. The Malia is a long walk to the beach and has no pool. You can use the pool at the Ohana Maile Skycourt, Ohana West or Ohana East, though these hotels are as far away as the beach and their pools close early (8 or 9 PM depending on the hotel). We didn't even take the time to look at the available pools.We used the laundry facilities at the Malia. The washers are fine. It costs 2 dollars to wash. The dryers cost $1.50 to dry, but the inefficient dry cycle is only about 25 minutes, so it actually cost me $4.50 to dry a half load of lightweight cotton clothes. The laundry is on the 5th floor of a very dark, deserted garage that is open to the public. Kind of scary.The good things: Front desk staff was fine. For most of our stay the housekeeping staff did a good job and was pleasant. (We did have one fellow for a day or two who did a really lousy job.) Free daily coffee for the in-room coffee maker and free daily newspaper was much appreciated. Free rides on the Pink Trolley is a useful perk. Rooms are large for Waikiki, with a real bathtub in the bathroom instead of just a shower. I might stay here again IF the management would fix the air conditioner, do something about the really gross carpet, replace the refrigerator, paint the inside of those drawers, and keep them clean with an occasional bleach and water scrubbing.", "Date": "Feb 28, 2007", "ReviewID": "UR531896957", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Kiwi_Cook"}, {"Content": "STAY AWAY! Crappy Hotel!! This hotel was a huge disappointment. It was very dirty (the carpets, furniture, bathroom, walls) and looked like there was mold growing on the ceiling and around the ventilation ducts. Housekeeping had to come and change our bed sheets because the ones on the bed were stained and disgusting (GROSS!!!). The staff is not very friendly and it's just a dirty hotel overall. Look elsewhere- or spend a little more for a nicer hotel", "Date": "Feb 7, 2007", "ReviewID": "UR600967526", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "kaitlynnSacramento"}, {"Content": "Good Budget Hotel This is a good choice for those traveling on a budget during tourist season. The location is perfect - a short 2 block walk to the beach and International Market Square. It is on the pink line trolley system which gets you to Ala Moana shopping. The hotel has a deal with the trolley and guests travel it free of charge. The city buses also run right past the hotel. There is not a pool at this location (remember beach being 2 blocks away) but you are free to use other Ohana facilities - all within a 4 block walk. IHOP has recently opened adjacent to the hotel so breakfast was a breeze. The rooms were clean. Each room has a coffee maker, small refrigerator and room safe. Various toiletries are supplied as well. The bed was a bit on the hard side and the pillows left something to be desired - but this is a budget hotel too!", "Date": "Jan 1, 2007", "ReviewID": "UR726745640", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "Beekeeper"}, {"Content": "All I can say is WOW!!!! I never thought that I could stay in a better place. It says 3 star, but it defenatly deserves a 5. The pictures don't do it justice. The staff was amazing, the rooms were clean, the pool was glicening. I normally only stay in 5 star properties, and my travel agent told me about his one. She said that she was leary because of the reviews, but she stayed there, and wont stay anywhere else. So I took her word for it, and stayed there, and boy am I glad that I did. When I checked in, there was a small problem with the room, they had double booked it. I was really upset and ready to raise heck, but before I could say a word, the refunded me for half of my stay AND bumped me up to a suite. I think I am going to take all of my vacations in Honolulu, and always stay here. I could go on all day. I know that some reviews are less than a 5, but I don't know where they came from. Maybe the hotel saw the reviews and were proactive about getting the problems fixed. It was just magnificant!!", "Date": "Oct 4, 2006", "ReviewID": "UR940000342", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Luv2TravelAllDeTime"}, {"Content": "Decent Place to Stay Was a little nervous about staying at this budget-priced hotel for 6 nights with my wife and 14-year-old daughter, but overall it was pretty decent. The room was on the small side, but clean and fresh, with fairly comfortable beds. The six dresser drawers were pretty nasty, however; only one was clean enough to use. The bathroom was a nice size, with good water pressure and constant hot water. Nice central air conditioning (although the cover plate for the controls was missing; instead, it was labeled with a sharpie: Hi, Lo, Off). Very small lani (balcony) without any furniture (only 1 small chair would fit anyway). The biggest drawback are the very thin walls and windows. Heard all the noises on the street from our 11th floor room (facing Kuhio Ave.). Even worse, you can hear every sound from neighboring rooms, from toilets flushing to alarms going off. Not to mention guests socializing in the hallway all night long and the endless slamming of doors. Most of the guests seem to be either young party people or military, at least over the 4th of July holiday. The location is great, maybe a 10-minute walk to the beach (if you go thru the Waikiki Sheraton). City buses and the Hilo Hattie trolley are right outside the door; other trolleys are right around the corner at the DFS Galleria. Extra charges: parking garage was $15 a day, $3 a day to use the room's safe, $2 if you use the supplied bag of kona coffee. There was a free newspaper outside your door each morning. The front desk provides you with beach towels (which are actually just the same small bath towels that are in the bathrooms). There is a newly opened IHOP restaurant adjacent to the hotel, recently converted from the old Malia Cafe. Nice, new decor, very crowded for weekend breakfast. Overall, not a bad place to stay when you can't afford those expensive beachfront resorts.", "Date": "Jul 8, 2006", "ReviewID": "UR753221273", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "JerrGell"}, {"Content": "Ok for one night.... but barely My husband and I stayed at the Ohana Waikiki Malia for one night because we arrived in to Honolulu too late to catch an interisland flight to the Big Island. I knew it would be pretty low-end but figured for one night it wouldn't be that bad. It was pretty bad. The hotel has a bizaare institution feel to it from the lobby to the elevators to the halls. The room was dirty, the curtains were stained from smoke (even though it was a non smoking room), the entire room had a sickly sweet smoke smell to it, and the ceiling was stained. The carpet was thin and stained and not something you wanted to walk on in our bare feet. The bed sheets were stained. The air conditioner sounded like a jet engine taking off making it impossible to keep on while trying to sleep. The noise from the street was terrible, and the other guests in the hotel seemed to all get home at 3am and need to run up and down the halls and slam doors to announce that. The only reason I gave this hotel two stars instead of one was because of the suprisingly clean and renovated bathroom, I almost wanted to sleep in there. As far as budget hotels in Waikiki go, there has GOT to be better options than the Ohana Waikiki Malia. Spend the extra $30 per night and stay at the Ohana East, they don't even compare for cleanliness.", "Date": "Jul 3, 2006", "ReviewID": "UR639359607", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Good Value Nice rooms in a covenient Waikiki location. Paid $89 for each of 2 nights through their website. The room was not musty like many Waikiki hotels. The room was nice and clean and included a small balcony. We had a comfortable king-sized bed. The bathroom was standard for a budget priced hotel. A free newspaper was provided in the morning. There wasn't really any restaurant except for breakfast which we never tried. Extra charges for parking ($15), room safe ($3) and coffee. Please be warned that the parking garage had the steepest and narrowest ramps I have ever seen. All in all, a good value in the heart of Waikiki.", "Date": "Apr 24, 2006", "ReviewID": "UR293721932", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "highloyo"}, {"Content": "Clean Decent Accommodation Stayed at the Ohana Malia from 17-23 March 2006. We booked through our Travel Agent in Australia and were promised approx 3 star accommodation. And i would agree that this is what we received. I went with my Aunt and we had twin double beds. We stayed on the 17th floor. The room was clean and tidy, with Air Conditioning and TV. All worked well. The bath tub was good but the shower water pressure was very weak. They came in and made up the beds every day and put in clean towels which was good. There was a bar fridge but no kettle for hot water. They only had some kind of coffee maker (but you are charged for the coffee). The staff were friendly and helpful. They have an information desk for maps, day trips etc, and they can do bookings for you. We went to the Society of Seven dinner show which was quite good value (very energetic and entertaining), but probably more suited for people over 50-60 years of age. We were able to book the return airport bus ($9 US) from our hotel conceirge which was handy.Overall i was pleased with the cleanliness of the hotel, it's not absolutely flash but it would be very suitable for clean family accommodation.", "Date": "Mar 31, 2006", "ReviewID": "UR755394430", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "You get what you pay for. We were traveling on a budget. Our initial reservations were for the Ohana Waikiki Surf, which is right across the street, but we got moved to the Malia. The location is very good, and the staff is very friendly. I found all the people I encountered in Oahu to be extremely friendly.Now to the complaints. We didn't have hot water two of the 4 mornings we were there. The parking structure is steep and narrow ($15/day). Rooms were small, and our keys kept failing. We had to go to the front desk to re-activate them on more than one occasion.", "Date": "Mar 2, 2006", "ReviewID": "UR489226519", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "2", "Value": "3", "Rooms": "2", "Location": "-1"}, "Author": "cali-trekker"}, {"Content": "Good Value Hotel My husband and I stayed here 7 nights. This was our 2nd trip to Oahu and we just wanted a clean comfortable hotel. When we arrived to the hotel I was pleased with the location. We were close to restaurants, the beach and The International Market place. Our room was clean and service was good. Breakfest in the hotel restaurant was good, but dinner was not good at all.Our room had two double beds with a small lani The lighting near the closet was not very good. The hotel/condos accross from my room were under construction, so when I wanted to change clothes I had to close the drapes or go in the bathroom to change. However the bathroom did have a full size bathtub, with good water pressure, and plenty of hot water. Bathroom was very clean. We were glad the bus stop was very close to the hotel, that was convenient for us.Regarding tours: we booked 2 tours with the hotel tour desk, both tours were really good and the lady was very nice.We had a pleasant stay at this hotel and would stay here again, it is clean and is in a good location, not a beautiful hotel but comfortable and is a good value hotel. We learned from our first trip to Oahu that we did not really spend alot of time in our room except to sleep and shower.", "Date": "Feb 13, 2006", "ReviewID": "UR550691129", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "sylbro"}, {"Content": "Nice staff, clean rooms, things you need nothing you don't.       Ali Kaii dinner cruise", "Date": "Feb 12, 2006", "ReviewID": "UR210131429", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Capricious26"}, {"Content": "Great hotel for low budget!!! I stayed 10 nights at this hotel (Dec. 12-23rd) 2005. The staff was really nice and helpful, we got a smoking room at first and asked to change, and it was no problem. They even moved the luggage for us. It is clean and well maintained hotel. The location is great. You are 2 blocks from Waikiki Beach and the market. The city bus passes just in front of the hotel where you are 10 mins away from the main shopping centre. This hotel is perfect for low budget traveler like me, being a student; you want quality at a reasonable price. The hotel restaurant on the other hand is kind a dirty, the ceiling was leaking in the middle of the dining room... Not sure its all that clean! And the food wasn鈥檛 the best. Anyway, there are tons of great restaurant around the hotel. This little bar/restaurant called Tsunami does great breakfast for only 2.99$! And the servers are really nice.Overall, I highly recommend this hotel.", "Date": "Jan 31, 2006", "ReviewID": "UR777139988", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "Sonianna"}, {"Content": "Great Value Hotel in central location We stayed at the Ohana Waikiki Malia from the 24th of December through to the 31st of December. After reading several of the reviews about this hotel I was very skeptical about this property. What makes things worse is that I work in the Travel Industry as a marketing co-ordinator I know that flashy pictures and fancy words can fool many. However we were pleasently surprised about how well this hotel measured up. When we checked in we requested to upgrade to the one bedroom suite, and was advised that it would only cost an additional US25 per night plus tax. This was very reasonable and decided to upgrade. We were placed on the 9th floor (top floor), with a nice view of the city. The layout of the suite consists of a lounge room with two single beds made up as day beds and then the main bedroom, it also has a small kitchenette to prepare meals. The large balcony makes is perfect to sit there and enjoy the city and the mountains in the background. The decor was very nice and these rooms had just been recently renovated. The hotel has two wings the Luana Wing Tower where all the suites are located and the Malia Tower wing where all the standard and city view rooms are located.The hotel has a cafe located off the lobby and has buffet breakfast from US7.50 per person. Overall this hotel has exceed all of our expectations and we will be staying here again. As someone who works in the industry I feel the standard is quite good, it's not the Ritz but for the price you pay it's well worth it.", "Date": "Jan 5, 2006", "ReviewID": "UR723075795", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Not bad if you get a good rate I stayed here for 4 nights in a room on the 14th floor. The room was fairly large and the bathroom was nice enough, and it was all very clean and felt safe. The walls are kind of thin though - when I was lying on my bed I could hear the people next door in the bathroom.They're doing major renovations on the hotel/condos across the road, and my room had a view of the construction site/workers so i had to keep my curtains closed most of the time - only a problem for even-numbered rooms, other side of the hotel would be fine. The lanai is teeny-tiny (can just barely fit one chair on it and really not even suitable for drying washing). I don't care that there's no swimming pool (it's Waikiki, i'd rather go to the beach!). However, that also means there's no place where you can have a shower or get changed if you have a late flight (I had a 10-hour flight leaving around midnight, and felt really crusty cos i couldn't have a shower after spending the day snorkelling - just had a cold-water rinse at the beach). there were some people from the UK complaining about the same thing so it's not just me. Apparently if it's not fully booked they can open up a regular room for people to shower etc, but the day i was leaving the hotel was full (so no late checkouts either). This would put me off staying there again - all the other hotels i've stayed at in Waikiki have had a hospitality room or a gym for people to shower/get changed in before a late departure.", "Date": "Dec 29, 2005", "ReviewID": "UR505790016", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "4", "Location": "-1"}, "Author": "flyingmonkey"}, {"Content": "The allround Malia My wife and i stayed at the Malia for 7 nights at the start of november 05, with not one problem to be had.Stayed on the 17th floor and the only noise was the cop cars sirens at night but not that often, (once every three nights). I asked other tourists from other hotels and they said the same thing. Hotel had everything but a pool, great little cafe for breakfast and dinner, a tourist counter was a great help with our sight-seeing, and a really good concierge service. Would really recommend to a couple with only shopping in mind or a family on a budget, because you can use the pools from the other Ohana hotels which is what we did and it was great to talk to other tourists outside your hotel. Location is excellent, with everything close, and public transport stop at the door. Summing it up Good value for money for everything you need.", "Date": "Nov 13, 2005", "ReviewID": "UR890270278", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "started ok but ... recently stayed there for 5 nights . as a budget hotel u get what u pay 4 so u can read the other reviews but 2 points i have to add.1) the malia cafe lets the hotel down. the food is the same every morning (buffet) and the staff and kitchen are noisy and distinctly unprofessional (e.g. talking about what shifts to work next week in front of the guests and chastising one another)2) i ordered a movie and the sound was so bad it was unwatchable. ok no big deal as i just called up to cancel it straight away. however when checking out i noticed it was still on the bill and asked them to remove it, when the deskstaff started complaing that it was a hassle to change the bill and why should i bother as it was only 1 movie ($9 ). in addition he was visibly annoyed and amongst other signs of irritation dropped the pen on the desk in order for me to sign the ammendment and told me how i should be greatful for his 'generosity' . maybe im missing something but their movie service didnt work properly and nor did their staff as i had clearly cancelled it over the phone 5 mins in to the movie. who was wasting whos time?? if u want budget stay here, but i hope u have a more pleasant stay than i did!", "Date": "Oct 4, 2005", "ReviewID": "UR433067598", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "2", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Do Not Stay Here If You Are Renting A Car And Have To Park We had a family reunion and wanted a clean and basic/inexpensive hotel. The price is ok and the hotel room was as expected... BASIC.However, The most irritating part about this hotel was the parking Garage. Spent $17/day. and I cringed everytime we had to get out of the garage and park back the car every night. Parking Garage is narrow and small. We had rented a SUV and a compact car and had no idea how the garage would be. Both cars had a hard time parking in the narrow and steep drive way. Surely ok if you don't care about scratching, denting or damagin your car and others... .", "Date": "Aug 30, 2005", "ReviewID": "UR189877029", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "ISLNDUST189"}, {"Content": "Extremely basic We only stayed here one night because that's all that they had open (we didn't have place to say until we got there - we live dangerously). We only paid $89 for the night, so that may cloud my better judgement here. The room and hotel were very basic. The view that we had wasn't really much of a view at all. The tennis court and observation/sun deck on the roof were great and offered amazing views of Waikiki. If you get this hotel for around $100 and don't mind a hotel that isn't the cleanest or the nicest, stay here.", "Date": "Aug 13, 2005", "ReviewID": "UR317992131", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "3", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "hxcroach"}, {"Content": "Service with a Smile I recently spent a few nights at the Ohana Malia with my mom and while the rooms were okay, the staff was what made the hotel memorable. On our second to last night we were subject to a group of outrageous, hormonal teenagers running throughout our floor. Thankfully we were heading out to dinner, but stopped by main counter to let them know our concern. They understood our concern and told us that we should notify them immediately of any problems that may occur. We also asked simple things as directions to different parts of the island, where the locals eat, etc. and each time they were amazingly helpful. For those of you curious about the rooms, the room we stayed in had a double bed in the bedroom and twin beds that doubled as sofas in the living room. The bathrooms were nice, spacious and clean. The location of the hotel is just a few blocks from the beach and right by all the Waikiki shopping destinations. Ala Moana shopping center is also within a 5 minute driving distance.", "Date": "Jul 17, 2005", "ReviewID": "UR654750257", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "miki156"}, {"Content": "nice people We stayed at the Ohana Malia for a week and enjoyed our stay. Although booked originally into a room facing the street, upon asking, we were moved across the hall to an ocean view. Very nice place for the price, good location to most attractions, and access to beach, couple of blocks away. No pool but that is across the street at the next Ohana facility. Always friendly staff, interesting mix of people in the hotel. I'd recommend it for the value minded traveller.", "Date": "May 31, 2005", "ReviewID": "UR933720468", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Nice Budget Hotel We stayed for 6 nights at the end of March 2005. The 1 Bedroom Suite we had worked great for the 4 of us in our party, as we needed 4 beds. The room was cleaned each day and staff were all very nice. Parking garage was very hard to navigate the first couple of times but got used to it. Would have been nice to be on an upper floor(we were on the 2nd floor) as noise from the parking garage and street were loud early in the morning. Overall this hotel was fine and worked perfect as everything we wanted was within easy walking distance. Would definitely consider it again. Great bargain for the money.", "Date": "May 12, 2005", "ReviewID": "UR539880698", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "awful awful!i felt like i couldn't touch anything.the plumbing was smelly, the water didn't go down the pipes fast enough so you showered with all the water up to your calves.the queues were terrible, not enough staff.the reception being open air meant that I saw rats running around under the sofa near my anklesnoisythe lifts - crikey - rubbish - had to wait far too long - not acceptable.just too large, too many people and not enough facilitiesYUCK!", "Date": "Apr 25, 2005", "ReviewID": "UR262224949", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "good for it's rating i just returned on friday from Hawaii and had a lot of stuff go wrong, by far my worst trip and most expensive, definatley never going back. Highly suggest a different place, but if your totally set on going to hawaii this hotel was alright. The hotel people were the most polite people we met there, although we had bad luck so i don't know if that's a compliment, i had a parrott guy start screaming at me as i walked away, and i swear i was very polite turning him down. if you didn't give what they considered a appropriate tip they got nasty and everyone wanted a tip.  the room was clean, the pillows nice and fluffy. whenever we asked the cleaing lady for a towel she would give us 3. the front desk staff were always polite. we had ocean view (a joke, don't let them talk you into paying extra) but they upgraded us for free sinply because i asked nicely. the fans on the mall below us were loud, but i live in the city so that didn't bother me, it's constant, and started sounding like the ocean after a few days (to me anyway). our bathtub started making werid noises the day we checked out, i don't know if that was them cleaning the pipes or relating to the construction work. our last day we didn't leave for the airport until 8pm, they had a nice clean, locked bathroom they let us use to get cleaned up and change for our trip home.", "Date": "Feb 14, 2005", "ReviewID": "UR645369430", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "volvo"}, {"Content": "Basic stay for the budget minded I was in Honolulu for 7 days, primarily on business. My needs were pretty basic and the Malia was a good fit for that situation. No frills, just the basics. I only had one remotely negative experience, the first room I was given was really grungy despite the fact that housekeeping had cleaned it. Walls were yellowed with cigarette smoke and the carpet was so stained I'd be hesitant to walk barefoot. I called the front desk to inquire about another room and they were very accommodating. They relocated me to a newer part of the hotel and the room was immaculate. Despite that first hiccup my stay at the Malia was fine. The hotel was quiet which surprised me being that my new room was located right near the elevator. The staff was very friendly and helpful and the hotel is centrally located so everything I needed was well within walking distance. The thing that impressed me the most though was, after accidentally leaving an expensive item behind in my hotel room, I called to see if they would mail it to me. To be honest I didn't think Id ever see it again when in fact it arrived in the mail today. To me thats indicative of the best kind of customer service.", "Date": "Jan 24, 2005", "ReviewID": "UR708406650", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Not to be recommended Arrived off a long flight at midnight with a prepaid voucher for 5 nights in a 1 bedroom suite, night clerk said they didn't have a booking for us but put us in a standard triple room. Next morning they said their reservations centre had declined the wholesalers request as they didn't have 1 b/r suite availabe for the Chirstmas period but could provide one. Changed over to 1 b/r suite, that afternoon front desk rang and said we couldn't have it, would have to change back to standard room overlooking street. Front desk staff not helpful, wouldn't accept prepaid travel voucher, had to pay with our credit card. Rooms overlooking street are noisy, the bedding smelt musty, waited as long as 10 minutes for lift to arrive. Certainly wouldn't stay here again or recommend it to anyone", "Date": "Jan 4, 2005", "ReviewID": "UR126104932", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Reasonable stay for the price   showReview(2771195, 'full');", "Date": "Oct 21, 2004", "ReviewID": "UR464086693", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "If you truly have no expectations for your accomodations in Paradise, stay here!   showReview(2497508, 'full');", "Date": "Aug 27, 2004", "ReviewID": "UR488264932", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Superb Hawaii Hotel go stay!   showReview(2355335, 'full');", "Date": "Aug 2, 2004", "ReviewID": "UR613598984", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "coopertrooper2001"}, {"Content": "Basic, basic, basic but clean   showReview(2351078, 'full');", "Date": "Aug 2, 2004", "ReviewID": "UR885467362", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "-1"}, "Author": "BabsA51"}, {"Content": "Loved the hotel, hated the parking   showReview(2175320, 'full');", "Date": "Jun 10, 2004", "ReviewID": "UR466508854", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Renegade08"}, {"Content": "worst motel ever   showReview(1774715, 'full');", "Date": "Apr 11, 2004", "ReviewID": "UR414840233", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Nice hotel   showReview(1634389, 'full');", "Date": "Feb 6, 2004", "ReviewID": "UR498180259", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "doggar"}, {"Content": "OK for budget hotel   showReview(1541369, 'full');", "Date": "Jan 7, 2004", "ReviewID": "UR277335004", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "We will be back to Malia   showReview(1428529, 'full');", "Date": "Oct 29, 2003", "ReviewID": "UR441620162", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Had a great time   showReview(1151323, 'full');", "Date": "Jul 29, 2003", "ReviewID": "UR735427776", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "璨枫亜鐗┿伀渚垮埄   showReview(22855647, 'full');", "Date": "Nov 17, 2008", "ReviewID": "UR978192834", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "渚垮埄銇牬鎵€   showReview(21366916, 'full');", "Date": "Oct 29, 2008", "ReviewID": "UR456083205", "Ratings": {"Service": "3", "Business service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "锛帮細锛?> 锛帮細锛?</a> </div>"}, {"Content": "鎰忓銇倛銇嬨仯銇?#x201d;   showReview(20742859, 'full');", "Date": "Oct 9, 2008", "ReviewID": "UR338037112", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "2", "Location": "3"}, "Author": "銇傘仯銇?> 銇傘仯銇?</a> </div>"}, {"Content": "DFS銇繎銇忋仹渚垮埄銇с仚锛?#x201d;   showReview(20549710, 'full');", "Date": "Oct 2, 2008", "ReviewID": "UR138852162", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "nyanchan"}, {"Content": "绔嬪湴鈼?#x201d;   showReview(20753287, 'full');", "Date": "Sep 20, 2008", "ReviewID": "UR921317347", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "渚垮埄銇珛鍦?#x201d;   showReview(20130364, 'full');", "Date": "Sep 16, 2008", "ReviewID": "UR103914500", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "mikikimi"}, {"Content": "hotel comodo per le spiagge e mezzi pubblici   showReview(20555267, 'full');", "Date": "Sep 1, 2008", "ReviewID": "UR469873459", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "渚垮埄   showReview(19915255, 'full');", "Date": "Aug 25, 2008", "ReviewID": "UR212426650", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "銈枫儳銉冦償銉炽偘銉昏Τ鍏夈伀渚垮埄锛?#x201d;   showReview(19914895, 'full');", "Date": "Aug 15, 2008", "ReviewID": "UR445935964", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銉偆銈偔銇с伄銇婅卜銇勭墿銇亱銇倞渚垮埄銇с仚鈽?#x201d;   showReview(19171160, 'full');", "Date": "May 17, 2008", "ReviewID": "UR383324129", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "渚垮埄銇с仚銆?#x201d;   showReview(19169085, 'full');", "Date": "Feb 28, 2008", "ReviewID": "UR511987393", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "瀹変尽銇壊銈娿伀鎬濄仯銇熴倛銈娿倐鈥?#x201d;   showReview(19168814, 'full');", "Date": "Feb 17, 2008", "ReviewID": "UR215241887", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銈点兗銉撱偣銇屻亜銇勩€併€併€?#x201d;   showReview(19168643, 'full');", "Date": "Feb 10, 2008", "ReviewID": "UR931802480", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銈枫儳銉冦償銉炽偘銇究鍒╋紒   showReview(19168063, 'full');", "Date": "Jan 18, 2008", "ReviewID": "UR171803684", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "瀹夈亸娉娿伨銈嬨仾銈?#x201d;   showReview(19166215, 'full');", "Date": "Nov 6, 2007", "ReviewID": "UR310086542", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銈傘亞锛掑害銇ㄦ硦銇俱倞銇俱仜銈?#x201d;   showReview(19165566, 'full');", "Date": "Oct 18, 2007", "ReviewID": "UR320200242", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "1", "Location": "-1"}, "Author": "lass="}, {"Content": "渚垮埄銇珛鍦般仹銇欙紒   showReview(19162686, 'full');", "Date": "Aug 1, 2007", "ReviewID": "UR892121233", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "锛わ鸡锛炽偖銉ｃ儵銉偄銇殻銈?#x201d;   showReview(19161951, 'full');", "Date": "Jul 13, 2007", "ReviewID": "UR948588083", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銇倱銇ㄣ亜銇ｃ仸銈侱FS銈儯銉┿儶銈伄闅ｏ紒   showReview(19161717, 'full');", "Date": "Jul 10, 2007", "ReviewID": "UR370545828", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銈儚銉娿儻銈ゃ偔銈優銉偄   showReview(19161641, 'full');", "Date": "Jul 8, 2007", "ReviewID": "UR375359422", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "绔嬪湴鎶滅兢锛?#x201d;   showReview(19161233, 'full');", "Date": "May 29, 2007", "ReviewID": "UR708206075", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "绔嬪湴鈼庯紒   showReview(19160046, 'full');", "Date": "Jan 21, 2007", "ReviewID": "UR591681274", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "楱掋亴銇椼亸銇亼銈屻伆鏈€楂?#x201d;   showReview(19159121, 'full');", "Date": "Oct 13, 2006", "ReviewID": "UR311125527", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "1", "Location": "-1"}, "Author": "lass="}, {"Content": "蹇仼銇粸鍦ㄣ亴銇с亶銇俱仐銇熴€?#x201d;   showReview(19158842, 'full');", "Date": "Sep 18, 2006", "ReviewID": "UR355565902", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "銇亱銇亱锛?#x201d;   showReview(19157691, 'full');", "Date": "May 19, 2006", "ReviewID": "UR855710692", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "涓婃墜銇梾琛屻伄銈勩倞鏂?#x201d;   showReview(19157488, 'full');", "Date": "May 2, 2006", "ReviewID": "UR610721782", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "鍫存墍銇屾渶楂橈紒   showReview(19156300, 'full');", "Date": "Jan 8, 2006", "ReviewID": "UR712206919", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "甯屾湜閫氥倞銇儴灞嬨伀閫氥仐銇︺亸銈屻伨銇椼仧   showReview(19155692, 'full');", "Date": "Oct 25, 2005", "ReviewID": "UR195398909", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "銈儚銉娿兓銉偆銈偔銉汇優...   showReview(21800556, 'full');", "Date": "Oct 6, 2005", "ReviewID": "UR371293660", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銈儚銉?銉炪儶銈?#x201d;   showReview(19154995, 'full');", "Date": "Aug 24, 2005", "ReviewID": "UR660363944", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "DFS杩戣竞銇ㄣ亜銇嗕簨銇?..   showReview(19927205, 'full');", "Date": "May 9, 2004", "ReviewID": "UR168321057", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銇倱銇ㄨ█銇ｃ仸銈傘亾銇儧...   showReview(19924890, 'full');", "Date": "Feb 6, 2004", "ReviewID": "UR305653297", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "甯板浗鏃ュ墠鏃ャ伀锛戞硦銇犮亼...   showReview(19924844, 'full');", "Date": "Feb 4, 2004", "ReviewID": "UR590847734", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銉忋儻銈ゆ梾琛屻伅浠婂洖銇屼簩...   showReview(19922349, 'full');", "Date": "Oct 20, 2003", "ReviewID": "UR954756604", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銉偆銈偔銇激锛︼汲銇殻...   showReview(19918906, 'full');", "Date": "May 26, 2003", "ReviewID": "UR429148614", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銉戙儍銈便兗銈搞儎銈兗銇у...   showReview(19917986, 'full');", "Date": "Mar 28, 2003", "ReviewID": "UR615763219", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g60982-d214685-r22065170-Ohana_Waikiki_Malia-Honolulu_Oahu_Hawaii.html", "HotelID": "214685", "Price": "$186"}}