{"Reviews": [{"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "cardiff", "Title": "“the worst hotel in the world full stop!!”", "Author": "lolaCardiff Posted by an OctopusTravel traveler", "ReviewID": "UR116509640", "Content": "horrible horrible horrible, smelly, rotten, dirty disgusting...yes it was cheap but pay an extra tenner and get something that does not resemble an underground toilet!", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "2.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Tolbert, the netherlands", "Title": "“Smiling faces but poor service and sloppy maintenance”", "Author": "Hans154", "ReviewID": "UR116053980", "Content": "Despite the nice smile of a very australian sounding lady at the desk: don't expect much more in this hotel but two beds. Defective lightbulbs, unsound looking electrical wiring, a chest for clothing just still standing upright, a non-connected television set from the 70s. The free wifi in the lobby came as a pleasant surprise. The payphone in the hotel was out of service and no alternative was offered after my mobile crashed and I had to contact someone urgently. Is this value for money? Undoubtably not, but disturbingly compared to other adresses in London it might prove to be not bad at all.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "2.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“Basic, dated but clean”", "Author": "Preedy62 Posted by an OctopusTravel traveler", "ReviewID": "UR110967628", "Content": "Had read previous reviews expected the worst. Decor was dated, shared bathroom and toilet but these were clean enough. Clean sheets bed comfortable. Only stayed one night any longer it may not be suitable as is basic.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Jersey, United Kingdom", "Title": "“I have travelled for 40 years but”", "Author": "Hugh41", "ReviewID": "UR101841148", "Content": "this is the worst. I would not have put a dog in this room, cramped, not even a chair or a glass for your toothbrush. Take-it-or-leave it attitude from the reception in the hotel next door. The web-site says \" No Frills \". You can say that again. I will be writing to the tourist board. This hotel needs a government health warning on its front door.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Devon", "Title": "“Worst Hotel EVER”", "Author": "EGTESkyGod Posted by an OctopusTravel traveler", "ReviewID": "UR90648701", "Content": "The hotel was terrible... we booked a double room with en suite facilities, we arrived and our room was a TWIN room (beds opposite side of the room) with just a sink in one corner, the 'team' shower was down the corridor. When we went to the reception with our booking information, the staff were rude, obnoxious (French), and refused to give us our correct room without charging us even though it was later found that the price difference between the two rooms was ZERO! We had to pay otherwise we would have had nowhere to stay, and trust me we tried elsewhere. The manager, Mike Chris (a Richard Branson wannabe judging by his self-grooming), was unprofessional, rude, and even walked away from us when we asked what he could do do help us. There were no lifts and they moved us to a room on the top floor with our suitcases and didn't even offer to help. Even when proved to have lied on their website and numerous complaints written we still haven't received our refund for the 'upgrade' that we are entitled to and the emails were going between us for months after. They have ignored me since August. The hotel ruined what was an otherwise excellent 4 days in London and the only thing I would recommend is you stay AWAY from this hotel and its rude, unprofessional, obnoxious and arrogant staff. Please feel free to contact me about this hotel.", "Date": "December 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Swansea, United Kingdom", "Title": "“Terrible - one of the worst I have used”", "Author": "MCNSonholiday", "ReviewID": "UR83281112", "Content": "Arrived at 8pm, the reception staff at the neighbouring hotel (which belonged to the same group) were polite, found my reservation and also showed me to the room. The moment I saw the room I was shocked. The bed sheet looked like it was 100 year old. The heater did not work and the bathroom was just next door. You could hear the person taking a shower at 11pm. Did not sleep all night as people opened the main door and you could hear every conversation and the foot steps from people climbing the stairs. The shower was horrible, no hot water. The only good thing about this place is the location but will never stay here again. I vacated the hotel at 8am although my train from paddington was only at 9.45.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Convenient location. Comfy but very dated facilities.”", "Author": "Devon69 Posted by an OctopusTravel traveler", "ReviewID": "UR58161902", "Content": "Room furnishings & fixtures from the 1970s, but comfortable. Separate bathroom was behind a thin wall next to the room but luckily no-one else used it while I was asleep. Very reasonably priced.", "Date": "March 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "manchester", "Title": "“was ok”", "Author": "wishywashy10590", "ReviewID": "UR47001604", "Content": "not too bad given the location. rooms were really old, felt like someone had maybe died in there. got some sleep though and its on a quiet area and easy to find. not overly clean. female receptionist was very rude.", "Date": "October 16, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "UK", "Title": "“Basic but OK”", "Author": "GentlemanJimC", "ReviewID": "UR35659210", "Content": "Small room with bed, TV, sink, wardrobe and bedside cabinet. Kettle and coffee / tea. Surprisingly quiet at the back. Bar available in hotel next door. Breakfast available - but cheaper options in cafes roundabout - I can vouch for Luigi's in Spring Street. Staff friendly and helpful. Reasonable price Â£35 for a single. Handy for publ;ic transport (tube, bus and mainline rail services) and also an easy walk to central London.", "Date": "July 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Hong Kong", "Title": "“Value for money”", "Author": "Mad4travelHK", "ReviewID": "UR29350248", "Content": "Great location - a short walk from the city. Great value for money - I paid 55 pounds for one night. Rooms are fine - nothing flash. Recommend it if you are looking a well located, value for money spot.", "Date": "May 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Des Moines, Iowa", "Title": "“Feels Like London”", "Author": "Scoots2", "ReviewID": "UR20924925", "Content": "Just what one would expect for a cheap hotel in the middle of London. Oddly, though I had the chance to see two rooms. When I first arrived my room was #3 a tiny room with two twin beds, a shower and sink in the room and a toilet outside of the room but inside an unlockable door marked \"private\". This was fine with me, although I booked a single room with facilities in the room. Off I went to enjoy a walk around Hyde Park only 5 minutes away. When I returned, they had moved my luggage to room #5 for a reason they did not explain. This room had a double bed and a twin bed with shower, bath and toilet all in a room within the hotel room. Both rooms were cozy, clean, old, and typical. The staff was as good as they needed to be. Would recommend to a friend and indeed did to my friend visiting from Holland who enjoyed her stay as well.", "Date": "October 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Llangrannog, United Kingdom", "Title": "“cold shower but okay otherwise”", "Author": "surfergr1", "ReviewID": "UR15210371", "Content": "Clean room, good bed, windows open onto quiet street, not too noisy at night considering location. One shower between 7 rooms is really not adequate and it was cold in the morning. Breakfast okay if you like deep fried eggs, lukewarm beans and burnt then scraped toast. Nice staff. Toilets not so nice.", "Date": "April 22, 2008"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Whose Jenny and Steve”", "Author": "A TripAdvisor Member", "ReviewID": "UR4328923", "Content": "I don't know who Jenny and Steve are, and quite frankly I don't care. What I wanted was a cheap hotel with easy walking access to the centre of London for New Years Eve, and that's what I got. It was nothing special, but was a safe secure place for me to leave my stuff and sleep at night. Only real complaint is that of the 2 single rooms we booked mine smelt baddly of cigarette smoke.", "Date": "January 6, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Good location, nice enough...but cold shower!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4254069", "Content": "I stayed here this weekend and found it to be quite good. The location is excellent and I didn't find it particularly noisy. There are lots of good places to eat and drink round the corner, and transport links are excellent. We had to check in at the reception desk next door and the staff were friendly enough. It was perhaps a little impersonal, but they were certainly approachable and polite. Our twin room was nice and clean with a balcony, an old tv set, and a sink. Our toilet and shower were out on the landing. My only complaint was the lack of hot water in the shower, which was disappointing when we were pleased with everything else about this hotel. I had to have a cold shower first thing in the morning which was pretty bad. Otherwise, I would stay here again purely based on the price and location alone. We were free to come and go as we pleased with very little contact with the owners.", "Date": "December 21, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Christchurch,New Zealand", "Title": "“A cosy home-away-from-home”", "Author": "A TripAdvisor Member", "ReviewID": "UR2496549", "Content": "Our family have stayed in this Hotel with Jenny and Steve a few times over the last ten years and found it quiet, friendly and good value for money. If the hotel has been sold to the people next door I sincerely hope they keep the same standard of service as the previous owners. If not-this is another family who will be looking for a London base.", "Date": "August 26, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sydney, Australia", "Title": "“Goodbye Jenny and Steve”", "Author": "A TripAdvisor Member", "ReviewID": "UR1649929", "Content": "We began the first of many pleasant stays with Jenny and Steve at Fairways in 1987. Discovered it quite by accident and were attracted by the clean smell of furniture polish wafting out the front door. It was our London home-away-from-home. Very sorry to read in the previous review that Jenny and Steve have now retired. Good things always have to end.", "Date": "February 14, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Washington, DC", "Title": "“Mixed Review”", "Author": "A TripAdvisor Member", "ReviewID": "UR1383931", "Content": "Friendly staff but very noisy", "Date": "October 10, 2003"}], "HotelInfo": {"Name": "Fairways Hotel", "HotelURL": "/ShowUserReviews-g186338-d214642-Reviews-Fairways_Hotel-London_England.html", "Price": "$86 - $121*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">186 Sussex Gardens</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">W2 1TU</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "214642", "ImgURL": ""}}