{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pickering, Canada", "Title": "“Beverly Hills done right (at a reasonable price)”", "Author": "pickering4", "ReviewID": "UR127136176", "Content": "My husband, daughter (13) and I stayed at Mr. C Beverly Hills in March 2012. It was a great experience. The rooms are beautiful, the view was great (we booked the premium Beverly Hills view) and the service was wonderful. You can walk to Rodeo Drive and it is in a beautiful residencial neighbourhood. The house car is very convenient and the driver was polite and personable as were all the staff. They sent a welcome gift to the room because it was my daughter's Birthday (very thoughtful). The lounge has board games, backgammon, a small pool table and piano. The drinks are expensive so beware. It is very cozy and welcoming. (Not snooty at all). Loved it...would go back for sure.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Fabulous stay-friendly efficient staff”", "Author": "JAS1663", "ReviewID": "UR126993617", "Content": "Loved the intimacy of this hotel and the location is perfect to access Beverly Hills and West Hollywood. The decor is classically modern with a hip edge. Loved having Mr. C's restaurant downstairs. The housekeeping staff kept the room immaculate with 2 services per day. The valet and bellman were so friendly,professional and helpful. Would definitely stay there again.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent stay ! Excellent location and interiors but really poor concierge services !”", "Author": "VedatM", "ReviewID": "UR126885885", "Content": "Hotel was well located. Very clean and renovated rooms. White and comfortable. The only negative point was the incapability of the ladies working in the concierge to assist us in any of our information requests.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Atlanta, GA", "Title": "“True Perfection”", "Author": "naw5080", "ReviewID": "UR126866269", "Content": "I dont know how anyone can give this hotel a negative review -- I travel to LA frequently and can honestly say Mr.C is one of the most fabulous hotels in LA. The decor is modern and classic, it is comfortable without being stuffy, and its immaculately clean. The entire staff will bend over backwards for you. The rooms are just right for being comfortable and cozy, you enter to a dressing area with closets and a dressing table which has the bathroom off to the right side and the bedroom directly in front. Each room has a private balcony with beautiful views from the higher floors (especially if you are facing the hills away from Pico). Upon entering the hotel you are greeted to a free bellini while the concierge shuffles your bags to your room. The bar is open and conversational, with additional indoor and outdoor seating areas to the side. The drink prices are high, but this is a 5-Star hotel in LA, so they are actually standard. The only con I can think of is that its a bit of a walk from the hip spots in LA, but there is a free shuttle service (in an Escalade) which we used frequently. And once you get your bearings, you can walk to several areas in about 10-15 minutes (including Rodeo Dr.). I never ate at the restaurant, but the entire hotel is simply fabulous. I dont think there is much better in LA or anywhere for that matter. I have turned my colleagues onto this hotel and they all love it too. For all of my travel to LA, Mr.C is my first choice.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Thank you Mr. C you rock!”", "Author": "Billion86", "ReviewID": "UR126563109", "Content": "This was my first trip to Cali and this hotel was awesome in every way possible! Room was great food was great and I didn't have to worrie about my things getting stolen I felt right at home! When I do travel to Cali this is the only place I have to stay at and will continue to stay. Only thing that is missing is a hip and trendy night club on the 12th floor haha :) THANK YOU MR.C BEST HOTEL IN CALIFORNIA !!", "Date": "March 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Charlotte, NC", "Title": "“Great location, fabulous service”", "Author": "flygal89", "ReviewID": "UR126305704", "Content": "Just returned from our SECOND stay at Mr. C Beverly Hills, this time for a full week. My 8-yr-old daughter and I arrived at 10am on March 10, and because of the excellent service we received the last time we were there, I knew there would be no problem with arriving at the hotel early and asking them to store our bags till check-in. I was correct. Upon arrival, we were greeted at our cab by wonderful members of the valet staff...the most fabulous I have ever encountered. They took our bags to storage while we enjoyed Bellinis (a virgin Bellini for my daughter!) at the lobby bar (where the bartender was very personable) and got checked in. So far, so good! Both times we have stayed at the hotel, I have been absolutely amazed by the service of the valet/bell staff. They remember guests' names, and by the end of the stay, they felt like friends. Because we are from North Carolina, we were partial to Brandon, who quickly introduced himself to us as another North Carolinian...making everything seem more familiar. We were waiting for friends to arrive later in the day, but I wanted to get some shopping done on Robertson before their arrival, so I asked if the house car would be able to take us there. Not only did Art, the very warm and friendly driver, take us to Robertson; he told us to call him when we were ready to return. We shopped our favorite places on Robertson and had a late lunch at Newsroom Cafe before calling Art , who promptly picked us up and didn't seem to mind at all when we asked him to make a quick stop at Sprinkles Cupcakes on Santa Monica Blvd before returning to the hotel. Not only did he take us, but he circled the block while we got our cupcakes! Now, THAT'S service! Let me now tell you some important info about location. This hotel is located at the intersection of Beverwil and Pico, which places it JUST outside the Beverly Hills city limits, but it is the perfect location for anyone who wants to explore the city. Walking to the shopping/restaurants of Beverly Hills is several blocks, but easy for anyone in relatively good health, and it's a beautiful stroll! For those who cannot do it, the hotel car is available most of the time to take you anywhere within a three mile radius of the hotel. If you need to go a greater distance, the valet/bell staff is always happy to help you with a cab. We found them to be very prompt. Also, if you need to rent a car for a day or two, I'm sure the hotel can help you. We wanted to take the kids to Disneyland one day, so we just called the Enterprise location on La Cienega, and they were able to pick us up before our rental and drop us back at the hotel afterward. I would like to add that we used the hotel car a lot during our stay, and both Art and Angel, the drivers, were most courteous and friendly. We truly felt like we had made new friends with them before we left the hotel! As for the rooms at the hotel, they are quite comfortable. Every room has a balcony or even two, and we found the beds and pillows to be quite comfortable. We had no problems with noise from other guests, and we were thrilled to find a newspaper at our door every morning. The room we stayed in had only a shower and no tub, but that was not an issue for us. I'm not the person who takes a bath in a hotel, anyway. The soaps/shampoos the hotel provided were good and plentiful, and the towels were good too. The hairdryer in the room is better quality than the one I have at home, and there is an iron/ironing board if you need it. The bar in the room is fully stocked, as well. No complaints at all. I also must commend the housekeeping staff, who did an excellent job of keeping our room clean and neat while we were there. With two 8-yr-olds in the room, it wasn't always easy to keep it straight, but every evening when we returned, we found everything had been returned to order! Because we were on the go during this trip, we were unable to enjoy a meal in the hotel's restaurant. We did order room service one morning, and it was prompt and delicious. If you are a coffee drinker, you will not be disappointed. Just as when we left the hotel last July, we were sorry to leave. Almost everything about our stay was perfect, and we could not have been more pleased. Thank you, Mr. C staff, for another wonderful stay. We look forward to returning and would like to commend the following people on their excellent service: Brandon (valet/bell staff), Emily (lobby bar), Ben (bartender), Joshua Garman (a friendly member of the staff) and especially Art and Angel, who helped us navigate the city!", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pasadena, CA", "Title": "“Amazing and Fun!”", "Author": "Jennifer L Posted by an Easytobook.com traveler", "ReviewID": "UR126283943", "Content": "Perfect hotel to lounge and relax in after a long wedding day! Loved it! Gorgeous view in every room! Everyone must experience!", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chappaqua, New York", "Title": "“Amazing hotel in Beverly Hills”", "Author": "Barbiemom58", "ReviewID": "UR126194714", "Content": "Just returned home from a one week stay at the new Mr. C in Beverly Hills. The hotel is amazing in every way. It's like a bit of Europe in LA. These people DO know how to treat guests and run a beautiful and trendy hotel. The front desk is smart, helpful and professional, but at the same time, friendly. You are greeted in the valet area at your car and whisked away to the long, sleek marble bar in the lobby for a seat and a complimentary Bellini (this is a Cipriani hotel after all). While you sip, someone takes your credit card and checks you in. He then comes back to you (still sipping) with your room key. So relaxing and simple. The rooms are stunning. I was given a high-floor King with every amenity I could possibly need with a view that I am still talking about. On my small but big enough balcony I could see miles and miles into Beverly Hills, West Hollywood, Brentwood, Century City, and even to the Hollywood sign and Griffith Park and Observatory. Wow. The beds are fabulous. The sheets are crisp and luxurious. The decor was uncluttered and sleek - leather everywhere. Mirrors on every wall. No tubs, but huge showers with rain and hand-held heads. There was even a make-up vanity with a leather seat and mirror. Room Service was quick and they never got the order wrong (that's a first for most hotels) - in fact, twice they sent us (my college-aged kids were next door) extra nibbles. Nice. The lobby bar is handled by Emily, a true Southern Belle, who cannot do enough for anyone. The valets are a group of guys who greet you every single time they see you with a smile and a \"Welcome back to Mr. C. How was your afternoon?\" So polite. The concierge desk is manned by Kimberly, a beautiful and trendy British gal who knows just where everything is and is happening. She won't let you eat anywhere that isn't fabulous - she's got your back. The other concierge that I used was Solomon, a warm and smart gentleman who truly cares for his guests and treats them as if they were family in his home. When I had a problem with a restaurant, he told me that he wasn't going to send guests there anymore. He made me feel better about this restaurant and the shabby way that they treated my daughter, son and I. He then made sure that we enjoyed dessert in the lobby on him. Not necessary, but so thoughtful. There is a fitness center with many machines available 24/7. The magnificent rooftop is used only for private events, but any hotel guest can go up there to look around and enjoy the 360 degree breathtaking view. We only ate the restaurant food by the lovely, but small pool but it was excellent. Even the poolboys cannot do enough for you. When my daughter and son decided to move their chaises so to be in more direct sunlight, the poolboy insisted that they allow him to arrange the proper angle, new towels with headrests and a table between. Even my kids were impressed. The restaurant itself is beautiful. With a car, the location is great. Midway to everything. I would stay at this hotel again and again. No other hotel in LA could come close to the care, beauty, and professionalism of Mr. C. A real gem.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Mr C”", "Author": "dcadan", "ReviewID": "UR125185525", "Content": "I've been coming to LA on business & for the odd holiday for over 14 years. I stay with friends more often than not but I've also used several of the \"go-to/must-stay/blah-blah\" hotels here (I won't be mentioning or dissing any of them.) I needed to come back to LA on business this month but decided to extend my stay for a little vacation time too. I'd heard about Mr C & was intrigued by it's locality - it's in Beverly Hills, so it's not surrounded by flashing neon & wide-eyed tourists gasping at their Star Maps - but it's close enough should you be unable to resist the temptation to drive past & point at a house where 'somebody' actually lives! Saying that, if the roles were reversed, I suspect Mr C would be the hotel that those 'somebodies' might drive past & point at. Because it is a GREAT hotel...the best I've stayed at in LA...it feels unique without trying too hard. There is a surprising (but most welcome) lack of pretence here - from the subtly grand entrance & the efficient valets waiting to greet you; to the bar & waiting staff; the reception staff & the exceptional concierge. I don't recall ever being in a hotel, where the bar greets you before the reception desk (or indeed hides it from view) - but on reflection, this seems to be the entire attitude of this hotel. It's like they know that they're cool & fancy, they know that we know that they're cool & fancy but they want you to know that it's cool to be cool about them being cool & fancy - because they think that you are cool & fancy for being there. You are just plain old 'welcome' here (e.g. - I found out that the space-age pool table in the lobby cost upwards of $50,000 but no-one scowls at you for playing on it...it looks like (& is) a work of art but \"it is a pool table, that is used to play pool on!\") The hotel has the feel of a members club, where no-one needs to check your card to let you in. It's friendly, it's cool, it's business & it's family. Oh & did I mention that the C stands for Cipriani? The food is good. The food is very very good. Mr C pizza is the one! If you come to LA often or if you've never been, I can't recommend this hotel highly enough. And I said I wouldn't diss any of the other hotels that I've stayed at here....so I'll veil my thoughts thinly...whatever you've heard, whatever you've been told, Mr C Beverly Hills, is 'More' Seasons.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Good Service From Staff, Immaculately Clean”", "Author": "Faz01", "ReviewID": "UR125052724", "Content": "We stayed at Mr. C in October 2011 for 3 nights. The room was exactly as it is on their website photos. Lovely room which was spacious and very clean, nice leather sofas etc. This hotel gives a personal touch service to its guests, for example the manager himself welcomed us and showed us up to our room and drinks offered on arrival. The Concierge staff gave us an excellent service, booked our restaurants, taxis, and universal studio tour etc. The bed is turned down for you and the newspaper is always delivered in a little cotton bag hung on the door. Very polite courteous staff. On the down side there are no tea and coffee facilities in the room. Food and drink are typical five star prices, we had breakfast in the restaurant for two people which cost just over $50 - I think it was $7 for a cup of coffee (small). In the morning the hotel do put out some complimentary coffee which you could go down and get to bring back to your room but we only found out about this on the last day. In terms of location this hotel is in a residential area and NOT near any tourist type of places if that is what you want to do - i.e. hollywood/sunset boulevard/universal studios/Downtown LA etc. Rodeo Drive is about 15/20 minute walk but the hotel really is located in a residential area - so be warned as taxi fares can start adding up - there is a house car which takes you within 3 miles of the hotel but this is not always available. We ate at STK in West Hollywood - food lovely, typical five star prices. We also had dinner at the Beverly Wilshire hotel and got a window seat looking onto Rodeo Drive. I was extremely disappointed with the food - I think they just re-heated the mash potato the food was very, very average and not of a high standard. We went to downtown LA and ate at the nickel diner - I had an avocado dish, it was delicious and soooooooo cheap. We didn't feel very safe in downtown LA probably because we have never been before and ventured down some dodgy blocks, needless to say we swiftly turned back. Also went to Universal Studios for the first time and thought it was brilliant. Overall lovely, clean hotel with very polite courteous staff.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Buffalo", "Title": "“Nice restyled boutique hotel”", "Author": "LaurenBuffalo", "ReviewID": "UR125037341", "Content": "Well redesigned hotel with great service, nice rooms, and a enjoyable restaurant.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "NJ", "Title": "“Great value, sleekly designed hotel in a good location with very helpful friendly staff”", "Author": "diane100", "ReviewID": "UR125010310", "Content": "I was pleasantly surprised at my recent stay with my 14 year old daughter for her President's week vacation. I booked it through Magellan vacations a few months prior and actually had a rate DROP since my initial booking to $250 per night for a city facing double on the third floor. This was an amazing value. The beds were incredibly comfortable, likened to Marriott bed quality. The decor was chic modern. The room had a flat screen TV and a small but beautiful bathroom with rain shower head and hand spray. Very beautifully designed. I will say that I found it odd that there was absolutely NO drawer space? Yes a closet but no drawer space. That would be my only criticism. Otherwise the hotel was wonderful, and the concierge Kimberly literally planned and booked this entire trip from restaurants to tickets to cirque de soleil, To surf lessons for my daughter, and the itinerary for touring Malibu and Santa Monica as well as The Paramount Studio tour and universal studios tour as well as arranging a rental car. She was excellent and booked most of this before my arrival. I am very grateful for her help as I could not have done it myself. We have great memories of the trip. And thanks to Kimberly we really made the most of our stay.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“A perfect weekend at Mr. C in Beverly Hills”", "Author": "Renee P", "ReviewID": "UR124678911", "Content": "This review is for both the hotel and the restaurant. It is hard to separate the two as we pretty much spent our entire weekend at this wonderful facility. This is easily the best time we have all ever had in LA. Four of us gathered for a girls weekend of shopping and dining and I chose Mr. C due to the location and the photos on the website. From the moment we walked into the lobby we knew it was the right choice. The friendly and accommodating manager, Richard, greeted us and offered complimentary bellinis in their gorgeous airy lobby bar. While we sat and chatted, Richard handled our check in process. He returned with our keys and escorted us to our spacious, beautiful rooms - both with amazing balconies. We were having so much fun at the hotel we decided to give the restaurant a try. Again, the minute we walked in we were warmly greeted by the manager, Eric. He was the perfectly charming host for our evening. Our waiter, PJ, was helpful and proficient yet very personable. All of us continually commented that everyone seemed to genuinely enjoy working there. The food and service were amazing throughout. As gals, we like ordering appetizers and then will maybe split an entree or two. They accommodated us generously and without fuss. We ended up staying at our table for over three hours just having a great time catching up. When Eric noticed we hadn't ordered dessert, he treated us to delicious crepes - flambÃ©ed tableside. Though we had reservations elsewhere the next night, we cancelled and chose to return to Mr. C's restaurant again. And the 2nd dinner was just as amazing as the 1st. Mind you, this was Grammy weekend and the Grammy host - LL Cool J - was also hosting a big party at the hotel. We had no reservations but they carved out a perfect table for us and treated us like royalty - even though the place was full of celebrities. Again service and our meal were perfection. This time, dessert was a piece of white cake - something I would never order - yet it was heavenly. Again, we pretty much parked ourselves at the table until closing. The next morning, we didn't want to leave so we headed to our favorite lobby bar where the adorable Ben made perfect cappuccinos and mimosas. Richard, the manager, checked on us throughout the weekend to make sure our every wish was accommodated. All of us agreed, they were. It really was a perfect weekend at Mr. C. If you go, I'm confident you will have an amazing experience.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Amazing Service”", "Author": "Sneeker635", "ReviewID": "UR124625547", "Content": "The number one thing that stuck out at me was the amazing service from every single person who worked at the hotel. From the bar tender, to valet, to front desk, they all were on top of their game. I have to say the valet is one of the best I have experienced in town. They were by far the quickest at bringing my car up than any other hotel in the area. The rooms were nice, nothing amazing but still very nice. The bed was very comfortable, got a good nights sleep every night. The bathroom was good, with a rainfall shower and 2 sinks. There was no bathtub, just a walk in shower. The one thing I did not like was the hardwood floors in the room. You could hear the people above and beside you whenever they walked. It wasn't a huge deal but that would be the only negative about the stay. A few other random things...The location was great with easy access. There is a grocery store and starbucks across the street so you have everything you need within walking distance. Parking is $35 per day but that is about normal for any hotel in Beverly Hills. The complimentary wifi was a nice bonus though.", "Date": "February 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Beautiful”", "Author": "KAOSMUA", "ReviewID": "UR124202274", "Content": "Great stay, amazing service, The room that was assigned to us wasn't ready upon arrival (we arrived late morning), so Richard found us another room immediately. Merci Richard, et bonne continuation! The service was always good, when ordering room service, or just calling a cab, offering us water for the road. Coffee was very expensive (7$ for a small cup of cappuccino that wasn't that great), so we walked down the road for breakfast the next day. I would recommand this hotel anytime! The room was big, comfortable, we were near the elevator but didn't hear a thing! Great balcony.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“They brought the restaurant to our room”", "Author": "PurdieParks", "ReviewID": "UR123904722", "Content": "We arrived to the hotel late and after 24 hours of travelling were too tired to get dressed up and head to the restaurant. So we showered and then ordered room service. It was amazing, when it arrived two waiters brought this large round table into our room, with the heated trolley under the crisp white table-cloth. They served us dinner the way they would in the restaurant (having been to the London branch many times). It was funny for us, sitting there in a bath-robes, perching on the end of the bed, eating this 'posh' meal! We slept so well and woke up early the next morning to see the sunrise over LA. We took the lift to the top floor and went out on the balcony. It was beautiful. We had to depart early the next morning, but I was keen to see the pool, it hadn't been opened yet, but the staff where happy to open it up early for us to have a look. I really enjoyed our short stay there and hope to return again for longer.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Loved Mr C”", "Author": "BUbear81", "ReviewID": "UR123576471", "Content": "We loved staying at Mr C! The staff was wonderful, and they went out of their way to be helpful. Room was very comfortable and very nicely decorated. Balcony allowed us a very nice view of the Hollywood sign. There was an event at the hotel one night which was great for people watching. Hotel has a driver and car to take you anywhere within two mile radius. It's not available to reserve, though, and so sometimes it wasn't clear who was actually waiting first for the car. The head bellman could have done a little bit better on this. We will return to Mr C next time we are in Los Angeles.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "A Citizen of the Globe", "Title": "“So good, I would move to Mr. C's permanently!”", "Author": "Ultraplur", "ReviewID": "UR123319654", "Content": "Staying at Mr. C's was a very refreshng reminder of what impeccable execution and attention to detail can do. I selected Mr. C's at the recommendation of a friend, who is a regular n the Beverly Hills area. After looking a the past reviews and the hotel's website I decided to book a premium Beverly Hills view room on a high floor. Before arriving, I received an email from the hotel's concierge, offering assistance with airport transportation and other arrival details. I have to say that the concierges at Mr. C's are among the best I've ever interacted with. Not only are they very corteous and professional, but they are well connected, experienced and effective. They fond the perfect solutions every time, from renting a Fiat 500 to getting me on the guest list of a popular night spot. A big recognition to Solomon in the concierge desk! The valets and doormen are equally effective and very elegantly appointed in non-ostentatious but classic Barbour jackets. The hotel lobby takes you straight into the main bar, where I was treated to fantastic bellinis. So good that I went up to my room after 45 minutes of arriving! The bar and lobby scene is relaxed, refined and dressed up in an Italian/bauhaus design mix, with the friendliest bar servers that you can imagine. There is an outdoors terrace on the bar, which is perfect for an ever more intimate experience. The hotel's reception is cleverly hidden behind the bar, so that at no moment do yo feel in a hotel. I always felt as if arriving to a friend's apartment. Very cozy and welcoming! I used the hotel's gym several times and it is very well equipped with cardio and weights although it is on the smaller side and I could see it crowding up on peak seasons. The hotel's pool is next to the restaurant! which makes the entrance a bit intimidatng at lunch time, however, it is ver cutely arranged and I would really like to come back in the summer heat to dip in and enjoy more bellinis there. My room had a striking view to Beverly Hills and Hollywood. I slept with the drapes open as it was impossible not to fall in love with the sight. Very quiet day and night, although I can imagine that rooms facing the city side on West Pico Ave. must be noisier. The rooms are all very elegantly decorated in a matching blend of French riviera, sea-side villa and Italian country side. You experience wood, leather, pastels and rich fabrics. Very complete mini-bar (including intimacy and healing kits!), iPod compatible stereo, flat screen on-demand TV with movies and very fast and free wi-fi everywhere. My room had a small terrace that I used for breakfast and after work drinks. Fantastic!! I could live here!! The restaurant was the best part of my stay. Although not as popular as I would have expected for a Cipriani property, the service, quality and value are truly remarkable. I felt as if dining in a high end place in Rome. Truly, something else! from the proseco to the slow roasted chicken, I very much enjoyed breakfast, lunch and dinner at Mr. C. All in all, Mr. C's is an excellent representation of a luxury boutique hotel. It is discreet, elegant and powerful. Just what I like! I will surely be back!", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Little Rock, Arkansas", "Title": "“Hoteliers should stay here and take notes!”", "Author": "LRWanderlust", "ReviewID": "UR123316378", "Content": "One of the best hotel experiences I've ever had. Welcoming staff, immacutely clean room, beautiful, comfortable, great location, great view, great food. Can't wait to return.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Shocker”", "Author": "Alex L", "ReviewID": "UR122771482", "Content": "Once we got there the TV was not working. So we had to swap room and that seems very difficult for the hotel. The Bell boys and the drivers was very good. But When ever we asked for something it took them a while to take bring it. But the worst problem was that there room was very dusty meaning that the room was very dirty we found this out as we kept sneezing and once we moved to the Bellagio the sneezing stopped.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great Location and Beautiful Rooms”", "Author": "WorldTraveller674", "ReviewID": "UR122681692", "Content": "We stayed for 4 nights in December. We had a great room on the 8th floor facing Beverly Hills. The hotel is stunning throughout and everything is beautifully consistently branded from the bathrobes to the towels to the room key. Positives - Check in was swift and done at the bar with a refreshing cocktail - Rooms are immaculate and furniture is chic and music is played when you first enter the room - Free Wif for guests - Great location and easy access to restaurants nearby - Car Valet was quick and friendly - Informative and friendly concierge Negatives - Bathroom is very small for 2 people and there was no bath - There are only 2 lifts to service the entire hotel, therefore expect long waits - Walls are thin and you can easily hear other guests", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New york", "Title": "“CIPRIANI is ready to open more MR C”", "Author": "Travelerwell", "ReviewID": "UR122527730", "Content": "Finally an hotel with chic and european elegance from the moment i was greeted by the valet thru my entire stay . This is the real deal , impeccable personal service, fantastic north of italy cuisine with the CIPRIANI freshest ingredients.Great crowd. Very knowleagable and helpful concierge and front desk. The room are decorated with pure italian taste, leather, leather and leather, marble bathroom and breathtaking view of LA from our balcony, very refined and confortable bed. but what made the best of my stay was the people, truly Cipriani style !", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Huddersfield, United Kingdom", "Title": "“Fabulous hotel in a great location but some things expensive”", "Author": "LouiseandIan", "ReviewID": "UR122363493", "Content": "We arrived to the hotel and found that Expedia had not passed on the details of our reservation properly to the hotel so we found ourselves with the wrong type if room so be careful of booking with Expedia. Having said that the hotel did everything to out it right. The hotel is a great place to explore la however food and drinks and parking are too expensive, more even than the Mondrian which spoilt an otherwise great time. I would stay here again.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Stunning rooms, great location, great service”", "Author": "Dora C", "ReviewID": "UR122195482", "Content": "The rooms are beautifully furnished and are exactly as they look in the pictures. The staff were super friendly... we arrived early and they were able to accomodate us and even upgraded the room. Its about a 5min walk to the strip of shops and restaurants in Beverley Hills. I had breakfast in the hotel restaurant and the wait staff was wonderful and the breakfast spread I ordered was incredible (but pricey). Our only complaints were the lack of service elevators (causing long waits and frequent stops) and the tapping from the wind blowing on the patio doors (which we thought was our neighbour walking around, until we realized the real source of the noise right before checking out!). Also, we ordered a room service Margherita pizza and it was expensive, small and not very tasty.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Your own Don Draper meets Hollywood experience....”", "Author": "sambieni", "ReviewID": "UR121989810", "Content": "...at least thats the vibe they are going for. The rooms were good sized, very clean, comfortable, and fun . My wife loved the vanity. Very comfortable, large bed, good sitting area. Lots of little details and all in all came together. We initially had a city view room, but relaly all we could see was the stripmall across the way. We asked to be moved and got upgrade to a Hollywood / Beverly Hills view room - much better. On a clear night or day you can see all of the hills, etc... this is where you wanna be. Great view and amazing having breakfast on the deck. The hotel was overall a fun and great experience. It definitely is pricey in all aspects. And service is good if not a bit over the top trying at times. But definitely recommend for a fun weekend for romance or group getaway.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Worst restaurant ever - avoid this place!”", "Author": "Jpresskin", "ReviewID": "UR121872395", "Content": "This new boutique hotel is the location is where the new Mr. C restaurant has opened and should close immediately. DO not confuse this place with it's New York counterpart (which is good) This pretentious Italian restaurant serves lousy food and is an insult. The fish tasted likes Swanson and the rolls and salads were not edible. The tables and chairs are built for small children. There is not enough elbow room to move without knocking over drinks and dinner plates on one another. Management was used to this happening and simply put a dry table cloth on wet tables. Bad food and a very uncomfortable night. The meal was $375.00 with 2 cocktails and one deserts. Immediately after leaving we got burgers and fries because we were starving and all very upset about the experience and the treatment. I left my card with the manager as we left and asked that someone contact me the next day for an explanation. - No one called. I have called two times since and no one will return my call", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Spectacular”", "Author": "Axs1559", "ReviewID": "UR121341114", "Content": "Excellent hotel. Outstanding staff. The service is the best I have ever experienced in any hotel, anywhere in the world. Particularly housekeeping and concierge. Bar staff offered me suggestions on what to see in LA in my spare time. Completely refurbished June 11 and is immaculate and furnished to a very high standard throughout. The West Pico boulevard runs next hotel (and the outdoor pool is on this side) so there is some traffic noise, but this is not too bad.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“I love this hotel!!!!!!”", "Author": "mmmgem14", "ReviewID": "UR121337852", "Content": "What a great hidden gem. I love this hotel. The service, the food the decor!! Its all there. I can't wait to go back. BTW Solomon was so amazing, great concierge, he gave us all the scoop on where to shop and see the stars!!", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Very impressed!!”", "Author": "BigJimDevine", "ReviewID": "UR121053587", "Content": "We stayed on the 4th floor facing the road in a standard (deluxe room). The rooms are very nice, hardwood floors, very clean, extremely comfortable beds, good size rooms, 42\" tv, iPhone charger, complimentary bottled water, nice balcony. The staff are very polite, the concierge was particularly helpful. Yes there is a bit of road noise With the street facing rooms but the balony door are very effective and it didn't effect our sleep. Being located on Pico boulevard it easy has access to the Big Blue Bus which takes you to Santa Monica Pier (no.7 bus). Walking distance to restaurants, pharmacy across the road, supermarket 200 meters down Beverly Dr I got a great deal through Expedia paid 40% off which made our stay great value, I didn't use the restaurant or pool during our stay", "Date": "November 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Charming, first class service with Beverly Hills luxe”", "Author": "Tbinozz", "ReviewID": "UR120898490", "Content": "Stayed at Mr C in the last week first for 4 nights then another night at the end of the week. The hotel is superb and immaculate. We were looking for a boutique hotel and something with more personal service. We couldn't have been more pleased. On arrival into the smart grounds we were immeidately greeted and invited in to the hotel lobby which is actually like steping into a bar / lounge. No waiting in line, no filling out forms, We were offered a cocktail, a very comfy seat in a leather lounge and a relax while the hotel staff sorted out our room. The room itself was well appointed, modern with a touch of the old Hollywood and very comfy. Beds are gorgeous (e hd a twin room). We opted for the Beverly HIlls view which for us was well worth it. Good views, greenry and it really felt we were away from the bustle of LA. What really makes this hotel though is the service. The conceirge is fantastic - great recommendations, friendly and approachable. There is also a free car servie within 3 miles of the hotel which was fantastic. Frances our driver has been in the business for years and was a real pleasure to deal with. What's clear about Mr C is that the hotel cares about its customers and its staff. It is building a brand, uncoupled from an impersonal chain, and that is exactly what I love about it. I wouldn't stay anywhere else in LA.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“serious hotel room design flaws”", "Author": "ywgtravellers", "ReviewID": "UR120708603", "Content": "I just want to preface this review with the fact that we are regular travellers and only stay in 4 or 5 star hotels around the world. We typically travel every month and usually stay in hotels like the Four Seasons and luxury boutique hotels. The opening of Mr. C Beverly Hills intrigued us and we therefore booked ourselves a weekend away. Check-in was quick and easy (with a complimentary â€˜Belliniâ€™ in the bar) however, it took quite some time for the bell boy to bring up the luggage even though the hotel appeared to be not very busy. Several other guests spoke of a similar experience over the weekend. The rooms are decorated very nicely and come with complimentary Wi-Fi and bottled water. Our only concern was the noise level. We requested and were given one of the quieter rooms (facing the hills) which was quiet with respect to street noise. Design details of the hotel however resulted in the room being quite noisy. Rooms are fitted with hard wood floors that echo footsteps from above. It seemed to never end. We heard kids jumping and running around and the clicking of shoes throughout our stay. Voices, TV noise, and music reverberated through the walls. In addition, guest room doors are large and the sound of slamming doors can be heard up and down the hallways day and night. We ended up stuffing towels under our door (as the gap is quite large) but this did not insulate us from the almost constant noise. On the second night of our stay there was an engagement party in the 12th floor banquet room that had a DJ playing music until 3am. The music could be heard all the way down to our 9th floor room. Management were quick to apologize and ended up not charging us for one night and agreed to move us to a quieter room. The second room ended up being no quieter. By far the best part of our stay was the restaurant. Staff were friendly and attentive. Although we were usually the only couple having breakfast, the place was jammed at dinner. The food and service was fantastic but again the noise level was uncomfortably loud; more like a sports bar. Clearly the place is full of locals at night and on the weekend as everyone seemed to know each other. In the end it was a good stay, however next time weâ€™ll be back at the Four Seasons or Lâ€™Ermitage. By the way, Mr. Jagger (the manager) and Mr. Cipriani (the owner) were in town and were around all weekend. Mr. Cipriani held court in the restaurant each evening. I mentioned to the front desk that weâ€™d like to meet with either one to give them some feedback, as Iâ€™m on the Navigator Panel with Conde Nast Magazine, but they did not bother to connect with us.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "westchester county, NY", "Title": "“A lovely, quirky boutique with outstanding service”", "Author": "tuckie", "ReviewID": "UR120613730", "Content": "It's rare that you stay at a hotel that you actually feel happy to come back to after a long day....but Mr. C fits the bill. It's mostly about the extraordinarily warm service, but it's also the small scale of the hotel. Excellent service comes in many forms. I usually stay at the Peninsula when I'm in LA and their service is certainly excellent as well, but it's different at Mr. C. At the Peninsula or the Four Seasons the service is discreet, professional, efficient....all of the superlatives you would expect but it can also be a bit cold and distant. Now don't get me wrong, I usually appreciate this....I'm not staying there to make friends....but at Mr. C it's quite different. The staff somehow makes you feel genuinely welcome and part of their small community without seeming artificial or obsequious. The small scale of the hotel adds to the feeling of intimacy. The public spaces and the rooms are quite small but are beautifully appointed and met all of my needs. The term boutique hotel is bandied about quite a bit nowadays but Mr. C really is a boutique....a small, bespoke gem that is a great contrast to the larger, more corporate hotels in LA. Mind you, that may not be for everybody. Many business travelers will complain about the lack of an in-room coffee maker and many leisure travelers will complain about the lack of a bathtub. And everyone will probably dislike the location....it's off the beaten path and is on a busy street. But I loved it, quirks and all...for it's personality, it's style and for the very fact that it offers a different experience from other top hotels in LA. Bravo!", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Montreal", "Title": "“Mr. C gets an \"A\"”", "Author": "MontrealCampobasso", "ReviewID": "UR120468509", "Content": "What else can you say. First class accommodations and service. Downside, traffic noise somewhat of an annoyance, depending on what side of the building your room is on. Everything else that you read in the other reviews is spot on. This is not your starchy high end hotel, the \"C\" has magic, charm, and panache. Highly recommended.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "california", "Title": "“Exceptional service”", "Author": "rogerad", "ReviewID": "UR120362538", "Content": "My partner and I went to LA on business for two nights. To our surprise, we felt like we'd taken a vacation to Venice or Rome. The moment you step off your car, the service, style and vibe of this place is European. Extraordinary care and attention is given to you. We will definitely come back. I had several meetings, but kept wanting to come back and hang out at the restaurant and bar. Every staff member is extremely conscientious. I showed up dressed like a slob - and they still treated me like a king. We went back to our room late at night and had problems opening the door to our suite. While maintenance took care of the problems they comped our drinks at the restaurant. They obsessed on all the details - and you feel amazing staying in this place. I highly recommend it.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“A little Gem!”", "Author": "Emma S", "ReviewID": "UR120249142", "Content": "Had a fabulous trip to Mr. C. The staff were wonderful, very helpful at all times. Check in with a Bellini, house car to use within a 3 mile radius and late check out, they did everything to help us!! Loved the glass pool table, very unique! Great views of the hills and the 'Hollywood sign' from our balcony. The rooms were gorgeous. This is very good value for money staying in a lovely part of town. Choy (spelling?) was extremely helpful. We will be recommending this hotel and will be back for sure! The restaurant is very good also! When they did not have what I wanted it was no problem, they made it for me. Go to Mr. C., it's a hidden Gem!! Xxx", "Date": "November 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“LA Chic in Beverley Hills!”", "Author": "SimonLiebel", "ReviewID": "UR120152088", "Content": "Finally Cipriani comes to LA in full force. This hotel is uber cool. Instead of the boring reception check in you sit down at the bar, order the classic Bellini and wait for all the work to be done for you. The restaurant has all the classic Cipriani favourites and the staff as expected are impeccable, friendly and attentive. You might spot one of the Cipriani family descreetly ensuring the guest experience is nothing short of perfect! IF you are young, hip, cool and want to be seen in the place to be seen! Mr C Beverley Hills is the place to be!!!", "Date": "November 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Naples, Florida", "Title": "“Housekeeping Excellence”", "Author": "susan o", "ReviewID": "UR119813778", "Content": "I had a lovely weekend at Mr. C of Beverly Hills! I was greeted on Friday night by friendly and sophisticated staff in the parking lot before I even went through the front door. Once in, I did not wait in line but was shepherded to a lovely chair in the lobby, offered a Bellini while my checkin was taken care of by a delightful young man. The room was spotless and the bed incredibly comfortable with great pillows. The one thing that I sincerely request that could make a significant difference, is in-room coffee makers! Bad enough that I had to sneak down to the lobby (versus $$$ room service coffee) for a cup, but on Sunday AM both carafes of coffee were empty and I waited about 10 minutes and that was after asking both the front desk and flagging down another staff member for a refill. My friends, staying in another room, agreed that the absent in-room coffee was a major inconvenience. One of the best parts of my stay was after I returned home! That's because I had forgotten to pack several garments from a drawer in the hotel room. I called Housekeeping in a panic only to be calmed by Christina. Christina (I hope that's the right name) explained that they had found my clothes and asked me how I wanted them returned. Within a few days they were returned to me in FL! Thank you, House Keeping! Overall, I rate Mr. C a strong 9!", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Birmingham", "Title": "“Good - but missing something”", "Author": "neilg23", "ReviewID": "UR119802261", "Content": "Ok , the good. The room was lovely and well finished with quality furnishings. The staff were all very friendly & helpful, so well done team. The pool area and pool service very nice. On the downside - we were on the 10th floor in a suite with a lovely balcony the, street noise is noticible, however don't worry too much as with the doors closed there is no real problem and rememeber you are in LA.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Lausanne", "Title": "“Good hotel, however very noisy due to poor windows”", "Author": "Midouille", "ReviewID": "UR119691503", "Content": "This hotel is very nicely decorated, the service is impeccable, and the location is very good. However, we had a room on Picco Boulevard, and the floor-to-ceiling windows are very inefficient in terms of noise-proofness. We have spent the two nights with earplugs as we felt we were sleeping on the boulevard. I suppose if you take a room facing Beverly Hills, this is not as much an issue - this would be my recommendation if you want to fully enjoy the nice hotel and beautiful new furniture.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rabconn64", "Title": "“Top Class in Every Department”", "Author": "Rabconn64", "ReviewID": "UR119628916", "Content": "We stayed at Mr C's for two nights during our trip to California in early September. The hotel can only be described as Top Notch!! Nothng was any problem to the immaculate staff team and the Scots bartender was a wealth of information. Ths is the finest hotel I have ever stayed in, the rooms are superb and the location is fantastic.", "Date": "October 23, 2011"}, {"Ratings": {"Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "coronado", "Title": "“Mr C Restaurant Beverly Hills”", "Author": "CoronadoCarol", "ReviewID": "UR119271969", "Content": "I intend to write a review of Mr C Beverly Hills Hotel, but their restaurant deserves a separate review. It was wonderful. The place is beautiful, and the service is gracious. Not the usual hotel restaurant--we could easily have been in Italy. The halibut with artichokes was fresh and delicious, accompanied by a \"rice pilaf\" made with an arborio-like rice that we just loved. The homemade ravioli with ricotta and black truffles was outstanding. We don't usually eat dessert, but were persuaded to try the vanilla cream meringue and cake, and wow ! It was one of the two best cakes I have ever had--in my well-travelled and long life--(the other one was the Ivoire Royale cake at Extraordinary Desserts in San Diego). Don't miss this restaurant, whether you are or are not staying at Mr. C Beverly Hills !", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Tonsberg", "Title": "“5 Star hotel? - 5 star service!”", "Author": "Dr_Nico", "ReviewID": "UR118952774", "Content": "Fantastic service at this hotel. Rooms are clean and spacious, but the bathrooms lack ventilation. Downside? Noisy and lack of soundproof doors. That is a problem that shouldn't exist at a 5 star hotel. Wifi system is also so slow and unstable. Need to be upgraded to fit a hotel at this level. Location is really good, but the pool is microscopic for a hotel that has 5 stars. Restaurant is good but overpriced. Will be back if I get a good deal.", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Wonderful albeit slightly out of town”", "Author": "jckelly09", "ReviewID": "UR118866511", "Content": "We stayed in a deluxe room with views of Beverley Hills. The staff were excellent from start to finish, welcoming,warm, professional and friendly. On arrival we received a delicious complimentary Belini and everything was taken care of. The rooms were fantastic, large, bright and very well furnished with quality Italian products throughout. Some members have raised the food as an issue but we thought it was well presented and tasty with excellent staff, both for breakfast and dinner. We will return asap! Thanks for a wonderful stay", "Date": "October 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“great service, great experience”", "Author": "baros2010", "ReviewID": "UR118833182", "Content": "I lived many great hotels. I have to say that the experience of living in Mr. C Beverly HIlls is the best. I checked in the hotel tonight. When I drived the car to the entrence. The waiter asked my last name. He quickly knew my reservation and arranged everything. A handson boy accompanied us to a bar to ask something to drink. Then he helped me to check in. I even did not know where the frontdesk is. I lived in 8 floor.yu8i-o90.p/;_When I entered the room. There is a box candy and a card for me. The room is with music. The view of room is so great. You can see the whole view of the hill. great service and great experience. Haining", "Date": "October 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“The Best Hotel that the Los Angeles Area has to Offer”", "Author": "ALo214", "ReviewID": "UR118442728", "Content": "This was my fourth trip to the LA area in a span of 3 months and one of my longer stays. I had stayed in two different hotels previously (the W in Westwood and the Hilton Checkers downtown) and neither could even be compared to Mr. C's Beverly Hills in terms of facilities, rooms, service, and staff. I checked in late night at around 2AM. Usually, at that time of night at other hotels, the staff is difficult to find, however both the valet and the front desk were ready and waiting for us upon arrival. The bar was in the process of closing and they even went out of their way to provide two complimentary drinks for my guest and me. I believe it was the night manager himself who checked us in and he did an amazing job coordinating with the night staff to make us feel right at home. The rooms were impeccably clean and I think each room has its own balcony; our room had a view of the hills from the 8th floor. When we first entered the room, the lights were dimmed with soft music playing in the background - a very classy touch. The furniture was all leather lined with contrasting trim, giving the room a luxurious, yet clean and homey feel. We ordered room service a few times (both during the day and on a late, late night) during my five night stay and the service was prompt and nicely laid out each time. The club sandwich is a must try. This had to be one of the few trips I've taken where I have had no complaints about where I was staying. I highly recommend Mr. C's Beverly Hills to anyone staying in the Los Angeles area.", "Date": "September 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Simply Fabulous!”", "Author": "David S", "ReviewID": "UR118372995", "Content": "My wife and I recently stayed at Mr C for a few days on the first part of our honeymoon. We had previously stayed when the property was known as The Tower and thoroughly enjoyed that stay. From the moment we pulled into the driveway it was clear what the vision for the hotel was - Not only is the property itself beautiful but the warmth of hospitality shone through in abundance. Complimentary cocktails at check in and complimentary Champagne for the honeymooners certainly were an unexpected but welcome suprise! Nothing was too much trouble for anyone. We were personally shown to our room - not something i have experienced before even in luxury brand hotels - and when the door opened we were truly stunned at the quality of the room and the amenities. I'm not normally one for writing reviews but felt that we had such exceptional service, in such a beatiful hotel, that it was more than worthy of my time to write this. We have stayed in luxury hotels across the globe and this is currently number 1 on our list of places to stay. Without doubt this is the only place we will be staying in LA in the future.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "4", "Overall": "2.0", "Value": "3", "Service": "5", "Rooms": "3"}, "AuthorLocation": "California", "Title": "“Noisy”", "Author": "ConcernedCalifornia", "ReviewID": "UR118049023", "Content": "The service was excellent and the room looked very nice, but the bathroom was small (with a good shower). The room was not quiet. The room had simulated (or maybe real) hardwood floors with thin rugs. This did not absorb sounds, but was reflective. The doors to the hallway had nice, solid secure locking systems, but were very noisy when the doors were closed. The noise would ricochet down the hallway and was heard several rooms away from the offending door. It was like having the door to your room slammed very loudly (the vibrations could be felt). GREAT PLACE IF YOU ENJOY NOISE!!", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "chicago", "Title": "“Beautiful Hotel with 5 Star Service”", "Author": "hollingster", "ReviewID": "UR117832986", "Content": "My husband and I just returned from a long Labor Day weekend stay at Mr. C. As others have mentioned, the hotel is very new, opening earlier this summer. We were upgraded to a beverly hills view, which was a nice surprise. The room was very clean, large and beautiful, and we enjoyed drinking our coffee and reading the complimentary newspaper on the spacious balcony each morning. The location was very good; it was quiet, yet within a 10 minute walk up the street, there were a number of places to grap coffee and lunch/breakfast if you wanted something other than the very conveniently located Coffee Bean on the next corner from the hotel. Rodeo Drive was only a bit further of a walk. Freeway access was also very convenient. We didn't use the pool area much, but it was lovely, spacious and private. The workout facility was well equipped; the only negative being that is located in the basement with no windows to sunny outside; but it is more than sufficient to get a good indoor workout. The staff -all of them - were extremely friendly and went out of their way to ensure that we had a wondeful stay. The service was personal while granting us our privacy. This is a true 5 star hotel with matching 5 star service. We definitely would recommend this hotel and stay again at it next time we return to L.A.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Singapore", "Title": "“Service is the Highlight”", "Author": "Lizhe", "ReviewID": "UR117335154", "Content": "The hotel's staff and their enthusiasm in making our visit comfortable is the highlight. It wasn't the perfunctory, robotic service but one with warmth that made the hotel stand out. I was visiting LA to attend a wedding and opted not to rent a car so the complimentary car service (within 3 miles radius) was a key benefit. Drivers Francis and Angel were a big plus. Besides the good service, the room and particularly the bed was comfortable. There were enough electrical outlets for all the gadget recharging we needed to do. Wireless internet charges are inclusive (aka \"free\") in the rate - one of the reasons I opted to stay here. The location is good if you want to be in the Beverly Hills area - LA is so spread out that no one location is likely to meet all needs. My husband also liked the comfortable patio areas, especially off the lobby, where he could smoke his cigars. Regarding other comments about guests' dressing - it was only dressy in the evening/night and most guests were in shorts & t-shirts during the day. Concurring with other comments, however, the main drawback was the high cost of the meals in the hotel's restaurant. While the quality of the food (excellent pasta) and coffee (European standard) are high, we felt it did not deserve such a high premium. Breakfast, outside of the coffee, was disappointing. We walked to nearby eateries for breakfast and would recommend Urth Caffe, which is within a 10 minute walk. On the whole, I would highly recommend staying at Mr. C - hopefully the room rates don't rise too much once the hotel is more established.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Excellent very sad to leave”", "Author": "Jonathan P", "ReviewID": "UR117335112", "Content": "This hotel has only been open a few months but every thing about it is excellent We had a room over looking the the Hollywood hills and the views were great the room it self was bright and modern and a pleasure to stay in The staff were the best I have ever come across and could not do enough for you I would not hesitate to recommend", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Stavanger", "Title": "“Great hotel”", "Author": "HAeBA", "ReviewID": "UR117320904", "Content": "Although remodelling construction of part of hotel was still on-going the room was impeccably furnished and the staff was very professional and friendly. Main down side of the construction was lack of facilities; lobby, reception and restaurant but we believe that now when it is probably done it must be looking amazing. Definitely would recommend it. One thing to keep in mind is that Beverly Hills in general does not appear to offer many options for evening leisure, since this hotel is well inside Beverly Hills it means that you need a mean of transportation to seek for a greater variety of bars and restaurants.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Chicago", "Title": "“Great hotel with fabulous service!”", "Author": "Travelaround2009", "ReviewID": "UR117190399", "Content": "Our quick stay in this hotel was great. Upon arrival, the valet greeted us then took our car, got our room keys, and offered us complimentary bellinis without our ever needing to go to the front desk. Perfect! They also offer complimentary wireless and car service within 3mi of the hotel. It's JUST outside of Beverly Hills, but it's an easy mile walk from the heart of Rodeo and fabulous restaurants. The rooms were new and modern. All around, thumbs up!", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "5.0", "Value": "1", "Service": "1"}, "AuthorLocation": "long islland, ny", "Title": "“loved it!”", "Author": "marissad", "ReviewID": "UR117105364", "Content": "hotel was really nice, great location (Pico- Beverly Hills), service was top notch, concierge was so helpful, decor was beautiful and very clean, only bad thing i can think of was how tiny the pool was. However, I would definitely return. Great hotel!", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“very good hotel, excellent place and view!”", "Author": "mirsini80", "ReviewID": "UR116889811", "Content": "Very good hotel, in a very good location near Rodeo Drive. From the 13th floor (which the breakfast is served you can see the hollywood sign and from the top the beverly hills). it's near Hollywood by car and also near to Shopping malls. The room is very good, has enough space, big balkony's and it is very clean. I have visited LA twice and both times i have stayed in the same hotel. Value for money location and hotel.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "5.0", "Value": "3", "Service": "4"}, "AuthorLocation": "San Rafael, California", "Title": "“Having just opened in June - they were trying very hard to please us.”", "Author": "blaroo12", "ReviewID": "UR116617819", "Content": "We tried the new Mr. C in Beverly HIlls and were greeted with a lovely valet when we drove up. However, the front desk really needs some more training. We had to wait for our room to be ready at 5:00 pm!!! That was an alarm raiser. Why would we have to wait at that hour? Really weird. Our room was very nice but here is the BIG QUESTION?? WHY WOULD ANYONE PUT WHITE LEATHER COVERING OVER A DRESSER AND BED TABLES? This is a disaster waiting to happen. Forget having red wine by your bedside. Also, the poor housekeeper finally made it to our room to clean around 5:00pm the next day which totally explained why we had to wait the preceding to day to get into our room. She explained she is the only one working the entire floor. Whew! Other than the above, the hotel is nicely appointed - white leather aside - and they just opened. Sooooo, let's hope they can smooth out those rough edges. I would return just to see that but I would definitely ask for a room on the NORTH side so as not to be on the Pico side of the hotel.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“\"Most Amazing Experience. MUST STAY\"”", "Author": "ashleyin702", "ReviewID": "UR116583097", "Content": "My name is Ashley Ross :) And we stayed @ Mr. C Hotel on the 26th of July for one night and I have already booked to come back in a week (8/20) I just want to start out by saying this hotel is definitely 5 STAR! My bf and I stayed here in hopes to find our future home in LA. From the moment I got out of the car I felt extremely welcomed. I have never felt as great as I did walking into the hotel. The Valet/ Doormen escorted us into the Hotel and straight to the bar for a complimentary Bellini The wonderful lady who checked us in was so gracious and genuine. We were told we were getting an uprade to the Studio. We were ecstatic and didn't know what to expect. We ran for the elevator in excitement and found out our room had not one, but two patios. It was an absolutely gorgeous room. We were entranced. I even jumped on the bed. Our bellman was great. He was very genuine and gracious as well. As well as very relatable and we had a good conversation with him. Following that, we went down to check out the pool. We were amazed with the pool. It was beautiful and the perfect size. The server by the pool came by for drinks, but we still had our bellini so we were set. :) After the pool, we went to check out the gym. OH MY GOD! The gym is beautiful. There was no one in there but us so it was like our own personal space. If you need water or ear phones they are provided. The equiment is very state of the art and the latest and greatest. After we were headed to get ready for the evening out in the beautiful restroom. We did not eat at the restaurant but headed for happy hour across the street at the sushi restaurant. ( WHICH YOU MUST TRY! ) We went out that night and came home to the most amazing bed I've ever slept in. I recoomend this hotel for COUPLES or FAMILIES just trying to escape the hustle and bustle of LA. I work at the Mandarin Oriental Hotel in Las Vegas so I am used to providing 5 star service. This hotel definitely gave us that service. I am very appreciative to the staff and have been recommending this hotel to EVERYONE I can. :) Thank you Mr.C for welcoming us to our new home and not even realizing the impact you've made.", "Date": "August 11, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sydney, Australia", "Title": "“Fabulous well located hotel”", "Author": "Louise_Ed", "ReviewID": "UR116129022", "Content": "I stayed at Mr C for 5 nights and thoroughly enjoyed my stay there. The staff was very friendly and helpful. We were able to check in early and checkout very late which made a huge difference when you have a 15 hour flight home. The pool was small, but very luxurious. The location was quiet and opposite Ralphs supermarket which was really convenient. It's about a 15-20 minute walk to Rodeo drive but we loved the walk through all the posh Beverly Hills streets. The bus to Santa Monica is right out the front and comes every 15 minutes or so. The rooms are very clean and well appointed. The only thing I didn't like about this hotel was the lack of tea/coffee making facilities. Room service is the only option which is a little expensive. The walls are very thin so you can hear what's going on in other rooms. We had a lady next door who walked around in high heels at all hours of the night which kept us awake. Other than that, a great hotel.", "Date": "August 1, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Unprepared to open”", "Author": "Grazie1768", "ReviewID": "UR116092321", "Content": "We have changed three rooms in three days. We did not get the two dbl beds requested. One of us had to sleep on an uncomfortable roll away. Our keys could not work, the \"engineer is unable to fix it\". The next day we were sent to another room with a rollaway. The three of us slept in a king bed. Tonight i checked in for the third time into a dbl bed room. Where's my luggage, i don't know. The staff has no idea what they are doing. There's no one over 30 working here. They're playing games on their phone and oh the concierge is gone for this evening. Mr. C needs to come personally and get a seasoned staff for any hope of this hotel to last.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "PA", "Title": "“Unsurpassed Service, Experience & Accommodations”", "Author": "nalts", "ReviewID": "UR116031966", "Content": "With one night in LA, my wife and I wanted to splurge but avoid the stuffy arrogance of many high-end hotels. As we pulled into the recently-renovated Mr. C we were asked our last name and the concierge new our first name. The manager on duty met us with an incredibly warm smile, and invited us to the Cipriani bar, where we enjoyed a complementary drink that the friendly bartender said was a Northern Italian creation of the family (Cipriani). We then leisurely entered our room on the 11th floor overlooking Beverly Hills and the Hollywood sign. The room is spacious, pristine and newly renovated. 20 minutes ago I was grumpy from LA traffic, and now sit on the balcony knowing that the next 24 hours hold an experience I'll not soon forget.", "Date": "July 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Wonderful”", "Author": "mrbyrnes57", "ReviewID": "UR115870387", "Content": "In the last year I have stayed at several 5 star properties in Nantucket, Cabo, St. Barts, etc. Mr C was right with all of them. Wonderful property with a very helpful and friendly staff. The rooms were great and the atmosphere was even better. Will definitely return to Mr C.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Waterford, Ireland", "Title": "“Best iv stayed in”", "Author": "john3580", "ReviewID": "UR115831694", "Content": "Hi, I have just returned back for this amazing hotel, I would say it is the best hotel i have stayed in around the world. The staff are the best you will get, The food was out of this world. The location in Beverly hills is a great location. The hotel is spotless and have a beautiful pool area. All i can say is myself and my wife stayed here for our honeymoon and i will be returning next year. Just a pleasure to stay in such a professional hotel with so professional staff.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Lancaster, Texas", "Title": "“We Will Return As Quickly As Possible”", "Author": "MrsShields", "ReviewID": "UR115825933", "Content": "This hotel was beautiful and the staff was so friendly and kind. Not only were they attentive, but so courteous. We went for our honeymoon for initially 3 nights, but we had such a lovely time, we extended our stay. Everyone introduced themselves and went out of their way for anything we requested. They were knowledgable about the area, and made great suggestions for eateries and entertainment. Our bellman's name was Angel, the house drivers were Angel and Francis, and the first person that greeted us was Jessica. I was even greeted with a Bellini upon check in. This place was so awesome and luxurious. I loved feeling spoiled every minute here.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Naperville,IL", "Title": "“Snooty and unkind”", "Author": "buncomamma", "ReviewID": "UR115595888", "Content": "Beware of this hotel! I was left waiting for my room to be made up on check in for five hours. No offer of a cold drink or anything! I had to go to the grocery store to use the bathroom! I was questioned twice by snooty staff as to why I was waiting in the lobby. I had to ask for my bags to be brought from their storage so I could take medication and had not offer of a private area to open my bags and had to take my meds in front of other guests. I complained and was given an apology by Danielle, who was very nice. Then we were charged for mini bar items that we never had! No price list for mini bar the items was posted so we went to Ralphs store to purchase snacks. My first review was not posted!", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Charlotte, NC", "Title": "“Can hardly wait to return!”", "Author": "flygal89", "ReviewID": "UR115424192", "Content": "Took my daughter and a friend to LA, and we stayed at Mr. C Beverly Hills. We were impressed BEFORE we arrived! Giselle, who works the front desk, had been most helpful answering questions for us over the phone, so we could hardly wait to get there! Upon arrival, we were greeted by name! Happy, smiling faces converged upon our taxi to help us get inside, and Jessica showed us to the bar, where we were delighted with complimentary Bellinis! We enjoyed our Bellinis while Jessica got us checked in, and we were then shown to our room. The room was very comfortable without being \"overdone\". The bedding was crazy comfortable, and the staff provided a foam pillow for one of us who is allergic to down pillows. The bar was fully stocked. The safe was easy to operate, and the balconies were the delight of our stay! We spent every morning having coffee on the balconies (our junior suite had two!), and we enjoyed lots of Bellinis by the pool, where a delightful server named Lauren served us with a smile and answered our hundreds of questions about the city. Dinner in the Mr. C restaurant was incredible, as expected. The staff was helpful with recommendations, and the service was impeccable. In addition to the outstanding cuisine and fabulous service, we enjoyed some great people-watching while we were there! If you're looking for some \"famous\" people, you might just see them in this restaurant! From arrival to departure, it was a fabulous experience. Anything we wanted/needed was just a phone call away, and after a five-day stay, we felt as if we knew the entire staff on a first-name basis! As a boutique hotel, the staff is actually able to get to know each visitor, making it feel very intimate. We loved every minute of our stay. Will we be back? You betcha! In fact, we hated to leave! It felt like we were leaving new-found friends! Highly recommend!", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“As top-notch as it gets.”", "Author": "sjgjess", "ReviewID": "UR115100876", "Content": "Here's the deal. There are some hotels that just blow you away from start to finish, and this is one of them. I have stayed in so many hotels in so many cities, and I have stayed all over Los Angeles in different spots. This is by far my favorite. Every time we had a potential problem, they bent over backwards to fix it, and that is perhaps the strictest measure of quality and attention to detail. Decor: Impeccable. An interesting mix between modern and art-deco (just because of the lacquered wood in the lobby). The rooms are beautiful, which you can see in my photos. Crisp, clean, white. Cleanliness: Perhaps the best ever. I walked out this morning on my way to check out, and there was a maintenance man washing the walls and the door frames to eliminate those pesky dings that eventually detract from the ambiance. With respect to housekeeping, they actually gave us new, freshly washed robes every evening, rather than merely hang up the ones from the night before. Furthermore, this is one of the only hotels where they keep you practically overstocked on bath products at all times. Their products are good, and to make sure you have enough, you always have an extra set - one in the shower, one on the shelf by the sink. Finally, one day, I left my makeup in disarray, and the cleaning lady organized it meticulously on the dressing table, so much so that I took a picture. I think I'm going to explore implementing this system at home, too! Management: The manager who interacted with us was Jessica Fernandez. She was outstanding. When we complained because the room wasn't dark enough, she sent in engineers to cover the windows with film that made us completely comfortable. She checked on us for the rest of our stay, comping our breakfast for our inconvenience and even sending strawberries, champagne, and chocolates to our room for our anniversary. She and the concierge talked to us like we were old friends, and we actually felt at home in the lobby - a real first. The beds: Great. Lots of pillows. Crisp linens every day. The pool: Nice. Private. Perhaps a little small, but perfectly adequate. Value: Well, you really can't think about that so much in LA if you want a good hotel. Yes, I am sure there are hotels that people would claim represent a far greater value for the dollars spent, but I don't really know what they are. When I go on vacation or leave the comfortable crannies of my home, I want to stay somewhere that envelops me. This place does. It's expensive, but it feels good. Plus, it's much more reasonable than the Beverly Hills options that I won't mention by name here. Bar/Food prices: Well, if you raise an eyebrow at the hotel prices, you'll probably be alarmed by the food and drinks. However, I think they're pretty standard for 5-star LA hotels. Absurd. But, you're paying for the pampering. If that bugs you, go elsewhere for food and drinks. You're in the middle of an enormous city, so you shouldn't have any issues finding amazing meals and delicious cocktails. Overall, I can't really recommend this hotel enough. It's a showstopper with unparalleled service. And, it's convenient to everything without feeling like it's on a bad reality show or trying to create its own club scene. What's not to love?", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Newport Beach, California", "Title": "“Great experience in a BH hotel!”", "Author": "kewlflower", "ReviewID": "UR115100221", "Content": "My husband and I stayed at Mr. C BH for our wedding anniversary. Too bad we could only stay one night because this was such a great deal for their July 4th promo. The entire experience was awesome from the minute we pulled into the parking lot to check out. The hotel is new so it was quiet (which we loved). We had a standard room on the 8th floor with a stunning view of the city. Room was huge (unlike boutique hotels) with two closets! love the decor and the clean look and feel of a new hotel. The sheets and bedding were perfect. We also received a complimentary bottle of Proseco and chocolates upon arrival. Not sure if that was standard or because we were celebrating our anniversary. Rodeo shopping is only a few minutes away so we just walked everywhere. We are definitely going back. Hopefully they retain their high level of service.", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "1", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Istanbul", "Title": "“A new hotel still has things to work on..”", "Author": "OYKU", "ReviewID": "UR115049685", "Content": "We are a young married couple who stayed at this hotel in mid june 2011 It is a chic hotel maybe better for business or age +40 Rooms are very good, well decorated smells new but sleeping quality in the rooms are bad because light in the balcony never goes off!! They say it is emergency lights that it's not possible to switch off.. the curtains are not enough as the light enters the room whole night.. if you are a person who can't sleep with light don't go to this hotel.. Another thing; they lost a box came for me more than 5 days!! so I had to think of it, call them twice a day to ask if they found it.. Employees don't know each other even the managers can't find out a person by his surname!! a box comes, somebody takes and signs for it.. than it gets lost.. they found it just 2 days before I leave the country.. If you won't have a shipment to the hotel and you can sleep with lights on : This is a brand new, well situated hotel for you.. by the way expensive parking.", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“World Class Standard”", "Author": "Mishka_from_Oz", "ReviewID": "UR114627739", "Content": "I stayed at Mr C for 8 days in June 2011. The hotel had only re-opened (after major renovations and refurbishment) on 1st June 2011. The staff and service are second to none and definitely rivals any world class hotel I have I stay in around the world. The atmosphere, from the moment you pull up at the front, is welcoming and friendly. Nothing is too hard or too much for the staff and it is obvious they love their job and the hotel. I stayed on the 5th floor in a Deluxe City View room. I was fortunate to get a corner room with 2 balconies, one overlooking the gorgeous pool area, the other over-looking the city. The rooms are large and comfortable, with great amenities and layout. I don't think the room rates are high for this calibre of hotel. In fact, I would say the rates are quite low, compared to other 5 star hotels in the area and for what you get for your money. However, if you dine in the restaurant downstairs or order room service, or anything from bar or pool area, you will pay ridiculously high prices. A vodka/tonic by the pool cost me $24.95 but this was credited back to me when I complained about the price. There is no price list, so ask before you order. The restaurant menu and room service menu does have prices, but don't forget ... you have to tip also. There is a $4 surcharge for all room service orders, so bear that in mind, on top of what you order from the menu. Although the restaurant prices are high, after having breakfast and dinner in there a few times, the prices are on par with the quality of food, service and ambience. You will pay the same prices in any other restaurant in a 5 star hotel. I was blown away by this place. Everything about it oozes quality and luxury. I have read reviews that say the hotel and staff are obnoxious and pretentious. I would strongly disagree! If you want staff who are going to treat you like a backpacker, then go to a backpacker establishment. This is a world class hotel. The staff are trained to be friendly, courteous and obliging. I would say that some of the \"A list\" celebrity and affluent guests who stay and dine at the hotel are a little pretentious, but certainly not off-putting. This is what money buys ... luxury, fine wining and dining and an establishment that will spoil you. The only thing I had an issue with is the placement of the power points in the room. They are all tucked away behind items of large furniture. However, even this was quickly addressed with one of the staff members coming up to my room and plugging in a powerboard for me. This place is going to be near impossible to beat, for me anyway. Having stayed in more hotels than I can count, around most of the world, this will be THE hotel I stay in every time, whenever I am in Los Angeles. Whether you are on business or holiday or simply want to spoil someone for a night or 2, this place will not leave you disappointed. You will not want to leave. Trust me.", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Cipriani comes to LA!”", "Author": "patmick47", "ReviewID": "UR114567096", "Content": "As a longtime patron of Cipriani in NYC, I was excited to hear that they were coming to LA. We stayed there for my wife's birthday and had a great experience. They have only been opened a short time but clearly have their act together. Our suite was fantastic, staff was great and the dining experience memorable, I felt I was back in NYC. Yes, it is expensive and perhaps a little pretentious, but it is Cipriani and it is Beverly Hills, what do you expect? A great weekend, we will be back often.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Don't forget to pack your 3-Piece Suit & Maserati”", "Author": "NycHFer21", "ReviewID": "UR113921416", "Content": "From a traveler who loves an upscale, chic, & trendy scene wherever I choose to stay/eat/party - this hotel forces it so much so even I was left feeling luxury, wealth, and fabulous-ness were simply a recipe for uncomfortable. When entering, the hotel lobby appears a mix of old-school NYC Yale/Yacht/21 club lounge [tho modernized a bit] + high-end-home dining room / library-esque - which in LA, seems off. Its almost too open/airy in terms of spacing to feel intimate enough to share a drink as a couple or small group. The decor is high end and 'nice' but over-thought, and while you want to imagine a vibrant bunch of beautiful, well-dressed people standing around sipping belinis - in reality it would be entirely awkward for such a scene to take place in a location like this because of the lay-out and decor. As an aside, the bartenders stand on a lower level behind an expansive bar when entering, which is also just the wrong amount of edgy - the sofas in the lobby too deep to comfortably sit. Hotel staff & loiterers alike were nearly all dressed just a little too-nice for a mid June vacation/afternoon - groups of men in 3 piece suits on the pool deck & women in little black dresses around brunch time on sunday. High end cars frequented the premier 'show-off' parking spots at various times of the day - a white bentley affixed on the grass by the entry fountain, several black maseratis strewn about other locations midday seemed more like props - even in \"kind-of Beverly Hills\"- than actual guests' vehicles. The hallways are carpeted w/ a plush velour maroon or blue (depending on your floor) w/ walls that accent said colors (pink/baby blue) - which is kind of just like \"huh?\" The rooms are decent, not that large or small - the views from floors 2-9 on both sides leave a lot to be desired - especially \"downtown facing\" given you largely overlook a large shopping complex w/ glowing lights from the ever popular Ross's grocer - the pool deck has no views as it is surrounded entirely by concrete walls and a few oddly placed, very tall palm trees. The pool is incredibly small & most of the comfortable sofa-chairs are situated underneath said tall concrete walls blocking the sun - leaving guests to choose from oddly shaped lounger chairs or those which are non-cushioned. If you're looking for a nice, spacious cabana - this also is not the pool for you. We much rather preferred the views, pool deck, seating & overall 'scene' at the Mondrian LA, for instance. The location isn't great - cabs anywhere are a must - or you find yourself wandering through residential stretches or questionable strip mall lined streets - the complementary car service is sort of a farce - 1 car, fist come first serve. Mini gripes mostly associated w/ new hotel growing pains - our room wasn't ready at 3pm check-in, wireless internet runs the speed of dial-up, no #'s on the telephones, simple computer paper printed menu, no mini-bar price list, & no specified hotel concierge are all side complaints. My friend and I are in our late twenty's and feel this hotel caters more to the 35-40+ married couple, retiree, or business trip clientele. And even at that, hopefully you dress well, have frothy high end taste, and don't mind wondering every now and again if perhaps you're at the wrong place and instead stopped by a scene out of Mad Men - this would be the hotel for you. It's not for lack of trying - rather trying too hard.", "Date": "June 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“a day in heaven”", "Author": "ericgh3", "ReviewID": "UR112821500", "Content": "First of all the pool was extraordinary and relaxing. The service was outstanding and nothing like i have ever experienced in my life. The rooms were jaw dropping and very clean no dust, and looking through the crystal clear windows i saw and remarkable view of Los Angeles and the famous hollywood sign. Then i realized it was unmatchable any other hotel i have stayed at in my life.", "Date": "June 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Los Angeles", "Title": "“Horrible”", "Author": "BHfoodie", "ReviewID": "UR112791814", "Content": "Not only is this not in Beverly Hills It is pretentious and overpriced and obnoxious. They got their friends to come on opening night and they will never have that kind of crowd again Beware. False advertising!", "Date": "June 11, 2011"}], "HotelInfo": {"Name": "Mr. C Beverly Hills", "HotelURL": "/ShowUserReviews-g32655-d2154898-Reviews-Mr_C_Beverly_Hills-Los_Angeles_California.html", "Price": "$299 - $489*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1224 Beverwill Drive</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">90035</span></span> </span></span></address>", "HotelID": "2154898", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/e4/96/8c/premium-beverly-hills.jpg"}}