{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Austin, Tx", "Title": "“I'd go back”", "Author": "DIK1", "ReviewID": "UR123649702", "Content": "The room was very clean and well equiped (recently refurbished). Definitely a good value for the price.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Taipei, Taiwan", "Title": "“It is what it is.”", "Author": "ChrisandHolli", "ReviewID": "UR123282105", "Content": "For long term stays, the price is good. Weekly rates are about 36 USD per night. A kitchenette, full bath, and a bedroom. The wireless is good. If you are relocating and need a very small apartment, this will work.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Poor customer service is just the tip of the iceberg.”", "Author": "P J", "ReviewID": "UR119757702", "Content": "I've also reported this hotel to their corporate office. The staff are belligerent and disrespectful. The management is just as bad. I even spoke to the area manager to no avail so I had no choice but to go to the corporate level. The maids only clean rooms once a week and when they do they either half-@ss it, lie about cleaning the room when they didn't (this happened to us multiple times), or otherwise come up with some excuse to get out of it. They say they're pet friendly, but they're really not. We have a cat and have been consistently refused maid service until we essentially clean the room ourselves beforehand. Having even a grain of litter or pellet of food on the floor is grounds for refusal as anything involving the pet isn't the maid's responsibility to clean according to their rules. The rates are outrageous for the poor service and lack of amenities. The laundry room isn't functional most of the time. Their wi-fi is anything but high speed. The only plus is it's in a great location, but it also happens to be a crime ridden one. Not only was our car broken into during our stay here, but we've seen the police here more times than we could count.", "Date": "October 26, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Service": "1"}, "AuthorLocation": "Dallas, Texas", "Title": "“I am going to report this establishment to their Corporate office”", "Author": "Kelly M", "ReviewID": "UR116567328", "Content": "I have traveled for 25 years all over the U.S. and this is by far the worst hotel ('extended stay' experience I have ever had. How bad? Because I pre-paid for the week, I decided I could stick it out; but not before spending over $100.00 on: New pillows, pillow cases, bug spray (yes, there are bugs; roaches), hangers and garbage bags. I spent my first night washing the sheets and packing up the rest of their filthy bedding into garbage bags. The laundry 'room' was filthy and most of the machines were posted as being out of order. There are roaches. I wouldn't even think of using the kitchen OR even bringing food into the room for fear of attracting MORE roaches. This place is so bad, it should be closed down by the Health Department. No kidding.", "Date": "August 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“$#|+ hole”", "Author": "IveBeenDere", "ReviewID": "UR79299326", "Content": "If you have ANY respect for yourself stay far away from here! Absolutely attrocious.", "Date": "September 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Dallas", "Title": "“ATROCIOUS-Don't waste your money or time with this establishment”", "Author": "hoteladvisor5", "ReviewID": "UR59756357", "Content": "Please beware, i can not talk about other Homestead Studio Suites but if they are anything like Homestead Studio Suites Dallas - North - Park Central please save yourself the mental anguish and find another place to stay. *The rooms small like mold and smoke. * Having checked out of one room into another due to floor damage (carpets ripped) and the horrible smell, i found that my new rooms refrigerator leaked every night wetting the whole kitchen floor, causing the mold smell that no doubt is under the carpets. * Laundry service: After talking with the \"front desk staff\" i was told i was not entitled to a refund after spending $2 on each machine ( total of $6) only to find that 3 of the 4 washers didn't work (no signs were posted). I asked who would refund me and they told me to call the owners of the machines and report that they were out of service and to collect my refund from them. The owners of the machines stated that they were not responsible for refunds, but they would come out to service the machines later this week. I've already checked out, with my laundry in tow. * The staff have no understanding of customer satisfaction or service, as the representatives just walked away from me multiple times stating that \"Hey, we didn't tell you to stay here, if you don't like it go some place else\". I've never been treated as a paying patron with so much disrespect. *the grounds are a shamble with litter, and dog poop everywhere. Simply put this place needs new management, new staff, and an overhaul as it certainly does not live up to any standard other than disgusting.", "Date": "March 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "5", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“In 2 years, this place has become a filthy place”", "Author": "diaperchanger01", "ReviewID": "UR55783569", "Content": "I have stayed in this hotel a number of times. However, when the new manager took over some months ago, things started to become overlooked. We stayed this last time and to be honest with you, was taken back by the filth that was evident both in the rooms and around the grounds. In our particular room on this stay, the carpet was worn out and had become detached from the tiled kitchen area. Each time my children walked across there barefooted, they walked across carpet tacks. The bathtub had \"unspeakable\" hair in it. There is spots of mildew and mold growing in the bathroom. The air conditioning wreaks in this room of urine/smoke. We have learned over the past 2 years to take a can of Febreze or you will not be able to tolerate the smell. The beds are like sleeping on the floor --probably would be better off on the floor. The carpet is simply put -- DIRTY. The grounds of the hotel needs a scrubbing and someone to pick up cigarette butts, etc. The staff needs a lesson in customer service as they have and will continue to be less than \"polite\" at this location. The manager and I have been in screaming matches before over her attitude. I simply will not stay in this motel again, even though it is convenient in location and excellent in price. 2 years ago, I had a different opinion, and it's truly a shame. This property has so much potential, if only it were discovered.", "Date": "February 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "New York", "Title": "“Eh - not bad for $40”", "Author": "steiny100", "ReviewID": "UR54231750", "Content": "It wasn't disgusting, but it was nothing to write home before. The room smelled like smoke, and was a little dirty. There wasn't even a little shampoo in the bathroom! On the plus side, it was in the right location and the room had a little kitchenette that could have been helpful had I been using the room for more than just a night's sleep. There was, however, some shady activity in the area and some weird noises coming from other rooms. It's a fine choice if you're tight on cash.", "Date": "January 24, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Texas", "Title": "“FILTH!”", "Author": "tmaruna01", "ReviewID": "UR49192338", "Content": "12121 Coit Road, Just to insure I am talking about the same hotel. I am a traveling health care provider and travel more than 10 months a year and stay over 6 weeks in any given location. This was absolutely the filthiest place I have ever been to in my life! The staff are rude. The rooms are small and filthy. AC did not work. The carpet was not attached securely to the floor, and visibly filthy, with black yukky stuff all over it. The rooms smelled and were thrown together. Upkeep is obviously not a priority here. I only stayed one night and it was one night too long! The grounds were not even kept. The location is great for business. This could be a wonderful place if it were under new management. I would not recommend this hotel to my worst enemy, and will certainly never stay in a Homestead in any city!", "Date": "November 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "NC", "Title": "“Great place to stay”", "Author": "msdeb51393", "ReviewID": "UR45761177", "Content": "I've read the other reviews and, frankly, I wonder if they stayed the same place we did. 12121 Coit Rd, Dallas, Tx.? The staff is wonderful. Always willing to help. The manager takes such pride in her hotel complex and it shows. This Homestead hasn't been \"hers\" very long. She's working very hard to make it an ever better place to stay. The grounds are clean and well manicured. Most on the beds were replaced while I was there. A lot of the rooms are being redone. There are some problems but the Homestead has been without a handyman for a few months. Things did slip a little but they have one now and things are getting repaired. If something was wrong, they bent over backwards to fix it. Its convient to every part of the North Dallas area. And a great price compared to the other suites in the area. Maybe, the other reviewers would have been happier staying at a Hilton type hotel. Nah, they would have complained about something there, too.", "Date": "October 3, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "San Antonio", "Title": "“If safety and/or customer service is a concern, then don't stay here.”", "Author": "mom2many19", "ReviewID": "UR41497888", "Content": "The card key didn't work and after many trips (with my 3 children) back and forth to the office, nothing was solved other than to move us upstairs to a different room. This room had a door that had obviously been broken into or kicked in. The clerk didn't seem bothered by this and told me the locks are very safe. We entered the room, turned to shut the door and found the inside safety lock was broken clean off-as if the door had indeed been kicked in. I grabbed the phone to call the front desk and lo and behold the phone was dead. I had to take my kids and go to another hotel for safety reasons. The customer service left much to be desired as the clerk acted as if I was putting her out by trying to book a room there.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "joshua761312006", "Title": "“Worst hotel I have stayed at in my life”", "Author": "joshua761312006", "ReviewID": "UR34796700", "Content": "This hotel was the worst hotel experience of my life I had to move rooms at least five times with refrigerators not working and also a/c units not working and also internet not working and they have always lied to me that got it done. The front end person went crazy on me when she said she was not going to move me to a different room because it is to hot and I said thankyou and slamed the door she I was try to vandalize the hotel. This hotel needs to be shut down for lack of concern to guests health. This staff is horrible here and they absolutly of no use and I am very disappointed by this .", "Date": "July 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "jazzytxchic", "Title": "“GRRREAT LOCATION....GRREAT SERVICE......WONDERFUL PRICE”", "Author": "Jazzytxchic", "ReviewID": "UR29775353", "Content": "I have been staying here at this hotel off and on while that my house is being repaired and I felt at home while I was there. The staff is really friendly and it was quiet and it is located near Boston Market, Taco Bueno, Taco Bell and around the corner from some other nice restaraunts like Olive Garden, Outback, and near a bus line so I was so comfy, I will make sure to go back if I ever need them.", "Date": "May 11, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "hotelbound", "Title": "“A+ Service is a hard commidity to come by...”", "Author": "hotelbound", "ReviewID": "UR28516232", "Content": "Stay was great, location was clean, quiet and convenient. Staff was friendly and very accommodating!", "Date": "April 21, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Iowa", "Title": "“A garbage dump”", "Author": "ta_9999", "ReviewID": "UR27064557", "Content": "You all need to seriously go check your hotel at 12121 Coit Road. This place is a chithole. The rooms are filthy, the staff lazy and incompetent and the facilities are falling apart. The laundry room door lock was broken and never was fixed . The so-called refrigerator in my room was barely functional and all of the knobs on the AC were gone! Never mind that turning the heat on in the place set off the fire alarm! The housekeeping is a joke. It is an insult to other hotels to refer to this as a 'pay by the hour' hotel. Fire your staff, rehab the rooms and replace the CABINETS and REFRIGERATORS. The only thing I can say for it is it wasn't infested with fleas, rats or cockroaches. They apparently won't stay there, EITHER. Needless to say, I won't ever go back to that craphole again. I'd rather live in my car. What was that you were paying your manager for? To MANAGE the place? Apparently NOT. I'll stay at a competitor the next time, even if it does cost me more.", "Date": "March 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "kansas city", "Title": "“great place to stay”", "Author": "mrtyler1", "ReviewID": "UR23945542", "Content": "the location was convienant and the workers were pleasant and very helpful. the kitchenette makes the stay much more pleasant", "Date": "January 27, 2009"}], "HotelInfo": {"Name": "Homestead Studio Suites Dallas - North - Park Central", "HotelURL": "/ShowUserReviews-g55711-d217717-Reviews-Homestead_Studio_Suites_Dallas_North_Park_Central-Dallas_Texas.html", "Price": "$45 - $58*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">12121 Coit Road</span>, <span class=\"locality\"><span property=\"v:locality\">Dallas</span>, <span property=\"v:region\">TX</span> <span property=\"v:postal-code\">75251</span></span> </span></span></address>", "HotelID": "217717", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c1/9c/c19c6e209e6aa7b9390d2fd5cb129f414large.jpg"}}