{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great Deal”", "Author": "luv2trvl2_12", "ReviewID": "UR126524761", "Content": "We stayed at this hotel in the beginning of March 2012. There was a free shuttle that picked us up from the airport to the hotel (we only waited about 5 minutes) and another shuttle that took us to the port of Miami the next morning. The room was clean except for the bad smell in the hallway on the 2nd floor (the room didn't smell). The free breakfast in the morning was AWESOME. I would definately stay here again the night before going on a cruise. We prepaid $10 per person for a shuttle to pick us up at the port and take us directly to Miami Airport which was a bad idea. We waited an hour at the port for the shuttle after having called twice and being told 20 minutes each time. I would not prepay for the shuttle. Also, the only restaurant in walking distance is Bennigans.", "Date": "March 23, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Hilton Head, South Carolina", "Title": "“Pretty Average Hotel but a Great Deal when Flying In and Out of Miami”", "Author": "Paul C", "ReviewID": "UR126500016", "Content": "Flew round-trip from Miami to Aruba and picked this location for their shuttle service to Miami International and the free parking for up to a week while gone. For less than $125 total, we had a king bed room with the normal amenities, free parking for the week and free shuttle to and from the airport (about 10 minutes away). The first room that they sent us to had not been cleaned. I cannot see any other reason to pick this hotel except for the parking and shuttle amenities. It is located in an industrial area next to the airport, a bit noisey with very few restaurants or shopping in the vicinity.It served our purpose and saved us parking and cab fees in excess of $100.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "michigan", "Title": "“Port of Miami shuttle.”", "Author": "MichiganLadybug", "ReviewID": "UR126285353", "Content": "We stayed the night before a cruise. We chose this hotel for the free port of Miami shuttle. It is very close to the airport, about 10min. We did have to wait a long time to be picked up from the airport, about 40 min.But when we arrived everyone was super nice and we sighned up for the cruise shuttle(it leaves at 10 am) The room was nice and clean and the beds and pillows were comfortable.The planes are very loud and there is nothing close by but other hotels and an awful Bennigans.I would suggest ordering in pizza. All in all a nice hotel to stay for a night, though a bit overpriced but on par with other Miami hotels.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Guayaquil", "Title": "“My best option”", "Author": "Starseedancer", "ReviewID": "UR126021095", "Content": "Even that I was traveling on a tight budget, I decided to register here because i was alone and needed a safe place with free shuttle to the airport. I stayed three nights and i spent money that wasn't considered originally. Rooms were clean, with tv, cable, microwave oven and clean bathroom, they all have wi fi which was very convenient because I neded to communicate with my relatives abroad, beds were comfortable enough to assure a good sleep. Continental breakfast was enough for me to start the day. Front desk was courteous and helpful, they even helped me with a scale to weight my luggage, I also used their wake up service. Because its located near the airport, there aren't any places ( walking time ) to buy a snack or something to eat, so i used the vending machine which didn't have a great variety. If I had the money I think i would stay here again.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "pa", "Title": "“would stay again”", "Author": "tlanders", "ReviewID": "UR125711861", "Content": "Used hotel before a cruise had 7 rooms booked. When I arrived room wasnt ready but they said a smoking room was available so took that one. Transportation from airport helpful and transportation to pier the next morning excellent. Breakfast in the morning very crowded not enough room. Staff friendly and helpful. Would stay again. Only downside not to much around in terms of shopping or eating.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Woodstock, Canada", "Title": "“Not terrible, slightly overpriced, but acceptable.”", "Author": "The_Arden", "ReviewID": "UR125705757", "Content": "We stayed at La Quinta prior to our cruise and though the front desk service was very friendly and courteous, the overall experience did not meet our expectations for the price we paid. The reason we chose this hotel was because of the proximity to the port and for the free shuttle service to the hotel and to the pier. We were satisfied with this service. However, because the inn is literally right beside the airport, it gets to be a bit loud. Miami airport is a busy place and there are planes coming and going throughout the night. The room was average at best and I thought the bed wasn't too bad. My friend, however, woke up with a sore back. Furthermore, if free breakfast is a reason you are considering La Quinta, please reconsider. The continental breakfast (although not usually great anywhere you stay) is below standards with little variety, warm juice and weak coffee. Finally, La Quinta is located in the middle of nowhere. If you did not rent a car, expect to eat Bennigan's which is the only restaurant that is accessible by foot, unless you want to run across a 6 lane highway to get to Burger King. If you're not too picky about hotels, La Quinta is probably acceptable for a short stay before your cruise, but don't expect anything fancy, especially for what you pay. Personally, I would pick something closer to downtown like the Hilton, and pay your ten dollar fare to taxi it to the pier. It's a bit more expensive (look for a sale), but a lot more comfortable. Note: If you plan on staying at La Quinta after your cruise, and you require transportation, La Quinta offers a shuttle back to the hotel for a price. Free wifi.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Orlando, Florida, USA", "Title": "“Overall Good”", "Author": "Posted by a La Quinta traveler", "ReviewID": "UR125482316", "Content": "The front desk staff was curtious and friendly. The hotel and room meet La Quinta spectation. They were clean overall. The hotel was a bit difficult to find since it seats back from the main road behind a closed stablishment.", "Date": "March 1, 2012"}, {"Ratings": {"Sleep Quality": "1", "Overall": "1.0", "Service": "1"}, "AuthorLocation": "Orillia, Ontario, Canada", "Title": "“We were robbed (literally) here”", "Author": "Wanda A", "ReviewID": "UR125457551", "Content": "We recently stayed at this location prior and after our family Caribbean Cruise. In total we had 4 rooms booked each time. On return we checked in early and took our bags to a room because not all were ready and then headed out for a tour of the area. On returning we found that our room had been broken into (conveniently the one with ALL the bags) and jewellery/items/gifts totalling $2,000 were taken. In addition the lock on the door was faulty. Police report filed, however the hotel has not claimed any responsibility at all for the incident - to the point that they have not even COMPED one free room! The police officer said that security at this location is a problem. In addition the shuttle service is terrible to the port. Would never stay at this chain again.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Central Vermont", "Title": "“excellent choice for a pre-cruise hotel in Miami”", "Author": "VTwanderlust", "ReviewID": "UR125302217", "Content": "We stayed here at La Quinta Inn Miami Airport East for two nights preceding our cruise vacation from the Port of Miami. I was very pleased with this selection. We arrived on a Thursday night after a long drive down from Lakeland, FL. Were checked in promptly and courteously. Parking for our rental car was free. Our room was perfectly fine, two comfy beds, very clean room in all (although as other reviewers have said, the carpet could use a cleaning). Decent towels and good water pressure in the room, and the soap they provided smelled very nice. It was not a humongous room but it met our needs, not feeling cramped. The TV was newer and nice. Yes, we could hear the planes take off - frequently - but it was not deafening or bothersome, more like a background noise, and it was not a problem for us, even for my husband who is a very light sleeper. The breakfasts were fine. Nothing exotic but we didn't go away hungry. We had hard boiled eggs, cereal, coffee, bagels/cream cheese, fresh fruit, and juice. There was also a waffle machine but as we are hard core Vermonters we refuse to eat waffles or pancakes without 100% real maple syrup which of course they didn't have... so we can't say if the waffles were good or not. They have a very tiny \"gym\", inclusive of one treadmill, one elliptical, one recumbent bike. I did a workout on each machine - no problems although one of the pedals on the bike was partially broken. They also did not have any cleaning solution/towels located in the gym area, which was a nuisance. But it was nice to have that equipment available nonetheless. Our daughter enjoyed swimming in the pool which was nicely maintained. We had dinner one night at the next door Bennigan's and while our food was okay, service was indeed VERRRRRY SLOOOOOOOW and they do see fit to add a 15% tip to the bill - which in my opinion is stupid and they ripped themselves off because I usually tip a minimum of 20%. One downside was the airport shuttle, we returned our rental car on a Friday afternoon and waited quite a while at the airport for the shuttle to pick us up. Free, yes, but a PITA. However, one great spot was the free cruise port shuttle on Saturday AM - prompt, courteous service delivered on a giant comfy tour bus, we thought that was great. Strangely, we could not sign up for this until Friday afternoon - I was told Thursday night and Friday morning that we needed to check back after noon on Friday to sign up for Saturday's shuttle. Strange. One thing I did find peculiar was that at check in, the desk person told us to be sure NOT to order from the flyers under the door/in the hallway... scam artists. I found it unsettling that whatever sort of shady characters are allowed free reign of the hotel grounds to deliver these papers. We were not bothered by anyone... I don't understand why the hotel doesn't work harder to prevent those companies from getting in though. On Saturday morning, I realized I'd forgotten to pack my shipping tape (which I use to secure the cruise line luggage tags). Although the lobby area was mobbed with cruisers the desk staff person was kind enough to let me borrow their stapler, take it back to our room to staple the tags on. In all I would most definitely stay here again pre-cruise. Not perfect but definitely has the basic amenities and comfort required for a brief stay in the Miami area - at a much better price point than any other comparable hotel.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Georgia", "Title": "“Great hotel!”", "Author": "kydd04", "ReviewID": "UR125296991", "Content": "I stayed at this hotel 2 days prior to my cruise and had a great time! hotel offers free airport shuttle and transportation to and from Miami port, rooms are clean wireless internet works great, also has a pool and free continental breakfast.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Rude front desk”", "Author": "Texasgirlontheroad", "ReviewID": "UR125204115", "Content": "My husband and I checked into this La Quinta with our corgi, Sailor, and were put on the fourth floor, nice room and very spacious. We found a La Quinta closer to a conference my husband is attending and went to inform the front desk that we would only be staying one night. Upon seeing our dog we were told dogs are not allowed on the fourth floor only the first floor. I proceeded to inform the desk clerk that when we checked in we were told there were no first floor rooms, but we could fill out a release form for our dog and take the fourth floor room. I told the desk clerk that I would like to continue what I ACTUALLY came down to the desk for and that was cancelling the next two nights. She was rude, rude, rude. Not the norm for La Quinta Inns, also neighborhood is iffy and jets taking off are deafening even in the room.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ontario, Canada", "Title": "“Great pre and post cruise stay”", "Author": "uniquenames", "ReviewID": "UR125004624", "Content": "Such an awesome little hotel, with an amazing bang for our buck. Staff were INCREDIBLE! WE did two pre cruise days, and one post cruise day, and no problems at all. Breakfast was free and good. Room was clean. I loved all the free shuttles. The one night we ate at Bennigan's and the last night one of the front desk staff gave me a pamphlet for a restaurant he recommended and I have one of the best philly cheesestakes of my life. I would stay here again. Lastly, we just grabbed the bus outside of the hotel, and easily made it to south beach for 3 dollars per person. Just take the J bus", "Date": "February 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Grayling, Michigan", "Title": "“A Little Over Priced.”", "Author": "sbidwell", "ReviewID": "UR124963472", "Content": "The bad things about this hotel were, the pool is not heated and it was way too expensive for just a simple room! The beds were very comfortable and the staff was very nice. Bennigan's Restaurant was right next to the hotel so that was nice and convenient.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Providence, Rhode Island", "Title": "“Better than the La Quinta Airport North”", "Author": "Sandyarnie", "ReviewID": "UR124917872", "Content": "We stayed at the La Quinta Airport North on our way to Cuba and at the La Quinta Airport East on our way back in january 2012.. It was amost like staying in 2 totally different hotels, if these are supposed to be part of a chain. The Airport North was so far from the airport we really could have stayed in Miami, while the East was far closer to the airport and that made for incredible airport noise if you wanted to sit by the pool. The North is shabby, the East far better. But the East is also pricier though more convenient to an early morning flight. I would try this chain again, but probaby skip the ones at the airport.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Lawrence, Massachusetts", "Title": "“Great for 1 night”", "Author": "Jag978", "ReviewID": "UR124838606", "Content": "We stayed one night pre -cruise and found the room to be clean and beds comfortable. Breakfast was good but the seating is limited. The area at the entrance of the hotel could use some improvement. The shuttle to the port was free but crowded and an hour off schedule. You can hear the planes overhead but not a big problem. Only one restaurant within walking distance. I would stay again.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "northeast u.s.", "Title": "“Check in Early to Get to Cruise Port in Timely Manner”", "Author": "luvstravel2", "ReviewID": "UR124780246", "Content": "We stayed overnight pre-cruise but had a late arrival. We had planned to leave for the port by 11 am but were told we could only get on a 1 pm shuttle. As it turned out,we managed to get on the noon shuttle BUT it only arrived at 12:50 and made many stops which got us to the cruise port at roughly 2:15 pm. A number of people did not wait for this shuttle and went by cab which is why we got on the \"earlier\" shuttle. Don't know what time the 1 pm shuttle left. The hotel transfer scheduler did not explain or apologize about the late departure and we were almost at the point of taking a taxi ourselves. The cruise ship wanted everyone to arrive prior to 2 pm. So my advice is to get in to the hotel earlier so you can be guaranteed to arrive to the port worry free. Had no complaint with the hotel otherwise.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Star Prairie, Wisconsin, USA", "Title": "“good precruise stay”", "Author": "missjane75", "ReviewID": "UR124619541", "Content": "We stayed 1 night before boarding our cruise. No frills, but clean. Free shuttle from airport & free shuttle to cruise port the next day. Great value for the $$$$. Complimentary breakfast wasn't so great, but we knew we would be ok once on the ship!!! There is a nice restaurant/bar right next to the hotel for good food & drinks.", "Date": "February 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "MidSouth", "Title": "“Miami Airport Hotel was great or pre-cruise night”", "Author": "herbalsoaplady", "ReviewID": "UR124578439", "Content": "We stayed one night prior to a cruise. Free shuttle from airport and they do provide transportation to the cruise port for free. We opted for a cab. The driver of the shuttle was very good and attentive. Front desk personnel were on the ball. Breakfast is your normal LaQuinta and all one needs. Rooms were quiet and bed was comfortable. There is a restaurant to walk to for dinner. Not much else. Great for pre cruise night.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "spring lake park", "Title": "“don't expect much”", "Author": "mark d", "ReviewID": "UR124540333", "Content": "the best things about this hotel were the free shuttles, and the breakfast. the room wasn't very clean, the beds were small and hard. the planes flew over often and were very loud. i wouldn't stay here again, the bad things out weighed the good", "Date": "February 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Flushing, Michigan", "Title": "“First and last stop on our cruise.”", "Author": "fusie12", "ReviewID": "UR124278969", "Content": "We chose to stay here before and after a cruise. We were picked up at the airport and checked in quickly. The shuttle runs every half hour. The room was comfortable and as quiet as can be expected this close to the airport. The bed was comfortable. The hotel provided a shuttle to the cruise docks the next morning. We chose to get our own transportation back after the cruise. They stored our bags untill the room was ready and it was ready earlier than promised. The staff is friendly and very helpful with printing off our bording passes. Check out was the easiest. Breakfast was OK but crowded with a lot of people also getting ready to cruise. We walked to Bennigan's for supper both days. I will stay here again if I return to Miami.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Alpharetta, Georgia", "Title": "“Convenient and value for money”", "Author": "Hemanth K", "ReviewID": "UR124232243", "Content": "Location convenient for Miami airport (shuttle provided), also for city touring; 15-20 mins to Miami beach, and Jungle Island; 30 mins to Everglades etc. New and nice HD Samsung TVs and free wi-fi of course. Also has a pool. Room is very clean and maintained well. Breakfast area is crammed. All-in-all, good value for the price and decent to stay with family. No pet fee is a bonus.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Columbus, Ohio, United States", "Title": "“1 Night pre cruise stay”", "Author": "Theresa967", "ReviewID": "UR124193849", "Content": "We had no problems with this hotel. I knew before hand that we were only taking carry on luggage on the flight and would have no rental car to go shopping. So beforehand, I mailed my \"non-flyables\" sun blocks, shampoos, and large liquids I could not take on a plane. The front desk had my package when I got there. So first, the shuttle. We used the courtesy phone at the airport and had maybe a 20 minute wait. Not bad! I also called at noon that day to reserve a spot on the shuttle to the port the next day as per a suggestion here on another review. Next, check in. Took about 5 minutes. The front desk girls were very friendly. If you are using a AAA discount take your card. They do ask for it. We were on the 2nd floor. Room was very clean and fresh smelling as was the bathroom. A/C had the room nice and cool and the beds were really comfy. Loved the soft comforters on them. The A/C made enough \"white noise\" that the airplanes were a non issue. There was a soda machine down the hall by the elevators, also an ice machine. We did not use the pool. Dinner we went across the parking lot to Bennigans. Now since the gratuities are built into your check is probably why the service is so/so. We did have a little bit of a wait. We had nowhere to be though. I can say our food was very good. I had the appetizer sampler and my daughter had a bacon cheese burger w/fries. Portions were big and it was delicious. We did get the pizza flyers under our door, looked over them and the prices were very reasonable. I think we paid about $35 at Bennigans, that was our 2 meals, sodas w/refills plus tip. Breakfast the next morning was adequate. Hey, its free! Waffles you make yourself, cold cereals, fruit, yogurts, bagels and breads, boiled eggs and instant oatmeal. Coffee/tea, milks and juices. Fine to tide you over. Check out was easy. They slipped the bill under your door in the morning and you just called the front desk if the bill is as its suppose to be.. Shuttle to the port was ontime picking us up. There was a race in downtown Miami that day which made traffic a nightmare so the shuttle was scheduled for 8:45 am. A 20 minute ride turned into an hour and a half but was no fault of the hotel or the driver. He even warned us before we left that traffic was horrible and we sat downtown in 1 spot for an hour. Only reason Im mentioning this is you might want to make sure there are no races the day you go! This hotel was a good value, was very clean, staff friendly and I would absolutely stay here pre cruise again!", "Date": "February 6, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Stuttgart, Germany", "Title": "“expansive, loud from airport, not worth....”", "Author": "sofietravel", "ReviewID": "UR124176171", "Content": "it was loud all night as we heared the airplanes from airport, breakfastroom really small when hotel is packed, breakfast not to bad, but everything given in plastic, they charged 118 usd, for this dark room... to much and service very low ! I dont book anymore when other chance. But internet good, bed good.. Only when I have to go early to airport, then yes maybe..", "Date": "February 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kingston, Canada", "Title": "“Good value - loooong wait for airport shuttle”", "Author": "gotta-c-sun", "ReviewID": "UR124092126", "Content": "We stayed at the La Quinta Airport East in Miami for 1 night 2 weeks ago before a cruise. We were attracted by the free airport shuttle and the free shuttle to the cruise port. Overall we found this hotel offered good value. There were 10 of us (in 3 rooms, 6 adults & 4 children), so we saved quite a bit of money we would have otherwise spent on taxis or shuttles, and breakfast was also included. However, we did find that we got what we paid for with the free shuttles... When we arrived at the shuttle pick up at the airport my dad called the hotel and was told we had just missed the shuttle and the next would be along in approximately 20 minutes. We stood on the curb watching & waiting, with 4 wiggly kids and a heap of suitcases, car seats, strollers, etc. However, we waited over 45 minutes before the shuttle came back. We saw other hotel's shuttles come twice before we saw ours. And we were very disappointed when the shuttle driver passed us by, saying he was too full for us, but he'd be back soon. We waited AT LEAST another 30 minutes before he came back! Luckily we did get on that shuttle. And weren't we even more suprised to find the drive from the airport to the hotel took only 5 minutes. So we're not exactly sure why only 2 shuttles came in almost an hour and a half?! Once we got to the hotel, everything was ok. Luckily we were second in line for check in; others behind us waited a while. Everything was satisfactory in our rooms, beds & bathrooms were clean, beds comfortable. We had at least 6 different pizza delivery flyers under our door, which was slightly annoying, but not really a big deal. My husband and brother-in-law took the kids swimming, the pool was fine, but water was quite cold. We could hear planes taking off overhead, but were tired, so it didn't keep us awake and there weren't any during the night - the first one I heard in the morning was after 7am. The front desk staff were helpful. We wanted to go shopping for a few last minute things and they gave us some recomendations and helped us get a cab. Breakfast in the morning was good, there were quite a few options - cereals, waffles, toast, bagels, yogurt & fruit, hard boiled eggs, coffee, tea & juice. Breakfast was busy between 9-10 am, but most of us ate earlier and didn't find it too bad and my mom and I ate after 10 and there was still lots available and not too busy then either. We booked our shuttle to the port when we checked in and the first available time for our group was 11am. We were asked to be ready in the lobby 15 minutes early. We were, but the shuttle was about 20 minutes late, so that was quite a wait again, but we didn't have anything else to do anyway . We were still at the port with plenty of time. If we were travelling to Miami to stay more than 1 night, I wouldn't stay here. It was in an industrial area near the airport - nothing to do there, however if you want to be near the airport, this is a good choice. Pre-cruise, I would stay there again, hopefully with improvements to the shuttle service.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“A great stay”", "Author": "The Boston Traveler", "ReviewID": "UR124066441", "Content": "We stayed at La Quinta Inn & Suites Miami Airport East the night before we were leaving on a cruise. The front desk staff, Jessica and Evy, were extremely helpful. The first room we were assigned smelled of smoke. Upon hearing that from us, we were offered a choice of different rooms and got one that had no smoke smell. American Airlines lost our suitcase and we had to go back to the airport a couple of times. The driver, Karel, was very helpful and pleasant. Evy recommended a nearby Cuban restaurant which was very good. The WiFi was free, breakfast was good, the price of the hotel was very good, the shuttle to the cruise port was free, and the hotel even had $10 vouchers that could be purchased to travel from the cruise port to the airport when the cruise ended. Really, what more can you ask for? We thought this hotel was a great value and a perfect place to stay before a cruise.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "buenos aires", "Title": "“very basic”", "Author": "pattiBuenosAires", "ReviewID": "UR124038162", "Content": "excellent location if you are on a stop between 2 flights, but it is very basic. A cockroach appeared on a wall at night. the breakfast was very poor.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Amazing value hotel”", "Author": "brownboy_Vancouver", "ReviewID": "UR124020269", "Content": "We stayed here for 1 night - pre-cruise, and the hotel is great. Clean family friendly, free shuttle to Cruise port - NOTE: must sign up for shuttle when checking -in. Daily, free breakfest, clean rooms, close walking distance to 1 restaurant, good value per night rate, friendly helpful staff. Thank you La Quinta Inn Miami Airport East", "Date": "February 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Orlando", "Title": "“Great for travelers going on a cruise!”", "Author": "jes58", "ReviewID": "UR123714997", "Content": "Perfect location for cruisers. Shuttle provided from the airport and also to the Port of Miami. Free parking while traveling if you drive to Miami. Everthing about this location, including breakfast, won't disappoint the budget-minded traveler.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Middletown, DE", "Title": "“Our Pre-Cruise hotel”", "Author": "ChristineJimGubitosi", "ReviewID": "UR123698506", "Content": "We've stayed at La Quinta's a few times prior so we knew what to expect. Room was clean & neat. Free transportation to the port for our cruise the next day. The only thing that I was disappointed in was the fact that they didn't have hot tea/coffee availability in the lobby as they did in the other La Quinta's. We enjoy an evening tea before bed and actually had to walk to the neighboring hotel to get some. That's the only thing that we would have to say that was disappointing. Everything else was fine.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Palmer", "Title": "“Pre-cruise hotel with transportation”", "Author": "William H", "ReviewID": "UR123666499", "Content": "We chose this La Quinta due to their free transportation to the Port of Miami. It's located right near the airport but the sound of the jets wasn't that bad. It is a hotel-style, rather than the typical motel-style La Quinta. The staff was very friendly and helpful. There is a good pub/grill right next door as well. Certainly a good choice for cruisers!", "Date": "January 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bermuda", "Title": "“Met My Needs”", "Author": "Bermychick8", "ReviewID": "UR123062727", "Content": "I stayed at this hotel for one night after returning from a cruise. I planned on doing a bit of shopping before returning home so I picked a cheap hotel just to sleep in for the most part. Check-in went smoothly and the staff were very pleasant however I was a bit worried when I got to the room. Don't get me wrong, for the price the room was adequate. The bed was comfortable and the bathroom was ok ( clean but sort of dingy looking) and the room was quiet. The TV looked brand new and the best feature for me was the free wi fi. The only issues I had was more of a security thing. The curtains of the outside type room did not close completely and the guests in the room next door were sort of hanging out on the shared balcony area. As a single female traveller it didn't really make me feel at ease. The location was ok if you have a car. There doesn't seem like its much to do in the immediate area. I was hoping for something a bit closer to the Dolphin Mall /Miami International Mall area but that was my fault for not really doing my homework. Overall, if the decision was just to be made on price and I was only staying for one or two nights I might stay here again. But you definitely get what you pay for and if you are not high maintenance I would recommend this hotel to anyone. I've stayed in other low/mid priced hotels and wanted to check out immediately or not touch anything in the room for fear of catching a disease. You wouldn't have that problem here.", "Date": "January 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Springfield, MA", "Title": "“Great Pre-Cruise Hotel”", "Author": "Lindsey S", "ReviewID": "UR122768746", "Content": "We stayed at this hotel from December 31, 2011 until January 2, 2012. The free airport shuttle picked us up within 5 minutes of claiming our baggage and we were at La Quinta within another 10. Check in time is 3 pm, but we were able to check in and be to our room by noon. Our room was very clean and well kept, except for the broken latch-lock on the door. Also, the beds are extremely comfortable, but this hotel is very close to MIA, so if you're a light sleeper, bring earplugs! The desk staff and housekeepers at La Quinta were extremely helpful, but the food staff for breakfast would not give you the time of day. Breakfast was okay. It consisted of waffles, hard boiled eggs, toast, bagels, yogurts, 2 kinds of cereal, and 2 kinds of juice. There was some fresh fruit, but it was typically gone by the time we went down there. On the weekends, the breakfast is open until 10, but it is only open until 9 on the weekdays. There are not enough tables to eat at, so people are spilling into the lobby. The tables they do have are round, so it is impossible to put them together if you're in a group larger than 2. The cruise shuttle is great, especially since it is free (only one way). To get back to either MIA or La Quinta after your cruise, it is only $10 per person. This is significantly cheaper than calling a cab or paying for transfers through your cruise line. Whatever you do, do not go to the restaurant outside the hotel called Bennigans. The service was ridiculously slow, the food was expensive, it wasn't that good, and they charge you a 15% service fee, plus a tip! Overall, this is a great hotel and I would definitely stay here pre-cruise again!", "Date": "January 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Toronto, ON", "Title": "“Free Shuttle is Just The Beginning...”", "Author": "action_jackson2", "ReviewID": "UR122720132", "Content": "We stayed at La Quinta the day before sailing on a cruise. That was the main reason why we decided to stay there. Although the service upon check-in was questionable, everything else was great. The rooms were nice and clean (as I have found with all LQs), it was moderately quiet and the breakfast was okay. I say just 'okay' because in comparison to other LQ locations the breakfast was sub-par but in comparison to other hotel chains I would say it was pretty good. Very busy, but good. The free shuttle was wonderful. Great service + free = win-win! Just remember that the free shuttle to POM is one-way only; there is a charge to be transported back to the hotel after your cruise. All in all, I would stay here again just to take advantage of the free shuttle. Too bad it's not located closer to South Beach...", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Texas City, TX", "Title": "“Great location if you are taking a cruise”", "Author": "TravelSteveR", "ReviewID": "UR122317961", "Content": "This is the second time we have stayed at this location before a cruise. It is conveniently located, provides a free shuttle from the airport to the hotel, and, most importantly, provides free transportation to the port, saving you the cost of that transportation. The rooms are fine, and the staff is very nice. I agree with other posters about the breakfast, however. It is very weak. We stayed at the La Quinta in Tillman's Corner over the Christmas holiday, and it had scrambled eggs, bacon, sausage, biscuits, gravy, donuts, and danish. The Miami Airport East location has none of those--just hard boiled eggs (which I hate), cereal, bread, waffles, and packages of oatmeal. It's a shame that the breakfast offerings are not standardized throughout the chain. Also, we encountered several rude people in the very small breakfast area, including one man who refused to move from the toaster area, blocking everyone else from using it. It's not rocket science--put your bread in the toaster and step back so that others can use the other slots on the two toasters that are there. Also, guard your chairs with your life. My roommate got up to get something, and someone grabbed his chair without asking if were done with it. Also, we saw the same little girl on the sole computer in the business center every time we passed by. Based upon another post I made, readers should know that this is one of my pet peeves. It is a business center, not a day care. Unfortunately, there was no sign limiting the computer's usage time or its users' age. The fitness center had one but not the computer area. All-in-all, however, we like this property and will continue to stay there when we cruise out of Miami.", "Date": "December 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "", "Title": "“Will return to LaQuinta East again - Very pleased!”", "Author": "SawmillDerek", "ReviewID": "UR122109885", "Content": "We drove to LaQuinta East by Miami Airport the day before our 11 day cruise. Nice, clean, but plain rooms, free parking for car and free buffet next morning. Great Cuban restaurant, Hitching Post, with hotel pickup and return only $5 per couple. Hotel was fine except for noise from overhead planes if that bothers one. Helpful staff, especially Marcel. Be sure not to miss the small service road when trying to locate hotel from GPS. Will definitely return there before our next cruise! Barbara", "Date": "December 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Ann Arbor, Michigan", "Title": "“Know Before You Go”", "Author": "matty18", "ReviewID": "UR121901760", "Content": "This hotel may not be for everyone. It really depends on what you are looking for. It is a great place to stay if you are coming in the day before your ship departs. The shuttle service from the airport and to the ship is free for guests, although you have to be willing to wait a while for the shuttle. The rooms could be a bit cleaner and the breakfast bar was very limited. The size of the outdoor pool is large, but it is not heated. There is absolutely nothing within walking distance from the hotel except a Benningan's restaurant, so you have to be willing to take a cab anywhere else. With all that said, it is a good value for under $100 and a great option to stay at before catching the boat.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Andover, Kansas", "Title": "“Convenient to Rental Car, Free Shuttle to Cruise Port and Airport”", "Author": "MotorgliderPilot", "ReviewID": "UR121802802", "Content": "In very good condition, Friendly helpful service. We arrived at MIA, rented a car and stayed the night before a cruise out of the Port of Miami. The hotel is very close to the rental car facility and walking distance to Bennigans restaurant. We turned our rental car in the next morning and without luggage we chose to walk back to the Hotel (Note there are not sidewalks or crosswalks in some places but it is only a 10 or 15 minute walk) There is a free train connecting the rental car facility to the airport and La Quinta has a free shuttle about every half hour but the time is probably shorter to walk it. We collected our luggage and got a free shuttle to the cruise terminal at the Port of MIami. On the KSA Shuttle we were told we can pay only $10 per person to get the shuttle back to the airport which is cheaper than the cost the Royal Carribean Cruise line charges.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Vernon,NJ", "Title": "“Spent One Night Then to Cruise Ship”", "Author": "Thetravelers01", "ReviewID": "UR121578158", "Content": "This hotel deserves a ten from me! My friend and I stayed here one night prior to hopping on a cruise ship. The shuttle service that picked us up at the airport was on time and the driver was extremely courteous. Upon arriving at the hotel--the front desk was quick to process us when we arrived. We had a two double beds on the fourth floor. In the morning, the breakfast area was quite crowded and there was only cereal out with coffee and bread and bagels, yet, this was just enough to get us through the morning then we were taken by van to the port. Again, staff was polite and treated us with much care. A great hotel four needs. If you are a light sleeper, you may want ear plugs. Airplanes overhead are quite loud. Certainly, this is not the hotel's fault, just the proximity to the airport.", "Date": "December 10, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Cool for one night stay for cruise”", "Author": "nowyouccakes", "ReviewID": "UR121138957", "Content": "Room was okay for a one night stay prior to a cruise. Beds were fine. Carpet was dingy. Check in was easy. Breakfast was typical. Shuttle service wasn't too bad. Easy process. You could definitely hear the airplane overhead. If you buy the transportation for the ride back to the make sure keep your receipt they give you AND wear the sticker they give you. We waited for a while but if it wasn't for the sticker I don't think we would have found the driver. The color of the van was different then they said it would be.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Garden City Beach, South Carolina", "Title": "“Helpful and friendly service.”", "Author": "dine56", "ReviewID": "UR121034483", "Content": "My husband and I stayed here before our cruise. The room was very nice. When returning to the hotel after dinner we were involved in a car accident, the staff was very helpful in secureing our car so we could still travel the next morning as planned. We did a load of clothes in the laundry provided but when I tried to use the dryer it stopped working mid cycle, when I mentioned that we would be traveling with the wet clothes, the maintenence man took our wet clothes and dried them in the machine used for the sheets. We have another cruise planned and will stay here again.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Shenzhen, China", "Title": "“who run this place”", "Author": "MeCarg N", "ReviewID": "UR121013100", "Content": "Nice building but the real is no one goes above and beyond all staff that acts like robots very ordinary staff bed are ok but carpet stanis-poor breakfast....sucks", "Date": "November 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Marietta, Georgia", "Title": "“Overnight stay before Anniversary Cruise”", "Author": "PrePre1977", "ReviewID": "UR120889599", "Content": "The hotel is hard to find, best if there is two people in the car so one can look out for it. Check in was a breeze. We were the first ones to sign up for the shuttle for the cruise port. Our room was great. It was facing the airport but we did not hear any planes taking off or landing. Went to Bubba Gump for dinner had that already planned. Woke up early for the shuttle trip. First ones down to breakfast. Made two waffles and had some yogurt. Plenty of juice. Hubby had the same. We did move so others could sit down to enjoy their breakfast. Enjoyed the free shuttle but did not get the opportunity to take advantage of the return price for the shuttle. They didn't offer it and I would have paid for it. Got a cab from cruise port and that was the worst mistake ever! Next year I will make sure I ask about the return pick up for extra money. The shuttle was not crowded we had a few empty seats. Price was great $66.67 for one night after taxes the price was 89 when I first booked our room but it dropped in July to 59. Glad I rebooked it bc it went back up. Will I book them again for a Miami trip? Yes I would.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Sun City, Arizona", "Title": "“overnight stay before cruise”", "Author": "sdscaz", "ReviewID": "UR120673969", "Content": "We have stayed in La Quintas from CA to Fl and this was our least favorite. The rooms were clean and the bed comfortable. The noise from the airport (felt like you were on the runway) made it hard to sleep. Breakfast was not up to La Quinta standards. No muffins or pasteries, no yogurt, no fresh fruit. The employee said they were out and it was only 7:45 am. Free shuttle to the cruise ship made it all worthwhile.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Get what you pay for”", "Author": "ohio1956", "ReviewID": "UR120643547", "Content": "Choose La Quinta mostly because reasonably priced and included breakfast and transfer to Port of Miami. Unfortunately it wasn't a great experience. After checking in my 20yr old daughter-in- law saw a very large bug and couldn't forget she saw it. So I sent my son down to see what they could do. Staff was very helpful but said nothing could be done but checked with manager maybe who was just coming in and he arranged for another room. Very thankful. Breakfast was OK but things got much worse with the free shuttle to port. I believe transport name on bus was SKA. He packed us in bus like sardine with no air conditioning or open window in 90 degree plus full sun for 15 min while he loaded the suitcases. When he got in he said he had 3 rules, your'e on vacation, no complaining , and he drives fast. 20 hot min later I had 3 rules for him. He drives like a maniac, the ride was torturous and hot, and I am on vacation and a fourth, no tip for you thank you. The hotel needs to hire another co. That was terrible", "Date": "November 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "2"}, "AuthorLocation": "santa ana, ca", "Title": "“Everything was good but.....”", "Author": "ocwarren", "ReviewID": "UR120527341", "Content": "For easy exits to the airport this is your hotel. This La Quinta literally sits next to the airport. I can see planes. Never stayed at a La Quints before at least that I can remember. This one once you get inside was fairly nice. The room appeared to be cozy and the bed comfortable. The view only a parking lot but I guess better than facing the airport. The breakfast was typical continental style breakfast but complimentary so no need to complain. The but that I was referring to in my title was...... I caught a small live cockroach crawling across my bathroom floor which I quickly squashed and flushed. All the other bathroom amenities were on par. All I can say is that it was a nice stay and for many reasons I would consider staying again, but just on the slight notion that I will find more creepy crawly disease ridden bugs I will do my best to stay somewhere else.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Palm Coast, Florida", "Title": "“Fine for a Night at the Airport - A Parking Tip Follows”", "Author": "chris32137", "ReviewID": "UR120482189", "Content": "Note: see near the end for a tip that will save you money. We stayed at this hotel on our way out of town. It was basic, but fine for a night. The rooms were tired, the linens were tired, the place was a little dirty, the breakfast was abysmal, but the location was perfect and it was OK, but not great value. Everything above should be self expanatory, but the breakfast deserves comment. One worker was trying to deal with a flood of people, families, kids, etc. Coffee was out, there was a line for the microwave, bagels were removed, etc. etc. You get the picture. The prize wasn't worth the cracker jacks... It was at best \"amateur hour\" and management clearly wasn't at home. What made it almost OK was (and here is the tip) that La Quinta has a policy in several of its airport inns, to give you free parking for up to a week if you stay there the night before you leave. This is great because you can come in the night before, extend your vacation a day, and leave your car, virtually for free. Everybody wins. So, this hotel was \"OK at best\", but remember this tip when you fly. Check out La Quinta for free parking. You may get a nice bonus on your vacation.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great hotel”", "Author": "Edgaroliveira", "ReviewID": "UR119535686", "Content": "Nice hotel, my room was very clean, the staff was great. My only complaint is that i got a smoking room. The rest was ok! Recommend!", "Date": "October 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Castries, St. Lucia", "Title": "“Good for short-stay”", "Author": "Dequanna", "ReviewID": "UR119516113", "Content": "Friendly service and genuinely nice staff. Adequate continental breakfast included in the room. Easy, comfortable atmosphere and free airport shuttle is a definite plus. I don't like the fact that the sink is outside the bathroom area and over a carpeted area. This means that the carpet is often damp from splashes and it contributes to a faint but persistent odor. I suggest that the area around the sink should be tiled. I believe the overwhelming fragrance one of the reviewers referred to was to mask this carpet odor. Otherwise, not bad value for price and I would stay there again.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Orlando", "Title": "“Great value for price.”", "Author": "jes58", "ReviewID": "UR119388934", "Content": "Convenient location for cruisers. Staff very friendly and helpful. Free shuttle to the port. Very reasonable rates. Was a little wary because of the rates but was pleasantly surprised. Car can be parked there for a week, also free. Would definitely stay again.", "Date": "October 17, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "tinlizzy2", "Title": "“Migraine inducing fragrance everywhere”", "Author": "tinlizzy2", "ReviewID": "UR119057896", "Content": "We have stayed here 4 times pre-cruise because flights from the Midwest usually arrive late. They have breakfast and a free shuttle. Unfortunately someone decided to put air fresheners in all the air conditioning units, including the shuttle's rear air conditioner. I had a migraine within an hour and they offered me another room when I questioned them - denying there was any fragrance. Same smell different room. Again they lied about using a fragrance. By morning I had what sounded like an asthmatic cough and splitting headache - they gave me 20% off the room. It was the shuttle driver who finally came clean and admitted they were pumping in fragrance throughout the hotel and shuttle. The worst part was that 2 outfits, night clothes, and my suitcase all reeked of whatever they were using and the horrible smell followed my to the nice clean ship. Never again!", "Date": "October 7, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Athens, Georgia", "Title": "“It was good”", "Author": "b0bdole", "ReviewID": "UR118145610", "Content": "I really enojy the hotels accomodations they let us park our car for a week there for free as long as we paid for one nights stay!! Great deal they had a pretty good breakfast too, which was also included into the package. This is a great hotel for travelers and cruise-goers!!!!! plus it is right next to the airport for frequent flyers too and you couldn't even hear the noise of the airport considering how close you are. My daughter enjoyed watching the planes come in literally right over your head.!!!", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Worcester, MA", "Title": "“Terrible room and location”", "Author": "Colon197", "ReviewID": "UR117772110", "Content": "Unless you want to sleep directly below where airplanes pass through, want to end up with a smelly room of a smoker and want to walk a 500 yards to get breakfast in the morning or anything else. Do not stay here. This La Quinta is oddly designed. There are sections that separate from the main part of the Hotel and it is quite a walk from the main part of the Hotel. Breakfast closes at 9am, there are not fridges or microwaves in the rooms as i expected. I was just not very impressed with this place at all. Not a very family friendly place and the pool closes early. People are friendly, i guess that is the only positive thing i have to say about this place and its proximity to the Airport.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "San Jose", "Title": "“Just what you need when you're waiting your connection flight”", "Author": "lehpares", "ReviewID": "UR117620189", "Content": "I stayed at La Quinta just for one night because my connecting flight was scheduled for 7 am next day. I red some of the TripAdvisor comments and decided to book this hotel. Is fairly good. Small, no amenities, comfortable beds, free WiFi, quite rooms and close to the airport. Daniel, the frontdesk person that night was really nice and helpful, he likes to help you and go beyond his duties. Good things: shuttle from/to airport, close to the airport, quiet rooms. The flaw: the breakfast opens at 6 am, since my flight was at 7 am, I couldn't had breakfast at the hotel. Resuming: good hotel when in a budget and thinking to be close to the airport.", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "New York City, New York", "Title": "“Dirty”", "Author": "Gerry049", "ReviewID": "UR117428974", "Content": "I picked this place because it had good reviews and was close to the airport with a free shuttle. As I had an appt late that afternoon, I came in late. Front desk staff were friendly and check-in was quick. I got to my room rather late. I noticed that, like many Miami hotels, they had a problem of people coming in and shoving pizza delivery advertising sheets under the doors. Not only were many under the door but all over the hallway. I got into my room. TV was old CRT that was slow to warm up. Wash basin had encrusted particles on it. Went to bathroom. Skid marks in the bowl. I would have taken photos had I brought my camera. I phoned reception and I was promised to have my call returned within 20 min (rush of customers). I waited an hour and then called back (it was 11pm). Receptionist apologised and said she had a rush of customers and was about to call me back. I further explained the problem and my reluctance to use the toilet (if they did not brush the bowl, think about what else was missed. She apologised and offered me 20% off the bill - she said that she would leave a note for their contracted out housekeeping. No new room or honoring La Quinta's guarantee of a free night stay if unsatisfactory. due to the late hour and no new room, I had to clean the toilet seat before I used it myself.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lexington, South Carolina", "Title": "“AWESOME HOTEL FOR CRUISE GUESTS & OTHERS”", "Author": "MRSVICTORY", "ReviewID": "UR116959882", "Content": "This was a quaint little hotel off the beaten path but I enjoyed it. If you are looking for sparkles and glam then head towards the port but if you want a substaintial hotel for a good price, VERY friendly staff, clean and free parking, then this is it. We chose this hotel b/c of our 7 day Carnical Cruise. If you're not aware; if you choose to park your car at the Port near where the cruise leaves, its about $20 per day. But if you stay one night here you can leave your car for up to 7 days for FREE! On top of that they have a shuttle that takes you to the Port! You cant loose. The shuttle was early, & got us there in more than enough time. They also have a service via the hotel that will arrage for you to be picked up but we decided on a taxi back from the port. It seemed quicker for about the same amount. Checking into the hotel was quick and easy. We were given a nice room with 2 queen beds. Very clean, standard bathroom. Internet was a little slow but Im not tripping about it. All in all this was a nice hotel that I would return to especially if Im taking a cruise. The room was only about $80 and there was also a free breakfast buffet. Kudos to all staff members!", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Binghamton, NY", "Title": "“Clean hotel, moldy air system”", "Author": "zanothree", "ReviewID": "UR116796529", "Content": "This hotel was convenient as it had free shuttle service from the airport. We were headed on a cruise and they also provide free (one-way) shuttle service to the port. This saved us quite a bit of money. However, I experienced very fairly severe headaches while I was there, and now believe that it was the air conditioning system that caused this. When we got on the cruise boat all of my symptoms went away - so I believe the hotel system was the cause. If you are sensitive to mold issues I would not recommend this hotel - otherwise, it was clean and the staff was friendly and helpful. Breakfast was also very nice and well-served.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "2.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Wentzville, Missouri", "Title": "“Next time we'll pass...”", "Author": "micheleb011", "ReviewID": "UR116659486", "Content": "From the moment we arrived and contacted La Quinta to pick us up at the airport, it was a disppointment. The shuttle they provide that runs every 30 minutes took longer than promised. In fact, some of our party caught the neighboring hotel's shuttle to come back after they waited over an hour. The pool was dirty and filled with salt water which we weren't expecting. Hard to enjoy the pool atmosphere with the airplanes from nearby Miami Airport. The rooms were not ready even though we arrived 2+ hours after check-in time. There is 1 restaurant within walking distance, and that was it! Nothing else in Miami is nearby. Hotel staff was mostly pleasant, but there was one gentleman that we dealt with (manager?) that was abrupt and pushy that we did not like dealing with when we purchased our ride from the Port of Miami to the airport at the end of our cruise. Word of advice--hold onto your receipts. On the bright side, breakfast provided was great; had a wide variety and was kept well-stocked. Rooms were clean. Guests in hotel were fun to be around as most of the guests seemed like they were excited and prepared to go on a cruise like we were.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Jordan Valley", "Title": "“Adequate for precruise stay”", "Author": "ilanastone", "ReviewID": "UR116657104", "Content": "We stayed there recently precruise. Unfortunately we had a very long wait for the shuttle to collect us from the airport. We didn't have a cell phone and had to ask someone to use theirs and it wasn't clear how to call them from the airport, we saw no telephones. We had an hour wait before the shuttle collected us, which was very distressing and tiring after our flight. The room was comfortable but the motel isn't really close to anywhere for evening meals so we had to snack there. The breakfast was good value although it was very inconvenient try to find sufficient seating. Most people were staying there precruise and there were not enough tables and chairs to cater for the amount of people waiting to eat. We took a cab to the nearest drug store to do our last minute purchasers for the cruise, there were no convenient stores close by. The free shuttle to the port was convenient and organised. I'm not sure if I'd stay there again.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "5", "Service": "4"}, "AuthorLocation": "West Virginia", "Title": "“Hotel was fine after we found it”", "Author": "JoeyHWV", "ReviewID": "UR116245423", "Content": "Had a terrible time finding the hotel due to really crappy directions from our car's GPS, that seems to be a trend on this vacation. We stayed overnight here before our family cruise. The hotel is older and not as fancy as hotels we usually like to stay in but for under $75 including free parking during our cruise, free breakfast and free shuttle that's not a bad deal. The hotel looks clean, I always check the bathroom to really judge a hotel and ours looked good, no mold or anything else icky. If you want the Ritz I wouldn't stay here if you want a clean place to lay your head down before you catch a plane or a ship then this place is for you!", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Miami, Florida", "Title": "“Needed two nights in Miami before flying overseas”", "Author": "MichaelJC", "ReviewID": "UR116107750", "Content": "This was a decent option near the airport that allowed me to have my meetings and be close to some big box stores I needed to shop at before departure. Planes do fly over but the noise stops over night. The hotel was truly average in most regards, with service being a bit below and cleanliness abit above standard hotels. The problem with the customer service was not attitude, but seemed to come from lack of staffing which kept the front desk staff backed up regularly. If you need a night or two...there are worse options.", "Date": "August 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Fairbanks", "Title": "“Free van transport to cruise dock!”", "Author": "Fairbanksfour", "ReviewID": "UR115938150", "Content": "Nicest desk staff you will ever meet! FREE van transport for you and all that luggage to Port of Miami for your cruise! Free breakfast! All for under $80.00 night. Rooms and swimming pool very clean. Not the Ritz, but I will definitely stay there when I am cruising out of Miami! A rare find!", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Decent for Pre-Cruise”", "Author": "VeeRated", "ReviewID": "UR114596195", "Content": "I have super high expectations for cleanliness at hotels. I did tons of research making sure which hotels have had reports of bed bugs and this one was the best deal in a decent location and the best part was: they have a free shuttle from the airport to the hotel and from the hotel to the port of miami. Unfortunately, I called for a shuttle and the phone just rang constantly and no one EVER picked up. Luckily my friend had a different flight and had taken a different shuttle from Ft. Lauderdale and was at the hotel when I called so she had me talk to the lady at the front desk on her cellphone. (Who was amazingly nice by the way). When the shuttle got to the airport the driver was on the complete opposite side from where all the passengers were standing and even though I was waving him down he did not stop and drove past me causing me to have to wait 45 minutes for a return trip. Not cool. Finally I got to the hotel and check-in didnt take too long even though I was last in line. Be sure to book your port shuttle when you check in! Its really important because the next morning is complete chaos. The hotel itself was clean enough. Nothing spectacular. Just do yourself a favor and dont look at the mattressess under the sheets or you'll gross yourself out. :) The sheets themselves were clean though luckily. (Being the germaphobe I am, I always bring my own sheets) I did my bed bug check (using a blow dryer, check the internet for directions, lol) it came out clean and we got settled in. Our remote didnt work but they replaced it immediately. Other then that, the room was pretty good. Black out curtains were perfect. There's literally nothing around the hotel except the highway and a Bennigans which is awesome because all the ones I know of had closed down so we went there for dinner. They recommend not eating at the places that put fliers under your door. And trust me, you will get some. We got about 8 of them. Just eat at Bennigans and call it a night. As for the continental breakfast.. It was crowded but the lines moved quickly. Nearly everyone there we later learned, was there for a cruise. They had cereal, fruit, a waffle maker!!, bagels, bread, etc. Pretty standard. It would've been awesome if they had lactose free milk but I guess you cant win em all. :) We checked in and signed up for the 12 o'clock port shuttle and we were the first on the list for that time. It was so very unorganized and chaotic that they never called our names out and we missed the shuttle leaving us to wait an hour I think for the next one. I was pretty angry seeing as how I had talked to the guy about the shuttle less than 10 minutes prior to finding out we missed it. He was super apologetic though at least. Overall, just be patient with the shuttles and you'll be fine. If youre looking for some night life, stay in SoBe. This place is great to stay for pre-cruise and despite the shuttle mishaps I'll def stay here the next time I cruise out of Miami. :)", "Date": "June 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edmonds, Washington", "Title": "“Nice place close to Airport”", "Author": "celticgypsy", "ReviewID": "UR110182048", "Content": "Stayed there two separate nights and was pleased at the value and liked the location if you're needing to be near the Airport.", "Date": "May 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Comfortable and Convenient.”", "Author": "kmaz100", "ReviewID": "UR110066904", "Content": "Only stayed for one night on return from Honduras. Really strong hot showers and comfortable beds!!! Although it is beside the airport, the double glazing works really well and we all slept soundly. The breakfast was great but there was not a lot of sitting room as it was very popular, but we only had to wait a few minutes for a table. Delicious waffles.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California Foothills", "Title": "“Perfect if you are taking a cruise”", "Author": "Going4now", "ReviewID": "UR108567446", "Content": "They pick you up at the airport and take you to the hotel and the next day they will take you to your ship. Be sure to sign up for the transportation for the cruise drop off as soon as you check in, otherwise you will be fighting the crowds the next day. The breakfast is good, the rooms clean...good price.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Belmont,Ma", "Title": "“Shuttle to cruise great bonus!”", "Author": "KAD56", "ReviewID": "UR105873928", "Content": "check in was quick, we had 3 rooms for family on 3rd floor, breakfast was very nice , but with it being Vacation wk we had a hard time finding chairs for everyone to eat, we had to take turns/shifts to eat, waffles & eggs good. We returned a rental car in the morning , but had a hard time finding LaQuinta shuttle to get back ,So ck directions @ front desk. We received our shuttle time of 11 for Norweign cruise & bus came as scheduleed, Lg window that we sat next to was badly broken , hope they fix before someone gets cut, I had to change seats with my nephew(age 8) because he would have poked at it! Driver polite & ride was about 15 min to cruiseport, we tipped him for freee ride, I would stay again before or after cruise !", "Date": "April 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Destin, Florida", "Title": "“OK for pre-cruise overnight”", "Author": "RainbowWrasse", "ReviewID": "UR104897203", "Content": "My mother and I stayed here both the night before and the night following our cruise. The pre-cruise stay was fine. I arrived much later than expected due to a delay in my flight, and mom arrived first. Evy at the front desk was very helpful and allowed mom to check in without me (I had the credit card). They gave us a standard double rather than the superior king I had pre-booked, but said nothing about the change, so I had to take initiative to speak to the front desk the next morning and they adjusted the rate. Breakfast is quite substantial, and the transportation to the port (the primary reason we booked) is well-handled. On the basis of just this night, I would have rated the hotel higher. We took the advice of previous reviewers and took a cab from the port to the hotel following disembarkation, so I can't speak to the efficiency of the post-cruise transportation for which there is a fee. We arrived at the hotel mid-morning, and by noon they were able to check us in, which was nice. There were 3 things that soured me on this hotel: (1) In this room the carpet was filthy, as the bottoms of my feet (and socks after I realized how dirty the carpet was and put them on) picked up the dirt; (2) The toilet paper roll had not been replaced and quickly ran out, nor was a spare roll available. When I called the front desk, they said I had to come down and get one (???!!!); (3) After checking out and returning home, later that day I developed itchy bites on my toes, the last vestiges of which are still there 1-1/2 weeks later. I don't think they were mosquito bites. We had to leave much too early for breakfast, so the overall value of that final night for the price was just not there. With regard to customer service, one of my pet peeves is being asked for a high rating on a survey. This hotel has permanent signs in several places saying that they strive to provide the highest service and if a post-stay survey is received to please rate them a 10. I don't know about you, but making a guest come down to the front desk for a roll of toilet paper doesn't strike me as a high level of service! Regarding dining, again at the recommendation of previous reviewers, we walked over to the Embassy Suites for an early dinner rather than to Bennigan's. (I don't think I'd do this in the dark.) Although the service was very good and the food was tasty (albeit swimming in butter), the prices were outrageously high. Portions are huge, so unless you are very hungry, I'd recommend splitting a salad and an entree between two people. Note: We tried calling the Cuban/American place to pick us up as suggested by one person, but they were short-staffed and could not provide transportation. All in all this hotel is a decent value for a pre-cruise overnight stay including breakfast and port transfers.", "Date": "April 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Denver, CO", "Title": "“Just what we needed”", "Author": "mrxcitement", "ReviewID": "UR103805950", "Content": "We booked our stay at the La Quinta Miami Airport East after reading reviews on Trip Advisor. What we needed was a reasonable hotel that offered free transportation to the airport, so I could return our rental car, and to the Port of Miami for the start of our cruise. This place did both. For the airport, all I had to do was return the car, take the rental car shuttle bus to the airport, and then catch the La Quinta bus back to the hotel. For the port shuttle, you MUST tell them when you check in that you need a shuttle to the port. They're familiar with all the regular cruise schedules and will get you to the port in plenty of time. As far as the hotel, the public areas and rooms were well maintained and comfortable. They include a free breakfast too, so that was a real money saver. The hotel is not in a particulary attractive area and is pretty much wedged in between a number of highway ramps and access roads, but that's what you get at airport hotels. The pool area was fine but the noise from the jets overhead kept me away from that area. You CAN hear jet noise in your hotel room but it's well insulated enough that the noise level is acceptable. All in all, this was a good value. Our stay was comfortable and hassle free, and the shuttle service worked well for us. Oh, and there's a Bennigans within 2 minutes walking distance.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Nome, Alaska", "Title": "“disappointing”", "Author": "orito63", "ReviewID": "UR103510656", "Content": "We booked a night at this hotel through Expedia. When we arrived with our confirmation code, after flying for 24 hours without sleep, they had no record of our reservation and no rooms available. Don't know if it was their fault or Expedias, but the staff was nice and the price and location by the airport were good, so we gave them another chance on our return from Ecuador. On the 2nd round we booked through the hotel and actually got a room, but we found dried urine all over the toilet seat and the sink was full of hair and dried toothpaste.", "Date": "April 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "St. Petersburg, Florida", "Title": "“Perfect for a pre-cruise stay.”", "Author": "mkirch72", "ReviewID": "UR102023539", "Content": "Selected this hotel because of it's pre-cruise related amenities, and it did not disappoint. Included in the hotel rate is a free airport shuttle, free continental breakfast (including fresh waffles, cereals, fruit, yogurt, toast, bagels, muffins, fresh fruit, coffee, juice, etc.), and most importantly: free shuttle from the hotel to the cruise ship AND the ability to leave your car parked on the hotel property for FREE for up to a week if you stayed at the hotel. This deal absolutely could not be beat. Regarding the hotel itself: PROS: --Comfortable, updated, super clean, spacious rooms (see cons also). --Outdoor swimming pool (nice to unwind pre-cruise after long flight/drive). --Friendly, patient, accomodating staff (see cons below). --Good selection for continental breakfast and staff member quickly cleaning all tables and replenishing food selection. ---Free shuttle to cruise ship was fairly well organized and very punctual. CONS: --Room had that distinct \"this is NOT a non-smoking room\" smell. But this was my fault as I had not specified in the booking and the hotel was sold-out. --Front desk was completely under-staffed during check-in. One employee was responsible for checking in a line about 10-20 people long, directing housekeeping staff via walkie-talkie, accepting deliveries from vendors, answering the switchboard phone, answering questions from current guests walking up to the counter, and booking day tours. As ridiculous as this sounds (hotel management, please give this girl a break), the employee performing these tasks (Ana I believe) could not have been more pleasant, professional, courteous and accomodating. She worked as quickly as she could and everyone in line could see that it was beyond her control, so luckily there were no tempers flaring. --The hotel allows local \"restaurants\" (I say this sarcastically) to deliver menus under the room doors in the evenings. These menus (many of which look suspiciously similar to one another), tout the fact that they deliver. We assumed this was with the hotel's blessing as six to ten of these so-called menus were slid under our doors over the course of an hour or two. So we ordered a pizza. This 'large' pizza was about the size of a small dinner plate and we were charged a ridiculous amount of money for it (approximately $20 including tip). The flavor was non-existant and the crust was barely cooked. I spoke to another guest who said they called the front desk and asked about these menus before ordering (lesson learned for me) and they were told the hotel does not recommend ordering from these establishments. This is something the guests should know. The hotel should either 1.) prevent unauthorized distribution of these menus or 2.) notify guests at check-in that they do not recommend ordering from them. At the very least this should be noted in the hotel information binder in the rooms. ---Dinner options are limited. There is a Bennigan's right next door. However, the Bennigan's chain has closed. This is apparently one of only two left open in the country as they were owned by a franchisee. Unfortunately, it shows. The wait staff could not speak English (I am bilingual and could not get my point across in English or Spanish), the cleanliness was NOT acceptable, and the food was a cheap imitation of what I remember as Bennigan's food (which doesn't say much). Unfortunately, if you don't have a car, there isn't much other choice. If I had to do it all over again, I'd order from Pizza Hut, Domino's, or Papa John's online. At least you know what you're getting. ---Location is literally on the perimeter of the airport. When using the pool, you will be able to waive to the people's faces you can see on the plane as they are so close. As a result, holding a conversation is next to impossible. And they take off about once every other minute. This fact doesn't bother me personally, but it may bother some. However -- the rooms are pretty well sound-proofed and I could barely hear them at night. Overall, the pros of this hotel far outweighed the cons. Every place has some areas they can improve upon. However, the relatively low price, comfortable, updated rooms, and cruise-related bonuses that are included in the rate make it definitely worthwhile. We will definitely be staying here any time we cruise out of Miami.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "rochester, ny", "Title": "“Nice but noisy”", "Author": "ten78cop", "ReviewID": "UR100480612", "Content": "We always pick this hotel for pre and post cruise lodging. Rooms are nice, clean, and the service is typically good. Convenience of shuttle service is a plus. Only down side is Airport pick up service is spotty. On this visit we waited an hour and 45 minutes to be picked up from the airport by the bus. Front desk kept claiming \"He's out there...\" Hotel is 5 minutes from pick up point to lobby. Port service is still free but now is serviced by an outside carrier who makes several stops at other hotels. He will sell you a return ride back for $20 but time window was only 1 hour. He claimed cab was $40 back. We only paid $30 for a cab including tip. If you're looking for peace and quiet you will not find it here. This property is directly on the main MIA runway. Planes start at 5am and go non-stop until around midnight. There are also whistle blowing trains in the area. This property is pretty much isolated. There is a crappy Bennigans restaurant next door but other than that and the Embassy Suites next door there is nothing. I suggest you do not wander far from this property. There are plenty of delivery fliers dropped off at the hotel. Morning breakfast is okay as far as freebies go. Hotel arranged a Miami City tour for us on our post cruise day. $60pp, 4hrs long and enjoyable.", "Date": "March 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“Good for a stay before and after your cruise”", "Author": "DuffyMax", "ReviewID": "UR100388286", "Content": "We stayed here the day before and after our cruise. Mainly because they offer a free ride to the port. However when returning to the hotel we had to pay $20 bucks for 2 people. Not that bad. As far as the hotel staff, they were very helpful and friendly!! The rooms where in okay condition. Some new carpet and TVs would do them more justice. However, the rooms where clean and the beds were comfortable. For the price and the short stay it was worth the money. The breakfast was just so-so. It's your typical hotel continental breakfast (etc. muffins, bagels, cereal). There is a Bennigan's in walking distance of the hotel, but the service and the food is not good. If your hungry just order pizza or something from the fliers that are pushed under the door. Also, since this hotel is close to the airport; (which is convenient); it is at times noisy because of the planes. So if your like me and NOT a sound sleeper bring ear plugs.", "Date": "March 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Chester, Maryland", "Title": "“Great Hotel”", "Author": "jbsmes", "ReviewID": "UR99883358", "Content": "For the purpose of our trip this hotel worked great. There were about 30 of us that were taking a cruise the next morning. All flew in at different times and all made it to the hotel without a hitch. Their airport pick up was great. Rooms were nice, morning breakfast was great. The reason we booked this hotel was because they offer transfers to the ship the next morning. This is provided by the hotel free of charge, but it is not the kind of tranfers where you pick the time. Basically they have 2 buses. 1 that left at 10:00 to certain ships (that was ours) and then a bus at 11:30 that left to other ships. You did not have a choice. But it worked out fine. We did get to the ship a bit early but we all just waited and we were some of the ones that got on the ship first. The only drawback of this hotel is that you are in the middle of no where. There is not a thing around you except the Embassy Suites and Bennigans. Which is where we all ate, twice that day because there was no place else if you did not have a car. But the food was good so we were happy.", "Date": "March 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bogota, Colombia", "Title": "“Decent, with friendly staff”", "Author": "Tecleski", "ReviewID": "UR99726534", "Content": "I had to do a short stopover in Miami, and I was looking for a cheap hotel close to the airport, and, having read some Tripadvisor reviews, I chose La Quinta Inn East. Well, I don't regret having picked it up. The staff is very friendly, the room itself was big and everything in it worked fine. It's not the cleanest room I've been in, the carpet is stained, but overall, I have no complaints, for the hotel was not sold to me as more than it actually is. I wouldn't recommend the hotel to anyone having a very light sleep, for although the windows have double glass, you still can hear the airplanes landing and taking off at all times, but I sleep like a log, so it wasn't a problem for me. I'd definitely stay there again.", "Date": "March 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Noisy and Dirty!”", "Author": "Flydawg1", "ReviewID": "UR99276930", "Content": "The staff was great, friendly and professional, but the hotel was understaffed. The noise from the planes and the train directly behind the hotel was very loud not to mention that you could hear everything that was going on in the room next door.", "Date": "March 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3"}, "AuthorLocation": "Hope, Maine", "Title": "“Location is good for access to Miami but not a nice neighborhood.”", "Author": "SailingKairos", "ReviewID": "UR98661498", "Content": "Chose this La Quinta for it's relatively inexpensive price tag and yet relatively easy access to the city. Moderately clean, breakfast provided. Pet friendly. However the hotel is located behind an abandoned restaurant and backs up to airport parking lots. Unlike other hotels in the area this one doesn't have a gate with an attendant for the parking lot - they do have cameras. We didn't sleep well worrying about a car full of camping gear.", "Date": "March 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Decent place, good value”", "Author": "travellerDhan", "ReviewID": "UR97382390", "Content": "I stayed at the La Quinta Inn and Suites on Feb.19 & 20th with my wife. The hotel is very clean, staff is friendly & professional. Rooms are comfortable and washrooms are decent. Its next to the airport so it can be noisy. I paid $135 a nite and highly recommed the stay here", "Date": "February 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "NORTH CAROLINA", "Title": "“Great value!”", "Author": "NC-BIKER", "ReviewID": "UR97329234", "Content": "After reading reviews about this Inn, we were anxious to try it for one night prior to a cruise. We were very pleased with the stay and would not hesitate to stay again prior to another cruise. The staff was friendly and helpful. It was a REAL bonus to get the free parking while we were on the cruise as well as the free shuttle to the cruise port. It's very close to Miami International Airport, which worked out well for us when picking up another couple who were cruising with us. As stated in other reviews, because of the close proximity to the airport it was a bit noisy but that's what ear plugs are for.... definitely not a detriment to staying there for us.", "Date": "February 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Redford, Michigan", "Title": "“Great Service!”", "Author": "CarnivalCruiser43", "ReviewID": "UR96383399", "Content": "I recently stayed at the La Quinta Inn and Suites on Feb. 7th for a overnight stay before a cruise. The hotel was very nice and the staff was friendly and courteous and professional. I found the rooms to be very comfortable and even though the hotel was next to the airport I was not disturbed the least by the airplanes flying over. They offered a free shuttle to the Port of Miami that the young lady at the front desk signed me right up for right after I checked in. The only problem I had with the hotel was that it is that there is very little around the area and you have to have a car or take a taxi to get somewhere. But what really impressed me with this hotel was the response that I received after I did a online survey giving my overall experience and recommendations: 'First and foremost please accept my sincere apologies for the inconvenience you received during your stay, and for not receiving the proper services you surely deserve. I want to thank you for your suggestions on the breakfast items and I would like to apologize for the lack of variety with the fruits. I will be sure to look into that issue myself. I would also like to thank you for giving me your perspective on our shuttle service. You make very valid points and I will make sure to make some improvements in that area. At this time I would like to offer you 10% off your room rate as a token of my appreciation. I have refunded the MasterCard ending in .....in the amount of $ 12.11. You should see a credit to your account within 2-3 business days. I know this does not justify any discomforts you may have experienced, but I do hope you can accept this as a good faith gesture in our part. If you are in the area again I do hope you can stay with us and give us a second chance to make things right. Again, my apologies, and thank you for letting me know of our shortcomings so I may rectify the issues.\" It wasn't that my hotel stay was horrible and the few complaints I had were about simple things but the fact that they took my survey and my comments to such an extent that they refunded 10% off my room rate back to me really impressed me to an extent that I would stay at this hotel again if I am ever back in Miami for a cruise. It was great customer service. Oh, and by the way, Bennagin\"s(sp?) is right next door. Avoid at all costs! The food sucked and the service was even worse.", "Date": "February 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Saginaw, Michigan", "Title": "“How to make travel cost effective!”", "Author": "LJB049", "ReviewID": "UR96324232", "Content": "If you are traveling from Port of Miami, on any of the cruise lines, this maybe the place for you. They supply a shuttle to and from airport, no charge, and to the port, again no charge, savings $25. If you are driving you may leave your car for 7 days, free, savings $70 to $140. Room rates are on par with comperable hotels about $100, the rooms are clean and comfortable and the staff is very helpful. Breakfast and a pool are both a bonus, good, clean, and free. I'm not saying to stay for a week, but for one or two nights it's a great value. Only downside is it is near airport, so you do get jet noise.", "Date": "February 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Birmingham, Alabama", "Title": "“Nice place to stay”", "Author": "Queenkt08", "ReviewID": "UR95207291", "Content": "My husband and I stayed at this hotel before and after we cruised. The staff was friendly, professional and accommodating. Things that I liked about the hotel included: Free shuttle to and from the airport, free shuttle to the port of call and the continental breakfast. After our cruise we went back to stay another night (take advantage of the $10.00 per person shuttle pick up as a taxi ride will be a little more expensive.) The hotel need to be updated, but it was clean and the bed was comfortable. We arrived back to the hotel hours before check in; the staff was kind enough to let us leave our bags in a storage like room. The only thing I didnâ€™t like was nothing in walking distance (thereâ€™s only one restaurant close to the hotel). This is good place to stay if cruising.", "Date": "February 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Davenport, Iowa", "Title": "“Outstanding value and friendly staff”", "Author": "cfgrb", "ReviewID": "UR94936380", "Content": "Two day precruise stay. The Staff was warm and friendly, very helpful. The cruise transfer was seamless very well done. For dining I would recommend the Embassy Suites next door or the Hitching Post BARBQ about three minutes away by car, if you call them they will pick you up and bring you back at NO CHARGE and generous servings great food and reasonably priced American, Mexican and Cuban items on a vast menu 305 877 6012 begin_of_the_skype_highlightingÂ Â Â Â Â Â Â Â Â Â Â Â Â Â 305 877 6012Â Â Â Â Â Â end_of_the_skype_highlighting. The continental breakfast at the hotel is more than adequate. I would avoid Bennigans next door the service is slooooooooow and cleanliness is a major issue there were three other couples at 1:00 P.M. and it took two hours for sandwiches to be served, table tops and floor were sticky.", "Date": "January 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "st marys bay, romney marsh", "Title": "“Great place to watch planes”", "Author": "hollyarran", "ReviewID": "UR94777055", "Content": "Friendly welcome when we arrived, its location not far from the rental car centre was good. Some noise from Train Horns and low flying aircraft. Room clean and well appointed, breakfast better than at our second hotel. Only problems were a broken U lock on the door and when i flushed the loo in the morning it kept on filling ending up with a flooded floor. I managed a temporary fix and told Reception who advised that maintenance would have a look when the came at 9. Full marks, when we returned to the room after breakfast, it had been fixed and the floor cleaned and dried. Would i stay here again, yes definately and with an excellent american irish restaurant next door maybe for longer this time", "Date": "January 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "richmond hill,on", "Title": "“a good value for your money,clean ,nice front desk staff”", "Author": "indica007", "ReviewID": "UR94394644", "Content": "we stayed for 1 night after a cruis.the rooms were clean with a coffee maker which we really appreciated.an additional cream and sugar was provided later at night at our request at the front desk.we could hardly hear any airplane noise in the room,concedering the proximity to the airport.ok complementary breakfast.breakfast area crowded and small.nice pool area if you don't mind the loud airplane noise.polite front desk staff.make reservations ahead of time as it's extremely busy.an exellent restaurant 1 minute walk.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Average hotel...worked ok for one night”", "Author": "LOVEROFPV", "ReviewID": "UR94076724", "Content": "We stayed here for one night on January 8th, pre-cruise. We booked this hotel for a couple reasons, free airport shuttle and free shuttle service to the pier. However, we waited for over an hour for the airport shuttle to pick us up and the pier shuttle was full so only 5 of the 8 of us could get on the shuttle, so 3 of us had to pay $37.00 for a taxi. The hotel provides continental breakfast, but good luck trying to get to any food, at 7:30am it was already packed! My husband had his waffles taken away from him as they came out of the toaster by another hotel guest. The pool area is not enjoyable as the planes are flying directly above the hotel. I would not recommend this hotel to anyone! It was not the way I wanted to start out our vacation and I'm sorry I didn't listen to other travelers that told me to stay clear of this hotel. And, the location is not very desirable to say the least!", "Date": "January 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Satellite Beach, florida USA", "Title": "“Perfect for our needs!”", "Author": "sneepy", "ReviewID": "UR93576678", "Content": "We stayed here on January 4th for one night before our very early Air France flight to Guadeloupe the next morning.We left our car there for 12 nights-it was free for 7 days-$5.00 a dayafter that-a GREAT deal!(security cameras all over the parking lot!). The FREE van took us to the airport-it leaves every 15 minutes starting at 5 A.M. Our room was perfect-two big beds, spacious, clean. (no fridge/micro). We paid $7800 a night with AARP rates. The hotel is a bit hard to find for non-Miami drivers, but we are Miamians. The noisy planes overhead probably would bother some people, but we love the sound of the magic jets! We also stayed after our trip for one night on January 16th(we flew in at night). The wonderful FREE van from La Quinta cruises arund the airport looking for their clients-just wave at them when you see one. On arrival at the hotel, we rushed to make sure our car was ok-It was! Our room was on the first floor this time, near the newspaper machine and the vending achines. Again, no complaints. The breakfast was pretty comon for a chain hotel-all fattening junk, no REAL butter, NO FRUIT(just apples), so avoid if you are the healthy type.(we just took the hard-boiled eggs back to our room. But the other hotel clients seemed very happy with the breakfast! The room was packed with Asians who loved the waffle machine and the waffles! We will always stay here from now on, because of the FREE shuttle/safe and reasonable parking/efficient staff, clean rooms. We LOVE La Quinta!", "Date": "January 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Roswell, Georgia", "Title": "“Barely Acceptable”", "Author": "RoswellDad", "ReviewID": "UR91139478", "Content": "We stayed here (thankfully, for only) one night before a cruise. A newspaper writer might describe this property as \"hardscrabble.\" The boarded-up, abandoned restaurant next door doesn't help the general appearance. Neither our room nor the public areas seemed particularly clean. The free wifi was extremely slow. The TV was old and small. We skipped the free breakfast, which didn't look especially appetizing. There's too many hotels close to MIA airport to stay here.", "Date": "December 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Lizards and ants in the hotel room, all you need to know”", "Author": "Chicagohoosier07", "ReviewID": "UR90624469", "Content": "This is not a joke. We took a picture of a Gecko and ants in the hotel room. Neither should be welcome in a hotel room. The hotel is convenient for the airport and reasonably priced, but cleanliness is a MAJOR issue", "Date": "December 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“Good for Free Shuttle and Free Cruise Parking”", "Author": "amygt1104", "ReviewID": "UR90390291", "Content": "I booked this hotel because we were going on a cruise and wanted the free parking and free shuttle to Port. So for the price I paid those two things made it worth it. But, other than that I was not impressed with hotel room. I am not picky but when you pay good money for something you want to get normal amenities that work. First......internet did not work in room. Had to go to elevator or lobby to connect. 2nd.......t.v. remote would not work and actually fell apart in my hand then when I got up to turn down volume the buttons on the tv didn't work either. Very annoying. I did call about remote they said I could come down and get some batteries. But, I don't think that was the problem. The breakfast is your normal continental. So, it satisfied the hunger of morning. The planes are loud but you are right at the airport so expect that noise. The hotel staff is very organized and the shuttle to port was done very smoothly and that helped us make our nice transition to the rest of our trip.", "Date": "December 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Nice hotel very near to airport. Basic but everything you need.”", "Author": "Allyjet", "ReviewID": "UR90152812", "Content": "We stayed for two nights in this hotel. Rooms were perfect, clean, free wireless internet in your room, bath and coffee machine. It is around the corner from the hotel with excellent shuttle services. Breakfast is well organised and good. Location is convenient because of the proximity to the airport but otherwise the location is quite remote. We recommend renting a car to get you to Miami Beach, Fort Lauderdale etc because without a car it will be difficult to get around. We did not sleep to well because of jetlag but also because of the airtraffic and the noisyness of the hotel. Keep that in mind. There were no airplanes after midnight though, Staff is very friendly but also very busy.", "Date": "December 18, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "north carolina", "Title": "“perfect for cruising and driving to miami”", "Author": "brnsofia", "ReviewID": "UR88364849", "Content": "we love the location the shuttle to the pier and the hotel itself. very pleasant staff. we drove to miami for cruise and got to leave the car for free for 7 days. pier costs $20 a day and for the same price we got a hotel for a night, free parking, transportation to pier and breakfast. cab back to hotel with tip was 30$. easy to get on i-95. only downside was the breakfast. not so great but it was some food for the belly", "Date": "November 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Springfield, Missouri", "Title": "“Great rates, clean, safe, and convenient”", "Author": "RuthCM", "ReviewID": "UR88054262", "Content": "After traveling on an airport shuttle through several neighborhoods on my way to the hotel from the Ft. Lauderdale airport, I was thrilled when we drove up to the hotel. It was in a nice safe area, very clean, and in a convenient location. It is right by the Miami airport. Check in was easy and we were impressed with the large size of our room. Even though we were right next to the airport the noise from the planes was so muffled we hardly heard them. The breakfast in the morning had a lot of selections including making your own waffles. We chose this hotel because of its free shuttle to the Port of Miami and we were very pleased with the shuttle service. The bus was clean and the trip was very short. According to the taxi rates it would have been about $25 for us to take a taxi from our hotel to the cruise port so that was a nice savings. You just have to make sure you sign up for the shuttle when you check in. The hotel also offers free in room Wi-Fi and it worked perfectly for us. I would definitely stay here again if we ever go back to Miami.", "Date": "November 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "vermont", "Title": "“Reasonable rates and clean”", "Author": "jks336", "ReviewID": "UR87666902", "Content": "We had 6 ppl in our group. Hotel offers shuttle to the port of Miami which is a plus! Hotel was clean and the breakfast is a full continental breakfast. staff at the desk (who was only who we interacted with this time) were pleasant and helpful. I would recommend this hotel for any stay. i've read about noise from airport but at least in our rooms you didn't unless you had the window open. the only thing i thought tacky (i also work for a name hotel/motel) is in the elevator they had a notice that when you receive your email survey to put all 10's there. whether or not someones low score is warrented, to ask otherwise is tacky. heck we like all 10's too lol. but anyways, great place to stay and the price is right. No there are no \"shops\" nearby but our reasoning was price! there is a bennagan's restuarant adjacent to the property for good food!", "Date": "November 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Knoxville", "Title": "“Pleasant Experience”", "Author": "Volchik", "ReviewID": "UR87622769", "Content": "Overall a pretty standard hotel. I'm very nitpicky about cleanliness and I did not find any problems with my room. The bed was comfortable and the room has a nice vanity area. The hotel is close to the airport and my room was near the elevator and vending machines so I was a little worried about noise but had a quiets nice rest. Check-in was easy and the front desk staff was very friendly. Due to traffic and that the hotel is a little tucked away behind the red roof inn and bennigans I had a little difficulty finding it even with a gps. The continental breakfast is pretty basic. Overall a good experience for an affordable price.", "Date": "November 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "CA", "Title": "“Pleasant stay and Great personel”", "Author": "Luv2BatC", "ReviewID": "UR85911613", "Content": "We stayed here pre-cruise for one night. We had taken the \"red eye\" flight from the west coast and arrived at the hotel around 8 am. I really didn't expect to get our room at that time and asked if we could leave our luggage there until check in time. The clerk checked our reservation and to my supprise she said she had 1 room available, and allowed us to check in. What a God send, none of us were able to sleep on the plane and we were all wiped out. This was our second time staying at an LaQuinta Inn and won't be our last. Both times we received excellent service and always with a smile. I don't know how they go about training their personel but they do a great job. Much better than the treatment we received at Hampton Inns and others. The only \"con\" I can think of is that the eating area is waaaaaay to small.", "Date": "November 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Would stay again”", "Author": "sallie101", "ReviewID": "UR84223822", "Content": "We stayed here prior to cruising out of Port of Miami. After reading some of the reviews on this hotel we were a little leery, however, it was very nice. It was clean, the staff was pleasant and easy to understand, the price was very nice and included a shuttle from airport to hotel and hotel to port. Breakfast was a little crowded, but there was plenty of food. We arrived late and we were hungry, there was a Bennigan's w/in walking distance which was also very good and reasonable. We would definitely stay again.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“excellent service”", "Author": "MonsterInn", "ReviewID": "UR75748192", "Content": "The hotel is very well in their installations, but I note the excellent service that the staff provides. Always smiling and ready to solve culaquier kind of need. The rates are adequate. We enjoyed our stay.", "Date": "August 18, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Suffern, New York", "Title": "“Its okay for one night but I probably wouldn't go back”", "Author": "PoorTripPlanner", "ReviewID": "UR73951442", "Content": "pretty basic LaQuinta --free shuttle from MIA and to Port of MIA is why we stayed. I will look for other options with the same shuttle/bfast option for my next precruise stay in Miami. I would only go back if nothing else is avail in this price range.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Pre-Cruise Stay”", "Author": "xomanda", "ReviewID": "UR67147433", "Content": "I traveled with my parents, younger sister, and grandparents, booking two rooms for a pre-cruise 5 day stay. When we stayed at the hotel, they were in the middle of renovating, so some rooms had the fresh 'paint-smell' to them. However, when asked, the front desk was willing to give us new rooms, trying to accommodate any requests we had. Some parts of the room, the sections 'less-travelled' were somewhat dusty, though. The location was fine if you had a car, as the only restaurant within walking distance was Bennigan's. The enterprise we rented from was just down the street which was very convenient for renting and returning the car (about 10 to 15 mins walk). The airport shuttle also proved very handy, as they were also willing to drive us to the enterprise to pick up the car on our first day (before we knew it was so close). The cruise shuttle was also very convenient, and very friendly when dropping us off. The driver of both shuttles, (which was actually the same bus) Dave, was very nice. The continental breakfast was average, with the usual selection of hard-boiled eggs, cereal, toast & bagels, some fruit, etc. and a self-serve waffle maker. They closed the breakfast at pretty much exactly the time they post, though, so don't be late!! =) The parking was alright, we managed to find an ok spot every day, sometimes going in the back door, and the wifi worked without any hassle as well. Our room also had a view of the pool, which we didn't use, but looked alright. All in all, the hotel was pretty good. If I went to Miami again, it would definitely be one of my top choices! P.S. When visiting Miami, remember to go to Joe's Stone Crab!!", "Date": "June 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "California Central Coast", "Title": "“Good pre/post cruise hotel”", "Author": "PalmSpringsVisitors", "ReviewID": "UR66611279", "Content": "We reserved two rooms for four family members before a cruise to the Bahamas. Arriving at the Miami airport at different times, we all took the free shuttle to the hotel. While there was delay in being picked up, the driver was courteous and the ride was comfortable. The hotel was very crowded, with many folks going to the cruise docks the next morning. With one exception, the staff were pleasant and helpful. The room was large with a king-size bed, microwave, and refrigerator. Overall, it was very clean but somewhat run-down and dingy. We walked to the nearby Bennigan's for dinner but should have paid attention to other reviewers. The service was friendly but very spotty, and the food was average to poor. However, there is little else within walking distance. The hotel's continental breakfast had the normal items and was plentiful; we were lucky to get a table as many families who arrived later had no where to sit. Although many people were taking the free shuttle to the docks, our ride was right on time, and we enjoyed the trip, getting to see a little of Miami. Be sure to make a reservation for the shuttle the night before! Two of us stayed at La Quinta for one night after the cruise, while the other two chose a Days Inn (NOT a good choice). Note that there is no free shuttle from the port to the hotel. Again, our room was clean but run-down. We had rented a car for sightseeing and so did not need the free shuttle back to the airport. There is a computer and printer in the lobby that I used for flight check-in at a small cost. I later found out from the front desk that I could have done that for free, but there were no signs at the computer indicating that service (annoying). I would recommend this budget hotel for its location to the airport, price, and shuttle services.", "Date": "June 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "El Paso, Texas", "Title": "“Best Option Prior to Cruising”", "Author": "Martin217", "ReviewID": "UR66070142", "Content": "We stayed the night prior to our 7 day Caribbean cruise on carnivalâ€™s liberty, My wife and I got to Miami Airport at 6pm and called La Quinta so they could send the shuttle to pick us up, the hotel clerk advise me that the driver was out on break however we would not have to wait at all; she asked for my reservation and name, then told me to catch a blue taxi just outside the baggage claim terminal which is where we were, and tell the cab driver to take us to the hotel and make sure I ask for a receipt, that I would get reimbursed upon arrival at la Quinta, it was a ten minute ride and $10.00, I got my receipt from the driver went inside the hotel, inform the young lady at reception that I had arrive from the airport on a blue taxi, gave her my name and handed over the receipt, she said: yes weâ€™ve been waiting for you Sir and gave me my $10.00 on the spot. Check in was a breeze and reserve our transportation to the port the next day, the room was large with a king size bed and good size bathroom. We went to Burger King around 8pm we were starving, itâ€™s about a ten minute walk, I had read reviews about staying away from Bennighans so we did. We first walk next door to the Embassy Suites Hotel Restaurant but it was too expensive for us. Itâ€™s easy to get to Burger King, walk outside La Quinta to the access rd. and walk north along the side of the green fence of Embassy Suites parking lot then take a left at NW South River Walk Dr. under the overpass (walk against traffic) then a left again at NW 36th St. when you turn on 36th you will see it on 36th & 953 rd. thereâ€™s also a McDonalds if you keep going west on 36th but I estimated that it was like Â½ mile away. (No sidewalks all grass very safe). Next day we hit the continental breakfast at 9am there open from 7 to 10, great assortment of cereals, juices, milk, pastries, hard-boil eggs, fruit, coffee and waffles. The ride to the port was about 25 minutes and the shuttle is a mini bus, very comfortable. All in all this is a great hotel prior to cruising will definitely stay here again. By the way, if you work for the Government or are current or prior Armed Forces, police, fire department or Retired and have proof of it, you can get a great reduced stay for $65.00 a night at any Quinta, I did. PS never heard a single airplane.", "Date": "June 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Memphis", "Title": "“LaQuinta MIA Airport East - No frills economy hotel with free shuttle to cruise lines”", "Author": "CaptainBly", "ReviewID": "UR65760459", "Content": "I stayed at this La Quinta hotel one night early the week of May 23, 2010 prior to embarking on a cruise departing from the Port of Miami. This hotel is an older property located near the MIA airport (a 3-4 minute shuttle ride). It is a modestly priced economy hotel featuring very basic amenities. \"Basic\" amenities include a free continental breakfast (waffles, hot & cold cereal, pastries, yogurt, coffee and orange juice), and an internet terminal near the front desk. The good news: The staff was friendly and the hotel offers free airport shuttle service every 30 minutes. In addition, they have a free shuttle to the Port of Miami for guests departing for cruise vacations. My room was clean and did not smell of cigarette smoke. The a/c was quiet and worked well, and there was basic cable television. The room rate was on the inexpensive side. The not-so-good news: There is only 1 (rather run down looking) restaurant in the immediate area around the hotel, and no shopping options. The television, telephone and light fixtures in the room were ancient and vaguely dingy. While this hotel could seriously use a remodeling job, it was adequate for a very inexpensive one night stay. I would only --nominally-- recommend to fellow travelers seeking a 1 night stay at a clean, no frills hotel near the MIA airport or departing for a cruise.", "Date": "May 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“free brekkie, shuttle to airport and cruise terminal but right under the flight path”", "Author": "paulastaggs", "ReviewID": "UR65231304", "Content": "Hotel was clean and comfortable for one night stay, easy to get to in a cab or using the free shuttle. Good value for money, we paid about AUD100 and there were 4 of us in the room! They have free breakfast and free shuttle to cruise terminal. The only thing is it is right underneath the flight path so you'll be up from 6am Most cabbies knew where it was using the street name (there are 2 La Quinta's at the airport).", "Date": "May 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Noblesville, Indiana", "Title": "“Clean and convenient”", "Author": "NKOTB08", "ReviewID": "UR65058017", "Content": "After reading some of the reviews of this location I was hesitant to stay, but the price was far under what I had budgeted so I just went with it. We flew into FLL and ported out of Miami, we had a rental car and were able to park it here for free during our cruise, they also offer a free shuttle to the port. The free shuttle alone saved us well over $50, when I returned to Miami I took a taxi back to pick up the rental, the cost was $27 plus tip. The location is older, however it was clean and not as noisy as I had read about. One of the ladies at the front desk did not go out of her way to help me, however the rest of the staff was friendly. I would not recommend using this locaton for a family vacation - I did not hear the airplanes in my room, but could not have a conversation at the pool because of the noise when they flew over. If you are just staying over night and need a cheap and clean place to sleep this is it. Also, there really is not much within walking distance, one restaurant in the parking lot - otherwise it's delivery or you'll need transportation. After reading the reviews and staying here I believe some people were expecting a 5* hotel at 2-3* prices.", "Date": "May 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Flagler Beach, Florida", "Title": "“La Quinta East comes through for us again!”", "Author": "lambs2", "ReviewID": "UR64716399", "Content": "This was our third stay the night before before a cruise out of the port of Miami at La Quinta East. However, this was the very first time we have had to pay extra to park our car there because our cruise was more than 7 days which has now become the maximum FREE car parking length allowed. Last year we had left our car parked in the lot there for THREE full weeks and there was no extra charge. Beyond the free seven days the parking charge is now $5. per day. Still a good deal, but not the GREAT deal we have experienced at La Quinta East in the past! We were fortunate to arrive at the hotel about 1:30 pm and there was no one in line at reception in front of us. Later in the afternoon I happened to walk by and the queue at the front desk was several layers deep and there were still only just the two women at reception who had been on duty when we checked in earlier. We felt very fortunate to have been able to register quickly when we arrived and were the very first names on the list for the earliest complimentary van to our cruise ship at the port the next morning. DO ask to be placed on the shuttle list for the port as you are registering as there is a limited number of seats available for each shuttle run. We booked one of the less expensive rooms with two beds near the front of the hotel on the 3rd floor. We have had the larger deluxe room in the past which has a fridge and a king sized bed, but his time we were using La Quinta points to pay for most of our room charges and the smaller was completely adequate for our one night pre-cruise stay. I spent the afternoon reading out by their very pleasant pool area while my husband watched sports upstairs in our room. We got up early the next morning and there was still plenty of room in the breakfast room downstairs - but not for long! We found the complimentary breakfast quite adequate and a great way to start our vacation! DH enjoys the make-your-own waffle station and I just had my usual oatmeal and a banana plus tea or coffee and juice. When we returned on a flight from Europe 19 days later we found the La Quinta East van waiting for passengers outside the 2nd floor of the airport above the baggage claim area with absolutely no need to call for the van. We were whisked back to La Quinta where we loaded our car, parked just as we left it, and drove the several hours home after a great vacation. We both highly recommend La Quinta East as a very convenient place to stay near the airport in Miami.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New Orleans", "Title": "“Free shuttles to the airport, cruise terminal, and free parking!”", "Author": "weatherguy1", "ReviewID": "UR64346649", "Content": "The La Quinta Inn & Suites at Miami Airport EAST on Le Jeune Road was a difficult motel to find, by car, especially arriving from the north. You have to make a U-turn and come back around on N. LeJeune road and exit on to the service road. Otherwise, check-in to the motel took an enormous amount of time. The motel front desk is severely under-staffed and needs more help there. The motel does have a FREE airport shuttle and also provides a FREE shuttle to the Port of Miami. We used both as we had a Trans-Atlantic cruise to get to. Parking in their parking lot is FREE, but ONLY for a period of 7 days. Beyond 7 days, you must pay $5 per day for parking. The parking lot does have cameras and security. We left our car there for a period of about 17 days, without incident. The room we were given which was 2 Queen beds was a small room, but the roomâ€™s condition was clean and orderly. The TV could have sat higher up, though. Surprisingly for the price we paid, there was NO refrigerator in our room. That was a disappointment! As for computers and the internet, there was one computer in the lobby, BUT you must pay about $0.50 cents per minute to use it for internet use â€“ an outrageous charge!! The FREE shuttle to the Port of Miami was behind schedule and didnâ€™t pick us up until late. We were scheduled to leave at 10 AM; instead we got to the Port of Miami at 12 noon. When flying back from Europe, the FREE shuttle bus to the airport came much quicker and we didnâ€™t even need to call for the shuttle bus; it arrives on the upper deck where departures are at; NOT where the arrivals are at, so take note of that! Just look for the wording on the shuttle bus that reads, â€œLa Quinta Inn EASTâ€� printed on the shuttle bus and flag them down. My only reason for recommending this motel is because they offer FREE parking for 7 days, FREE airport shuttle bus, and FREE cruise shuttle to the port of Miami. They do NOT offer a pick-up from the port back to the motel though. They did offer a FREE breakfast, which was limited in scope I thought, but I believe I later learned they had waffles, which I didnâ€™t see at first.", "Date": "May 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sunnyvale, CA", "Title": "“5-Star Service at 3-Star Price -- Great Stop on the Way to Your Cruise!”", "Author": "sunnyvale_steve", "ReviewID": "UR62028982", "Content": "This hotel is ideal for someone who is arriving in Miami the day/night before a cruise and needs a convenient place to stay. The hotel includes free airport shuttle (until 11pm?) and free cruise port transfer (from hotel to cruise port only, as far as I know). Breakfast is also included -- basically toast, cereal, waffles, coffee, and juice. This was everything I needed. The rooms are very clean. The only possible negative is that it's extremely close to the airport so you will hear the planes taking off unless you keep your room air conditioner running. This was not an issue for me. The staff is incredibly helpful. We needed to go out to buy some things that we forgot for our cruise. The desk clerk (can't remember her name, sorry) not only offered advice on where to go but also offered to pay for the taxi! I don't know if this is typical of all La Quinta Inns but I was very impressed by this level of service and will definitely be giving them my business in the future. This hotel has everything you need when passing through Miami!", "Date": "April 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "ocala, fl", "Title": "“Friendly, courteous atmosphere”", "Author": "shirl369marmol", "ReviewID": "UR60924258", "Content": "First of all, the rooms were very clean and comfortable, and secure. I felt very safe. But most of all, the staff was very friendly, courteous, and very accommodating from the very beginning (Raquel, and Mari). The location was fine, (a little noisy because of the airplanes). The free wi-fi was great and useful as well as the free breakfast. I would definitely recommend to everyone, especially for people families/tourists not familliar with the area.", "Date": "April 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Convenient to Miami cruise port, close to airport and highway, but quiet!”", "Author": "chicagoheroine", "ReviewID": "UR60216194", "Content": "My mom and I stayed here the night before a cruise. Caught the free shuttle from the MIA airport to the hotel. Check in was easy and the front desk was very nice. We signed up for the free cruise port shuttle at that time. Room was average for a La Quinta. The blankets were a little spare and were tucked down really low. We were right by the highway and near the airport, but it was really quiet! There was a Bennigans within walking distance which was nice because there was no restaurant at the hotel. Breakfast was very busy in the morning. A queue was starting and people just started going into it, except it was only for the toasters! It was hard to tell though because the food was in a little room away from the seating. The free shuttle to the cruise port was great. If we take another cruise out of Miami, I would definately choose this hotel again. I have had really good luck with La Quinta.", "Date": "April 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "bethlehem,pa.", "Title": "“Great value and very clean”", "Author": "jimBethlehem_pa_", "ReviewID": "UR59179855", "Content": "Get the shuttle at the airport on the second (upper) level for the motel. Give them a time for the shuttle to the pier when you check in. Breakfast room is very small. you can always take your breakfast to your room. The price is right. Please DON'T eat at the Bennighan's restaurant just outside the motel. First of all we detected a musty and badf odor when we walked in. My wife and I went there mistakingly and sat at a booth and ordersd our drinks. Then along came one of the house ROACHES strolling across our table. Well, I just let out a loud La coocaracha and the hispanics and others knew right away that we had uninvited guests. Needless to say, we got up and let our displeasure known while walking out. We then went to the Embassy suites (paid a little more) and had a delicious meal. It was well worth it! Good luck and beware of the Bennigan's.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "5", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Prince Edward County", "Title": "“no frills value”", "Author": "JuanitaDubois", "ReviewID": "UR58985874", "Content": "We stayed at La Quinta because ... When we planned our cruise we needed a place to stay before and after the cruise. After reading hundreds of reviews for $50-$500 rooms, I came to the conclusion that they all had good reviews and bad review now matter what was paid. Originally we chose Regency Airport Hotel Miami and were very disappointed. We saw a add on a Miami tv channel and I breifly remembered reading reviews so we cancelled our after cruise booking and booked at La Quinta. Firstly, we saw no bugs. This is a biggy for me, the last thing I want to do after a vacation is fumigare our luggage. The pool was nice and I enjoyed sitting out watching the planes come off the runway. That being said if you don't want to hear them 24/7 this is not the hotel for you. The breakfast was basic, make your own waffles, toast, muffin or cold cereal. On the second day fresh fruit was aslo available. The rooms were basic, nothing fancy, but the beds were comfortable. We found that the value was in having free airport shuttle ( $25 for a cab) and free port miami shuttle ( again $25.00 for a cab) , the convience of having breakfast there ( a $30 value for our family of 3) The room paid for itself. However every time we asked for something we were referred to go to the hotel next to us ( Embassy Suites) . When we walked over to this hotel we were blown away! The concierge told us that should we want a room go to hotwire and put a bid in as they have ppl staying there for $80 a night all the time, we will do this the next time we are in Miami!!!) Lastly, if your a avid non smoker, don't go to this hotel. Our daughter is a severe asthmatic and we had to check out early because someone was smoking on our floor (both nights) and would leave their door open to the hallway. Our daughter was congested and we had to leave. When we told them at the Front Desk the girl said it happens often and there is nothing they can do about it. There is a smoking section to the hotel on a different floor and another section of the premisis but they have no recourse. We are from Canada and a trip to the emergency room was something we wanted to avoid, so we had to check out.", "Date": "March 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "florida", "Title": "“Very upsetting stay.”", "Author": "trista762", "ReviewID": "UR58727564", "Content": "We checked into this the day before we were leaving on a cruise out of miami. Since this hotel was referred to us by a friend and we were also told that they will allow you to park your vehicle there for up to 2 wks free and a free shuttle to the ship we decided to try it out. That was a mistake! The room had an awful stale musty odor, the T.V didn't work so I called the front desk only to be told that I needed to turn it off & on which didn't work I was then told to make sure the game system that they have was unplugged and that also didn't work. They still offered to send no one so I gave up and began taking everything off the tv (wires) and replacing them again, apparently one was loose because I got it working. UGH! The continental breakfast was ok (the waitress that refilled and cleaned up was fantastic) but it was very crowded and not nearly enough seating. At breakfast (7 am) we spoke to the front desk to remind them we had a stroller, a scooter for my elderly grandmother and all 5 of us had 1 large piece of luggage and 1 carry on each in which they assured us that it was no problem to get a van large enough to transport all of us. When the van finally came (9:30am) we were told the small scooter now doesn't fit so we could leave it and my 93 yr. old grandmother until they would have an empty van at 1pm?! WHAT?! My mother was going to wait with the scooter and get brought to the boat at 1pm and we loaded all the luggage and the driver then said the stroller won't fit now either because he had another large family with all of their stuff so ours all can't fit. He said we would have to leave it also. Well I can't leave my mom with her luggage, a scooter, and a stroller so I did get a bit aggravated and just told the driver to unload ALL of our things and we will all just wait together for the 1 pm van. I did return back inside to ask the lady that seemed to be a supervisor what happened since we signed up to be shuttled the day before at check in and we also told them then what we had to be taken and was again told it wouldn't be a problem. All I could get from her was an I'm sorry, she did not even try to get us on the next van/bus. We ended up taking a taxi for $30 to the pier just to get out of the hotel. The cruise was nice and it cost $30 for the return trip to the hotel so we could pick up our vehicles which we were sure to park under lighting AND IN THEIR CAMERA VIEW before we left! None the less my Armada was keyed down the whole driver door! This was a good idea if it worked out smoothly. If you do try this hotel and have ANY of the above issues I've mentioned be very cautious! None of us will ever stay at this hotel again nor do we have anything good to say about it. I am sure that there are plenty of other hotels in the close proximity of the port that would be happy to have our business and much better hospitality.", "Date": "March 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Excellant”", "Author": "A TripAdvisor Member", "ReviewID": "UR58718271", "Content": "Stayed two nights, perfect for pre-cruise stay. Had minor problem with reservations, manager resolved it immediately. Nothing within walking distance. Shuttle to Port of Miami went flawlessly. Noisy til about 9:30 then flights slow down.", "Date": "March 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Minnesota", "Title": "“Great Place...Great Service”", "Author": "delta765", "ReviewID": "UR58682765", "Content": "Just spent 2 nights at the La quinta on before my Cruise and one after and they could not have been more helpful and competent in getting me from the Airport to the Hotel to the Port and back to the Airport...the room was nice, clean and available when thet said it would be...the shuttle service was first rate...and they even told me how to get to a Rental Car Co. with just a short walk (10 min.) it is the place to stay if you are going to cruise or just need a location with free shuttle near the Airport. By the way Carnival will NEVER EVER get me on one of their ships again...but that is a different review!", "Date": "March 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Georgia", "Title": "“Great place to stay if you are going a cruise.”", "Author": "GeorgiaLovinlife", "ReviewID": "UR58141164", "Content": "A friend and I stayed one night before leaving for our cruise. I didn't know much about Miami so I went by the reviews I had read about this hotel and I'm glad that I did. The hotel was really clean and the staff was very nice. We live 9 hours from Miami so coming in the day of the cruise was not an option for us. The room cost was a little of $100 and we were gauranteed a shuttle to the Port and were allowed to leave out car in their parking lot at not extra charge. Parking at the Port would have cost us around $100 so I think we did good. We will stay here again for our next cruise.", "Date": "March 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tomahawk, Wisconsin", "Title": "“If cruising from Miami this is a great, inexpensive choice.”", "Author": "Leisure_Traveler37", "ReviewID": "UR57547584", "Content": "If you are looking for a place to stay the night before a cruise this is a great choice. It's inexpensive and shuttles run to/from the airport and to the port of Miami. We did not have to wait for either shuttle. The staff is friendly and the rooms are nice. Our room had a very comfortable chair (in addition to a desk chair). There is some jet noise but the name of the hotel should alert you to that. Only one restaurant in walking distance â€“ Benniganâ€™s. Really no place else to walk. Breakfast is standard serve yourself fare. Staying at a place for a week this may not be a good choice but for an overnight and a ride to the port it canâ€™t be beat.", "Date": "March 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "florida", "Title": "“best airport location”", "Author": "applepics", "ReviewID": "UR54430626", "Content": "perfect location to leave your car. 89 dollars for great room and service. shuttle service good. breakfast good for the price[free}.", "Date": "January 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Seattle, Washington", "Title": "“couple problems, but a great place for a budget stay”", "Author": "tink360", "ReviewID": "UR53329992", "Content": "Stayed here for 1 night pre-cruise, after getting into miami around 10pm. We did not use the airport shuttle because my friend wanted to get a rental car. The place looked decent from the outside, although the was a lengthy wait at check in - they could use more people at the check in desk at that hour. Also they had no smoking room available even though I had made a reservation specifying smoking several months before. The room was very clean, the carpet could use shampooing but all the hard surfaces in the room & bathroom were very clean. One big problem, no cold water from the sink. The only sink was not in the bathroom - it was located at a vanity outside the bathroom. Not a big problem but the faucet was broken and only would run hot water. I called the front desk - no one would answer (probably because they were so swamped), took the elevator back down to the lobby to report the problem. They were full so could not put us in a different room. Someone came up to the room but as I expected, could not repair it. They did give me some bottled water & the manager took 20% off the bill the next day - they have decent customers service, not just for a budget hotel but for any hotel period. Not the place to stay if this is the base for your miami vacation, but if it is just a short stay before a cruise or flight out - it's clean, quiet and safe.", "Date": "January 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "manaus", "Title": "“Clean and nice”", "Author": "viajantemanaus", "ReviewID": "UR48061154", "Content": "If you want to catch a plane this hotel is perfect, because is just 5 minutes to Airport. The rooms are clean, nice and the hotel has a Free Breakfast with Cereals, rolls, toast, juice, muffins etc. There's Free High Speed Internet and Free shuttle too, but the shuttle works at 6 am to 11 pm. There is a Bennigan's Restaurant is within walking distance. This is very good, especially when you are without a car.", "Date": "October 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Orange County, CA", "Title": "“Perfect place to start our trip.”", "Author": "sassycatsmama", "ReviewID": "UR47689018", "Content": "We were looking for a place close to the airport as our flight came in very late and we just wanted to sleep before heading out on the rest of our trip. We picked this up on HotWire.com for $39 plus tax. The room was small but very clean and quite adequate for a one night stay. The continental breakfast offered boiled eggs, yogurt, toast, bagels, waffles, hot and cold cereal, coffee, milk, juice, etc. The breakfast room was clean and organized but remember that they close EXACTLY on time so get there early enough to get what you need. The desk staff was very helpful. I would also recommend this hotel if you are coming in and need to stay the night before a cruise.", "Date": "October 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Canada", "Title": "“Good value”", "Author": "MCC2000", "ReviewID": "UR46976531", "Content": "We stayed at the La Quinta Inn based on reviews from tripadvisor and cruisecritic. We booked a one night pre-cruise stay in August 2009. We got a summer discount code and got a room for $55 plus tax. The main reason we booked this hotel is because the hotel has complimentary shuttle service from the Miami airport to the hotel and from the hotel to the Port of Miami. Since our flight landed in the afternoon, we didn't want to rent a car just for the evening. After arriving at Fort Lauderdale airport, we took the TRI-RAIL to Miami airport. From there, we used the complimentary shuttle to get to the hotel and then to the port the next day. We waited 40 minutes for the shuttle to come pick us up from the airport after our call to the hotel. This was the only negative of our stay. We got on the 9:30 a.m. bus to the port and arrived at the port after about 30 minutes. The hotel was dated but our room was clean. We also used the pool facility. Internet service was provided free of charge. It can be a bit noisy, especially outside of the hotel, with the close proximity to the airport. However, we were able to catch a good night's rest. The Bennigan's restaurant next door is open and is within a short walking distance. There are no other attractions or facilities close to the hotel. The hotel offered a complimentary breakfast starting from 7:00 a.m. The staffs were friendly and courteous.", "Date": "October 15, 2009"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Rooms": "4", "Value": "5", "Location": "4"}, "AuthorLocation": "Easton, Maryland", "Title": "“Perfect for night before cruise”", "Author": "2bytheshore", "ReviewID": "UR45493352", "Content": "We flew into Ft. Lauderdale and stayed here for a night before a cruise departure in Miami. Inlaws met us there and drove to hotel. In the morning we choose to take a cab ($28.00 for 4 of us including tip) to Miami because we couldn't get on the shuttle until 12:00. Just remember when you check in to immediately make your reservation for the shuttle to the port. They didn't tell us this until later in the day. By that time it was pretty much filled up for the morning departures. This hotel is perfect for a night's stay. Nice staff, clean rooms, free parking (up to 2 weeks), breakfast and shuttle to miami port. Would highly recommend. Much cheaper than the hotels in Miami and you can't beat free parking.", "Date": "September 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "North Carolina", "Title": "“Shuttle made travel so much easier.”", "Author": "bookmommy0406", "ReviewID": "UR41658588", "Content": "We stayed here the night before our cruise. The shuttle from the airport and then to the port made it so convenient. The desk staff were very friendly, they recommended a Cuban restaurant that delivers--delicious food! This is not a luxury hotel by any means, but was clean and perfectly adequate for a stay before a cruise.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Los Angeles", "Title": "“Pick up from Airport and Drop off at Port of Miami was great”", "Author": "DavinaRM", "ReviewID": "UR37887931", "Content": "We stayed here after reading a review about the hotel pick up and drop off. Got the AAA price of 65 plus tax. The beds were very comfortable. They were clean. The floor however could have used a good vacuuming under the bed. The bathroom could have used a good cleaning too. The breakfast was good. The air conditioning worked. The hotel was full yet we never heard any commotion. The staff was friendly however the front desk wasn't all that helpful when we wanted to find a market to purchase some water for our upcoming cruise. Sort of felt like I was being talked down to. Maybe it was just a difference in cultures. I read there was a market close. We found a market after a one way cab ride of $8.00.... There was one restaurant next door. Maybe if it wasn't so hot we would have ventured further.", "Date": "August 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Lima", "Title": "“Good for the price”", "Author": "Leo_CK", "ReviewID": "UR32709755", "Content": "We picked up a room saver coupon magazine on our way from orlando to miami and decided to try this hotel for USD49.00 plus tax. It was quite a pleasant stay, the room size is avergage and includes a table, iron and TV, no microwave or fridge but you got restaurants and a market just a few steps away if you need to eat lunch or dinner.. Breakfast was included (coffee, tea bread, apple and orange juice, chocolate, cinnamon and banana muffins, waffles and fruits) air conditioning always worked fine, free parking and their airport shuttle service is ok, the staff was always friendly. Could not try the pool but it looked fine. If you plan to stay in a non expensive place I would definetly recomend it.", "Date": "June 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Indiana", "Title": "“Good for the Money”", "Author": "pacerzfan", "ReviewID": "UR31314606", "Content": "Was not perfect as elevator had issues during stay. Room was very adaquate. Stay away from any \"deals\" at pizza places slipped under door, as most are a rip off I found out.", "Date": "June 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "2", "Rooms": "4"}, "AuthorLocation": "newcastle upon tyne", "Title": "“good choice for short stay”", "Author": "jayarrscott", "ReviewID": "UR28759086", "Content": "We (2 60+grandparents, daughter & partner and grandson aged 12) stayed here for 2 nights after flying in to Miami before driving down to Key West for our other daughter's wedding. The rooms were spacious, clean and very comfortable and acted as a good base for crashing out after a long flight from London and a day at South Beach. We didn't use the pool (although it looked ok). Although we noticed aircraft flying low to/from the nearby airport, good soundproofing meant it didn't bother us in our rooms. Breakfast was good, although there really wasn't enough space for all there. We ate well at Embassy Suites next door using the bar menu - this appeared to be the only decent restaurant within walking distance.. Make sure you have a good map - we found it not easy to find first time. Overall a very good value short stay hotel.", "Date": "April 25, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "West Sussex, England", "Title": "“This hotel was poorly managed”", "Author": "westsussex10", "ReviewID": "UR28314481", "Content": "When we arrived at this hotel, the floors at the reception/communal areas were quite dirty, which was a very poor first impression, though fortunately when we got to our room that was ok. We spent the first day at Miami Beach and were gone from 8 till 5, despite this our room had not been cleaned on return. We had to phone to request for a maid to come, then move out of the room again so it could be done. Insufficient towels were supplied on both days. The hotel offers services that it doesn't provide. The free high speed internet in our room did not work for our 2 night stay, the signal said either \"none\" or \"low\". The free USA today did not appear on the 2nd morning, I went to reception 3 times to ask for it (this was a weekday) and was told it \"hadn't been delivered\" that day. The nearest ice machine was broken throughout our stay. We booked this Miami Airport La Quinta, because of issues with crime (as reported on Trip Advisor) at the one we had originally booked. However at checkout a guest came to the lobby to report his car had been broken into overnight with items stolen, he requested the staff called 911, and was very frustrated with their slow response.", "Date": "April 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "East Amherst, New York", "Title": "“No smoking should mean No smoking”", "Author": "cprsailor", "ReviewID": "UR27827406", "Content": "This La Quinta is very conveniently located to the Miami International Airport. It's a good place to stay as a place to spend the night between flights or before a cruise but there is not enough around to make it really useful as a base for a Miami vacation. Our check-in was quick and pleasant. The biggest problem was that our non-smoking room wreaked of smoke. Even the hallway smelled of smoke. The only reason I didn't request a new room was because we arrived late and I have two small children who were falling asleep. The beds were comfortable and the bathroom was clean though a bit on the small side. The breakfast was adequate and plentiful. If I was looking for a place to spend the night around MIA I would stay here again but I would insist on a different room if the one I had smelled of smoke like this one did.", "Date": "April 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Minneapolis, MN", "Title": "“A good hotel for the price”", "Author": "Sumada", "ReviewID": "UR27770190", "Content": "We stayed here at the start and end of our trip to Key West, FL because we flew into and out of Miami For the price it was a fine hotel. The rooms were clean, actually so clean I was surprised! It is pretty much right next to the airport, so airplanes were landing and taking off all day. They have a free airport shuttle and our car rental place ended being right next door to them at the Embassy Suites. Of course, it's a few miles from the beaches, but if you are flying in and out of Miami and off to another destination or a cruise, I would recommend this hotel.", "Date": "April 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "MEX", "Title": "“Wonderful”", "Author": "MEXTRIPS", "ReviewID": "UR26462300", "Content": "Great location, fast free airport shuttle, free internet, clean rooms with amazing beds and pillows, free parking, gentle staff, check in and check out at very convenient hours and very worthy for the money.", "Date": "March 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "NY", "Title": "“Clean Rooms, Great For Pre Cruise Hotel”", "Author": "Solaris1", "ReviewID": "UR25475587", "Content": "Our cruise group stayed here prior to sailing this past Sat (2/23) and despite some of the bad reviews on here we were very pleased with our accomodations. My room was very very clean & appeared to have a fresh coat of paint. The bathroom was spotless, very clean with no hair on the floor or in the tub, toilet & other fixtures were also very clean. The hotel is located literaly right next to the airport and we did hear planes up till about midnight but after that we didnt hear much. Keep in mind that the hotel can only be entered driving Northbound on LeJeune Rd. The only thing I thought could use a little improvement was the breakfast area. There were very few tables to sit at, they need to add more tables. The breakfast offerings were fresh fruits, yougurts, oatmeal, bagles & waffles. For the price of $89. I think we got a great deal. Keep in mind that there are no places to eat or shop at in walking distanc to this hotel. Even by car there is not much around here. But it is good for a pre cruise stay where you only need a place to sleep.", "Date": "March 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "greensboro, nc", "Title": "“loved it”", "Author": "jboogie26", "ReviewID": "UR25410281", "Content": "i enjoy staying here at la quinta inn.. the rooms are nice and the people are friendly", "Date": "March 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Colchester", "Title": "“Clean and well located hotel”", "Author": "Dempsey_Family08", "ReviewID": "UR24970645", "Content": "For a one night stay it was more than adequate. Nice staff, clean and comfortable, good value for money.", "Date": "February 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Good to spend the night”", "Author": "aRTie81", "ReviewID": "UR23892394", "Content": "For my three-week trip to Florida including 5 days in Miami I looked at multiple hotels, preferable for less than 100$/night. Turning to TripAdvisor a lot of hotels were eliminated, add the driving distance to Florida City and Homestead, it became a short list and I made my reservation via the internet. I arrived around 9:30PM and found everything prepared for checkin. The room was clean, although a new carpet and some new paint in typical \"hit me with a suitcase\"-areas could improve the overall quality. I had a 2nd-floor room facing the airport and at first felt a lot of discomfort with the aircraft taking off and landing - it was clearly audible and I can not agree with others who claim they can barely be heard. However, I found air traffic to be slow to inexistent between 10PM and 6AM, which was good enough for me. I only came to spend the night, not stay at the hotel all day (which does have a pool surrounded by palm trees - probably a great place if you're looking for a tan and spotting aircraft at the same time). I did not take advantage of the free breakfast. Wireless LAN was available in both rooms I stayed in (beginning of trip and end of trip), although it was a little weak at times. An ATM and vending machines are available near the lobby. Sufficient parking is available outside. During my second stay, I found the in-room coffee maker to be broken, I received an immediate 10% compensation at the front desk! The hotel offers an airport shuttle, however, if you travel without a car you may find yourself looking for a place to eat, there are no restaurants immediatly around the property - I did find several flyers advertising food delivery under my door every evening though. If you are arriving by car, note that the property can only be entered driving northbound! Summary: good place to stay, you get what you pay for. If you're prepared to drive around town this is a good choice, if you're looking for beach and water, look for something closer to the water.", "Date": "January 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "California", "Title": "“Good for a pre-cruise stay”", "Author": "luvNY94", "ReviewID": "UR23612131", "Content": "We just needed a hotel before our cruise because we were flying in the day before. We looked at both Fort Lauderdale and Miami hotels and reviews (we flew into FLL, but our ship was docked at the Port of Miami). Hotels in both cities were around the same price, but most of the reviews for Fort Lauderdale hotels were pretty bad, so we opted for this one. It was a little bit pricey ($100), considering it was just a very basic hotel, but it did the job. Everything was average, but we have no complaints. Things worked the way they should, the room was clean enough, and the staff was cordial enough. Not bad for a one-night stay before our vacation officially started.", "Date": "January 16, 2009"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“The place to stay for a cruise”", "Author": "RalphNewJersey", "ReviewID": "UR22619082", "Content": "Stayed for one night before our cruise. La Quinta Inn picked us up at the airport, and the next day drove us to our cruise ship for no cost. This service was great. The cost from the cruise ship back to the airport was $30.00. The hotel is a great savings. We had to order out for our dinnerm since the Hotel serves no lunch or dinner, but there a tables to eat at the hotel. There our a number of pizza restaurants that deliver. The next morning the Hotel gives a great breakfast for free. The Hotel is clean and the front desk is very helpful. Being close to the airport means you will hear planes, but was still able to get a good nights sleep. Hey, for the first time, after we were in our room for about a half hour, the front desk called, asked if our room was OK and that if we needed anything, just give them a call. They are there 24 hours a day. The rooms are plain and the bed was very good. I asked some other guests what they thought and all agreed that this is the place to stay for a night when you have a cruise the next day. NJ Ralph", "Date": "December 10, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "uk", "Title": "“Good airport stopover place”", "Author": "sfuhere", "ReviewID": "UR22526062", "Content": "Stayed here one night pre-flight. It's very near the airport, although located down a slightly out of the way road, possibly not the easiest hotel to find if you're driving. However, we're British and were driving around Miami for the first time - at night - and we managed it, so it can't be that difficult! I thought this was rather an nice place actually. Comparing it to a Comfort Inn, where we had stayed previously, this seemed more upmarket. The room was bigger and the bathroom was too. There was more choice at the breakfast buffet. I don't think anyone should stay here for an actual holiday, but this is designed as a stopover place, and I think it performs that role perfectly well. There's a big car park also.", "Date": "December 7, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Pittsburgh, PA", "Title": "“Would never go back.”", "Author": "becky3128", "ReviewID": "UR22014141", "Content": "Me, my boyfriend, and two other couples stayed at this hotel before boarding a cruise ship the next day. The only good thing I have to say is that the breakfast was good. The front desk staff was rude. One of the only reasons we booked there was the free shuttle to the port, the front desk employee told us he couldn't guarantee we could get on the shuttle. There was barely anyone staying there! The rest of our trips to the desk we were treated rudely. The rooms were semi clean but outdated and we could hear people in the rooms around us. You definitely get what you pay for but I would not recommend this hotel!", "Date": "November 19, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Arlington, Virginia", "Title": "“Okay hotel before cruise, scary location”", "Author": "lucyaf", "ReviewID": "UR21776458", "Content": "My boyfriend and I stayed here before leaving on a cruise out of the port of Miami. The only reason we stayed at the La Quinta was because of the free shuttle to the port. I arrived before my boyfriend around 4:00pm. My taxi driver coming from the Ft. Lauderdale airport laughed when I told him where I was staying, as did the Miami businessman who was sharing the cab with me. They both warned me that the location was dangerous and the area was really run-down. Also, that there was NOTHING near the hotel. Needless to say, I was really nervous checking in, since my boyfriend would not be arriving until very late in the night. Check-in was smooth. The hotel is dated, and there was a boarded up restuarant in the front. There is also a boarded up Bennigans next door. Basically, the only near-by dining option was the restaurant inside the Embassy Suites which was a five minute walk away. Their restaurant was a little pricey with entrees starting at $20.00. I was not going to pay that to eat at a hotel restaurant the day before going on a cruise! I opted to have pizza delivered to my room (which was was awful!) Looking back on it, I would have requested the shuttle to take me back to the Miami airport to eat. My boyfriend arrived later, and also remarked about the run-down, scary location. We grabbed a quick bit to eat in the morning, then got on the shuttle to the port. I realize that anyway near an airport is probably going to be a little shady, but next time I would pay the extra money to stay somewhere nicer. It met the needs of a place to stay with the free shuttle...", "Date": "November 12, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Davenport, Iowa", "Title": "“Basic budget hotel”", "Author": "Fahrrader", "ReviewID": "UR20904092", "Content": "Can't understand all the complaints about this hotel. It is a basic, budget hotel. Don't expect luxury, but it is a basic, good, clean place to shower and sleep. If that's all you want, as we did while waiting to fly out to Peru, then this place is fine. I wouldn't want to spend a week's vacation here, but as a stopover for an airport transfer, this place fits the bill. It's perfectly clean and safe, with not a lot of noise. We found the front desk staff to be friendly and helpful as well.", "Date": "October 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "The Netherlands", "Title": "“Sleep-shower-Leave”", "Author": "Lucas5915", "ReviewID": "UR20661402", "Content": "We had to deliver our rental car at Dollar and after that fly from Miami Airport. This LQ-motel was closeby and had a very reasonable price ($95). It was also close to the rental-car-returns (8 minutes walk). That was the main reasons for us to book this hotel. In other reviews people are making remarks on the noise (staff, planes), but I did not notice that at all. As the most airport hotels: sleep, shower, leave. Nothing more, nothing less. The ladies behind the counter (one was called Evy) were extremely nice and friendly, just as the guy driving the shuttle-bus.", "Date": "October 6, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Plano, Texas", "Title": "“We will look for better options next time...”", "Author": "want2c", "ReviewID": "UR17387077", "Content": "We were flying out the next day and the La Quinta Miami Airport East is just good enough for that and nothing more. On our way back through Miami, we found another option at the same price that blows this place out of the water. The beds are ok and unless you donâ€™t mind waking up a couple of times at night by people talking outside your window and door, I recommend staying on the second floor as the staff remains pretty active into the early hours of the morning and they donâ€™t use their â€œinside voices.â€� The noise of planes taking off from the airport is also noticeable due to the thin walls. The morning breakfast provided by the hotel is a Running of the Bulls experience short on seating and food.", "Date": "June 30, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Chicago", "Title": "“Ok for One Night Pre-Cruise”", "Author": "LynnThomas", "ReviewID": "UR16470646", "Content": "We stayed here one night pre-cruise. This is a low budget hotel, don't expect more. Room basic, basic no toiltrees. Carpet worn and stained in places. When I entered the room I thought, please just let it be clean. When I entered the bathroom, I saw hairs in the tub. Thank goodness we only stayed one night, otherwise I would have checked out. Free breakfast consisted of make your own toast, waffles. Cereal, milk, yogurt, juice, coffee. The fruit was all gone when I arrived for breakfast and one lady proceeded to take all of the hard boiled eggs. Who eats 6 boiled eggs!! Pros -- Free shuttle transportation from the airport to the hotel and free shuttle from the hotel to the Port of Miami, included. Next door to Bennigans restuarant (great drinks). Cheapest hotel I could find for one night in Miami ($89.00) Most hotels wanted over $150.00. I guess you get what you pay for. Red Roof Inn was next door and Embassy Suites.....", "Date": "May 28, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Knoxville, TN", "Title": "“for a stopover only”", "Author": "lanche21", "ReviewID": "UR16256916", "Content": "The hotel was ok. Nothing more. The service was adequate, but the location was not good at all. There were several other hotels that would have been just as close with better room. I would not stay here again.", "Date": "May 20, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Chicago, IL", "Title": "“Serves its purpose for the night before a cruise.”", "Author": "BearsFan917", "ReviewID": "UR16174647", "Content": "I had read other reviews about the great shuttle to and from the airport. We only needed it from the airport, and called upon our arrival in Miami. We were told to just stand outside by departures and the shuttle would be by. We asked about a specific place and they said just outside anywhere by departures. So we stood outside. FOR AND HOUR!!!! We saw the hilton shuttle 3 times, the marriott twice, the red roof inn twice and even the LaQuinta west once along with countless other hotels but no LaQuinta East. We called 3 times and were told it would be there shortly. It did finally show up. It was a crappy van, but we didn't care it was finally here. So we walked up, and were told sorry they were full, we'll be back in 30 minutes. I thought, Jeez!!!, forget this dumb shuttle. So we took a cab which ended only costing a flat rate of $10 for all 5 of us, and it only took 5 minutes to get there. Should have done that in the first place. Anyways the rest of the stay was great. Check in was a breeze, the hotel served its purpose as we were staying the night before our cruise the next morning. The room was nice and the beds comfortable. The shuttle to the cruise ship was great (By far the best feature). We went to the Marlins game that night, and cab was $50 each way. I would stay away from the Bennigan's next door. I eat at Bennigan's all the time, and love the restaurant, but this one was dirty and had very poor service. No internet at this hotel, we were told to go to the Red Roof Inn next door. We should have used there shuttle too.", "Date": "May 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "South Bend, Indiana", "Title": "“Great place overnight before a cruise”", "Author": "bambam26", "ReviewID": "UR15428000", "Content": "My husband and 2 boys stayed here the night before our cruise and it was perfect. They picked us up at the airport and took us to the port in the morning. The pool was adequate. The only downside was there was only one restaurant within walking distnace of the hotel, Bennigan's, so we had pizza delivered for lunch and had dinner there since we had no car. We would defintiely stay here again if we took another cruise out of Miami port.", "Date": "April 28, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "derby", "Title": "“hhmm could be better”", "Author": "spadge", "ReviewID": "UR15202580", "Content": "Myself husband and 7 yo daughter stayed here for one night 2nd April 2008. We picked this hotel as we needed onenight near to airport as we arrived late evening and didnt want to drive to orlando until the next day. Room seemed tired shabby and not that clean it also had a smokey smell. Bfast was ok but nothing special , staff a bit off hand but we generally experienced rather off hand folk in Miami ! It suited our purpose for one night but its not a place we would return too.", "Date": "April 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Danville, Virginia", "Title": "“Highly Recommended”", "Author": "Reporter", "ReviewID": "UR15142757", "Content": "My daughter, granddaughter and I stayed at this hotel prior to a cruise out of Miami. I always read reviews on TripAdvisor website before I book a hotel, especially in Miami, because they vary widely, and trusted the positive reviews. We were just delighted with this hotel. The rooms were very nicely furnished and didn't seem like a budget hotel. We enjoyed the pool and the breakfast. The staff was exceptionally friendly and helpful. The best part was the price was very reasonable, hard to find in Miami. I would enthusiastically recommend this hotel.", "Date": "April 19, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Arcadia, california", "Title": "“great location but quite noisy”", "Author": "powei", "ReviewID": "UR15133859", "Content": "we stayed at this hotels for two nights before the Bahama cruise . The reason I chose this hotel is its great location. we rent a car to visit Everglade nation park the day before the cruise. it is very close to many car rental companys, enterprise car rental office is within walking distance . we took the enterprise shuttle from the airport to rent the car upon arriving Miami at 10: 30pm . it only take 2 minute drive from enterprise office to the hotel. there is a good restaraunt right next door and its kitchen closed at 12am . if you arrive late in Miami and just want a one night stay . this hotel will be a good choice. We had a room on 4th floor for the first night. it was a horrible experience. The airplanes were flying over our room every 5 min from 6 am. we can hear the the thunderstorm very loud at night too.( I think the insulation under the roof is way too thin) I requested to switch to 2nd floor next morning. I had much better sleep the 2nd night but you can still hear the airplane noise though. the breakfast is quite good , waffle, bagle ,yogurt and boil eggs , juice coffee, milk cerel. the shuttle to the Miami port came right on time( 11; 15 am ). it is free and you have to register when you check in.", "Date": "April 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Lansing, Michigan", "Title": "“Perfect for a one nighter”", "Author": "JWestShuh", "ReviewID": "UR14454769", "Content": "My husband and I needed a clean hotel for one night prior to taking a cruise out of the Port of Miami. We drove from Georgia and after reading reviews here we decided to go for it. We were pleased with our accommodations. It is a bit hard to find and tucked far from the road, so if you are driving, make sure to get directions before hand. We arrived around 8 pm to a nice clean room. We didn't use the pool or eat their breakfast in the morning - but it did look like it had a nice variety of items. The hotel provides you with a free transfer to the Port of Miami via a large bus. I think we left around 10am if memory serves. We felt very safe parking and leaving our car for 9 days (with no extra charge of course). When we returned our car was just as we left it. The only item that dropped the rating from Excellent to Above Average was the plane noise. I knew it was basically next to the airport so I was expecting this - but it was a bit noisier than I had imagined - I don't do much traveling by air. If you are wanting a nice hotel for pre/post cruise or flight, don't delay in booking at La Quinta.", "Date": "March 22, 2008"}], "HotelInfo": {"Name": "La Quinta Inn & Suites Miami Airport East", "HotelURL": "/ShowUserReviews-g34438-d217704-Reviews-La_Quinta_Inn_Suites_Miami_Airport_East-Miami_Florida.html", "Price": "$92 - $153*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3501 Northwest Le Jeune Rd</span>, <span class=\"locality\"><span property=\"v:locality\">Miami</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">33142</span></span> </span> </span> </address>", "HotelID": "217704", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/4d/d4/4dd403e9286950b70f3342ac87c22f144large.jpg"}}