{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Belgrade, Serbia", "Title": "“You get what you pay for...”", "Author": "SandTTraveling", "ReviewID": "UR122449613", "Content": "We stayed here for six nights in between Christmas and New Years while visiting my in-laws. Our room was huge for the price we paid, and the shower was wonderful. There is an S-bahn station down the street within walking distance. The walls were very thin, which made a restful quiet night very difficult. I understand that on New Year's Eve, I have no right to complain but the other nights it was loud. I could even hear cell phones ringing in the rooms next, under or above us. We were even next to the elevator and stairwell, which did not offer any escape from the noise. Should also mention that there is only one elevator for the entire hotel. As I said, you get what you pay for. We paid for our room, so that is what we got. Parking is 5 EUR a day. Internet was provided by The Cloud service which is very expensive, that we opted out. Breakfast was 10 EUR per person per day, which we did not pay. As for the parking lot. There were plenty of spots with all different size cars. Advice I have is to watch where you step. The local apartment complex residents like to walk their dogs in the grassy area near the lot and not pick up after them. My husband was unfortunate enough to be a victim twice. We might stay here again, due to the proximity to my in-laws, if the prices stay the same.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Business Hotel”", "Author": "Oldbloke_TH", "ReviewID": "UR120189749", "Content": "Had an urgent business trip to make (1 day max) and needed a hotel near Schonefeld Airport. Good service, good room, good food. Yes you have to pay extra for things (€5 for airport shuttle direct, €4.49 for 30 mins WiFi but it gets cheaper the longer the period etc) but at a €49 price for B&B in a large room with lounge/work area, I think it balances. Half the stuff that you pay for at other hotels in with the room price, you don't use anyway. S-Bahn station a couple of minutes down the road for city wide access. And yes it's in a residential area so there are blocks of flats, one of which has been converted to this hotel. Would use again.", "Date": "November 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Galway, Ireland", "Title": "“Cheap but...”", "Author": "justablokexxx", "ReviewID": "UR117929207", "Content": "As we missed our flight from Schonefeld airport we were forced to stay in the area overnight. We took a taxi from the airport to this hotel (the RUDEST taxi driver I've ever come across. A grumpy Turkish old man who insulted and mocked us all the way to the hotel). Anyway, the hotel is very simple, we didn't get the same feeling you get when visiting their website. The furniture is quite old, the staff cold (although we didn't have issues with them) and the grub very basic. The hotel is squeezed between two blocks of ugly apartment blocks, so don't expect any lovely views. Also, there is nothing to do or see in the neighbourhood (which looked a bit rough to me). On the good side, our room was very spacious and very, very clean. The sheets spotless and the carpet smelling good. The double was 50 euros. In conclusion, the hotel is ideal if you are on a budget and are forced to stay close to the airport. Basic, no frills, somehow sad-looking hotel.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Leuven, Belgium", "Title": "“Good price-quality, very close to the airport”", "Author": "malinowynet", "ReviewID": "UR116225786", "Content": "Very nice hotel in the proximity of the Schoenefeld Airport. Very clean and comfortable rooms. The hotel is well connected to the center with the S-Bahn. Food in the hotel restaurant was excellent (and huge servings, too!). Very good choice for short stays close to the airpot.", "Date": "August 3, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "truro", "Title": "“berlin trip”", "Author": "dbrnctt", "ReviewID": "UR113712455", "Content": "we stayed at the Leonardo Airport Hotel Berlin Schönefeld for 5 days to explore berlin city the hotel is cheap for the large rooms we paid £40 a night not bad for 2 adults the hotel is clean rooms are fine the bar is small a big resturant the breakfast 10 euro a person to dear we never had brek in the hotel we eat out all the time far cheeper than the hotel prices,to get around is easy just up the road from the hotel there is the train station if you want to go to berlin city you can get the S9 train and change 5 stops to get the next train to the city or you can get the S9 or the S45 one stop down to schonefield airport and get the SR7 that takes you strait to berlin city no change and olso you can get a potsadam train at schonefield statoin no change of trains,as for berlin city tours we went on the price is 20 euro for 24 hours what we found bad was the bus stopped for breaks every few stops that was time waisting we found out as you dont want to sit on a bus for 10 or 15 min every few stops apart from that berlin is a great city to explore the resturants service is slow and worse trying to get you bill in the end,the big rip off is i went and got the german sausage asked for tomato sauce 1 euro they want for a squirt of sauce, the germans i found rude when asking for directions all they want is your money, potsadam is a great place to visit lots to see there.", "Date": "June 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "England", "Title": "“Great sleep and wonderful breakfast”", "Author": "BPX", "ReviewID": "UR107144749", "Content": "I was returning to visit Berlin after not being in the city for 21 years. My airline Easyjet now use Shoenefeld Airport which is in the old Eastern sector and I therefore chose a Hotel near to the Airport knowing full well that Germany has one of the finest transport networks anywhere with Berlin a leading example, I wasn't disappointed! The Leonardo Hotel is only one kilometer or so from the Airport and there is a handy telephone to get their shuttle sevice to pick you up from the Airport for 5 Euros. The hotel itself is had the most compfortable beds and very big rooms with a seperate shower/toilet and a large balcony. In the morning I decided to have the breakfast and for 10 Euros I had their buffet breakfast which was superb with a choice of everything. The reception staff were extremely friendly and helpful. The train station is only 200 metres from the hotel and you can buy a ticket for 2Euro and 30 Cents which lasts you for 120 minutes and takes you into the centre of Berlin. Good value hotel which I would have no hesitation to recommend to anyone.", "Date": "May 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Brussels", "Title": "“Good Airport Hotel”", "Author": "Rosario_it", "ReviewID": "UR107101662", "Content": "We arrived at the airport late in the night and so we called the shuttle of the hotel which came to pick up us about 15 minutes later. The hotel is actually located at about 2 km. from the airport and so to go there you need a car or you can call the shuttle of the hotel (free of charge) or take the train (a station not too far from the hotel). We didn't have breakfast because it was not included in the price but as we were to get up early the following morning it was not a problem. The hotel has a good service and it's perfect to sleep before or after you arrive at the airport. The room are quite big and the staff is friendly.", "Date": "May 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Shildon", "Title": "“handy placed hotel for airport and not to difficult to get into Berlin centre”", "Author": "keithkthr", "ReviewID": "UR95503614", "Content": "The Hotel is situated within 10 mins drive from airport amongst some apartment blocks, there is a shuttle bus although I did not use it, I had a hire car. There is not a lot of bars / restuarants around the hotel but the hotel bar and food is more than adequate. The hotel is in easy reach of the autobahn for travelling by car and if you want to visit Berlin centre then there is a train station 400 metres walk from the hotel. It is best to buy a day ticket for the train (approx 7 euros) and to get into the centre requires one train change, although it is not to difficult to manage. If you wanted to make the trip to the centre by taxi then it will cost about 40 euro each way. The hotel is very reasonably priced in terms of accomodation, food and drink, breakfast is typical German but it is good, the staff are friendly and all speak good English. The hotel has a large car part opposite the hotel, the overnight charge is 5 euro.", "Date": "February 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Lancashire", "Title": "“Dingy area, Poor room, carefree attitude”", "Author": "EBUman", "ReviewID": "UR86279897", "Content": "Recently stayed at this hotel as it was only 1.2k from airport and prices were reasonable. Arrived at night to find the hotel in a dingy unlit area amongst blocks of flats. Part of our room was unfinished and looked messy. Upon complaining to the staff we were told it was undergoing refurbishment and I quote 'would be much better next year', which is a very poor attitude to customer service! I would not choose to stay here again.", "Date": "November 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“Here we are again but in a better room!Service is still bad!”", "Author": "Michael-TCS", "ReviewID": "UR72274679", "Content": "i visit Berlin for two nights and this is my second time to Leonardo Airport Hotel. The room that i stay this time is much better than the one at my first time. It is very nice clean and big with an excellent shower! This time i have breakfast but i cannot say anything about that i just say that it is a basic breakfast nothing more and nothing less. The shuttle service to the airport i must say again that it is only a mirage! It is the second time that i ask to take as to the airport and the answer that i take is that there isn't any other employ to stay at the hotel so nobody can take as to the airport. If have to stay at this hotel i want to tell you to have in mind that you must take the S-Bahn to the airport.Do not worry it runs 24/7 and the station (Grunbergalle) is a 5 minute walk. I must say that this is the last time that i stay at Leonardo Hotel, next time that i visit Berlin i will stay in a closer to Schoenefeld Airport hotel. P.S Change the carpet in the breakfast room.", "Date": "July 25, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Brasilia, DF", "Title": "“Next to the airport”", "Author": "Ga_bi_91", "ReviewID": "UR68061397", "Content": "Since my flight would arrive quite late at the Schönefeld airport, I decided to book a room with this hotel for its proximity to said airport. That was the main reason, but the fare and the shuffle service also influenced my choice. I think the fare (45 euros) could include breakfast, which it doesn't. If you want to eat, then you should pay 10 more euros. The shuffle service wasn't available the day I arrived because the driver had called in sick, so I had to take a cab, which cost me 8 euros (3 more than the shuffle, I believe). I could have got there by S-Bahn too (the hotel is only one station after the airport), but as I had seen on google maps the hotel was a little far away from the station - I wouldn't feel comfortable walking there by myself. On my reservation I had asked for the service and I think the staff should have confirmed the shuffle or say that it wouldn't be available for me by simply calling me. The other thing I had asked for was a non'smoking room. They didn't pay attention to that either and, had I not asked whether my room was a non-smoking one before taking the lift I would have had to go back to the reception and ask for it to be changed. Luckily, I remembered to confirm and when the receptionist said that my room was actually a smoking one, the manager arranged for me to stay at another one (a double!). My room was big (since it was a double) and clean. The towels had a strange smell though I believe they were indeed clean. The next day I checked out and the morning staff was also very nice to me. Overall, I enjoyed my stay and would recommend to people in my situation: arriving late at the airport.", "Date": "June 20, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "london", "Title": "“Grim, very grim”", "Author": "gundersLondon", "ReviewID": "UR60809962", "Content": "This place is a dive. Cheap??..well ok..but not really when you add the shuttle bus, breakfast, internet and overpriced restaurant if you want something for dinner. It's not close enough to walk to the airport and it's in a very grim spot ( women be careful ) - it's in an an old communistic 10 storey residential block. When you get there, there is absolutely nothing to do ie no bars, restaurants etc nearby. If you do book it, get there late and go straight to bed - that would be my advice! Better still, don't book it at all!! My fault- i booked it mistaking it for the intercity hotel which is right near the entrance to the airport", "Date": "April 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "london", "Title": "“An honest review.”", "Author": "teegysarah", "ReviewID": "UR54899055", "Content": "Staff were rude, unhelpful and rarely at the desk. On check in, we were given the wrong room even though on our reservation we had booked a double comfort room, they gave us a small room with two single beds, seperated. After a short disagreement, we finally got what they consider a double comfort room. The room had damp, cracks in the celiing and walls and the carpet was badly stained. It has to be one of the worst hotel stays I have ever experianced. Carpets in the halls were worn and untidy, the hotel had a musky smell about it. The hotel's website said the shuttle service was part of the booking but we were charged 5 euro's for the service. The prices were unrealisticly high. Only stay here if you have a small budget and your staying one night only.", "Date": "February 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great place for a short stay!”", "Author": "Karolina_Boch", "ReviewID": "UR38865103", "Content": "We've stayed at this hotel for one night to catch an early flight the next morning. We decied to walk to it from the airport as we only had some small hand luggage and the weather was great:) It was around 30 minut walk, which was not to long, it's easy to get to it. Place itself is different than we expected. I read the reviews and knew already that rooms are big, but seeing this in reality was still a surprise. This are apartments converted into hotel rooms, so they are realy spacious. Bathroom was of a good size as well with the best shower ever - the water presure is extremly strong. Both room and bathroom clean and tidy, tv with small selection of chanels but it didn't bother us. There is a small bar in the hotel, reasonable prices. Breakfast was good, just enough to satisfy everyone's needs I would say. Taxi to the airport was 12euro.", "Date": "August 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Norway", "Title": "“Great hotel, and large rooms”", "Author": "Supar", "ReviewID": "UR37046554", "Content": "We stayed here an evening to catch an early flight the morning after. The shuttle came within 5 min after calling the hotel. The U-Bahn is 200 meters from the hotel, and made it convenient for us to spend a evening in the centre of Berlin. Definately a recomandation, and we are coming back! Danke schön!", "Date": "August 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Swindon - England", "Title": "“Excellent Hotel For Late Arrival in Schoenfeld”", "Author": "wila", "ReviewID": "UR29921054", "Content": "I stayed at the Hotel having arrived late into Berlin Schoenefeld Airport. The hotel was situated 1 stop on the Metro going into Berlin. When you leave the metro station turn right and the Hotel is some 150 yards further on. The only concern is how dimly the street lights are near the hotel so if you are women travelling alone then you might like to ocnsider getting a taxi to the Hotel from the airport. It is only 10 minutes away and should cost you a lot. The Hotel was excellent for me. The staff were very good and the room was superb and clean as well. The bar was good with reaosnalbe prices and friendly staff. I stayed here primarily for the conveniece of being near the Airport . It takes some 40 minutes by Metro to reach central Berlin. My train for Leipzig left early the following morning so it was ideal loacation having arrived late the previous night", "Date": "May 13, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Caboolture, Australia", "Title": "“Great Stay, Very Convenient”", "Author": "Davo62", "ReviewID": "UR18551943", "Content": "Very convenient for our purposes. We were only in Berlin for one day, flying in from London early in the morning, picked up from the airport in the hotels courtesy bus (Free), then we were able to early check-in and freshen up before off to sight see in and around Berlin for the rest of the day. Easy excess to the train (station is walking distance from hotel). The next day we took advantage of the free coutesy bus back to the airport to pick up a hire car to continue our tour through Germany. Very friendly staff, great hotel suited to our purposes. A lot better than carting all our luggage all around Berlin to stay closer to the City. The hotel is only about 30 mins on the train to the city which runs frequently. From the top floors you have the views of the surrounding area. We found the hotel had all the mod cons that you would expect without all the bells and whistles of a 5 star hotel. Large flat screen TV, fantastic beds and great breakfast room in which we had a full breakfast (extra cost, but worth it). Overall a great place to stay if it suits staying out of the main Berlin city area. Price was reasonable also, we paid $AUS213 for 4 people with full breakfast.", "Date": "August 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Very decent airport hotel”", "Author": "ifi", "ReviewID": "UR18122291", "Content": "The airport hotel Schonefeld is located one S-Bahn station away from the airport but it also provides a complimentary shuttle service that is available almost all day from or to the airport. The rooms are very large and they even have a separate lounge with couches and TV! The night shift staff was really friendly and helpful. The bad thing is that the hotel is far from the centre of Berlin (about 35 mins with S-Bahn), not so suitable for sightseeing. We used it only for a night-over and were very satisfied with both the amenities and the low price!", "Date": "July 22, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "N Ireland", "Title": "“Good Hotel for the price”", "Author": "Bostontea", "ReviewID": "UR8665992", "Content": "Despite the name of this hotel don't expect to walk out of Schonefeld Airport and see it. In reality it is about 1.5 miles away. I made the mistake of trying to find it myself anf that was a big mistake. A travel agent accross the road from the airport had never even heard of it! Ended back up in the airport completely confused! However I quickly realised that the hotel offers a free shuttle bus for the airport. There is a courtesy phone near the Info Desk. Hotel appear to be in the middle of a housing development. That said it was fine, basic but clean. Very handy to railway and by asscoaition central Berlin.", "Date": "September 6, 2007"}], "HotelInfo": {"Name": "Leonardo Airport Hotel Berlin Schonefeld", "HotelURL": "/ShowUserReviews-g187323-d217901-Reviews-Leonardo_Airport_Hotel_Berlin_Schonefeld-Berlin.html", "Price": "$51 - $126*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Schwalbenweg 18</span>, <span class=\"locality\"><span property=\"v:postal-code\">12526</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "217901", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/06/d3/06d3ffce7459a1620d6ec13cd5bac0818large.jpg"}}