{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Gilbert, Arizona", "Title": "“Nice place to lay over.”", "Author": "joloughlin", "ReviewID": "UR126117035", "Content": "Ciqala is a brand new hotel in the Miramar district. We only stayed 1night while waiting to board our cruise. From what I could see, the hotel in not within walking distance of anything you would like to see. There was one very small restaurant 1/2 block away. The wait was too long so we opted to order a pizza in the room. ---One more negative and then I'll get to the positives. There is a 7-11 type convenience store next to the hotel. We stopped in to pick up bottled water. The store was open, but the door was locked - we had to get buzzed-in. Just guessing here, but I think that speaks volumes to the character of the neighborhood! You also need to get buzzed-in to the Ciqala too. --Even though Ciqala is new, it already had graffiti on the face of the bldg. --Now, for the pluses: the receptionist was very friendly and offered us an upgrade without our asking. We were given a resident apartment - 3 bedrooms, 2 full baths (one with jacuzzi), full service kitchen - the apt was very lovely and sparkling clean. --A full breakfast is included with the room rate. -- Other than the location being a bit questionable, I do recommend the Ciqala for a visit to SJ.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "St. Thomas", "Title": "“We didn't want to leave!”", "Author": "Jadyn M", "ReviewID": "UR125896356", "Content": "This place was excellent for a bigger group. 6 of us stayed in one of the bigger suites and it was a perfect setting. Maybe not the best part of town and there were a few problems with the water pressure, but overall it was well worth the price we paid. The front desk is full of friendly staff and the complimentary breakfast is nicer than most breakfasts spots in town. We didn't want to leave!", "Date": "March 10, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Caledonia, Michigan", "Title": "“Not worth the money. At any price.”", "Author": "Julie V", "ReviewID": "UR124711459", "Content": "We recently returned from a wonderful cruise vacation starting in Puerto RIco. WIth one exception. We booked a 3 bedroom condo for a night at the beginning and end of our cruise with Ciqala. When we checked they decided to add about 150-155 dollars of additional cost. The reservation for stated the cost was based on 2 but our reservation was based on 6. The refused to budge and since we got there late at night we were unable to travel elsewhere. They advised other people had had this problem too but they were not responsible. As for the property itself. It was very out of the way, far from the beach, far from restaurant selection, and in a less than desirable neighborhood. Our room overlooked abandoned buildings and trash. It appears in the pictures it was recently remodeled. It was, but with poor workmanship. We cancelled our second night stay and moved over to the Holiday Inn Express in Condado for 150 dollars cheaper and were so happy we did. Holiday Inn was good lodging. Close to open stores, food, and beach was right across the street. Awesome. We would stay at the Holiday Inn again. Ciquala we would not.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Very Impressed”", "Author": "Henry R", "ReviewID": "UR124670757", "Content": "Me and my wife stayed for 2 nights before our cruise. I chose Ciqala because of the good reviews I saw on-line throught Expedia. com. The reviews were very helpful to me in making a decision of where to stay in a city I never stayed in before. There were cheaper places but \"you get what you pay for\", and I would defintely stay at Ciqala again. It is clean, spacious, safe, conveniently located, nice amenities, wonderfully decorated, and has a nice staff. I was \"Very Impressed With Ciqala\"", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“Excellent Stay and Staff”", "Author": "jose l", "ReviewID": "UR121663786", "Content": "During my stay in San Juan PR, I had the opportunity of staying at Ciqala Suites for over 2 months. The hotel made me feel like I was staying at home. The parking lot is very safe and the hotels location is very safe. Shopping is 5 minutes away in a car and you are extremely near very popular restaurants. The hotel is conveniently located next to a 24 hour express shop which is well priced for emergency snacks and drinks. Very little hotels in today’s economy take the time to please customers. During my stay, Ciqala was always asking me how they could make my stay better. If it is your first time in PR or return visit don’t hesitate to stay at Ciqala home suites because your experience will be fantastic.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“We enjoyed our stay at Ciqala very much.Excellent service and staff.”", "Author": "tanya a", "ReviewID": "UR121213722", "Content": "We booked this place through Expedia.We didn't know for sure what we'll get.It was very pleasant surprise!The place,location and staff were excellent.It was beyond our expectations.We were group of 6 and everyone agreed that this place is very,very good.We stayed just for 1 night.We did early check in and next day left our luggage till after 3 p.m. without any problems. We will recommend this place to everybody.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Munster, Indiana", "Title": "“Excellent value”", "Author": "papisan", "ReviewID": "UR120818523", "Content": "What can I say about Ciqala. This was a recommendation from my cousin, and Im so glad that he told me about this place. I was able to host a welcome dinner here, as well as have some of new family stay here as well. The service from Olga Cano and Abraham Ayende and staff was great, as we had around 40 guests show up. Everyone had a great time and could not stop talking about how beautiful the place was. As for the sleeping accomodations, they were great as well and to have a concierge and parking is a definite plus. I will be coming back here soon!", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "SAINT MARTIN FWI", "Title": "“Great place and nice and very helpful staff .”", "Author": "Janine H", "ReviewID": "UR120550305", "Content": "I had great expectations and they were satisfied. The staff and manager made everything so easy for us. We had a baby, ask for a crib and it was mounted in minutes.The place was absolutely beautiful and clean. I enjoyed the jacuzzi in my room. After our shopping experience we were happy to hop on a cab and rush to our confortable suite. I'm already planning a new trip. See you soon !!! J. Hamlet", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rock Hill, South Carolina", "Title": "“William Douglas.”", "Author": "william d", "ReviewID": "UR120381383", "Content": "I had a wonderful time. Thanks to the Staff there especially LOLA and company. I would love to come back. Send me a discount coupon so i can return in December.", "Date": "November 9, 2011"}], "HotelInfo": {"Name": "Ciqala Suites", "HotelURL": "/ShowUserReviews-g147320-d2179878-Reviews-Ciqala_Suites-San_Juan_Puerto_Rico.html", "Price": "$168 - $397*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">752 Fernandez Juncos Ave.</span> | <span class=\"extended-address\">Miramar</span>, <span class=\"locality\"><span property=\"v:locality\">San Juan</span> <span property=\"v:postal-code\">00907</span></span>, <span class=\"country-name\" property=\"v:country-name\">Puerto Rico</span> </span> </span> </address>", "HotelID": "2179878", "ImgURL": "http://www.tripadvisor.com/http://media-cdn.tripadvisor.com/media/photo-s/01/ed/51/0a/master-room-with-king.jpg"}}