{"Reviews": [{"Content": "we had roaches...       Nightly entertaiment", "Date": "Dec 28, 2008", "ReviewID": "UR200502256", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "1", "Location": "1"}, "Author": "oryben"}, {"Content": "Gone Downhill!! We arrived November 29th after overnight flights. This was our second trip to the resort. We had been there in 2003 at the same time of year and took our daughter and 2 teenage grandkids to see the Christmas decorations we remembered. We usually have a policy of not revisiting a resort, should have stuck with it.Arrived, our daughter and grandkids were given a loft room, we were told we had no reservations. 1 1/2 hr later, our reservation was found. Despite an emil request when reservations were made in October, our rooms were at opposite ends of the complex.The Beach Resort area of the complex was supposed to be open in December. This is a major portion with the largest beach area, buffet and 2 a la cartes, only the grill open there.Did not look like rooms or pool areas had been maintained at all in the past 5 years. Wood decking at the Casino and Golf pools was rotting, loose boards.We somehow seemed to be covered with the cloak of invisibility when dining. We got partial meals at the a la carte, sometimes not even a glass of water at the buffet (We do tip 3-5 at the buffet, more at the a la carte) We often stood at a bar with multiple staff members talking, no other guests, no service (again we tip about every other drink, water included).For our last full day, we decided to upgrade to the Palace ($35.00 per person and WELL worth the cost) As directed, we went to the Palace desk, the helpful young lady took care of my request and sent us to the cashier. There I was told that she had made a mistake and was sent on a 11/2 hour wild goose chase through guest services and varying lobbies. Surprise, when I arrived back at the Palace and my husband took one look at me and complained at the desk, all we had to do was pay the cashier.The service food, pool, beach was well worth the premium for the day (even though for unknown reasons, the seafood restraunt was closed that day.)Price was good, but nothing short of free would bring us back.PS: the segway was a riot! one of 2 times the teens enjoyed themselves.", "Date": "Dec 22, 2008", "ReviewID": "UR885780961", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "4"}, "Author": "ceweyfoowa"}, {"Content": "Beautiful Resort, with a few unfortunate issues. My girlfriend and I stayed at the Casino from November 27 to December 11 2008. Now I have to say that the are definently some pros and cons about this resort, but one thing that unfortunently left a bad taste. Our room was ok, but I found it to be a little grimy and out of date. For instance, the ceiling was showing signs of water damage and the blanket was a yellow/orange thing with nasty stains all over it. At first, I thought it was a cover sheet and there was a blanket underneath, but only a sheet to go under. I can tell you that i have been to some ghetto hotels before (ex. Getaway Club in Peurto Vallarta, Tropicoco in Havana), and I am happy with average and not picky what so ever, but this blanket made me cringe, and I did not want to touch it while I was staying in this room. The food in the casino buffet was good, a wide variety and always a chef or two cooking pasta, steaks, omolittes, and sometimes tacos/barritos on Mexican nights (usually twice a week). In addition to that, there are a couple free a la carts (italiano and one or two others). They are nothing to brag about but decent. The other a la carts cost $20 US I think, we never went to ones that we had to pay. The beach was excellent, long coastline with 3 hotels backing onto it. However, the Barcelo Beach Resort is under full construction, boarded off from the beach, and noisy due to complete renovations. Also on the beach is free kayak, peddle boat, and canue. Lots of other things (glass bottem boat) for $$. The pool tables cost $1.50 US a game, which we found pricy but we were on holidays so we endulged. The pool areas are generally nice I found and pleasent to be around. Always lawnchairs available. Now for the thing that took big time points away from this resort. The resort is full of these guys that want to sell you a rides on a segway. Now, understand, these guys are EVERYWHERE on the pathways between hotels within the resort, in the lobby's of every hotel, on the streets linking the hotels, and inside the hotel areas. They were relentless in harassing us to buy a ride on the segway. For those of you who dont know what a segway is, its a motorized thing with 2 wheels that you can ride around on, and it $30 for an hour. No matter where you are, if are waiting for the train that drives to the hotels in the property (for guests), they with harass you to buy the ride, when you walk on a pathway trying to enjoy your vacation, they come up to you and harass, when you are in your own hotel lobby and some times they come in as far that the pool! Guess what? THEY HARASS YOU! I want to point out clearly, that when I walk down the street (in the resort) they spot you out from a distance, walk upto you (and cut you off) get in you face and blah blah blah but they segway and follow you, shake you hand, waste your time. I cant beleive this was never mentioned in the other reviews, and I read them all before I stayed here. But I will give you an example, this morning, I had to return a towel for a towel card because I was checking out. I walked from the Casino, to the Carabie, returned the towel, and walked back to the Casino. In this short walk, I was harassed by 3 different segway guys perpetually in my face and annoying the [--] out of me. They are like scavengers of the worst kind, one was trying to sell me this, and when I said no repedidly, he started going on about how he works on commision and he needs money (trying to make me feel like the bad guy) and went on and on. I dont give a rats [--] about this guys sob story, and especially when i am trying to enjoy my vacation. I told him to scew off in more ways than.. 4, but they dont seem to understand the word no, and keep trying. Overall, these segway sellers probably harassed us a total of 4 to 5 times a day, everyday, for two weeks. I just think that it is not fair to the guests of Barceco in Punta Cana that they cannot walk freely about the resort (which is a wonderful resort), and they cannot relax walking out the beautiful pathways and streets becasue they are constantly being harassed to buy the segway fellows. I also am a little disapointed that a respected hotel resort Barcelo would allow this to happen in their resort and I think its getting a little out of hand to how the guests are being harassed inside the resort. If i want people to relentlessly try to sell my things, I will choose to leave the resort and go into town. But inside the resort should be peaceful to the guests! I will also add the the service from the employees was exceptional, in the buffet they do their jobs with class, and never ask for a tip. I was also in Cuba earlier this year, this beach was even better. It is a world class beach. I would have given this hotel a 4 star, but Barcelo, I feel, has to start seriously addressing the issue of the segway pedlers, because it is becomming an issue at the expense of the guests.", "Date": "Dec 12, 2008", "ReviewID": "UR921909447", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3", "Value": "4", "Rooms": "2", "Location": "5"}, "Author": "Colboyo"}, {"Content": "Get ready for MOSQUITOES And FOUL ODOR My family booked two rooms at the Hotel through the company's website. The booking was fast and easy, and they allowed us to make certain requests. We requested first floor rooms because my wife's mother is handicapped. When we got there we got two rooms on the first floor as directed.But as soon as we left the room we were hit with this terrible smell. This smelled like dirty water with feces. It was terrible.Then the mosquitoes. They were even inside the room because when the cleaning crew goes to clean they leave the door open, and in comes the mosquitoes. It was terrible. We had repellent everywhere and we still got bit.The food at the Casino was at the best OK we preferred the food at the other hotels in the compound.The beach was a long distance off, and the Casino pool was nice and staff very friendly.The shows were ok.all in all, we will not go there again. If i want to get bitten by mosquitoes i can go elsewhere... how terrible!", "Date": "Sep 24, 2008", "ReviewID": "UR878331700", "Ratings": {"Service": "2", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "3"}, "Author": "DominicanTraveller"}, {"Content": "Average vacation We, two married couple, stayed in the Casino Barcelo 10 nights at the end of March. We were able to change our regular rooms to the Junior's suites (split level). Overall it was fine vacation, walking to the beach - about 300 yards - was not a problem at all. In contrary to Barcelo's website 7 restaurants in the complex are not included and Casino's buffet is not the best. There are just couple TV english channels, everything else is PPV. Even bicycles are $10 per hour, catamarans - $25. Minibar  safe are free. Shrimps on the beach - a best part. Beach is good, but needs more attention (cleaning). Will we return - not sure, probably, no.", "Date": "Apr 10, 2008", "ReviewID": "UR952725528", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "2"}, "Author": "alnemir"}, {"Content": "better than the reviews that we had read Check in was fast and friendly with helpful staff. Our rooms were clean,but needed upgrading, a/c worked good, no problems with the rooms at all. This not a 5 star resort. We figure about a 3.5 star. The food was hit and miss in the buffets ,breakfast was always good. The pizza was good at the Italian and Steak House restaurant, and the snack shacks at the Caribe and Beach. Hamburgers and fries at the casino pool bar everyday were good. The Steak house was our favorite.Bar service was hit and miss as well. Some were very friendly and some weren't , tip or no tip. Most staff did not speak very much english, however, we are in their country, with a little sign language, things usually worked out.Beach was excellent, usually no problem finding a chair. Staff were always cleaning up after some people who would just walk away from half full drinks and pizza boxes left on the beach despite an abundance of garbage boxes, c'mon people.All in all, we had a great time, however, we would not rush back to this resort unless it was great deal.", "Date": "Feb 25, 2008", "ReviewID": "UR451314262", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "elgerri"}, {"Content": "A little piece of Paradise! This was my first trip down south and this resort was so awesome that I may be desapointed on my next trips!This hotel is part of a 5 hotels resort, in which you have acces to mostly all restaurants, bars, shops etc...The rooms were clean (always leave a little gift for the maid, assuming she has a dozen children and they deliver an even greater job)Food was good! Especially the Italian, otherwise thanks God the PINA was excellent! :)Entertainement was really exciting!! Thanks to strangers who randomly pointed us to go up on stage and dance for an hour infront of hundreds of tourists!! At this point the Rhum was so sweet and good that it didn't even matter!!!As for activities well I discovered that I was allergic to horses while horse back riding on the beach!And we bought ourselves some snorkling gear to go by ourselves!! the water is amazing!!!! And you can actually find big seashells!And the beach, well what can I say more!! White, hot, beautiful and soft sand!!!Therefore, can't wait to go back!!", "Date": "Jan 28, 2008", "ReviewID": "UR199810518", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "Veronic22"}, {"Content": "AMAZING!! well let me begin by saying this is the first place i have travelled to outside of canada but it was my boyfriends 3rd time going to this resort. i loved it. i will break it up for you.BEACH- i wish there was more hours in a day cause i could not get myself off of this beach. the water was so warm and the white sand was so amazingly soft. There was ample amount of chairs to lounge in and the scenerary was stunning! i dream of this beach still cause it is so beautiful. they keep it sooo clean and there is no sea-weed.RESORT- we stayed in the casino resort which was the furthest from the beach but it was only a block at max to get to the beach and the train which was so much fun, it had carribean music playing on it and it was really a nice treat when u didnt feel like walking half a block to the other resorts. Our room was always cleaned and stocked with pop, water and beer but we usually left a tip in our room cause the cleaners were super friendly and they really liked my boyfriend haha!! the casino is pretty small and we really didnt spend much time in there.THE STAFF= besides the language difference, very very friendly.. i kinda found that the guys were pushy trying to sell u a horseride or snorkeling but u just have to smile and say not interested we will come find u when we are politely and they would leave u alone.THE FOOD- here is my only complaint...the food was not great and i read some reviews before we left so i already kinda pysched myself for some gross food. but i am the most pickeiest eater so my opinion really shouldnt be taken to heart.my boyfriend ate everything and loved it, i stuck with rice and buns for a week.. we both got cramping and diarrhea for one day but it wasnt that bad, we just stayed at the poolside...however on our way home on the plane it seemed like everyone had diarrhea, so maybe im lucky that i stayed with buns and rice..i wouldnt say the food is terrible, im just used to good canadian food..OVERALL- i am dying to go back to this resort, the 4 resorts in this complex are all different and all beautiful, there are tons of restaurants and buffets to choose from..i found that the casino buffet was great for breakfast and the barcelo beach resort was the best for lunches and all the restaurants were nicely kept and entertaining. i plan on going back to this resort cause i dont think i can imagine a more gorgeous beach anywhere else in the world. GO HERE YOU WILL NOT BE DISAPPOINTED!!", "Date": "Dec 19, 2007", "ReviewID": "UR400654984", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "5", "Value": "-1", "Rooms": "3", "Location": "4"}, "Author": "edmontongirly"}, {"Content": "Good for the money We (2 couples 2 rooms)booked through Travelocity flying out of Boston (Weds. to Weds) on Delta with 7 nights at Barcelo Golf for 610.00 a person including hotel transfers. When we got on the bus to the hotel the guide said the Golf hotel was closed. He called ahead and stated we were booked now at the Caribe. Having stayed there before I was happy with that because I knew it was closer to the beach. When we got dropped off there the desk stated we were actually at the Casino ( not excited about the move). We had golf and diving equipment to drag around. But a bellman came right up and loaded everything up and took us to the Casino. No lines anywhere at check in. The rooms were not ready yet but got checked in and went to buffet and bar and they were ready when we were done. Rooms were on the 2nd floor and had two full beds downstairs with a bathroom and a king upstairs with a bathroom. Easily could sleep 6 or 4 with room to spare. They had just put a new featherbed top on the king upstairs so we slept there. During the week new featherbeds came for the downstairs. Thought it was the best room we've had on this property having already stayed at the Beach and Caribe hotels. At first I thought it would be to far away from the beach but it was fine. It is actually no further from the bars, buffet, dive shop, pool etc. of the beach hotel than the further rooms of the beach hotel are. I never have a problem with the food here. I extremely enjoy the Steak House and Italian Restaurants. We ate at these 2 for dinner all week. We did the buffets (all 3) for lunch and breakfast each day. I'm a beer drinker so the bars were fine for me. For the girls (tropical drinks) the bar tenders had to be reminded to put alcohol in every time. The one place I see a lack of speed is in the bars. I would put an extra bartender in them and pull some help from the buffets. We golfed one day but was very disappointed. They've let the course run down and only had the back 9 open. Driving range was also closed. It wasn't worth taking the time to do it a second day. The casino has been updated since we last visited. It was good entertainment but never very busy. Not that I'm ever in the room but found only CNN in English but a card that stated there was more English channels. When we called down they said it was 5.00 a day or 20.00 a week(we said no thanks) We did the Fun Buggy tour off the resort and really enjoyed it. We did the Segway tour on the resort and had a lot of fun with that also. We've seen the property run down a little over 5 years but would recommend it for a first timer to Punta Cana on a limited budget.", "Date": "Oct 20, 2007", "ReviewID": "UR745888773", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "5", "Location": "2"}, "Author": "Snake"}, {"Content": "Disappointed with Barcelo! I and my boyfriend stayed at Barcel贸 Casino from 21 to 28 of September.I鈥檓 writing review now, since I been really busy after we came back.We are not of those people, who would expect a 5 star treatment at a 3 star accommodations. It was my 4th trip to Punta Cana. Previously I stayed at Occidental Flamenco (Occidental Grand), IFA and Ocean Bavaro. I also been to Jamaica and Mexico at a 3 star accommodations and liked mostly everything. I had no complaints about those other places I visited in Punta Cana and Mexico. Starfish Trelawny was good 鈥?but beach area there was terrible. There鈥檚 an only one bad experience I had before in Caribbean 鈥?disappointing beach of Starfish hotel at Jamaica. Beside that 鈥?no complaints at all! Since my positive experience at other 3 star hotels I had no worries about negative experience. We didn鈥檛 expect anything fancy or classy. All we wanted just a basic accommodations and terrific beach, where we could snorkel, parasailing and just chill under beautiful Dominican coconut trees.Check in:We arrived at hotel about 11 am. Waited more than 5 hours for check in鈥?Ok. It is not a bad start鈥?We just took our time to explore a new place, getting familiar with this big complex. We went to eat lunch at Steak house, which is located right on the beach. My tenderloins we soft and juicy, but my boyfriends steak was dry and didn鈥檛 taste like a 鈥渃ow鈥?at all鈥?He was afraid to eat it and kept sniffing the meat鈥?and couldn鈥檛 really go on with his lunch鈥?I tried and it鈥檚 true, this steak had a weird aftertaste鈥?I wouldn鈥檛 it too鈥?Room:Two stories room on the 3 rd floor. No elevator鈥?But there鈥檚 another set of a long and rough open stairs in the room. Some people must consider!!!! Decent size bed and a full bathroom on the second floor. Too bed toilet had no power to flush!!! No matter how much I complained at front desck, to our Apple Rep. nobody ever came to fix it. Even though made was there every day鈥?Hm鈥?br/>Thank God there was another full bathroom on the first floor.One time there was no water at all鈥?Surprise!!!! I鈥檓 not talking about just a hot water鈥?I鈥檓 saying that there was no water at all鈥?But that happened only one time from the morning to the lunch time鈥?br/>In the room, downstairs were really old and moldy ugly yellow couches. Couches and soft chars had moldy stains like somebody was peeing on them over and over鈥?I didin sit there鈥?Was disgusted event to look at it. Beside it had strong moldy odor鈥?it smelled! No鈥?鈥淪mell鈥?it鈥檚 a soft word. It stunk! I just brought two plastic chairs from the balcony for sitting.Electric outlet upstairs was scary! It was made for both 鈥?European and American standards. But I couldn鈥檛 plug my hairdryer to it anyway. It should be a special unit. I guess old style unit they used in US long ago. Hotel's fan had american standart plug, but different kind, with a small head. Outlets were made fo both standarts, but I woudnbt advise to hook your gadgets there. It scary, even though it's made for it. I looked for other outlets, but they were out of reach, or at inconvinient place.Weird!!! I had been to Punta Cana 3 times. Never experienced this problem!Beach: Great location, great beach!!! Wonderful!!! But... :-((( We were so excited to come to the beach鈥?Finally!!! Ops鈥?What a hell is that?! There were plenty available chairs, plenty of shade鈥ut it was sooooo dirty. I never seen beach being so filthy before. Beach was overflowing with plastic cups, empty bottles, bags and other garbage.I鈥檓 a not a princess. I can pick up somebody else鈥檚 garbage and throw it away, if I鈥檇 find a perfect spot on the beach. But there were so many of that garbage all over the place... I almost cried. Same garbage was floating it the sea鈥?Beside that music was so laud, it clogged my ears. Tourists on the beach were so laud, it was unbelievable! There鈥檚 going to be a special word about those tourists. And yes, it something that has to do with hotel itself.Because of this it was impossible to have a nice time at the beach. Too many people, that are too laud. Music is blasted your brains off... All the same tunes over and over. Garbage all over the place. We couldn鈥檛 be there鈥?No way! We had to go to the beach at other place, next to Caribe.Next to Caribe was some other resort. Very nice, clean and quite beach. German and French tourists, that are pretty quite and clean. We had no problem. Drinks were a short walk away to Caribe. Fine! Not so bad at all鈥?To bad that is our beach a piece of hell in the paradise!Special word about tourists at Barcel贸: Who are they? Where they all came from?I don鈥檛 wan to describe their appearance, so somebody can misunderstand what I鈥?trying to say here. Let me tell you something. Those people were extremely loud, one tried to out scream another. They were extremely dirty, throwing trash all over the place. They were extremely rude, didn鈥檛 know what waiting in line means. They would push you out of their way, or scream behind your back to get served first. 鈥淎mericano Stupido! Americano Stupido! 鈥?That鈥檚 what we heard sometimes鈥?How nice of them鈥?br/>Resort train ride with those people was a special experience鈥?There were many of them in the resort, but it seems like they all knew each other. It was not very pleasant, riding with a crowd, which behaved like a spoiled kids, screaming as laud as they can. On Monday my boyfriend told me that he heard somebody was saying in English, that 鈥渁ll of them going to leave on Tuesday鈥濃€?And a miracle happened! All those tourists actually left on Tuesday, leaving hotel as filthy as place could get. But It became nice and quiet.New tourists came. Most of them spoke Italian, French, English, and some of them spoke German. I saw next day how new tourists would pick up trash on the beach, and throw it to containers. Hotel Stuff never cleaned trash out of the beach. I watched cleaning stuff. They never cleaned thrash! They just cleaned seaweed by the sea, that鈥檚 all.Tourists cleaned after themselves. We finally moved to the beach at hour hotels chain. Since new tourists from Europe and Canada made it a little better, since they didn鈥檛 make noise and cleaned after themselves beach area became more decent.Best of our trip. Please, get your own snorkeling mask and explore offshore waters. First, it seems like there鈥檚 nothing live there, but there is so much! We so a lot of beautiful kind of fishes right off shore. Try area at the Beach resort and Barcelo Premium. Try dark spots in the water, where is grass. A lot of beautiful and interesting fishes live there.Put on snorkeling mask. Get some bread or fruit to feed the fish. You came to the water... You don鈥檛 see anything鈥?Just throw the food and wait couple of minutes鈥?Aha! There鈥檚 is fish! So many of them! Some fish stay in schools, some fish by themselves. Wait a little longer. More fish are coming. Just a little longer and don鈥檛 use all of the bate. You will have some more visitors for a treat, just be patient. There was couple of fishes, they always came late, but they always came! One fish looked so funny, with two horns on the head and flat stomach. Her mouth was small and round. Another fish had legs, arms and wings. I was following this creature one time all the way. But when my boyfriend saw it, he dived to get a better look at the walking fish with the arms鈥?Fish just opened it beautiful wings and flew away鈥?Ah鈥?Definitely take a snorkeling trip! The one for 30 bucks a person, to the more remote reefs. It was unbelievably beautiful! So many colorful fishes, coral reefs are breathless. We really enjoyed this snorkeling trip on catamaran. Food: Comparing to other resorts I've been food wasn鈥檛 that great. I鈥檓 Russian and my honey is Amercing born. He didn鈥檛 really like their food. We didin starve, but havan't been thrilled with it. Nothing special, nothing delicious. Hotel Grounds: Too bad resort grounds were not given a proper treatment. Ponds were filled with garbage that floated among water lilies. Service at hotel never cleaned this garbage. The same plastic cups and empty beer butles were floating in the ponds during all our stay. Same kind of trash was seen practically everywhere.One really unpleasant thing. By walking to our room, that was located on the 3rd floor, we coudl enjoy looking at the filthy roof, of the building next. Roof was filled with all kind of trash - broken furniture, dry plants, brocan containers, different garbage... We hare to rest. I understand it's not a 4 star resort. But all this garbage right in front of our eyes every time we go to or from the room, why we shoudl see it? That area on the roof - it was like an attick of the broken old stuff.Anyway 鈥?our best experience were snorkeling and time, when all those 鈥済hetto鈥?tourists left.", "Date": "Oct 8, 2007", "ReviewID": "UR509800666", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "travelerbythesea"}, {"Content": "fine location I had the chance to stay at this hotel for free, as a perk received from my company, for one week. I must say straight off that the location could hardly be better for a sea only vacation. the Beach is really wonderful as are the many swimming pools. The double standard room was rather well appointed, considering the star rating of the hotel. service was courteous and there were plenty of attendants available at the common services. I must say the food was of rather bland quality, except at the mexican restaurant of the complex, where it was downright terrible. since I know the price of my stay , I consider this hotel to be very good value for the money. It does tend to get a bit boring after one week, as it is located very far from the capital of the island, so you really need to plan some excursions, if you are not in the mind of having a sea and relax only vacation. the casino was a pleasant surprise.", "Date": "Oct 7, 2007", "ReviewID": "UR801683316", "Ratings": {"Service": "4", "Business service": "2", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "joseph6"}, {"Content": "Fanatastic Had a fabulous vacation with my wife and our seventeen year old twins boy/girl. The staff was very friendly smiling and helpful Travel Hint: TIP THEM! smile back at them and treat them with respect, they are wonderful people!. The food was great at the many included specialty resturants and the 4 buffets. The beach is fanatastic with plenty of water sports at hand and no one pestering us to purchase things or look at time shares. When our flight was delayed a day by hurricane Dean they and Conquest gave us 2 other rooms for the extra night with the all inclusive plan no charge. The resort is huge with plenty to do. It was the most relaxing vacation yet. I'll be going back!", "Date": "Aug 20, 2007", "ReviewID": "UR300000847", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "SQUAREDEAL"}, {"Content": "Good Price My husband  I and another couple stayed at the Casino Resort in Punta Cana the 1st week of May. It was not busy at all, and that is one of the reasons I think we received very good service. Everyone was very nice and helpful. Listed first are the pros:Very nice groundsBeautiful BeachesFood was goodThe 2 restaurants we went to were very goodTransportation between resorts was good.Cons:The rooms at the Casino Resort need major renovations. We had 2 double beds and one of them smelled of urine. Also the room was very musty smelling. My husband drank a few ounces of water by mistake and got diarrhea. Imodium didn't help at all. Luckily I had brought a prescription medication and he was fine after that. Our friend also got sick. He had diarrhea and threw up. We really don't know what caused his sickness. They had very little entertainment . I don't know if it was because it was a slow time of the year or its always like that. The show Tropicalipsimo was terrible. If you don't understand Spanish, you don't know what they are singing.I don't think I would go back, only because I do not like to put so much effort into watching what I eat and drink to avoid sickness.", "Date": "May 18, 2007", "ReviewID": "UR986368023", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "3", "Value": "4", "Rooms": "2", "Location": "5"}, "Author": "teriberi3"}, {"Content": "Lovely Resort.... We have been there during February 2007. The Resort is composed of 5 different complex and you can move inside totally in freedom. The food is very nice (especially the Steak House!) and the staff very friendly and gentle...Room very comfortable and clean.Fantastic Beach and swimming pool!!....I really reccomend it!!", "Date": "Mar 23, 2007", "ReviewID": "UR630233429", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "4"}, "Author": "FlowerJ"}, {"Content": "Ok But would not Recommend March 4-11, 2007 Niagara Falls/ CanadaThe resort itself is in a beautiful location and the grounds are kept up quite nice. The sand fells like silk and goes on forever. Rooms-They were kept clean and bar frige kept stocked. It does help to tip them and they are very polite. One day they clean in am and next in afternoon. So if you want an afternoon siesta the room is not always done. Buffet- Usual and gets tiresome. Steaakhouse was great. Pizza on the beach good. Pools- At the casino it was always quiet.This was nice after the busy beach.Bars- The bar service; Piano bar was great (at night).The pool bar was horrible. Tip or no tip. Anywhere from 4-6 people working and they couldn't care less. We heard from other people thatthey used to circle around and take orders but due to poor management that they don't. I don't care if someone brings me a drink but when you go to the bar even if you tipped you were botheringing them. This s not exclusive to just the casino but also all the rest. Went to the beach bar and asked for coke, water and beer. Got the first 2 but walked away for third. They would even tell you no more than 2. Often you heard people swearing at them in all languages. They would stand and talk to each other and not get drinks with afull bar. I have seen people be shunned because of their attitude but never to everyone in general.Activities- Not much of anything. Everything is done at the beach.We still had a good time but however would not return here or any of the other Barcelo in Punta Cana.I did read the reviews about service problems and thought people were being too fussy but found out this is not the case.I did go to management ona particular rude staff member and he said he had spoken to this person just 5 minutes prior and spoke to him again. Did nothing for his rude behavior.Peggy", "Date": "Mar 20, 2007", "ReviewID": "UR543105317", "Ratings": {"Service": "1", "Business service": "2", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "Wazy"}, {"Content": "Searching for Franc... The beach was beautiful and the fact that you stay at one hotel and play at 4 was great.The food wasn't the greatest but at least you had a lot of options between the four hotels and the a la carte restaurants.Hotel staff were very friendly and always tried to be helpful.I would go again.Franc....you made my birthday the most fun...where are you now?CarlaOntario, Canadacarladi@mountaincable.net", "Date": "Mar 17, 2007", "ReviewID": "UR936116931", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "4", "Location": "4"}, "Author": "carlaOntarioCanada"}, {"Content": "\"Loved it!\" HOLA, Theresa, John, Susie, Ken, Sharon, Tom, Tony and Anita. Our great friends that we met and hope to see one day in England.Thanks all for one of our best vacations ever. We did read the reviews before we left an did get some good advice. We did get a perscription from the doctor for stomach problems before we left. I did have a bad tummy a couple of times, but sure it would of been worse if we didn't take the perscription. Sayona Island is a for sure thing, great time. Also the Jurasic Safari was a great time. We did also book a snokling trip on the beach for $25.00 each, it was a 2hr trip on a catamoran out to the coral reef. Well worth the money. We asked for an upgrade when we got to the hotel and they gave us a one bedroom suite, king size bed, so if you think of it ask for an upgrade when you check in. Also the staff did there best to help in any way they could even if they could'nt understand us. Thank you Santa, our waitress who always had a smile for us. Hope to return one day.", "Date": "Dec 3, 2006", "ReviewID": "UR643509315", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "3", "Rooms": "5", "Location": "4"}, "Author": "daisy89"}, {"Content": "Overall, very nice trip. My fianc茅e and I went from Nov. 11th - 18th. We are 35 and 27 years of age so I would say our opinions are very fair.When we first got to the Resort, we found out that it is no longer owned by Breezes, but had been bought by Barcel贸 Premium Resorts in October! OK, not a problem thought as it looked beautiful from the outside. In fact, I was told by many staff members that Barcel贸 is actually investing a lot of money in upgrades and quality which Breezes let slide dramatically!Anyway, we found our room and resort grounds to be very well maintained and clean! Our room was cleaned and moped with the bed being made and fresh towels every morning and we saw many employees maintaining and cleaning the grounds very early in the mornings. Everything always looked very nice! Air conditioning could have been a little better but, it worked fine for us.The food was average although, there were times when the food was way above average! I found the restaurants to be OK with the Paris and Mexican restaurants being the best.Activates were somewhat limited for kids from what I saw but we spent most of our time either on the beach or at the pool enjoying some very good drinks. Staff are all VERY friendly and accomodating!!!!!!There were quite a few people who experienced some travel sickness from eating at the resort however, was it the food or tap water? Not really sure.All in all, I'd say we had a very nice vacation, met some very nice couples and made some very good friends out of our stay! I'd recommend it with all the changes that are being implemented.", "Date": "Nov 21, 2006", "ReviewID": "UR716061526", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "lancerecruit2002"}, {"Content": "Go Somewhere Else... i guess when its cheap, you get what you pay for, the airport is crazy, its like a circus they try to attack you and simply take your bags to a beat up van and take you to the resort. i was with5 girls and we were very uncomfortable. we stayed at te casino, the people were not very helpful, the beach was lenghty walk away and the food was terrible. pasta was the only edible thing on the menu, seriously. also, there was never hot water when we were getting ready. the only fun thing we did was go to the dance club or discotecka. but you need to make friends with a local so they can order drinks for you...because the bartenders do not pay any attention to you if you do not speak spanish.i talked to some people from the u.s. who said they go back every year...but we will never go back, been there done that!", "Date": "Oct 25, 2006", "ReviewID": "UR784649769", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "2"}, "Author": "thegreathoudini"}, {"Content": "Was a Bargain and will use again First Big Tip. Go by Budget car rental and get a map of Punta Cana and Bavaro Beach area (Playa Coco Mapa Turistico Bavaro/Punta). I had other maps but the one I got from Budget saved the day. Oh, suggest you rent a car. Driving is tuff. But you can get around and see/do much more.Note: The budget office where I got this great local map was the main office approx. 6-8 kil west of airport. Good luck.Only went to Punta Cana for 2 nights. Quick 'check-it-out' trip from Florida. Will definitely return to Barcelo Casino and Bavaro Beach area. If you decide to stay at the casino lodging, it is only a 5 minute walk to the beach. The tram takes much longer. When I return I will most likely spend 3 nights at Barcelo Casino (I am not a gambler) and then move west (on the beach) to a lodging near, or at, the Bavaro Princess. Interesting shopping area. Plus all the beach and good stuff too.Barcelo - The food was very good. Plenty of selection and good quality. Lobster, fresh fish, etc. Never had any beef as to many other items to try. Was able to secure room for approx. $73 a night (all-inclusive). A Bargain. Good luck, think you will enjoy. Unless you expect 5* 'stuff,'Finally, I have traveled extensively and have established a personal standard. Max of 3 nights anywhere (unless place is extraordinally great).", "Date": "Sep 30, 2006", "ReviewID": "UR911410228", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "3"}, "Author": "Isle 'n Sun"}, {"Content": "Serves Its Purpose... Stayed at Barcelo Bavaro Casino Resort last week for 4 days with 5 female friends. The staff was less than stellar; they were rude, slow, unprofessional, did not speak any English, and they still expected to get tipped (in US dollars only). The grounds were well kept. The food was mediocre-- no typical Dominican dishes.The casino was alright, and the swimming pool was nice. The rooms had the necessary items, but they weren't outstanding.I would personally choose a more prestigious establishment to stay in if ever I return to the D. R.", "Date": "May 23, 2006", "ReviewID": "UR739312083", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Loved it!! We just returned from Punta Cana's Barcelo Bavaro Resorts. My friend and I stayed from April 21-26. It was a well needed long weekend of RR. It was great! I must admit I was alittle scared after reading other reviews, but I do not have one complant. The people were friendly and the beach was beautiful. Service was slow pased, but I did not have anywhere to go. Our resort was a short walk to the beach. We spent all of our days at the Beach Resort. I really enjoyed that although we were staying at the Casino we had acess to all the other resorts and imenities. I would reccomend all of the restaurants except the Italian. We had no issues with long lines or service. One day we went on an excursion of swimming with sharks/sting rays and a booze cruise. It was fun. At nights we went to shows at the Beach Resort. The subject matter changed nightly, but was also fun and often interactive. Overall, I had a great time and would go back again.", "Date": "May 13, 2006", "ReviewID": "UR345028177", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Go to Barcelo if you want to starve! I never thought I was a picky person when it came to vacations until I stayed here. My fiance and I went here for 5 days to check it out for our wedding. Thank God I came here before I invited my friends and family.We booked our trip at the Barcelo Golf Resort. When we went to check in, they had bumped us to the Casino (which is the furthest hotel from the beach). We get to our room at the Casino hotel only to find out the AC was broken and mildew was growing everywhere. It was even in between the sheets of the bed! We couldn't even sit on the bed let only sleep. My fiance called the front desk to let them know of the problem and to request another room. The front desk said everything is full. This in itself is hilarious because I saw the same few people during the entire 5 days I was there. After waiting 20 minutes and not getting a call back, we packed up and went down to the front desk with all our bags. After making a huge scene, we finally got a nicer upgraded room. There are problems of small ants in any room though because there aren't any door jams to keep them out. FOOD-this food was so digusting I wouldn't even feed it to my dogs. There was food there that I couldn't even identify. My fiance and I were struggling every meal just to find something we could swallow without gagging. Not to mention every single restaurant in all 5 hotels was the same. A lot of times they would serve meals from the night before as breakfast. Everything was always cold and stale. Toward the end of our trip we took pictures of the food to show our families how nasty it was because they wouldn't have believed something could be so bad. Trust me, unless you don't have taste buds, you will not eat at this hotel.DRINKS-good luck getting one. It took at least 20 minutes to get a drink because they only ever had one bartender on. They also didn't have much of a selection at all. They have one kind of beer and pina colodas. You have to ask about 5 times to get alcohol in your pina coloda. They really couldn't make anything else. All I wanted was a cosmo and they didn't have cranberry juice anywhere.BEACH-the beach was nice. There isn't any snorkeling available off the beach. We decided to go on a snorkeling excursion for $55 a person. It was very disappointing. We went out and didn't see anything fascinating at all. Save your money.SERVICE-worst I have seen. I am not sure if it was bad because I am American or if they just hate everybody. They ignore you, take forever to make you a drink and we had to get our own water at dinner because nobody would pay attention to us. Everyone there claims they don't know anything. We asked the front desk about booking the snorkeling excursion and he said he didn't know anything about it. Now, don't you think someone at the front desk should know about these things?POOL-was nice and relaxing. Bring some cards or games because there isn't much to do. The Casino was very small and not too many people seemed like they were winning. The gift shop was a rip off. They wanted $3 for a bag of MMs, $10 for cards, and .50 cents per band aid. I hated this place and will never go back to Punta Cana or any Barcelo Resort again.", "Date": "May 1, 2006", "ReviewID": "UR350126487", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Gone Completely Down Hill !! My Husband, Daughter and myself just returned on April 27th from 1 week's stay at the Barcelo Bavaro Casino and are totally disappointed. We were at this resort 6 years ago and I cannot begin to tell you how much it has gone down. It needs a desperate make-over. The staff at the front desk and at the bars make you feel that you are bothering them when you ask for anything. We had a loft which was very nice but needed an update. The bathroom ceiling leaked but we did not want to bother them to fix it so we put a garbage can under the leak. The food has even gone down hill. The same thing day in and day out. We could not wait to get home to have a proper meal and we are not people to complain. The only really good thing for us was the beach. It is still beautiful. We were on the beach at 8:00 every morning and stayed there all day. The golf course is in terrible shape. My husband golfed three times and said that the greens are in poor condition. The flight with Zoom Airlines was wonderful. I can't say enough good things about this airline. The great staff and the great service. Hands off to you Zoom, great job !!!!!!I have been to other resorts every year for the past 6 years in Punta Cana and I can honestly say that I would never go back to this resort. It has definitely declined. All I can say is bring lots of snacks and be on the beach as much as possible.", "Date": "Apr 28, 2006", "ReviewID": "UR344766222", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "golf1962"}, {"Content": "Great for Price I just returned April 25 from Barcelo Bavaro Casino (not located on the beach). If you are on a budget stay here and enjoy the whole rest of the resort with a very SHORT walk or tram ride to all the other facilities.There is so much to do and see at each of the resorts. Each has a buffett or sit down restaurant included with the all-inclusive or for a small fee other restaurants. . We liked them all. We never did make it to all of them there were so many. Each resort also has pools with activities. They each have their own unique shows to see that are different every night. We tried to go to all of them but again not enough time for everything. We got along fine not speaking conversational spanish only knowing very little. The main workers know enough english ( and french and dutch for that matter) to help us get along well enough.We would definately go again and stay here (but probably at the beach resort) Other people we talked to from other resorts werent as happy as we were.", "Date": "Apr 26, 2006", "ReviewID": "UR682749034", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "3", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "srfrgrl97"}, {"Content": "Don't Go! My husband and I arrived at the Bavaro Golf Resort on March 15, 2006. We were immediateley told at the reservation desk that we were not booked for the Golf, but for the Beach. I was somewhat puzzled, because I had specifically booked the Golf. I tried to show the employee my print out and explain, however the conversation was headed nowhere because she couldn't understand me, and I couldn't understand her. We ended up dragging all of our luggage all the way to the Beach hotel in the sweltering heat. Alarm bells should have gone off in my head at this point, but I thought, hey, not a problem, this is vacation. I can be flexible. After finally getting to our room, we were immediately interrupted by a knock at the door. Maintenance needed to paint the inside and outside of our door. Once again, nobody verbally communicated, they just started painting. We had to sit with the door open for almost an hour. We couldn't even unpack or change clothes. All of these events took place the first 30 minutes of our trip. Some of the other problems we had were: Room were very dilapidated (there was a large crack at the bottom of our door that allowed all sorts of wildlife to sneak in, the gecko in my husbands shoe, kind of scary, lost water pressure, no hot water at some points, and worst of all the AC broke on the last night. Food wise, I think we both lost weight from lack of eating. The buffets had some mysterious meats and concoctions, meats and cheeses were not kept cold. The safest thing to eat was bread and alcohol. As far as service, I have to say that there had to be only a handful of people who were even remotely nice. Everyone else made you feel as if you were an inconvenience to them, and they hated being there. I won money at the casino, and I had to call an attendant to pay me, I actually walked away wondering if I had offended him somehow, because he treated me in a very rude manner. And don't even think about not leaving a tip for the maid on the first night. That sets the standard of your room service. We didn't have any smaller bills yet so we couldn't leave a tip on the first night. Big mistake. The next morning we did not receive any bath clothes, towels or toilet paper. Surprisingly, the nicest people there were the security guards. They always stopped to speak, and even volunteered to take photos for us. The grounds of the hotel were kept pristine and were very lush. The best thing about the resort was the breathtaking beaches. The sand was powdery, and the water was a beautiful turquoise. The beach was kept very clean. Overall, I would not recommend this resort to anyone who is looking for friendly service or anyone not willing to take risks with their meals. If the weather and the beach is all that matters to you, then this might be the perfect place for you.", "Date": "Apr 22, 2006", "ReviewID": "UR172062913", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "1", "Value": "3", "Rooms": "1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "I had an amazing time! This place is absolutely amazing!!I travelled with my boyfriend and a group of another 15 people. I truly had the time of my life and I can't wait to go back next year seeing I miss it already. We stayed at the casino and found the pool never had that many people as most were at other pools or on the beach.We spent most of our time on the beach getting our tan on(which turned out pretty dark!) we did wander up the beach and bartered in the shops and got some pretty good deals on our souveniers. The beach is absolutely imaculate!We would get their everyday at about 11:30-12:00 and would stay till about 3:00 and i felt like i could have been there longer.Make sure to bring some aloe vera cooling lotion in case you burn, it helps get rid of it pretty quick.Iburnt one day on my shoulders and chest and by the next morning it was a tan! We found the food to be awesome(none of us have stomach problems) Ithought the steakhouse was awesome(medium well usually gets you a pretty good one) and when you eat supper at the buffets go and make your own pasta! that was what we ate alot because it was so good!... we found ourselves pretty adicted to their pizza..I loved it because they load on their cheese and it tastes awesome!!The disco was pretty wicked too, best time to be there was about 12:00 and on, thats when most people were there.If you tip the bartenders anywhere they will remember you and they'll serve you as quick as possible.The fruity drinks are pretty good but don't drink too many each day or you might have problems,I mainly drank their beer(Presidente) which I really came to like.Each day we left the maid some stuff and we would always have a nice restocked clean room when we came back for a nap in the afternoon(which by the way really helps seeing you need some rest while your down there). It's so hard to describe this place in just a little bit of writing, and the more I write the more I want to go back right now! but thats my review I hope it helps you!", "Date": "Apr 19, 2006", "ReviewID": "UR829130318", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great Vacation, Great Price       Casino Hotel Lobby", "Date": "Apr 17, 2006", "ReviewID": "UR447593200", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "greentea822"}, {"Content": "relaxing stay at casino hotel stayed at the casino hotel with husband...2 daughters in room next door first floor...rooms were comfortable but slightly on the chilly side so we left our door to patio open at night...plenty of coffee and drinks in the fridge...we even made coffee in our room with the tap water and had no problems at all...tipped $2 per day each... maid service and drink guy...ate at the casino buffet which was great...also tipped our waitress...loved the fact that they would remember you when they saw you again...spoke spanglish and that got us by...tram service from hotel to hotel was right on time and a nice trip around the grounds...daughters went on the horseback ride and they loved it...we stayed at the casino pool because it was quiet and easy to get refills on drinks...tipped the waitress there and she kept our glasses full morning till night...beach and water was just beautiful and calm...no shells if you are into looking for those...shopped at the bazaar to the left of the palace hotel...final price is usually half of first quote...little bar infront of bazaar is a great place to sit and watch folks and listen to local dialect...all in all a great trip...but don't look for anyone to hold your hand through this...a smile and an hola get you pretty far...", "Date": "Apr 6, 2006", "ReviewID": "UR560161591", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "virginbred"}, {"Content": "Had a Great Time!       Grounds of Complex", "Date": "Apr 4, 2006", "ReviewID": "UR235987896", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Juliepjules"}, {"Content": "OAHLA! This was a very nice trip. Out side of the normal attraction ex. beaches and sun and fun. Don't get me wrong it was awesome. Great shopping! watch you pesos? It's a must. Great selection of food. It took me 2 days to geat use to. If you rent a car beware, trust me! You need to be a Nas Car driver. The country is very poor. A culture shook for myself. If you have money they say you can do just about anything. Nice country (NO DRUGS) shooking!! MOMA_WANJA---island drink! They like it at least. Hotel personal friendly nicer then the airline stewardests. Seriously! Have a island guide with you if you go outside the resort at night. Other then that have a great trip and see it for yourself!Great place to vacation!", "Date": "Mar 30, 2006", "ReviewID": "UR702231714", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Loved it!! My husband and I recently (March 4-9, 2006) stayed at the Barcelo Bavaro Casino Hotel, part of the Barcelo Bavaro resort complex in Punta Cana. We were looking for an inexpensive and relaxing vacation and this perfectly fit the bill! I will start off by saying that we had been to punta cana 3 years ago and stayed at Secrets Excellence. The Barcelo is not Secrets but then we also paid about $1000 more per person. The Barcelo was clean and very comfortable. There are plenty of pools, bars and restaurants to choose from. I didn't like how you had to wear a wrist band but understand that it was necessary to separate the people from the Palace resort who had paid more $$ and had access to even more restaurants and bars. I just didn't like the tan line that I received from wearing it. That is really my biggest complaint so that tells you how good this place is.  We were there during spring break, my husband is a teacher, but there didn't seem to be anyone that got out of hand. There were alot of people and the majority are from Europe or Canada. It was almost rare to run into another American. Most of the staff spoke English fairly well. They appreciate it if you try to speak a little Spanish-you are a visitor in their country after all, it's the least you can do.  The drinks and food were all very good. Lots of bottled water. We didn't get sick at all. I was kind of concerned about that since I am six months pregnant. We would leave a note and a buck or two in our room for the housekeeping staff for additional bottles of water. It was nice that I could get all of the same drinks that my husband had except without the alcohol. Our favorite is the Coco Loco-coconut water, coconut milk, ice and rum if you prefer.  Some people had written about the distance from hotel to hotel. Again, being 6 months pregnant, I was quite capable of walking the distance (5 min walk, max) from the casino (which is the farthest away from the beach) to the other resorts. It actually was faster to walk than to take the trolly.  Overall it was a very nice and relaxing vacation and I would do it all over again!", "Date": "Mar 21, 2006", "ReviewID": "UR344053660", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Overall, Good Vacation! After relying so much on others' reviews, I thought I would put in my opinion. A friend and I went to Barcelo Bavaro Beach Resort -- Casino Hotel from March 13-17. Being my first trip to the Caribbean, I was surprised at how wonderful the beach is! The sand was so soft and the ocean was clear and gorgeous shades of blue! HOTEL: If you go to this hotel expecting a 5-star resort, you will be disappointed. However, we had no complaints. There was plenty of hot water and everything was clean. It was not luxurious, but it was quite nice. The Casino hotel is not located on the beach, but the walk is not far (maybe 5 minutes). Some other posters complained about this, but we did not mind the short walk (there's also a trolley). The Casino also had some perks -- the horse-back riding and golfing are very close by, the main night show is at this resort, and it's not as crowded as the other hotels. FOOD: The food is pretty good, especially the steakhouse and Italian restaurant. Do get to the steakhouse early, otherwise you will wait 1 - 1.5 hours. Usually the line for the Italian restaurant was not too long. The buffets are pretty good too -- try the grill and the pasta bars (very good!). As for desserts, definitely try the coconut ice cream (we found it at the Italian restaurant). ACTIVITIES: We enjoyed the pedal-boating and shows at night (they are a bit cheesy but fun nonetheless). We went horseback riding on the beach, which was great. You can go for 1 or 2 hours -- we went for 2 (which cost $30 each). I'm not sure if you can make it all the way to the beach and back in 1 hour, so I would recommend going for 2 hours. Just be warned that if you haven't ridden in a while, you will be sore! ;) I also enjoyed a massage on the beach (it cost $25 for half an hour, $45 for one hour) -- very nice (particularly after horseback riding!)! RANDOM TIPS:-- Make friends with the staff (particularly the front desk) -- they were very friendly and willing to help. If you're at the front desk between 4pm and 8am, please say hello for us (from Patricia and Rochelle)!-- Bring some bug spray and calamine lotion. My friend got many bug bites the first night we were there 鈥?I escaped the bugs until the last night.-- Don't leave food out in the room -- we had some pizza left over (for a midnight snack) that attracted many tiny ants. Other than that, we had no bug issues in the hotel.-- We found the room to be very dimly lit when the sun was not out鈥?I鈥檓 not suggesting to bring a lamp, but if you have any other ideas鈥?br/>-- We did tip some, but not as much as others suggested. We found that being friendly worked just as well (maybe it was because we were 2 girls?).-- Taxis are readily available both at the airport and at the hotel. A taxi from the airport to the hotel is only $20 for up to 5 people.-- We found the drinks to be very strong, not weak as others mentioned! Rum and Coke is the drink of choice for most -- we're not big rum drinkers, so we also liked vodka and Sprite drinks and vodka and orange juice drinks. The Tom Collins drink is not like the American version -- it's extremely sweet (and I like sweet drinks).-- Knowing some Spanish helps, but most of the staff knows at least some English (my friend knew some Spanish -- I knew very little, but had a dictionary just in case).-- Bring some dressier clothes 鈥?folks seemed to dress up for dinner and the shows.-- Do go to the Discoteca 鈥淟as Canas鈥?(at the golf resort 鈥?the other one is mostly college-aged) -- even if you can't dance, they will teach you. Be sure to learn the bachata (the dance of the Dominican Republic) 鈥?it is a lot of fun!-- If they ask you if you're single or married, make sure you ask them as well!Note: If you鈥檙e looking for a trip that has a lot of local culture, this is not it. Unless you venture outside the resort, you won鈥檛 experience much of the Dominican culture.ENJOY YOUR VACATION!!", "Date": "Mar 21, 2006", "ReviewID": "UR969375783", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Had my doubts, but great resort We stayed at the Barcelo Bavaro Casino Resort Mar 5-12. We were pleasantly surprised by our room, as we were just suppose to get a double room and we got a loft style room with a living area, 2 full bath, 2 tv, and a great big king size bed upstairs. The room was great, very clean, the air conditioner was way to cold to have on, they kept the mini-bar stocked very well daily, although we gave the boy $5US when we arrived, the only negative comment is that it is very noisy when everyone coming home at 5am from disco. The food was OK, alot of different buffets to eat at, but all pretty much the same. The casino buffet made the best ommlettes,and the Beach buffet had calamari some nights and a great pasta bar. The Steakhouse was by far the best a la carte restaurant but quite a wait to get in, but were on holidays, we got nothing but time. Resort very clean, they never stoppped cleaning, raking, painting. The pools were very clean, some busier than others, the Casino and Golf pools were quiet. You did have to put your towels on pool chairs first thing in am. otherwise you didn't one until after 4PM. The beach was great, always lots of loungers, if you go down past the Caribe its not as busy and nicer loungers. Plus there is a a la carte restaurant right on the beach, its part of the Golf Resort, you have to reserve, but they have the best calamari and shrimp.Overall no real complaints, we were very careful what we ate in order to avoid any sickness, so we did get a little tired of the food. Drinks were good, although you have to ask for alcohol in it most times. Drinks are small, like at most of these resorts, so take an insulated cup with you, a 16oz. is good. I think I would return but would prefer to stay at the Golf Resort, its a little closer to the beach but not as noisy and busy as the Beach, Caribe, or Palace. My husband loved the casino, played a little poker each night. Enjoy!!", "Date": "Mar 16, 2006", "ReviewID": "UR915600716", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "KristaOntario_Canada"}, {"Content": "Go some where else First, the beach is perfect. Not sugar sand. Floury sand. It is great. Now for all the bad, and there is a lot.I was supposed to be in the Golf Resort but got bumped to the Casino. I was not happy because it was another 100 yard walk to the beach. Doesn't sound bad, but it bothers you after three days walking back and forth with all your beach stuff.Since Cancun Mexico was destroyed by last years hurricanes, Punta Cana has been over run by kids. We arrived on friday, which seems to be the slowest day of the week. The place was empty. On Saturday, three hundred kids arrived. Drinking beer, spitting beer on each other, acting rude, and generally obnoxious. I guess that's what you get at an all inclusive. Probably also why I was bumped to the Casino.I heard they over booked the Barcelo Beach with too many kids so they upgraded other guests, and some kids, to the Palace. I probably got bumped from my Golf room by a kid.My wife felt fine, but I got sick after three days from either the lettuce being washed in local water, a bad appetizer, or the ice in the drinks. Not running to the bathroom every second kind of sick, but enough of an annoyance.The food is OK but you do get tired of buffets after 4 days. By day 7 we were looking for McDonalds. Lots of the food on the buffet is cold or only partially warm. The Steakhouse is the best, but be on line by 6pm otherwise you'll wait 1-1/2 hours for dinner, standing on line, waiting for the first sitters to finish their meals. I'm not kidding.All the restaurants have long lines for dinner. They only open at 6:30 and usually have a line by 6pm. They don't have enough restaurants at any of the Casino, Golf, Beach, etc. resorts.The pizza/snack bars are OK but they don't use enough Tomato sauce. Ask for mucho tomato when ordering. Also, they are samll pies. A lot smaller than the box they come it. It's really a personal pie, maybe like two slices of normal american pizza.I thought the Steakhouse and the Mexican place were the best. The Mexican place had the nicest and best waiters.Bring a sweater, the place gets cold at night near the water because of the wind. It's real windy 3 out of 7 days a week. Good for windsurfing.Speaking of non-motorized watersports. I was told the all inclusive included windsurfing, cayaks, etc.. Well it only includes the real basic stuff. The Hobie Cat catamarans are an extra $25 an hour, the old crappy begginer windsurfers are free, but the better equipment is extra. I've been windsurfing for 6 years and it was an insult.If you're looking for great service, go elsewhere. Only a few waiters or bartenders are nice. I think mostly everone else hates their jobs or something. If you want a drink with alcohol in it, make sure you ask for mucho rum porpavore. Yes, it helps to speak spanish, but I got by without it, with only a few basic phrases. When ordering your drinks it helps to have $2 in your hand and VERY visible when you order. You'll get served faster, and the request for alcohol will get you a good drink. Otherwise you'll get a virgin drink with sugar in it. Yes, they add sugar to all their drinks. Yuck. You'll read that in other reviews. All the drinks and alcohol are very sweet. And they only serve local beer. El Presidente. It was pretty good though.There was a foul odor in our room half the time. I though it was the smell of the golf water ponds but then later I thought it might be sewage gas seeping up through the pipes and back into the hotel rooms. I'm still not sure, but it smelled aweful.Worst of all, to the left of the Disco building is a metal roofed building with bambo and chain link walls. This building appears to be the local hang out for all the employees and staff. They start playing loud Dominican music around 7pm. It doesn't stop until 5am. It's really really really loud and I could plainly hear it from my room ALL THE WAY BY THE CASINO. And my room faced the golf course. One night they pushed the volume way way up at 4:30 am. We couldn't sleep unless we kept the Air conditioning on. But then we froze, so we kept the windows open to get some warm are in the room. There were no warm blankets, hey it's the caribean. The a/c had two settings, cold, and really freakin cold. You couldn't only run the fan for background white noise.I didn't have any problems with mosquitoes or sand flies like some others have written. I did bring Deet bug spray just in case.Tip if you can. They are real poor down there and it gets to a nicer smile and better service. And really people, they waiter on you and give you service, so give them $1 per drink, and a few bucks for dinner and lunch. I saw some people they constantly asked, and asked, and asked for things, but never gave a tip. Horrible. Get up early for breakfast and reserve a pool or beach chair with your towel otherwise you won't get a good spot. Yes, it stinks, but everyone does it, it seems to be an unspoken rule. Really, you get what you pay for. I tried to save money by not going to Punta Cana's Secrets Resorts, but now I'd spend the extra money in a heartbeat and go either there, Allegro, Sandals, or Couples. I think overall it was OK for the money but it could use more restaurants, better managing. Don't expect much english because there are only 15% of us down there. The rest of the people are european. But everyone in europe under 30 speaks english. Oddly, everything is in US dollars. I got a real kick out of that. Like our money, hate our language. Go figure.", "Date": "Mar 13, 2006", "ReviewID": "UR994195327", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "CARMELHILL"}, {"Content": "Best Vacation Ever !!!!!!! We stayed at the The Barcelo Bavaro Resort from Feb 9-16 and it enjoyed every minute, we really have a hard time believing all the negative comments because we found the resort incredible!! The staff were more than helpful, the first room we got was not in the best shape, but all we did was talk to our Signature Vacation rep and we were given a new room a few hours later. When we got into our second room the safe wasn't working so before we could even unpack they got us into a room on the third floor overlooking the 9th hole on the golf course, the staff were awesome we couldn't have been more pleased with them. We did give tips to them and even though we didn't want our first room we weren't rude.We left a tip in the fridge every day and the beer fairy never let us down!The pool at the Casino was great it was nice and quiet there so after spending most of the day by the beach it was nice to come back and relax there. The bar at the Casino pool is great Juan serves the drinks with mucho rum!! The grounds on the whole resort are beautiful the staff work very hard at keeping it look nice! The beach is incredible words can not describe it!!! We pretty much tried all the restaurants and were not dissappointed at any of them, the Steak House was the best just be prepared to stand in line(its worth it)!The Italian restaurant is also very good, Pablo Gasolino was our waiter and sooo much fun!!!We did the Soana Island day trip and this is a MUST, the bus ride takes you through the country side and you get to see how the people of the Dominican Republic live! After a speed boat ride you arrive at the Island it is really heaven on earth!!! We were served lunch(which was really good)the only down fault about this trip was the stay on the island wasn't long enough. The catamaran ride back was so much fun, more dancing and alot more RUM.There is so much to do at this resort you can busy doing something all the time or doing nothing but lay by the pools or on the beach. We can't wait to go back, we really wish that there was a 10 day trip because 7 days just really isn't long enough!", "Date": "Mar 6, 2006", "ReviewID": "UR553427251", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Not a problem with the hotel.. but Sunwing have issues.       The friendly towel guy", "Date": "Mar 6, 2006", "ReviewID": "UR244195672", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "Ottawa_guy4444"}, {"Content": "Nightmare to Casino Hotel in Domenican Republic!! Our travel period was from Feb 14 to Feb 28th 2006. We have never experience a holiday this bad. The hotel is in serious need of renovation and this is including its toilets, that need to be flushed 3 times before it works. From the staff being rude, arrogant, and unfriendly to finding cockroaches and a mouse on the fruit buffet.The water was cold, dirty and full of algae. Not to mention that the security safes for our 3 rooms were not working, to running after the maids for towels and rooms to be done after we would come back from the beach at 5:30. The maids were also going thru our personal stuff, like creams and tampons, so we had to lock them up in our suitcase. In addition to all this, the arrival of spring break (from Spain) on Sat Feb 18, and that's where hell broke loose. Complaints to the front desk were ignored (we were around the corner from front desk) and they clearly heard it as well as we did. We were 3 seperate rooms and spent over 13.000.00 on this trip, to be mistreated.Never again to the Domenican Republic", "Date": "Mar 3, 2006", "ReviewID": "UR563619319", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "stleonardtraveler"}, {"Content": "The View We stayed at the Casino Resort and had a beautiful view of the Golf Course, the first tee was about a 100 yards from our balcony. It was nice to sit out and drink our morning coffee, watching golfers tee-off.Having coffee makers in each room was a bonus too.We had our meals in as many different restaurantsas we could. Our favorites were the Italian-I am an Italian at heart and the food was authentic. The Steak House was excellent as well. Some of our family of five thought the buffets were a bit bland, but hey I didn't have to cook or do dishes for a whole week so I thought it was great. I could have ate their breads and their many variety of cheeses and been quite happy. The lobby to the Casino Resort was so beautiful.The flamingoes in the water gardens were fun to watch.The pool was quieter than most, we enjoyed that. -never had a problem getting lounge chairs. I think most vacationers wanted to be closer to the beach area.The beach sand is white and powdery. I said it felt like cream of tartar. And it was never hot sand like we have here. The grounds are immaculate. Take American money for purchases. Nothing larger than a $10.00 they seldom have enough to make change.The outdoor market vendors down the beach from the Palace resort have the best deals if you like to barter. They love Canadians!. We did the outback tour, well worth the money. The tourguide was fairly new but very informative - The beer and rum flowed a little too freely, some had quite a bit too much to drink, and lost expensive articles while boogie boarding at the beach. Remember their rum is pretty potent. All in all we were a family of five, no one got sick. We used bottled water to brush our teeth. We had tropical drinks with ice cubes in them. Don't eat anything unusual if you don't know what it is and you'll be fine. Have a couple of Coca Locas, sit in your lounge chair and enjoy your stay. It will be great!", "Date": "Jan 26, 2006", "ReviewID": "UR637119631", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "CindyAylmer_Ontario"}, {"Content": "My honest opinion My boyfriend and I visited this resort from Dec 31/05 to Jan 7/06. I must say when we first entered our hotel room there was a half opened bottle of beer on the table, along with a plane ticket stub and used tissues. We had a bit of trouble with our deadbolt so I believe there were people assigned to our room, but must have complained and switched to another and nobody went back to the room to re-clean it. Normally I would have complained but once we figured out the lock situation we were satisfied and ran to find the New Years Festivites (it was around 11:40pm on New Years Eve when we finally arrived). Other then that little incident, our room was kept relatively clean, with fresh towels and a fully replenised bar fridge.My boyfriend and I also got sick from the food, and we too did not eat that much of it. I am not sure why we were sick, we were very picky with what we ate. All I can say is make sure you pack enough immodium! The grounds and beach are GORGEOUS and the weather was perfect. Don't waste your time in the Buffets, make use of the a la cartes (you don't need reservations, you simply show up and wait your turn). I must admit however, that we did manage to make it up for the breakfeast buffet on our last day and that was the best damn omlette I ever had! (Breakfeast is finished by 10am).The pizza snack shop isn't bad either, but the cheese is different from ours. I wasn't a huge fan of the night life. The disco wasn't a very happening place, it seemed dead when we were there. The Casino is fun but you can only gamble so much. I've been to several resorts before and most have an 'animation team' (workers who have daily activities to make your day fun) however I did not see that much activity. I found the Barcelo Beach and Caribe part of the resorts did have some animation but it was very limited. The mini-golf was great! If you plan to golf, I would purchase it when you book your trip because if it is not included it is very expensive $300 US for 2ppl for 9 holes.All in all, I had a great time! The food could have been better, but I didn't go for the food. I went for the Sun and Beach. I do think there are better resorts to stay at. If you are a picky person, you will not enjoy this resort. If you are easy and laid back, you can make it fun. One tip: pack lots of crackers, chips, candy etc as much as will fit in your luggage. You'll thank yourself later. If you have already booked your trip here, enjoy! you will have a fun time despite the reviews, I really was expecting much worse. If you haven't booked yet, I would keep searching. Punta Cana is a beautiful spot.", "Date": "Jan 24, 2006", "ReviewID": "UR775527783", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Barcelo Bavaro Casino       Flamingos in the Lobby", "Date": "Jan 23, 2006", "ReviewID": "UR897994512", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Shanley"}, {"Content": "amazing beach - hotel needs makeover We visited the Barcelo Bavaro complex over Xmas/New Years 2005-2006.Positive:-superb beach, probably the best in Punta Cana. Perfect powdery white sand for kilometres.-beautiful hotel grounds, which are immaculately maintained-interesting and fun mix of people, mostly Europeans (loads of Italians) and South Americans-excellent, hard-working and talented staff-tons of activities, from billiards to windsurfingNegative:-rooms in serious need of renovation. Bathrooms arein no way 4* - they are quite disgusting-food needs major overhaul. The most dismal hotel food I have experienced. This is a management issue which should be resolved. We met people who had visited the resort before and said that the food used to be much better. Coffee also undrinkable - which is inexcusable in a country that produces excellent coffee!We would definitely return to Punta Cana, but not to this resort because of the food.", "Date": "Jan 15, 2006", "ReviewID": "UR315101666", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "1", "Location": "-1"}, "Author": "spbVancouverCanada"}, {"Content": "All at the same time : teh WORST and the BEST On the first 5 minutes, we were not impressed.At the hotel reception, the personnal was speaking english at 20% (Yes, No, Toaster, that's about it).The first room we got was occupied. They opened the door without knocking. Hopefully, the people wasn't there.In the second room, the A/C was dripping on the floor and the safe was damaged (hole on the keypad). We asked for a good shaped room (the guy was so ---). Finally the third room was OK.90% of the employees at the Barcelo Bavro Casino seem bored and/or -----. They were so nonchalant, we didn't believe our eyes.Service at the pool bar is horrible. I can't say we had service, the waitress were looking at us but never came!!! Food : We both got sick and it's not because we pigged out, believe me. We make sure to don't pig out in fresh fruits and in drinks. We drank bottled water.Buffets food is Horrible. The restaurants are good, but if you expect to be surprised by very good food, go somewhere else. I must admit we had some good expectations, especially due to the internet site. BARCELO is a Spain based company. It's difficult to get served in french or english. This is a Spanish club.Rooms were correct and clean. We left tip everyday on the bed and we got good service. The Beach is amazing. The sand is almost like flour. However, if you expect animation, dream on. Also, there is so much boat circulation in front of the beach that you always breath gas fumes. 80% of vehicules are diesel. You can't walk from the Casino to the beach without breathing several diesel drafs. If you take the little train, it's worst because you get the whole draft of the leading car (disgusting).Don't forget your suntan lotion. 31US$ for a 220ml Hawaian Tropic tube. The stores will rape you with sky high prices.This is a all included... but don't forget anything, especially Immodium and Gastrolite, your best friends.I'll surely go back at Punta Cana, but this was our last trip in a Barcelo Hotel.Take care of the activities proposed by your travel agent. Signature recommended us a 2 places James Bond boats with Snorkling. 62US$/person. 50% of the boats didn't have cab on the engine (looks like the boats were used for the 2nd world war). The staff if funny but not professionnal at all.I can say a lot of things on our 7 days. Honestly, I enjoyed it because of the weather we got and the quality of the beach and water. We also enjoyed the pools, but this had not the 3400 CAN$ we payed for 7days.I was forgetting : All pricing are in US$ but automatic tellers only give Dominican Pesos. Make sure you know the value of the money (+/- 34 pesos/1US$). At the casino, they proposed to convert 2000 pesos for 26US$ (instead of 59US$). Bring enough money.", "Date": "Jan 9, 2006", "ReviewID": "UR370019373", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "1", "Value": "2", "Rooms": "4", "Location": "-1"}, "Author": "YourMother007"}, {"Content": "Read this: we had a great time! We just stayed at the Bavaro Barcelo Casino Resort Hotel for four nights. We are a couple aged 28  40. We found the resort mostly full of couples, not too many children at all.First off all we got a great deal via the net, we flew from Detroit to Punta for $300 each return and stayed at the Casino by booking online for $150 each for four nights. I am Canadian, but we flew from the States and all that I quoted was in American Dollars. The entire resort is stunning!! There are THOUSANDS of lit up palm trees surrounding each hotel on the resort. Each pool is stunning and beautifully lit at night. The wild life is gorgeous to see/hear roaming around. I didn鈥檛 notice the mosquitoes much at all. There are pink flamingos which live in the lobby of the Casino hotel which were so beautiful. Each foyer of each hotel is beautiful. Sure, the rooms aren鈥檛 five stars, more like a Days Inn, but if you expect anything higher for these prices then you鈥檙e obviously in dreamworld. The exteriors/lobbies of hotel would surely be four stars, but let鈥檚 face it, how much time do you spend IN the hotel? Shouldn鈥檛 be any, really! There are pool tables everywhere, table tennis, beach aerobics, kayaking, parasailing (we never had a problem with busyness as far as availability for anything, the resort was SO quiet this time of year), non-stop things to do. Unless you wanna do what we did which was lie on the beach all day!!???The shark tank and dolphin鈥檚 tanks seem tremendously small and therefore cruel to them, so we didn鈥檛 support that. Even the new Dolphin Island isn鈥檛 adequately taking care of the dolphins. If you were going to stay for a week or more, you MIGHT want to start eating at one of the six restaurants at the Palace that weren鈥檛 already included in your package, for some variety. But for our five days we found plenty to eat and variety. I鈥檓 sorry, but if you get ill by eating SEAFOOD, you should probably know better than to eat Seafood anywhere where you haven鈥檛 caught it freshly yourself!! We never got sick, we drank the crushed ice cocktails, ice in our drinks, all meat, except fish and of course took caution if we were eating when the buffet had been sitting for several hours already, and we had NO problem!! Just a note on the food in general: there is a bigger selection than you can imagine. We were there four nights and still didn鈥檛 get to all restaurants. The buffets are all quite similar, but not forgetting they鈥檙e all huge and hot/cold buffets catering to all nations at one time. You can鈥檛 go hungry at this resort. People who say they had to live on pizza (which is AWESOME) must have been had their eyes shut while looking at the buffets. These workers are trying so hard to please everyone, they work very hard. Here are my specific comments on the restaurants we tried:Bavaro Steak HouseBig salad bar  soup. Selection of beef, chicken and sausages with French fries or baked potatoes as main. Very nice food and right on the beach. Mexico LindoNot the best food at all. If you鈥檙e going to skip one, skip this one. Bland and disappointingComida ItalianaVery nice food and wine. Great basic selection, TRY THE TIRIMISU!!Ambar Buffet at BeachHuge buffet. Tons of cold salad selections, lunchmeat, warm boiled veggies, soups, breads, your own grill with steaks, pasta and seafood (for those dumb enough to consume seafood), hot dog stand (for those who 鈥渃ant find anything to eat鈥?, hot selections authentic to D.R, chicken, fish, beef, pork, more veggies. Something for everyone. Huge desert selectionMirador Buffet at CasinoWe ate breakfast here. Huge variety. All breads, fresh fruit, yoghurt, freshly made juices, make your own omlettes, French toast, pancakes, scrambled egg, bacon, hard boiled eggs, fried banana, authentic island food, cheese and lunch meats. I saw one fruit fly in the food the whole time I was there. But the buffets are virtually outside, so who cares? You鈥檙e eating in the most beautiful environment. I don鈥檛 know about you, but when my mom had a bbq as a child, I saw the occasional fly in HER food too. The staff was CONSTANTLY cleaning the entire buffet/meal areas as well as raking the beach, sweeping beach sand. It was impeccably clean and looked-after. Remember where you鈥檙e going, use caution when wanting to eat fish which has been sitting at the buffet for four hours and eat the occasional pizza when you're hungry, and you鈥檒l be fine. We NEVER so much as even got diarrhea, NOTHING. We were fine and I HAVE a weak stomachHaving said all this, bottled water is available every two feet and the service was often quite excellent. We had some waitors who gave us better service than I鈥檇 had in America. These people are working 15 hour shifts and they are working hard to please you. Tips go a long way if you tip immediately and they will come back with even more better service. Again, this is just common sense. Why tip a waiter or maid at the end of your meal or stay, when you can tip then WELL at the start, and of course they鈥檒l look-after you better then! TAXIWe got a taxi at the airport for $20 to the hotel鈥檚 front door. We got swamped at the airport by scammers, but you have to be smart and ignore them and go straight to the taxis for the best price, which would be $20. We go the same price going back too. LANGUAGE/SERVICEAs soon as we got in our room, we tipped the bellboy and explained to him we needed more drinks and towels. Between broken Spanish and some pointing, he worked it out and we were immediately satisfied. If you can鈥檛 learn Spanish even enough to ask for your drinks or to ask if they speak English, AND you plan on complaining if they cant understand you, then DON鈥橳 GO!! This is their country, you should expect to speak their language a little bit. I speak no Spanish, but with the help of this book:, I was fine. They are patient and if you simply say 鈥渦n memento鈥?they will wait for you to figure out what you are trying to say. They do NOT walk away from you at all. They smile and giggle when you attempt, they appreciate that. I saw so many ignorant Canadians I鈥檓 disappointed to say, asking for their drinks in plain English, not even saying thank you in Spanish, and of course they didn鈥檛 get many smiles in return. But the staff is NOT rude, they are simply don鈥檛 understand English for the most part and are working their butts off ALL day for practically no money in return. Again, if you tip, you get better service. BTW, staff at front desks etc can speak English fine.When we first got to resort, we hopped on the tram which takes you around to each hotel so you get your bearings straight away. That was helpful. If you stay at the casino, it鈥檚 a measly five minute walk to the beach, no big deal! All hotels are really really close to each other. If you walk down the beach past the Palace Hotel, you will cross over out of the resort, and find the markets will you find cheaper deals on massages, trinkets etc which are more expensive at the resorts of course.This time of year was excellent, NOT busy. We have no complaints at all! For what we paid, it was the cheapest, most enjoyable vacation. Its not the Ritz. But we knew that, as we booked a room at the Casino Resort in Dominican Republic, not the Ritz in New York. The weather was unbelievably gorgeous, the beach is stunning. I have lived in Australia and around the world for years, and this IS one of the best beaches I have ever seen. There is NO seaweed on the beach for those ignorant enough to think so, the palm trees simply shed and they rake that each morning. Its an excellent vacation, in a very inexpensive way, just keep in mind where you are, how much you鈥檙e paying, and what you鈥檙e there for. If you want to speak English, have five star ROOMS and eat ONLY American food, go to Hawaii!!", "Date": "Dec 21, 2005", "ReviewID": "UR565297220", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Beautiful Place...Awful Resort If you want a beautiful beach and a clean room you've picked the right place. That's about all it has to offer. The staff isn't friendly. The buffet restaurant had crows, flies and cats in the food. If you survive on pizza (and it's good and it doesn't make you sick) you'll probably be fine. If you decide to be brave and eat poorly refrigerated meat, you'll be spending a lot of your vacation time in the washroom. The piano bar at the casino makes great drinks and provides a fun atmoshphere (thanks to the tourists and the pianist, not the staff). Strong advice if you go...you can't avoid eating for seven days so you'll have to eat the food sometime. Bring a lot of Imodium. Also there is a pharmacy that I found out about on one of my last days there which carries something stronger and more effective. Because I couldn't get out of the washroom for much of my trip, I didn't get this advice until too late. I wouldn't recommend this resort despite it's beautiful surroundings simply because I didn't talk to many tourists who didn't spend at least a couple of days sick. Unfortunately, if you go with a partner like I did, you may not both get sick at the same time and the entire vacation is ruined. I was sick the second, third and fourth day after eating salmon from the made to order pasta bar (it tasted okay at the time). He was sick on the fourth fifth and sixth day. This was the case with many, many tourists.", "Date": "Nov 27, 2005", "ReviewID": "UR452441784", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "3", "Location": "-1"}, "Author": "Frank560"}, {"Content": "Amazing value and experience I booked my trip online with sunwing, which cost me $860 CDN all inclusive for a week. I was concerned after reading all the negative reviews but after arriving at this beautiful resort, having my first meal and unpacking into a clean well maintained room with electronic safe I knew I had little to worry about. No hot water or electricity problems, I found the staff to be courteous and attentive, the meals were great and more variety than I expected. Casino was more than the small room described by other reviewers, the same ones that somehow missed the front desk (it's the big one you see when you first enter either hotel, you know, the one with staff behind it) The beach was amazing and the two tours I ended up taking that came strongly recommended by my tour guide (who did an amazing job) which were 4 wheeling and Marinarium whihch is snorkling along the coral reef and swimming with sharks were incredible and well worth the ~ $80 US each. I believe that a lot of peoples frustrations came from travelling with the masses in peak season and I'm sure with their non stop complaints the staff were likely frustrated as well, but as for off season the value is unbeatable!", "Date": "Oct 24, 2005", "ReviewID": "UR851206524", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "nice vacation for the money, but...               More photos", "Date": "Oct 5, 2005", "ReviewID": "UR531308579", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "markgasmo"}, {"Content": "I will never recommend it  -3 days without hot water-3 days whithout ANY chance to change beach towels (ran out)-glasses always HOT-lack of waiters. No way to get a drink unless you help yourself-service was 4*-fridge in room made drinks just fresh-Air Conditioned worked randomly-2 times staff entered my room without knoking-room towels were just 3 (1 small, 1 medium, 1 large)-Sheets were not changed in 12 nights stay-Sand remained in room as clean up was made in 5-8 minutes-Although my 12 year old daughter paid as an adult, she was not allowed to dine at french restaurant after 8pm-Mexican restaurants has rats. Food is disgusting (pork chops from lunch). -Italian restaurant offers as risotto the rice from breakfast-Japanese restaurant is a joke. More like cheap low budget chinese european rests-Both Italian and Mexican are not real restaurants. They are the beach buffet redecorated daily. No toilets. Have to go to the beach toilets.-buffet is a training place for walking competitions. We were 5 and tables of that size (remember, 5 people means children involved) were at the end of the room, so, I had to walk 2 km daily when having breakfast-No money change at reception. Have to go to a Banco Popular office and queue until we were told they ran out of pesos.-Internet: 4 PCs. Just working 2. Slow. Queue again. Mouse was dirty. I personally cleaned it. But still was dirty, so, I had to spend 3 times the time to do anything compared with any normal PC. 3鈧?for 15 minutes.-The buffet has only 1 toilet, so, it was used and used by many people. Its smell was --- at all times. Something not very nece when you are trying to eat.I stop here but could continue...", "Date": "Jul 27, 2005", "ReviewID": "UR471489027", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "1", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Ok hotel, but very good vacation Location: the Barcelo resort is composed of 4 hotels (Beach, Caribe, Casino, Golf). There is a 5th hotel (Palace) that is off limits. The buildings are small 3 story buildings placed in different locations in the village. You will have to work on your navigation skills on the first few days to get around. There is a bus (in the shape of a train) that goes from one hotel to the next. The gardens are well kept and manicured.Entertainment: there are 2 dance clubs in the village. One (non-Latin) opens at 11pm and the other at midnight (Latin music). The non-Latin club is just a hole in the ground. There is nothing special about this place. The Latin club, I never got to go because it would open too late to bother with. The shows at the different lobbies were ok, nothing great. Tropicalisimo at the Casino hotel was amazing. Make sure you go to it. They say that no cameras are allowed but I saw some people taking pictures at the show and no one said anything then. The rest of the entertainment is pathetic but that is the case for almost every other hotel in the Caribbean. Dance lessons are a joke. I simply don't understand why they don't offer real dance lessons (even at a cost). It is not like the entertainment staff does not have the skills. They are experts in Latin dancing.Beach: Bavaro has natural wave breakers (rocks) so you don't get waves coming to shore. I personally don't like this. You can literally go 50 to 100 meters in and the water is only about a meter deep. Varadero, Cuba has better beaches.Other activities: Great scuba location about 10 minutes from the hotel. Great water visibility, and corals but not a lot of fish. Horse back riding is offered. There is nothing special about it. No training is given on how to ride the horses. The horses tend to speed up without warning and tend to fight among themselves while you鈥檙e riding them. Leave this activity until the end that way you won鈥檛 have bruises and a sore behind for the rest of your vacation.Service: I found the service a little nonchalant. I鈥檝e been in other places like Mexico and Cuba where a lot of emphasis is placed on tipping. Here, it appears that no tipping is expected so you don鈥檛 get good service. I found the staff in general new very little about what is going on in the hotels. It鈥檚 a very large compound, so it is not possible to get to know anyone working there. It is not a friendly place.Food/Drinks: Every hotel in the village has a buffet restaurant. There is a good selection of foods, drinks, and fresh fruits. Bottle water is readily available. There are other restaurants where you can eat during the day. The Grill restaurant is the best, followed by the Italian restaurant. I was not very impressed with the Mexican restaurant. A restaurant called 鈥榣as uvas鈥?is advertised as a seafood restaurant but it has horrible food. Don鈥檛 go there. Just go to the buffet restaurants and get some fresh 鈥楳ero鈥?(a fish) if you want seafood.Rooms: I was not happy with my room. The floor in the washroom and entrance was wet all the time. Other then that, it was a nice room. The wetness and humidity made it prone to fungus growing on the chairs (we never used them) and on anything that was left unattended for a couple of days. We got 2 small bed pushed together. This was not very romantic but it help in assigning one of the beds as the 鈥榮and bed鈥?and the other as the 鈥榮leeping bed鈥? Staff don鈥檛 knock at the door and wait for a response before entering. One time, I had asked for towels since none had been left when they cleaned the room. I was already naked, getting ready to take a shower when the door was opened without warning.Shopping: Expensive. I was in Cancun last year and I was able to buy 10 necklaces for $20. In Punta Cana, they wanted $10 for each. Music CDs at the airport were way too expensive.Suggestions to the hotel: offer real dance lessons; sell fresh coconuts to tourists; lower prices in gift shops (tourists would buy more); open the clubs a little earlier (10 pm); develop some real clubs; put more alcohol in the drinksSuggestions to tourists: there is not much you can buy at the airport, so make sure you buy everything before you leave; most of the action happens in the Beach resort", "Date": "Jun 2, 2005", "ReviewID": "UR431053019", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "2", "Location": "-1"}, "Author": "ecmelara"}, {"Content": "Wow what a Great place to have Fun       Beach 1", "Date": "Mar 30, 2005", "ReviewID": "UR744134635", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Best vacation spot ever!!! In one week I am on my way back to this resort for the second time (it is worth visiting more than once) and i can't wait!! First of all, the beach and the gardens are beautiful. The beach is always clean, the sand is fluffy and white and the water is clear and warm with very little seaweed. There are always staff members looking after the gardens and they look great. The staff was extremely helpful and friendly. They don't speak much english (and i don't speak much spanish) but they tried hard to understand and get whatever you wanted. Many of the staff members do speak french, so if you can remember what you learned in school that helps a lot. We were told ahead of time not to tip because tips are already included, and no-one seemed to have a problem with this. We did leave little gifts like candy in the hotels rooms for the cleaning ladies and they seemed to appreciate them. The rooms were very clean, we did not have problems with bugs or anything like that. They aren't the nicest looking rooms, but it makes you appreciate the beauty of the rest of the resort more. The food was amazing!! I love all types of food and really enjoy a good meal, and i have no complaints. There is something for everyone... you can even have take-out pizza on the beach and get hamburgers and hotdogs by the pool if you can't survive without american food for a week. This really was the best vacation ever, we always found fun things to do, and if you are there to do nothing for a week or two, it's even better. None of us were sick last time, however as a precaution we are bring some medicine this time just in case. If you go with a great attitude and relax and have fun, you'll love this place!! If not, don't sit next to me on the beach while i'm enjoying my afternoon nap :)", "Date": "Mar 11, 2005", "ReviewID": "UR133832879", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Don't Knock Just come right in We experinced staff who would enter your room without knocking on the door. When they did knock the key must have been in the door, they entered so fast. We had to ask for two days to get a face cloth. The last and final straw was the phones were not working in the rooms. This was the week of January 21, 2005.", "Date": "Mar 11, 2005", "ReviewID": "UR387652070", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "1", "Value": "3", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great Hotel My family stay there for a week. My twin fourteen year olds loved it. They gave us two rooms and were cleaned and the refrigirators were restocked everyday. We loved the food, especially the steak-house. The staff were friendly and willing to help. The only thing that we don't recommend is horseback riding. The trip was supposed to be two hours,but with all the planning and everything else, it came out to be less than an hour and the horses were all underfed. We finished very tired, trying to make them move. Everybody was complaining about it. This is the only thing we definatly dont like. The rest was great. The beach was one of the greatest beaches. The water was clear and the temperature was great. We had such a wonderful time that we are planning to go back again this year. You will never regret going there.", "Date": "Mar 8, 2005", "ReviewID": "UR684142896", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Worse Food--We All Got So Sick I spent a week there with my boyfriend. I will break up my opinions into sections and rate each section accordingly. Grounds: I give this area a five star. It was the most beautiful place and very clean. The resort grounds were absolutely beautiful! The pools were clean, the gardens were exceptionally well maintained. The beach was perfect. There was a little train which took you to the other resorts which were only minutes away. You could hop on and off the train which came every few minutes. Room: I did find one cockroach in my room one day but I have to say I am a VERY fussy housekeeper and I did find the grounds and the room to be well kept and clean. Our refrigerator was restocked daily with pop and water. The room, by Canadian standards, would probably be rated a three star. The shower worked well and the water was hot. We did spend a fair bit of time in out room after the first couple of days as we kept getting sick.Drinks: A three star. The quality of the drinks depended on where you went. I would recommend the bar at the casino. The poolside bars were okay. We are rather quiet people but friendly and polite. We tipped well at all times. Despite our efforts to show our appreciation, the majority of the staff was unfriendly. I didn't see a single staff member smile the whole time. Expect to wait at the bar for a while if you are a male and not tipping well. I watched one bartender serve many people despite others being there first. Food: A one/two star. I must admit I am a fairly fussy eater. When vacationing, I like my seafood and nice restaurants. The buffet at the Casino had crows and flies enjoying the food along with the tourist. I had the smoked salmon pasta. I would strongly advise anyone to stay away from any seafood or fish completely. Everyone I talked with got sick from it. Many of the people we met expressed their disapointment in the food. If you stayed at the Paradise, the people who I spoke with said it was good. If you stayed at the Casino, Golf, or Garden, you couldn't eat at the Paradise. I tried all three buffets and some of the restaurants. We, and many other people were frequently ill. I would recommend you have breakfast at the Amber (no crows in the food). The little restaurant at the Garden has a beach view. I survived most of the week on their potato soup as I was nautious and had bouts of sickness throughout the trip. So did the people we were with, and others I had met. It is worth going to the pharamacy they have on site for something stonger than Imo.dium. They don't speak any English but appear to know what you wantShopping: There is no soliciting on the beach at all. If you walk down the beach you will find a mall with much better prices than the boutiques and much better selection. Barter at about half the asking price. They are pushy and will offer you gifts. Golf: my boyfriend is a golfpro. We both enjoyed the driving range and the roosters in the morning made it a different but fun experience. The golf course was okay according to the golf pro. I have travelled a fair bit and in sum, as beautiful as the scenery is, I wouldn't reccomend this resort because of the unfriendly service and the fact that you eat for necessity and not enjoyment and you know that when you do eat, it may make you sick. Refrigeration is a definite problem at this resort. Cold cuts were left out in the heat for long periods of time and usully were not on ice. Because of this experience, I probably wouldn't try another Bavaro.Casino: They play blackjack carribean style. Don't expect to win.", "Date": "Mar 7, 2005", "ReviewID": "UR805811023", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "1", "Value": "2", "Rooms": "3", "Location": "-1"}, "Author": "emilie2697"}, {"Content": "i had lots of fun!!! I really enjoyed the beach resort, although I have to recommend if planning to meet people and have a good time go between the months of July-August. I was there last weekend and the hotel seemed very quiet and full with couples. If your looking to settle down with your couple Jan-Feb, May-Jun, Oct- Nov would be a good time for you. The disco is very cool.. and so are the employees. I would recommend it to anyone. J.D", "Date": "Jan 18, 2005", "ReviewID": "UR423789116", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great vacation Excellent. It was our third time visiting this resort and I can't complain about one thing. The beach is awesome, the food was wonderful (something for everyone)and the staff was very helpful. We thought the Mexican restaurant and the Casino buffet by far the best. I will definitely go back again. It just kepts getting better.", "Date": "Dec 14, 2004", "ReviewID": "UR380026645", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "ladybug2"}, {"Content": "a great vacation! wow!. i just got back home from a long stay at the golf and casino resort. We had such a great time. The food was awesome. Everyone there is friendly and they are always willing to help you in anything. The nightclubs were off the chain. The beach is beautiful. Super clear and clean. A great vacation ill always remeber. If you wanna go party and relax, at the same time, then i recommend you this place.", "Date": "Jul 19, 2004", "ReviewID": "UR552688625", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Beautifical well-kept grounds My boyfriend and I just got back from holidays at the Barcelo Bavaro Casino Resort. My first impression was that the grounds were extremely well kept. There are many beautiful palm trees and lush greens surrounding the area. There was always staff cleaning the grounds and keeping everying looking presentable. There were flamingos at the hotel which were quite interesting to look at. The pool was large and always looked clean. There was plenty of reclining chairs by the pool. The beach is very nice. However, there was lots of seaweeds by the shore line and the sand wasn't as powdery white as I thought it would be. Also make sure to take bug repellent as I got bit like crazy. The hotel was very empty. I was quite surprised by that. The hotel lobby was quite cozy with it's piano bar and many lounge chairs. The pianist played nice tunes after 10pm. Now for the downside of this hotel. The buffet wasn't very good. I found the buffets at the other hotels (Beach, Golf and Gardern) as well as the other a la carte restaurants much more enjoyable. In addition, although our room was large (we received the one bedroom loft suite with 2 bathrooms and 2 televisions), it was in great need of updating and repairs. I honestly did not feel comfortable in this room. The showers hardly had any water pressure, the toilets hardly flushed and although our maid did an average job keeping it clean, the years of wear and tear were definitely noticable. However, I am kind of a clean freak and maybe others wouldn't feel the same way as I do. For the most part, my boyfriend and I hung around the Beach hotel the most (this is where most of the action is). We enjoyed all the a la carte restaurants especially the Steak House. The take out pizza is also very good. The club was nothing special. If your looking for a self contained resort to relax and don't really want to experience the culture then this is the place for you as there really isn't anything nearby. As for me, I wish I had the opportunity to see more of the people and the culture. I would rate everything about this resort 4 stars, however, the rooms itself were around a 2 1/2 - 3 stars. The Dominican people are one of the most friendly and hard working people I have met.", "Date": "May 22, 2004", "ReviewID": "UR571578358", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Hate to sound unappreciative, but it was simply OK My husband and I just got home from our stay at the Barcelo Bavaro. The grounds and the beach were simply beautiful. However, our hotel room was in need of a bit of updating. It was small (but who cares). I did care that the bathroom needed some work. At one point, we had water come from out of the already water damaged ceiling. However, it was fixed while we were at dinner... they also left a fruit basket and bottle of rum in apology. The food was good, but just different from American food with smaller portions. I craved cookies and doritos! It was strange to see the topless European women on the beach... though, my husband seemed fine. By the way, we were there about 3 days before we heard anyone speak English. This doesnt seem to be a big vacation spot for Americans. We met only 4 American women all week, but met some lovely Canadians. My suggestions: bring lots of small bills, a washcloth (there were none), Immodium AD, sunscreen, your favorite snacks, and a large travel mug (for less trips to the bar). Hope this helps", "Date": "Apr 30, 2004", "ReviewID": "UR320579019", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Piece of Paradise.... Just returned from spending March Break 2004 at the Barcelo Beach Resort. When we arrived at the reception desk we were quickly escorted to our rooms which had a full view of the ocean. We mainly ate at the Buffet and there was always an abundance of salads, fresh fruit, delicious fruit drinks, meats, vegetables and desserts. All day long there are drinks available at the bars and pizza, french fries, hot dogs all available at the pool. The highlight was the trip to Isle Saona on the catamaran. I would return just to enjoy that trip again. The beach is powdery sand and is always kept very clean. The staff are a wonderful group of people who are always very courteous and polite. Any enquiries email us at bdpike@rogers.com", "Date": "Mar 23, 2004", "ReviewID": "UR903955410", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "tahneecanada"}, {"Content": "Fantastic Best beach we have ever been to, lots of selection for food choices and the staff were great. Lots to do and had no problems with towels,chairs etc but we did go off season, (jan16-23),", "Date": "Jan 27, 2004", "ReviewID": "UR957695652", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "BobfromBrampton"}, {"Content": "Don't waste your vacation here.   showReview(1537281, 'full');", "Date": "Jan 4, 2004", "ReviewID": "UR307888606", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "great resort   showReview(1075365, 'full');", "Date": "Jun 10, 2003", "ReviewID": "UR311556774", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "refchief"}, {"Content": "terrible   showReview(994241, 'full');", "Date": "May 12, 2003", "ReviewID": "UR867821547", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "A relaxing trip   showReview(930061, 'full');", "Date": "Apr 5, 2003", "ReviewID": "UR791185319", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "A fabulous resort   showReview(922865, 'full');", "Date": "Mar 23, 2003", "ReviewID": "UR498988897", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "Dustbeanie"}, {"Content": "Disappointed   showReview(917410, 'full');", "Date": "Mar 14, 2003", "ReviewID": "UR894764652", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Loved it   showReview(810171, 'full');", "Date": "Nov 25, 2002", "ReviewID": "UR710218965", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "something great, something bad   showReview(646843, 'full');", "Date": "Aug 13, 2002", "ReviewID": "UR549886339", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "The best resort you can ever imagine   showReview(644372, 'full');", "Date": "Jul 29, 2002", "ReviewID": "UR661985398", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "Complaint Letter sent to resort management...   showReview(566546, 'full');", "Date": "May 6, 2002", "ReviewID": "UR754095767", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "magnifique   showReview(23430291, 'full');", "Date": "Jan 10, 2009", "ReviewID": "UR447693696", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "spoutnick05"}, {"Content": "Non andate in quest'albergo! Mai pi霉 Eden Viaggi!!!!!   showReview(23177173, 'full');", "Date": "Jan 2, 2009", "ReviewID": "UR975871835", "Ratings": {"Service": "2", "Business service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "5"}, "Author": "RomaDelia"}, {"Content": "vacanze con scarafaggi   showReview(23097347, 'full');", "Date": "Dec 30, 2008", "ReviewID": "UR764699913", "Ratings": {"Service": "1", "Business service": "2", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1", "Value": "2", "Rooms": "1", "Location": "1"}, "Author": "VittorioCagliari"}, {"Content": "\" E' bello........ma.........\"   showReview(22809317, 'full');", "Date": "Dec 17, 2008", "ReviewID": "UR576479031", "Ratings": {"Service": "2", "Business service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3", "Value": "4", "Rooms": "1", "Location": "2"}, "Author": "beppe54"}, {"Content": "Soggiorno nella Repubblica Dominicana-Punta Cana       Spiaggia di Punta Cana", "Date": "Dec 15, 2008", "ReviewID": "UR386913238", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "Danny1964"}, {"Content": "Gesamteindruck positiv...aber   showReview(22955556, 'full');", "Date": "Oct 21, 2008", "ReviewID": "UR876939028", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "Qualit盲t hat leider nachgelassen   showReview(22957756, 'full');", "Date": "Oct 13, 2008", "ReviewID": "UR621476815", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "Sommerurlaub 2008   showReview(22963908, 'full');", "Date": "Oct 8, 2008", "ReviewID": "UR922216217", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "Muy bueno el complejo hotelero   showReview(20589599, 'full');", "Date": "Oct 3, 2008", "ReviewID": "UR872717257", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "elsincero"}, {"Content": "molto mediocre   showReview(19969655, 'full');", "Date": "Sep 10, 2008", "ReviewID": "UR549234184", "Ratings": {"Service": "-1", "Business service": "2", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "2", "Value": "1", "Rooms": "1", "Location": "4"}, "Author": "sald76"}, {"Content": "Magnifica playa, muy buen hotel       la playa Bavaro, definitivamente lo mejor!", "Date": "Sep 6, 2008", "ReviewID": "UR979356543", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "3"}, "Author": "viajeraxh"}, {"Content": "Magnifique s茅jour   showReview(19563407, 'full');", "Date": "Aug 31, 2008", "ReviewID": "UR439505458", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "kokinou"}, {"Content": "bel posto,ma....   showReview(18853917, 'full');", "Date": "Aug 11, 2008", "ReviewID": "UR827081106", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3", "Value": "4", "Rooms": "2", "Location": "3"}, "Author": "orsoska"}, {"Content": "che dulusione       Chiesa al casin貌 hotel", "Date": "Aug 10, 2008", "ReviewID": "UR235211915", "Ratings": {"Service": "1", "Business service": "3", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1", "Value": "2", "Rooms": "2", "Location": "4"}, "Author": "sarangafabio"}, {"Content": "Che delusione!   showReview(18653800, 'full');", "Date": "Aug 5, 2008", "ReviewID": "UR693780035", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1", "Value": "3", "Rooms": "1", "Location": "3"}, "Author": "lausmi"}, {"Content": "excellent rien 脿 redire       Repas dans un des restaurants de l'hotel.Je rappel que l'on est servit avec une vrai carte 脿 vol", "Date": "Jul 15, 2008", "ReviewID": "UR855671555", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "bossdupad"}, {"Content": "Atmosfera Caraibica       La spiaggia con le palme", "Date": "Jun 6, 2008", "ReviewID": "UR302197674", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "citation1"}, {"Content": "Tr猫s d茅cevant...   showReview(16517017, 'full');", "Date": "May 30, 2008", "ReviewID": "UR838732126", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "redcivicblondie"}, {"Content": "Mise en garde du danger d'agressions 脿 proximit茅 de l'hotel (moins de 500 m猫tres)   showReview(15908850, 'full');", "Date": "May 11, 2008", "ReviewID": "UR599292567", "Ratings": {"Service": "2", "Business service": "2", "Cleanliness": "4", "Check in / front desk": "1", "Overall": "2", "Value": "3", "Rooms": "2", "Location": "4"}, "Author": "Coco916"}, {"Content": "Bel h么tel mais....   showReview(14073057, 'full');", "Date": "Mar 5, 2008", "ReviewID": "UR247165561", "Ratings": {"Service": "3", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "Poulette76"}, {"Content": "w le catene barcelo   showReview(13995597, 'full');", "Date": "Mar 2, 2008", "ReviewID": "UR162530525", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "mafanufu"}, {"Content": "c'茅tait tr猫s bien mais ...   showReview(13778020, 'full');", "Date": "Feb 23, 2008", "ReviewID": "UR127100369", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "2", "Location": "5"}, "Author": "jjac13"}, {"Content": "vacances impec...       jardin et golf", "Date": "Feb 11, 2008", "ReviewID": "UR102460054", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "4"}, "Author": "fabair"}, {"Content": "Vacanza stupenda!       Spiaggia Barcel貌 Bavaro", "Date": "Jan 11, 2008", "ReviewID": "UR707879539", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Isabel_57"}, {"Content": "barcelo casino golf caribe beach palace       parc", "Date": "Dec 22, 2007", "ReviewID": "UR141912755", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "tom-armelle"}, {"Content": "Splendide   showReview(11647204, 'full');", "Date": "Dec 18, 2007", "ReviewID": "UR472143787", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "3", "Location": "4"}, "Author": "audenord"}, {"Content": "Un paraiso para volver a vistar   showReview(11288499, 'full');", "Date": "Dec 6, 2007", "ReviewID": "UR484553465", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "FranciscoClaudia"}, {"Content": "au top       Plage et Une partie du Beach", "Date": "Aug 11, 2007", "ReviewID": "UR906712981", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "gregmg971"}, {"Content": "s茅jour sympa   showReview(8236527, 'full');", "Date": "Jul 26, 2007", "ReviewID": "UR290421369", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "brotherland"}, {"Content": "Spiaggia bianca       una piscina", "Date": "May 28, 2007", "ReviewID": "UR968082951", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "4"}, "Author": "paolo094"}, {"Content": "Du bon mais aussi du vraiment moins bon!!!       Notre chambre!", "Date": "May 26, 2007", "ReviewID": "UR919468948", "Ratings": {"Service": "2", "Business service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "2", "Location": "4"}, "Author": "StephaneElina"}, {"Content": "Tr猫s bon s茅jour       Plage du complexe", "Date": "Apr 9, 2007", "ReviewID": "UR844758011", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "virgules95"}, {"Content": "tr猫s bien!   showReview(7197405, 'full');", "Date": "Mar 21, 2007", "ReviewID": "UR341559393", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "4"}, "Author": "melg84"}, {"Content": "Tr猫s bon choix - nous le recommandons   showReview(6533152, 'full');", "Date": "Jan 1, 2007", "ReviewID": "UR649621063", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "3"}, "Author": "onagan"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g147293-d218478-r23060890-Barcelo_Bavaro_Casino-Punta_Cana_Dominican_Republic.html", "HotelID": "218478", "Price": "$275"}}