{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Ideal for Hockey and Football”", "Author": "Phill N", "ReviewID": "UR128151024", "Content": "Very good location for Hockey and Football fans, but that is also it's downside. Hotel is very centrally located with easy access to just about anything in Vancouver. Rooms come a bit scarce during Hockey season as I found out. My room was clean, comfortable and basic. Bathroom was rather small and cramped. Toiletries and towels were readily available. The room contained a mini fridge which is nice so you don't have to rely on the $2.25 price for a beverage from the vending machines. There are several 7-Elevens and stores within comfortable walking distance for all your needs. One view from the room was of the Stadium and the other, of an alley and rooftop of adjacent building. Which wasn't a major concern. Elevators can be tricky sometimes because the card reader fails quite often I found in my 4 day stay at the hotel. Great bar area, and the other attached bar is great for watching sports, especially hockey. But get there early for there is standing room only once a Canucks game is on. Staff was friendly, lobby was clean and open, and free WiFi was a definite plus. I definitely would recommend this hotel if you're needing a clean, comfortable room within in close proximity of the stadium and arena, and also a good choice for a centralised hotel in Vancouver.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "NY", "Title": "“Terrible Choice (If you have any need for Internet access...)”", "Author": "room317", "ReviewID": "UR127961168", "Content": "I stayed here on business for a week with several colleagues. At least 80% of the time, the Internet service was down completely. When it was working, it was slow and constantly timing out. Colleagues on several floors in various parts of the north tower had the same experience every day all week. Tech support from the service provider, Liveport, was useless and basically amounted to \"it looks fine on this end.\" The hotel staff were indifferent and the general manager dodged all attempts to contact him about the issue. If you choose to book this hotel, do not expect working Internet access. Personal communication and online work of any kind --even sending an email-- is all but impossible here, and the staff and management do not care. This is particularly troublesome if you are visiting from outside of Canada and reply on Internet access.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ashford, United Kingdom", "Title": "“Sandman close for Ice hockey and football”", "Author": "Simonosb", "ReviewID": "UR127336704", "Content": "Simple room clean and presentable bed comfortable pillows ok, picked due to the closeness of Rogers arena, it is literally a 3 min walk away Only 5 min walk to the tube station the other way. Unlike other comments I heard no extra notice due to the hockey match. only neg was the wifi was very weak on the 9th floor. Moxies for food attached didnt use so cant comment. Would I stay again yes", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Sandman City Centre”", "Author": "Hartifacts", "ReviewID": "UR127267288", "Content": "Great location for the Rodgers Arena...subway, great restaurants and neighborhoods, just a short walk...Passion 2012 Vancouver Awesome !!!!", "Date": "April 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Vancouver Island", "Title": "“Best location for arena and stadium stays but just an ok hotel”", "Author": "lulubelle45", "ReviewID": "UR126763442", "Content": "We stayed here years ago when we won the accommondation. This time we got a double room for $99 as we were going to a concert at Rogers arena. It is located an easy walk of 2 blocks to either Rogers or BC Place. Check in was smooth and since we had a large truck the parking attendants let us park in valet temporarily until we checked in then directed us into the correct lot for over height. $15 to park which is standard in downtown Vancouver. The room was clean though alittle run down, broken shelf in bathroom and poorly renovated and not enough towels for 3 people. We did find 2 pool towels in the dresser. As the kids wanted to swim before the concert(we were traveling with 3 others) we headed down to the pool. Good thing we read the directions as its confusing to find. We arrived to a big disappointment. The pool was fine, very deep in fact though the kids are teens, but the hot tub was cordoned off and under construction. Would have been nice to have known prior by a sign at the desk or in room. There is also no seating to watch the kids, had to sit on the stairs. This could do with improving. The elevators are extremely slow, and as we were on the 9th floor stairs were only an option going down. Waited 3 to return home after the concert as this hotel is one of the top choices for its location. In fact you have to sign a waiver on event nights for complaints and damage. Our only noise complaint was the stairwell door slamming shut, as there was no ice machine on our floor so people used the stairs to go up to the empty ice machine. The 7th floor had a working one. Beds were comfy and we were able to leave our truck till 2 pm though we left earlier. This hotel offered free wifi slow but at least it was free!!!! No free breakfast though. The restaurants were a bit pricy so we drove to a restaurant for brunch instead. The pros outweighs the cons so I would still come back here if going to concerts or hockey games but elsewhere if I'm in Vancouver otherwise.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kelowna", "Title": "“Another plain jane stay”", "Author": "Nolpreen", "ReviewID": "UR126477499", "Content": "I do in fact like to stay at Sandman Downtown Vancouver as convenient BUT that being said the last 2 of 3 stays there the hot tub was under maintenance and shut down each time and after a very long stressful trip to Van cause of terrible roads etc it was the first thing I wanted to use but not available. And when you write the hotel I do expect any type of return message but NADA. That does not agree with me a lot and makes me think. And in the am is it too much trouble to have a hot shower or bath without it being just luke warm? That was also disappointing.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "beautiful bc", "Title": "“Perfect location for the game”", "Author": "sleepy_nate", "ReviewID": "UR126352708", "Content": "Stayed at the Sandman to attend a Vancouver Canucks game, ended up turning into a weekend getaway in Vancouver. Sandman is the perfect location if you're going to a hockey game or football game, both BC Place and Rogers Arena are steps away. Lots of places to eat, shopping is nearby, and lots to check out pedestrian style. We stayed in a Standard Queen room, ended up on the 12th floor. I liked the high floor, had a nice view of the surrounding towers and city, and also the newly re-done BC Place lights are nice at night. Room was comfortable and clean, LCD TV was nice (although this is almost standard fare nowadays). It could've used a couple extra towels and the bathroom vanity did not have much room for toiletries, but these are small quibbles. The main thing that was not fun was the thermostat for the room didn't work. There was an auxiliary heater in the room (I guess for that purpose?), but still made it difficult to regulate the temperature in the room. Figured it wasn't worth trying to ask for a different room as we knew they were sold out for the game anyways. Other than that, a comfortable stay. Front desk staff was very helpful and courteous, it felt like they were really listening to you and not just going through the motions.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vancouver, BC", "Title": "“Great location for sports/theatre in Vancouver”", "Author": "island_m0m", "ReviewID": "UR126231077", "Content": "With its proximity to Rogers arena and Queen Elizabeth Theatre, the Sandman is in the perfect location. Room rates very decent - $109 gets you a basic room with a bed. Good for an overnight when attending an event. A little more $ might get you larger quarters. It's right on the corner of Cambie and Georgia so can't be missed. Parking is secured underground for $15 - cheaper than any of the event parking costs. Elevators are also secure using your room pass. Decor is updated. Bathroom (toilet and tub) is very small and hard to close the door. Vanity/sink is separate, which I like. Check-in was very easy. On arrival the noise from the bar can seem boisterous with hockey fans. But upstairs I heard not a peep from my 6th floor room and you wouldn't know you were right downtown. My only complaint was it was hard to get a hot shower. It took a long time for the water to heat up and even when it did it was only warm.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "St. Catharines, Canada", "Title": "“Close to Everything”", "Author": "Mike J", "ReviewID": "UR125660411", "Content": "The Hotel is right Downtown. You can walk to most tourist locations. The Sky train and city buses are close by for other locations. Room was good. We were upgraded to a double Queen on arrival. Security was good as you needed a room key to use elevator.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Grand Forks, Canada", "Title": "“Sandman Visit”", "Author": "J R", "ReviewID": "UR125156349", "Content": "The hotel was not difficult to find. We were coming from Grand Forks. Upon arrival, parking was a little difficult. We drove a truck and parking was not easy. Our room was average for the rate we got. One queen bed, quite comfortable and a couch. The room was clean. There was a coffee maker, with tea. The television service was great. The only downfall was on checkout, we found a ticket on the truck stating that we had to pay for our parking because our ticket was not placed on the proper place on the dash. The desk staff were friendly, not overly helpful. The view was okay, BC Place was quite spectacular. There was sort of a dreary view of a cigarette-butt-scattered roof area with lots of traffic from employees on smoke breaks. We had a room near the elevators which was a bit noisy. All in all not a bad stay.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Vancouver", "Title": "“Clean and inexpensive, a few things to watch out for”", "Author": "YVR_guestservices", "ReviewID": "UR124937254", "Content": "We spent three nights here after having to move out when unexpected work had to be done on our condo. We were quite pleased to get a very good rate despite booking same-day and that on a night when a hockey game was on. Rooms are clean, and everything's in good repair. Lighting in the room could be better; the desk was not a great one at which to work and there was only one reading lamp beside the bed. Finding a place to plug in rechargers for the iPhones and iPad necessitated a lot of poking around behind immoveable furniture. As we had a pet we had to stay on floor 4, which meant we had a dreary \"view\" of an inaccessible, cigarette-butt-scattered roof area and a retaining wall. On our first stay we were right by the elevators, which meant a lot of noise from the ice machine, and from the hockey fans coming back. A lot of partying and pot smoking by others on our floor. Maintaining a comfortable temperature in the room was a constant challenge. Elevators extremely busy at peak times, resulting in long waits.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Woss, Canada", "Title": "“great hotel”", "Author": "WossVegas", "ReviewID": "UR124903180", "Content": "this hotel has a bad rep. but was not our experience. Everyone said your staying there? but I heard it had recently been redone and it was cheap and close to the hockey game so I booked it. so glad we did, it is rated as a 3 star but I think that should be updated to a 5 star, from check in under cyrstal chandeliers on marble floors, right down to the plush robes waiting on our comfy beds! Excellent!!!", "Date": "February 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Perth", "Title": "“Central and Convenient”", "Author": "Liz S", "ReviewID": "UR124599324", "Content": "The Sandman was the first hotel we stayed in for our 3 month long trip through Canada, US and Fiji. We stayed here twice because we went to Whistler for a week. It's location is fantastic, walking distance to the main area in Vancouver and the hop on hop off buses stop right out in front. The food at the restaurant was nice and had great food. The service was good. But being from Australia we weren't use to staff asking how our meal was every 5 secs It got a little annoying especially since most of the time I had a full mouth. The lounge down stairs was great if you got the right person. Katie from Toronto (sorry I can't remember her last name) Was FANTASTIC! We loved her and made sure we tipped her big. The other ladies who served me were not anywhere near as good. The front desk people we always smiling and happy to help. If I asked for information about an attraction etc they would help out which is more then I can say for a lot of other places we stayed at. the second time we checked in they upgraded us to a larger room which was fantastic and it had a fridge so we could store milk and save money by having breakfast in the room. The room is what you need a bed, toilet and shower. But there was not much room to put our suitcases. But really how many people stay there have 4 large suitcases and hand luggage. the only problem we had with the room was the double glazing was not sealed properly so we had to crank the heat all the time. Apart from that the room was clean and welcoming every night we came back.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Seattle, Washington", "Title": "“Not safe area”", "Author": "traveller1216", "ReviewID": "UR124176684", "Content": "I stayed at the Sandman Hotel Vancouver City Center for two nights in mid January 2012. I removed all my belongings from my car and stored the GPS in the glovebox before parking my car in the underground paid parking lot with security and limited entry. When I checked out of the hotel and got to my car, I found my car to be damaged. Somebody had broken into my car through the driver's side window (smashed to pieces) and stolen the GPS from the glove box. I came upstairs and told the hotel about the incident. Front desk told me that such incidents are rare in the area and in the hotel. I later find out from people working in the parking lot and nearby area that such incidents occur about once a week in the hotel!!! Furthermore, the manager told me that the cameras were not functioning when I had my car parked and the hotel is not liable for the damage to my car despite the secured parking lot. His words \"security is for honest people and doesn't stop the vagrants from breaking into vehicles.\" Total car damage > $2000, which my car insurance company is partly paying. Hotel wouldn't cover part of my bill or provide a voucher so that I can get over this terrible experience. Bottom line: Don't stay in this hotel or nearby area. If you must, don't park your car in the so called secured paid parking lot. This warning is especially true for travelers from outside British Columbia.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seattle, WA", "Title": "“Fine hotel for the money, great location”", "Author": "Dragontwin", "ReviewID": "UR124128267", "Content": "The hotel staff, room, check in and check out, and pool area were just fine. There were a few inconveniences such as fuzzy cable, no \"do not disturb\" door hanger, slow elevators and dirty windows. For the money, it was a perfectly fine hotel with a great location, and the water pressure in the shower was great. The Shark Club wasn’t as hot as its website totes. The food was yummy, albeit expensive, and it was completely dead on a Saturday night, so in the future I’ll plan to have cocktails somewhere else.", "Date": "February 4, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nagoya, Japan", "Title": "“Good location and good rate, but do not expect more than that”", "Author": "broccolily", "ReviewID": "UR123589656", "Content": "It was first time for me to stay this hotel as I always stay at YWCA next door to this hotel. Well, I don’t know if I chose this hotel next time… < Advantage > Good location to Skytrain station (China Town/Stadium) and also very close to city center (a few blocks away). Nice room (seems renovation was done not so long ago). < Disadvantage > Super slow response to inquiry e-mail and dumb reply by asking the information, which I have already clearly mentioned, also giving wrong information such as airport shuttle bus, which is not operated any more in winter time. Attitude of front desk staff was terrible (not professional, not friendly at all). Complimentary coffee was provided on the first day only and coffee machine was not cleaned during room making (used coffee pouch was left as it was).", "Date": "January 25, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Surfers Paradise, Australia", "Title": "“Front desk staff were terrible”", "Author": "LIVINGlifewithGI", "ReviewID": "UR123260522", "Content": "The hotel it self was great, really nice clean rooms but the front desk staff were really rude and never had the time of day not all the staff I did see some nice ones but the two that I dealt with were very rude and couldn't careless about customer service, I would even be walking past to go outside and the manager would be talking about his personal life and everyone in the lobby could hear, The internet also would cut out so you would have to go sit in lobby to use the internet. I would never go back to this hotel because of that, there were so many other hotels that have same price and great service I wouldn't even bother going back to Sandman Hotel.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“Effective hotel near centre”", "Author": "johnboog", "ReviewID": "UR123042563", "Content": "The Sandman hotel is getting on a bit, late 70's design that needs some new paint here and there. But a good location next to stadium, near Chinatown and go for a good breakfast to Medina Cafe on Beatty Street nearby (see separate review). Efficient hotel with parking and no frills service. Two good bars. It works, value for money.", "Date": "January 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great views and accomodation”", "Author": "tonestar24", "ReviewID": "UR122702959", "Content": "Stayed here as part of a Contiki tour, and was very impressed with the hotel. We stayed here at the start and end of our tour so both stays were great. The location is excellent, the staff were fantastic and the hotel is really nice, rooms and lobby. The only downside was the elevators took forever and especially when you have many tour groups rolling through, the line was long getting upstairs once we were dropped off with our luggage. The wifi worked great, breakfast was nice and overall it was a pleasant stay. I will definitely stay here again, it was really nice!", "Date": "January 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Reading, Pennsylvania", "Title": "“Long term stay”", "Author": "franco b", "ReviewID": "UR122636542", "Content": "I stayed at the Sandman City Centre for approxiamately 50 days in October and November and the stay was very comfortable. The staff treats you very well and responds quickly to any needs. The restaurant and bar staff are personable, efficient and friendly. The close proximity to all downtown areas make this a great hotel location. I would certainly come back and recommend this hotel to business travellers on long term stays in Vancouver.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tacoma, Washington", "Title": "“Awesome location and price.”", "Author": "Spencer W", "ReviewID": "UR122023372", "Content": "For less than $100, we got a hotel that is the closest hotel to Rogers Arena for a hockey game. This place caters to that crowd. Check in was easy, parking is located underground in a secured parking garage via room key, and access to the rooms also via room key in the elevators, so you definitely feel secure. The room was rather small, but clean and in good working order. We got a corner room facing the arena, so we always had our blinds open enjoying the city view. The one downside of the room was the bathroom was so small that you had to squeeze in next to the toilet in order to close the door. Just a little pain for a great priced room. There was also a great sports bar, The Shark Club, right in the hotel that was great for pre-game activities with drink and food specials. We hung out there both before and after the game. If staying in the downtown area, you definitely cannot beat this price and location.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "SunshineCoast, Australia", "Title": "“Awesome location, great stay.”", "Author": "LX9", "ReviewID": "UR121878411", "Content": "I stayed here twice and i will definately be back, It has an excellent location i walked everywhere, the shark bar at the hotel was a favourite great food great atmosphere all sports on the big screen just awesome!! easy to get to for international travellers, from the airport catch the train to vancouver central, when you come out to the street walk 4 or 5 blocks to the right and you are there and only $7 fantastic. The hotel staff were great and helped me out with everything i needed, very very happy.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seattle WA", "Title": "“One nite, no issues”", "Author": "TonySeattleSeattleWA", "ReviewID": "UR121699866", "Content": "We stayed here one nite, checked in quickly, had a reservation for a queen, and they said they were not too busy and moved us into a room with a King. Clean room, everything worked. Asked to be placed away from the nite club, so we were not bothered by the noise, no problem doing so. Didnt order from the hotel restuarants, per prior reviews, but in downtown Vancouver, there are plenty of other choices. I have stayed here before, the pricing was good, and would not hestitate to stay here again.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Rochdale, United Kingdom", "Title": "“Good location - not the best hotel”", "Author": "Travelstar51", "ReviewID": "UR120610212", "Content": "Stayed here 2 nights in September 2011. Room on 11th floor so not disturbed by noise from the Shark Bar. Room poor - absolutely no drawer space so couldn't unpack properly. Carpet was wet at side of one of the beds (leak from bathroom) - obviously not checked by maid service. Reported and offered a room change without question. Ate at Moxie's restaurant both nights - food and drink and service fine. Hotel lifts are supposed to be key card secured but they aren't. Only 2 lifts available which are inadequate for the number of people in the hotel so you had a long wait every time you wanted to use one. Work had been done on our floor by contractors and the mess left not cleaned up. Some noise from other hotel guest in the early hours. Hotel location is fine for easy walking to main shopping areas. Wouldn't stay here again.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Good value, well located, a bit dingy”", "Author": "RoyalSilk", "ReviewID": "UR120215618", "Content": "The main thing going for this hotel is the rooms are available at a reasonable rate and it is very well located, right in the centre of Vancouver and close (four blocks) to Vancouver City Centre on the Skytrain. A number of grocery stores are located close by, as well as many other amenities. Budget rent a car is about two blocks away and Pacific Car Rentals are also close by. The rooms are small and would benefit from some better lighting in them, and the rather strange dark decor adds to the impression the place is a bit dingy. But the staff were very friendly and helpful and overall I would recommend this for the price.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“Location Isn't Everything”", "Author": "Anise76", "ReviewID": "UR120206182", "Content": "So, nice location downtown, but if you're hoping for a quiet, relaxing stay, this isn't the place for you. Our room was right above the Shark Club Bar, which pounds music out day and night, meaning that sleep was an impossibility. There are always dodgy blokes hanging around outside the front door, asking for money, and it's very intimidating. The rooms, however, are comfortable, with the beds large and soft enough to sink into, without being TOO soft. The bathroom, however, was tiny, dingy, and had some damage to the bath. The hotel-supplied hairdryer blew up while we were there, and reception provided a replacement immediately. The food in the M-Lounge was great, and the Beef Dip in the Shark Bar was fantastic. However, the bad things outweighed the good, and it didn't make our list of places to consider for our next stay.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "British Columbia", "Title": "“Rogers Arena and BC Place next door.”", "Author": "Ydnar", "ReviewID": "UR120056683", "Content": "With parking on event nights running twenty bucks alone, this property is a great value when booked early and at a discounted rate. Even if your plans do not include a visit to BC Place or Rogers Arena, this is a great location in downtown Vancouver. Walking distance to numerous restaurants, shopping opportunities and the Skytrain, this is a super location to experience all that downtown has to offer, and at a reasonable price. I was in the South Tower and found the rooms small - not even a closet - but the layout was okay and pretty much everything required was at my disposal. Did not try the internet connection so I can't comment on that. Bedding was comfortable, clean, and no problems there. My air-conditioning unit didn't seem to work but the window actually opened (and it was the end of October so not sweltering). Check-in/out was quick, accurate, and uneventful.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cobble Hill, Canada", "Title": "“Great Place to stay when you visit the Big City and the Canucks!”", "Author": "silverdollar35", "ReviewID": "UR119960541", "Content": "Great value - you're in the heart of the Canuck Zone. Clean comfortable rooms, well stocked, quiet and within walking distance to shopping, the game, theatre and dining.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Coatbridge, United Kingdom", "Title": "“This was a real home from home”", "Author": "BaldingJoseph", "ReviewID": "UR119803182", "Content": "We stayed for a week in the Sandman Hotel on West Georgia Street. The staff were really friendly and welcoming. Every need was met. The room was kept really clean and tidy. We could come and go with family members coming in to visit. The hotel is well situated for the harbour, Gastown, Chinatown and the two large stadia are nearby. The little False Creek ferries are close by as are the buses and the Skytrain. It was our best hotel stay ever.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Standard City Hotel”", "Author": "DiggoryLondon", "ReviewID": "UR119495303", "Content": "This is a large busy standard city hotel. We stayed on the 11th floor in a room overlooking the rear ( and sports stadium) which proved to be very comfortable. The room was air conditioner and a small fridge had been provided. We did not visit the restaurant but opted to use the White Spot family restaurant just a short walk up the road from the hotel. The only slight complaint being that you can hear people using the corridor, any conversations could be clearly heard in the bedroom. With regard to the general street area around the hotel we did not have any safety concerns, it was only a short walk to Chinatown. There are three different city tour bus companies operating from a bus stop directly outside the hotel front door. This provides a great opportunity to undertake a full circuit of the city in order to get your bearings prior to making your own way.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "West Sussex, UK", "Title": "“Four Night Stay”", "Author": "mach0r", "ReviewID": "UR119488677", "Content": "At the end of a fly drive 16 day holiday from Calgary we decided to stay for extra nights in Vancouver. Sandman Hotel provided basic requirements to a standard you would expect. When booking in at first we were allocated an small room. This was a mistake by the booking in-person. After a debate (should we make a fuss etc) decided to complain and had the wind taken out of our sails when the (different) booking-in lady moved us to an excellent room with mountain views without any problems. The location was fine for access to downtown but hotel is on a main road so noise was a problem as was the music from the bar. Apart from that all was OK. Free WiFi. Pay for parking.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Trowbridge, United Kingdom", "Title": "“Typical Chain Hotel in Downtown area”", "Author": "Bryan_Cash", "ReviewID": "UR119075380", "Content": "A pretty standard room with an uninspiring view. Great location if you are going to the sports events or theatres. Good customer service from staff on front desk. Lift access to all floors. Good pool and on site restaurant (which is a bit pricey but saves you getting into Gastown).", "Date": "October 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Subpar”", "Author": "Fiona_Toronto", "ReviewID": "UR119009732", "Content": "For the price that we paid for the hotel, it was ok. I would not pay full price for this hotel. The lobby is standard, modern. The elevator is such a bother, you must use your room key to access the elevator. The room size is great but that's all I can say about it. I had this one hair on the shower wall for 5 days...it was never washed/removed. There were stains on sheets (lower box) which I am hoping it was coffee stains. The noise from the street can easily be heard in your room and I was on a double digit floor. The pillows were so high that you are almost sitting up when you're laying down. The location is very convenient. Shoppers and restaurants around. I wouldn't go there again.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Ohio", "Title": "“Good overnight stay”", "Author": "KLKOhio", "ReviewID": "UR118507574", "Content": "After reading some poor reviews I was pleasantly surprised by the appearance of this downtown hotel. The lobby and public areas are very nice. The rooms are small, but fine for overnight. Our room in the north tower had a redecorated bathroom, but the sink area had no place to leave your toiletries and no place to hang towels. The onsite restaurant looked to be very expensive. We walked a few blocks and found some less expensive food. The hotel was a short taxi ride to the Port of Vancouver where we set sail on a cruise to Alaska.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“A low level of services”", "Author": "Geeze1649", "ReviewID": "UR118345666", "Content": "When checked in late in the evening there were 3 receptionists, they were busy looked at their computers and it took few minutes until one of them finally greeted us. No bell boy. Room was not equipped with a hair dyer, when asked for one, it took a day to deliver it to our room so we have to borrow from the room next door when the room was being cleaned. Used glasses was left uncleaned. The receptionist was unfriendly when answer questions.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Fort St. John, Canada", "Title": "“good bang for you buck!”", "Author": "espanolosa", "ReviewID": "UR118214627", "Content": "The newly renovated Sandman is good value for the reasonable price for a hotel downtown Vancouver. We were happy to see a nice bar fridge in the room to keep our water and juices, oh okay, and a few beer. beds were good, linens nice and not too noisy on the north side of the hotel. Great for walking to any show in the Queen E, Rogers arena or Orpheum.", "Date": "September 16, 2011"}, {"Ratings": {"Location": "3", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Salisbury, United Kingdom", "Title": "“Well appointed rooms”", "Author": "Ruby067", "ReviewID": "UR118079513", "Content": "We stayed at the SANDMAN for the first two days of our stay in Canada, and for a further day after a brief trip over to Vancouver Island. We found the reception staff to be very helpful and professional (especially Liberty), and we were allowed to leave our main luggage without charge in their store while we went over to Victoria, where we were limited to a small case on the float plane. We were upgraded to a suite on the 12th floor, with a large sitting/ eating room , a reasonable sized bedroom and a good bathroom. The furnishings were fine, except for the desk chairs, which looked rather scruffy (black leather). No problem accessing lifts.", "Date": "September 13, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“Good location, tiny room”", "Author": "Brendab72", "ReviewID": "UR118034758", "Content": "It was easy to walk around the entire town from our hotel (especially since the weather is so nice). The room was so tiny though - similar to a London hotel. There is only one night table so I created another one by turning one of the many trash cans upside down (there is a big push for recycling). There is no place to hang towels in the tiny bathroom except for one silver ring behind the door, but it was only a mild inconvenience. The computers in the lobby were convenient and reasonably priced. We didn't have any trouble with noise from the nightclub from where our room was located.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Great Hotel, Central Located”", "Author": "Ktravels12", "ReviewID": "UR117949060", "Content": "We stayed at the hotel for the first 4 night of out canada trip, It was a great hotel after reading all the reviews which some were misleading. We was on the 12 (top) Floor with a great view of the river and west Vancouver. There was a pool as well with a jacuzzi witch had a bad stench. The only bad point is the wireless internet dident work verry well on the 12 floor only by the door of the room ! apart from that verry good hotel would stay again.", "Date": "September 11, 2011"}, {"Ratings": {"Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Midlands UK", "Title": "“Average at best”", "Author": "dizzyheights", "ReviewID": "UR117907068", "Content": "We stayed at the Sandman Hotel on the 04th September. The location is slightly outside of the main down town area, but no more than a 15 minute walk to the key attractions. Staff at the front desk were helpful and friendly, but unfortunately for us this is where the good start ended. As reported in other reviews the elevators are small and busy and our room, although clean, was noisy facing on to West Georgia Street. Our air conditioning unit was also extremely noisy and to top it all off, we had a disturbed nights sleep from inconsiderate guests who were going between each other rooms all night. We reported our noise concerns to the hotel front desk, who did arrange for security to pay them a visit. However, this did not work and the noise continued up until around 4 am. We understand that the hotel was being used by an 18-30 group tour. However, management in the morning offered no more than an apology. At least in the UK at Travelodge you are offered a 'good nights sleep' guarantee. My recommendation would be to request a room that doesn't face onto West Georgia Street and on a floor with no 13-30 group tour parties.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "UK, Stafford", "Title": "“Did just what we wanted it to do”", "Author": "HolidayHungry", "ReviewID": "UR117360326", "Content": "We stayed at the Sandman in early August at the top of a three week road-trip ending in Calgary. I had read the reviews before we set off and had a degree of trepidation. What can I say? Well - People and service - swift and good Lifts - well they worked and we only had a few queues but the stairs work well also Room - clean, tidy, comfortable and well ventilated (we had 8th floor) Food - perhaps not the cheapest in Moxie's (particularly breakfast), but tasty and delivered with excellent service. Evening waitresses worked hard for their tips but were also genuinely very pleasant Parking - you get used to paying for it after 8 different hotels Desk staff - accommodating and pleasant This hotel gave us a good base for a couple of days exploring and is near to Stanley Park which is a beautiful city 'lung'. In a city as small as Vancouver, part of the fun is trying out public transport systems, but we hired bikes on the front and walked a lot. I would recommend the Sandman for a few nights stop-over.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Summerland, Canada", "Title": "“The Stairmaster”", "Author": "1962Steve", "ReviewID": "UR117206742", "Content": "Well all I can say is that I will not be staying at this Hotel ever again. I checked in with my wife, three young daughters and my mother-in-law on Sunday the 21st of August, 2011 and after we parked the van in the parkade we proceeded up the elevator to the lobby, this is where you have to switch to one of the other elevators that take you up to your floor. Well only one of the 2 were in service and a tour bus loaded with people had already checked in. There was a line up of people already waiting for the one operational elevator. As I was standing there with my family, finally next in line for the struggling elevator the bellman approached the elevator and announced that he had to get the luggage from the tour bus up to each of the floors. There were at least 20 full size suitcases in a row down the hallway that he alone began loading into the only elevator while my young daughters held their small pink suitcases at their sides. I could see that this fellow was having a tough time so I began helping him get the suitcases into the elevator. Soon after another man joined in as he was also becoming inpatient with the slow progress of the bellman. Once the elevator was full to the ceiling the bellman stepped in and the doors closed. We stood there now with a long line forming down the hallway wondering if we would ever see those doors open again. 15 minutes later it did come back and we squeezed as many of us in that elevator as we could. It proceeded up towards our 7th floor destination and passed right by it, even though we had repeatedly pushed our number. we were met on the 9th floor by a very frustrated woman that insisted on wedging herself in with us for she had also been waiting for 15 minutes. She had been staying in the Hotel for 2 nights and finally got so upset with the one intermittent elevator that she demanded to be moved to another room in the other tower that had a different elevator system. We did make it to our room and stayed 2 nights. What time we didn't spend waiting for the elevator we were walking up and down the 7 flights of stairs along with many other frustrated guests. We booked the room 2 weeks in advance and we had requested a refrigerator, well when we got to our room, no fridge. Manager said no more fridges. They only had 2 bath towels in each room, we had 3 people in each of our rooms. Had to call desk. Next day after maid service, 2 towels again. By far my worst Hotel experience...Shame on you Sandman!!", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Hull England", "Title": "“Shame about the bathroom!”", "Author": "Joanne S", "ReviewID": "UR117180926", "Content": "We stayed at this hotel for two nights and on arrival the impression we got from the lobby was that it would be a nice hotel. The staff on the front desk were helpful and friendly. We were able to check in at 12:30pm and the hotel parking was easy to use but expensive at $20 per day. Initially the room seemed ok however, the furniture was shabby with handles hanging off the drawers, which we fixed. The room had air conditioning but it could only be set between 20 - 24C. The beds were comfy and the toiletries were nice, however the bathroom was extremely poor. The bath filled with water above your ankles after a 5mins shower, meaning you were stood in 4inches of scum from the plug hole. The extraction was poor so the bathroom had mould on the walls and ceiling. We were in a room on the third floor which meant we were above the bar, this meant the room the was noisy until midnight. I would ask for a room on a higher floor. There is a Moxies restaurant in the hotel which is good for food. But this cant be charged to your room, you have to pay the server. The hotel is in a good location for shopping and to visit the tourist area of Gastown. It seems like the money is spent on a flashy lobby and fitness suite and not the rooms, which is a real shame.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Nijmegen", "Title": "“Nice hotel, but not the best location for sightseeing”", "Author": "Caspartje", "ReviewID": "UR116969904", "Content": "We stayed here two nights after arriving in Canada for a 2-week trip. Hotel room is very nice and clean, large with everything you need (ironer etc.). However, free WiFi is very very slow (the only thing you can do is check your email). Location is okay, but a bit away from the downtown action. A lot of tramps on the street at night, but they do not bother you. Breakfast is served in the attached restaurant (okay, nothing special).", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Hertfordshire, UK", "Title": "“A typical Sandman hotel - average!”", "Author": "KeepSmilingUK", "ReviewID": "UR116757845", "Content": "This hotel is quite well located, within ten minutes' walk of the main downtown area. Check-in was efficient, although not friendly - but, maybe that's because it's in a big city. It claims to have been refurbished recently and I guess the plain and simple decor confirms this, but why didn't they do something about the awful lighting in the bedrooms while they were at it? One light beside the bed and one in the hallway may be romantic but is otherwise useless. There wasn't even a lamp on the desk unit. Our room, with two Queen-sized beds, and bathroom with bath, shower, wc and handbasin were both clean and tidy. Toiletries were Sandman's standard Pharmacopia soap, shampoo and conditioner. The air-conditioning was efficient and reasonably quiet. A coffee percolator with ample supplies was provided. WiFi in the room was free of charge. The lifts were very slow - basically, there are insufficient lifts for the number of floors and rooms. It would be difficult to improve this, so my advice would be to choose your stay to coincide with a time of low occupancy! Because of its location, rooms at the front of the hotel tend to suffer from traffic noise. We also had a problem with noise in the corridor outside our room because of its proximity to the vending and ice machines.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Vancouver, Canada", "Title": "“NOT a business hotel - Internet is useless”", "Author": "Greg S", "ReviewID": "UR116678497", "Content": "Currently staying at the Vancouver Sandman, during our organization's annual week long conference. 40-50 people, 4-7 nights stays. The wifi access is simply unusable in most of the guest suites. I've had four staff members tell me they would find me a 'booster' of some kind to improve the situation, not one of them did, worse, not one of them got back to me as to why. I finally reached out to our Events Sales Manager, Evan Slade with the problem who arranged for me to switch rooms to one nearer a router... Unfortunately, the new room was absolutely no better - THE INTERNET IS ESSENTIALLY USELESS. I wrote a polite, but firm letter to Mr. Slade describing the ongoing problem and again, no reply from him or anyone else. Simply unacceptable We booked two large suites for our office & hospitality suite - somehow, they ripped them up for renovation the day we arrived. Oh yeah - the 'business center' actually consists of two old PC's in the lobby, available for your use at $3 per 15 minutes.... Take your money elsewhere.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "5", "Service": "4"}, "AuthorLocation": "melbourne", "Title": "“Recommend as a cheap Vancouver option”", "Author": "lions1", "ReviewID": "UR116584489", "Content": "Quite a large room with 2 double beds, staff helpful, meals good and well priced handy to Rogers Arena, some lift issues", "Date": "August 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great hotel, highly recommended”", "Author": "Tinselcat", "ReviewID": "UR116450702", "Content": "We were a little nervous about this hotel after reading reviews but were pleasantly surprised on all counts. The area seemed fine and was within shortish walking distance of Gastown, Chinatown and so on. The Big Bus tour company operates it's hop on hop off service from outside the main door. $ 38 for a two day pass was worth it as you can access some places on this that you can't on SkyTrain. The room was very clean, very nicely decorated, well equipped and VERY quiet all the time we were there (over a weekend!). The bed was huge and by far the most comfortable we've encountered in Canada. We never queued for the lift- it always came immediately. We were able to check-in early and the staff we met were professional, efficient and courteous. Vancouver is a fabulous place and this was a great hotel to stay in while we explored. There are so many restaurants, cafes and shops about that you can easily find places within your budget!", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Waldwick, New Jersey", "Title": "“Older Hotel - No amenities”", "Author": "timbosul", "ReviewID": "UR116306142", "Content": "We visited Vancouver last summer and our travel agent put us in this hotel. Our room was very dark, the hotel is older. We opened the window which looked out onto a rooftop and a brick wall - which didn't help with the light. Got up for breakfast the next day and there was no coffee downstairs so I had to go out and get coffee. Spent $70 on breakfast for 4. I also remember the staff at the front desk was not the friendliest. We wound up moving around the corner to another hotel. The room was less expensive, breakfast was included and the room had a window that looked out over the city.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“really excellent”", "Author": "tufnellparkandy", "ReviewID": "UR116126371", "Content": "Everything about this hotel was excellent- first class service from Reception and really helpful staff who went out of their way to help. Early check in wasn't a problem which was great after a 10 hour flight. My room had recently been refurbished and was to a really high quality. Really good night's sleep. I wouldn't hesitate to stay here again the next time I'm fortunate enough to be in Vancouver. First class!", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Vancouver Island BC Canada eh.", "Title": "“Not too sure if we would go back...”", "Author": "Canshy", "ReviewID": "UR116092239", "Content": "This hotel was rather nice- Very nice lobby (there was a female crackhead outside who followed us to the front doors asking for money but the hotel obviously did something about it as she wasn't there ten minutes later when we headed out to site see)/ The check in agent was very pleasant, told us about local events going on etc. Hotel room was all right...Were given a government rate which is always appreciated as I travel from time to time for business purposes. I was concerned about bed bugs as I had read a prior review stating this was a problem but our room was fine. No buggies and the room appeared clean. The bathroom had no windows and it had one small vent blowing air into the bathroom (not sucking it out as it should) but there was an air conditioner in the room itself so this wasn't too bad. Lots of hot water, shower had good water pressure, etc. Towels and tub were a bit small but I'm a big girl. ;) We left the room at lunch (the chambermaids were sort of hovering outside the door when we left) and when we returned just before 5 our room had not been tended too. This wouldn't have bothered us except that we needed clean towels to shower off all the sweat from sight seeing. Hubby called the front desk and they had some clean towels brought up to us right away by a very friendly lady (and the room was done before we returned later in the evening) I think the only real complaint we had about this hotel was that during our second night there, we were sleeping (as most people are around 3 in the morning) and we awoke to the sound of our hotel room door being opened by some drunk guests who were confused. Apparently they were staying in one of the other rooms but it was disturbing that their KEY CARD unlocked OUR hotel door!!! If we hadn't had the latch over the door or if we hadn't been in the room, they would have wandered right inside. Kind of a security issue... We mentioned this to the front desk agent when we checked out and she said she'd never heard of this happening so maybe it was a one time deal but safety (especially in downtown) is pretty important to me so I'll be unsure about staying there in the future. Neither hubby or I slept very much the rest of that night. Aside from that, it was a very nice hotel experience.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Excellent on 11th floor. Noisy close to nightclub on 2nd floor.”", "Author": "bobandpat39", "ReviewID": "UR115776406", "Content": "We were lucky to arrive late afternoon when the nightclub on the 2nd floor were geering up which meant when we entered our 3rd floor room because of the noise we walked straight out and were given a room on the 11th floor which was excellent. Those on our tour staying on the lower floors, experienced sleepless nights because of the noise from the nightclub which continued until the early hours of the morning. The hotel is a short walk from the railway station where frequent trains go to the airport or into downtown. It is also easy to take the train to the next station and walk to Grand Central station to catch the Amtrak train to Seattle or elsewhere.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Adelaide, Australia", "Title": "“the hotel is old and has only 2 lifts , will not return”", "Author": "pmwilly", "ReviewID": "UR115434978", "Content": "very old no room service , baggage to rooms took over a one and half hours,got kicked of the lift three times so it could be used by staff would not recommend this hotel to anyone travelling to Vancouver on Holiday.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Goole, United Kingdom", "Title": "“Nice hotel”", "Author": "bob7580414", "ReviewID": "UR115412293", "Content": "Arrived late evening it took a bit of finding directions not very clear, it is near to the ice hockey stadium. The staff are friendly but not really chatty, the room was comfortable the bed was a bit firm for us. Moxies restaurant is very nice but pricey. But so is Vancouver in general. Good central location.", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Bad Bad Area and Rather Sad Hotel”", "Author": "FunkMaster007", "ReviewID": "UR115312023", "Content": "My wife and I stayed at this hotel on two separate occasions during our trip to Vancouver, first when we arrived in Vancouver and then again when we returned to Vancouver after a 2 week long road trip. Our first stay, we were put in a room that seemed decent enough, but the bed was rather uncomfortable and they don't actually use a duvet cover, but rather a sheet and skimpy little blanket as the bed linen. The pillows were of poor quality too, like they had been flattened and no matter what you did, they just stayed flat. We first stayed in the North Tower, there is no room service provided in this block. The wireless internet is pretty useless, free as it may be, it never keeps a connection for longer than 10 minutes and is quite slow in comparison with other hotels we stayed at, with the same size. We rented a car for the trip and the hotel charged us $15 excluding TAX to park our car. They say it's safe, but you can get to the parking garage through the hotel, without needed to use a access card or anything, not very secure in my mind. The area in which this hotel is, is pretty much on the border for the worst part of Downtown Vancouver, (Hastings) which suffers from a great deal of people on drugs, alcohol abuse and homelessness. On one occasion, in the morning, we were sat in the hotel lobby awaiting a representative from our tour company and we met a girl in the lobby, who clearly was a drug addict, seeking refuge (a warm place to relax) and the hotel staff did nothing about it. I am not saying that they should have called the cops, but having her there, just showed that they didn't care who used the hotel lobby as a half way house. It was an uncomfortable feeling and we left quite promptly. I wouldn't stay at this hotel again.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“Very noisy hotel, bar booming out music directly under rooms.”", "Author": "marlo876", "ReviewID": "UR115293273", "Content": "A tired looking hotel, very noisy due to internal bar booming out music. Although we paid in advance for porterage service our luggage took over two hours to arrive from the lobby, we gave up on departure and struggled on alone. Would not advise as suitable for the more mature couple or anyone expecting to have a peaceful rest.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Nelson, Canada", "Title": "“Very clean and comfortable.”", "Author": "Edwin_Lin", "ReviewID": "UR114659868", "Content": "Very clean room indeed and the staff were very helpful. It's location on Cambie & Georgia make it ideal for walking around downtown, Granville and Vancouver City transit stations just ten minutes walk. The Canada line is ideal if you fly in as we did, the rapid transit in Vancouver is very efficient and good value for money. This hotel is ideal for business or pleasure and we recommend it.", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Clean and adequate”", "Author": "darryl57", "ReviewID": "UR114634454", "Content": "Very clean room and hotel in general. Reception OK but a bit slow. Hotel does not appear to have any character. In a reasonable position. Expensive but then this is Vancouver. Would stay again if I had to visit Vancouver again. Nothing really to complain about and nothing to rave about.", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“It was adequate”", "Author": "davidcornwall", "ReviewID": "UR114486297", "Content": "Hotel was very clean and staff friendly, however there was nowhere to hang towels in the bathroom and we had to ask for shampoo as the one in the room was half empty. Also there was only on bedside cabinet and lamp which was inconvenient if one person wanted to read at night. We requested another cabinet and lamp but didn't get it. The lifts broke down and as we were on the 11th floor and I have trouble with my back and legs I couldn't get to my room till they were fixed which fortunately wasn't too long.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Los Angeles", "Title": "“Worst hotel I've ever stayed in”", "Author": "musicmanD8", "ReviewID": "UR113579499", "Content": "I am not picky about hotels. So the fact that this one is horrible really says something. The elevators are incredibly slow if they work at all. The \"wireless internet\" is non- existent. It takes up to 10 minutes for an email to load. The rooms are extremely small and not worth the price. At this point, a hostel would be better. As for business, I am not able to do any work here due to the poor internet. Best of luck if you want to risk this horrible hotel.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Llanelli", "Title": "“good hotel and we'll be back”", "Author": "Suellanelli", "ReviewID": "UR112581727", "Content": "Having read some of the previous reviews on this hotel I was dreading staying there but I was in for a happy suprise. The rooms were small but with a queen sized bed, well laid out and very clean. We were 2 couples and our friends also had a very good room. Our room was near the lifts but we could not hear a lot of noise. The hotel has a good pool which we well used during our stay. The Sandman is well situated for visiting the sights, of whichthere are many. The staff were very friendly and helpful. Previous reviews had complained about them but we found them to be very helpful. We did eat one night in the hotel and found it very good although you are spoilt for choice in Vancouver.", "Date": "June 10, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "devon", "Title": "“Good Value with Exceptional Staff”", "Author": "lagos", "ReviewID": "UR112573642", "Content": "We stayed at the Sandman for an overnight stay in a family room. When arriving at checkin the queue was enormous and we had to wait for what was easily 20-30 minutes. Upon check in we realised that we had left all of our paperwork/passports in the cab we had arrived at the hotel in which had since departed. Clearly in a mad panic, the receptionist took control of the situation ringing round a number of different cab companies. Fortunately, after around 3-4 attempts, she located the cab company, the driver and the paperwork and passports - result! Taking control of the situation and resolving what was a very distressing time caused us all to relax and start enjoying our trip. The cab driver arrived within the hour and everything was as it should be - it's not often that people are this honest these days! We went to our room (which was huge!) and clean and headed into Vancouver for the night. The following morning, we had breakfast and what a fantastic breakfast it was too! Again, the staff were exceptional, the breakfast arrived within what was probably less than 5 minutes and the food tasted just great! We decided to opt for a kids breakfast each, expecting that the 'adult' breakfast's would be too big. The kids breakfasts were more than adequate for what we wanted and kept us full until lunch time. A little on the expensive side, but still worth it. On the night, we had dinner at the Sports Bar in the hotel - not quite as nice as breakfast. Meal was very nice but again, a little on the expensive side. The 'mini' mousse is really yummy so definately recommend that! We were put off a little by the atire that the staff were wearing but if your a single bunch of lads you will love that part! Overall, the hotel is comfortable and clean and I would definately stay here again", "Date": "June 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Scotland", "Title": "“Return stay.”", "Author": "ayrbrain", "ReviewID": "UR112462883", "Content": "We stayed 3 nights before our cruise and 2 on our return. An ok hotel. After 2 phone calls to reception, secruity sorted out the very very noisy guests in the next room, it was unbelievable the noise they made having a party. The following weekend was the Canuck game in town, it was amazing to watch from the window the crowds in the streets, we really thought we were in for another rowdy weekend in the hotel but far from it as it was very quiet thankfully. We arrived at 10am from our cruise and were pleased to be told our room was ready.", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Wollongong", "Title": "“An aging property in need of a comprehensive renovation.”", "Author": "RetireeBob", "ReviewID": "UR111038644", "Content": "An aging property in need of a comprehensive renovation. We stayed at this hotel on three separate occassions over three weeks as part of a tour. For some reason, the rooms at the front of the hotel don't have a mini refridgerator, while those at the back do. We were on the 4th floor and could not sleep due to the noise from the Nightclub below and the street noise. The windows are double glazed to reduce nosie but we needed to open them to get some fresh air as the rooms had a lingering smell. Bathroom or smokers in a non smoking room? On the 2nd visit they gave us the same room as before, so we asked for a different one and got a much better room on the 6th floor with a fridge and a better bathroom layout. A good sleep was had. On the third visit, again the 4th floor. This time the room hadn't been cleaned properly, (partially consumed drink left on bedside chest and a used diabetes test strip on the floor) the bedside lamp didn't work (broken switch), one of the beds was off its base and the security lock had been removed from the door, wallpaper peeling. The final nail was the drink and ice machines outside the door which sound like they need new motors. After complaining we were given a perfectly good room at the back on the 11th floor. Only negative here was a non working coffee perculator. The elevators are small and very slow, you can wait for 5 mins on the 11th floor and much longer at busy times like the morning.", "Date": "June 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "st albans- Hertfordshire}", "Title": "“who desighed this place?”", "Author": "barryjc", "ReviewID": "UR110804075", "Content": "We checked in this hotel for 4 days prior to taking a cruise to Alaska. To get to our room on the 7 th floor we had to queue for the lift. About 6 out of 10 times we had to queue because there are not enough lifts to serve the rooms. The bedrooms are nice and its clean, however its when you enter the bathroom it becomes a problem. There are no towel rails. Nowhere to hang a towel. Not a coathook, nothing.The new towels are left rolled up on a shelf under the hand basin. When you've used them you leave the hand towels on the basin and the bath towels on the bath. In the main room there is also not a coat hook so your coats are thrown over the armchair. This was not just our room. My family stayed in another room that was the same. On our return a week later we had to stay 1 night and they put us in \"refurbished\" rooms. Still no towel rails for the bath towels but a small towel ring for 1 hand towel next to the basin. But the special thing about this room was, NO WARDROBE, and still no coathooks. But we did have a nice big refridgerator that was empty. There are no dining rooms here but there is a branch of a restaurant chain called \"moxies\" joined to the hotel. The menu will suite Canadians and Americans but not Brits as it has all the fry up and the pancakes and fruit on the same plate. There are some nice diners within 5 minutes walk.", "Date": "May 31, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Launceston, Australia", "Title": "“Way above expectations!”", "Author": "marsh_aus", "ReviewID": "UR110722384", "Content": "Our trip to Vancouver was booked through a travel agent so we had no input as to where we would get to stay. I checked out all the reviews on here and was a bit underwhelmed. But, to the future and when we arrived I was amazed. The lobby is very clean and inviting. We were so busy staff were no issue. Now, to the room, and wow. We had a double queen room in the north tower and it was huge. 2 Queen beds with heaps and heaps of space. A flat screen TV is also good with heaps of channels. Bathroom is very nice with good quality toiletries (the shampoo was great) Beds are very comfy and we slept amazingly well. Noise was no issue EVER. The Shark Bar downstairs is very cool with good cheap food and good drinks. The staff there were awesome to tourists like us. My friend tells me the pool and spa was great and also a pretty decent gym/workout area. The only thing lacking in the room was fresh milk so we could make hot drinks but can definitely overlook that for the quality of the rest of the stay.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Napa, California", "Title": "“Not too bad”", "Author": "WorldWanderer99", "ReviewID": "UR108135842", "Content": "A friend and I stayed at the downtown Vancouver Sandman Hotel prior to going on a cruise to Alaska. I wasn't sure what to expect after reading the reviews but it was okay. It had a nice lobby, was in a good location for walking to shops and restaurants, and was in a decent neighborhood. The hotel could definitely use more elevators. There were two for each tower. I believe we stayed in the North Tower and there were couches outside the elevators due to the long wait when it became busy with people checking in/out. In addition, one of the elevators broke and it took forever to wait for one. Luckily they do have stairs. The hotel had a sports bar (Shark Bar) that served food. However they were charging $6.00 a person the night we stayed since the Canucks were playing in a hockey game that night. It wasn't a home game but rather for people who wanted to watch the game on television. There is also a restaurant, Moxies's Grill, that I will give a separate review on. The hotel also had a pool and whirlpool which neither of us used. The people checking us in and out were not the friendliest. They did call us a taxi and I was impressed with the speed of their arrival to take us to Canada Place. The hotel did have wireless internet. However, It was constantly busy and I was unable to acquire a network signal at any time. There are two computers available in the lobby which you can pay to use the internet. At the time I got desperate enough to pay to use their computer and internet there were no chairs to sit down on since other customers waiting for a bus or taxi were sitting in them. Our room was not as bad as I thought it would be. It was roomy enough. It had a flat screen television, separate bath/toilet from the vanity area, and overall it was clean. The room did not have a refrigerator or microwave. It was a basic room with no special frills. Overall, it was an okay place to stay. We didn't experience bed bugs, loud noise, or a tiny room where you couldn't walk around. The rooms were not what I would consider luxury nor was it a dump! We got what I considered a decent price on the room considering it's in a major city. I honestly have no complaints about it except for not being able to get on the internet.", "Date": "May 13, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Titusville, Florida", "Title": "“Outstanding Hotel and Service”", "Author": "scottcrow", "ReviewID": "UR108134393", "Content": "My wife and I are currently staying in the hotel and Love it! I was very concerned after reading the many articles about the Sandman but was very impressed how the General Mgr Michael Lopez steped up to the plate to make corrections and answer customer concerns. The good and bad to this story is the the old tower does show signs of wear. But the new tower is outstanding. All of these newly remodeled room have a European feel and is just as nice as the 5 Star Hyatt room we stayed in last night in Orlando, Florida. They are a bit smaller then the rooms we have stayed at but we still have plenty of room and love the decor. Every thing is clean and so signs of the Bed Bugs we have read about, Our room was not ready when we arrived early but within 15 min we were sent up. Plus they now have FREE wireless internet a added value. If you stay here ask for the new tower when you make your reservation. Its a great price for a great room and within walking distance of everything. Scott &Lydia Crow Titusville, Florida", "Date": "May 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Shawnigan Lake, Canada", "Title": "“Great hotel, but very small rooms”", "Author": "TekyJeff", "ReviewID": "UR100225030", "Content": "Our room (queen-sized bed) was about 12x12 with a 6x12 bathroom. No closet and no place to hang things up. OK for 1, but crowded for 2. The lobby was undergoing renovations. Otherwise, the location, service, and room were all very good.", "Date": "March 15, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Island in the North Pacific", "Title": "“If I knew electricity was extra I would have gladly paid for it.”", "Author": "Meathawk", "ReviewID": "UR98049669", "Content": "Yes my rate was cheap, but having the power and phone shut off in the entire North Tower, with no notice to the guests, made showering in complete darkness a hotel experience I will never forget. I went to the front desk to complain, and they didn't seem to care, and said it must have been the construction crews who were working on the hotel. Gee do you think? I inquired and complained in the afternoon to the duty manager, and he didn't know anything about it, and didn't offer one of nights comped or any other resolution. I had to shave by the light of my laptop. If you want a shower with lighting just go down to the leaking parkade below the hotel. Also important; Unless you like to stay in a frat house, with a kegger party on every floor, don't stay here on a game night when the Canucks or BC Lions are playing. The noise up and down the halls is brutal, and is not attended to by the front desk or security very quickly, and they are brutally slow at answering the phone. The restaurant/nightclub attached to the hotel, is a dump. The rooms are small and you may feel like you are staying in a shoebox, the hotel security is a joke, and although It has keycard locks in the elevators, they are just there for show and aren't needed. You have to pay to use the Gym, The movie selection is limited and outdated. And the heater/ air conditioner works, but judging by the wierd funk that comes from them, I doubt they change the air filters very often Cheap room yes, but the \"decorum\" you get from the place, and the not stop rowdiness, makes this Hotel more like Animal House with a front desk. And don't bother with Room Service, there are no menus in the rooms, and the room service staff don't have time to tell you whats on the menu. Next Time I'm spending the dough, and getting a place somewhere else with electricity.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“Perfect location for hockey fans”", "Author": "Victoriakm", "ReviewID": "UR96173628", "Content": "We chose to stay here simply because of it's location...a 2minute walk to Rogers Arena. There is a Moxie's Bar downstairs that is usually packed before a game. Staff were very nice, and the parking is gated. The fire alarm went off twice but seemed to be an accident. Check in and out were quick and efficient. We would recommend this hotel to anyone going to Vancouver, especially if you are going to a Canucks game, or even a BC Lions game.", "Date": "February 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Revelstoke, Canada", "Title": "“Renovations look awesome”", "Author": "needaholiday15", "ReviewID": "UR95097466", "Content": "Stayed at the Sandman Downtown by Rogers Arena this past Friday, very enjoyable trip. My wife and I went to Danko Jones concert for her birthday at the Commodore, which was ok, but you can read about that in another review. I enjoyed the location of the hotel in comparision to everything that you can see and find near it. Only a short distance from the venue and restaurants. Our room was a renovated room that came with a King bed and couch. The room was very clean and welcoming. The lobby was very beautiful with amazing art work and a brand new desk that was being installed. My wife and I had a enjoyable stay, even for a 1 night quick trip. Would definently stay here again if in town for another event or getaway.", "Date": "January 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "UK", "Title": "“Comfortable, and reasonable location”", "Author": "blt100", "ReviewID": "UR86088303", "Content": "The location was good - only a short walk from Stadium/China town skytrain stop. It was a short walk up to Granville St. The ice machine outside of our room, was very noisy at times. We contacted reception about this and they said someone would check it out, but it didn't seem to make any difference. It was very busy when there was a home ice hockey game.", "Date": "November 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Adelaide", "Title": "“Suited us fine, so we stayed there twice!”", "Author": "Varietal", "ReviewID": "UR85418232", "Content": "Our Canadian Rockies tour started and finished at the Sandman, so we didn't have a choice as both the first and last nights of the tour were included. We booked in a night early to de-jetlag ourselves. We were disappointed in the size of the room as we unpacked and then we discovered there was no fridge! (Haven't seen a hotel room without a fridge in many years!) Reception said they'd send one up and it would cost us $10/nite, but when I said there's not even enough room for our bags, much less a fridge, they offered to move us to a larger room that had a fridge. EXCELLENT!! Twice the size AND it had a microwave, too - all at NO extra charge. We were happily impressed. The staff continued to impress us with some free internet vouchers, an offer to store an extra bag for us while we were on tour and some excellent advice on local stuff. I'll ditto other reviews of the Sandman Downtown in relation to the pool - immaculate and pleasantly warm with the spa actually HOT :-). The location may leave a bit to be desired for some, but with the rail only a block away and the busses at our doorstep and everything we needed within walking distance...we were happy to extend our stay a couple more nites after our tour.", "Date": "October 31, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Bed Bugs”", "Author": "AmandaDH", "ReviewID": "UR85220383", "Content": "My husband and I stayed at this hotel for 5 nights and when we returned home we had brought bed bugs home with us. I had 67 bites alone on one arm, and it took 6 months to get rid of them. We informed the manager of the hotel about the bugs and he had an exterminator come in and found adult bed bugs in the room we stayed in. We were not reimbersed even a cent for our stay. I would never stay at this hotel again. If you do stay there be VERY careful with your clothes and suitcases cause the bugs are difinately there.", "Date": "October 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Swansea", "Title": "“Did the job.”", "Author": "rdg444", "ReviewID": "UR84944234", "Content": "We stayed three nights at the Sandman on West Georgia. It was perfectly located for Rogers Arena where we watched the Canucks kick the Wild's butt. It's also well located for the \"touristy\" parts of Vancouver. The hotel is slightly above average but clean & comfortable & fitted our purpose.It was well appointed with everything you'd expect to have. The front desk staff were corteous & helpful. Friday was noisy in the city after the hockey game but we were on the 10th floor of the North Tower so we got a bit of noise carrying up to us. The Shark Bar was popular after the game but OK on the other nights. Moxie's on the 2nd floor has great food if a little pricey & our waiter Jon was good fun & made the meal even more enjoyable. The music was a little too loud. We normally try different hotels on different visits so we may not stay there again but if it came down to it we wouldn't hesitate.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "USA", "Title": "“Gets the job done”", "Author": "MelMcHenry", "ReviewID": "UR82658079", "Content": "We were relocated to the Sandman Hotel after the Ramada oversold. The hotel itself is much nicer than the Ramada on Granville. The location is also better in that it's less seedy. It's within walking distance of both Gas Town and Robson street. There is a decent bar in the hotel - Shark's - which had a crazy Monday Night Football party going on when we were there. I didn't know Canadians care so much about football! We did not eat in the restaurant or use any of the other services (hot tub, etc.). My only real complaint about this hotel is that the elevator is fruratingly, annoyingly, painfully slow. You will want to minimize trips up and down because of it. In all, it was a sufficient hotel but nothing special to rave about.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rochdale, United Kingdom", "Title": "“Stopover”", "Author": "johnsuperstar9", "ReviewID": "UR82560102", "Content": "This hotel is close to all sights etc, lots of restaurants close by. The staff were great and the rooms adequate. The lifts worked but always busy. Our room overlooked a building site but not really a problem.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Burgess Hill, United Kingdom", "Title": "“An old hotel, poorly modernised with tiny rooms”", "Author": "browserwowser", "ReviewID": "UR81135474", "Content": "We stayed at this hotel for 3 nights to visit Vancouver. The location was OK near ot the main downtown areas of Vancouver. The room was at the back of the hotel and had been refurbished. The lifts were tiny and scruffy with buttons broken. There never seemed to be enough staff on reception. The room was tiny with a large air-conditioner up the corner. There was no bedside light or bedside cabinet for my wife and the bathroom fan did not operate. When I reported these things I was told not to expect them to get fixed and they didn't. The linen and towels were fine and clean. At nearly a hundred pounds a night booked as a special offer through Canadian Affairs I considered this hotel poor value for the money and will not use it again. For the parking i expected to pay an extra 15 dollars a night - in fact it was an extra 20 dollars a night", "Date": "September 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Perth", "Title": "“Happy with this hotel”", "Author": "RoRo_in_Perth", "ReviewID": "UR79727336", "Content": "I stayed at the Sandman Hotel for three nights in July and August before I did a tour around the Canadian Rockies. I was very happy with our room. It was quite large, with plenty of room for suitcases and bags. The bathroom was decent too, split into a bath/shower and toilet, and then a separate area with a basin, so two people could get ready at the same time, which was handy. The lift was painfully slow at times...I expected such a big hotel to have better lifts. The walls are quite thin...I woke up one night at midnight as the person in the room next door had their TV blaring and I could hear everything. But apart from that night, I generally slept well. The location was good, we walked to Robson Street and nearby areas, and hired bikes and rode to Stanley Park, which I would highly recommend, the park is stunning. The hotel is close to the subway, which was handy going to and from the airport. We also used the subway to get to the waterfront, from there we took the seabus and bus to get to Lynn Canyon park, which I also would recommend. Vancouver is a beautiful city and I was happy with my stay at the Sandman. Clean and quiet rooms, comfy beds and well located.", "Date": "September 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Vancouver Island, British Columbia", "Title": "“Clean, comfortable room.”", "Author": "kinx81", "ReviewID": "UR78018939", "Content": "For downtown Vancouver, and not having to spend and arm and a leg, this is a good choice. Parking is $15 plus tax, but I felt it was pretty secure. You can walk to Robson Street and Yaletown, and the Rogers Arena (formerly GM Place) is right across the street. Beds were very comfortable, large flat screen tv, free wireless internet, and check-in and out was very smooth, with little wait. I liked that we had a corner room, as they are usually a bit bigger than the other standard rooms. Also, the bathroom has a sink that is separated by a door from the toilet and tub/shower. I like this design, makes it easier for two people to be getting ready at the same time. The Moxie's restaurant is connected to this hotel, and offers a good breakfast. I believe it is open at 6am which is great if you need to get an early start. Have no clue what the below reviewer is talking about - our waiter did NOT automatically add tip to the bill. This is NOT typical practice in Canada, unless maybe if you have a group of 10 or more (or whatever that particular restaurant's policy is on that).", "Date": "September 2, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Zurich", "Title": "“Awful”", "Author": "SwissJohn", "ReviewID": "UR76276304", "Content": "Started badly with porter leaving trolley next to our bags only, but not helping with the large amount of luggage despite having three children including a baby with us. Trolley not collected from room despite us requesting this to be removed. Childrens' bed not made up, and when baby started crawling, we quickly realised how dirty the floor/carpet was in the room; it took ages to get the dirt off her hands and feet. Area is poor, not far from shopping area, but if go wrong way out of hotel, i.e. towards China town, you quickly end up in an area frequented by drug addicts. Hotel restaurant Moxies does however offer a fantastic Sticky Toffee Pudding with ice cream. Breakfasts not recommended. Quite aggressive tipping policy, i.e. waiter ringing 15% on the bill as if this was obligatory, irrespective of quality of service, it is not.", "Date": "August 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "cheekie77", "Title": "“A great base hotel with a lovely resturant called Moxies”", "Author": "cheekie77", "ReviewID": "UR71103146", "Content": "This was our first stop in Canada and we were not disappointed. We were quick to be seen on arrival and were straight off up to our rooms - brilliantly big beds and nice sized room with sofa and a fridge. View not so great but we were here to see Canada not our hotel room. We actually went to the Moxie Grill most days and nights for food as it was really really good food. The breakfast were faultless and were actually the best we had all holiday - beware they are huge....enough to set you up for the day. The Sandman is actually a fair walk to the main city unless you are fit - only about 10 mins but not the nicest of walks. However there are plentyof bus's not that we ever used one. There is also the big red bus tour stop right outside the hotel which is an extra cost but well worth it as it takes you all round vancouver and you can get on and off where you want along the trip to see the sights - you must visit Stanley park lovely to walk around or go on a horse drawn carriage trip - we were lucky and saw a family of racoons right in front of us. You need I would say a good 3 days+ in Vancouver and this is an indeal place to stop.", "Date": "July 16, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New Plymouth", "Title": "“OK place, central, easy”", "Author": "twinsonic", "ReviewID": "UR71068153", "Content": "The Sandman is an old hotel that is currently refurbished. We stayed in a nice room with a King size bed and microwave. Since we only stayed the nights there, I have no complaints, except for the night the hotel experienced a fire drill!!!!!!! Five past twelve the bells started to ring.. just nicely drifting off..got all our valuables and ran down the steps... outside across the road. Fire brigade arrived, lots of people standing around. In all that time NO ONE bothered to update guests what is happening, where to go, what to do. No manager was able to communicate.. Once the fire brigade drove off, most assumed it is safe to go back. But the lifts did not work.. No conversation here either.. No apologies, nothing... I think this is very bad and shows lack of training..Thank God it was false alarm, but still.. lots of improvement necessary!!", "Date": "July 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Switzerland", "Title": "“Not worth its price. Noisy from nightclub and rooms are old & filthy”", "Author": "na13bouk", "ReviewID": "UR67961660", "Content": "If I had any alternative option, I would not stay at the Sandman's again. All the three of us had to change rooms after the first night due to noise and filthyness. One of my colleagues left one night earlier then scheduled with her decolletée full of bed bugs bites. I also felt itchy for several days but did not react to them so badly - lucky me. The second room was in a higher floor, more quiet and cleaner, so if you have to stay there ask for a room in the 10th or 11th floor or in the second tower building.", "Date": "June 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "burnham-on-crouch", "Title": "“disorganised chaos”", "Author": "oldshep77", "ReviewID": "UR67564826", "Content": "When we arrived reception was very busy and had to wait about 20 mins to be attended to. Our first allocated room was already occupied so had to request another room only to find yet again that this room was also occupied. The manager couldn't explain the error and put us in a South Tower suite, which was only one room with microwave and fridge. The hotel generally looks very tired and the lifts seem to have a mind of their own. Be prepared to queue for breakfast between 7 and 8am.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“Hotel of Choice -- Downtown Vancouver”", "Author": "mikeb1985", "ReviewID": "UR67235060", "Content": "I am required to go to Vancouver multiple times per year with work and the Sandman is my preferred accommodation. Its central location, friendly staff and well appointed rooms make it worthy of my continued loyalty. The Sandman doesn't make any claims of grandeur nor does it advertise itself as anything other than a 3-star hotel in a central location. Never any problems.", "Date": "June 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "ireland", "Title": "“satisfied customer”", "Author": "daisymay74", "ReviewID": "UR66614267", "Content": "found this hotel to be very central to everything and within walking distance of most tourist attractions. staff were very helpful regarding any queries i had and the rooms were spacious and clean. could do with some extra lifts in lobby as when have a group of 48 checking in alot of people to queue for a lift.", "Date": "June 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“You get what you pay for...”", "Author": "ellimac0711", "ReviewID": "UR65423470", "Content": "The lobby of this hotel is nice and Moxie's is attached so you can have dinner or drinks during your stay while being close to your room. The front desk was very helpful and quick during our check in/out. The room that we stayed in was small it was definitely just a bedroom. A queen bed with a small washroom, a couch and a miniature balcony. I think that the hotel rooms could use a good renovation. But the location is convenient and only walking distance from shopping areas is downtown Vancouver such as Robson Street. I've stayed at the same hotel twice now and would return again in the future. Just don't expect anything fancy and most of the time we were running out and about during our stay. It was good place to sleep at the end of the night.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Nanaimo, Canada", "Title": "“You can find a better hotel in Vancouver”", "Author": "1345309Cass", "ReviewID": "UR65236897", "Content": "We stayed because it was soooo close to GM place. And that would be the only plus of this hotel. Location is great but there are other hotels just as close that give you bigger beds, nicer rooms and more comfortable beds. Had to pay extra to park, and all the ice machines (only have 4 I believe for the entire hotel) were empty by 7PM. Bad view of a brick wall...do yourself a favour and find another hotel there is plenty!!!", "Date": "May 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Taos, New Mexico", "Title": "“Disorganized Place to Stay for a Night. . .”", "Author": "marathonmomma", "ReviewID": "UR64426311", "Content": "I was traveling on business and looking for a reasonably priced Vancouver hotel convenient to downtown, so decided to stay here for one night. My husband booked the reservation online on the Sandman Hotels website, however when I went to check in that evening, they had no record of the reservation, even though I had a confirmation number. They did manage to find a room for me and when I went to the elevator bank to get up to my room there was a sign on the elevator door saying \"out of order.\" I asked a staff person if they knew where I could find the stairs, she looked very confused and said she would try and ask someone. Later, after waiting for some time for the staff person to come back and tell me where the stairs were, I saw someone get out of the elevator which was supposedly out of order. It became obvious that someone had just forgotten to remove the \"out of order\" sign. Although they say there is wifi available I could not get a wireless connection in the room, so went down to the lobby and asked where they had a connection. The staff person said sometimes it took awhile and he would try to get some sort of connection for me. As there was no one around and he did not look busy, I asked if he would call me in my room when this happened, however he never called to let me know. On the positive side, the location of this hotel was convenient to where I needed to be the next morning. The room was extremely small, however the price was reasonable. I most likely would not stay here again.", "Date": "May 17, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Comox, Canada", "Title": "“I was expecting (& preconfirmed) that...”", "Author": "acanuck4ever", "ReviewID": "UR61958162", "Content": "I was expecting (& preconfirmed) that this was a \"suite\" but it was not. Had a king bed and small pull-out sofa bed crammed into one small room. I could have paid equal price for a far superior hotel & room down the street. Also, asked for bus directions to ferry and turned out they completely gave me wrong info.", "Date": "April 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Penrith, Australia", "Title": "“Great Hotel - Great Location.”", "Author": "Yonkers_au", "ReviewID": "UR59627109", "Content": "This is the 5th time I've stayed at the Sandman. The rooms have been renovated since my last stay and they look great. There was a minor issue with my booking, but that was taken care of immediately. I had asked for a very late checkout and there were no issues with this. The location is great. The food is great and it's pretty much in the center of restaurants, shopping, etc. GM Place and BC Stadium are less than 5 mins walk. The only downside was that I was near the ice machine which did interrupt my sleep at times. Other than that, a fantastic stay as usual.", "Date": "March 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“Made My Night!”", "Author": "VancouverD72", "ReviewID": "UR59452203", "Content": "We recently stayed at the Sandman Downtown, and it was fabulous. The employees were very nice and had all the answers to our questions, the service was fast and effective. Our room was spotless, and had fantastic views of False Creek and the North Shore mountains. The hotel is in a prime location, footsteps from BC and GM Place, and a short 5 min walk to the Vancouver nightlife and Yaletown. Sandman would be my first choice the next time I stay downtown.", "Date": "March 24, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Noida", "Title": "“Good stay”", "Author": "MJSLovelyn", "ReviewID": "UR58877931", "Content": "Stay was good, food was ok - location was good - ambience was acceptable. Customer service should be improved", "Date": "March 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kelowna", "Title": "“Friendly Employees, Great Rooms”", "Author": "KelownaReview", "ReviewID": "UR58345091", "Content": "I stayed in the Sandman on Georgia for one night in January. Upon arrival the check in clerk was very friendly and talkative. I requested to be away from any elevators and ice machines since I was travelling with a light sleeper, the room they had me in was located close to the elevator but after making the comment they immediately moved me as far away as possible. They ended up placing us on the top floor, as far down the hallway as possible overlooking the city, so it was a beautiful room. The decoration was very modern and the renovations done were quite beautiful. We went into Moxie's located right on site, it was practically dead in there so the service was fantastic and the food came amazingly quickly. The decorations in the restaurant were also very nice, we loved the vases they had all around. At check out the process was very quick and efficient and once again the lady that checked us out was very friendly and seemed happy to be there. Overall we had a great experience and would most certainly recommend the hotel to others.", "Date": "March 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "vancover", "Title": "“Best place”", "Author": "jeomai", "ReviewID": "UR56719962", "Content": "This is the second time that we have stayed in the Sandman Hotel. The location within a 5 minute walk takes you to GM Place and BC place. The Granville strip is only ten minutes away. We were in a spacious room with two queen beds room that exceeded our expiations. Obviously newly renovated the hallways and lobbies have a warm feeling to them (other than the slow elevator). The rooms were clean and the staff welcoming and courteous. The hotel also includes Moxie’s Grill and the Shark club (a great place for after any game). We would highly recommend this hotel to any one looking for an affordable room in the Downtown area.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "New York", "Title": "“When you do complain, they deny the problem is occuring...”", "Author": "FL2NYCGGuy", "ReviewID": "UR56366079", "Content": "So far, when people have complained of windows left open and chemical odors, they're told that there are no chemical odors, the windows weren't left open, and that no one else has complained... clearly not true. Then when really confronted, they default to saying that \"Someone was sick in that hallway, and it had to be cleaned.\" Really? How many floors has this happened on? Barfing-in-Hallways seems to be epidemic! It even sounds rehearsed. And by the way, it was the hotel staff who first used the word \"quarantine.\" That shouldn't worry you at all. Nope, not one bit. To end on a positive note, MOXIE'S is a really nice place to eat and the staff therein are very sweet. However avoid the SHARK CLUB which left me throwing up for 3 days.", "Date": "February 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "London", "Title": "“Bed bugs! Bed bugs! Bed bugs!”", "Author": "moniaudio", "ReviewID": "UR56278932", "Content": "Need I really say more. But I will. The staff was not helpful at all with the Bed Bugs issue. They would not move us, since we were stuck here for a month during the Olympics. Then they wouldn't clean our clothes either. Our Bosses had to step in. DO NOT STAY HERE EVER!!!!! JUST STAY CLEAR OF ANY SANDMAN HOTEL IF YOU KNOW WHATS GOOD FOR YOU!!!", "Date": "February 17, 2010"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Rooms": "2", "Service": "1", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Only use the Sandman Downtown as a LAST RESORT”", "Author": "k2pooh", "ReviewID": "UR56206790", "Content": "Let me start by saying BED BUGS. In our group of 70 people, after just one week, 4 of them have bed bugs bits/infections. The only thing the hotel did was move them to a different room. They did not clean their clothes, they did not offer them anything such as bar/food voucher for the inconvenience and mainly, they NEVER apologized. They didn't even offer to pay for the medical expenses that occurred as they are all on antibiotics, ibuprofen and topical cream. Please, search this problem with this hotel you will see it's an on going problem. If it wasn't for the fact that every hotel is booked (it's the Olympics) we would be moving to a different hotel. The costumer service is awful. They are very short and really don't give much assistance when asking for help. Many of us reserved refrigerators weeks prior to our arrival, only to find out there wasn't one in the room when we arrived. We've been asking daily for over a week for one, to no avail. We've given up. So seriously, unless this is the last hotel, I WOULD NOT STAY HERE. You literally are putting your health in risk.", "Date": "February 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Calgary", "Title": "“Exceptional Service”", "Author": "Calgarybiztrip", "ReviewID": "UR54671527", "Content": "I was in Vancouver late November for interviews and decided to stay at Sandman Downtonw due to it's close proximity to the business district. The service I received from the time of check in to my departure was truly execptional. I relied on the staff for directions to the my many destinations including; tourist spots, restaurants etc. I will definitely be staying there the next time I visit Vancouver.", "Date": "January 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Seattle", "Title": "“Great Business Value”", "Author": "SeattlePassenger", "ReviewID": "UR54514733", "Content": "I stay at this hotel almost one week each month. The staff knows me and treats me well. I often receive upgrades to superior rooms. Internet works, clean rooms, excellent restaurants, location is right next to where I work. Great value for a business traveler as the Westin and Hampton in same neighborhood rates are much higher. Much to do when you close the laptop as YaleTown and Stadiums are just blocks away. If you are a frequent business traveler speak to the front desk, they will take care of you.", "Date": "January 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Toronto", "Title": "“Cant Wait to be Back in a month”", "Author": "Ocean_Girlyyz", "ReviewID": "UR54444476", "Content": "On my first trip to Vancouver my Boyfriend and I were very budget conscience. My boyfriend had been making frequent trips to Vancouver and used to fill me in on how beautiful Vancouver was. We took a short vacation. We found the Sandman Gerogia street to have a huge deal on hotwire. We got to the city early, Sandman Staff held our bags until a room was ready to be checked in. It was nice of the housekeeping manager who cleaned one of the rooms early and gave us teh room at 10am.Once we got into the hotel our toilet was clogged. Maintenance was up to repair it within 30 minutes. We were tired after the Red eye flight, decided to have a shower, requested additional set of towels. The hotel staff had them in the room within 20 minutes. I cannot express how perfect the location was. Very central, within a comfortable distance to everything; waterfront, to Shopping on Robson and many restaurants. I was very impressed with the service and the hospitality of the Staff and management. My boyfriend's Company is now exclusively using Sandman hotel's Group of Hotel's through out BC. I have stayed at their Toronto Location this past week as a girl's night out. It's excellent service, price we pay for the 31/2 Star with the service and luxury of 4 or 5 diamond property, is truly \" Home Away from Home\" Feel. My families and I try to stay with the Sandman Chain as much as possible. I wish they would put more hotels in Ontario. ~Cant wait for my next trip during Olympics, Sandman Vancouver here we come ...", "Date": "January 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Central British Columbia", "Title": "“My home away from home - cheerful personable staff and my favourite hotel in Vancouver.”", "Author": "BCGrog", "ReviewID": "UR54138622", "Content": "I'm a professional business traveler. I stay in hotels all over the province of BC - for a minimum 2 weeks a month. This hotel has been my home away from home in Vancouver going on over 7 years now. I stay there every 4 to 6 weeks, usually 3+ nights a stay. I can stay at any hotel I wish, but I have come to love this hotel for many reasons. When I walk in the lobby I always feel like I do when I enter my best friend's home. The staff - front counter, room cleaners, maintenance - always and as far back as I remember cheerfully greet you and genuinely make you feel like they are happy you arrived. They always look you in the eye in elevators, hallways or even the parkade with a cheerful \"Good Morning\" or \"Have a nice sleep\" . I have yet to encounter any staff at this hotel that aren't bright and cheerful - which is amazing and must be challenging because how many people they must process and cater to everyday - and we know how demanding some of us can be right? Even the managers sometimes come out to greet the customers just to say hi and make sure everything is just right with their accommodations. The rooms are always clean. It is an older building, elegant and nicely decorated. The rooms are comfortable and the decor and furniture are top notch. The hotel offers excellent amenities - full service, excellent pool, a gym, two restaurants - Moxies ( great room service ) and the Shark Club to pick from for dinner. The location is fantastic - the QE theater, GM Place and BC Place are kitty corner. Georgia Street is the main artery of downtown Vancouver. Everything connects to it. Being right at the end of Georgia just before the viaduct makes it perfect for those that want to get in and out of downtown fast by car - just one right turn out of the breezeway and Georgia is right there, another right and you're driving on the viaduct to zip down to Main Street, then First Ave to get to Hwy 1. Turn left to go downtown, to Stanley Park, or over the Lions Gate Bridge to the North Shore. Bottom line is ingress/egress by vehicle to this hotel is awesome because it is on the edge of downtown. This hotel is an excellent jump off point for anyone either tourist or business traveler. For the business traveler like me, rest assured the high speed wireless internet is great. I just got home tonight after a week there - and all week I was receiving and responding to 30 emails a day and downloading and uploading upwards of 1 to 1.5 megs of data per session. I had no service drop outs. I had good speed each night all night for all 5 nights. My wife calls me every night a couple times a night when I am there on business. She comments all the time how personable, cheerful and nice the people are at the front desk whenever she calls. Do yourself a favour and give this hotel a try next time you are in town - you'll be really happy with all the service and the great rates.", "Date": "January 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Victoria", "Title": "“not impressed”", "Author": "d_phillips69", "ReviewID": "UR53883026", "Content": "We arrived for a business meeting-called ahead to see about an early check in- was told no problem...but- when I arrived-the lady said rather rudely that check in was at 4pm...we waited another 2 hours- and at 4pm checked in,got our keys and went to my room,only to find that they had given our room to someone else- even walked in on the couple laying in bed, who said they had checken in 2 hours ago (the same time we were supposed to be getting that very room) I was sooooo embarassed. We went to the front desk where the same rude lady acted as if it was a simple mistake- I told her that it seemed as though me early check in room was given away and that they realized it too late- but that there ws no need to be rude- she huffed under her breath- and reactivated our room cards for a different room- not even a discount or appology- it was as though we were an inconvenience to her...got into the room finally and after all that- should've gone next door to the YWCA -even it is better than this dump...NEVER WILL RETURN AGAIN!!!!!!", "Date": "January 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Kelowna", "Title": "“Loved it”", "Author": "AngieT15", "ReviewID": "UR53468805", "Content": "This was a great place to stay when we were in Vancouver! Great people and a good price!", "Date": "January 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "New York", "Title": "“Book the Hampton Inn and Suites down the street instead!!”", "Author": "TheHipsterTripster", "ReviewID": "UR53320786", "Content": "I am currently staying at the Sandman City Centre on Georgia Street due to my company's booking and I am very sorry to say that nothing has changed since the last reviewer stayed here in October 2009. It is only one month away from the Olympics and the dark, dingy rugs are still dirty and stained, the furniture all banged up and broken and there is a film of grease or something on all the surfaces and walls. I am extremely disappointed in this hotel and this being my first time in British Columbia I am terribly upset that this has to be my first impression. If it wasn't raining so much, I'd be out of the hotel as much as I could. I know praying for sunny weather in Vancouver's Winter is a pipe dream, but I believe in miracles. If my company doesn't move us out of here I may just have to dig into my own pockets and come up with the cash to stay at the Hampton Inn and Suites which is just down the block. I went in to check it out and it is fabulous! Clean, bright, spacious and just a whole different warm feeling from the moment you walk in the door. I wish Sandman would look to them for an example. Come on Sandman don't you want people to go home with good memories of their stay with you, eh?", "Date": "January 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "uk", "Title": "“Bedbugs”", "Author": "jorgUk", "ReviewID": "UR52964323", "Content": "We stayed at the Sandman Hotel for two nights, after the first night we found Bedbugs in our bed , this was the start of a 4 week holiday and it sure spoilt the rest of the trip. They moved us to another room and told us we could have the first night free, still trying to get the money via Canadian Affair. As you might imagine every stop after that my wife was looking for Bedbugs, that became a real pain, we spent the last 5 days in Edmonton at my BILaws house, he was not to keen on having the suitcases in doors just in case. This is a Hotel I would never visit again, JW", "Date": "January 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "lincolnshire", "Title": "“good location poor quality”", "Author": "terrucker", "ReviewID": "UR49262958", "Content": "was in a good location but overhaul of very poor quality", "Date": "November 15, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "SW Virginia", "Title": "“Never stay here.”", "Author": "PCBSML", "ReviewID": "UR48344589", "Content": "I was in Vancouver for a business trip and the Sandman was suggested by my client. My wife and I checked in, were told 10 times not to leave anything in our car. There were no bellmen to help with luggage. The room was small, dark, every piece of furniture was damaged. The carpets had not been washed...perhaps ever. To sit on the toilet you had to rotate 30 degrees since the seat was hard up against a cabinet. We literally checked the sheets before we got in bed. In addition, with all the cautions from the staff, we never felt particularly safe in the building. To be fair, we were told that the \"other tower is newer\", but that didn't do us much good since the check in staff strongly suggested we not stay there \"since the hockey fans are a bit loud\" after that evening's game. There are lots of great places to stay in Vancouver. Don't stay here.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Seattle, Washington", "Title": "“Location Makes Up for What Room Lacks”", "Author": "VIVA_WORLD", "ReviewID": "UR48143469", "Content": "Just a short review of our stay at the Sandman City Center in downtown Vancouver. The staff was nice, the hotel was clean, but the beds were terrible. The sheets were so scratchy that I awoke in the morning with what appeared to be rug burn on my elbows? They were bright red, and so sensitive that my shirt rubbing on them hurt. The bed was very hard too. The room size was super small with a bed, desk, table/chairs, TV crammed into it, but I think this is quite common in downtown hotels in big cities. This is my second stay here, and I will return, the reason being that the location is unbeatable, and overall is a nice place to stay for a night (wouldn't stay any longer because of the bed issue). We went to a hockey game right across the street at GM place. The bar downstairs is perfect for a few snacks and pre-game drinks, for a fair price.", "Date": "October 30, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "victoria", "Title": "“B&E NAD A FINAL INVOICE????”", "Author": "victravellers", "ReviewID": "UR48134006", "Content": "I went to Vancouver for a Canucks game and U2 concert. My boyfriend and I went out for a bit to see to city, upon return of to our room we find our hotel room door broken in half and all of our personal belongings thrown about. Two maintenance men were waiting for us in the hall and guarding what was left in the room. My camera all all of my gear was taken, valued at $2000. The GM Mr Lopez shows up introduced himself and explains what happened and that there has been a police call made. We get a new room. We are then informed that the hotel is not legally responsible for anything that is stolen. The hotel informed us that if we had used their 'safe and secure boxes' the camera would have been safe, the room is not a safe place to store our valuables. So on day two i ask to check a bag, when i go and retrieve it, the desk person said 'right this way' let us enter their room and take whatever bag was ours, WITHOUT CHECKING OUR ID, safe and secure... Bull [--]. We also found out that there is no surveillance cameras in the hotel except for in the parkade and at the front desk. We do get the first of two nights free, the night of the b&e, and the second night at a reduced rate... it's funny they think we should pay to have a robbery. We, after 3 days of fighting with hotel management, get the 2nd night for free. After we talk to the Sandman's regional manager. Now that i am back at home i am STILL dealing with insurance, police and telling everyone i know never to stay there.", "Date": "October 30, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Brighton", "Title": "“I must have been a fortunate guest as I enjoyed my stay at the Sandman”", "Author": "Vixenthefoxylady", "ReviewID": "UR45692342", "Content": "Reading through the July and August reviews it almost seems that people are talking about a different hotel. Me and my husband stayed there at the start of September and found the hotel to be very pleasent. The room was spacious and clean, the bed was extremely comfortable and the staff were pleasent. The views weren't great, but hey your in Vancouver, just take a walk around town if you want to see something nice! The only slightly annoying thing was the lifts and the stupid security cards you had to use, which frequently did not work....oh and the noisy ice vending machine outside our room.", "Date": "October 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Edinburgh, Scotland", "Title": "“Perfectly happy with the Sandman”", "Author": "Hardygirl", "ReviewID": "UR42871663", "Content": "We stayed at the Sandman twice within two weeks, once for two nights and once for five. The first room was quite small, but I found it adequate and appreciated the fact that there were plenty of electric points. The second room was larger with a better view - I agree with another reviewer, request a room facing the stadium.OK - no one would go to the Sandman for a romantic weekend , it's a busy hotel that caters for groups and concert goers but that said, I found the staff friendly , the location excellent and rooms perfectly adequate. Oh, and I also liked the swimming pool!", "Date": "September 19, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "oakville, ontario", "Title": "“Very disappointing, not worth the money”", "Author": "jkirby2007", "ReviewID": "UR42014233", "Content": "no toilet paper upon checking...took 45 min to get it: TV reception very bad. Internet unreliable, Kept going off: No Hot water the first morning: Pigeons home was outside on window ledge: Fan in bathroom so loud you could not talk while it was on: Passcard for room had to be re-programmed 5 times: two elevators in hotel...very slow and also had to be used by the room service staff: We used stairs several times: No room service although restaurant was four floors below: This room simply was not worth $139.00 a night. Saw comments from hotel stating they are upgrading. Sorry....no work was being done and no signs stating this. The only good thing about this hotel is the staff, as they are doing the best they can under the circumstances.", "Date": "September 15, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Colchester, United Kingdom", "Title": "“Not good - worst hotel on our 14 day tour”", "Author": "EssexPalin", "ReviewID": "UR39985379", "Content": "Stayed here for 5 nights in two diiferent rooms. Its not that great im afraid. The hotel feels tied/dated/worn. The air-con works but makes so much noise its unusable at night - its looks like its from a museum! The lifts are bad, you wait ages for them - we resorted to the stairs from the several floors up. The glazing is old so rooms street side are very noisey. Customer service is below average. Moxies attched to the hotel (but not sure if its part of it) serves breakfast but found service very poor when we had an issue - the matter was dealt with in very unproffesional manner and we didnt go back. On the plus side its close to down town (about 10mins walk), thats about it! My tip - STAY SOMEWHERE ELSE! On the whole Vancouver is a great place with friendly helpful people but there are far too many down-and-outs and something needs to be done as it takes the shine off. In all the places in the world Ive been to this city has the most.", "Date": "September 7, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Absolutely Appalling - will never recommend it!!!”", "Author": "Noemi_K", "ReviewID": "UR37692227", "Content": "We stayed there for 12 nights, without realizing we were being eaten alive by bed bugs… until one day we woke up covered in huge pink dots. At first we believed we were allergic to some mosquito bites. However, knowing that I am not allergic to pretty much anything, we checked with a doctor who confirmed to us these were bed bugs bites. We of course went back to the hotel’s management who, once we showed them, knew exactly what we had and offered to wash our clothes the next day and moved us into a new room. And oh, gave us 2 vouchers of 10 dollars each for food in the hotel’s restaurant. Our expenses to treat these horrible bites cost us over 100 dollars, not to mention the amount of washing we had to do. I don’t even think we got an apology from the management. Still now, a week after we departed that hotel, we are pretty much covered in disgusting bites and more coming out. We can barely enjoy the remainder of our Canadian holiday and we pretty much have to cover up the arms, legs and faces as we really look diseased. I know and understand bed bugs are hard to avoid, but since the hotel has this issue and had it before, at least they could do is give you enough info on medicine to treat such bites and a fact sheet on these bugs, offer a 24 hour laundry service, assure you the new bedroom they move you into will be free of bugs and do their best to comfort you while you go through such a horrible experience. The only good things about that place was the sports bar and the restaurant food, which I believe are under external management and not owned by the hotel.", "Date": "August 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Trumbull, CT", "Title": "“Nothing special”", "Author": "Harper23", "ReviewID": "UR37162642", "Content": "When we arrived at the Sandman, there was a fire fighter/police officer convention going on, the restaurant and surrounding streets were noisy and crowded. The hotel is attached to restaurants, bars and a public fitness center, it just felt noisy and very public throughout the open lobby. Now that I think back on it, the hotel just felt chaotic. Upstairs in the rooms, it was more quiet. We stayed with family and had 3 rooms amongst us. The room my boyfriend and I had was cramped-feeling, smelled like smoke, and was dark. Our view was of the radio station across the street. My mother's room had a great expansive view, so if you do stay at the Sandman, I would recommend asking for a corner room facing the stadium! We were within walking distance of Yaletown, which is a fun area, but we were also close to some seedy sections so just make sure you know where you're going or drive.", "Date": "August 9, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Kent, England", "Title": "“very disappointed !!”", "Author": "JohnBKent_England", "ReviewID": "UR34482176", "Content": "With bed bugs, noisy aircon and traffic noise our very brief stay was not a happy one! Unfortunately the hotel was part of a package and we had no choice. The hotel is in need of a major refit, including new beds !! We eventually managed to negotiate a move to the Sandman Suites on Davie Street, which was much better.", "Date": "July 11, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "London", "Title": "“Disgusting hotel - DO NOT STAY HERE!”", "Author": "MCG_123", "ReviewID": "UR34373989", "Content": "Stayed at Sandman in Vancouver as part of a Contiki tour of Canada. Very shabby room, poor customer service. Located in a dodgy part of town in an incredibly ugly concrete building. Several people in our party were bitten by bedbugs - most of the rooms seem to have a problem with bedbugs. I did not want to get into the bed, so I used my own sleeping bag on top of the covers and was fine, but you really shouldn't have to do that at a hotel! Avoid if you can!", "Date": "July 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Lancashire.U.K.", "Title": "“Great Location”", "Author": "downhambridge", "ReviewID": "UR32462927", "Content": "Ideal location at the lower end of Georgia Street, 10 minute walk to China Town and only 3 or 4 mins more to Gas Town. A 15 minute walk will see you in the heart of downtown Vancouver. A 10 minute $10 cab ride will see you at theCanada Place cruise terminal. Rooms are spacious and comfortable and a decent choice of bars and eateries within the hotel. Prices are very reasonable and car parking is underground .", "Date": "June 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Vancouver Island", "Title": "“You're paying for location”", "Author": "wkmitch", "ReviewID": "UR30220067", "Content": "Pros: - Excellent location for events at GM place / going downtown - Secure parking ($11 a night) Cons: - Window was covered in bird poop - Carpet between bathroom and bed was soaking wet - Pigeons created a next in the wall between rooms. Could hear them all night - Elevators take FOR EVER to get to your floor and when they do you have to pack in like sardines - Not worth the price (We paid $200 for 2 people, 1 night) I guess you are paying for location", "Date": "May 18, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Victoria", "Title": "“Fire Alarm at 4am, emergency exits blocked !!!”", "Author": "avb210", "ReviewID": "UR28990106", "Content": "Summary: I hope this company learns there lesson that things could have been worse with BLOCKED EMERGENCY EXITS, NO LIGHTED EXIT SIGNS IN THE HALLWAYS AND NO DIRECTION MAP FOR EXITS ON THE HOTEL ROOM DOORS. Lets start with the fact that the front desk staff let us know that because we didnt book directly with them, that we were not elgible for a free up grade and to call them directly and they will match expedia etc... WHY WOULD YOU TELL ME THIS IF I WAS NOT ELGIBLE......Got over it off and went on with my night. ****4am in the morning fire alarms went off, smoke filled the 3rd floor or at least that what i thought. Nope someone let the smoke extinguishers off and filled the air, couldnt see anything.. Why couldnt I find the emergency exit. 1: NO MAP on the back of my door and 2: NO EXIT SIGNS that were lite up, just a white sign that says stairs. In a hallway of smoke you cant see ANYTHING. Ran down the stairs to get to the bottom of the emergency exit that was BLOCKED OFF with lumber (Crown molding i think) a few feet tall that people had to climb over. What would have happened if this was a real fire......Fire department fanned out that floor and the staff send us back to sleep in a room filled with fire extinguisher smoke...who sleeps in that!!!!! Got moved to another room after an hour of asking for someone to help move my stuff to a new room. Finally once the police came, the staff helped me move my stuff to another room. Spoke with the day manager the next morning and again made us feel horrible that we used a third party company (example expedia) to book our hotel stay and couldnt do anything for us for what we went through. She did ask if we would stay there again and maybe give us a little discount next time... Next time!!!!!!!! I said I wold never stay here every again. She then said that shes had people in the past that were unhappy and stayed with then the second time and very happy... ahahahahahahah.. I guess I am not the only unhappy customer..... I hope this company learns there lesson that things could have been worse with BLOCKED EMERGENCY EXITS, NO LIGHTED EXIT SIGNS IN THE HALLWAYS AND NO DIRECTION MAP FOR EXITS ON THE HOTEL ROOM DOORS. I hope everyone reads this and knows how unsafe this hotel is......", "Date": "April 28, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Nanaimo", "Title": "“Messing with the elevators most of the time”", "Author": "GoCanucksGo2", "ReviewID": "UR28369468", "Content": "My son and I stayed at the hotel as to be close to GM Place for a Canucks game. I really enjoyed the close proximity to the venue and that is the main reason we stayed there. I was very disappointed with all the time we had wasted in the elevator as the security cards were not being read properly and it was very frustrating trying to get off onto the proper floor. Also found a very rude waitress in Moxie's that seemed that she could not handle the busy crowds too well. Service there was poor as the wait for a table she said could be up to 3 hrs. (For two people?) Wow! Sorry but we a game to catch so we opted instead to grab some food at the arena instead of wasting time waiting some more. I would stay at the hotel again as long as the elevator problem had been fixed as I would not want to go through that torture again and would probably find another local restaurant in case the hotel was booked solid.", "Date": "April 20, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Montreal", "Title": "“bedbugs & a mouse!”", "Author": "sozeyaknow", "ReviewID": "UR21991479", "Content": "This shabby hotel needs work. The first room I had was next to the elevator, which made a lot of noise. It was a tiny room, all bed, hardly any floor space, and no drawers for clothes. I called and asked for another room and they obliged. It was bigger (still no dresser drawers) and farther from the elevator. Called for room service: \"We don't deliver to your tower when it's this busy.\" Oh. Went to cash traveler's cheques at the front desk. \"I have a small float. I can only cash $100 today.\" Oh. I woke up the next day with a couple of red bites on my side. The day after, more bites on my arms and hands. I was sitting on the bed working on my laptop when a little mouse ran across the room. My final straw. I went down to the front desk to let them know. They offered me another room. I said I'd look and see. It smelled horribly of cigarette smoke. I got on expedia and got myself booked at another hotel (which was fantastic - Century Plaza Hotel and Spa). I asked if they'd received word of these problems before. \"Well, definitely the mouse is a first.\" (Meaning, yes, we've heard of the bedbugs). \"And I wonder how it got all the way up to the 11th floor?\" (This said skeptically, as if I was possibly imagining or making up the mouse?) Also, \"Are your bites itchy?\" \"Yes,\" I replied. \"Well bedbug bites don't itch. They hurt.\" \"Then perhaps your hotel has given me fleas.\" (By the way, bedbug bites DO itch. These were definitely bedbugs.) Sandman offered no rebate or anything at all for any of my troubles. Incidentally, Sandman Hotel was close to GM stadium which had hockey games going on. So the whole hotel seemed jam-packed with loud, drunk men with their faces painted, carrying cases of beer, and making a lot of noise. If that's your thing, and you don't mind bedbugs or mice, or shabby surroundings, or being jammed in an elevator with drunk hockey fans, and don't need to cash traveler's cheques, or want room service, you will love this hotel.", "Date": "November 19, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "British Columbia", "Title": "“Terrible!”", "Author": "krispix011", "ReviewID": "UR21596194", "Content": "We stayed here in July of this year. We were in town for a bachelorette party and we had two rooms. When we booked, we had asked for adjoining rooms or two rooms on the same floor if adjoining rooms were not available. We booked 2 or 3 months in advance. When we arrived, we were told that only one room was ready (there was about 10 of us all together). So all of us had to get ready for our evening in one room, with one bathroom. Two hours later, our other room was still not available, apparently the guests staying in it had decided to stay another night. We checked in at about 3:30 and we didn't understand how the hotel didn't already know this little fact when we checked in. We had to phone down and REMIND them that we were still waiting. So we get a second room 4 floors up, not on the same floor like we had requested. The room was under construction. No beds, nothing. So we go back to the front desk and they give us a third room. The worst part was that they were indifferent to the massive inconvenience they were causing us. Mixing up rooms is one thing but having no motivation to fix the problem or not being at all apologetic is quite another. We will never stay here again, which is a shame because the location is great and Moxies is a great restaurant.", "Date": "November 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gillingham, United Kingdom", "Title": "“Loved the sandman”", "Author": "stevewhite66", "ReviewID": "UR21562761", "Content": "myself my wife and 2 children stayed at the Sandman in vancouver and were very worried with the write ups we saw prior to coming out fron England. How wrong we were to be worried. The Hotel is situated in the most convinient part of town for visiting Vancouver with excellent shops and restaurents nearby, we would recommend Rickys Diner for breakfast. The Hotel staff were very very helpful and also very cheerful and polite to myself and my family. The Hotel was clean, tidy and safe and never once had a problem with the lifts. The pool is cool but thats the way most people like it rather than hot........but if you like hot there is a Hot Tub!!! All I can say is this hotel was first class and we would definitely return.", "Date": "November 5, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Ucluelet", "Title": "“Terrified”", "Author": "samxmalone", "ReviewID": "UR21483135", "Content": "The Sandman was not my first pick for a place to stay. My sister and her boyfriend and I were going to Vancouver for the Madonna concert and The Sandman was the only place with availability left. When we entered our unit my sister and I did an inspection. We work in the hospitality industry as well and were appalled with what we found. There was a used needle under the bed and in the bathroom it appeared they hadn't washed the seat in YEARS. There was brown goo on the toilet seat and we were afraid to even use the thing. I will never stay there again, and everyone, to avoid this situation book your stay FAR in advance so you don't have to settle and stay at a place like this.", "Date": "November 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Perth", "Title": "“Disgusting room”", "Author": "GJMPerth", "ReviewID": "UR20680512", "Content": "The Sandman Downtown Vancouver was the worst hotel experience we have ever encountered in all our travelling. Attached is a photo. This picture shows the window of our room, with the streaks you see on the glass being bird droppings. The unit in view outside the window is a part of the hotel's airconditioning unit, which ran 24 hours per day keeping us awake all night. The room was cramped with nowhere for two people to store two suite cases and the towels provided by the hotel were threadbare. Room 304 at the Sandman Downtown Vancouver should never have been used as a guest room, given the smallness of its size and more importantly due to the continual noise of the airconditioning unit running immediately outside the room window. When we enquired about changing our room we were told the hotel was fully booked because of a football match on at the stadium in the next street. We had booked our hotel almost a year ago as part of a package and presumably paid the rack rate for our accomodation. It seems to me that the hotel saw we were from out of town and would presumably never be back in that part of the world so gave us the worst possible room and provided locals in town for the football match with the better accomodation.", "Date": "October 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Miami", "Title": "“Location, Location Location !!!”", "Author": "Backpacker76", "ReviewID": "UR20306119", "Content": "I spent four nights at this hotel in early August for a convention plus I arrived a day early to take in the sights. I was bit hesitant to stay there after reading some of the reviews, but their excellent rate was hard to pass on. The best aspect of this property is its location - you are in the center of the action and all the major attractions can be reached by foot. Public transport is immediately available. The staff is also excellent and was on the ball with maps and directions. Cabs camped at the door with no waiting when I left early morning. The rooms themselves were average. I was expecting a little bigger room, but the bed was comfortable. I wanted to be upgraded to a King suite, but it was not available at the time. You might get a great view if you are up high enough. Overall, it was a decent stay there. If I ever come back to Vancouver, I wouldn't mind staying there again.", "Date": "September 23, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "2"}, "AuthorLocation": "England", "Title": "“Best Avoided”", "Author": "Dave501", "ReviewID": "UR20175727", "Content": "First the good things if you can get a room on the 10th floor or above facing north you get a good view from your window. Second the tv in our room was lcd. The hotel is also in a very convenient location. The room was just faded 80`s style furnishings (not retro just very weary). The main thing you most avoid is the swimming pool its unhygenic with a layer of brown grease all around the tiles at the water surface, the changing area is just as bad. Its also old run down and in my opinion dangerous dont let your children use it. How it gets through Hygiene and Safety inspections i dont know never seen a pool in this condition open to the public anywhere. Should be closed immediately, The lifts are old and no longer suitable for the number of floors. Use this hotel only if your desperate.", "Date": "September 18, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Rockhampton, Australia", "Title": "“not that bad”", "Author": "aussie_rose64", "ReviewID": "UR20031723", "Content": "we were abit worried after reading some of reviews here, but it wasn't as bad as we thought. the room was quite small but we only spent on night here after our rocky mountaineer journey. though small the room was mostly comfortable. with the window open we could hear abit of street noise but with the window closed it was ok. we ate at the hotel restaurant 'moxie' i think its called and that was ok too. the place is good for a night stayover. staff were friendly and helpful and the room was clean, not much else to tell really", "Date": "September 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "PR", "Title": "“A bit of both bad a good!”", "Author": "greatshang", "ReviewID": "UR19030968", "Content": "A big downside...The elevators did not work at all and sometimes kept bringing me into the wrong floors, or was a long wait for the elevator to come, so I had to take the stairs all the time! Also the rooms were very dark and lights did not work all the time! and a bad view of the alley which was also very dark and dinghy. The bathroom had no lock. The pool was QUITE hard to find with the winding hallway! Many shady people outside the hotel. Some good things: Lobby quite clean and fancy and desk service is pleasant. GREAT location, close to skytrain, bus and shopping. Nice restaurant and bar,", "Date": "August 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Get what you pay for”", "Author": "rich13", "ReviewID": "UR18989860", "Content": "Noted the different reviews before asking the travel agent to book this hotel. On arrival Reception staff couldn't find booking (don't know who was to blame for this - we had a written booking form). We were quickly given a room, but unfortunately the bathroom had not been cleaned - the rest of the room had. We called Reception who put this right immediately - the cleaners were apologetic and throughout our stay always friendly and helpful. However, naturally, we were beginning to think we should have listened to the reviewers who did not rate this hotel - and we were to be there for 3 nights!! Fortunately nothing else went wrong - we had a reasonable sized room, no view - we weren't bothered as only sleeping there and the rate we paid was low - very clean and comortable room, good TV and channel choice, excellent air conditioning (we thought it was ok first night but the hotel clearly didn't - on return to the hotel they had installed a new unit - it made quite a difference - well done) and clean towels every day. We used Moxy's bar a couple of times - very friendly staff - didn't have a meal there but what we saw looked good. This hotel is very convenient for downtown and the harbour and within easy walking distance of the football and ice hockey stadiums as well as the science world/omnimax (a great place for kids of all ages - and adults!!!). The lifts are often mentioned in reviews and they can be extremely busy at times causing a wait - but they are ok and the key card access to fall floors gives some added security not found in many upmasrket hotels apaprt from business floors. Checkout was very efficient and a taxi to the airport (more efficient than a 6-block walk to theairport shuttle bus - taxi cost CA$30, Airporter bus CA$27 for two). We were pleased to see the building of a direct train link to the airport, due to open in 2009 - a good spin-off from the 2010 Winter Olympics I guess. Lots of new building in Vancouver since our last visit 10 years ago but still loved the city and its surrounding area. I agree with some other reviewers that there are more vagrants/beggars than we are used to and could be off-putting if anyone felt vulnerable - I note the BC Premier promises to improve the position - he really needs to. Gastown, for example, is excellent but you don't have to stray far away from it to find the seedier side of the city - a pity. With a bit of thought and care there is no need to have any worries we thought. I am sure there are many better hotels in Vancouver than the Sandman but doubless many worse. Overall, we are satisfied that we got good value for money and weren't disappointed, given the low rate for our stay. And the city remains wonderful!!", "Date": "August 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Kamloops, Canada", "Title": "“Great location for concerts--Rooms need improvement”", "Author": "cynlouhoo", "ReviewID": "UR18988829", "Content": "Frankly, based on the reviews, I hesitated before booking this hotel. However, we are not exactly wealthy, and our fave concert hotel--The Georgian Court, has recently raised rates to what was outside our budget. Anyway, I think our room was in the South Tower, but I am not positive (building looked old). The room was small, but reasonably decorated. The balcony area was gross and looks as though nobody ever cleans it. There were cigarette (and other) butts, beer cans, and a used face cloth out there. Yuck! The bed was comfy and we don't seem to have fallen prey to bed bugs- thank goodness! Upon check in the pillows were not even on the bed, so the maid must've forgotten to complete our room (hopefully the sheets were clean). The bathroom needed a spring cleaning (grout dirty) and the blow dryer wasn't properly secured to the wall. On the plus side we liked the shower head and water pressure, and of course the curved shower rod. We probably won't return, since for way cheaper we could have stayed at the YWCA hotel for a very similar room (but cleaner).", "Date": "August 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wales, United Kingdom", "Title": "“Missing it already!”", "Author": "MissKitty08_8", "ReviewID": "UR18783932", "Content": "My mum and I stayed at the Sandman hotel for 2 weeks in a twin bedroom! The size and the layout of the room was perfect! We also had a gorgeous view from the window (which was huge) of North Vancouver, which included Grouse mountain! It was easy to identify Grouse mountain at nightime as some of it was lit up. The layout of the bathroom was ideal as well! When you walked into the bedroom, there was a small archway on the left hand side to enter the first part of the bathroom! Here you had the sink, folded ironing board and a rail for your clothes. You then went through a door to get access to everything else! This was ideal because if I was having a bath, my mum could still use the sink for whatever! All staff were lovely and helpful! Whenever we bumped into any of the reception staff or maids in the corridors or in the lifts, they always smiled and said hello! Brilliant location as well! Robson St was parallel to West Georgia so it took us no time at all to get there and about 5 minutes to reach the shopping area! Pacific centre was also a 5 minute walk on West Georgia! Chinatown & Gastown were also 5-10 minutes away! If you don't fancy having breakfast in the hotel there as some good places nearby! 'The midnight garden' (I think that's what its called) was a cafe on West Georgia and took about 3 minutes to walk down to. Lovely food and reasonably priced! Then on Robson, you had McDonalds, Subway and another cafe which specialised in crepe breakfasts! Other conveniant places within 5 minutes walking distance from the hotel - post office, sky train, bank and drugstore! The little things worth saying - free apples at reception, touch screen tv in the lobby which gives information on everything from attractions, shopping, restaurants etc and a self check in service! I had such a brilliant two weeks in Vancouver and would definetly stay at the Sandman again! The only complaint that I have is that the lifts were really slow sometimes, but thats nothing major! Hope you enjoy your trip :)", "Date": "August 9, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "dublin", "Title": "“the most unhygenic hotel I have ever stayed in”", "Author": "holiDublin", "ReviewID": "UR18644377", "Content": "My wife and I stayed at The Sandman Downtown vancouver in April of this year whilst on honeymoon in the States first we spent a few days in New York, then a week in San Francisco and a week in Vancouver while the other destinations were flawless The Sandman was an utter disgrace to be graded a 3 star hotel and unfortaunetly have to say it was an honest reflection of downtown Vancouver n(miserable, and dirty) on the night we arrived we had booked a Queen size room fully aircon and to what we expected a good standard. we arrived at 1.30am were greeted by night manager checked in quite promptly all seemed ok if you turned the lights down ignored the fact the front doors had an out of order sign please use side entrance and the rotten apple core,s sitting on a table in the main foyae. at this stage we were already thinking uhh.. as we were tired we proceeded to our room on the 8th floor assisted by the porter who brought up our luggage, we entered our room and without even turning the light on could see a crubby chair that resembled something out of a tip that had been fire damaged, turned lights on and looked around rest of room the bathroom well lets just say its just aswell I am not over 10st with a 30 inch waist otherwise I was in trouble. you could have had a shower reamained sitting on the toilet and had a shave in the sink all at the one time. that was assuming you did not mind other peoples hair all over everything you touched, the bed sheets had cigarrette burns and dirt stuck to them and when we pulled them back we found more hair and stains on sheets, with this we phoned the manager and asked for a clean room as this one was of dismal standard and above all filthy, he apoligised and brought up the key to another room on a lower floor and was also a corporate suite on the corporate side of hotel, with that in mind we agreed and moved are luggage to our new room and surprise surprise if I had have booked and paid for a corporate room I would have been disgusted I was not but we were equally disguted at standard, filthy couches, carpet bed sheets with burns the usual at this stage and hair every where, I picked up the phone and once again asked for the manager to come up to our SUITE and see what he had expected us to stay in, there was a clump of hair the size of an average Gerbal on the floor by the bed the bathroom had hair stuck to tiles mirror and toilet seat, I should the manager and he did not comment to much but said he had another suite free and would check it personaly himself to ensure it was clean before showing us, he did this and returned briefly to show us room at this stage my partner wanted to check out to an alternative hotel but given that it was around 3am it was to late, I went with manager to other room and had a quick look in bathroom aswell as pulling back bed sheets and that was enough of that, I showed him what he had just deemed as being clean and left him speechless, we stayed in the first suite sleeping sitting up on chairs as we refused to sleep in someone elses hair. Following morning we approached a different manager and she apoligised over what happened and ensured our room would be deep cleaned and she would oversee it personaly and offered to give us half rate which we declined stating all we wanted was a clean room which she agreed and gave us assurances it would be sorted, We had not unpacked any of our stuff at this stage and just freshened up to head out for day with the knowledge our room would be cleaned and that left us a bit more comfortable, the clump of hair i had left in the drawer beside bed if I must say dileberatly to see how thorough the room was cleaned and to my own surprise was shocked to find it remained in the room that evening when we returned along with a bottle of wine and an apoligy, on our departure from the hotel I handed an envelope to manager who had said she would supervise the cleaning of the room and explained it had been left in the room through all the supposed cleaning that had been done in room, I also told her that I am by profession a Manager of a 4 star Hotel in Ireland and the main area I am responsible for by choice is Health and Hygiene and theirs I found to be a disgrace, Thank God once you go outside the downtown area of Vancouver that makes up for it, I have to say it is Sp[ectacular", "Date": "August 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Victoria", "Title": "“Disco nearby !”", "Author": "fiftysix01", "ReviewID": "UR18255868", "Content": "Not on the airporter bus route anymore, meant a taxi ride. Room adequate to good, but on a front corner across the road from a Disco. They even \"performed\" on Sunday. Beware. Parking lot opposite not noisy. Beds firm and wonderful after a long flight and next days. Shower super, and we stayed under for more than 3 minutes and felt guilty, coming from a drought city. \"Scone Witch\" for breakfast as recommended by a previous adviser was just that a scone with a little egg in it. We didn't do it again. We allowed time for the lifts, thanks to previous advice. Front of house very helpful, as cleaners. Nice to hear an Australian accent on our arrival. Good blackout drapes worked to stop light in longer days. Restaurant attached to hotel easy and efficient. Nice meals, good selection. Public transport close {one or two blocks} and easy to use. Should have asked for courtyard room, when booking and would have no complaints.", "Date": "July 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Okotoks, Canada", "Title": "“Ummmmm”", "Author": "rsnowNorthDevon", "ReviewID": "UR17919868", "Content": "Finding the way in to the entrance is one thing let alone the underground parking! We did it! We had 2 rooms for the 5 of us, 1 with a view of a concrete wall and the other great..not very clean , dreadful bathroom .. grotty...tiny..on plug air con not working properly... seemed slow to help, stinky pool... ate at Moxies the restaurant in the Hotel always been a good bet, not this time! expensive and poor quality...", "Date": "July 15, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London", "Title": "“Don't do it......”", "Author": "smam2001", "ReviewID": "UR17396755", "Content": "Unexpected we needed accommodation in Vancouver , we were limited on availability and ended up at the Sandman Hotel. The rooms were dated and the beds uncomfortable, we spent two nights without hot water as the whole of the north tower had plumbing problems . I didn't find the staff very friendly and reception was always just full of suitcases from the coach parties that arrived daily . Best thing about this hotel was the view from the room.", "Date": "July 1, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Rooms": "2", "Location": "2"}, "AuthorLocation": "crieff scotland", "Title": "“No Way!!”", "Author": "mac1CrieffScotland", "ReviewID": "UR16946579", "Content": "We stayed 6 nights here and can't say much good about any of them. I had booked a twin room and we were given a double. This was rectified the next day but the room was the same tired, decor as Calgary. The check in manager was at pains to tell us that it was still a family owned chain. Well it's time the family tried staying at some of their hotels. The bedside lamp was faulty but the girl who came to check it said just give it a wiggle!! The towels you could spit through,the decor needed an uplift more than me and all together we were glad to go. Incidentally we found Vancouver had a lot of down and outs, a couple of whom bedded down close to the hotel.", "Date": "June 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manchester, UK", "Title": "“This is a classic 3 star hotel”", "Author": "andy1881", "ReviewID": "UR14690516", "Content": "I stayed here for a week with my wife and in-laws and can't really fault the place. The front desk staff were very friendly upon arrival and this continued throughout our stay providing some useful recommendations on places to eat. I found the rooms to be pretty spacious and extremely clean throughout. Our 'double' room had 2 queen size beds. Ask at front desk if you need Internet access and they will provide you with a box for your room, alternatively there is free wireless access in the lobby. The bars and restaurants in the hotel are really comfortable and serve really good food. The hotel has a good aspect looking towards North Vancouver with big windows and plenty of light in the rooms. I recommend asking for a north facing room on the 10th floor or above for the view although it isn't as good it used to be with the ever-heightening Vancouver skyline. The only negative points I would make are the rooms (especially bathrooms) could do with a little decoration and updating and the pool area feels a little run down being the only part of the hotel which felt slightly less clean.", "Date": "March 31, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "1.0", "Value": "1", "Location": "3"}, "AuthorLocation": "Vancouver", "Title": "“Sandman is a Dive”", "Author": "sk8tiki", "ReviewID": "UR14117306", "Content": "Sandman Hotel Vancouver is a dump. Lets get this clear right now, they have given us tonight’s stay free with a promise of changing our room in the morning and charging us $130 per night rather than the $175 they tried to charge for this dive of a cramped room. Let me start. The first thing noticed upon entering the allocated room is the strong smell of fresh enamel paint on the bathroom door, which was recently painted, reeked of paint fumes and not appropriately signed “Wet Paint”. Do you know how hard it is to remove enamel paint from your hands let alone clothing? Now using water and soap to do this is a time consuming process; but at the Sandman it is a painful process as there is no hot water. That is right, NO HOT WATER. At Midnight the gent on the front counter told me this problem had been rectified. However it is 6am now and there is only lukewarm water, not warm enough to use. Now I am not up early in the morning – I am still up late in the night; as it seems noise plays a big factor in ones inability to get some rest. In this case we had to sleep with the window open so as to get some fresh air and rest from the paint fumes. However I have coughed all night in reaction to the fumes and now have sore throat and headache. Not to worry, nothing a hot shower and glass of juice wont fix, ha ha; shower, yeah right; well at least I can still have my cold glass of juice; WRONG again as the room doesn’t come with a mini fridge. (apparently there aren’t enough for every room) Which is sad, I did bring juice and milk, oh well I can drink from the carton. That’s how you do it in cheap dodgy hotel/motels, plus the open window in middle of a Canadian winter has helped to keep the drinks and us freezing cold. Mmmm decor and presentation - well I am quite sure the photographs speak for themselves in this one. The wallpaper would have made my Great Grandma excited (during the depression). The beautiful use of British racing green splattered on the bathroom door to cover a very poor repair job where the door has had a hole kicked in, helps to create a sense of claustrophobia in the 1.5m x 2m bathroom, doesn’t even have soap holders in the shower. Perhaps a dropped cake of soap caused someone to slip and put their foot through the door while they were having a cold shower. Actually they could have just slipped on the wet floor; the first thing I noticed when I ran the shower for 10 minutes at Midnight to see if the water would heat up, was how water manages to make its way directly to the bathroom floor, from there the water has nowhere to go as there are no drainage points. Not to worry, we are all adults here - we can just mop it up. Providing one of you is willing to forfeit your cold shower as there are no extra towels. Now my colleague actually seems have fallen asleep; which is a problem as I need to quietly sneak over his side of this shoebox to lodge this rant for publication. Would you believe that the power point on this side of the room doesn’t work. I should just be thankful that we now have Internet access in our room; initially we were informed that if I wish to use the internet I must do so in the lobby where they have wireless. If you do come here, please whatever you do, only come here for the most amazing restaurant “Moxies” is it great, or to party in the downstairs night club. Think hard and long before staying at the Sandman Hotel Vancouver. Sandman Hotel = 1 star.", "Date": "March 7, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "sydney", "Title": "“cheap and nasty”", "Author": "stillatit", "ReviewID": "UR14076915", "Content": "The only thing going for this hotel is its position within walking distance to Gas town ,China town and Library Square. The rooms are shabby although ours was clean. The heating was inadequate! ! The staff were not interested in rectifying the problem and on the whole were a surly bunch . Moxies was very expensive and the food only adequate and inconsistent. Ordered a steak sandwich on two occasions , one was delicious and the other almost inedible due to overpowering sauce over the whole thing. The hotel was very noisy. Loved Vancouver but would never stay at this hotel again.", "Date": "March 5, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "sydney", "Title": "“pretty average”", "Author": "tobey4", "ReviewID": "UR11518475", "Content": "room was small and cramped. had to line the bags up against the wall as no where to store them. bed was OK. seemed to be at the wrong end of town. Hard to find way into the restaurant.", "Date": "December 13, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Portland", "Title": "“You pay for what you get!”", "Author": "PDXPortland", "ReviewID": "UR11460981", "Content": "Booked through an airline website - before reading the reviews! Location was convenient - check-in was very quick and efficient and it was good to have secure parking. The lifts worked well for the majority of the time - you have to use your room card to make the lift work. The pool was cold, but seemed clean enough. The room was a double - a bit small - but then for $84 a night inc. all taxes etc I wasn't expecting the Fairmont. The room was cleaned well each day by friendly staff and the beds clean and comfortable. There was a hockey game on so we expected some noise, but this didn't transpire. Overall - a good experience and I would probably stay there again.", "Date": "December 10, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Seattle", "Title": "“Sandman Downtown Not Recommended”", "Author": "jkelly", "ReviewID": "UR10924834", "Content": "This is a generally cramped hotel with small halls, elevators, and rooms and disappointing maintenance of in-room bathrooms. The rooms were also quite loud with noise from the streets below as well as other rooms and the hallway. Check-in/out lines were quite long which may have been due to the BC Lions game but painful regardless at >10 minutes. This was definitely not worth the average room rate.", "Date": "November 19, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Seattle", "Title": "“The Hotel from Hell”", "Author": "BlearyTraveller", "ReviewID": "UR10483812", "Content": "This hotel is a disaster. Our room was cramped. The windows had bird doo on them. The air conditioner was functionally unuseable. the staff was rude and surly. The elevators jammed. The pool was unheated; it's tiles cracked and dangerous. I had no resolve by the head company who were equally as dismissive and condescending. I would never stay in a Sandman Hotel again. They stink big time!!!!!", "Date": "October 31, 2007"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cheltenham, England", "Title": "“good value cental hotel for exploring most of Vancouver”", "Author": "robingirl60", "ReviewID": "UR8885192", "Content": "We stayed here for 3 nights in September 2007 and could not really fault the place. The room we had was clean and spacious with a huge comfortable bed. Can't comment on the food as we did not eat there at all (prefering to take our breakfast with the locals at \"Rosie's on Robson\"). Also we didn't use the pool (didn't have time!). The location was great for walking to the shops, restaurants, museums, Canada Place, The Lookout, Gastown, Chinatown, etc and little ferry boat to Granville Island. A bit far to walk to Stanley Park but easy to get a bus or taxi. The Shark Bar attached to the hotel was a very busy sports bar (full of TV screens and ice hockey supporters) so if you haven't been to a US/Canadian sports bar, I'd recommend taking a look. Overall a good value central hotel, as good as 3 * hotels in London, and about half the price! Why do people find so many things to complain about???", "Date": "September 24, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Gainesville, GA", "Title": "“Pathetic”", "Author": "Bantryb", "ReviewID": "UR8726258", "Content": "All right, so you book a tour and are assured that 3 star hotels are used. You know you're not going to get the Ritz, but this doesn't even remotely qualify as a 3 star hotel. Traveling with a group of 22, staying 1 night before going to Vancouver Island and 3 nights on our return. We must have played musical rooms with a third of the rooms in the hotel. First caution - many, if not most of these rooms are so run down that you are reluctant to place your head on the paper thin pillow for fear of what might crawl out of the woodwork. Mildew and mold in all 3 rooms I stayed in (similar experiences by my other travelers) bathrooms in most of the rooms so small that you can not shut the door and sit on the toilet (not suitable for large men or women) 1 bathroom was a decent size. Towels threadbare, peeling wallpaper, beds like rocks, cigarette butts all over the balcony floors. . . need I go on? Moxie's restaurant food was decent, but they were always short of wait staff. On the morning we were to leave 3 couples arrived 1 hour before we were to depart, only to be told (after a 20 minute wait for a table ) that there was no chance that they would get their meal on time before we were to leave. Avoid this hotel. Vancouver's a charming city, but unless you're going to the dome next door and don't care where you sleep, this hotel will definately damper your impression of a lovely town.", "Date": "September 16, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Convenient location”", "Author": "quicktravel", "ReviewID": "UR8725800", "Content": "After reading the reviews on this hotel, I was very skeptical about what to expect. I was pleasantly surprised when we got there. We had a nice room in the North Tower ( a higher floor would have been better) and the amenities were quite acceptable. We enjoyed the Bar and I had a good breakfast at Maxis. You might have a longer wait there over the weekend. I thought the staff were very courteous and the location was close to lots of activities downtown. Just be careful not to go near the empty public parking lot next to the hotel after it is dark as there are some undesirables in that area. We enjoyed everything else in the hotel. The elevators worked well too.", "Date": "September 16, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "The North of England", "Title": "“why the bad reviews?”", "Author": "sample_city", "ReviewID": "UR8676814", "Content": "Stayed at The Sandman July/Aug 2007 for 8 nights yes the room was basic, but it was the cheapest hotel our travel agent offered us! yes the 2 lifts are slow, but hey! com'on! We personally found all the staff (from cleaners to reception) very helpful (especially Jesse on the front desk) The location ideal, within walking distance of everypart of Downtown Vancouver, Stanley Park, Gastown & the main bus/train terminus Didn't think much of the breakfasts/service at Moxie's but can recommend The Whitespot 5mins up Georgia Strongly recommend for food/drink/service in The Shark Bar next door 10/10!, altho it does get very busy when The BC Lions are at home Cannot understand the bad reviews! If you want to 'do' Vancouver on a budget, this IS the hotel for you!", "Date": "September 8, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "NY", "Title": "“Very Disappointing”", "Author": "Terpla", "ReviewID": "UR8606815", "Content": "This hotel was part of our tour package and I must say was below average for the level of hotels this tour company usually uses. When I arrived at the hotel there was newspapers and garbage right in front of the door and no one cared to clean it up for at least 2 days. It made a terrible impression when getting out of the cab. The room though large enough and clean enough was rather drab. We had breakfast in their restaurant Moxie's included in our stay and it was good. The location was good for walking to Gastown and the museum but you are at the end of Robson street and there was nothing but fast food restaurants on the street. Not at all close to the shopping area. Even the location was drab. I don't know what the price of this hotel is since it was included in our tour but I would look for a better hotel than this one.", "Date": "September 2, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Hereford", "Title": "“What a dump”", "Author": "HerefordDrinker", "ReviewID": "UR8539330", "Content": "This place has got to be the worst i have ever stayed in. The rooms were tatty,unclean,bathroom filthy and the staff were as much use as chocolate ash trays on motor bikes. Nothin going for it. NEVER AGAIN", "Date": "August 29, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Farnham, UK", "Title": "“OK, but not exactly great”", "Author": "PaulFarnhamUK", "ReviewID": "UR8372108", "Content": "Room was ok (Standard Room), but old beds and old bathroom. Also the Air con didn't work very well, so room was too warm (but it was unusually warm weather). Swimming Pool was terrible - very old and scruffy. Breakfast place was very good and very good value, also good for Lunch and Dinner.", "Date": "August 8, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "The Netherlands", "Title": "“Waiting and waiting for the elevator”", "Author": "gente", "ReviewID": "UR8284008", "Content": "My family stayed with a group on our tour here for 2 days. It is a hotel with very many rooms but only 2 elevators. We waited for 15 minutes by the elevators when we arrived and on other occasions they were always packed with people also. The 3 persons room was not for 3 persons, but only for 2. There were only 2 towels and when we asked for more, we had to look for those towels ourselves in the TVcabinet. Although we asked for a breakfast at a normal time when we had a day of rest, we had to breakfast with the group at 7.00 AM. There were no spoons or knives enough. We will not recommend this hotel.", "Date": "August 3, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "San Francisco", "Title": "“Pathetic and overpriced”", "Author": "SFTraveler11", "ReviewID": "UR7924071", "Content": "I was staying here for a sporting competition with my team and had a horrible time. First, my roommate and I paid for 3 nights in a room with a queen sized bed, and got a double. Second, we were by a stairwell, which wouldn't ordinarily be a problem, except that the elevators are ridiculously small and slow and most people just decided to take the stairs... which had a loud and heavy door that banged as they exited. Thirdly, I only recall one shower with water temperature that was above luke warm, and when I was done my 5 minute shower, the water was back to lukewarm for my room mate. This was incredibly irritating when you want to clean off after a sweaty race. I felt colder after having showered. Oh and the fire alarm that went off at 1:45am on Sunday night was absolutely delightful too. Not that I could sleep much here on the other nights...", "Date": "June 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Don't listen to the bad reviews!”", "Author": "jennifer0001", "ReviewID": "UR7855741", "Content": "I was a little nervous because of some of the reviews. We had a perfect stay, start to finish. The front desk staff were very friendly and accomodating, the room was clean with a wonderful view of the water and downtown Vancouver, and it was walking distance to Gastown and Davie Street. The elevators were a bit small and slow; but, really, if that's the ONLY complaint about a hotel, they're doing SOMETHING right! I'd certainly stay here again!", "Date": "June 16, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "loopyloo67", "Title": "“Not the greatest”", "Author": "loopyloo67", "ReviewID": "UR7853141", "Content": "Stayed here for 1 night en route to Banff and had already paid for 2 nights before flying home. The hotel is very old and dated, the reception on the tv is hit and miss so don't bother paying for a movie. The tiny bathrooms need a good re-grout. Most of the hotel staff were friendly and helpful. Last 2 nights we were \"upgraded\" to a king room which was no different just had a king bed with 2 mattresses on it. For the odd night its fine, a great Moxy's on site and the tram right outside - good for shopping. Good for an odd night but not for indulgence or a treat. Better area is nearer the tower.", "Date": "June 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“Ist Rate Service”", "Author": "Happypat", "ReviewID": "UR7852494", "Content": "We arrived after 10 hour flight from England exhausted but excited to be in Vancouver on our hols. Taxi from airport $24, pretty reasonable. Checking in was swift and staff very helpful, we were suprised when staff said we'd been given a up-grade, all the itinary we had was \"double -room\" from Travel Agent.Our up-grade was superb.....king size bed, suite with min-bar, huge bath-room....fantastic view, what a wonderful start to out holiday. We were up early next day exploring Vancouver, The harbour is a beautiful area in morning and we took aqua-bus to Granville Island,had brilliant day there (huge market) and fabulous lunch, sea-food platter ($30 for 2 !!). Nighttime we stayed in hotel and went to Sharks bar....we didn't stay long as it was crowded (big boxing match on TV). Next morning we went shopping, walked to Gas town (very touristy) extremely crowded. At night we went to chinese restaurant not far from Hotel.......another suberb meal half the price of England !!! ( boy were ripped off in England). Next morning we packed and had thoroughly enjoyed our stay in hotel and come back again...pity it was short......but the real purpose of our holiday just beginning....later that day were we going on cruise to Alaska for seven days....... and WOW what a holiday that was...............absolutly fantastic.", "Date": "June 15, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“would not recommend”", "Author": "kiwitravellers07", "ReviewID": "UR7796917", "Content": "we stayed for a total of 3 nights at the Sandman pre and post a coach tour. the hotel is very tired, the rooms are dark and the hotel is noisy. For our first night we were on the 5th floor and were kept awake most of the night by the sound of metal scraping on metal in the lift shaft (we were directly opposite the lifts), the ice machine and noise from the bar downstairs. we had just spent 3 nights at hampton inn one block away and to give you an idea of just how bad we thought the sandman was we tried to get a room at the hampton for our 2nd night even though we had paid for the sandman as part of our tour and would effectively be paying for 2 hotels, unfortunately the hampton inn was full but we did manage to change to the 7th floor for our 2nd night and were at least away from the lifts. we stayed again at the Sandman mid May, this time we were on the 8th floor so away from street and bar noise. There was a large group of people in wheelchairs staying at the hotel and there was a sign up requesting that people be patient as the lifts might be slower than normal due to the number of people using them (during our time at the sandman we found the lifts to be slow at the best of times). the morning we were to check out 1 of the lifts had people stuck in it which meant only 1 lift was operational. after waiting for a long time for the lift to arrive when it did turn up we found it was full of people riding up in order to go down again so we ended up having to carry our heavy suitcases down 8 floors. my overall impression of the Sandman was that it is dark, noisy and very tired, rooms were clean enough but very basic and the decor could do with being replaced, I would not stay there again and would definitely not recommend it. our travel agent had quoted for both sandman and hampton inn for our 3 nights pre tour and the hampton was substantially cheaper and i can not figure out why the sandman is dearer. given the choice i would pick the Hampton inn", "Date": "June 7, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "brisbane", "Title": "“Fine for a few nights”", "Author": "navaro", "ReviewID": "UR7706719", "Content": "Have just returned from a one night stay at Sandman, the first night of a tour. Hotel better than expected as popular with tour groups. Good central location. Good view from room and plenty of space, no cooking facilities except coffee maker.On a main road so busy and a little noisy, especially on hockey nights at stadium very close. Ate at the restaurant. Food OK nothing spectacular. Much preferred Rosie's on Robson Street around the corner. Sandman is fine for a few days stay.", "Date": "May 28, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "campbell river", "Title": "“Horrible!!”", "Author": "jh23_07", "ReviewID": "UR7271986", "Content": "This hotel is horrible. My boyfriend and I came to vancouver from the island to see a canucks game. We called 2 months before and booked a room with a queen size bed.Which we didn't get, instead 2 doubles. Friday night, we arrived late, woke in the morning to housekeeping, at 9am... then maintenance knocked half an hr later, we sent him away because we were sleeping, had a late night. Then half an hr later he came back! You could hear him drilling in the hallway since 8:45am!! Then saturday night went to the canucks game. Sunday morning we wake to so much noise in the morning, house keeping....again. The pop machine all night making noise. The Shark club below is loud at night, because it is in the same building. Sunday we checked out, walk to the underground, \"SECURED\" parking to go to my car... and found it had been broken into. stereo gone! 200.00 worth of clothing.. gone! Front desk didn't do much. Told them what happened they just handed us a form called a number for us to report the robbery. They weren't very helpfull at all. There is no security cameras, the gate opens for anyone, all u have to do is push the button to open it. There was no security guards anywhere, except when we checked out, there was a young man about early 20's standing behind the front desk! This is a horrible place! Do Not Stay here!!! Also talked to 3 other people who got broken into at the sandman the week before!! Oh and we had NO room service!!", "Date": "April 2, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Scotland", "Title": "“Great location for hockey”", "Author": "LargsEagle", "ReviewID": "UR6941389", "Content": "Six of us stayed at the Sandman in downtown Vancouver. Our reason for visiting the city was to watch the Vancouver Canucks ice hockey team. The hotel staff were all very helpful and professional in every way.The rooms were clean and well equipped/furnished. The sports bar \"Sharks\" was popular with guests and visitiors alike. The hotel was approx 3 mins walk to GM Place, home of the Canucks which meant not having to wrap up to attend games. It was also handy for all the shopping areas etc in the city. We never ate in the hotel but used a nearby diner called \"Rickys\" where an excelent b'fast could be had. I would have no problem recommending the Sandman to anyone but particularly would recommend to hockey fans for the convenience if nothing else. We will use the hotel again if we're back in Vancouver.", "Date": "March 9, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Lancashire. England", "Title": "“Good Value for money”", "Author": "missfogg", "ReviewID": "UR6910141", "Content": "Stayed just 1 night at this hotel in Sep 06. Quite basic accommodation but happy with it for the price. Bathroom tiny and room smelt of cigarettes,was supposed to be non smoking - it came to light that there was a vent in the bathroom and this is where the smell was coming from. Has drinks machines on every floor. Lifts go wherever people press the button so you could end up spending the day going up and down the hotel so my advice would be to just use the stairs! Beds were clean, curtains were a horible red velvet and looked like they hadnt been cleaned since they were put there! Tv in all rooms Reception was tiny and had to wait a while to be checked in as this hotel is used for people on touring hoidays. Moxies restaurant on site, service quite slow but friendly. location is good, isnt really worth paying the extra $200 to stay in a better hotel as its more than likely going to be on the same block. Parking is also available for $10 per day. Be careful if out and about alone at night in this area, some unsavoury characters about!", "Date": "March 4, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Halifax", "Title": "“Thanks for the great stay.”", "Author": "Duckybean", "ReviewID": "UR6833484", "Content": "Biggest pro about staying at this hotel was the staff. Despite being super busy at the time of check-in, the lady who recieved us was amazing. Sooo bubbly and energetic. She pointed out the best little haunts to visit, and funky places to eat. She went that extra step and spent time with us when it could have been so easy to just dismiss us as yet another number. Made us feel very special. Our room was quiet and snug. SUPER close to our concert hall. Amazing location. It was a quick jaunt across the street, and close to some great shopping too. Cons? The elevator was a bit slowish. Break out those leg muscles for the steps if you're in a rush! But really, the staff we encountered here are what will bring us back again given the opportunity.", "Date": "February 23, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "5", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "BC", "Title": "“Cheap Rate = Cheap Room”", "Author": "angel000", "ReviewID": "UR6832797", "Content": "We got a really awesome rate price, but a horrible room. I guess that is what happens at Sandman when you get a cheap rate they give you the cheap rooms. We had a nonsmoking room that smelled like old/rotten ash tray, our windows had MOLD all over them, our bathroom door had a huge whole in it from being kicked in, and we were placed right beside the elevators, and drunk people coming off of the elevator at all hours, and someone pulling the firealarm. After reading all the reviews on here I was very concered about all the BUG issue, so I contacted Sandman Inn and they offer me a complimentary upgrade, which they NEVER WENT THRU WITH. I think I will go back to the Holiday Inn", "Date": "February 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Langley", "Title": "“Super!-What bed bugs!?”", "Author": "madonnaboy", "ReviewID": "UR6796767", "Content": "First of all-I stayed at this hotel, and I have never had a better expiernce! We checked into the hotel during a hockey night and it took us about 6-7 minutes to check in, but granted they had a huge line to check in, and all staff were going full tilt! I got to the desk, and the gentleman (i believe his name was Peter) was great-he got me upgraded to a king size bed for my anniversary-very impressive. We ate at the restaraunt upstairs (don't remember what it's called) and found it to be quite nice. I would certainly recommend this hotel and will deffinatly be back! Just a note about the comment earlier regarding bed bugs--If they would take the time to educate themselves on bed bugs, they would find that it has nothing to do with cleanliness of a room/house, and that all hotels from your basic hotel to 5 star hotel are affected by this (see the Province Paper-they did a story on this a couple of months ago!) Anyways-we had a great time and look forward to coming back!", "Date": "February 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "East Sussex, UK", "Title": "“GREAT!!”", "Author": "SussexBoyEast", "ReviewID": "UR6010691", "Content": "Stayed here from 2nd to the 12th October 2006. It was great, this was my first major holiday with my girlfriend and we loved it. Everything was clean, staff were polite and the rooms were comfortable! It had a good location i thought as everything was in easy walking distance of about 5 mins obviously depending on where u want to go! A big plus side for the hotel is that is has the Moxies Bar and Grill and the Shark Club Bar and Grill as these two were both extremely good for food and drink!! Of course if u wanted to venture out in the evening for a restaurant then u could but if u didnt want to, then all u had to do what go down a few levels from your room via the lift. The only very small complaint i had was that the windows were pretty thin so i could hear a lot of traffic at night but i would expect the higher your room the less you would hear! Besides your in the middle of a city so i didnt expect to have quiet traffic!!!! If i went to Vancouver again this would definitely be on my list of hotels to look at as its very reasonably priced and i liked its location! Highly recommended!", "Date": "October 25, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Seattle, WA", "Title": "“So-so”", "Author": "Misfit22", "ReviewID": "UR5832914", "Content": "I recently stayed at this hotel as it was the location of an out of town seminar. I would have chosen otherwise, and if I had realized how close the Hampton was to this I would have booked there and walked a block to the seminars/meetings I attended. The rooms are small, dark and cramped. The dark woodwork and wallpaper don't help the feeling of being cramped. Housekeeping was very sloppy, I could spot dust everywhere. The beds were hard and the measly pillows were foam. The bedding had definitely been around for a few years. The towels were skimpy and very very thin. I can't comment on the hotel's main restaurant, I never used it. There is a Shark's bar in the building and their food, drinks and service were outstanding. The hotel's catering was alright, nothing to write home about. This hotel is clearly used by tour companies, as you could see groups of travelers arriving enmass. Location, yes it's downtown - about one block from the library, but to get to the heart of downtown and the shopping districts and restaurants you're going to have to hoof it. The hotel's website calls the hotel \"centrally located in the heart of downtown\" NOT!! If you're traveling by yourself and don't like to walk the downtown streets at night (and yes there are homeless and beggars on your way to the main areas), you'll be captive to the hotel facilities. The hotel's website also states that they have fitness facilities, yet when I arrived I found that to be a separate business that was located in the hotel building. The hotel's guest information book stated to contact the front desk for pricing info to use those facilities. I would not recommend this hotel, and if you want to be in the heart of downtown Vancouver, go elsewhere.", "Date": "September 24, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Kamloops", "Title": "“Do not book this hotel!!!”", "Author": "CuriousGeorge77", "ReviewID": "UR5578691", "Content": "Booked well in advance for a family of 5 vacation for a 4-night stay the long week-end in August, 2006. The rooms were small and cramped. We were initially given a room with one King size bed and a couch pull-out bed that could sleep only one person. The pull-out was filthy! The bedding had not been cleaned from a previous guest! The front desk personnel did not express any concern and were not very accomodating. The answer we were given when we expressed our concerns was that every hotel in Vancouver was booked and that was the best they could do. We requested a suite which we were finally provided on the second day, but not without some arm twisting. DO NOT BOOK THIS HOTEL.", "Date": "August 8, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "2", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Boca Raton, Florida", "Title": "“don't stay here”", "Author": "sabrina_lane03", "ReviewID": "UR4774163", "Content": "The sandman on west Georgia was horrific. It is at least 7 blocks from the heart of downtown. To get there you have to pass vacant spaces and numerous quantities of homeless people. It is within 2 blocks of a YMCA and a building for homeless people which explains why I passed those individuals. Once I checked in there was a drunk individual just standing in front of the elevator not moving. When I got off of the elevator I noticed that the hallway was just wide enough for my bag to roll through. The room was equally as small. The bed was only around four inches short of being as wide as the room. The walls however were the worst aspect. At 1AM I was woken up my drunk people outside of my room. From 2-2:45AM I was again woken up by the noises being made by the people in the next room --. I kept calling the front desk and was informed that I could switch rooms if I wanted to. However, when I was checking out that morning, why should I be required to move. The front desk should have called that room and explained to the occupants that the room was paper thin.", "Date": "March 30, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Vancouver Island , B.C.", "Title": "“December 10, Andre Rieu Concert”", "Author": "szszszszsz", "ReviewID": "UR4240052", "Content": "I booked a room 1 year in advance, it was for Saturday, and with two functions happening that night it was booked solid. I called about 1 week ahead and thought I would book two nights, they wanted more money for the Friday, so I declined. When we arrived the line ups were rediculous , the parking signs were for 15 minutes for check-in, check in took about 30 minutes, then they had given up my room, I made it very clear that I was very angry they offered a smoking room for a few dollars less. The room stunk, it was on the street side, and only 3 floors from road noise, drunk patrons leaving the bar below, and yelling , doors slamming until about 0230. If you must stay here, they suggested to call and check but don't let the hotel say date and #of nights, but tell them yourself, get the name of the person you are speaking with. Take sedation and ear plugs. Take your own pillow and slippers. Don't take any nonsense and enjoy.", "Date": "December 13, 2005"}], "HotelInfo": {"Name": "Sandman Hotel Vancouver City Centre", "HotelURL": "/ShowUserReviews-g154943-d218446-Reviews-Sandman_Hotel_Vancouver_City_Centre-Vancouver_British_Columbia.html", "Price": "$98 - $188*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">180 West Georgia Street</span>, <span class=\"locality\"><span property=\"v:locality\">Vancouver</span>, <span property=\"v:region\">British Columbia</span> <span property=\"v:postal-code\">V6B 4P4</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span></span></address>", "HotelID": "218446", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/bb/9d/bb9d077cffc909fa3144e2a828ea3c8a3large.jpg"}}