{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Maine", "Title": "“Peaceful, relaxing luxury”", "Author": "gabbygrrl", "ReviewID": "UR126489614", "Content": "We recently enjoyed an overnight stay at this hotel. I loved the location, as we could walk to Quincy Market and many shops and pubs in between. The room was beautiful. I especially loved the bathroom layout. It was spacious and had a TV speaker so I could listen to the Bruins game while I took a shower. The staff was welcoming although I must say, I saw them tripping over themselves for some of the other guests. It would have been nice to have 'that' type of service but we were more than happy. The concierge suggested a wonderful local brunch place that we loved! Overall friendly staff, nice bar for a beverage (but not the best bar layout), relaxing rooms that are quiet and comfortable, and of course, the Ritz experience. Worth every penny.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Outstanding and Luxurious Service”", "Author": "Phil R", "ReviewID": "UR126070647", "Content": "I recently celebrated the international women's day with my significant other, by splurging and treating ourselves to a night at the Boston Common Ritz Carlton. When I called to make the reservation, the clerk carefully explained to me the difference between all of the rooms and recommended one with an awesome view of the city. The concierge recommended an outstanding high-end restaurant and offered to get us a car or a limo. We had interactions with two different concierges, two managers, and many staff, and were treated like royalty the entire night. The room was a treat. It was clean, tastefully decorated, big, and had amazing Boston views. We ordered a cheese platter from the room service menu and were delighted with selection of blue, brie and gouda, which went great with a bottle of champagne. If you are in Boston and are looking for a luxurious and special way to spend a night, the Ritz is it!", "Date": "March 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brookline, Massachusetts", "Title": "“BEST PLACE TO GET ENGAGED!!!!”", "Author": "Elina S", "ReviewID": "UR126070180", "Content": "This is the hotel to have the most romantic, fairy tale evening ever!! My (now) Fiance wanted to surprise me at the Ritz, but I later found out the staff accomodated his \"secret scheme\" by upgrading our room to the most breathtaking view of Boston. The concierge, managers and room cleaning were very courteous and all so positive and happy for me the morning after. Absolute best of boston, hands down (even if there is a ring on it!!!)", "Date": "March 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newnan, Georgia", "Title": "“Best city Ritz I have stayed in”", "Author": "rogerslb", "ReviewID": "UR125930262", "Content": "I've stayed here twice now during the past 2 months. As Platinum Premier was upgraded to the same end room with a great large window overlooking Boston Common. The front desk was always very helpful and I also like it when they say welcome back - in other words they had clear record of my recent other stay. Am surprised that ratings just average a 4 for the hotel. I found it to be the nicest city Ritz I have stayed at and one of the top overall non-resort hotels I have stayed at recently. My room was large, well-appointed and housekeeping services were very good. Bed was excellent and got very good night sleeps. Some reviews have complained about lack of traditional fancy Ritz dining options. I disagree and instead view this as a plus. There is very warm feeling bar and restaurant as part of the hotel. Bartenders are great, it's a social scene, and food is much better than most hotel places - encourage getting the daily special which on Monday's is a tasty Venison tenderloin dish. So overall strongly recommend staying here if you get and found that at times you can get a fairly comparable rate to less attractive lodging options in the area.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Wonderful place to stay”", "Author": "DWirt", "ReviewID": "UR125491670", "Content": "I enjoy staying here the night before my flights home. Convenient as it is close to Boylston Street and Boston Common. So easy to take a walk and tour the area. The more I stay there the more I enjoy it.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hartford, Connecticut", "Title": "“Loved, loved, loved the Ritz!”", "Author": "AnnGHartfordCT", "ReviewID": "UR125481784", "Content": "This was our second visit to the Ritz Carlton in Boston. My husband, son and I came to enjoy a long weekend in the city. Check in was smooth and quick. Within minutes we were relaxing in our room (we were upgrated to a suite!) Received A plus service at every turn: - Needed the sofa bed made up for my son ... two gentlemen were there in a flash to get it done and asked if there was anytrhing more they could help us with - Ordered room service for breakfast ... eggs, fruit, waffle were all delicious - Bell staff happy to get us a taxi and give directions - Late night room service hit the spot with soup, pizza and fries Our suite was beautiful and luxurious - the bathroom was so nice that I didn't want to go home! Kudos to the housekeeping staff as every inch of the suite was immaculately clean. We enjoyed our stay and look forward to coming back. Is this the best choice for everyone? Our room did not have much of a view, but we were out and about town most of the time in the day and did not miss having a view. The hotel does not have a gift shop, but there is a CVS drug store right around the corner (the same building) if you need any incidentals. These are the minuses we saw - not enough for us to look elsewhere.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Best Stay Ever!!”", "Author": "moacca", "ReviewID": "UR125205979", "Content": "Brought my son and 5 of his friend here for 8th birthday party, not only did they make last min special touches, cookies milk and child sized robes for each of the boys, but they also upgraded our room to a suite overlooking Boston Common, sent complimentary room service, balloons and popcorn/movie. Ashley D. Front dest agent and Michael B. Front house manager are phenomenal!! They really made it their priority to make our stay special. I cannot express how happy my son was to stay there. He never wanted to leave. My son loved the bath butler service, and they even sent him home with a Blue comfy Ritz carlton Robe and VIK pin! We will def. make this our hotel choice for all of our stays when in boston.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Not sure”", "Author": "mdlinda", "ReviewID": "UR124996495", "Content": "20$ for a glass Pouilly-Fuisse, a charge of 9.95 a day for Internet and a room on one side overlooking a gravel roof and Two double beds...not what you would expect from the Ritz..", "Date": "February 21, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "New York", "Title": "“This is not a Ritz Carlton.”", "Author": "Jenna181", "ReviewID": "UR123844261", "Content": "I frequent Ritz Carlton hotels. This was a joke. The positives: pretty lobby, friendly frost \"desk\" staff. Room was clean, pretty new, and nice. Typical. But, here's the negatives: absolutely horrendous service. This hotel is fused with a local, but nice, gym. There is NO ritz: gift shop, spa, or quality restaurant. The two restaurants on location are modern and in no way, up to par with a Ritz Carlton with respect to atmosphere. You barely see any hotel attendants unless you are right in the lobby area, which is extremely, extremely boring. The bar area doesn't open until 5pm, and there is nowhere to get a snack unless you go to the attached, non-ritz operated and very crowded gym establishment. In sum, this place felt like an older marriot or typical hilton city hotel, which was stamped with the Ritz logo in certain places and given a few cosmetic upgrades. It absolutely pales in comparison to the Four Seasons which is just a few blocks away. When I walked towards the Four Seasons: there were 3-4 doormen, a greeter, a TRUE front desk and concierge, not just two small desks like the Ritz, and I saw staff everywhere. Granted, this is not a resort, it is a city hotel, but there is no warmth to it. No charm, and having no RITZ-owned spa services just kills this place. Basically, you cannot sit at the hotel all day and relax, there is absolutely no choice of options, unless you want to sit in a boring looking lobby with minimal service aside from the concierge and front attendants who were helpful. Just an average place to stay if you need a room, but by no means a Ritz Carlton experience. Stay away, and go to the Four Seasons down the block. There is no question about that.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Longmeadow, Massachusetts", "Title": "“simply perfect”", "Author": "jk5817", "ReviewID": "UR123801019", "Content": "we spent the weekend at the ritz carlton in boston. It was a great experience from the moment we walked in the door. The staff was superb. Great location right next to the theater district,adjacent to the commons and in walking distance to all those shops on boylston street. LA fitness is adjacent to the hotel. They should make it complementary but minor issue. The restaurant had excellent service and food. But mostly it was the superb service that makes me recommend this hotel.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "shanghai", "Title": "“Great location, average service, small room, wicked-pricey parking”", "Author": "dannyrogue", "ReviewID": "UR123761835", "Content": "Anytime booking a Ritz-Carlton hotel there is an expectation of 5-star service, comfort and amenities, and while the Ritz-Carlton Boston Common is definitely a nice hotel with elegant decor and a great location, there seems to be something missing in the service category, not to mention that the room was quite small. Actually, the service at the hotel was totally acceptable, everyone was polite and friendly, but it didn't seem like the staff really went out of their way to help me out with my luggage, or with any local recommendations. They also were not the most proactive at offering an alternative to their pricey parking, leaving me to circle the block to find a parking spot. Either way, the hotel is still nice, and if you're a Ritz-Carlton Club member, I'm sure it's tops in Boston, but otherwise I'd look for a hotel with bigger rooms that offer a better deal on parking (which is super difficult to find in Boston).", "Date": "January 28, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Portland Oregon", "Title": "“A shame!”", "Author": "clydodo", "ReviewID": "UR123333736", "Content": "We arrived from Portland Oregon last week end after midnight. Nobody was there to take care of our luggage nor to open the very heavy doors. The doorman was arguing with another client! Same thing happened when we were leaving. The guy is arrogant, rude and there is nobody to tell him to do his job correctly. The food at the restaurant was heavy. On top of that the room had been prepared for a guy named Mohammed. There was a rug and a Coran to pray. Pretty weird. When we checked out, nobody asked us anything about our stay. They clearly don't care. Extremely disappointing. Far from a 4 or 5 stars hotel.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "NY, NY", "Title": "“One of Boston's best”", "Author": "morevacation", "ReviewID": "UR123106725", "Content": "I have stayed at the Ritz in Boston numerous times on business. It is an exceptional property with service to match. Their recent renovations to the restaurant/bar and commons area is also a very nice addition. Service: check in and out could not be more seamless and there is always a friendly person at the front desk... not once have I been disappointed in the service. Room: fairly large rooms, typical Ritz decor, comfy beds with quite sleep. No complaints. Location: for business, I am usually taking a taxi from the hotel to my meetings... as a tourist, you could walk to many places from the hotel - albeit it is a bit of a walk. You are right of the Commons, which makes for a nice morning jog. Amenities: I like the new restaurant/bar... the BEST part is the health club which is expansive and on the property. Really nice facilities. Overall impression.... this is a great choice in Boston. Why not 5 stars? - - there isn't really a \"wow\" factor to get it over 4, but I would not hesitate to stay here again (and I will). Good choice for all.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "2", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“What you can expect when staying at a Ritz...great service, clean, quiet!”", "Author": "mikeyz2281", "ReviewID": "UR123059657", "Content": "I travel a lot for business and have stayed at this Ritz in Boston quite a few times. The staff is polite and curteous and will also begin to remember their guests which is a nice personalized touch. The rooms are clean, well appointed and quiet. The door man is great! He can direct you anywhere and they also have a driver in the mornings you can try to catch a ride with...it's free and you get to roll in an S55 Mercedes...not a bad way to start your day. The restaurant connected to the hotel was delicious and the bartenders/servers were really nice. There is also a nice open bar in the lobby where you can grab a quick drink and unwind from a long day. There is a gym - Sports Club LA but be careful because it costs $15/day when you use it. The concierge should really mention this to their guests instead of just directing thence to the gym like its free. The location if the hotel is ok. It's near Emory College/theatre district so not many restaurants nearby. You can always take a nice stroll across beacon hill to find some good food though. Will definitely continue to stay here.", "Date": "January 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Woonsocket, RI", "Title": "“Long weekend holiday getaway.”", "Author": "RIBluebird", "ReviewID": "UR122949498", "Content": "We stayed over New Year's Eve. We booked the hotel through American Express Fine Hotels and Resorts Program. We received all the amenities provided with this program except the room upgrade. They said that there was no room available, but when looking at room availability online the same day, we could have booked the upgraded room. Some people were being given champagne at check in. They seemed selective in who was getting the champagne. We stayed on the club level. The club room was overlooking the rooftop garden. The food presentations were nice. We didn't know until our 2nd or 3rd visit to the lounge that they had mixed drinks available. We only found out because we overheard someone order one. The club service was adequate and pleasant. They weren't overly attentive. The bed was very comfortable and we slept well. The rooms were quiet. We only had an issue one morning where someone was adjacent to us was slamming the door repeatedly whenever they went in and out (which seemed to be often). The view from the room was terrible. The view was also of the rooftop garden. The food and service in the bar and the restaurant was really not very good. We went down for a late breakfast New Year's Day and were told by the hotel that they were no longer serving breakfast (daily breakfast was included as one of our amenities). We left and went elsewhere to eat. When we returned later and went to the restaurant bar for a drink, we were given the breakfast menu because... they were still serving breakfast (and lunch too)! We were in the hotel bar (not the restaurant bar) for New Year's Eve. I was very surprised by the number of children hanging out in the bar and bar area. The level of service was not at all what I would expect from a 5 star hotel. When we left the room, there was frequently stuff (used room service trays, humidifier, etc) left out in the hallways that would sometimes be there for hours before being collected. The attention to detail just seemed to be lacking a bit for the level of hotel.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Bad service for the price”", "Author": "zanev", "ReviewID": "UR122673176", "Content": "Overall, the hotel is nice and has a good location. Pricey, but so are most places in Boston. Room was nice, washroom was nice in our room. No complaints at all with the building itself. My issue was with the service at the hotel, especially given that it is supposed to be a 5-star AAA hotel. There were lots of people working all of time, especially in the check-in/concierge area. And there were always people who were not actively serving a customer. Yet when we arrived to check in, we had to wait for someone to come and help us. Then when we came to the concierge desk, there was no one there. We waited, obviously looking for help when one of the other staff finally came over and attempted to help us. What a joke that was, we were shown a map of Boston and taught that Cambridge was across the river. Wow, that helped. That night, I noticed there was some hair in the bathroom. I cleaned it up before my wife saw it and freaked out. The next day, we again got help from the concierge. This time, helpful with a dinner suggestion and making reservations. Except, it took more than 1/2 hr to get a call to our room saying the suggested restaurant was full. Not sure what took so long. But another suggestion was made and reserved for us. Which was great, except we never got a call back to say it was booked. We had to stop by the desk to hear that it was confirmed. Godd suggestion though - Stoddard's (I reviewed it very positively). Then I tried to call the spa to make appointments for us. 10 calls, no answer. Now I realize it is run separately from the hotel, but I really don't care. Reality is, I should get an answer. So we went to the spa to make our massagge appointments only to find out that the pool was closed. We were never told that and honestly, would never have booked there if we did know since we all wanted to swim. Note - there is a $15 per day charge to use the gym next door, they do advertise this on the hotel web site. Finally, we left our bags for the day as we checked out but had a late evening flight. Just getting our bags back was a nuisance as apparently only 1 person has the key and we had to wait for him while I watched 5 other staff chit chat and do nothing in the lobby. Very annoying. For a place that is supposed to be of a high calibre, I was very displeased. I would give a 0 or 1 rating, but the hotel itself is decent with a good location. But if you go, don't expect 5 star service.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Lovely hotel, but..”", "Author": "54kerry", "ReviewID": "UR122122316", "Content": "My family and I stayed a long fall weekend at the Ritz-Carlton, Boston and overall very much enjoyed our stay. As previously noted in reviews, the hotel is more modern than many other Ritz-Carlton's, but we still found it welcoming. We had an executive suite, which had enough room for our family of 5 with a rollaway (3 children under the age of 9). The room was nicely decorated, and the king bed in the bedroom was very comfortable. I was not impressed with the quality of the sofa bed, but at least they gave us a featherbed topper to put on top of it. The bathrooms were outstanding, in particular the full bath in the bedroom, and I really liked having a \"coat closet\" in the front foyer. The location of the hotel is convenient to most attractions, but it's in a rather random few blocks on the edge of Chinatown and in the middle of a couple of schools, so there are a lot of students and bars. There are not a lot of restaurants in the immediate vicinity (2 block radius) , however that is not a huge consideration for most people. On the slight downside, the staff was helpful, but not overly so - I've had more helpful staff at other similar hotels, but that alone would not dissuade me from the Ritz-Carlton Boston. For me, the biggest downside (which was still rather minor) is that they really didn't make any accommodations for the kids. Frequently at similar hotels, there will be a small treat waiting for the kids in the room (coloring book or similar), or the housekeepers will do something sweet with their beds (a treat, or tucking in their doll, etc.) - but really they were pretty much overlooked during our stay. I did note in the book in our room that they offered amenities for the kids - bathrobes, etc. - but there were none in our room and it wasn't worth it for me to call housekeeping. Note, this was a minor detail on a very nice stay - it was not that the kids were unwelcome, and everyone was very kind to them. Overall, we had a great trip, and a lovely stay at the Ritz-Carlton Boston. Would we stay there again? Perhaps - but I'd probably look around for other options, in particular if the kids were with us. For me, it felt best suited to a business traveler, but comfortable nevertheless.", "Date": "December 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Very nice property in perfect location.”", "Author": "Londoner_Chris", "ReviewID": "UR121663924", "Content": "Great location for work and play. Nice rooms and bathrooms. Very friendly and efficient service. Pricey but worth it!", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Buffalo, NY", "Title": "“Fine Hotel - Staff Excellent”", "Author": "RobBflo1", "ReviewID": "UR121534699", "Content": "I stayed two weekday nights at this hotel, and I cannot say enough about the treatment I received from the staff, the luxury feel of this hotel, and what a nice stay I had. First, the hotel, in my opinion, is in an excellent location, on top of the commons, within walking distance to plenty of attractions, restaurants, and business areas. It is true that there are some blocks a bit away that need some attention, but I never ever felt like there was any threat. Just a great spot. I also found the size of the hotel to be perfect, not too large, not too small, just right. Had a great bar area, roomy and well done. Did not eat at restaurant, but menu looked appealing. Another great feature is access to the LA Sports Club downstairs. it is a top flight facility, with a great gym, classes, spa, and other services. Lastly - the staff, everyone I encountered was pleasant, and really seemed interested in your having a great stay, just over the top service I recommend the Ritz Carlton Boston wholehearted!!", "Date": "December 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Florida", "Title": "“Excellent Hotel; Spacious Rooms; Very Responsive Management”", "Author": "mozacq", "ReviewID": "UR121225501", "Content": "Ritz-Carlton Boston Common is yet another shining example of why I love the Ritz. This is one of four 5-star hotels in Boston (I think...). As you enter the lobby, you have a great, modern fireplace bar in front of you and the bistro to your right. The entire hotel was maintained as you would expect at a Ritz, but there was something very nice about this particular location. It has an edge too it that I really enjoyed. Maybe because the design is a bit contemporary and the hotel is newer is comes off with a different feel. I was very impressed with our room. Although we reserved a basic room I was very impressed with the size; it was very roomy and of course finished as you expect from a Ritz. We dined at the bistro and later had friends for drinks. The food was excellent. We ordered some locally inspired appetizers (crab cake fritters and New England clam chowder) and I was very impressed with the quality of the dishes which both exceeded my expectations for the amount of seafood - just great. I was concerned regarding the speed of service during the evening but rest assured the entire management was on top of it. I was very impressed with their responsiveness. \"As usual,\" the rest of the hotel staff was top notch. On a personal note, I just love this brand. I really hope they are able to resist industry's seemingly inevitable pressure to cut corners. I get it, but don't give in!", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "usa", "Title": "“It's a Ritz-Carlton and the staff get it...”", "Author": "china4me", "ReviewID": "UR120595356", "Content": "For me a Ritz-Carlton is about cleanliness and customer service. Stayed for three nights in one of their suites. It's not my favorite Ritz-Carlton but it lives up to expectations.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Wonderful!!”", "Author": "lobo19", "ReviewID": "UR120584008", "Content": "My husband and I stayed at the Ritz to celebrate our anniversary and it was fantastic. We had a view overlooking the Commons and the staff was excellent. The room was beautiful and the bed was the most comfortable bed I have ever slept in. The location was perfect for walking all over the city. You do not need to rent a car since everything is in walking distance. A perfect weekend!", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "nyc", "Title": "“Good convenient place to stay”", "Author": "JABOTRAVELER", "ReviewID": "UR120386044", "Content": "This is the second time I stayed at this hotel and I was happy with my stay both times. The location is great. I've always had a suite with views of the Common and that has been nice. The better views are from the rooms with the higher numbers, I think the last room with the best views are \"80\" ( as in room 1080 or 1180) so try to get a room at least in the 70's so you will have a better view of the Commons if you stay in a suite. The only issue I have with the hotel is that they may nickel and dime you, as when they charge you for internet use. If you have a concern like that, when you check in they may take care of it and comp you for that expense. The service at the hotel is excellent.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Midwest", "Title": "“The Best in Boston”", "Author": "BCparent", "ReviewID": "UR120073734", "Content": "I have stayed 4 times in the past 2 years at this Ritz Carlton property, and it never disappoints. The location is ideal for me: close to the commons and shopping/restaurants. From the (now familiar) doormen who remember me from previous stays to the reception desk, the experience starts on a high note. The small lobby is immaculate. If you're not in the mood to explore, having lunch or dinner in the lovely 1st floor restaurant is not a fall-back strategy because it's really good food and a quiet and elegant atmosphere. I have booked regular single rooms and a suite (wonderful) on one occasion. I have not stayed on the Club level, but I've got to think it's consistent with the high level of service etc... If you are a traveler who doesn't like to risk having a so-so hotel experience (I don't) and tend to stick to the Four Season's, RItz Carlton et al, I highly recommend this as an easy choice for Boston. On one Boston visit, I saved around $150 a night, and what a mistake, when I booked elsewhere. For me, it was not even close to worth it.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Best Ritz Carlton”", "Author": "Millymay022", "ReviewID": "UR119689802", "Content": "Wow, this is my favorite Ritz Carlton I have been too!", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rio Rancho, New Mexico", "Title": "“Ritz-Carlton at Boston Common doesn't get any better”", "Author": "MaxRoadster", "ReviewID": "UR119635072", "Content": "The Ritz-Carlton, Boston Common is well situated to maximize a visit to one of the most historic localities in the United States. As one would expect from the name and address, this is a luxury hotel. My wife and I, upon presentation of our credentials, were quickly checked in and following introductions from Tamara at the front desk, accompanied by the friendly Bellman and our luggage to the room. After storing clothes and familiarizing ourselves with the room we partook of the Concierge lounge where Brian, Ryan and Jessica introduced us to the libations and delicious Hors d`oeuvre which were changed almost nightly during the stay. Later, we found the room was elegant and quiet for a relaxing first night as was predicted by Julia, Rooms Executive. Management and staff ensure delivery of every expectation one might have of finer accommodations; from the room, to the food and even beyond the confines of the hotel itself. This traveler made a day trip to New Hampshire but the return trip which could have ended poorly instead became an introduction to Bostonâ€™s latest reconfiguration of its street system. Travel maps and GPS systems prove inadequate when subjected to Bostonâ€™s one-way streets. Enter Ritzâ€™s Concierge, Adriatic. A cell phone call and it became very apparent Adriatic was totally familiar with the cityâ€™s one-way streets. In short order he had us at the front door and in a much happier state of mind. We found that Adriatic and his other half, Andrew were knowledgeable of all the best that Boston has to offer! This is the kind of client-vendor relationship that constantly reinforces this traveler to choose the Ritz-Carlton for hotel accommodations. Mr. Rajesh Khubchaandani, General Manager is to be commended for the courtesies extended by his staff from the doorman to those named in this review.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "omaha", "Title": "“tested the Ritz WOW factor...underwhelmed”", "Author": "haser59", "ReviewID": "UR118894286", "Content": "My wife and I stayed at the Ritz Boston over the weekend. First time to stay here as we have been at Boston Harbor and Four Seasons recently. Decided to try the Ritz as I had heard about the legendary \"wow\" stories. The hotel is nice and it is immaculate. Its not a stunning hotel by any means and is tucked away. Getting a cab is a 20-30 minute process so we typically walked up the street and found one as the valet folks are very busy. I saw the in room advertising Friday night promising unbelievable service (\"let us find you a tailor at 5 am ex...). I decided to send out a pair of pants at 9pm Friday night to be laundered but asked that I get them back by 9 am as I had a meeting with someone in the hotel...Yes, they were only pants I had...poor planning on my part... I was absolutely and cheerfully told it was no problem. At 9 am I didn't have the pants. 9:15 someone knocks asking me if I needed laundry picked up...No, I am missing some pants ...9:30...I called and was basically told by the folks in the laundry area that I should get the pants to them earlier if needed them by 9 am. Then they couldn't find them. Then they said it was not their fault and on and on...it was really frustrating. Got the pants, still damp...late for my meeting. I felt horrible for being \"that guy\", though, and that I put them out so much. I honestly never try and test this service at hotels..But it was really underwhelming too.. I spoke to someone, didn't get his name, at check out and he apologized and said he would not charge me for the pants and \"was there anything else he could do\"? It just felt awkward and I felt very bad. I won't plan to stay there again...I guess I thought there would be more and I left unhappy.", "Date": "October 3, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Burlington, New Jersey", "Title": "“Gorgeous hotel, great for business travel”", "Author": "Rstoner", "ReviewID": "UR118022067", "Content": "Stayed at this hotel on a business trip and it was absolutely lovely. The room I had was HUGE, with a foyer, large bedroom, and spacious bathroom. The hotel bar made for a nice meeting place after work and we often returned there after our dinner arrangements. Staff was extremely courteuous and helpful in arranging transportation. Location was within walking distance to many of the places that we needed to get to so that was also a huge help.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Average Hotel in Bad Neighborhood”", "Author": "HRH2002", "ReviewID": "UR117459710", "Content": "The Ritz Carlton Boston Common made a grave mistake in moving from its former, historic quarters in the city's best location to an average facility void of any personality or detail, located on skid row. While the hotel may have park views from above, once one exits its main doors and turns the corner, he is greeted by a grimy block full of shady individuals frequenting the adult bookstore located directly across the street. My travel companion and I felt incredibly unsafe in trying to navigate the surrounding neighborhood after dark, and were accosted by several beggars in the hotel's immediate vicinity. Furthermore, the rooms are lacking proper soundproofing and insulation, resulting in a very noisy situation. I would definitely recommend staying at one of the other luxury hotels located on Boston Common instead, as they are far superior in ambiance, service, location and safety.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Stayed here for the gym”", "Author": "Rachelle H", "ReviewID": "UR117250742", "Content": "I was very happy with my stay, comfy beds, good sized room, but the real winner for me was the gym and the main reason for choosing the hotel. The lap pool was just what I was looking for and didn't disappoint. Add in a running tour of the freedom trail & the excellent glass of malbec in the bar was justly deserved!", "Date": "August 25, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Madison, CT", "Title": "“Children Only Permitted to Use the Pool on Sundays . . . Had to Cancel Our Stay”", "Author": "J T", "ReviewID": "UR116941725", "Content": "My family LOVES the Ritz Carlton . . . the service, decor and atmosphere are second to none. My husband, two boys and myself have stayed at the Ritz in several locations across the country and were surprised to find the day before our trip to Boston that the Ritz Boston does not permit children to use the affiliated pool, with the exception of Sundays. The concierge at the Ritz invited us to walk down the block and use the pool at the Hyatt . . . sooo.... we cancelled our reservation at the Ritz and relocated to the Hyatt. We are hoping that if the pool is good enough for the Ritz to recommend our using it, then we'll be happy overall. In truth however, we are all pretty much down in the dumps about not staying at the Ritz. Has always been THE BEST!", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Great location next to Boston Common, impecable service, comfortable room”", "Author": "Washingtonianwoman", "ReviewID": "UR116678959", "Content": "I attended a Board meeting at this hotel and enjoyed the stay very much. The location is terrific right next to Boston Common and also close to the start of the Freedom Trail. The service was outstanding from start to finish. The bellman who helped me when I arrived greeted me by name every day when he saw me. My room was spacious and very comfortable. The hotel is built on top of a huge sports/fitness club which seemed fabulous but I did not use this since I prefered to run on he Common. I recommen paying the extra fee for access to the concierge lounge.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Connecticut", "Title": "“Only the Sports Club LA Boston Lived Up to the Ritz Carlton Standards”", "Author": "bbhayes21", "ReviewID": "UR115779692", "Content": "My husband and I visited the hotel for our wedding anniversary and stayed 4 days/3 nights. The location is excellent. It's steps away from the Boston Garden and walking distance to many restaurants and other attractions. The property is new and the rooms are well appointed. We had an interior room but we still had a view of a roof-top garden. The house-keeping did a great job with the up-keep of the room while we were there. The best part of the hotel and what truly sets it apart from the other hotels in Boston is the Sports Club LA Boston. My husband and I were truly impressed by the facilities. There are 2 floors of gym equipment and 1 floor of rooms for workout classes. The classes are excellent and very challenging. In addition to the gym facilities there is also a separate spa and salon. We really enjoyed using the Sports Club LA/Boston and wish there was a gym like that for us back home. The area that needs improvement is when you enter through the doors on the way to the elevator. The check-in was mediocre. We've gone to other Ritz Carlton properties that offer champagne during check-in In this situation, the bell man was thoughtful enough to offer us water as waited for the woman at the front desk to check us in and then get rushed through for the next guests waiting behind us. We were asked why we were visiting and we said it was for our anniversary, yet the hotel did nothing...not that I was expecting chocolate strawberries but not even a note when we arrived in the room..nothing. We had made reservations on Open Table for \"Jer-Ne\" the hotel restaurant but when we came downstaris to dine, we realized then that the restaurant was closed for renovation. When we asked the concierge, he told us we go to the lobby lounge instead. He was very aloof. He shrugged his shoulders and in so many words said, take it or leave it. So we left and went to the Bristol Lounge at the Four Seasons for an excellent dinner. When we checked-out we had called to have our bags picked up so we can store them, go to dinner, then come back to load them in the car and drive home. We waited 30 minutes and then my husband called again We waited another 10 minutes before we dragged everything down ourselves. We were noticeably upset and the valet seemed apologetic. When we checked-out the man at the front desk asked how our stay was and my husband explained what happened. He seemed awkward and gave a bit of an apology but then switched subjects. The doorman and the staff outside was great and hey greeted us by our last name. We found the lobby staff to be the weak link. They need a lesson what Ritz-Carlton service means. We're torn because we had a great experience at the Sports Club LA but after the mixed service we had at the hotel, we have second thoughts about staying there the next time we're in Boston.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "3.0", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good location, some poor service, rooms standard”", "Author": "GengisAndLivingston", "ReviewID": "UR115399181", "Content": "It was dissappointing for a Ritz Carlton. We stayed 4 nights, the room was large but pretty standard, nice bathroom, robes, no coffee machine, no free wifi, very noisy aircon, bed not great. For a quality brand this hotel was basic, BUT the service very efficient and prompt, the staff could smile more! Just off Boston Common and near subway stations, good location. The lack of free wifi in the bar/lobby was very disappointing. Wouldnt stay again as Im sure there are more value for money hotels in Boston even though we used points for our stay. No resturant as they are refurbishing it, breakfast in the bar area.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great Luxury City Hotel”", "Author": "AboyGT2", "ReviewID": "UR115386851", "Content": "Hotel is part of a building complex consisting of a multiplex movie theater, fitness center and some retail stores. Once finding the entrance, as it is on a small side street surrounded by many one-way blocks, we were greeted with a warm and welcoming reception. The hotel is newly built and very polished as one would expect at a Ritz Carlton. Staff was very friendly and very accommodating with any of our requests. We were always addressed by our name and the housekeeping staff went above and beyond our expectations. Even having my children's favorite candy waiting in the room upon return from a day sightseeing. We stayed in a suite that was very comfortable, the bathroom was overly spacious and furnishings were high quality. Very quiet at night so no trouble sleeping. If possible try to stay on club level as you have access to lounge which provides daily continental breakfast (excellent fresh fruits), light snacks in afternoon and complimentary cocktails in evening. The fitness center and spa are not run by hotel but rather a large chain. So you basically leave the hotel from the elevator and gain access through the building complex. Fitness center was one of the largest I have been to with every machine imaginable including basketball and racquetball courts. Be warned though the pool inside is just a lap pool, not for kids to play. As far as dining , the restaurant was still under construction, so we only experienced the bar which seemed to get an after work crowd but still very cozy and pleasant. Overall we had an enjoyable three day stay, felt the accommodations were excellent and would recommend the Ritz as a good value for a luxury city hotel.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "new jersey", "Title": "“The Ritz \"Moved\" us by surprise!!”", "Author": "njfamily5", "ReviewID": "UR115361427", "Content": "Recently, on a short weekend trip that my family and friends squeezed in before dropping all our kids (ages ranging 6-16) off at camp we stayed at the Ritz Carlton. First let me say that for five years we lived in Boston and the Ritz-Carlton was located at the top of Newberry st. overlooking the beautiful Boston Commons- very swank. So, naturally, when we drove up from NJ we just drove straight there only to find that the marquee now read \"the Taj\" WHAT!! When we got back in the car and arrived to the new location, which is at the opposite end of The Boston Commons, we realized they moved to what was once known as the \"Combat Zone\" double WHAT!!! OK, nobody panic. We moved from Boston 13 years ago, and since then it is apparent that the city of Boston has invested in this area dramatically! They have completely revamped the area to a very safe and popular part of the city. And from the moment we stepped out of our car the service was exemplary. The lobby is trendy and inviting. The service and the rooms were exactly what you would expect from the Ritz. Furthermore, i came to realize that this relocation was probably a very well thought out business decision. It no longer emits a sense of eliteness. Rather, it caters to and embraces a more hip and sophisticated kind of crowd-without any stuffiness. Oh yes, i would be remiss if I didn't mention this incident: The parking garage called up to our room to report our tire was flat. They put a spare on it in 10 minutes! This discerning individual will definitely go back.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "new york", "Title": "“amazing 700+ sq ft suite”", "Author": "sasli", "ReviewID": "UR115128520", "Content": "lets start by saying we had a wonderful time at the ritz for the july fourth weekend. location was awesome. right across from boston commons, walking distance to boston's chinatown, easy walk to lots of great locations!! we drove up to the hotel and took less than a few minutes for someone to take the car from us and get our luggage. however checking out, the guy was lazy and i can see he didnt want to help us load our luggage back in the car. yet expected to be tipped because he opened the door to the car for us. i can do that myself, thank you. the executive suite can fit probably 6-7 people although their policy only allows 4... there are two bathrooms. 1 shower in the main bathroom. tub and separate standing shower. absolutely beautiful. they claim to use bvlgari bath products but i didnt notice that they were? .. there are 2 tvs in the suite. also called housekeeping to request numerous towels/bath amenities/water and they came promptly. bottled water is free !!! thats a plus for someone who needs to stay hydrated like myself. we checked our car with valet. its pricey, yes but boston is a walkable city where most things are in the area. and also if you travel with a few friends the cabs can always be split amongst all of you. i had a corporate rate on this hotel otherwise it would be out of my range. definitely enjoyed my stay here. on our last night, we bumped into the toronto blue jays team just checking in for a game the next day (july5). we didnt go to the restaurant or use the hotel other than for resting and sleeping. if i come back to boston, i'd def want to stay here again with my corporate rate! best deal in town!! recommendations: sam adams brewery, boston duck tour, new england aquarium, swan boats in boston common, fenway park, prudential center at sunset!", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Most comfortable bed ever!”", "Author": "BumbleBee28", "ReviewID": "UR114688959", "Content": "The room was nice. Nothing too fancy but the view was nice and you could see the Boston Commons. Great service.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Gatineau, Canada", "Title": "“Just like home: exceptional stay and service from everyone.”", "Author": "CurieuseEmilie", "ReviewID": "UR114687821", "Content": "My spouse and I got to the Ritz for a Princess weekend for me, as we were also going to see the Nutcracker at the Boston Opera House, a 30 seconds walk. This hotel was chosen for it's quality, attentive service and mostly because it was so central and offered valet service, a necessity for our first time in Boston. As we arrived from an 9h trip, we were taken care of by Brad at the front desk, who welcomed us in French (and we felt we were still home). Then we met the wonderful Sherly Michel, who was our contact for any question and spoiled us. On our second evening I ended up with a severe food poisoning from another restaurant (Durgin Park in Quincy Market), and I think it's really when we realized to what extend they wanted us to feel like home. The staff from the cuisine (Betty in particular) brought me thumbs in the middle of the night hoping they would help. All the concierges were aware of my condition, and were always available for any need whenever I called them. In the morning, when we realized we needed to be hospitalized, Sherly accompanied us; as we are Canadian citizens, we were unsure of what to do, and she stayed with us until we were taken care of, a good 3 hours later. She helped us fill paperwork, made sure we would have anything we could possibly need on top of what she already had to do that day. She also made sure my parents could find us in the hospital, had a good chat with them to explain what happened and how we were, and made sure that the minute we would be back in the hotel we would be taken care of by the staff. She hold my hand when I was scared and uncomfortable, reassured me and explained patiently anything I wouldn't understand. When you're really sick, away from home, in another country and in another language, having someone like her is such a blessing, and to stay in a hotel where you feel safe (and that your possessions are too while in the hospital) is such a relief. The staff knew who we were right when we came back, and attended our every need. And to our surprise, an exquisite bouquet with well wishes was waiting for us in our room. The next day we left to come back home early afternoon, and again, everybody was showering us with food, water bottles and make sure we were ok for the road. The careful, attentive, available, and generous staff, from the cuisine to concierges, doorman and coordinators and everyone in between will take care of you just like if you were family. Know that you'll be treated with the utmost respect, and be confident they'll do everything to make you feel comfortable and at home. We feel like we owed them so much, and the only thing they would say is that it was the least they could do. And despite our enormous hospital bill and the sickness, because of our experience at this hotel, we felt spoiled and had a wonderful time in Boston, and will certainly be back in a few months. Thank you so much again.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Concord, New Hampshire", "Title": "“Heaven! True 5 diamond experience!”", "Author": "ConcordNHLadyRider", "ReviewID": "UR114615318", "Content": "The staff is the friendliest I have ever had the pleasure of meeting. The room was so luxurious. The healthclub on the premises is amazing. I loved the large tub and separate shower. Hotel is located near so many fun places. We walked everywhere and loved the bars nearby, including the one in the hotel. There is a huge movie theatre right next door, if you are bored or the weather is bad, but so many other fun things to do. Ask the concierge for ideas and you won't miss a thing. Downtown crossing is fun and there are folks there to guide you around the city.", "Date": "June 21, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Eh...”", "Author": "NY414", "ReviewID": "UR113759238", "Content": "Hotel was very pretty and the staff was great...when they helped you. Pulled up around 3pm not a single person in sight. I had to bring my bags to the front desk and then a valet appeared. Front desk staff was excellect, polite, professional, everything you would expect from a RC. Had dinner with my family in the restaruant. Service was very slow. Food was excellent though. You must try the cheeseburger. Sounds crazy, but trust me. Everytime my family and I interacted with the front door staff they were very cold and seemed bothered.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "2"}, "AuthorLocation": "Brooklyn, NY", "Title": "“overall comfortable stay”", "Author": "emu711", "ReviewID": "UR112437752", "Content": "was here for two nights. we had a jr suite connecting with a double. the connecting doors were awkward to use. beds were very comfortable. we noticed there wasn't a coffee maker in the room. the sitting area was very nice, pleasant furnishings. some wear and tear here and there, but not too bad. the bath products were quite cheap. the body wash smelled just like the tamarind sauce i eat with indian samosas! really! the bath was very large, though. our toilet clogged the last day. would definately stay again if i could get a decent rate. $500/nt was too much.", "Date": "June 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Hampton, New Hampshire", "Title": "“No HD TV - are you kidding me?”", "Author": "VTing", "ReviewID": "UR111890591", "Content": "I'm here for business, the Stanley Cup finals are on TV - but the picture in my room is terrible there is no HD, but the TVs are LCDs. I called house keeping, they sent up a technician to tell me they only have HD on a Few channels. This is the Ritz?????", "Date": "June 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location, good rooms, good service”", "Author": "dpegan", "ReviewID": "UR110120422", "Content": "Perfectly placed by the common and the green lines, this hotel allowed me to walk to work and get around downtown boston easily. There was a problem with the AC in the room (squeaking), and they promptly sent up a mechanic who fixed it.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Nice and pricey”", "Author": "FrequentTripster", "ReviewID": "UR108701539", "Content": "This is a fairly standard R-C hotel with and excellent staff. The property is somewhat unusual...small lobby with limited seating and only four floors not attached to the lobby. Rooms spacious and well equipped...furniture could use a refresh. Interesting that they charge an additonal $100 to use the club lounge...even for high level Marriott members. Restaurant is good but expensive...drinks are especially high priced.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "los angeles", "Title": "“ZERO STARS- POSSIBLY THE WORST HOTEL I HAVE STAYED AT”", "Author": "Lovz2Travel", "ReviewID": "UR105455595", "Content": "If I could, I would give this property zero stars. This is due to the fact we could not even get passed the check in desk! As a member of American Express Platinum Services, we booked a decent rate that included their amenities. This hotel came strongly recommended. When we first checked into the hotel, there was one bellman who took a very long period of time to come up to our car. It should have taken less then a minute to figure out we were checking in. The bellman walked up to our driver and said to him through the window, \"Aren't you going to help me.\" Our driver didn't respond and dind't help him as it wasn't his job to do so. The doorman then reluctantly got our luggage out and said a mark of disdain. Not very professional. Our saga gets even more interesting. We are standing in the lobby for 10 additional minutes in a crowd of people until finally an employee offered to check us in (it was about time). She looks us up on the computer and said she was unable to find our reservation. We gave her the Amex Confirmation with the correct dates and a reservation number and they still could not find the reservation. Many different people looked us up until they came up with some crazy story that they had us coming in a day earlier and we were a no show. Our Amex agent talked to the management of the hotel, who was apparently rude to the agent and after several hours the employees said very loudly they would be unable to accommodate us and we had to walk to another hotel with our luggage. Never in my years had a hotel claimed my confirmation was not valid or not even let us check in. Even if this was the case, instead of embarrassing the guests in the lobby, the hotel itself would be embarrassed and be extremely apologetic. You would think they would set up transportation to another hotel, set up the reservation, pay the difference in price, and while they were on the phone with Amex comp a lunch in the lounge (yes last time a hotel had a problem with our reservation, they did solve it, but offered us lunch while they resolved it). I CAN CLEARLY SAY THERE IS A COMPLETE DECLINE IN THE RITZ CARLTON STANDARDS. WE EVENTUALLY MOVED TO THE FOUR SEASONS FOR $20 EXTRA A NIGHT AND IT WAS SOOOO WORTH IT!!! WHATEVER YOU DO TAKE THE OFUR SEASONS OVER THE RITZ!!!! DO NOT STAY HERE!", "Date": "April 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore", "Title": "“Another perfect stay at the Boston Common Ritz”", "Author": "apitraveler", "ReviewID": "UR103929288", "Content": "We've stayed at this Ritz twice now and had exceptional experiences each time. From the attentive check-in all the way to grabing a cab after check-out we had a near-perfect trip. The staff were world class and extremely helpful - exactly what you would expect from the Ritz. Our room was amazing, and thanks to the AmEx deal this suite was an upgrade. A small downer was that we were very close to the elevators and could hear the motors churning every time they moved. Luckily this died down at night and we were tired. Room service was great (albeit expensive), we had a decent view (although we didn't come to Boston for the view), and the room was beautifully appointed. One of the highlights of staying here is access to the Sports Club/LA, a phenomenal gym with everything you could ever want! Normally I hate paying extra gym fees - especially after paying for a room at the Ritz - but at $15/day it's a steal, it's just that great. We look forward to returning to Boston and staying here every time we can. It has set the bar for me for what a fine hotel should be.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nashua, NH", "Title": "“Perfect in every way”", "Author": "thewolffs", "ReviewID": "UR103702843", "Content": "My husband and I needed a small getaway from the day-to-day and found ourselves at the Ritz-Carlton as part of a weekend art auction. It was simply exquisite. We were fortunate enough to score a room overlooking Boston Common and the view was simply breathtaking. The Ritz-Carlton is in the heart of Boston and a stone's throw from the theatre district, Downtown Crossing, Chinatown, and Newbery Street. We caught the Saturday matinee at the Colonial Theatre where we saw Hair -- excellent performance! We also wandered through Chinatown and had our first \"bubble tea\" -- highly recommended! The hotel is extremely clean and the servic was impeccable. I do wish that they had a dining room, but the close proximity of some of Boston's best eateries more than made up for the minor inconvenience. If you are in need a late-night refreshment, there is a bar on the premises. Try the lobster pizza. It was quite lovely and probably prevented an uncomfortable morning headache. ;-) Many thanks to Jorge, our bartender for the weekend. His jovial presence was a delight! For the cheapskates like us who can't reconcile the need for the finer things.... - The Wi-Fi is not free. $10 a day or $25 for 3 days. - You can self-park or do valet, not free. - There is an on premises gym, $15, with an incredible pool - A burrito from Maria's Taqueria down the street - priceless (but a steal at $7)", "Date": "April 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yarmouth Port, Massachusetts", "Title": "“Ritz is the best”", "Author": "Patrick B", "ReviewID": "UR102485200", "Content": "This is my favorite hotel in Boston and Ive been to many. I love the atomosphere, elegent and calm. This is a great spot", "Date": "April 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hartford, Connecticut", "Title": "“Beyond Expectations!”", "Author": "AnnGHartfordCT", "ReviewID": "UR98278782", "Content": "Went to Boston for a long weekend \"get-away\" and decided to try out the Ritz. The hotel did not seem to be very busy - and they were nice enough to upgrade us to a luxury suite. The suite was definitely well named as it was so luxurious that my husband and son did not want to leave the room! The room was huge, beautifully furnished and immaculate! The bathroom was beautiful and immaculate. (The weather was not co-operating with our plans - rain and snow and wind all weekend). Luckily there were plenty of places to eat and things to do within walking distance. When we did order room service, it was ready amazingly quickly and the food was very good. My husband enjoyed working out in the adjoining sports club as well. We look forward to going back!", "Date": "February 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“What a lovely hotel!\"”", "Author": "PlatinumToronto", "ReviewID": "UR95402804", "Content": "Had the opportunity to stay at the Ritz Carlton in Boston Common last week. We'd never stayed there before and didn't know what to expect. Wow, what a fabulous 3 days we had!!! We were continuously greeted by name whether it was the front desk staff, restaurant waitstaff or the door men. The concierge, Evan, did a great job recommending a restaurant as well. The staff, ambiance and food at Jar Ne restaurant was all 5 star. The room was lovely and left us in need for nothing. We would definitely stay at this hotel and suggest that if you should read a negative review for this hotel, ignore it!", "Date": "February 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "", "Title": "“Enjoyed our stay”", "Author": "SWIFTYS", "ReviewID": "UR87886103", "Content": "We stayed here for 3 nights, in an Executive Club Room. Our room was very spacious, although it did have a musty type smell, when we first arrived, especially the bathroom. However, this did fade, the bed was really comfy, it was a corner room, and it had a small seating area, but this had only 1 comfy armchair, the other was a desk type chair, which was odd! 2 plasma t.v's, a good standard bathroom, with separate shower. The club level, was very good value, it included Breakfast - continental, in the Club Lounge, there was Fruit, croissants, cereal, coffee, tea and juice, cold meats, etc. Tucker, the Butler in there was lovely. There was also included, light lunch, if you wanted it, soup, sandwiches, drinks etc, all day long there is drinks, coffee, tea etc. From 5pm there are pre-dinner nibbles, and from 8pm desserts! Not to mention wine, cocktails, phew! We tried the desserts one night, after they were raved about in previous reviews, but they were quite nice, but not fantastic! There was free Wi-fii also which was nice. I didnt really like the location that much, it was fine during the daytime, but found it a little 'rough' in the evenings. You could walk everywhere from the hotel though. there was a cinema just on the corner, and it was nice to feed the Squirrels on Boston Common during the daytime, they are very tame! The hotel was a very high standard and staff were excellent, very helpful and friendly. We had stay 2 nights and get one free, which made it really good value.", "Date": "November 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bermuda2010", "Title": "“Excellent Hotel, Great location”", "Author": "Bermuda2010", "ReviewID": "UR84389244", "Content": "Great location, very convenient to various Boston activities. The beautiful 1 bedroom suite had dirty glasses etc from the previous guests. A few other mixups involving our reservation (made through AMEX platinum) but everything was very professionally resolved by the day manager. The concierge was very helpful getting us GREAT basketball tickets and making restaurant recommendations, car service etc. Nice location by park and T.Good main train line very close to Hotel. We would stay here again. Other than the dirty glasses and a few minor things very clean and nice.", "Date": "October 21, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Liverpool", "Title": "“Amazing”", "Author": "Tyranter_new", "ReviewID": "UR81121350", "Content": "We had the best stay here. The staff from the door to cleaning staff were superb. All friendly and would do anything to help. We had a fantastic one bedroom suite that was luxury. The club access is well worth getting with great food and drink. Also giving access to the fitness club on 4th floor that has to be seen/used to be believed. The staff in club level there are excellent providing so much help and advice that helped make are stay in Boston a very good one. We found the location great as well. Easy access to everywhere. ould recommend to anyone to stay here.", "Date": "September 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chessington, United Kingdom", "Title": "“Superb service”", "Author": "PotterMoose", "ReviewID": "UR80186678", "Content": "We stayed one night at this hotel in an Club level room. The room was on the small side, but nicely decorated and with views over the roof garden. The bathroom was small but attractive, with a large bath and separate shower. The Club Lounge was excellent, with good food and superb service. The location of the hotel is also very convenient. However, it is not cheap - although internet access is included with the Club level service. We used the gym, which is open to the public, and is huge. However, it is not of the same standard as the hotel generally, being impersonal and with only water fountains available.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "new jersey", "Title": "“Nice hotel....but is it worth the price?”", "Author": "na07950", "ReviewID": "UR80048204", "Content": "I'm just back from a stay for a conference and thought the Ritz was very nice (but at the conference rate). The location is a little strange, but it was easy to walk to shops, restaurants, the North End, etc. My room was fine...very nice sized, comfortable bed (great pillows), huge bathroom with separate tub and shower and it was very quiet. The maid service was wonderful and everyone on that staff that I met was very pleasant. There is a business center (need room key to access) but it seems to be a secret (I only found out about it when I saw a fellow conference attendee enter it). They nicely ask at checkin what paper you'd like in the morning (but then I never did receive it), although they were very nice to let me check in significantly before the standard time. Would I stay here again at their regular rate - unlikely but I'm sure it's a great hotel for travelers willing to pay the high rates.", "Date": "September 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Georgia", "Title": "“Wonderful experience at Ritz Carlton Boston”", "Author": "kg30345", "ReviewID": "UR78552870", "Content": "I've stayed at a number of Ritz Carltons, and am rarely disappointed, and this trip was no exception. The staff was incredibly friendly and accomodating. I mentioned that we were celebrating our anniversary, and the hotel manager sent some chocolate covered strawberries to our room. It was a nice gesture. The rooms are spacious and tastefully decorated. The bathroom is wonderful. It's one of the few hotels that I stay in that is completely soundproof - we never heard a door slam, a toilet flush, or traffic from the city. The location is fine. My husband and I love to walk, and we walked all over that city each day, and we found the location to work out very well. They offered to drive us to dinner in their hotel SUV, which saved us a cab trip. And, the concierge scored me some very difficult restaurant reservations for that night. Overall, we were so pleased with our trip and our experience at the Ritz Carlton, and I would highly recommend this hotel.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Superb Hotel”", "Author": "WheresMyEntourage", "ReviewID": "UR76480780", "Content": "Stayed for a few nights during a business conference. The suite was amazing, bed was very comfortable, staff very accomodating. Overall a great hotel. Well worth the price.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Munich", "Title": "“Had Expected Quite A Bit More”", "Author": "Travelingwithdog", "ReviewID": "UR75084627", "Content": "It had been a very long time since I was in Boston. It seems the old Ritz Carlton building is now the Taj. The new building is close to Boston Common down a small side road, but not situated as nicely as its former location and not as prominently as the Four Seasons (which costs approximately the same). Had I known all this before my trip, I would have booked another hotel. In addition, although the building is modern and relatively new (built in 2001, I believe) it feels a bit cramped and unwelcoming in the lobby as the separate Spa & apartments take up a good portion of the available space. I also had the impression that hotel management was a bit lax and should have seen to it that the lobby and entrance were tidy and 'orderly'. (A table with a type of flower arrangement near the elevators went almost a day and a half with only stagnant water in the vases before the water was replaced and flowers put in.) I had several meals (a snack and 2 breakfasts) in the hotel restaurant and was fairly disappointed. Although the waitstaff was friendly and helpful, the meals were pricey and fully unspectacular. The atmosphere tried at urban chic and fell short. Another disappointment was that WiFi was an additional charge. For this class of hotel, one would expect it to be included. The room itself was not that large for a deluxe double room and the supposed views that were touted on the phone (all for an additional charge) turned out to be either a planted roof top garden or a few nearby buildings and a street view. (In addition, I had to change rooms upon check in as the first smelled strongly of cold cigarette smoke. The staff should have caught this before showing it to a guest!) All in all a big disappointment.", "Date": "August 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fredericton", "Title": "“Another amazing stay!”", "Author": "gvvcz", "ReviewID": "UR71963056", "Content": "Stayed on July 16th and 17th on the Club floor. Once again, I was treated like the entire staff was there solely to attend to my needs, and like nobody was more important. Or, at least that's how they made me feel. Morning breakfast was amazing. Lunch was even better. I'm not a fan of hors'deourves, but I had some Champagne. But the absolute tops were the desserts! Oh my God they were so amazing. Top notch in every way!", "Date": "July 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Plano, Texas", "Title": "“Great location, wonderful staff”", "Author": "katiey424", "ReviewID": "UR69901573", "Content": "We arrived before the July 4 holiday weekend and check-in was a breeze. The ladies and gentlemen of the Ritz-Carlton are always extremely friendly and helpful. The room was on the club level (floor 12) which is the top floor of the hotel. We did see several guests use the elevator for club access, so I assume you can purchase the club level room without staying on the club floor. Room keys are required for access. The location is wonderful - extremely close to Boston Common and the Public Gardens. Easy access to the T and close to several Boston tour trolley stops. There are lots of restaurants within walking distance, as well as Chinatown and the Theater district. The room was average in size with a separate bathtub and marble shower. I like the added touch of a mirror in the shower, as well as full length mirrors in the closet doors. We were traveling with a baby and the hotel provided a crib with bumper pads and a clean sheet as well as a small baby kit with shampoo, lotion, etc, and baby safety items (outlet covers, etc). The view was a city view but overlooked a modern rooftop garden display. We have previously stayed on other RC club level floors and the service here is excellent, however, I did notice a few things. The Boston club level closes at 10 p.m. sharp and is locked at that time. Other clubs we have visited were a bit more lenient, allowing guests to gather in this space without RC attendants, some even leave beverages out for guests to enjoy. Also, while the club level offers complimentary alcoholic beverages, the selection is limited. When a travel companion asked for a popular after-dinner drink, the attendant said the ingredients were not available and I ended up purchasing the drink downstairs in the restaurant bar and bringing it up. The food presentations were impressive with gorgeous desserts, a great breakfast selection, and filling mid-day snacks. You could easily eat all three main meals in the club. The concierge and club level attendants were extremely helpful in making dinner reservations. There is a house car with limited hours of operation so do inquire about it during your stay. The hotel also offers tea service with their special \"cupcake tea\" for guests of all ages. The hotel has a relationship with the sports club next door, so you can use their gym facilities and spa if you wish. Club level includes free high-speed internet and other services such as daily paper, garment pressing, etc.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "weybridge,surrey", "Title": "“Superb hotel in an excellent location with 5 star treatment from staff.”", "Author": "weybridgeresident", "ReviewID": "UR66019535", "Content": "We have just returned from a 6 day trip to the Ritz, we were treated as if we were the only people staying in the hotel, all the staff from the managers to the bell boys were superb, always giving us a name and the staff in the club lounge were just amazing, nothing was too much trouble. We recommend this hotel very highly, we stay in '5 star ' hotels all over the world and very very rarely do they meet this ones exacting standards. The management should be very proud of their very fine establishment.! J and J Dunjay , Surrey UK", "Date": "June 1, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "McLean, Virginia", "Title": "“Not living up to name”", "Author": "Goahardi", "ReviewID": "UR65580836", "Content": "All of the outward appearances remain at the Ritz level. However, the attention to detail is lacking. We've stayed at dozens of Ritz hotels, world-wide and this was my least favorite experience. We always book a room with concierge-lounge access, no exception here, however the concierge lounge is too small. Consequently, the staff fulfill \"requests\" for the things that you usually find on display at other Ritz'. The parking, understandably, is poor. Retrieving your valet-parked car requires at least 15 minutes prior notification. On a more sensitive note, I requested a band-aid, for my daughter, twice. No response, no apologies, nothing. Not what I've become used to. Both shower-heads in my room were not just broken, they were inoperable. Engineering's response was to rig one of the shower heads so that, with care, it could work. The fitness center is technically outside of the Ritz but can be accessed via elevator to a next-door, national, fitness chain. This could be viewed as positive or negative, but not Ritz-family-exclusive-friendly...nor very convenient.", "Date": "May 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“Excellent Hotel, perfect location”", "Author": "Volenti", "ReviewID": "UR63419143", "Content": "This is a really great hotel - with a laid back vibe, nice bar/restaurant, perfect location (steps from Boston Common), and all the touches and amenities expected of the Ritz. Expensive, yes, but it lives up to the billing.", "Date": "May 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“So close, but not quite”", "Author": "boston65", "ReviewID": "UR63060323", "Content": "We stayed at the Ritz Carlton with our young children. The staff was always very friendly and professional, the room was excellent. The location is perfect - a very short walk to the commons. I also have to say the rate, for this class of hotel very good for a weekend stay. My hesitations... the service (whether it was the switchboard or waitstaff ) which was well intentioned but slow and the fan/air conditioning in the room was very loud (maybe it needed maintennance). Beware if you have kids looking for a swim - the pool is located at a next door fitness club (fantastic facility to be fair) - but children are only allowed to swim from 11-3 on Sundays.", "Date": "May 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fredericton", "Title": "“Best Luxury Hotel In Boston!”", "Author": "gvvcz", "ReviewID": "UR60482249", "Content": "Stayed on a weekend getaway with my fiance and was treated like the most important person there. Upon arrival the front desk agent greeted us both by name. And congratulated us on our upcoming anniversary. We booked a deluxe guest room,but they upgraed us to a suite. When we got to our room there were chocolate covered strawberries and rosepetals on the bed. None of this was asked for. The booking agent knew exactly what to ask to properly customize our stay. The room was imacculate and huge! Great job will never stay anywhere else!", "Date": "April 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ft. Lauderdale, Florida", "Title": "“GREAT HOTEL IN A GREAT CITY”", "Author": "China2002", "ReviewID": "UR50344806", "Content": "The Ritz Carlton gets customer service right. We were upgraded to a suite which was very clean and spacious. The location was within walking distance to the park and the Opera House where we saw the Nutcracker performance and many other nice spots. I found the beds very comfortable and the room very clean with beautiful bathrooms. Brooke in the executive office went above and beyond to help make my daughters birthday special and helped with hard to find restaurant reservations for Thanksgivning. The restaurant downstairs was very nice for both breakfast and dinner. The staff was very nice to the children and the food was great. We all agreed when we were leaving that the Ritz in Boston was one of our favorites.", "Date": "November 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Albany NY", "Title": "“No one does it better than the Ritz-an oasis away from home!”", "Author": "Fosdyke", "ReviewID": "UR48050766", "Content": "My husband and I were attending a convention in Boston and had originally booked a room at the Mandarin Oriental (see MO review entitled, \"Dirty and Disappointing\"). As you may surmise from the title, the Mandarin Oriental was awful. Indeed, it was one of the worst hotel experiences I have ever had and for the first and only time in my life, I actually left a hotel. Angry, exhausted, and frustrated, the first alternative hotel I thought of was the Ritz Carlton. The Ritz has never disappointed me...and this time was no exception. I stepped into the lobby, took a deep breath of that fabulous \"Ritz smell\" and said, \" I should never have strayed!\" I was immediately invited to sit down and the front desk agent leaned toward me and said with genuine concern, \"We were expecting you...AMEX just called to say you were on your way...what happened?\" As I spilled the horror story that was my Mandarin Oriental experience, the concierge came up behind me with a glass of champagne with a perfect berry floating delicately and said, \"I thought you may enjoy this.\" THIS IS HOW TO MAKE A GUEST FEEL LOVED! I literally felt like I had come home! The whole hotel is soothing...to the eye, the nose, and the soul! In short, no one does guest service like the Ritz....it is its specialty, its brand, and its pleasure.", "Date": "October 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Geneva, Illinois", "Title": "“A very nice weekend...”", "Author": "samlab25", "ReviewID": "UR46916112", "Content": "We decided to spend a family weekend in Boston. We typically stay at Ritz Carlton Hotels and had previously stayed at the old Ritz Carlton Hotel (now the Taj) in Boston. I was slightly put of by the reviews of the RC, so we looked at other hotels in Boston. Many were already booked for the long holiday weekend, so we decided to take a chance on our tried and true Ritz Carlton. We were not disappointed. We had a nice, club level room. Its typically what you'd expect for a city Ritz Carlton, rooms are adequately sized with nice, comforable appointments. The Club Level Lounge, as usual, was accessible and the staff was very helpful/knowledgable. The location was great, being right by Bostom Common. The only problem we enoucountered was trying to find the lobby concierge md afternoon on a Thursday. It wasn't a big deal since we could fall back on the Club Level concerige, but when we needed a map and wanted some informaton, it wasn't as handy as we wouldn have liked. I would definitely stay there again. I would absolutely recommend it to anyone looking for a weekend getaway or on business. It isn't a resort property, and it doesn't pretend to be. Its a great city hotel.", "Date": "October 15, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Virginia", "Title": "“Don't waste your money”", "Author": "bluesy58", "ReviewID": "UR45544512", "Content": "My husband and I stayed at the Ritz this past weekend in a suite. When making our reservations my husband requested a view of the Common (why stay on the Common if you cannot see it?) and we were told that they would put the request in but couldn't guarantee it. Upon arriving too early to check in we were subsequently rushed through registration (they only have two employees for check in and it appeared most of the time that only one was manning the desks). We were told that they would take care of our luggage until our room was available. Our bags were then placed on a cart and left unattended without the hotel identification tags. They were only attended to after we stood there and wouldn't leave until they were properly tagged. We left to walk around town and on our return were given our hotel key. The suite was not a view of the park and when my husband called down to again request a park view was told that we had a city view suite and that there wasn't another suite available. I find it hard to believe that there wasn't one available. Our \"city view\" was the side of the building next to us. The furniture was drab and appeared old. Having stayed at a Ritz before we were extremely disappointed. The only positive experience during our stay was the staff at the Club Lounge, they were very pleasant and helpful. When we went to check out in the morning again there was only one employee manning the desk during this busy time. I will not stay at this hotel again and I would not recommend it to anyone.", "Date": "September 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Middletown, Connecticut", "Title": "“made me feel like a VIP”", "Author": "metalmaiden", "ReviewID": "UR45522901", "Content": "One of the best hotel experiences I have ever had! This was our first experience with club level. It was a bit expensive but considering just how expensive a hotel say is in Boston it was a bargin! (Club level was much less than the regular stay at other 4 and 5 star hotels in the area.) The staff was fantastic! The minute we arrived the valets hopped to attention and the doorman chatted with us about our triip. He seemd genuinely interested in whatwe had to say. Check-in was a breeze and very warm and welcoming. the lobby, the elevator, the hall ways to our room we elegant and beautiful. Our room was huge! We had booked this as a anniversary getaway and there was a complimentary offering in our room with a night acknowledging our celebration. The room was quiet, was beautifully appointed, had luxury toiletries, a very comfortable bed and the marble bathroom of my dreams! I'm a confirmed shower person but I couldn't resist the tub. It was a wonderful soak and with a TV speaker in the room I could follow the game along with my spouse while sipping champagne. The fitness facility is really a health club and it is one of the finest I have ever experienced! We went 3 times during our overnight stay we loved it so much! There was every possible type of equipment you could think of, all types of classes, a pool as well as a cafe, salon and spa. It was heaven! The club lounge was simply wonderful. There was food offered all day; breakfast, light lunch, cocktails and hors d'ouveres, dessert and coffe/tea. Complimentry beverages were available all day. There were no TVs so we spent a lot of time in there talking and reading and surfing the internet. It was beter than our own living room. The concierges in the lounge all wonderful; knowledgeable and always there to help or answer questions. We really were made to feel like VIPs. Everyone here was pleasant and professional. We felt welcome and a bit pampered. I told my husband I could get used to this type of service! I can't recommend this hotel enough. If you are going to Boston this is were you should stay.", "Date": "September 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Washington DC", "Title": "“Good 4 star”", "Author": "dcadog", "ReviewID": "UR43395753", "Content": "My wife and I stayed for 3 nights in a king bedroom (1227) on the Club level. The hotel is centrally located with easy \"T\" access and a short walk from all of downtown Boston. Club access is a real plus even though it costs a bit more - good continental breakfast, light lunch, and drinks in the evening with good snacks and desserts, interesting books. Outstanding personal service in the Club lounge make it a 5+. We were able to check in early as requested on our reservation. Some little things matter. When we checked in, the TV didn't work, the bathroom had one bar of soap for the sink, bath and shower (all separated). Total of 2 bath towels. A flimsy, cheap contraption bridged the nice deep tub for the sole purpose of holding 3 washcloths. The device fell into pieces when it was removed, and we buried it under the sink. RIP. The bath items were quickly corrected. Turndown was missed one evening. The TV story is tedious and I was given several possible causes. Fixing it took about 2 hours in the early evening. Be aware that the hotel is on narrow Avery St, midway between Tremont and Washington. Most rooms have direct views of commercial or condo buildings or rooftops of same. Very, very few rooms have a view of the Commons. Arriving or departing by vehicle at rush hours requires extra time and extreme patience. Both Tremont and Washington are 1-way and are jammed at these hours. If you plan to arrive/depart at these hours, best take the T for airport travel. If not for the transportation hassle, I would rate the location as a 5. Biking around Boston is friendly and easy. There are good paths along the waterfront, Charles River, and more. Many streets, especially in Cambridge, have bike lanes. I rented a bike from the friendly staff at t http://www.urbanadventours.com/about.php, which is a short walk from the hotel in the North End. They will deliver to the hotel and have tour/rental packages. I walked and picked up my bike at their store and took off with a good map of the city, which they furnish along with helmet and lock. I greatly miss the original Ritz, which is now a Taj hotel. The \"new\" Ritz is nice, but no match for the original.", "Date": "September 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Boston", "Title": "“Just wonderful”", "Author": "VBS_Boston", "ReviewID": "UR40113825", "Content": "The location is perfect - close to everything. The hotel is top notch when it comes to service and amenities. The lady who checked us in (Amy) was just so sweet and wonderful and the concierge just gave us great recommendations for dining and area attractions. We will be back and highly recommend this hotel to anyone for business or leisure.", "Date": "September 8, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "PA", "Title": "“Expensive but good location and amenities”", "Author": "maxpaste", "ReviewID": "UR38041215", "Content": "We recently stayed in the Club Level for a long weekend and had an enjoyable stay. We've stayed in about 8 other Ritz properties and would rank this one in the middle. The rooms are very nice and clean, and the staff is personable. Although the Club Level is more expensive, it's a really good deal if you plan to use the Ritz as your base for exploring the city. We ate breakfast there, had mid-day snacks, pre-dinner drinks, and desserts later. When you add-up the amount you would have spent on this, the room rates aren't so bad. Except for breakfast, you shouldn't plan on making any of their Club Level food servings your meal for the day. It's mostly high-end appetizers, snacks, and drinks, so you'll want to eat lunch/dinner out. The location is very convenient next to Boston Common, and the key attractions in the city are easily walkable. There is a subway station about 5 minutes away in the park. We felt very safe on the streets, and the town is a great mix of history and modern attractions. Summary: we are not Ritz snobs who complain when staff forget your name or when the stay isn't 100% perfect, so we enjoyed our stay. Although smaller in size and staff than many other Ritz's, it delivers what you normally expect - comfortable beds, clean rooms, friendly staff, and an attention to service.", "Date": "August 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Wilmington, North Carolina", "Title": "“Just terrific”", "Author": "Leatherman", "ReviewID": "UR35990361", "Content": "We had two rooms on the club level. Let me tell you, I have stayed everywhere and I know a good hotel; this is one. The concierge who checked me in kept taking my pulse for the entire weekend. She knew my name and my sons names. The servers at the club level were amazing. BTW, in the building is a the LA gym, to which you have a free pass, and this is the best gym I have ever been in. The rooms are not huge but well laid out and the beds are terrific. There are some great hotels in Boston and this is one.", "Date": "July 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Lovely Little Ritz Carlton”", "Author": "HLStride", "ReviewID": "UR34935323", "Content": "I stayed at the Ritz Carlton Boston Common from July 13, 2009 through July 15, 2009 and could not have been more impressed. The property had a very intimate feel and really had a \"Boutique\" quality to it. I had a reservation for one room on my first evening there with a promise of a connecting room the following night for two of my vhildren who were going to join me for my seconf night. The Ritz was the only major Boston hotel that would guarantee me a connecting room for the second night and they delivered. Upon my arrival at the hotel I was greeted by \"Amy\" one of the two check in officials on duty at the time. Amy was professional and thorough and got me checked in quickly. I found that the hotel had upgraded me to one of their \"Club Level\" one bedroom suites. The room was large (Two count them two bathrooms) a living room and a huge bedroom. The beds were amazingly comfortable and the entire suite was finished in elegant modern styles with traditional accents. Room service was prompt, delicious and reasonably priced. The room I had featured two large LG flat screen televisions and a Bang & Olufsen entertainment system. Cmplaints? Only one really, Like every other Ritz Carlton I have stayed in this one charged $9.95 per day for wireless internet. If I can go to Arby's and get free internet, I should be able to get no extra cost wireless at the Ritz Carlton. One other point, the Hotel employed a gentelman named \"Stanley\" as one of its doormen. Stanley was a great first contact for the hotel. He was thorough and efficient. A real asset to the Hotel. In short the new Ritz Carlton Boston Common is a gem. Tucked away on a quiet side street it is everything I could ask for in a modern urban Super Premium Hotel.", "Date": "July 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Enjoyable stay each time I go!”", "Author": "Phyllo6", "ReviewID": "UR29187011", "Content": "I travel to Boston about every 6 months, each time I stay at the Ritz-Carlton. The service is incredible! You are warmly welcomed by everyone. Anything you need is available for you. The entire hotel is very clean, with the exception of the vases in the hallway..people tend to throw garbage in them, and I suppose housekeeping doesnt notice. The last time I was there I had a corner room with floor to ceiling windows on both outside walls. With the curains opened we had an incredible view with planes flying from Logan airport, and the city. The restaurant Jer-Ne is fantastic! Again the service is great, and the food is to die for. On evenings the restaurant fills with a trendy crowd. In-room dining is also great! The food is hot and presented well. The staff also makes fantastic recommendations if you do not know where to eat, or if you are looking for a nice nightclub. My first time at the hotel the doorman recommended the restaurant Intermission in the theater district upon our arrival for a quick lunch, now it is a staple each time Im in the city. Whats nearby? Boston Common, T stations, Theater district, restaurants, coffee shops, bars, Beacon Hill. I absolutely would recommend this hotel!", "Date": "May 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Bronxville, New York", "Title": "“Ritz Boutique Hotel”", "Author": "J_and_A_1", "ReviewID": "UR26604528", "Content": "This hotel seems to get mixed reviews. It may not be the best Ritz Carlton but it is certainly a very nice hotel. When we checked in it was a little busy, but the hotel staff handled the situation very well and efficiently. Our room was good sized and comfortable. It may not have had a major wow factor, but it was in very good shape and had a large window that overlooked the skyline even though the hotel is on the lower floors of a tall building. The bathroom was standard Ritz, with lots of marble, separate tub, shower, and water closet. The rest of the hotel is very attractive with nice earth tones used and contemporary artwork placed throughout the hotel. The overall feeling created is of a small boutique hotel with modern touches. Some however may find the atmosphere in the hotel restaurant Jer-Ne a little too club like for a Ritz Carlton. We had breakfast here each day. The food was okay, the service very good. A highlight of this hotel is the access to a sports club for a fee of fifteen dollars. Our package included admission. We feel strongly that spas and gyms should always be included in the price of the room, but this is one time when we would not have complained about the charge. This is one amazing gym. Very large and upscale, it is a place that could keep you busy for some time with lots of different activities. The staff at the hotel was very friendly and helpful, even by Ritz Carlton standards. The immediate area around is nothing to write home about. But the location is central and Boston is a compact city making walking easy to most locations. Overall, this is a very nice hotel with great service that lives up to Ritz standards.", "Date": "March 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Long Island", "Title": "“Very Nice Marriott!!!!”", "Author": "sdiam1", "ReviewID": "UR23581635", "Content": "When it was a birthday the place I wanted to be was Boston. Last January, I stayed in the new and wonderful Ritz Carlton White Plains. So, the first hotel I looked to stay anywhere was the Ritz Carlton. Upon arrival, I noticed the relatively small lobby, and one doorman manning the doors (the website did show 2). The bell-hop was friendly, but he did not give us a tour of the room, or how to use the very minor technology in the water closet ( they did this in the Ritz Carlton White Plains). I am not sure how old the pictures of the room on the website are, but not what we stayed in. All in all, it was outdated, and while the service was five-star, I just do not see a real hotel with a trace to Ceaser Ritz.", "Date": "January 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Needham, MA", "Title": "“Ahhh...Just Wonderful”", "Author": "siennatasi", "ReviewID": "UR23138661", "Content": "I went with my mom over the summer for just a girls night getaway and I swear I don't think I've ever experienced anything so amazing. The staff was incredible, only caring what I needed. The room was just pure luxury (and I definitely had the best sleep in the fluffy bed!). For breakfast we went down to the restaurant at the hotel and it was just more of a relaxation. Everything tasted amazing and the service was quick. Later, we got 50 minute facials (which I highly recommend) but it felt like I spent a week in some warm exotic place it was just so relaxing. I was certainly relieved of any stress and had the best time ever. I just can't imagine staying anywhere else in Boston!", "Date": "December 31, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Hoboken, NJ", "Title": "“All Class”", "Author": "jdross19", "ReviewID": "UR21510315", "Content": "This was a great hotel. Luxury. Incredible service. Beautiful, comfortable lobby.", "Date": "November 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Global", "Title": "“Great service!”", "Author": "TheGlobalFinn", "ReviewID": "UR21453727", "Content": "- Our stay got off to a bad start, with us having to move to the Hyatt for one night due to a double-booking. However, the staff more than made up for this with an upgrade to a park view suite for the rest of our stay. - Very friendly staff, excellent service, comfortable rooms and excellent location for both business and pleasure in Boston.", "Date": "November 1, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Yucaipa, California", "Title": "“Not the Best”", "Author": "lovegoodhotels", "ReviewID": "UR21108276", "Content": "This Ritz Carlton has spacious bathrooms and well equipped suites. It is in a good location across from the Boston Common area. However, the decor is drab and the food was bad and overpriced. The service was inconsistent. One day, they go out of their way to help you and the next, they don't have a clue. Upon check in, the man helping us was constantly on the phone connected to his ear and he was oblivious to us at times and didn't know anything about our American Express platinum amenities. The room they put us in at first had continual loud, booming noises that no one could identify. Also, the toilet was broken. They finally moved us to a room with no view but it was quieter. That is, if you don't count the sound of the air unit going off and on every 3 to 5 minutes. It was loud enough to drown out the sound of the t.v. and to keep us up at night. When we checked out, our bill was all wrong. They had over charged us for all kinds of things. Still, the room was kept clean and we did receive a call from Ana in Guest Relations about our problems. She apologized for our trouble and offered us breakfast on the house. Since we already received breakfast with our Am Ex package, we declined. This hotel falls short of the quality and service that any hotel should have, let alone a Ritz Carlton. I doubt we will return.", "Date": "October 22, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "new york city", "Title": "“disappointing: poor service in a cold new hotel”", "Author": "NewYorkCityAndy", "ReviewID": "UR20831942", "Content": "Big disappointment. We fondly remembered the \"old\" Ritz in Boston. It's been replaced by brand spanking new hotel--an argument against \"modernity\". Just struck as a \"cold\" place overall. Some strong points of course (like the excellent hotel restaurant). But major service weakness you don't expect in large suite in a Ritz. Check in experience very bad (no real registration desk oddly). Broken phone in our room. Turn down service didn't arrive until 10 pm. Housekeeping made up the pullout bed by taking beddings off main bed---and then sent someone up with new comforter who had never seen a bed and couldn't assemble it. Wood panel dropped off drawers in bedroom. Pet peeve:only two diet sodas in mini bar. Finally because of traffic patterns it can be pain gettting there. Ritz organisation should take a look asap. Brand damage being done in Boston.", "Date": "October 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Bleh...room for improvement”", "Author": "DocmomBoston_MA", "ReviewID": "UR19962920", "Content": "My husband and I stayed at the Ritz Carlton Boston Common for 2 nights because he had a meeting and the room was covered. Good thing someone else was paying because this place is NOT worth the price. The check-in was typical Ritz where they greet you by name after reading it off the luggage tags and radioing in your name to the staff inside the hotel. Check-in occurs at an intimate desk, making me feel like I was opening a bank account. A glass of champagne was offered at check-in--this was a nice touch. The room itself was very average and typical of one you would find in an Omni or a nice Marriott. The bathroom is typical Ritz with marble and a great separate shower and tub. The adjacent Sports Club LA gym is fantastic and is the best gym in Boston. The problem is that unless you're in a Club Level room, there is an extra fee to use the room. Are you kidding? With the price of a room, this should be complimentary! Overall, we had a pleasant stay but if I had been paying for the room, I would have been extremely disappointed.", "Date": "September 10, 2008"}, {"Ratings": {"Service": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Ny, NY", "Title": "“ok, but have had better Ritz Carlton stays in other cities”", "Author": "Qnstrvlr", "ReviewID": "UR18117970", "Content": "I was disappointed the level of service during my stay at The Ritz-Carlton, Boston Commons. The room, a Club Level Executive Suite, was what I had expected from The Ritz-Carlton or any other luxury hotel. The only drawback to the actual room was its location next to the elevator and the lack of any view from the room. My wife and my disappointment was in reference to the level of service and the Club Level accommodations. My wife and I first stayed at a Ritz-Carlton during our stay in San Francisco, and also had Club Level accommodations there. The two experiences could not have been more different. The staff at The Ritz-Carlton in San Francisco were very courteous and attentive. Within the first hour of checking into the room, we were contacted to see if we needed any help with dinner reservations, tours or anything else in the area. The promptly got us into a restaurant, which we had wanted to try but were unable to secure reservations on our own. The guest manager also visited our room to provide us with a welcome present. We were pleasantly surprised at the selection and quality of the food offered throughout the day at the Club Level Lounge. This was one of the best hotel experiences we have had, and was a key reason why we choose to select the Ritz-Carlton when we traveled to Boston. Our stay at The Ritz-Carlton, Boston Common, had a rocky start. We arrived at about 5:45, although we had originally indicated that our estimated check-in time as 2:00. Even though we arrived almost four hours after the time we indicated, our room was still not available. Although we indicated that we had dinner reservations, the person checking us in was not very responsive and prompt in fixing the situation. After almost 15 minutes, he finally gave us a temporary room to change for our dinner reservations. Because of this delay, we almost did not make our reservations. Even though the person checking us in indicated he would call when the room was ready, he never did. The absence of an apology and poor attention to detail was very offsetting. Fortunately our room was available when we returned. In the morning, we were also disappointed at the food available in the Club Level Lounge. There was a very limited selection and the quality was not what we had expected based on our experience in San Francisco. Because we were so disappointed in the selection and quality, we did not return to the lounge. Later that night we ordered room service. The food was horrible and part of our order was wrong. My wife and I were also disappointed in the concierge service. Although we inquired about a restaurant for Sunday night, we did not get any information. We also were unable to locate the concierge when we were in the Club Level Lounge. Because of the lack of attention and the general inattentiveness of the staff, we were very disappointed in the level of service we received at The Ritz-Carlton. Based on this experience, The Ritz-Carlton Boston Commons will not be necessarily be my first choice when selecting a hotel in the future.", "Date": "July 21, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hong Kong", "Title": "“Ritz Carlton Unadorned”", "Author": "Traveltoomuch79", "ReviewID": "UR18007101", "Content": "I stayed in a Park view suite in May, the hotel was a standard Ritz Carlton. The room was very neutral in decor, the service was representative of a typical Ritz. Pros to the hotel include a great location, I went jogging in the Commons every morning plus they have a superb weight room. There's plenty to do in nearby Boylston and Newbury street. The Copley Plaza is only a short stroll away. The only Con, well the hotel offers nothing distinctive other than the gym, therefore I apologize to all for this uninspiring review.", "Date": "July 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Beyond Perfection!!”", "Author": "jasonbourne1976", "ReviewID": "UR17063995", "Content": "We just completed our stay at the Ritz Carlton Boston Common, and I must say, that I actually feel a sense of loss leaving such an amazing place. I've been in Boston since January for work, and have stayed at other luxury hotels, but the Ritz Carlton was the best experience I have had. My wife and I have stayed at the Ritz, Mandarin Oriental and Shangri-La in Kuala Lumpur; the Park Hyatt in Tokyo; and the Penn in Hong Kong, but the Ritz Carton Boston Common trumps them all. We stayed for 3 evenings in the club level room, and from check-in to departure, everything was perfect. The personnel at the club lounge were attentative, friendly, and caring. We had our 9 month old daughter with us, and everyone was very friendly and tried to give my wife as much help as possible. One of the ladies working in the club lounge, Barbara-Jean, was always very helpful and took extra care of my wife and baby. She even gave us a little toy for our daughter to play with, and always answered my wife's questions quickly. I wish I can remember everyone elses name, but I'm horrible with names! Also, we requested a late check-out since I was working, and it was iffy until the night before. The guest room supervisor, Lance (I think that's his name), was in the hallway and while chatting I mentioned I requested a late check-out because of my wife and baby. He said, \"Consider it done\" and we were able to leave around 5pm w/o any problems! Finally, the room service was excellent at the Ritz. I'm not a fan of room service, but the food was amazing! I was a huge fan of the Mandarin Oriental, and still am, but I have fallen in love with the Ritz Carlton now. Keep up the excellent work and don't change a thing!!!", "Date": "June 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Absolute Perfection!”", "Author": "NoPlaceLikeHome7", "ReviewID": "UR16883998", "Content": "This was our second stay in 6 months at the Ritz/Boston Common, and I don't know when I've been treated better! Hotel staff anticipate your needs, call you by name, and are incredibly gracious in an old fashioned, warm way. We stayed 5 nights both times, the most recent time was for my daughter's wedding. We wedding party and many guests stayed and the experience was amazing. The wedding planner was excellent. Food was first rate. The new ballroom is a great place for a meal for 100+ I would stay there again in a hearbeat. We will have beautiful memories of the wedding and of the wonderful venue. Soft goods (upholestry, drapes, bedding) have been recently upgraded and the service is \"white glove.\"", "Date": "June 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Could not have been better”", "Author": "Oscillating_Fan", "ReviewID": "UR16549835", "Content": "I had an exceptionally good experience at the Boston Ritz in April 2008. The reviews that criticize the views are valid, but that was the only thing I found at all wanting. The staff, starting with Jasna at the front desk, were uniformly excellent. The Club is spacious, had good food, and had a tremendous concierge staff. My room was big and very well done. I travel a lot. This Ritz was outstanding.", "Date": "June 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Austin, TX", "Title": "“Great location in Boston”", "Author": "wickidkid", "ReviewID": "UR16048200", "Content": "We stayed three nights at the Ritz-Carlton Boston Common over Easter Weekend in Mar 2008 while visiting family. Check-in: We arrived at the hotel late (around 9pm). We had reserved an executive suite room. Upon arrival, Sonya at the front desk upgraded us to a luxury suite. We were thrilled, but when we got up to the room, it was next to the elevator shaft, which was quite loud. So we called down to tell her we needed to downgrade back to the executive suite. Well, by that time, they must've given away our room (either that, or they never had it to begin with). We had to wait over an hour before another executive suite was ready. The new room had a Common view, but we were told the room was reserved for the next two nights, so we could only have it for one night. Room: The executive suite was so spacious. It had a hallway closet, half bath, spacious living room with a desk, french doors to the bedroom, a bedroom closet, large bath with double sinks, soaking tub, glass shower and toilet room. The bath products were Bulgari and there were complimentary products for the soaking tub. Service: The service at this Ritz-Carlton was just as stellar as you'd expect at any Ritz-Carlton. The door staff were friendly and would greet you each time you left and returned. We ordered room service each morning and it was always on time. On the last day, they did mess up one food item, but it was still delicious. Some of the nice touches included bottled water and towels for runners returning to the hotel after a jog in the Common each morning, complimentary hot chocolate each afternoon (so great after being in the blistering cold!) and a $1 million art collection throughout the hotel. You can ask the concierge for a brochure for the self-guided tour of the art. Location: This was the best part about this hotel. It is literally steps from Boston Common. It made it easy to walk the Freedom Trail and is close to many of the monuments Boston is famous for. We caught a matinee of Avenue Q at the Colonial and it was just a 10 minute walk. It's within walking distance of Quincy Market and just a little beyond that is the North End. It also has a train station nearby to get to other parts of the city. The only thing that I thought was weird was this hotel is connected to a movie theatre and is actually BEHIND it, so it does not directly face the Common. The hotel is on the 9th-12th floors of the building and only like two rooms on each floor face the Common - most rooms have a \"city view\" or a partial view of the Common. But there are lots of restaurants within walking distance, plus the shopping at Quincy Market. There's even a CVS just down the block. Food: We ordered room service each day for breakfast and the food was always great! They messed up our order one day, but we didn't mind because it was so tasty! They recommend reservations if you're having breakfast on Sunday morning, since Jer-Ne (the restaurant) is not that big. We had drinks in Jer-Ne one evening and the martinis on the menu were great. I highly recommend having something off the dessert menu. Check-out: It was quick and easy. The video checkout wasn't working, but they give you a statement on your door the last day and all you do is hand it to someone in the lobby if you have no disputes. Two days after we checked out, my credit card got some mysterious additional charges. After talking to them three times, I finally got them to understand that I had switched rooms after one night and that I didn't actually have two rooms the whole stay. They refunded my $800 once they figured it out, but without apology, which was unfortunate. I still loved the hotel and would definitely stay here again on a return trip to Boston.", "Date": "May 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Waltham, Massachusetts", "Title": "“Great Birthday Weekend”", "Author": "kemahone", "ReviewID": "UR14330930", "Content": "My boyfriend surprised me with a weekend trip to the Ritz-Carlton in Boston for my birthday, and we had a great time. We stayed in an executive suite and when he booked he had to buy the club option. We ate lunch twice in the club since it was included, and we were pleased with the food and view from the club. The suite was nice - no complaints. We entertained 5 friends on Friday night in the living room and it was comfortable. Room service food was good as well as drinks and appetizers (especially warm bread!) in the lobby/fire place sitting area. The staff was cordial and accomodating, and we experienced the luxury we expected at the Ritz.", "Date": "March 16, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "New York", "Title": "“Terrible Experience.”", "Author": "FrequentTravel81", "ReviewID": "UR13502287", "Content": "Stayed at the Ritz Carlton Boston Common Friday evening on a last minute business trip. Room was nice and clean, service was as expected at a five-star hotel. I don't usually write reviews, and have had good experiences previously at all the Ritz Locations (including SF, Boston, Singapore) but this stay honestly ruined my weekend. On Saturday morning, I left the room at 8:30am to get breakfast and find a charger for my phone. By 10:00am, when I had returned to my room, the hotel cleaning staff had emptied my room, thrown away my notes from a conference call I had scribbled on the bedside notepad, removed my clothes and dumped them in a lost and found bag. All this and I had not checked out yet! Now there was a conference in Boston that week and rooms were in short supply, but this treatment was ridiculous. They had basically emptied my room even though I had not checked out yet! I had to call clients on a saturday weekend (and spend some excruciating hrs waiting to reach another client who had taken an intercontinental flight) to go over their account details and follow up with my colleagues over the lost notes. Admittedly, some of it could be blamed on me for not backing up the data on my laptop, but I did not expect the hotel to throw away my personal effects with such alacrity . Maybe its not fair to give them a 1 point rating for an isolated incident, but I feel that a good hotel experience is one when you don't feel any inconvenience from staying in a different city. The rush job I received from the Boston Ritz Carlton utterly failed in this regard.", "Date": "February 12, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Minnetonka, Minnesota", "Title": "“Excellent Hotel in a great location”", "Author": "hipcat36", "ReviewID": "UR13466094", "Content": "Ritz Carlton's are awesome and this was no exception! The Rtiz in Boston is excellent. It's different though as it is much more contemporary then the norm Ritz traditonal fare... Some people may not like this about it but I quite enjoyed the contemporary feel. The bar and restaurant Jerne is also EXCELLENT. I stayed in a king club room and it was very nice and comfortable. The club room had excellent breakfast, afternoon tea, etc. The location is just off the Common so you can truly walk anywhere. Great location, great service, very nice comfortable room and dine at Jerne.", "Date": "February 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "boston, MA", "Title": "“Great hotel, still needs improvment”", "Author": "atravellerboston", "ReviewID": "UR13073587", "Content": "My husband and I spent a weekend here on a â€œBed and Breakfastâ€� package. It is a typical Ritz-Carlton. The room is nicely furnished, very decent size bathroom, Bulgari bathroom amenity, and the hotel location is good. In short, it is all you should expect from a luxury hotel of this caliber. The hotel staffs are very courteous. Everyone we met greets us graciously and wants to know if there is anything they can help us. Overall it is a good stay. Now here comes the rant: The package we have should include a â€œWelcome Amenityâ€�. We never got it. The package includes two American breakfasts. The regular â€œbed and breakfastâ€� package you can book on Ritz-Carltonâ€™s website only includes continental breakfast. I specifically mentioned that to the waiter at the restaurant, he brought us continental breakfast anyway. Since we actually didnâ€™t really care too much for the eggs, breakfast meat and potatoes anyway, we let it go. But nonetheless, not what you expected from a Ritz-Carlton. Donâ€™t get me wrong, overall the hotel is great. But it is small details that set the truly great hotel apart from just a good hotel. There is still more work needs to be done here.", "Date": "January 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Fabulous in every way!!!!”", "Author": "Vnyrdr", "ReviewID": "UR12663684", "Content": "We have stayed at the old Ritz on Newbury many times, but this was our first stay at the new Ritz Carlton Boston Common. The feel is totally different, but just as luxurious; sleek and modern with an asian flair, and an amazing art collection. We stayed 6 nights in a suite on the 9th floor; it was about 900 sq. ft., with floor to ceiling windows overlooking the entire Boston Common. The suite was immaculate, and the furnishings seemed brand new. There was plenty of natural light, and there were two 42\" plasma TVs. The club lounge was also immaculate and very well provisioned. The staff far exceeded our expectations, seing to our every need, and it seemed that the entire staff had immediately learned our names within minutes of arrival. We very much look forward to many return visits!", "Date": "January 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "NYC", "Title": "“Average”", "Author": "NYCGirlNyc", "ReviewID": "UR10080948", "Content": "Had a very average experience at the Ritz. The location is great and within walking distance of most everything in Boston, which is really the only reason I could find to warrant staying here. The entire hotel is very dark. There are hardly any windows or natural light making it seem very dreary. The rooms were also disappointing; I found the rooms to be also lacking in natural light, (unless you end up in one of the very few rooms overlooking the park) making them gloomy. My room had a lovely view of the A/C units on the back roof. The furnishing is typical Ritz Style however the rooms lack in available electric outlet. The bathrooms admittedly are very nice, large and spacious with all of the amenities you would expect at the Ritz. The thing that really made me laugh is the amenity basket they choose to send me (I travel a lot and frequently receive welcome gifts from the hotels I stay with). I was sent a very lovely basket of assorted teas and little cookies, which was very nice however they neglect to send hot water, making the tea useless. All and all I was disappointed with the hotel.", "Date": "October 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Decent Ritz in Boston”", "Author": "rsp1", "ReviewID": "UR10074699", "Content": "Had a very average experience at the Ritz. The staff, as with most of their properties, was excellent and accommodating. They were generally prompt with all requests. One notable exception was that, for some reason, delivery of a fax required a second follow-up call. The location is excellent and within walking distance of most everything in Boston. The rooms were most disappointing, especially for a relatively new facility. While the beds were comfortable and bathrooms nice, the furnishings were disappointing. The desk is somewhat small and the side/coffee table is about 12\" across. The room had a 25\" tube TV, which is inexcusable these days (not HD, not flatscreen, not 16x9) for this level of facility. The TV is in a cheap armoire that one would expect to find at the local Sheraton. It was difficult to find a free power outlet and the desk outlet was, for some odd reason, connected to the lightswitch by the door. This means that when the maid finishes cleaning and shuts off the light, your laptop is going to die about 90 minutes later if left plugged in. There is wireless internet, which works fine, and they provide free bottled water. The lobby restaurant is very good. One benefit of this hotel is the Sports Club LA gym. For a top hotel in Boston, I would definitely pick the Four Seasons or Taj over this property.", "Date": "October 13, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Excellent Hotel”", "Author": "TTotev", "ReviewID": "UR8839081", "Content": "As you would read from the other reviews this is really a wonderful hotel, great location with excellent management. Few tips: - Upgrade to club level - it gives you access to the Lounge where you would find very very good food service throughout the day; it gives you free access to the Sports Club LA which is connected to the hotel and it is great; gives you free internet. - Use the valet parking - great service and very attentive. - The hotel restaurant is typical hotel restaurant - overpriced and blant. Boston has better places. We had a great experience in a wonderful corner room overlooking Boston Commons. Service was perfect, decoration great. By far the best hotel in Boston! Have fun.", "Date": "September 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Michigan", "Title": "“Another Fantastic Ritz Property”", "Author": "sunkissed518", "ReviewID": "UR8688334", "Content": "We stayed at the Ritz Boston Common for a four day getaway. We stayed on the 12th floor, club level- couldn't asked for anything better. We had a corner room, which overlooked the city skyline- amazing view! We were thoughtfully welcomed with a Godiva chocolate presentation on our first night. Furnishings were nice, as you would expect from a Ritz. The bed was so unbelievably comfortable, we loved the down comforter, high thread-count sheets, and plenty of down pillows. I hadn't slept so well in months! The bathroom was fabulous, wel-appointed with Bulgari toiletries, plenty of fresh towels and robes, and a much-used soaking tub. Very relaxing! Concierge and club concierge were amazing, so friendly and willing to help. Club lounge was comfortable and offered great little meals and drinks. Upgrading to the club level was certainly worth it, you definitely get what you pay for. Hotel restaurant, Jer-Ne, served great food, although service was a bit slow. I highly recommend this property, we had an absolutely wonderful stay.", "Date": "September 10, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "milan, italy", "Title": "“Truly excellent”", "Author": "silkroad91", "ReviewID": "UR8534940", "Content": "Truly excellent, staid here (for business again) also 10 yrs ago quality still top. Recomendable!", "Date": "August 29, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Above average at best”", "Author": "mindyt", "ReviewID": "UR8463733", "Content": "My husband and I recently got back from a 3-night stay at the Ritz in Boston Common. We had a deluxe room overlooking a lovely garden. The room was quite nice, in a to-be-expected lovely Ritz Carlton way. We found the concierge to be ok at best, which was a disappointment as we have had wonderful concierges at other RC properties. In fact a couple of times we went over to the Taj, (which used to be a Ritz), and sought help from their concierge who was outstanding (we will probably try staying there next time). Additionally, I left a package at the front desk for a friend who was to be staying there 3 days after I checked out. I double confirmed with them they would give it to her. She never received it, which really made me angry. The highlight for me was the absolutely amazing Sports Club LA which is attached to the hotel. It is one of the nicest, well equipped gyms I have ever been in while at a hotel. If a gym is important to you, as it is to me, I recommend staying here for that alone. They also have a great breakfast/lunch place in the gym which is easy, fast and convenient. The location is wonderful, the rooms nicely kept and overall it was an above average experience, though there is room for improvement in the service area. And the hotel, although somewhat modern, is not as nice other Ritz's and other high end hotels.", "Date": "August 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "3.0", "Value": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sunfish Lake, MN", "Title": "“OK, convenient, but brutally expensive.”", "Author": "MacWilder", "ReviewID": "UR8105497", "Content": "Stayed there as a guest and also helped organize a 60 person conference there. Service is good. However, numerous problems. Internet connection slowed to 30 kps for extended periods, which is effectively unusable. This is a common problem with Ritz Carltons. Expenses there verge on the obscene. A routine breakfast for two on Sunday morning was $65 with a single glass of orange juice coming in at $6. The fee for a projector for three days was close to $10,000, far more than the projector would cost. There are only two elevators, and when one broke down, extensive delays resulted. In short, OK (but not outstanding), especially if one is on an unlimited budget.", "Date": "July 12, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "London, England", "Title": "“Average hotel. Run-of-the-mill”", "Author": "hanyu", "ReviewID": "UR7935339", "Content": "Typical Ritz-Carlton decor. The room (a deluxe one I think) was quite suitable in size though the amenities are average, with an old TV, none of the usual little RC touches like collar stays and signature vanity sets etc. Service at the front desk was warm and effusive, in the signature RC way. Quite lovely though the staff asking us to call them to tell them if the room was okay was a nice gesture but not appropriate. As service staff, you should be the one doing the calling rather than get your guests to \"report\" to you. She even quizzed us on why we didn't call her when we came down to go out for dinner. The idea was a lovely personal one but the execution not quite appropriate. Location isn't the best. Grumpy buildings and graffiti surround one side of the neighbourhood. However, the intimate lobby is one of the best I've seen. All in all, okay but nothing special. Again, the 4 seasons shines out as the superior choice (though comparing with other U.S. cities, not by that much).", "Date": "June 19, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Boston", "Title": "“Jer-ne - Not worth the trip”", "Author": "LQSB", "ReviewID": "UR7549402", "Content": "We live in a Boston suburb and stopped into Jer-ne for a pre-matinee luncheon. At first, service was fine but they seemed to forget about us as time went on. Water was never refilled and our meal was relatively slow coming out. After eating, we waited for quite awhile for a server but my 10 year old really need to visit the rest room. We left coats on our chairs and sunglasses on the table but we were practically chased into the lobby asking if we were leaving!!! Afterwards, we ordered tea and dessert. Mid-course we had to ask for napkins which had been cleared and never replaced. The food was fine but nothing special and I'lll not be dining here again.", "Date": "May 5, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Dont let the bed bugs bite”", "Author": "Hiddenbay2005", "ReviewID": "UR7226925", "Content": "I rencently stayed at this hotel and everything in the room was very nice along with the service. So with that being said I must tell that I was attacked by bed bugs and had over 40 bites all over my body. Moral of this story is that it does not matter how nice the hotel, take the sheets and mattress cover off and check things out. You will see the bugs or blood spots if they are there and you will be happy you checked. Having these bites is not pleasant. If you are staying in New York or Boston the high end hotels are experiencing beg bug problems so beware! Mabe it is because they have feather top mattresses.", "Date": "March 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santa Monica, California", "Title": "“Always a Terrific Stay”", "Author": "ANGshire", "ReviewID": "UR6901213", "Content": "My husband and I now stay at the Ritz whenever in Boston for either business or pleasure. While we have enjoyed both the Four Seasons and Langham in the past, the Ritz hotel and staff have made it impossible for us to stay anywhere else. While we certainly enjoy the contemporary and luxurious, but comfortable, feel of this hotel - it is Steadley at the front door, Kemal the front of the house manager, Gabe on the concierge floor and Tim with maintenance who have made this a home away from home. All have bent over backwards to develop a professional relationship with us - accommodating requests 'with pleasure'. While some of the room furnishings have become a bit worn, the rooms are very well kept and clean. The beds extremely comfortable, the sheets soft and extra pillows and blankets are provided in the closet. The Deluxe rooms are standard in size and the executive suites are apartment like with a separate living room and 1.5 bath. The large windows do open. The bathrooms luxurious with marble tiles/counter, separate shower and large deep tup. The towels are thick and soft. Note that we learned that the hotel will shortly be undergoing a soft renovation of all rooms and a full renovation of the lobby. This goes to show that the hotel is well aware of the need for new furnishings, the concierge desk is easily confused with the front desk, there is a lack of seating and the lobby offers a cold welcome. Although, as noted above, we have come to know the maintenance staff; that is not say that we are disappointed. Things go wrong, it's inevitable - it is how the 'wrong' is addressed. We have learned that Ritz staff are empowered to make decisions to resolve problems directly with the customer, ensuring that any problem can be addressed quickly and professionally. There appears to be little need for staff to haggle with management, those who work on the issue solve the problem directly (even financially). That's a great way of doing business. The concierge/club service is well worth the added expense if you plan to spend the day at / come back to the hotel. For example, we use the club room for doing business (wireless access included on floor 12), getting a cup of coffee and a bowl of oatmeal in the morning, lunch (it's an actual lunch in a bento box) and a glass of wine, cheese and desert after/before dinner - all without having to call, wait and sign for room service. It's the ease of having your own kitchen without the mess. Everything is ready, tasty and Gabe, the club concierge, is wonderful. With respect to room service, we would like to see an expanded room service menu. The menu is fairly limited and the restaurant (JerNe) does not appear to be all that interesting. The Ritz guests can take advantage of the LA Sports Club. The facilities are gorgeous and full service. The location is idea for us, walk to the financial district for work or walk through the Common to dinner. The hotel website accurately reflects the look and feel of the rooms and common areas. All in all, always a wonderful stay.", "Date": "March 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Fantastic Experience”", "Author": "EastWest03", "ReviewID": "UR6612469", "Content": "My wife and daughter accompanied me on a business weekend in Boston. We had been told by a friend who had stayed in the hotel a few weeks previously that we should definitely give it a try. From the minute we drove up to check-out time, we were treated exceptionally well. Our 2 year old daughter was even catered to...they wheeled out a wagon full of toys when we checked in. She couldn't have been happier. The room was very comfortable and the bathroom was stocked with everything you could need. I would recommend staying on the Club Level as the food service/afternoon tea/Cordials & Chocolate services throughout the day were an added treat...and very well done. The concierge service was first rate. We will definitely stay here again.", "Date": "January 17, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "CT", "Title": "“Ritz was below expectations”", "Author": "KMB4905", "ReviewID": "UR6318021", "Content": "I recently traveled to Boston on business and stayed at The Ritz, Boston Common. I was very disappointed with the hotel from the moment that I walked in the entrance. There was only one person working at the check-in desk (I thought it was unusual that the front desk only accommodated one clerk). After checking in, I proceeded to the first hotel room that I was assigned and I immediately called the front desk to request another room. The bed sheets were torn, there were large, unsightly stains on the carpet and the lighting was terrible. The second room had similar issues - the furniture and carpet were old and visibly unclean, the room was not well-lit, and the towels had stains. I would absolutely not recommend this hotel.", "Date": "December 2, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Outstanding, As Always”", "Author": "ocGlobetraveler", "ReviewID": "UR6165269", "Content": "I have had the pleasure of staying at the Ritz-Carlton Boston Common several times. I am consistently impressed by the outstanding experience this hotel delivers. One thing to note: there are two Ritz-Carlton properties in Boston. The other property, the Original Ritz-Carlton Boston, which caters to a more traditional guest, will be changing hands in January. The property was sold and will be changing its name to \"TAJ\" The Ritz-Carlton Boston Common offers an intimate boutique like hotel experience, with all of the service and amenities Ritz-Carlton is known for. This is one of their more contemporary properties. Location: Located on the outer edge of the Boston Common Park, the hotel is within walking distance to the park, Beacon Hill, Newbury Street and other major attractions. This hotel is part of a multi-use hotel/residence configuration. Service: The service is absolutely outstanding on every level. The staff cannot help you enough. Everyone from the front desk staff, to the concierge, housekeeping etc. are there to please. Rooms: We were upgraded to an Executive Suite on this visit (pictures attached) Executive suites are approximately 800 sq. feet in size, with one and a half baths and King Size Beds. Standard rooms are also quite spacious, measuring almost 500 sq. Feet in size. All rooms include superb bedding with down duvets, featherbeds and wonderful linens. Bathroom amenities are also outstanding. Every bathroom in the hotel features a tub as well as a separate glass enclosed marble shower stall. If you have an opportunity, I would highly recommend staying on the club level. The club level offers five daily food presentations, which are absolutely amazing. During the week, they offer a \"Bento Box Meal Option\" for lunch which was excellent. They literally give you a lunch that would cost you $50 in the restaurant. You could almost eat all of your meals in the club, as they do a spectacular job with their offerings. Alcohol is also included with club. Facilities: The hotel offers its guestâ€™s access to the Sports Club LA, which I did not have a chance to use. I did hear however that it's a great gym facility. In conclusion, a wonderful hotel option while staying in Boston. It's closest competition would probably be the Four Seasons Boston as well as Fifteen Beacon. Try the Ritz-Carlton, and you won't be disappointed!", "Date": "November 22, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boston MA", "Title": "“A superb experience all around!”", "Author": "twinkies", "ReviewID": "UR6027096", "Content": "Spent 3 wonderful nights at the Ritz Carlton on Avery Street. EVERYTHING was outstanding. I've stayed at several Ritz Carltons before, and this one was really top notch. The decor is lovely - not overdone, but quietly elegant. The rooms were decently spacious for a city hotel & the bed was sooooo comfortable - wonderful down comforter, fluffy pillows. The service was impeccable - all of the doormen were super attentive, and often refused to even take tips, even after helping us to our car with packages or luggage. They were also very helpful in recommending restaurants, giving driving directions, etc. The restaurant/bar in the hotel is very hip. We didn't eat dinner there, but we heard it was very good. The bar fills up in the evening with a 35-45 after work crowd. The gym in the hotel in second to none, and there is also a nice cafe adjacent to the gym. I really can't say anything bad about this hotel! It was a wonderful experience! Oh - note that while the hotel is called \"on the Common\", it really isn't - it's down a side street off of the Common. Nonetheless, still great!", "Date": "October 29, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Suburbs", "Title": "“Nicest hotel that I have stayed in Boston”", "Author": "horseneck", "ReviewID": "UR5972413", "Content": "I have stayed in a few hotels in downtown Boston in the last few months. All were upscale hotels, the Coply Plaza... nice lobby, yucky small room, The Fairmont Copley Plaza, nicer, simply lobby, nice room, but everything is an arm and a leg after that. 40/nite to park, 50 for 2 pots of coffee... nothing else, just coffee. No coffee machines.... must have coffee in morning. The Ritz was nice, simple lobby, nice bar attached, reasonable upscale drink prices, nice big room, great marble bath, bigger than the other 2 hotels put together. The hallways were even elegant, most are not. We also had breakfast delivered in the morning, not cheap, 40 for 2 people, but it was a rare treat. Table with linen, flowers, arrived at our room as schedualed..... wonderful... Parking is still expensive...40/nite, but the overall atmosphere of the rooms and halls, and reasonable roomservice and snack prices were welcome. It is right down town near shopping and the common. Not much to look at from the outside, but there was a great dance club right around the corner, Felts... and was great to walk home to the Ritz. Can't wait to stay there again.", "Date": "October 19, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kansas City MO", "Title": "“Best Ritz in Boston”", "Author": "mkoury83", "ReviewID": "UR5623491", "Content": "Went to the Ritz Boston Common for my Mom's 60th. Everything was taken care of (flowers & card) before we arrived. We had one club room, and one club luxury suite on the 12th floor, which adjoined in a private enclave in the hall. The rooms were very clean and well kept. Our view faced the financial district and was a respectable view considering the density of buildings in the area. Staying on the club level is key, breakfast alone is worth the extra money. All the staff in the club lounge were friendly and helpful, and the iced tea was literally the best I've ever had. Overall our four nights at the Ritz went perfectly. I have stayed at the Ritz on Arlington in Boston, and this one is better. It is clearly a business traveler's hotel, but was aptly conducive to leisure travel like ours. The location is unbeatable, with quick access to the T and all of downtown. Kristen, who seemed to work everywhere (downstairs & club lounge) was one of the friendliest and most helpful members of this Ritz staff, definitely an asset to the hotel. As a discriminating traveler, I do not hesitate to give this location a five star rating.", "Date": "August 18, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "5", "Service": "5"}, "AuthorLocation": "Fords, New Jersey", "Title": "“Putin' on the Ritz”", "Author": "BigEandKenna", "ReviewID": "UR5430021", "Content": "A very nice hotel in a crummy area. After a short cab ride from Logan, we were greated by friendly and helpfull staff.The Concierge was friendly and so skilled he was able to find me an Irish Pub within walking distance with the YANKEE GAME ON!!. Not a small feat in Red Sox world. We loved our room. The beds are great and the bathroom huge. We did have a problem with our room not being ready when we arrived (5pm). The only downside to this hotel is the neighborhood. Being a native New Yorker, cities don't scare me. But I was supprised at the amout of pan-hadling going on just steps from the front door. Boston could learn a lot from New York on how to clean up it's streets.", "Date": "July 5, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Chicago, IL", "Title": "“Souless hotel in a decaying area”", "Author": "NJD1_7", "ReviewID": "UR5360784", "Content": "Not up to Ritz Carlton standards at all. We checked in to be told our room wasn't ready (it was 4pm) and to come back in an hour. No offer to take luggage or provide a drink. The hotel restaurant has closed due to lack of interest, and thus all your meals are taken in a rather bland bar that has a snack menu. The food is distinctly average, and the service stretched. The rooms are not 5 star standard at all, and this jaded part of Boston seems to rub off on the people here - it's gloomy and depressing....", "Date": "June 19, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Philadelphia, PA", "Title": "“The Ritz is the place!”", "Author": "mmansfie", "ReviewID": "UR4354541", "Content": "Stayed at the Ritz Carlton Boston Common, what a hotel. Its beautiful! I have stayed at Ritz's before, and this is just like the rest, top notch! I have read previous reviews about this hotel, and I cannot understand how someone would rate this hotel poorly. We were lucky and had a room overlooking the common. If you are a gym person, The Sports Club next door is amazing. The only thing is the location could be a bit better.", "Date": "January 15, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Montreal, QC", "Title": "“Better than reviewd”", "Author": "Daoda", "ReviewID": "UR4032895", "Content": "I was pleasantly surprised with the hotel after reading the reviews here. I had a corporate rate and may not have been as happy if the room had cost $500/night, but I was very impressed with my experience. The room and bathroom were large, all the furnishings and amenities were stylish and top quality. The lobby is lovely and the staff was pleasant and helpful (this being Boston, no one is ever too solicitous). The only negative is the location--the hotel is down a street off of the Common towards the theater district, which remains a bit dirty. Still, you're 20 feet from the Common and close to everything. Would certainly stay here again.", "Date": "October 18, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Don't Stay Here .. Not Worth the Price”", "Author": "A TripAdvisor Member", "ReviewID": "UR3931822", "Content": "My girlfriends and I stayed here to celebrate our 40th birthdays. We had planned this weekend getaway back in February, so we were all looking forward to it. There was 6 of us so we rented 2 ajoining rooms at the rate of $450/night/room. We stayed 2 nights so with taxes and parking charges we spent in total over $2000. All of us expected a certain level of service since we were staying at the Ritz, however this hotel certainly didn't meet what we would consider Ritz standards. The rooms were fine. They were clean with well appointed bathrooms, but nothing to get excited about. The service however was awful. The first night we were there, I made 20 calls to the bell man, before someone in hotel communications picked up the phone. Then on Saturday night before we left for dinner at 8:00, we requested to have extra hotels delivered to our room and our trash removed. When we returned at 11:30, neither request was fullfilled. I made another call to housekeeping and then finally things were taken care of. In my opinion, for the rates we were paying, we should have had nightly turn down service. I did speak with a manager when we checked out and he said he would make it worth our while to return, however all we received was a letter of apology. Needless to say, we have no plans to return to this hotel. My husband and I stayed at the Four Seasons Boston in February of 2005 and had a wonderful stay. The service there was impeccable as is service at all the Four Seaons that I have stayed at. If you are willing to pay Ritz Carlton prices, then I would recommend staying at the Four Seasons instead!", "Date": "September 22, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "2", "Service": "2", "Rooms": "4"}, "AuthorLocation": "pittsburgh", "Title": "“Nice Hotel but....”", "Author": "raz24", "ReviewID": "UR3836997", "Content": "Just stayed at this hotel with husband and children (15 and 7). Bellmen, vallet gentlemen very nice. Front desk people snobby, and always seemed as if they didn't want to answer your questions. Conceirge woman new what she was talking about, but not very friendly. Location was a few blocks from Newberry St. (through the park) Nice park, lots of homeless people. Room was on the 10th floor. Very nice room. Nothing over the top though. It was a decent sizewith very comfy beds and nice linens. Foyer of this room was very large, seems like wasted space. Bathroom very nice separate bath and glass shower. View was a roof, with a few small bushes planted there to offset the drab view. My biggest problem was the use or non use of the pool. The pool is not for children under 18? Maybe it was 16. All I know is, the person in our family who would want to use the pool most is 7 and she was unable to. They do have family swim hours, two hours on Sunday. You could also pay for swimming lessons, that also gets your child in the pool. Last but not least, parking is aprox. $37 a night. We used Amex Points not worth the 55,000 points a night and definately not worth the $495.00 rate they put on my room key folder.", "Date": "September 1, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Not much of a Ritz”", "Author": "A TripAdvisor Member", "ReviewID": "UR3676155", "Content": "Rooms are relatively nice and decor is beautiful but staff is poorly trained and charges appear without explanation. There is a hidden 10$ charge for using the health club (in a $500/night hotel??). In addition, we had three other unexplained charges after providing a credit card for incidentals. When I called I was placed on hold for 25 minutes taling to a supervisor. Is that the way to treat the kind of clientele the Ritz claims to target? I would advise staying away or don't give your credit card number. Big waste of time!", "Date": "July 17, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Sad to see this hotel and area going down hill”", "Author": "OutOfUSA", "ReviewID": "UR3652849", "Content": "We loved this hotel when we stayed there many times in year 2001. We went back in May, 2005 and found glory day was over for this hotel. Starter, there was no bellman in front-unthinkable 4 yrs ago. Front desk staff was pleasant but all negative, \"no\", \"nothing\". Very thin staffing. We booked suite-no view, looking over concrete roof, but the bed was worse. My side smelled so bad, if I were not that tired, I would have checked out. My husband side was ok. Furniture were old and cracked. It was obvious that upkeeping was not done well. There was no bath salt as used to be. They did not even replaced my shampoo. I had to call for extra soap for bath tub. One sign how bad hotel is doing is that their flagship Jer-ne restrurant is closed(!). It was an expensive but a beautiful restrurant. Now it is gone. Sports club LA-boston was still going strong and I see more young members. We enjoyed working out there. But the area itself-it was up and coming then-is now going down hill. Ritz boston common condos are still not sold, new movie theater is expect to close down. Sad to be back there -but we still remembered watching new year firework @boston common in our ritz suite-Best view in town. We will go for the old ritz next time though.", "Date": "July 9, 2005"}], "HotelInfo": {"Name": "Ritz-Carlton Boston Common", "HotelURL": "/ShowUserReviews-g60745-d222955-Reviews-Ritz_Carlton_Boston_Common-Boston_Massachusetts.html", "Price": "$465 - $798*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">10 Avery Street</span>, <span class=\"locality\"><span property=\"v:locality\">Boston</span>, <span property=\"v:region\">MA</span> <span property=\"v:postal-code\">02111</span></span> </span> </span> </address>", "HotelID": "222955", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/94/bd/94bd40bcc7e57e5bcbc52795d36f152f5large.jpg"}}