{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1"}, "AuthorLocation": "Seattle, Washington", "Title": "“Impossible !”", "Author": "Alexander E", "ReviewID": "UR125659230", "Content": "I booked a room 24 hours in advance and had to call back and cancell. Was told they have a \"48 hour cancellation policy\" ... i.e., a catch 22 ripoff in their favor ! Sleazy management, totally indifferent clock watching staff with a telephone number that is frequently \"temporarily not available\" when you call. SAVE YOURSELF THE TROUBLE !", "Date": "March 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Eaten alive by bed bugs”", "Author": "emveezee", "ReviewID": "UR119835952", "Content": "Not much more to say. Room 206. Stayed two nights and was taking night-time cold medication so I was pretty well passed out. Didn't start to notice the itching until the night I returned from my trip. Probably 200-250 bites appeared on my arms and back.", "Date": "October 28, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Laguna Niguel, California", "Title": "“Morning Wakeup Call by Roaches”", "Author": "Cavan C", "ReviewID": "UR119813232", "Content": "The hotel didn't seem too bad til I woke up in the morning, and beheld roaches crawling all over the walls. I decided never to stay at this hotel ever again. I've stayed in nice Vagabond Inns elsewhere in California, such as the excellent ones in Palm Springs and Long Beach. It's an excellent chain, but they ought to revoke the franchise of this Vine Street hotel.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Honolulu, Hawaii", "Title": "“Good for price!! Would stay again!!”", "Author": "AussieLeethal", "ReviewID": "UR118720905", "Content": "Vagabond was a last minute booking for our Hollywood stay and for the price we were satisfied with the room we had. It's close to most things and free parking and wifi (although the wifi is a bit temperamental at times). Free breaky which is pretty good. All in all a good stay.", "Date": "September 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Great Value For Your Money - Immaculate Rooms”", "Author": "Loob1970", "ReviewID": "UR116824511", "Content": "My boyfriend and I stayed here for one week whilst visiting my mother in LA last year. We didn't expect much because the price was very competitive so when we arrived, we were very surprised at how fab the room was. I had previously stayed nearer to Hollywood Boulevard in 2005 and the Vagabond was far superior to our previous hotel. Basic, very clean and spacious accommodation however the swimming pool was sort of in the parking lot so don't expect to chill out at the pool, its also almost on the main road, so if you want to chill by a pool go to a larger hotel. Overall, great value for money but a good 20mins walk to the main Hollywood restaurants and attractions - car hire is a must !", "Date": "August 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“Awful. Don't stay here!”", "Author": "LilyLimpet", "ReviewID": "UR108740567", "Content": "First room we had on ground floor didn't lock & could see unsavoury characters hanging around the parking lot. Also got a strange phonecall within about 3 minutes of being in the room, did not like this, total lack of security. we did get moved after making a fuss, did not like having to advertise the fact we were two females & if it wasn't so late, would have checked into the Hyatt. If you want cheap and safe in LA, it doesn't seem to exist. The rooms were awful too, dirty and smelly. At least our car wasn't on bricks when we woke up", "Date": "May 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Oakland, California", "Title": "“Don't let the sunny picture fool you!”", "Author": "yw4me", "ReviewID": "UR94313268", "Content": "At $109.00 a night on New years day it still was a rip-off. I looked at the picture when I made the reservations and it looked okay. When the supershuttle dropped me and my friend off, I asked if this was the right place. It is across the street from the social security office and a mental heath clinic in a seedy part of L.A. The first room we checked into had the toilet overflowing, When I called to the front desk he said he would have to come and check then after I changed rooms the telephone didnt work. I told the front desk guy that that phone didnt work, he said are you going to make a call! Well, since we were in a bad neighborhood, I'm thinking 911 isn't out of the realm of possibility so yes I am going to use the phone. He went next door and took the phone from the other room and gave it to me. The door looked as if someone had kicked it in on a previous stay so I had to prop the chair under the doorknob to sleep. The frontdesk staff are not friendly and heaven forbid you need anything.", "Date": "January 24, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Calgary", "Title": "“Wasn't too bad...”", "Author": "thekittenlady", "ReviewID": "UR64544080", "Content": "Pretty basic, no frills accommodation. I (thankfully) did not encounter any vermin as some other past guests have. The room wasn't anything special, but it was clean. The area seems like it can be a bit sketchy if you were to walk after dark, but we drove so it was no concern to us really. It's close to the touristy stuff you want to see in Hollywood which is why we chose it, and for the low price we weren't disappointed. Based on my experience I would recommend it to the budget conscious traveler, but if you're expecting the Ritz you are going to be extremely unhappy.", "Date": "May 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "california", "Title": "“the location is pathetic”", "Author": "lunsford619", "ReviewID": "UR59066552", "Content": "at first when we checked into the hotel it looked really good and the staff was also good , but as we entered into the room it was really smelly, there were big roaches,bed bugs. Our trip was supposed to be a romantic one but turned out to be a nightmare. There were lot of transsexuals and prostitutes who were moving in and out of the hotel very frequently. me and my wife felt really insecure. the place is really noisy, the walls are so thin so that you can even listen the person in the next room.", "Date": "March 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "San Diego", "Title": "“The service here is horrible!”", "Author": "lankus", "ReviewID": "UR45752384", "Content": "My friends and I figured this would be a perfect place to stay in order to safely take our friend out on the strip and it turned into an absolute nightmare! Forgot having any of your friends over to this place, even while preparing to go out on the town. We were harassed multiple times by the person at the front desk telling us that everyone had to leave within thirty minutes unless we paid for each of them, and only up to a maximum of four could be paid for, the rest had to leave. It was completely understandable that they didn't want extra vehicles there and those were moved, but the rest was just ridiculous! This place is not service friendly at all and the person at the desk was incredibly rude! These people have obviously not heard of the saying \"The customer is always right\" before. Never staying here again.", "Date": "October 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "nyc", "Title": "“Outstanding - Best Hotel in Hollywood for Service, Rooms, Value, Location +”", "Author": "octsun", "ReviewID": "UR45102358", "Content": "I recently stayed at Vagabound Inn, Executive in Hollywood for 3 weeks. I had a great stay. I travel to Los Angeles frequently and only wish I discovered this hotel sooner. Rooms are large, plush and immaculately clean. Sanjay, the manager, and his staff provided friendly, top-notch service. There's a sparkling pool. The hotel is quiet, private and serene & in the heart of Hollywood. Hands down, it's the best place I've stayed in L.A.", "Date": "September 27, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "treviso", "Title": "“A very comfortable place in Hollywood”", "Author": "ill13", "ReviewID": "UR43329004", "Content": "Vagabond inn Executive- Los Angeles, CA I spent 1week at Vagabond Inn hotel in LA, it's a very nice and comfortable hotel close to Hollywood. I suggest it to everybody that have to go overthere to spend some good time!", "Date": "September 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "cali", "Title": "“thanks!!”", "Author": "pacmancali", "ReviewID": "UR27876815", "Content": "the manager mr. sanjay is the most helpful person i've seen in all the hotels i stay,not to mention this hotel is located in L.A. where people had don't care attidude!! good job mr. sanjay!!! looking forward to see you again!! this guy needs promotion!!seriously!!", "Date": "April 12, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "London, UK", "Title": "“A very mediocre hotel....”", "Author": "smurf1392", "ReviewID": "UR20937132", "Content": "The hotel wasn't terrible, but it was hardly good, either. The situation was good for sights and shopping, but the fact that it is in such a busy part of the city meant that even in blistering heat with duff air conditioning, we couldn't open our windows as it was too dangerous. The rooms we cleaned every day, albeit not very well, and some days there were nasty looking marks on the sheets. Though, I can't really complain.", "Date": "October 16, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Orange County", "Title": "“Went Home With Bed Bug Bites”", "Author": "graphicperson", "ReviewID": "UR20674792", "Content": "I used my citi reward points to book this room. Centrally located it was the perfect location for my audition the next morning for She's Got The Look. I checked in around 8pm and requested a 5:30am wake-up call. I asked for a quiet room for a good nights rest and he assigned me one way in back which was perfect. Immediately upon entering the room I flipped on the lights, then the bathroom light. On the floor were 5 cock roaches that were not even scurrying. I proceeded to stomp on them all. I was thoroughly grossed out. I figured these were residents of the Hotel so I didn't bother asking for another room. Then about 5 minutes later another one was strolling across the carpet about the size of a penny....that one was really gross to kill. I tore off the bed sheets and did as good of an inspection as possible. Once I convinced myself that at least the bed was safe, I decided to sleep with the light on, and make the best of it. I went to wash my hands and had to call down to the desk for towels. There was not ONE in my room. I took a sleeping pill and woke up about 6am. NO wake-up call. I went to the audition and the next day discovered gross bumps on my arms and back. It was disgusting....especially knowing where those itchy bumps came from. So...this Hotel does not get a recommendation from me. Roaches! No Towels! No Wake-up Call! Bed Bugs! wow.", "Date": "October 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "stockholm", "Title": "“very good averadge hotel in la.”", "Author": "swedenman", "ReviewID": "UR17687977", "Content": "hi! I stayed at the vagabond inn exec june 26 thru july 6. it was a great hotel .i can recommend it for people who wants to stay near all the hollywood attractions .its location is just great and the rooms were clean and proper .service good depending of who was at the consierge, but you could get help with everything you wanted.but theres lots of cars on vine street until late night . lots of traffic and a bit disturbing noise .and also some homeless and shady type kind of people walking around on the street especially evenings . but theyre for the most part it can be a nuisance. but the hotel is overall a good newly refurbished hotel and good value for the money. from swedenman.", "Date": "July 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Bogota", "Title": "“fair for its price”", "Author": "viejolucio", "ReviewID": "UR15500109", "Content": "I arrived with wife and daughter for staying 2 nights; there was no illumination in the sign of the motel, so it was shady, the crew was friendly, an the room had new rug; the bathroom was clean, and the beds cozy, but the t.v signal was poor. The free breakfast, don't expect more for a free meal, but it was acceptable. Making a long story short, the first impression is not good, but finally, the motel gave us well the service we paid for: sleep 2 nights.", "Date": "April 30, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "california", "Title": "“i lost my bag and camera,pls be careful with all ur belongings”", "Author": "CaliforniaJay", "ReviewID": "UR14723719", "Content": "staff are very rude and not very helpful,plssss dont ever ever stay one of their staff stole my Bag, and camera then when i confront them,they are trying to ignore me and then. they are very defensive and very rude. one of their staff stole my signature bag,and camera and i have police report to prove it. very rude staff its a nightmare and very traumatic stay.they made a big mistakes instead of 2 nights stay,they take out all my belongings inside my room, after my first night then my bag signature and camera is missing because of that. i have a lot of things bad to say.pls be careful to your belongings.", "Date": "April 1, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Maryland", "Title": "“Nice location”", "Author": "lazumd", "ReviewID": "UR10079188", "Content": "This hotel is in a decent area, close to the major Hollywood attractions. Parking is cramped at night and not suited to large vehicles. The rooms are large, clean, and have average accommodations. The staff was friendly and helpful.", "Date": "October 14, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Santa Barbara", "Title": "“Don\"t Stay Here”", "Author": "SantaBarbaraCmcb", "ReviewID": "UR8696297", "Content": "Do not stay here. Made a reservation for Saturday night and they booked me on Friday. When I arrived on Saturday they said there is a cancellation fee because I didn't show up on Friday. Had to pay cash for Saturday and wouldn't refund Friday's cancellation eventhough it was their fault. Patel is the General Manager and will treat you unfairly!! Stay far away from Vegabond!!!", "Date": "September 11, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "los angeles", "Title": "“used condom on floor”", "Author": "davidkkk", "ReviewID": "UR7238296", "Content": "If you want to sleep in a place that has used condoms on the floor and blood on the shower curtain, then this place is for you!!! I've stayed in plenty of cheap hotels before, but I have to honestly say that this was the icing on the cake!!! And no I am not lying about the used condom in the corner, or the blood smears on both sides of the shower curtain. This place was absolutely disgusting!!! Also the is no dead bolt lock on the door, so forget about safety! As a young female, being in Hollywood, alone at night, is bad enough, not to mention not having a secure lock on the door. There were plenty of cigarette burns on top of the TV, desk, and bathroom counter. The carpet was absolutely filthy, with miscellaneous stains everywhere. I can't believe that this place has not been shut down by the health department!!???", "Date": "March 28, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Mojave Desert, CA", "Title": "“More than expected”", "Author": "Just_ette", "ReviewID": "UR6911656", "Content": "I needed a place to stay for 2 days - during medical treatments. Most hotels in the area were way out of my price range. I checked out other reviews and opted for the Vagabond. The room was clean, the bed firm, staff was very helpful, housekeeping was friendly. The free breakfast was not that great but it was free. The Parking area was not adequate for the number of rooms. The location was 5 min from Hollywood Blvd and all the action, 7 min to Rodeo Drive and Beverly Hills. Incredible restaurants within a few blocks. For the price under $100 for a Fri and Sat night, it was much more than I expected. I would stay here again.", "Date": "March 4, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "everywhere", "Title": "“OK Hotel, extremely rude and unprofessional desk/manager”", "Author": "shinobi510", "ReviewID": "UR6831197", "Content": "I was coordinating a US tour for several bands last year and this was our final stop. Upon arrival, the guy at the desk, who happened to be the manager, mentions that he doesn't have ANY rooms ready. He lost the forms that were sent from hotels.com so we had to wait for them to re-fax all the documents with the names on. He worked very slow and when I told him to do it quick (everyone was tired), he threatened me: \"Hey, don't give me attitude alright? I'm doing all this --- work for you and I don't want to listen to you anymore. Look, this is my hotel, if you give me attitude again I will just kick you all out\". He gave keys out WITHOUT room numbers (simply wrapped in paper with a name on it), got all the room groupings wrong and half the remotes he gave out were either broken or damaged or out of battery. Afterwards, everytime I went up to ask for a cab he would greet me with \"oh you again.... now what this time eh\". The breakfast was served in the lobby/reception - however the lights were out and it was really dark so we had trouble pouring the coffee. I told the manager to fix it and he told me that it was none of my business. That being said, the rooms itself weren't that bad. Satisfactory size, bathroom was okay (did take some time for hot water to come out) and the location of the hotel was pretty good. Overall: Location - 4 Customer Service - 0 Room - 2.5 Bathroom - 2", "Date": "February 23, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Arizona", "Title": "“Only recommend to enemies”", "Author": "wbkids", "ReviewID": "UR6598857", "Content": "Arrived late, did get checked in fine. Towels are the same that I wash my car with, but a bit rougher. Remote control is given to you when you check in. The remote didn't work well and was VERY basic. The reception for the TV was a bit snowy. The water takes forever to just get luke warm. The water pressure is great, if you run around you may get your entire body wet. No clock radio in the room. We could easily hear the people above us and next door. I will not stay there again. They did have free parking, but it was limited and a bit difficult to maneuvre. However, this is a plus in this area of town.", "Date": "January 15, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "New Jersey", "Title": "“Not that great!”", "Author": "dho1998", "ReviewID": "UR5904261", "Content": "This hotel was OK and in a good location, except for the people that were staying there, and some \"Vagabonds\" from the street. There was a man who had mental problems who would yell to himself all night and a homeless person with one leg in a wheelchair who howled at the moon and grunted like the Tazmanian devil all night, along with some guy who OD'd and had to be rushed to the hospital after falling down the stairs. Way too much action for me when I'm trying to sleep. Terrible area this place is located, but the hotel itself was not bad. I would stay there again, but would have to think about it for awhile!", "Date": "October 3, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "melbourne", "Title": "“Bed Bugs”", "Author": "CGBJ", "ReviewID": "UR5881817", "Content": "We were bitten all over by bed bugs at this hotel and when we telephoned vagabond Inns to let them know they did not even want to know which room number we had stayed in so that they could be fixed. Parking not available late at night.", "Date": "September 27, 2006"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Just plain BAD”", "Author": "ChaoticTraveler", "ReviewID": "UR5716186", "Content": "This place was plain bad. The first complaint might be more of a product of the neighborhood, but the groups of people regularly knocking on doors at 3AM, not fun. Second complaint is that I found some ants crawling on me in bed. Finallly, there is the false advertising. This place does not have much going for it, so on the sign they claim to have HBO, ESPN, TNT, etc. Well it had about 14 TV channels, 8 of which were in foreign languages, no ESPN and no TNT. Though they did have HBO. Not really a good experience for that price.", "Date": "August 28, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "3", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Berne N.Y.", "Title": "“Basic stay”", "Author": "icema196", "ReviewID": "UR5329273", "Content": "Stayed here 3 nights in June, basic lodging . Traveled here with 6, 20 and 21 yaer old men. With a tight budget for the college guys we needed a cheap place to crash while we toured L.A. L.A. was hot during our trip and the air conditioning would not cool the room. Staff was notified and did not really care. This room was somewhat clean but had a funny smell. We were on the go 16 to 18 hours a day so all we needed was a place to sleep, we did not want to spend any more time here than we had to. Paid around $100 per night which is a good deal in LA. Do not go here if your lodging is going to be an important part of your trip.", "Date": "June 10, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Not bad at all”", "Author": "A TripAdvisor Member", "ReviewID": "UR4365542", "Content": "I recently stayed at this hotel and was skeptical as I had read the past reviews. However, I had read the one stating that the rooms have been renovated and figured I would be fine. When I got there and opened the door, I expected the worst, however, the room was very clean and cozy - a bit small (I booked the queen room). The parking lot was a huge benefit as it is difficult to find parking in Hollywood. Overall, the experience was very pleasant, the staff is very friendly and helpful and the continental breakfast is a small plus (as it ended at 9AM). I would probably stay there the next time I'm in Hollywood.", "Date": "January 20, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Miami", "Title": "“Longtime Loyal Guest Speaks”", "Author": "Brianaveryfilm97", "ReviewID": "UR4361456", "Content": "My production company does business across the street from the Vagabond. I stay there at least once a month. I am writing this, because I just recently discovered this site, and I looked up all of the places I stay out of curiousity, since I travel all over the US constantly. Why would someone come on here and purposely post all this nonsense? It affects the author's credibility, this party is not a seasoned traveler. I will continue to stay at this place, and I know I always have a clean room waiting. Feel free to email me if you need to. Brian Avery North Miami, FL", "Date": "January 18, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "5", "Service": "3", "Rooms": "5"}, "AuthorLocation": "San Diego, CA", "Title": "“Very Nice Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3347682", "Content": "I was really scared at first after I booked this hotel and read the reviews. From the outside the hotel looks OK but the rooms have all been renovated. The rooms were very nice and very affordable. The area was not bad at all. The location was close to everthing and I was very pleased with the accomodations. I went in expecting to be infested with bugs and that wasn't the case at all. Everything in the room was new from the windows to the carpet to the bedding. The furniture, the bathroom.... EVERYTHING! It was surprisingly very nice! Don't worry about the past reviews... I had a very good experience. This hotel was obviously recently rennovated and you have nothing to worry about!", "Date": "April 10, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "SF, CA", "Title": "“liers...”", "Author": "A TripAdvisor Member", "ReviewID": "UR2697531", "Content": "I booked this hotel in AUgust before I found reviews from tripadvisor people. I got really scared, so I called them and cancelled my reservation...here was my surprise...THERE WAS NO RESERVATION AT ALL for my name, I was not in their computer! Good thing I didn't have to pay cancellation fee. I am glad I switched to Orchid suites, that was the best ever place to stay. ANyways, since I am a curious russian person, I drove my car just to take a look at Vagabond Inn. What a disaster! Bad BAD location, at 7 p.m I saw couple prostitutes there and police patrole! Lots of homless people around, dirt, smell! It not the walking distance to any of Hollywood places! It was at least 10 minutes of driving. Stay away from that place, even outside look shows how bad it is.", "Date": "October 12, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Philadelphia, PA", "Title": "“Stay Away!! Has Bedbugs!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2094965", "Content": "Bedbug Nightmare!!!I stayed at the Vagabond Inn Hollywood in December with a friend. We awoke to bugs in the bed and bite marks on our bodies. We complained to the hotel manager...frankly he did not care. We had no idea what the bugs were but we were glad to get out of the very buggy Vagabond Inn.Days after we arrived home, I started being bit in my home...it turns out the bugs were bedbugs. They feed on human blood when you sleep (possibly transmitting disease) and travel in suitcases from buggy hotels and infest your home.At the least this has been a nightmare for 5 months!! I have had my home professionally exterminated several times (bedbugs are hard to get rid of). I have lost thousands of dollars in ruined furniture, rugs, bedding and clothing. The physical and mental toll has been costly. I've spent months without sleep, I've taken medication for the bite marks and started on anti anxiety medication to help cope with the entire ordeal.I contacted Manager of the Vagabond Inn Hollywood when I discovered the bugs had infested my home from his hotel, only days after returning home. At first he pretended he did not remember us speaking on the phone from my hotel room the morning I checked out to complain about the bugs. He also pretended he didn't remember my friend and I speaking with him again in person when we checked out. We spoke with him twice about bugs and being bitten in his hotel! And now only 10 days later he doesn't remember? When I asked to speak with the owner of the hotel or someone over him, he suddenly remembered our conversation. I asked for the owners name again, and he refused to give me any information... he was withholding and dishonest! And he said, \"I am not telling you anything, I am not giving you any information\"So, I did call the Vagabond Inn Corporation who offered me a free nights stay for my trouble. Are they kidding? The corporate office said there was nothing they could do since the Vagabond Inns are franchises and each franchise is responsible for how they manage their hotel.My advice...stay away from every Vagabond Inn. It is a violation when a hotel or motel does not provide a bug free environment to stay in. The Vagabond Inn Hollywood has very low standards and why should they do any better? The Corporation does not require them to.The Vagabond Inn Hollywood wasn't exactly cheap for a week nights stay at $85 per night. The minimum I expected was a clean, safe environment. I did not get that. With all of my complaints...I've been told I have no proof the bugs were in the Vagabond Inn. No proof? We woke up to bug bites on our bodies, bugs in the bed and we took a bug to the office to show the manager the bug and filed a complaint. How is that no proof? What I got was a nightmare, in the form of a physical, mental and financial toll. Stay away from Vagabond Inns...especially stay away from the Vagabond Inn Hollywood. They have bedbugs which carry disease and will infest your home.", "Date": "May 21, 2004"}], "HotelInfo": {"Name": "Vagabond Inn Executive", "HotelURL": "/ShowUserReviews-g32655-d223044-Reviews-Vagabond_Inn_Executive-Los_Angeles_California.html", "Price": "$76 - $135*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1133 Vine St</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">90038</span></span> </span> </span> </address>", "HotelID": "223044", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/4e/ae/4eae89176eef8060e51d8a9e8deee5d86large.jpg"}}