{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Plymouth", "Title": "“WORST HOTEL EVER”", "Author": "Lisa A", "ReviewID": "UR126450329", "Content": "Front staff unfriendly, rates change from when you make reservation, rooms smell like smoke(in a smoke free room), found a piece of glass in bed, toilet not flushed, no towels at swimming pool even when we asked several times, breakfast was to start at 7:00am but didn't open until almost 7:30. I will never stay at this hotel again.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Lansing, MI", "Title": "“Not a pleasant experience”", "Author": "belvajoan", "ReviewID": "UR126338698", "Content": "This is an older hotel which needs some major updating. I can understand that, but our toilet was not flushing correctly from the time we checked in. My husband fixed it a couple of times and then I called for maintenance on it. We had to wait a few hours until the maintenance person came in and my husband told him what was wrong with it but it still wasn't fixed. We called again for service on it and the person at the front desk said all she could do was write up a work order for it. We were actually checking out when the maintenance person asked if we wanted the toilet fixed, by that time I figured it wasn't my problem anymore. There is a sign in the bathroom stating if you want to reuse your towels to just hang them up, if you want fresh towels to leave them on the floor. We chose to reuse our bath and hand towels and left the wash clothes and bath mat on the floor. When we returned to the room after it had been cleaned all our towels were gone and nothing had been replaced. I saw a couple of housekeeping employees in the hall (with my hands dripping wet) and I asked them for towels. Apparently they didn't have them and would bring them later. It wasn't very long before the towels were delivered but they weren't folded. I know this is a small matter, but I found it odd. It was several hours later that a bath mat was delivered. The safety lock on our door was broken and the door didn't seem to fit the frame correctly. You could see a good bit of light all around the door from the hallway. We were going to eat dinner at Damon's inside the hotel, but it took 20 minutes and asking twice before we ever got a menu. We were then in a bit of a time crunch, so we just ordered a salad to go. The restaurant didn't appear to be too busy so I'm not sure what the service delay was. The salad was tasty and fresh. The hot breakfast included with the price of the room consisted of scrambled eggs, sausage links, bagels that they ran out of, toast, cold cereal, milk, coffee, water and Tang (or some other orange flavored drink mix). The eggs and sausage were nice, but I was really wishing for some type of fruit or yogurt.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Vincennes, Indiana", "Title": "“Worst hotel I've ever stayed at”", "Author": "Christina P", "ReviewID": "UR125284075", "Content": "To start off, we called the hotel to confirm our reservation and were on hold for 43 minutes! When they finally did answer the phone, they seemed as though it was an inconvenience for them to answer our questions. When arriving, my husband asked about the amount of time we were on hold and the two staffers at the front desk both blamed each other. When we got to our room, the card key did not work so we called the front desk and had them bring us up another one. The girl again seemed inconvenienced that they had messed up again and had to bring us another card. When we finally got into our room, there was a half empty soda bottle, empty bag of chips and a razor on the sink! I again called the front desk and the girl was so unbelievable short and rude with me it was ridiculous! We called around to other hotels in the area, but they were already booked up from the tournament we were participating in. I will NEVER stay in this hotel again and the staff sure does need some training in how to properly speak to patrons of their hotel.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Fishers, Indiana", "Title": "“Very Welcoming”", "Author": "Tracey C", "ReviewID": "UR123625107", "Content": "Hello, I just want to say my husband and I stayed there for 5 days and we noticed from the outside it looked like it needed a little love but, the inside The Rooms, Beds, Food and the Front Desk were great! We were happy with all.", "Date": "January 25, 2012"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Rooms": "5", "Value": "5"}, "AuthorLocation": "Fort Myers, Florida", "Title": "“Great hotel room”", "Author": "strawberryrhubarbpie", "ReviewID": "UR120647672", "Content": "Hubby and I stayed here one night and got a king size bed. It is a very nice clean room. Nothing to complain about at all. A room like this would cost twice as much in Florida, but I guess Indianapolis doesn't get a lot of tourists lol. Coffee maker in the room with good coffee; shampoo, conditioner, lotion and nice smelling soap in the bathroom. TV works great. WiFi works great. Very quiet. Nothing is broken or dirty. We haven't had breakfast yet but the check in lady said we get eggs and sausage, a lot more then most hotels these days. There is a McDonalds, BK, Arbys and Starbucks within walking distance. We didn't go to it but there is a restaurant/bar in the lobby. Can't comment on the area otherwise as we were not here long enough, but I would definitley recommend this hotel.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Bath, Maine", "Title": "“Not the Hilton but adequate”", "Author": "marytwg", "ReviewID": "UR120025675", "Content": "The hotel itself is very decent. Six floors, smoking rooms. My room was top floor and smoking (which I requested). No fridge/micro, but it had a nice bathroom and was all in all very serviceable. Average restaurant with excellent waitstaff. Excellent location, considering it's Indy's East Side. My only real complaint was the poor service from housekeeping, whom I tipped well. They didn't vacuum or even clean up the still-crusty spots of \"something\" from the last guests, failed to take out the trash two out of five days, and gave much better service to my neighbors (who didn't tip).", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Saint Charles, Illinois", "Title": "“Friendly place and friendly people”", "Author": "John W", "ReviewID": "UR119406727", "Content": "Whoever is running this hotel is doing something right. All the hotel associates were exceedingly friendly and helpful from the front desk to the bartender to the breakfast server. The room was large, clean and very quiet. Admittedly there is some wear showing in some areas, but they are constantly upgrading and repairing. My stay here was a very positive experience. I will stay at this hotel whenever I am in Indianapolis.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Columbus, Ohio", "Title": "“never again”", "Author": "roshaykay", "ReviewID": "UR119240581", "Content": "We slept well, the rooms were clean but this hotel's public areas are in need of serious renovations and the breakfast...please... Ironically the eggs were some of the best I've had at a continental breakfast, but tang instead of orange juice and no cream cheese but your offering bagels, come on now. The pool area was definitely not cleaned on a regular schedule, it was quite disgusting.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hull", "Title": "“Very Friendly Staff!”", "Author": "Fred S", "ReviewID": "UR118422596", "Content": "The staff at this Ramada made our stay a wonderful stay. I was in town for a tradeshow and I brought a trailer with my golf cart and a stroller. I was outside trying to get the stroller off of the trailer and it fell on to my arm and cut it all up. The staff tended to me immediately! They actually went out to the store to buy more supplies just to make sure they had the right cleansing solution and bandages to get me cleaned up. The next morning a young lady came out of the sales office and noticed my bandaged and immediately went and got more bandages to clean me up again. A hotel can be a hotel, but when you add such great customer service, it has guaranteed that I will be at that hotel everytime I am in Indianapolis!", "Date": "September 21, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Kenosha, Wisconsin", "Title": "“Great service”", "Author": "Camille H", "ReviewID": "UR118167375", "Content": "Best hotel stay. The bed was comfortable, the room spotlessly clean and the check-in girl was very helpful. The hotel was packed on Labor Day weekend when my friends and I stopped in. But the check-in girl was so helpful in getting us room accommodations. Great service! Keep up the good work.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brantford, Canada", "Title": "“Great Hotel”", "Author": "Jenny C", "ReviewID": "UR117235837", "Content": "I stayed at the Ramada I-70 East Indianapolis hotel with my family recently. This is the second time we have been there. The first time we stayed was about a year ago and the hotel wasn't that great. I guess they must've changed management since then as we had a completely different experience! It was clean, the staff were extremely friendly and accommodating. They went the extra mile in making sure our stay was great. The pool was clean and nice. Keep up the great work! The changes you have made are very noticeable!", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Never Again”", "Author": "advent232003", "ReviewID": "UR116555164", "Content": "Every thing is broke at this hotel. (Room door, the entrance door, the atm in the lobby, and ice machines) The bathroom and window curtains were dirty along with the elevators. It took four hours with five phone calls to the desk for clean towels. I finally had to walk to the desk for service. Not staying here again. If you’re looking for comfort, cleanliness, and a modern room, this is not a place for you. The value was great, but would have given more for something better. Expedia rated this as a 3 star hotel, however completely disagree.", "Date": "August 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great stay and price!”", "Author": "MamawsLove", "ReviewID": "UR115915876", "Content": "I stayed at this hotel for the weekend, along with most of my extended family for our family reunion. Our rooms were very clean and we never had any issues. The grandkids loved the pool and we all loved the convenience of a restaurant, Damon's, being inside the hotel, which even offered Room Service at a fair price. The staff was incredibly friendly and helpful and the food was great. (They have some of the best ribs we've ever had! Definitely, a great place to take your family for dinner!) We had some unplanned changes to our location for our Family Reunion, and after being upset that we weren't going to be able to have our reunion, the staff at Ramada Inn were eager to rent us one of their banquet rooms for the day. They just happened to have one available the day we needed. They set the room up to our liking and had Damon's cater our food for the event. The pricing was even cheaper than the first place we had booked! Our stay was great and I would recommend it to anybody!", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Fayetteville, Ohio", "Title": "“I hated it and will never be back!”", "Author": "rgiles_984", "ReviewID": "UR115191565", "Content": "I was forced due to business contractual obligation to stay at this hotel for 3 1/2 weeks. Every week my key card had to be re-activated due to the guest service counter thinking that I had checked out. The room(s) 607 and 531 were beyond horrible. The curtains were stained, the carpet was in dire need of a cleaing and the ice machine did not work. The elevators tend to stop in-between floors and one elevator is comletely shut down for some reason. The \"free breakfast\" was apparently not included in my contractual obligations because guest services simply informed me that I wasn't able to eat anything because it wasn't in the contract. I found a sign/card in my bed under the sheet that stated if I wanted to do my part in protecting the environment then I would just place this card outside the door so that hotel service(s) will no I wish my bed linens to be changed. They did offer free internet for me due to my contract but it was so slow I couldn't even get a facebook game to load. Also, I was forced into having a roommate and well lets just say that the guest service staff, Ryan, refused to accomodate a room change even though this other guest was clearly sick beyond function. This poor guy was so sick I could \"feel\" the sickness without stepping across the threshold. My first night I slept in my van. The next day my key card didn't work. I went to guest services and they informed me that because the roommate was no longer in the room it was policy to deactivate all key cards associated with that room. That does make some sense. However, when I acutally entered the room I found all of this other man's stuff still there. He had clothes, personal items, food, etc. all over the room. I went right back down to the front desk to inform them of the situation. Mr. Ryan looked shocked-he opened his mouth slightly, then muttered I had no idea his stuff was still there. I informed him that there was some very personal items with delicate information just sitting up there and that I wasn't comfortable being in the room with all of that stuff. One reason for the liability of his personal information being available for me to see and second, I had no idea what made that man so sick! It took the better part of the afternoon/evening for the seemingly un-professional housekeeping staff to clean out the room. I wound up sleeping another night in my van. The next day guess what happened-my key card didn't work again. Lets just say that Ryan and I got to know each other very well from that point onward. I was approached by another guess that informed me that they were switching rooms because of a possible bed-bug infestation, though I could find no evidence in my room(s). He did apoligize for the issue and quickly re-activated my key card. I was actually looking forward to staying in a room that night, but I was quickly wishing that I wasn't. The hotel was having air conditioning issues and well my floor didn't have any air conditioning. All the unit did was blow around the hot air that was already in the room. This continued on and off-again for the rest of my stay, a period of three and half weeks. I have stayed in a number of different hotels all around the world and I can say without any doubt in my mind that it would only be doing the Ramada family of hotels justice if they demolished this particular hotel. The staff needs to be trained in proper customer service/appeciation skills; Room presentation/upkeep; General maint. issues/repair; General property upkeep/presentation. The parking lot was dirty and convered with trash, weeds were growing in the flower bed area(s). It was a dreadful stay whether you are on business or personal/family travel.", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Fayetteville, North Carolina", "Title": "“We hated and we will NEVER return!!!!”", "Author": "Goldie49136", "ReviewID": "UR114969561", "Content": "The carpets were badly stained, the bathtub had a terrible ring around it and I had to wear my flip flops to shower. The television continously blanked out, the hallways were noisy, I smelled smoke and marijuana from the room across the hall. I asked the housekeeper for clean towels because the ones in the bathroom appeared to be dingy or dusty. When she returned with supposingly clean towels, the hand towels had feces on them. I became very angry and asked to \"PLEASE\" bring me some fresh, clean towels. She put the blame on the laundry personnel. The morning that my family and I went down for the free continental breakfast there was no bagels. I. then asked the hostess if she could bring some more out. The hostess went to tha back to bring some more out and when she did she brought them out with her bare hands after sliding her hands down the rails in the area of the lounge. So she then came back out with gloves on but she had the bagels resting on her clothing and she WASN'T wearing an apron!!! The staff had no clue in on how to service the customers. Please sleep someplace else because paying $99.99 per night is ridiculous. They would be doing you a favor with the price of $29.99 a night.", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Nice Place and price”", "Author": "sidmanus", "ReviewID": "UR112332807", "Content": "I stayed at the Ramada with Family. Not bad at all and big huge pool and we paid half what I would pay at Hampton inn. I will be back in this Hotel.", "Date": "June 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Chicago", "Title": "“It would be tough to give any favorable rating”", "Author": "ChicagoPie", "ReviewID": "UR107116814", "Content": "Would not stay here again although the stay provided many laughs (only because we have a sense of humor). We arrived to stay for a soccer tournament with teenagers late Friday evening. Upon walking into lobby, we were confronted by very loud music laced with profanity because a \"male revue\" (male strip show) going on in the lounge. I'm sure it was a business decision, but still not sure why the male revue would be scheduled the same time as a youth soccer tournament stay. Immediately headed to Damons for a big old cocktail to find one glass of wine (not lying here), ONE glass of wine left in the entire place - of any color! Allowed the kids to go to the pool but forbid them to enter the hot tub - looked disgusting! The caveat here... rooms were fine, but had hoped not to be holed up in the room the whole stay.", "Date": "May 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Good value for business traveller”", "Author": "Busceo", "ReviewID": "UR102433060", "Content": "I found this hotel to be clean and good for one night stay on a business trip. It was a very good value. I would stay there again.", "Date": "April 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Minneapolis, Mn.", "Title": "“hotel sleeping rooms-horrible---conference services-reasonable”", "Author": "kingoftheroad70", "ReviewID": "UR101898055", "Content": "I facilitated a training session for a client at the location for three days. While the convention staff worked hard to do it right, the sleeping/room aspect of the hotel was simply awful. Dirty, filthy, beat up--the place should be razed and a new hotel built. The rooms, sleeping-meeting were all dirty and distressed. Found out that many of my clients stayed at the Holiday Inn Express (block away) because they had previous history with the Ramada. I feel sorry for the employees that have to work for such a miserable owner.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "hebron, in", "Title": "“don't stay”", "Author": "deezee57", "ReviewID": "UR101873157", "Content": "wish i would have read the reviews before i went, but had been there about 8 years ago and it was nice, Damons was real good then also. This time the room was dirty and sheets looked like they had not been washed. Ants were on the floor in the bathroom. Damons was a joke, horrible service. Waited about 10 minutes to get a beer. Food wasn't good either, like eating grease. Place was dirty and if the dining room is dirty hate to think of the kitchen. You can go to a cheap hotel and at least have clean. for the money i expected more.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Corning, New York", "Title": "“This was not what I expected”", "Author": "michaelwaite1", "ReviewID": "UR82673090", "Content": "Hotel is falling apart. the rooms had no a/c. no internet. no free continental breakfast. the pool was not heated. everything was wrong to the site that lists it. BEWARE", "Date": "October 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Run, don't walk from this hotel.”", "Author": "nanners1", "ReviewID": "UR82640005", "Content": "The room was not clean, even the walls were dirty. we had to put a towel in the bathtub to stand on because it just did not look clean. The TV had more snow than Chicago in winter and the repairman that was sent up to fix it didn't have a clue what to do. Many of the people who ate at Damon's said the food was terrible. Hotel staff was friendly but when you would ask where's a good place to eat it was almost if they were forced to say \"well Damon's is good\". There was a model train show going on and there were only 6 chairs in the lobby and there had to be a number of elderly people in attendence and there was no where for them to sit and rest. The place sucks.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Warming DO NOT STAY HERE”", "Author": "carlcbr", "ReviewID": "UR77569006", "Content": "Check in time was 3 pm, they had no rooms clean, they give me a room with no Door on the hinges. Return to the front desk. got a room on the 2 floor was better.Out for the day return that night my room was not clean, both beds not make up. old towels still in the bathroom and new towels are on the bed.loud noise all night on 2 floor had to stay lock in my room.Hotel have no control .Shady people walking around parking lot...watch your back...if you love your self RUN OR DRIVE away and don`t look back...this place need to be shut down...", "Date": "August 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Mpinneapolis", "Title": "“D-U-M-P”", "Author": "MpinneapolisEdog", "ReviewID": "UR69404429", "Content": "Was in town for a convention, and for some reason they chose this pit for \"headquarters\". Clerk was friendly at check in, but they still charge you $25 damage deposit. $70 a night plus tax for being close to down town, but for that you could do much better. Place seemed very run down, dingy hallways and rooms. They have some kind of nasty fruity smelling air-freshener in the hallways that must have been put down by the barrel, it was so over-powering it was nauseating. Room was dingy, as if it never got more then a quick wipe down. Cigarette burns on the window sills and curtains (even though it was \"non-smoking\" room). Carpet was filthy, walls had many bump / scrape marks. Bathroom had hair in the tub, floor was not too clean. Came back at the end of the day to find a cockroach squirming on the floor by the toilet. My friends also had a poor time, they checked in and found the wall under their window falling down, and covered with mold and meldew (window being left open?). Other friend had no hot water in the AM for a shower. For what you pay, there was no breakfast provided. I'd read terrible reviews about this Hotels Damon's and didn't give them a $1. Other's in the group went to eat there the night we arrived, as it was late and after dark (the area is rather \"iffy\" and I'd say lock up in your room after dark rather then wander to the near by fast food places) They waited over an hour for the food, which came back under cooked, and not the correct orders. Basic dinner meals for a family of 3 cost my friend $68!! If you want a basic Breakfast it's about $6-7. Skip that and head to the Mc D's or B.K. that are across the street. Lastly, my room was on the first floor, (facing the front parking lot). If you get one on that side, expect to be kept awake till around 3-4am by obnoxious drunks and other shady characters (who may or may not be \"guests\" at the Hotel) standing outside the entrance to Damon's Bar/Grill, smoking, swearing and just being loud and stupid. There was a \"security guard\" that parked his car in the parking lot, but I only saw him once, sitting outside smoking. Close enough to the freeway for some noise, very busy streets border it, as well as Fire Stations...so your sleep will be off and on, Parking was poor, no shade and nothing close to the rooms. Lots of folks from the \"area\" wandering the parking lot, or going for smokes at the gas station on the corner, For fun, you can watch the obnoxious drunks leave the bar and peel out of the parking lot in their beat up Camaro's and Pick-up trucks, as that's what woke me up to write this review. If your in a pinch and need a bed, you can do better, There's also a very seedy by the hour joint next to this one,..won't ever be staying here again.", "Date": "July 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "OSCEOLA, IN", "Title": "“Not as bad as I thought it would be”", "Author": "22MARGARITAS", "ReviewID": "UR64165804", "Content": "I booked this hotel though hot wire.com so wasn't thrilled once I found out what hotel I was staying at once I started reading the reviews here at trip advisor. This hotel was bought out as best as I can figure the very end of 2009. The new owners have evidently been cleaning because I noticed no smells in the first floor hall or on the 4th floor where my room was or in my room. There was a wedding party there on Saturday and never heard anything from them. I used the indoor pool and it was warm & clean. The hot tub was on the fritz but u could still sit in it and enjoy the warm water. The only thing that I wasn't happy about was that I was given a breakfast voucher to use the next day at the Damons restaurant it said that there was a breakfast buffet on the weekend. I went down at 8:30 a.m. with my daughter & niece and was shown to a table near the buffet when i asked what there was he said I had to order. The voucher said the buffet was from 5:30 a.m. to 11:00 a.m. I was disgusted so we went down the block to McDonalds. I got up Sunday morning and went back down to Damons when I talked to the hostess she informed me there wasn't a buffet on Saturdays only on Sunday we did stay and eat. They had bisquits & gravy, scrambled eggs, pancakes, sausage & bacon. They had an omlet station set up but nobody there to make you one. The food was good & the hostess wrote us a new voucher to use to get our free breakfast. I would say that this location is on the edge of a lower end of the area but I came in after midnight the 2 nights i was there and never had any problems with panhandlers or people loitering that wasn't stay at this hotel.", "Date": "May 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "ri", "Title": "“find alternative”", "Author": "deerme29", "ReviewID": "UR58141738", "Content": "this is no longer a holiday inn but a ramada inn. and if you thought it was bad before, you'll really be appauled now! i love the desk help. its not their fault that this place is a dump. is smells dirty and looks run down. my bathroom had dead bugs on the counters. my curtains never closed right due to several broken hooks. the windows haven't been washed in forever so some of them are hard to see out of. my room smelled like rotten eggs or something close to that. the food at damnons is terrible and room service now doesn't allow you to add the cost to your room bill. you have to give them your credit card while they run off and process it. and they never get your order straight. and for that you are forced to pay them 18% gratuity. its just horrible given the price they charge...i paid $110/night. next door is one of those \"pay by the hour\" joints and there's always sleezy looking people walking about the grounds. at least they finally fixed the side doors so that you need your room key to enter. before, anyone could walk in there! also, there are no automatic doors so its a struggle to try and get inside with a bunch of luggage. and don't wait for anyone to come to your aide!! one other thing that i thought was horrible was that they rent smoking rooms to people with small children....they were running around and screaming next door to me at 9pm on a weekday night (i had to get up at 5am). some people are just rude and those are the kind of people that stay here!! do yourself a favor and stay away from this pit.....", "Date": "March 9, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Milwaukee, WI", "Title": "“Awful - Was booking another hotel at 3 in the morning!”", "Author": "PineWarrior", "ReviewID": "UR57019115", "Content": "Welcome to Shade-E-Land Ave. Got to the hotel around 1 am and while unloading the car by the front door I had to deal with a bum asking for money. The hotel was dirty and smelly and run-down in general. Bathroom was stained and nasty. Morning breakfast was lacking any food. Only the dump next door (Best Rate Inn ?) makes this look good in comparison.", "Date": "February 24, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Terrible”", "Author": "mtnet", "ReviewID": "UR55910997", "Content": "Never again. We're there with two youth hockey teams, oh yaeh also a swingers party and hookers. Shootout Hockey, you better review your hotel choices. Also very inept management.", "Date": "February 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Elkhart, IN", "Title": "“Dirty, old & smelly.”", "Author": "pennylaneElkhart_IN", "ReviewID": "UR46725127", "Content": "Needs help! They actually put acid in the pool before the close time and my family felt ill. They charged my credit card when I used cash the whole trip & I am still trying to find out why. It would help if they would just use some good old fashioned elbow grease on this place. I thought picking a Holiday Inn was the way to go but not always.", "Date": "October 13, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Ohio", "Title": "“Ick. Ick. ICK.”", "Author": "Shannon7n", "ReviewID": "UR35313369", "Content": "Honestly, we got a really great deal on Hotwire - 33 bucks for the night, not including tax. It was described as a 3 star hotel. (LOL!) It is more like a 1.5 star. It's fairly dirty, the rooms aren't clean, the pool has gargantuan floaties and will also knock you over with the smell of chlorine. Furthermore, the hot tub was FILTHY and about 1 foot or more short of being full. The beds are extremely uncomfortable, and your only options are two double beds, or one king. My husband is 6'8\" tall, and so you can imagine how much fun he had trying to fit in a double bed. The neighborhood is shoddy, make sure you lock your doors and alarm your car, and get anything out of it you don't want stolen.", "Date": "July 20, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Naperville, Illinois", "Title": "“Not the greatest”", "Author": "Wordman113", "ReviewID": "UR20872662", "Content": "Booked the Holiday Inn Indianapolis East on Hotwire for $49 for one night as a stopover on our way to Louisville. We arrived late at night and check-in was slow with only one person working the desk. The front desk lady quoted the woman ahead of me a rate of $99 which considering what I paid on Hotwire, I found interesting. All in all, I guess it was okay. It was kinda run down and dated looking, but reasonably clean. After making a request for a crib, one was brought to us, and it was the same lady who was running the desk, she said that she was the only one working. I wouldn't be in a huge hurry to go back. Better options are available closer to the airport.", "Date": "October 14, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "ohio", "Title": "“Stay Elsewhere, if possible”", "Author": "wafflecat", "ReviewID": "UR18999088", "Content": "Overall, the hotel was shabby and the room was not as clean as it should have been. For example, there was red Silly String stuck on the ceiling, dark hair in the bathroom, and a plate glass window smeared with little greasy fingerprints. My young son noted the bedspread smelled bad and tv reception was not good. Further, the hair dryer shorted out and caused a little alarm to go off. I was misled and discovered the hard way there was NOT a free breakfast included. Skip the restaurant in the hotel, Damon's: The staff seemed in disarray when we arrived around 7 p.m., and the speakers at the table didn't work. The mildest bar-b-q chicken wings served in the Damon's restaurant were so spicy my 10 year-old, who eats wings all the time, could not eat them. I told the waitress who told the manager but only the waitress said, \"Sorry,\" and nothing more was done. In fact, the next morning we could see that they were so spicy they actually burned my child's lips! That has never happened before! For an excellent breakfast, find your way to the Blueberry Hill restaurant and order anything -- all superb.", "Date": "August 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "lisa2travel", "Title": "“nice place”", "Author": "lisa2travel", "ReviewID": "UR17004516", "Content": "nice clean hotel...good breakfast overall great value", "Date": "June 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Louisville, KY", "Title": "“Nice time”", "Author": "highlandsjeff", "ReviewID": "UR10910157", "Content": "I had a really nice time. It was my second stay at this Holiday Inn. The restaurant is really nice, the rooms are clean, the staff is friendly. I plan on staying again and next time I'm going to try the indoor pool!", "Date": "November 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Beautiful Western Massachusetts", "Title": "“Indianapolis a fun place to be.......”", "Author": "GodandCountry", "ReviewID": "UR10742363", "Content": "Stayed here on Nov 4th the day our New England Patriots proved no doubt who's #1 in the NFL. Perfect location for our needs. Outstanding staff at check-in. Clean comfortable room, and by-golly the best sports lounge/restaurant i ever watched a sports event. Great food and very reasonable price's (cheap). Really enjoyed my stay, and the hotel and restaurant staff made it even better.......... Thank You Holiday Inn, and Thank You Colts fan for a fun time in your city.", "Date": "November 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Batavia, ohio", "Title": "“Holiday Inn average, staff was excellent.”", "Author": "Batboy46", "ReviewID": "UR8245132", "Content": "Great first impression with being checked in by Alta, she was so helpful and efficient. Decent enough place in need of a little repair. Our room was clean and the bed was comfortable. The room door was hard to open or close and had a sharp edge that could slice a hand, the A/C stayed too cold, shower curtain had four broken rings, and the tiny elevator on the East end of the building was somewhat odd. Construction taking place on I-70 made access a little tricky, especially later at night when Shadeland Road was closed.", "Date": "July 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "dayton,ohio", "Title": "“Love this hotel”", "Author": "elizabethdyt", "ReviewID": "UR7830930", "Content": "I have stayed at this hotel twice now. It has been great both times.The only complaints I have is the breakfast is not very good and they tend to push the breakfest bar .And the pool had way to much chlorine the hot tub was so bad that it took ny breath away. Besides that everything was great . It is clean and the staff is nice. I will stay there again . However I would not pay full price I paid the discount rate with entertainment card.", "Date": "June 10, 2007"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "3"}, "AuthorLocation": "West Virginia", "Title": "“Not very pleased with front desk . . .”", "Author": "ILUVDC", "ReviewID": "UR3735151", "Content": "I have stayed at this hotel several times within the last few years. The most recent being September 2003 for a convention held there. I was relatively pleased during my first stay in September 2002, but my visit the second time was quite disappointing. The walls in this particular Holiday Inn are very thin. I heard everything going on in the room next door all night long. They even started yelling and talking loudly the next morning. I am pretty sure the room next door was full of kids and a lot of underage drinking as I saw a garbage bag full of beer cans out by the door the next morning. When checking out, the front desk asked how my stay was so I mentioned the obnoxious guests. It was apparent to me that my complaint of loud noise was not taken seriously since the employee on front desk duty laughed at me. She offered no apologies whatsoever. I told her I would never stay there again and have not since this incident. Therefore, I would not recommend this hotel to travelers. There is a nice Ramada Inn and Comfort Inn across the street.", "Date": "August 3, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "", "Title": "“Okay, but some problems”", "Author": "A TripAdvisor Member", "ReviewID": "UR3256796", "Content": "When we arrived at 11:45pm after a 6 hour drive we were informed our reservations had been canceled, after a little while they were able to get us our rooms. DO NOT GO IN THE POOL!!! Within 5 minutes our eyes and noses were burning from the pool, WAY TOO MUCH CHLORINE. The elevator was giving off a terrible smell of burning oil. The rooms were fairly clean, however the bathroom and shower could of been better. They should do something about the beds, the beds were hard as a rock. The restaurant and lounge were good, very good food. Next time in Indy we will stay across the street at the Marriott, we have stayed there before and it was great.", "Date": "March 7, 2005"}], "HotelInfo": {"Name": "Ramada I-70 East Indianapolis", "HotelURL": "/ShowUserReviews-g37209-d223208-Reviews-Ramada_I_70_East_Indianapolis-Indianapolis_Indiana.html", "Price": "$46 - $104*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">6990 E. 21st Street</span>, <span class=\"extended-address\">I70 &amp; Shadeland Avenue,</span>, <span class=\"locality\"><span property=\"v:locality\">Indianapolis</span>, <span property=\"v:region\">IN</span> <span property=\"v:postal-code\">46219</span></span> (Formerly Holiday Inn Indianapolis East)</span> </span> </address>", "HotelID": "223208", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/34/44/34445a017e79f2c51adbc6d0271793614large.jpg"}}