{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Jefferson, Maryland", "Title": "“Good Choice”", "Author": "frank2958", "ReviewID": "UR140294926", "Content": "My wife and I have always chosen this Holiday Inn Express and have never been disappointed. Courtious and helpful staff. It is located on the bay side of main street, but short walk to the beach. The breakfast meal is a winner, unless you want a formal breakfast. The room was clean. There was a minor problem with the tub drain, but was tolerable. I think they have a smokers section, so smoke does not spew into other area. We'll likely stay here again. Oh, the community park located behind the inn is great for running, biking, or walking. Sit on the benches, watch the ducks, or the crabbers along the extended walking deck to the bay area. (My wife and I did not like the italian restruant located behind the Inn), but this was several years ago...cups, utensels, found its way in the artificial greenery and left there, next to the tables. Total turn off while eating wondering what the kitchen looks like or whether food is handled the same. (Holiday Inn says not affiliated with restruant)", "Date": "September 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bronx, New York", "Title": "“Great Location, Great Stay”", "Author": "Aja B", "ReviewID": "UR140042916", "Content": "My family of 4 adults stayed at this hotel during labor day weekend. It was pretty much the last available room in the ocean city vicinity that weekend. Thank goodness we found this hotel! Hotel: We stayed in a suite (2 queen beds, a sofa bed). The room was clean and spacious enough for all of us to not feel overcrowded. The staff was great and extremely helpful and pleasant. The pool was nice. Indoor pool was a little small (but good to have) and the outdoor pool was great. Breakfast buffet was awesome, the only thing about it is that the line gets very long. (Get there early!) Surrounding Location: There is a park area behind the hotel which has a pier for fishing and a great park for children. There was also some baseball going on in the two fields they have. A path about a mile or so around the park is available for running or biking which was a plus. There are great restaurants in the area and convenient stores for snacks and such. The beach is across the street which is great. Quiet and away from the hustle and bustle of the boardwalk. Speaking of the boardwalk the bus stops right in front of the hotel to go to the boardwalk ($1 each way or $3 all day pass). However, the ride is about 45 mins to an hr long on the bus with all the stops. But it beats parking if you can't find cheap/free parking. Casino is about 10-15 mins away driving. Overall it was a great time with many benefits even though it is not right on the boardwalk. No complaints, will definitely return.", "Date": "September 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Maryland", "Title": "“Another terrific stay!”", "Author": "MDBarbara", "ReviewID": "UR139847413", "Content": "I have repeatedly stayed at this hotel. The beds are comfy (pillows have a little to be desired), room was very clean, breakfast was delicious and bountiful and the front desk folks were terrific! The indoor pool is a bit small but the outside pool is large and the pool area very nice, Excellent beach access right across the road. Close to lots of restaurants and the bus stops right in front and is extremely inexpensive to travel anywhere in the town. I was very very pleased and will be back again!", "Date": "September 9, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Syracuse, New York", "Title": "“if location doesn't matter too much, go for it!”", "Author": "Lauren W", "ReviewID": "UR139383318", "Content": "Holiday inns are pretty consistent as far as I'm concerned, clean rooms, decent beds, pretty good service, etc... but I feel like I missed something as far as location goes. You are parallel to the beach so it's not far to go across the street obviously but the main action of the boardwalk is far. This hotel is located near 126th street... yes, there are shops all around for miles down the main drag, lots of mini golf, different restaurants and stores near the hotel, it's not in the middle of nowhere by any means but we wanted to be at least closer to the action than we were. When we got there we had no idea just how far we were... we asked how far of a walk it was to the boardwalk and they just said to take the bus, which is what we did, but we got off too early, at around 25th street or so? We had to walk for SEVERAL more blocks to get to the main area and it was HOTTTTT!!!!!!!! so yeah that made for a miserable day. Just keep in mind that the main area of the boardwalk starts at around 5th street and goes down to 1st then there's a few more blocks after that. We drove a lot after that 1st day and were able to find lots of free parking spots on the street (if you got there early enough - 10,11am) that didn't require too much walking. The closer you get to Ripleys Believe it or Not, the more you'll have to pay to park so I would recommend parking around 5th/6th/7th street for free and walking a bit. Or you can take the bus but the bus takes long and makes a lot of stops, esp when you're starting at 126th street!!!!!!!!!", "Date": "September 4, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Cairo, Egypt", "Title": "“I dont recommend this hotel”", "Author": "Osageo", "ReviewID": "UR138725928", "Content": "I read a lot of reviews about this hotel.... I am not sure weather I had bad luck in this hotel or the reviews are just complements. We had booked this hotel before we went. First, we had given handicapped room, and we were told that this is the unique available room. The reciptionest was not so gentle and she asked us to decied weather we were going to stay in this room or we didn't like it, and in the last case we have to stay one night at the hotel. She left us 5 minutes to decied as that was a high season and there are lot of people waiting for an empty room. We decieded to stay one night ,this is also because the hotel is not on the beach. You have to cross the road with your swimming suit to get there. Finally, we found other better hotel, of course with higher price as we were looking foor immediate booking. The other hotel was much better, first row one, and there were many rooms available there. I think the hotel staff need to know how to deal with guests first. You will discover this easily when you go there. I truely describe what has happened with us there. And honestly, as I will never go there again, I don't recommend it to the reader. Again, I am not sure weather this was a bad luck, or that is their attitude, but I am sure that this is not a good hotel. Not only due to what happened to me, but also for the hotel staff, cleanness, food quality....and so many issues.... Better luck for others", "Date": "August 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rensselaer, New York", "Title": "“Clean, fresh, but not fancy, great quiet location”", "Author": "pkep1483", "ReviewID": "UR137059126", "Content": "I spent 4 weekday-nights here. It is a later-generation hotel, with fresh decor and very clean in room, hallway, and lobby/breakfast area. Located on the Bay side of the Coastal Highway on the northern fringe of Ocean City in an area where there are mostly private condos, upscale properties and only a few other hotels;it is several miles from the boardwalk (an asset if you prefer a quieter area) but it's on the \"beach bus\" route if you want to make a trip downtown. You have to cross the highway to reach the beach but the intersection has a traffic light and working crosswalk buttons. Just behind the hotel is the very nice Northside Park. There are sit-down restaurants (seafood, Italian, steak) and cheap eats (subs, wings, pizza) all within a block on the same side of the highway as the hotel, plus a dollar store, groceries, etc. The room was very clean including corners, linens, and bathroom. The bath was a modern one-piece type (no grout to get icky) with a safety-handhold bar, and it was sparkling clean except for a bit of hard water build-up underneath the whirlpool jets. Room a comfortable size, nice flat screen TV and all appliances (hairdryer, fridge, microwave) clean and in working order. Bed comfortable with a variety of pillow \"firmnesses\" but I always bring my own for my neck problems. No sign of vermin.They did a good job of cleaning up the inevitable tracked-in sand with one exception: the elevator carpeting needed attention. The room was quiet and so were the guests when I was there. It is family friendly. I spent my time at the beach, but the outdoor pool looked nice; staff kept it cleared of sand. Service was friendly. The complimentary breakfast had enough variety so that you could try different things on different mornings. It included cereals, yogurts, muffins/pastries/bagels/toast, scrambled eggs, meat (sausage patties or bacon on different days), biscuits and sausage gravy (a Southern dish), and a pancake-making machine (the pancakes are so-so but fun to make.) Plus surprisingly decent coffee/decaf and the usual breakfast juices. As noted by other reviewers it is best to get to the breakfast early (before 8:30) to avoid the rush. Not a cheap hotel but probably worth what you pay. Call hotel direct and compare price to any online service quotes you get.", "Date": "August 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lorton, Virginia", "Title": "“Right across the street from the beach”", "Author": "SweetCynTita", "ReviewID": "UR136832416", "Content": "I always check around the bed and matress because I'm paranoid about bed bugs and found a lot of hair behind the bed, I guess it's because the bedskirts don't get changed. The sheets on the bed where clean and th room was nice. It is about a 10-15 min drive from the boardwalk. The beach is a short walk across the street. Great breakfast included.", "Date": "August 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Silver Spring MD", "Title": "“a hotel I trust”", "Author": "Jeanine9597", "ReviewID": "UR135921374", "Content": "I had stayed at this hotel years ago with a relative and knew it met her very-high standards of cleanliness, so I immediately thought of it for this trip. The only down side is that it is at the far north end of Ocean City--practically in Fenwick--so you're not in the heart of the boardwalk area. But the up side to that is that the beach itself is far less crowded near the hotel, and only one block away. The staff is very friendly, helpful, and courteous. The room was very clean--I'm getting too old to deal with questionable hotel rooms for the amount of money one must spend; I want to feel confident that where I sleep at night won't make me feel like I need to wash everything I brought with me or check myself for insect bites. There's enough of that in Ocean City already. Great staff, can't stress that enough....they even helped me out over the phone to find the lowest rate possible when I was confused about the various offers. Would definitely stay there again. And they offer a nice complimentary breakfast, too.", "Date": "July 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great hotel. Very clean, friendly staff, quiet.”", "Author": "oceancitybound", "ReviewID": "UR135543389", "Content": "This is a great hotel to stay at when visiting Ocean City. It is about 8 miles from the boardwalk but there is a bus stop right in front of the hotel. You can ride the bus for $3 all day. The hotel is very clean. Rooms are large and have a small microwave and refrigerator . They have free breakfast from 6:30 to 9:30. This is probably one of the cleanest hotels I have stayed in. Several things to do and places to eat within walking distance. The beach is right across the street. The staff here are very friendly. Great place to stay if you have kids and want to be away from the noise of the boardwalk.", "Date": "July 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Friendly staff, great pool”", "Author": "amyanderic1", "ReviewID": "UR135089798", "Content": "We were in Salisbury for a softball tournament, and we got screwed out of our rate at the HIE in Delmar. We got one room at HIE on 126th street, and a condo nearby for chaperones and girls. When I told the desk person manager how we got a pre-pay rate at the Delmar location of $164 per night for 5 rooms, but they didn't charge our card and changed the rate substantially the day of arrival, he did his best to meet the rate we had in Delmar (came within $7). We had a view of the pool and bay. MUCH better than we would've had in Delmar. The breakfast was decent, the service folks in the breakfast area and desk were all extremely friendly and helpful. The room was clean and spacious. They have an indoor and outdoor pool that were quite nice. I'd do this again in a heartbeat.", "Date": "July 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Herndon, Virginia", "Title": "“good location and comfortable”", "Author": "mamakim6969", "ReviewID": "UR135008333", "Content": "easy access to beach. Only one block away to the beach and I like the location because it is 7-8miles away from the noisy boardwalk. I know some people would not like it, though.... I stayed in suite with two double bed and it is quite spacious, clean and comfortable. However, there was no balcony to hang the wet bathing suite and breakfast area was quite crowded, as others mentioned.", "Date": "July 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Waukesha, WI", "Title": "“great location”", "Author": "BobnCarolyn", "ReviewID": "UR134870496", "Content": "Our family stayed here July 3-6 2012. The room itself was standard, but very clean. I was very disappointed though that a non smoking room was on a smoking floor. There was a definite cigarette odor in our room. We tried to change rooms, but of course the hotel was booked as it was a holiday week. The breakfast area was very busy with typical food selections. There could have been a variety of fruit instead of just bananas every day. The location was just a block away from the beach which was very nice. The July 4th fireworks were at the park right behind the hotel which was also very convenient.", "Date": "July 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Chesapeake, Virginia, United States", "Title": "“Good and Bad”", "Author": "Corey S", "ReviewID": "UR134549189", "Content": "My wife, son, and I just stayed at this property on July 8 and 9, 2012. Upon arrival, our AC was not working properly and I asked it be looked at. The person who was duty did not know a thing about the AC unit and at midnight, they had to call in the supervisor. It wasn't fixed until the morning. Also had issues with hot water for the shower. The hotel did compensate us 50% off for the one nights stay.", "Date": "July 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "West Hartford, Connecticut", "Title": "“Clean, quiet and comfortable.”", "Author": "egents", "ReviewID": "UR134001699", "Content": "My husband, 9 month old and I stayed here for a night on a stopover to Sandbridge Beach, Va. We had a hard time finding an affordable but nice hotel that would allow a one night stay. We booked a room here with our AAA discount. We found this hotel to be clean, the beds were comfortable and soft, nice flat screen tv, the shower was large and clean and the room had a small fridge. We were in room 317 and had a nice view of the pool and the sun setting over the bay. If you are looking for an average but safe and clean hotel, this is it. Skip the long line for the free breakfast and drive south for some doughnuts at the Fractured Prune. Wow, amazing!", "Date": "July 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Maryland", "Title": "“Still great - consistent and dedicated service!”", "Author": "rstravelerMaryland", "ReviewID": "UR133644581", "Content": "Back with my family for our annual stay...and we continue to be very pleased. Breakfast as always is great, and the rooms are sizable and comfortable. Best part this time was the quick response to an issue we had with our air conditioner. It was very loud the first night, and we alerted the front desk. The head maintenance promised that he'd either fix it or have a new one installed by 3 PM that day, and he delivered. Great service!", "Date": "July 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "kiremiko99", "Title": "“Excellent Choice for Ocean City”", "Author": "kiremiko99", "ReviewID": "UR133405212", "Content": "Have stayed at many hotels around the US. This is not a 5 start hotel, but it has everything you can ask for. Professional staff. Clean room. Good free breakfast. Well maintained and spacious pools. Count this as an awesome value hotel for ocean city. Had just as much fun as we did at the Hilton Suites which goes for more than twice the price.", "Date": "July 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fallston, Maryland", "Title": "“Outstanding!”", "Author": "WorthyIsTheLamb", "ReviewID": "UR133210296", "Content": "What an awesome hotel! The Holiday Inn Express lives up to the tripadvisor member reviews (Thanks!). From the time we arrived, until our departure (days later), the hotel property and staff exceeded our expectations! LOCATION - The property is located in northern Ocean City, where there are plenty of dining options and multiple grocery stores (Food Lion, Super Fresh, etc...) to grab groceries and snacks. The beach is a short walk, and the distance to the ocean water is much shorter than the southern end of OC, where the beach is about three times as deep. The hotel also backs to Northside Park, which offers open space and activities on the bay side of Ocean City. ROOMS - Our room was clean and spacious. We had a suite with two double beds and a sleeper sofa. The room had a sizable mini-frig, microwave, pantry cabinets, and small sink. The beds included soft and firm pillows, labeled accordingly. The beds were soft. The A/C worked great - no problems at all with climate control! COMMON AREAS - The hotel property and common areas were well maintained. The pools were kept very clean, and the lounge chairs and tables were cleaned and organized daily. The outdoor pool is large and ranges from three feet to five feet in depth. BREAKFAST - Breakfast was included. Wow, what a treat, from a food and service standpoint! Their breakfast staff provided top-notch service (keeping the foods and drinks stocked throughout the breakfast time period) and the food quality and variety were great for a Holiday Inn. Breakfast items included - orange juice, apple juice, milk, coffee, tea; scrambled eggs or cheese omelets, bacon (crispy!) or sausage or Canadian bacon; pancakes, biscuits and gravy, hard boiled eggs; muffins, bagels, toast; cereals; and yogurts. The dining area was kept very clean and included flat screen televisions to catch-up on news, sports, and weather forecasts. The pancake making machine was a big hit with my kids... you push a button and out pops two freshly made pancakes! STAFF - All of the staff that we encountered were polite, accommodating, and focused on customer service. MISCELLANEOUS - Lots of free parking. They have a massive parking lot that extends around the entire building, as well as parking on the streets. Note that the WiFi password changes every couple of days, but a quick check with the front desk will keep you up and running. We were so impressed with the Holiday Inn Express that we've booked another vacation for this Summer.", "Date": "July 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“Loved every minute!”", "Author": "LondonLove330", "ReviewID": "UR132963318", "Content": "This place really lived up to (perhaps even topped) our expectations. The location was excellent - close to the beach and many restaurants. The front desk was very helpful and polite. Our room was clean and spacious. Loved the flat screen TV and comfortable bed. The rooms were quiet and we got a great night's sleep. The indoor/outdoor pool areas were inviting and spacious. The lounge chairs were so comfortable I could have stayed out there all day, not gone to the beach and been just as happy. Breakfast in the morning was included and delicious. There was a wide variety of food, ranging from hot foods like bacon, eggs and biscuits/gravy to other food like cereal, yogurt and pastries. We were so lucky to get this hotel at the last minute! It was on the northern part of OC and just a quick walk or drive to various restaurants and shops. We would definitely stay here again!", "Date": "June 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Purcellville, VA", "Title": "“Better than expected!”", "Author": "DL0820", "ReviewID": "UR132235388", "Content": "Our fastpitch team of 11 families stayed here for a 2 day tournament June 16 & 17 and I must admit I was pleasantly surprised. Usually when I think of hotel in OC they are run down and dirty but not this one! The room was clean and the beds were comfortable. The breakfast was also good. Just a couple of things - the beds were too small (doubles instead of queens), we had to drive about 10 to 15 minutes to the boardwalk but well worth it if you don't want to pay $400+ a night for a room, and we arrived at 9:30 a.m. and were told our room should be ready by noon and it wasn't ready until 2:30 p.m. Still earlier than check in though. Staff was excellent.", "Date": "June 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“This is why I choose IHG hotels everytime!”", "Author": "Yogi459", "ReviewID": "UR131079958", "Content": "Before we arrived I called the front desk and asked what time check in was....the front desk clerk stated whenever you get here you can check in. We arrived a bit after noon and were immediately checked in with efficiency. The room was clean and comfy. The beds were nice and made for a good sleep. By way of beach hotels this is in very good condition and was very clean. The hotel has an indoor and outdoor pool. Which made for entertaining kids easier.(given it was raining) The next morning we were treated to free USA today newspaper and free breakfast. It's OK just enough to get you through the morning to lunch. The staff was very good. Alot of times staff at beach hotels is substandard. Not here! Josh Gruber and Paige Small should be recognized for their superior attention to detail and customer service. The day we were to check out we were given a late check out. We were given the convenience by Paige and Josh to come back after the beach to rinse off and change in the changing area prior to getting back on the road. I am so thankful that there are people still left that think logically! especially when you have kids. KUDOS to all the staff at Holiday inn express on 126th, you made our trip fantastic and is the reason why I will choose IHG again in the future.", "Date": "June 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Perfect stay for 2012 Cruise Weekend”", "Author": "MBHD1", "ReviewID": "UR130322568", "Content": "We chose this hotel because they didn't lock you into a three night stay, like a lot of other hotels in the area. We stayed here during the \"Hot Rod Cruise Weekend\". This hotel is across the Hwy from the beach. Everything was perfect. Very busy, but it was always clean. Very impressed how the breakfast was attended by three people and was kept full, even though the hotel was full of \"cruisers\". The beds were a little uncomfortable, and parking was a little bit of an issue later in the evening. That was expected though because of the huge volume of people in for the weekend. No fault of the hotel. I will be staying here next year!", "Date": "May 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "san francisco", "Title": "“Old bed”", "Author": "tripsgesq", "ReviewID": "UR128404408", "Content": "For the most part this hotel is comparable to other Holiday Inn Express properties. The queen-size beds in our room, however, had old mattresses that caved into the middle of the mattress. For me, the bed is the most important factor in the quality of a stay. For this reason, I did not enjoy my stay and would not go back.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Nottingham, Maryland", "Title": "“Almost forgot I was in OC MD!”", "Author": "cherryiice", "ReviewID": "UR128130810", "Content": "I don't know that I could afford to stay here during the season, but if I can, this will certainly be my go-to place. Came down for a weekend in april and was very impressed. Its difficult to find good hotels in OC, the majority are outdated, run down and dirty. That was not the case at all at the Holiday Inn Express. We got a suite and were so happy with it. Everything was very clean and I especially loved how they no longer use those awful bedspreads that you always hear about never being washed, they now use all white sheets with a white blanket in between, so you know for a fact youre the first person touching it. And so soft! Ive never stayed at a hotel that had sheets as soft as mine at home, but these definitely were. The one downside to our room was that there was no balcony. Other than that, it was lovely, I actually counted and our suite had 7 different mirrors in it! The breakfast was okay, good selection, but the eggs werent so great and the muffins were a bit dry... The cinnamon rolls are to die for however. Never made it to the pool or hot tub but absolutely loved the jacuzzi tub in our bathroom! The people at the front desk were incredibly friendly and helpful, I dont think Ive ever experienced such friendly service in OC either.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sugar Loaf, NY", "Title": "“Great spot for a beach vacation!”", "Author": "Mary D", "ReviewID": "UR127891300", "Content": "My family and I stayed here for a week this past summer and we loved it! We were a little concerned that being across the street from the beach would be a bit of a bother but it was actually a very quick walk to the beach, not very different than staying at a larger resort right on the beach. The location was great, close enough to everything we wanted to go to but just outside of the very busy area. The staff was friendly and efficient. We had a problem with our door lock one day and within minutes of reporting it, there was someone in our room fixing it. The outdoor pool, indoor pool, and hot tub were well maintained. Our room was clean and housekeeping was fast and prompt. When I saw that our room was in the back of the hotel, I thought I'd be disappointed by missing out on the ocean view but we had a beautiful view of the bay and the park. We plan to stay there again when we go back to Ocean City. We highly recommend it!", "Date": "April 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bayonne< NJ", "Title": "“great place to stay”", "Author": "jenni7", "ReviewID": "UR126570462", "Content": "Went for a romantic long weekend this past thanksgiving weekend. the weather was so nice that we decided to take a last minute trip to ocean city, md. the staff at the holiday inn express couldn't be nicer. we had a great room overlooking the ocean. the place was clean and the service was perfect. we cannot wait to get back.", "Date": "March 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lancaster, Pennsylvania", "Title": "“Nice stay. Will visit again.”", "Author": "TigerLily1010", "ReviewID": "UR125254172", "Content": "My husband and I have stayed one night on two separate occasions this winter mid week in this hotel. The front desk clerk was friendly and professional. The rooms were clean and inviting. Price was good for mid winter, mid week. The breakfast was good, varied and plentiful. Both times, I was not happy with the pool. The hot tub jets did not work and since the enclosure is mostly glass, it was rather chilly in there. The lights in the pool area were very dim. I did look for a light switch both times but decided I could just make do since it was chilly and I knew I wouldn't be staying a long time. Overall, it is a good hotel and definitely on our return list", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Whiteford, Maryland", "Title": "“A GREAT HOTEL TO STAY AT”", "Author": "cmacy44", "ReviewID": "UR124175151", "Content": "This HOTEL was great to stay at our room was very clean and the employees were very nice and helpful if we need anything, breakfast was hot and very clean area to eat at, pool was clean and the Jacuzzi was hot and relaxing, we went during new years weekend so the xmas lights were still up and they were beautiful, winter fest was all so still going on and it was in the back of the hotel so we walked over to see the lights beautiful. T he beach was a short walk and there was so many places to go eat at around the hotel walking distance the blue ox is right in there parking lot good food there, we come down every year for new years its our anniversary and we always stayed at another motel but for now on we will be staying here i highly rec amend this hotel.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Comfortable, pleasant hotel - a safe bet”", "Author": "Robert87", "ReviewID": "UR123300853", "Content": "This hotel has a lot going for it: it's well located, only a short walk to the beach. As you need to drive to get around Ocean City, it's important that you can quickly get from room to car. In this regard the hotel has ample and easily-accessible parking so you can get on your way quickly. We particularly enjoyed the good-sized outdoor pool, which was clean and spacious. The room was standard Holiday Inn, pleasantly large and clean and well-equipped - A/C is fine for those who like things a bit windy, but could be an issue for those who fear draughts! We found staff pleasant and helpful throughout. Gripes? If any, the fact that there was a long line for breakfast might be one, as the breakfast room is quite small for what is quite a large hotel, so all in all a 10 minute wait before we sat down to eat. This is a Holiday Inn Express so the dining options are limited - however there are plenty of other places to eat nearby for those pondering a longer stay and concerned about getting bored with hotel fare. In terms of ambience I thought this was a very good hotel for families, with both younger and older kids. This felt very much like a holidaymakers' hotel, cheerful and relaxed, and not at all pretentious.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Georgetown, Delaware", "Title": "“Off Season in Ocean City”", "Author": "loverat", "ReviewID": "UR121130658", "Content": "My husband and I are building a house in Delaware, so we have been traveling back and forth from New Jersey to check on the progress. We have stayed a few times in other hotels that we would never stay in again so we decided to try the Holiday Inn Express in Ocean City. The hotel was beautifully decorated for the holidays (we were there the week of Thanksgiving). Very nice room, very clean, nice bed and bedding and good amenities. Great location and within walking distance of very nice restaurants. The property behind the HI had a \"Winterfest of Lights\" exhibit which was beautiful. The only drawbacks to this particular stay was that the indoor hot tub was not working properly. The water was hot, but the jets did not work. Even so, the pool area was very nice. Also, the maid came by very early in the morning and while cleaning the room next to us every day we were there was extremely loud. Doors banging, vacuuming, banging on the walls - too much noise! The 'do not disturb' sign on our door did not protect against noise unfortunately. Otherwise we did enjoy our stay and if we need to visit again before our move, we will probably stay here again.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Absolutely Excellent!”", "Author": "MDBarbara", "ReviewID": "UR121128894", "Content": "This HIE sits on the bay side of Ocean Highway. It's absolutely worth being off the Boardwalk to stay at this location. Restaurants and shops are an easy walk. It's right next to North Side Park --- an excellent park for people of all ages! The lobby is beautiful. The front desk folks were extremely nice and helpful. The room was perfectly cleaned. The beds - super comforable. The breakfast selection -- included with the room -- was very abundent. I could not believe the terrific variety of items offered. I am already planning another trip back! Thanks for a great stay!", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ellicott City, Maryland", "Title": "“Excellent”", "Author": "Tom B", "ReviewID": "UR121097881", "Content": "This is a great place to stay. Clean, up to date, with great customer service, all at a very good price. We were able to get a room the Friday after Thanksgiving just walking in after having to leave our previous poor quality hotel up the street after one awful night's stay there. The two staff at the HI Express front desk, one of whom was a manager, were both pleasant and professional. They got us into a lovely room right away, even though we arrived there well before check in. Our stay there Friday and Saturday nights was great. We will be back.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Excellent value and good service”", "Author": "JamieEighteen", "ReviewID": "UR120398959", "Content": "Stayed for two nights in October 2011. Nice comfortable rooms with a good view out across Assawoman Bay. Microwave and refrigerator would come in handy if you were on a longer stay. Breakfast was HIX standard, but presented nicely and kept well supplied. Location is easy to find, just off the Coastal highway and there is plenty of space for parking. Well worth taking the time to visit Assateague State Park - some beautiful beaches and interesting nature walks. Staff were very friendly and I had no issues during the stay.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ontario, New York", "Title": "“great location and helpful staff”", "Author": "william c s", "ReviewID": "UR119516188", "Content": "been to oc 3 times before and stayed downtown area love this location away from crowds and easy to drive any where you need to go staff extremely helpful pool was great didnt get to use the free breakfast but looked good a lot of choises will be coming back next year", "Date": "October 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Great location and friendly staff”", "Author": "LM1708", "ReviewID": "UR118788151", "Content": "I really like the location of this hotel. It's a block away from the beach and at most a 10 minute drive to the boardwalk area. Within the vicinity of the hotel (less than a 10 minute walk), there are various restaurants, local bars and delis. The amenities of the hotel are great, especially the free breakfast - they do serve hot food (eggs, bacon, sausages and pancakes). The room has a microwave and fridge in case you would like to stock up on food and drinks. You will have to buy your own plates and utensils. The rooms also look fairly new and they are quite clean. There were plenty of towels for 3 people so I did not experience what others reviewers have. The hotel is also pet friendly. The staff was very friendly and provided fast service. The weather wasn't great during my stay so I was not able to use the pool. Overall, I would recommend staying here. It's a great place for a group of friends or for a family.", "Date": "September 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Stop looking and stay here :-)”", "Author": "Hopep1974", "ReviewID": "UR118429488", "Content": "I searched for a few hours for the right hotel...and I choose this one based on the reviews and the free hot breakfast. It is on 117 th street but the bus picks up right out front and the beach is right across the street. The park behind the hotel is a great place for a walk. The outdoor and indoor pools were always clean. The jacuzzi was broken the entire time we were there (4 days) Every member of the staff was very friendly and helpful! The free hot breakfast was great..bacon pancakes and all! This saved us a good deal of money. The small kitchenette was stocked with disposable plates, utensils, and covered plastic platters to warm up left overs..this was a pleasnt surprise..:-) when we needed more towels they were promptly brought 2 us:-)The indoor pool is a life saver if ur traveling with kids and it rains..the beds could be more comfortable but the linens were fresh and nice.", "Date": "September 21, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Maryland", "Title": "“Great price and location”", "Author": "MarylandRoadtripper", "ReviewID": "UR118272366", "Content": "We stayed here over Labor Day weekend and we really liked the location of the hotel. Our room overlooked the bay and a pretty park behind the hotel. It's a quick walk to the beach and there are many restaurants within walking distance. The mattress was comfortable but most of the pillows were lumpy which was a little weird. Our room as very clean upon arrival but Housekeeping did not come the second day we were there. We were a little surprised about that but all we really needed were new towels which the front desk sent up right away when we called them. We enjoyed both of the pools but were a little disappointed that the hot tub jets were not working...it was still nice to soak in the warm water after a day of swimming in the ocean. We only ate breakfast at the hotel once during our stay but it was good and the attendants were great. In fact, all of the hotel staff we encountered were friendly and helpful. We will definitely stay here again.", "Date": "September 18, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Long Valley, NJ", "Title": "“A place to lay your head but...”", "Author": "TheSpadys", "ReviewID": "UR117775411", "Content": "Your staff should pay NEED to pay more attention to being much more hospitable and friendly towards your guests. After dealing with Holiday Inn's \"Guest Relations\" due to THEIR major screw-up in which property we booked, we agreed to stay here. When we arrived and asked to check-in, the front desk person had major attitude and was rather direct by saying \"we have no rooms available until 4PM.\" When we asked if there is a room we can change so we can walk to the beach while we wait for our room, we were told to use to use the men's and women's room. Try doing this with two kids! After we checked out and went to the beach, we asked if we could use a room to at least change and shower before we had to drive home. Their response...\"You can use the pool shower and pool towels.\" Really?! Bottom line, if you have no choice but to stay here, hotel guest beware. You may want to consider either staying in Delaware or change your vacation dates to stay in another hotel.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Washington DC", "Title": "“nice place away from the crowded boardwalk”", "Author": "wubear", "ReviewID": "UR117491277", "Content": "Day 1 of 5 & so far and the exploration is great. Came into Ocean City via the center (route 50) to see how busy it was. Very tightly packed buildings, but the crowds are not here yet. Very sunny this week so I should have brought a hat. Parking: Street enforcement from 9am to midnight so be prepared to pay via coins, or credit cards for longer times. Parking at this hotel is free. Hotel: This establishment is far away from the boardwalk (127th ST vs. boardwalk at 30th ST), this quiet hideaway is reasonably priced due to its location. Set back away from the coastal hwy, towards the bay & Northside park, this hotel is only 3 short blocks from the beach. Note - if you are carrying LOTS of stuff to the beach, this walk is long; overall distance to the sand is about 500ft. The walk to the water after that may seem forever! The rooms do not have a kitchen, but it does have a small fridge and microwave. Staff is very friendly (so far I have met 4 of them and they all have smiles and helpful). Have only been here a day, but the stay is quite pleasant. There are 2 pools: inside and outside. Food choices: Food Lion is down the road at 120th St. Coastal Hwy has a bike lane so it is a short ride on a bicycle. Their deli staff is friendly and active all day long. How many times do you see a supermarket that cooks at 8pm! Fresh Fried Chicken at 830 at night is amazing! Restaurants close at 10pm during the week so having this option at the end of the day is great. More later in the week.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Springfield, Massachusetts", "Title": "“Excellent value for a good location.”", "Author": "christieaarons", "ReviewID": "UR117174994", "Content": "When we decided to visit Ocean City, my husband and I struggled with the decision of where to stay. The hotels on the boardwalk were $500 a night; the ocean front rooms farther up the strip were $300 a night. The Holiday Inn Express was only $180 a night but wasn't ocean front. Not having previously been to Ocean City and knowing nothing about how the strip was situated we had a hard time making a decision, but we chose the less expensive option and took our chances. Well, we were certainly not disappointed. Even though this hotel is not ocean front, it is a very short walk away from the beach. Just cross a parking lot, cross the Coastal Highway (which is easier than you may initially think) and down a short road right onto the beach. Even though this hotel is 15 miles away from the boardwalk, it was easy as can be to drive down to the boardwalk, find a parking spot and spend the day walking around. And there are many restaurants and attractions very close by. The rooms were a good size, with two double beds and a pull out couch. They were clean. The staff was extremely friendly. And the free continental breakfast was fabulous!! Scrambled eggs, bacon, pancakes, muffins -- not what you expect a typical continental breakfast to be and this saved us both money and time. Most of our days we drove to the beach on Assateague Island so not spending the extra money on something ocean front was a good decision for us. Directly behind this hotel, on the bay side, is a nice park with a playground. One word of advice,however, park in the parking lot behind the hotel because when there is a bad rain storm, the front parking lot floods so badly that they have to pump water out of people's cars. This isn't unique to the hotel. The whole strip was flooded one day when we were there and there was a lot of rain. With the attractions and the beach being so close and accessible no matter where you are on this strip, I think this hotel is the most for your money. Comfortable, clean and convenient-- and you can't beat that. We will definitely be returning here.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fairmont, WV", "Title": "“WONDERFUL...We will Return!!”", "Author": "grace51599", "ReviewID": "UR116548785", "Content": "This hotel was fabulous! It is very clean, close to the ocean, and has the nicest staff we have ever had on any trip. We highly recommend it to anyone traveling, especially if you have children. The two pools they offer are nice, clean and were not at all crowded during our stay. The indoor pool does not reach above 31/2 feet so our daughter loved it because she could touch in the entire pool. It is just a short walk to the ocean and if you don't want to walk you can park right next to the beach and then walk on the path down to the ocean. The breakfast at the hotel was also nice. We cannot tell you though how impressed we were with the staff at this hotel. From the front desk, (especially Ryan) to the entire cleaning and maintenance staff...we were beyond impressed. We will visit again and think this hotel was great! Thank you Holiday Inn!!", "Date": "August 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great location, attentive staff, clean hotel Good value”", "Author": "jbklein", "ReviewID": "UR115979476", "Content": "My husband and I enjoyed our stay. Our room was clean and neat. I loved the view of the bay from our room. I had a nice walk around the park. The beach was just across the street. The breakfast buffet was adequate.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "New York", "Title": "“8 years running.... Close to all but not hectic”", "Author": "dudsterdudster", "ReviewID": "UR115916412", "Content": "Have been coming back to this location yearly. Improvements to bedding are noticeable. Excellent location with the Park in back (can walk out onto the pier) or merely walk or drive across the street to the beach. Rooms are clean, staff always friendly & helpful. Pool is nice, not too crowded. Close enough to everything but not hectic as if you're on the boardwalk. Breakfast keeps improving...now with pancakes.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "PA", "Title": "“Great hotel - would recommend it and stay here again”", "Author": "pa_shopgirl", "ReviewID": "UR114740552", "Content": "We really enjoyed our long weekend at this hotel. The staff were all very pleasant and helpful. The room was clean and a good size (a non-suite room is what we had). Great view of the bay. Good location next to Northside Park. The complimentary breakfast was better than expected. They had everything from bacon, eggs, pancakes & biscuits, to cereal and donuts.", "Date": "June 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Akron, Ohio", "Title": "“Great view of the bay. Had a great stay and will be back.”", "Author": "ocean2day1", "ReviewID": "UR114623767", "Content": "Room was clean and had good ammenities. Staff was friendly and helpful in finding places to eat and activities in the area. The view was great with the bay and national park right behind the hotel. It was nice to be able to walk out on the pier and see the beautiful sunsets. The breakfast buffet was nice and we enjoyed it.", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New Kensington, Pennsylvania", "Title": "“Great Value”", "Author": "elynn888", "ReviewID": "UR113712011", "Content": "Stayed here at the beginning of June 2011. Staff was very friendly and allowed us to check in 4 hours ahead of time. The room was very clean and a good amount of room. Never had any problem with noise. The breakfast was okay but considering it was free I'll take it. Within walking distance to the beach...you just have to cross a six lane highway (which has a great cross walk that make it easy to get across so no big deal). You have to drive to get to the boardwalk but there is parking ($1 an hour). There are buses that stop on the street outside the hotel that you can take to the board walk for a $1 each way. (Decided to drive because of the large amount of teenagers that were staying in Ocean City the week we went). I would recommend this hotel to anyone. The money you save on getting a hotel further from the boardwalk makes up for the short drive. I would stay here again.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lehighton, Pennsylvania", "Title": "“A good value”", "Author": "rdm1025", "ReviewID": "UR112438134", "Content": "The room was spacious and clean. The breakfast that was included was very good. Not just bagles and muffins. The hotel is across the street from the ocean and a short distance north of the boardwalk.", "Date": "June 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Perfect for local golf outings”", "Author": "9OverPar18", "ReviewID": "UR109301536", "Content": "I stayed with a group of friends at the hotel as we played golf at many of the local courses. The stay was great for a group of golfers. It was away from the hustle and bustle of the boardwalk and the parking and noise issues that come with those hotels. It was convenient to the major roads out to where the golf courses are. Also, they worked with me to get a great deal on stay and play rates. If you are coming to OCMD to play golf and you need a place to start, DEF start here. Also, breakfast is included in the rate and was very good for a hotel breakfast and the attendant in the breakfast area was very polite and attentive.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Baltimore", "Title": "“Excellent Value and Reliable”", "Author": "Vixia", "ReviewID": "UR107853480", "Content": "This is my second time staying at the Holiday Inn Express and it was exactly as it was the first time I stayed. The rooms are clean, the staff is friendly and the price was excellent. There is even a little restaurant (Blue Ox) right outside the hotel which always serves good food, especially when you've been traveling for a few hours! For a budget hotel, I'd absolutely recommend this place, just don't expect all the bells and whistles you may find at the more expensive locations. :)", "Date": "May 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lancaster,Pa", "Title": "“Clean, convenient and friendly”", "Author": "AtlantictoPacific", "ReviewID": "UR89378310", "Content": "Our room was quiet, very clean and comfortable. Everyone was friendly, from the front desk staff to the cleaning staff. The hotel is located literally steps from Northside Park, an excellent facility for walking, childrens' playground, and the home of Winterfest, a beautiful display of Holiday lights ( You ride thru the park on one of the boardwalk trams). We had a great visit, and plan on staying there again ! Price is reasonable and you get a free hot breakfast !", "Date": "December 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Delaware", "Title": "“It was clean...”", "Author": "MagMagoo", "ReviewID": "UR87705553", "Content": "Stayed here with my husband overnight. It was okay. It was quiet and pretty clean. I do have to say though, it's not what it used to be. We asked for a bayside room, so we could see the Winterfest of Lights display, but were given a room directly facing the pool building. No street view or anything. Weird because there were hardly any cars in the hotel's parking lot... we thought we'd have a good chance at a bayside room since there didn't seem to be many patrons at the hotel. We were wrong. The room we were given on the 2nd floor seemed a little older than the room we stayed in the summer of 2009. The carpet was pulling away from the wall and some of the wallpaper in the bathroom was coming off the wall. Also, the hallways smelled a little like cigarette smoke. I was impressed with the hotel in 2009. This time, with this room we were given, not so much. The bed was alright and the pillows were awesome! We were given ample clean towels, washcloths and soap. I think that some of the hotel's rooms need to be updated sooner than later. It was clean, safe, and I would stay here again, but it wouldn't be my first choice.", "Date": "November 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Baltimore, MD", "Title": "“Great Value, Safe Location, Close to the Beach”", "Author": "fin_essential", "ReviewID": "UR79906842", "Content": "The hotel is adequate and in a great location. The biggest factors for me is cleanliness and safety, which the hotel provided both. The furniture and decor in the room was outdated and a little banged up. The beds and small open closet space were the only downside to the hotel. While the sheets were comfortable, the bed was hard and sagging and the pillows uncomfortable. If you are traveling with a large family, these rooms may be a little small. A big plus is that they have a huge indoor and outdoor pool as well as a hot tub, which was a nice addition. This hotel is on the North end of OC, and South end of Fenwick Island. There is beach access right across the road, and a beautiful dog-friendly park with a fishing pier behind the hotel. This location is great if you are looking to hit the beach but to be in a more family friendly environment. There are many places within walking distance where you can eat (or party) which is nice because you don't have to drive. Included are Hooters, Blue Ox, Old Mill Crab House, Dumser's Dairyland, Subway, Olive Tree (Not Recommended), Candy Kitchen, and DQ just to name a few. Bottom line is for the price, this is an adequate, safe, clean hotel that is close to the beach.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "NY", "Title": "“Would definitely recommend”", "Author": "traveler196", "ReviewID": "UR78470418", "Content": "The hotel staff was very friendly with everyone we met greeting us and making us feel welcomed. The room was clean and neat and the maid service excellent. The continental breakfast was also better than average with some hot items. The hotel location is \"far\" from the boadwalk but we never found it to be a problem. There are some good dining places nearby and the beach is only a one block walk.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Phila Pa", "Title": "“Still Good but slipping a Little”", "Author": "Jmmm", "ReviewID": "UR74527460", "Content": "We have stayed at this hotel a few times. We love the location. The park behind the hotel is really nice and it's only a block from the beach. We really like the pool area too. We always feel comfortable there. I did notice that the bathroom wasn't as, up to par, as I would have liked. The grout on the bathroom floor around the tub and the bathroom floor itself could have been cleaner. When you see something like that, it just makes you wonder how clean the rest of the bathroom really is. A clean room is so important for us. Hope the hotel isn't slipping. It would be a shame. They could still redeem themselves if housekeeping steps it up a little.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Tuppers Plains, Ohio", "Title": "“Nice Hotel, Near Beach, Bay and Park”", "Author": "OC_Travelers_2010", "ReviewID": "UR72923487", "Content": "We just returned from a (6) night stay at the Holiday Inn Express in OC. We were very pleased with our stay at this hotel. It's not an ocean front hotel, but very near both the beach and the bay. Behind the hotel is a large park for walking, biking etc. with a large pier that goes out into the bay. During our stay the hotel was sold out and somewhat busy, but we never noticed noise when we were in our room. Our suite was quite large with two double beds and a seperate area with a sofa, coffee table and small dinner table and chairs. The suites are equipped with a small refrig., m/w and sink. Our room was very clean and well maintained by the cleaning staff. Due to the season, there was usuallly a line for breakfast in the morning, but it was always well stocked and we never had to wait for anything to be filled. The staff was very courteous and helpful. I would recommend this hotel to anyone. The only drawback's that we saw with the hotel is that it is not oceanfront, and it is at the upper end of Ocean City, almost in Fenwick Island. That is not necessarily a bad thing though, because it gets you out of the high traffic area down near the boardwalk/inlet area. We felt very safe in this area and there were plenty of places to eat and activities here as well.", "Date": "July 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Philadelphia, PA", "Title": "“I will never spend another night at this particular Holiday Inn Express”", "Author": "amuhammad1997", "ReviewID": "UR71819986", "Content": "The hallways were hot & smelled as if someone sprayed funky underarm scent for air fresheners. The elevators were hot. Automatic front doors need to be installed. The breakfast menu sucked! Beef & turkey sausages and bacon are sold in the United States but I could not tell at this hotel. I saw hair in the tub. We saw two bedbugs crawling between the pillows after the linen was changed. Yuck! (I was so glad that we were checking out.) My dude managed to capture one of the bed bugs and placed it in a napkin & plastic bag. We showed it to the front desk clerk. She said that she would notify her manager. I really did not care what she did about the bug because we were outta there. The only good thing about the hotel was that the staff was very courteous.", "Date": "July 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Eldersburg, MD", "Title": "“Grand Hyatt pricing with cheap hotel experience”", "Author": "cobra61771", "ReviewID": "UR71368940", "Content": "This hotel had decent potential. Location and rooms are nice. My issues were as follows: When I made the reservation 1 month before my visit I asked them to note that I am allergic to goose down and I need non down bedding. (as I do in every hotel I stay without issues). When I got there to check in, I asked again to make sure that I get non down bedding. The front desk tells me that they only have down bedding. They even made the comment that it was noted on my reservation about the bedding and they even put in a note that they only have down bedding. I guess it didn't behoove them to call me and let me know. The first night I had to sleep uncovered without a pillow. What a horrible night of (non) sleep. I had to go buy a pillow from a store. Other issues... I was on the fifth floor during my stay. (of 5 floors). They had no A/C in my floor (not the rooms but the hallway). It was very HOT during my stay. (95+). Since the hallways had no A/C, it was super hot. So, in the afternoon after the beach, I'd come to my room, shower and get dressed to go out. By the time we go to the lobby we were drenched in sweat. The ice machine didn't work on the 5th floor. The ice machine didn't work on the 4th floor. The ice machine was always empty on the 3rd floor. So I had to trek down to the 2nd floor for ice. If this were a normally priced hotel I wouldn't care. But during the peak of the summer season their rates are very expensive. These types of things should not be happening at hotels that cost nearly $300/night.", "Date": "July 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "MD", "Title": "“Thanksgiving and Festival of Lights”", "Author": "jack21903", "ReviewID": "UR62247650", "Content": "We have been staying at other locations for our annual trip over Thanksgiving. We booked last year for this hotel with a window overlooking the lights. Front row seating! The amenities for a family are too numerous to list. Can't wait for our next visit this November.", "Date": "April 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Maryland", "Title": "“Clean with a great staff”", "Author": "AlishasHubby", "ReviewID": "UR59389342", "Content": "We stayed at this hotel for a soccer tournament after a terrible experience at the Fenwick Inn last year, and we were quite pleased. It was a clean and comfortable hotel, with a very friendly staff. It was within walking distance to the Ocean City Parks and Rec, where the tournament was held. There are a great places within walking distance to get something to eat. It is on 126th street, so it is quite a way from the boardwalk, but north Ocean city has a lot to offer. Would stay here again!", "Date": "March 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“good value, clean, wonderful park behind to walk in!”", "Author": "lab12345", "ReviewID": "UR59167508", "Content": "this was a great hotel for summer - lovely park behind to walk in on the water, decent restaurants to walk to and the fractured prune nearby - only complaints would be the indoor pool is waaaaay too small for size of hotel which is pretty typical for that price point. Be advised breakfast buffett closes at 9:30 SHARP and they aren't accomodating at all, coffee even goes away! But it is pretty good if you get there when they have it ready to go, saves some money on your trip.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Lexington Park, Maryland", "Title": "“Great value, nice hotel for a week end trip.”", "Author": "SolidStateS15", "ReviewID": "UR47238375", "Content": "This is a typical HI Express in good condition and clean. It's great for the short week end trip, but I wouldn't want to stay here longer than that. The breakfast is a nice fature, but nothing special. The Fractured Prune donut shop is right across the street and offers way better options. You'll be hooked the first time you go and get the custom fresh made donuts. This location also isn't very far from the Tanger Outlets in Rehoboth DE, and so we spent an entire day there shopping. You should head up there if you have time and get some great deals. The room we had was a double queen because that's what they had left, and it was fine. There was enough room, and the bathroom was also adequete. Like all of these in the chain though it seems, the beds were too hard for my liking. They use some cheap mattresses. Still was a fine stay though and I would stay here again, although next time I would like to stay farther down towards the boardwalk area where more of the restaurants and action is.", "Date": "October 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Maryland", "Title": "“Already plan on staying here again”", "Author": "Beatrice07", "ReviewID": "UR38894260", "Content": "We went to Ocean City for a short two day trip. We spent the first night in a hotel near the boardwalk but the noise and atmosphere were not for us so we booked our second night at this Holiday Inn Express. The staff was so accommodating - especially Josh. We were allowed to check in early and they moved us quickly when there was an issue with the air conditioner. The room was large and clean, with a small fridge and microwave. Also, breakfast is included in your room cost - a big benefit for a family with teenagers! The hotel is two blocks from a very nice public beach. You do have to walk across Coastal Highway, but the crosswalk is right there by the hotel. They also have a nice outdoor pool and a beautiful city park behind the hotel. We are already discussing a return trip to this hotel as soon as we get the chance.", "Date": "August 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "baltimore", "Title": "“great location & a good value”", "Author": "rick069", "ReviewID": "UR35110672", "Content": "after looking at all the positive reviews, decided to give it a shot... booked it on orbitz which made it convenient to check in. rooms are real clean. front desk staff were very friendly & courteous. loved the breakfast buffet , especiallly those incredible cinnamon buns!! walking distance to many good restuarants. the outdoor pool was small, but im really a beach person anyway. my girlfriend also really liked it. will definitely come back!!", "Date": "July 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "San Diego", "Title": "“Quiet, cozy and comfortable”", "Author": "ApolloSanDiego", "ReviewID": "UR34091848", "Content": "Check in was fast and friendly. Clean and neat room, friendly staff, nice suite (no balcony: none of the rooms have them), couch and coffee table (plenty of walking space) with microwave and fridge, free wi-fi, good location to beach, and good free breakfast buffet. Pools are OK: outdoor is small and the heated indoor is only 3 1/2 deep. Prefer to hang out at the beach. Overall good value for the price.", "Date": "July 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Southern Maryland", "Title": "“Great Hotel”", "Author": "TeamMom25", "ReviewID": "UR33580517", "Content": "My husband and I stayed with another family for a basketball tournament. The location was perfect, as we could walk to the recreation center. The hotel staff was very pleasant and gave us early check in. The free breakfast was fine for a free breakfast. We had a suite with two double beds and pull out sofa. Room was very clean. Prior to us getting to our room, housekeeping notice I had a lot of kids with me (they were hanging out with us not staying) and offered to get us more towels if needed. Hats off to housekeeping. Since I'm a priority member, I was give late checkout at 1:00. My only complaint was it was just a bit pricey for one night. With it being located across the street and down one block from the beach and I'm sure that had a lot to do with the price.", "Date": "June 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Baltimore", "Title": "“Great price! Great place for the money!”", "Author": "Safecracker", "ReviewID": "UR23265332", "Content": "We stayed (Fri & Sat) during the off season while visiting family in the area. The room was only $67 a night for a double. (King was more so we \"toughed it out\".) ;) Staff was great. Room was super clean and had a microwave and frig. They had a heated indoor pool and hot-tub that were deserted other than us. The pool was only 3 1/2\" deep but it was still nice. There's also and outdoor pool but it was closed for the season. Free wireless internet. (I'm always amazed at how much higher priced hotels gouge you for internet service.) The free breakfast left a bit to be desired. No waffles - which I've grown accustomed to seeing at places with free breakfast. The eggs were dry and barely warm, and the biscuits for the SOS were hard as a rock. I skipped it the second day. (And I rarely do that!) All in all though, I was very happy with the place. (And I'm fairly picky)", "Date": "January 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Location": "3"}, "AuthorLocation": "Pittsburgh, PA", "Title": "“Okay Not All That”", "Author": "Markeeta", "ReviewID": "UR22973119", "Content": "We stayed at the Holiday Inn Express in Ocean City on December 10, 2008. I picked this hotel after reading reviews about it on trip advisor. Since I was only going to be in town for one day I figured let's try it. When we checked in and went to our room, we found the maintenance cart and cleaning supplies left in the room. We called down to the front desk and they put us in another room. I was disappointed with the fact that they called this a suite. As I was traveling with my family and there were four of us to our dismay it was not. It was just a wall dividing a small couch on the other side of the wall and ONE TV what a drag. But because it was only going to be for one night, we decided to stay. The beds were very cozy and the hotel room was clean and I could not complain about that. The hotel was quiet and we slept fine. The breakfast in the morning was just what was described in previous reviews with a large selection which was a plus to staying here. Another negative I personally did not like is in the bathroom they have a sign implying that if you steal a towel, wash cloth or what ever your bill will be charged for it. Although I do not think this is a bad policy, as hotels are stolen from all the time, I thought it would have been more tasteful had they put that information in the check in paperwork so that each guest would understand that. I personally felt as it they were accusing me of that possibility out loud as a guest. It did not feel very welcoming. Overall if you are traveling with your family for one night this hotel is doable. If you are traveling alone it is also doable but not for a week long family vacation.", "Date": "December 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Miami", "Title": "“Super room at a great price”", "Author": "bowman716", "ReviewID": "UR22219488", "Content": "I travel 5 months a year and maintain status with Starwood, Hilton and Marriott. This was the best Holiday Inn experiance I ever had. My king suite was huge, clean and everything worked. The bed was better than expected with quality linens and pillows. There is a well maintained indoor pool and hot tub. The free breakfast is very taisty, hot, well organized and clean. All employees I encountered were freindly and totally professional. Typically I stay at the Ocean City Hilton for around $125.00 per night. At $95.00 per night, the Holiday Inn Express made me very happy.", "Date": "November 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Not for Light Sleepers”", "Author": "RFJ", "ReviewID": "UR20291831", "Content": "I stayed here for a couple of days during Sunfest. The room was clean, pleasant, and appeared to have been updated. In fact, the whole hotel looked somewhat new. Staff was very pleasant. Rate included a breakfast that had more variety than most (hot alternatives as well as standard continental fare) and the breakfast area was large and well maintained. While the elevators were inordinately slow for a 5 story building, my main complaint was noise from the wind. The howling wind sounded as though we were in the arctic circle. Front desk said this was typical for hotels in the area but I hadn't experienced this on my 2 previous trips at other OC hotels around the same time of year (including one on the oceanfront). I wonder if their windows weren't sealed properly??", "Date": "September 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Philadelphia, PA", "Title": "“Great Experience!”", "Author": "MegInPhilly", "ReviewID": "UR19850228", "Content": "We stayed overnight here on September 2, 2008 on our way home to Philadelphia from Williamsburg. It was a pleasant experience from check-in until check-out. We were greeted at check-in by John, at the front desk, who was super nice and efficient. We found the lobby to be a big and cheerful area. As a general rule, I agree with another reviewer that 4:00 PM is too late for a check-in time but it didn't interfere with our travel plans so it wasn't a problem for this trip. Our room was updated, clean, and bright! Without needing to make a special request or pay an extra fee, the room included a coffee pot, coffee, utensils, cups, refrigerator, microwave, iron, ironing board, and paper towels. The bed and bath linens were excellent. When I realized there was no comforter on the bed I thought it was going to be an uncomfortable night of sleeping but the triple sheet was surprisingly comfortable and I'm now a fan of this new bedding idea. The bathroom was big and the towels were really thick and plentiful which was a nice change from other hotels I've stayed in. While I did not go down to the breakfast, my friend brought up to the room a couple of muffins and a cinnamon bun, which were excellent! Checking out was quick and easy. We paid $79.00 for this room, including taxes, and feel it was a great value for the money and would definitely stay here again.", "Date": "September 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Elkridge, MD", "Title": "“Nice Hotel”", "Author": "RickHarman", "ReviewID": "UR19761784", "Content": "My family of 5 stayed there in August 4-7, 2008 in a king size suite. The suite also had a pull out queen sized bed where the boys slept and our infant slept on an air matress. The suite was clean and had a microwave, sink, & refrigerator. The kids loved the hotel and have been bugging us to go back. More on the hotel later... The hotel is ideally situated near restaurants and within easy walking distance of a grocery store. The beach is across the street. There are around 30 free parking places right next to the beach entrance. There is also a crosswalk with crosswalk light that gives families plenty of time to safely cross the street. The beach was nice though the water was somewhat rough (watch after the kids big time). There were lifeguards up and down the beach. The hotel had two pools: indoor pool with a depth from 3 to 3.5 feet and an outdoor pool with a depth from 3 to 5 feet. My oldest son is slightly taller than 3.5 feet which presented a problem in both pools. He loved walking around in both, but I had to keep him away from the deeper water. If the inside pool had been kept at 3 feet, it would have been ideal. I believe the pools are open until 10 pm which was more than adequate. Behind the hotel is a park with baseball fields, walking path, and PLAYGROUND. The kids loved the playground which had a small and large kid section. The pattern for our stay was beach, playground, pool, and sleep. We occasionally had slight troubles with noisy neighbors. We tried to compensate by keeping the AC on the whole time but the unit did not have a \"fan always on\" button which meant it cut on and off the whole night. Fortunately, the neighbors quieted down by about 10:30 or so. Next time we spend any time at any hotel, we're going to bring our white noise machines. Lastly, the hotel had a better than average complementary breakfast which included hot items as well as the standard pastry/cereal selections. The hotel rotated their offerings which was nice. Our oldest had a small scare with one of the muffins which contained nuts (he's allergic to nuts). Fortunately, his one bite didn't affect him and the staff put up a sign indicating that nuts and or nut traces are in the muffins. We had one depressing event happen at the hotel. My wife's jewelry was stolen (probably). It is still being investigated. The moral of the story is to never leave valuable items in your hotel room unless it is locked up though with 3 small children that's easier said than done. PROS: Nice location (beach, playground, restaurants, & grocery store), nicely equipped clean rooms CONS: Pool depth is slightly high for young children (unless they know how to swim), no dvd player in the room, no AV hookup on TV", "Date": "September 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Alexandria, VA", "Title": "“Great hospitality!”", "Author": "hayseedPA", "ReviewID": "UR19696007", "Content": "We just returned from a girls weekend away, Labor Day Holiday 2008, and I must say I am thoroughly pleased with the hotel. The staff was very friendly and ready to help with any questions I had. The front desk was efficient and informative. The room was clean - the shower curtain did have a stain on it but otherwise everything was clean and fresh each day. Housekeeping did come to the room late each day but I think that schedule is based on check-out dates - or perhaps they were short staffed. Nevertheless - the room was cleaned eventually. The hotel is located at the North end of Ocean City - almost to the Delaware beaches. This is a very family friendly end of town. It's also very friendly for those who just want to sit quietly and read - away from all the chaos at the Boardwalk. It is a short two block walk (across a busy four lane highway - \"curb\" your kids for safety's sake!!) to the ocean where there is a chair and umbrella rental stand located. Talk to the rental guy (he is not affiliated with Holiday Inn Express) - you can get a pretty good rate for the week and not deal with the hassel of hauling chairs and umbrellas to the beach. He sets everything up for you too! Our room overlooked the pool and North Side Park on the bayside of the island. We had some excellent sunsets!! The outdoor pool was crystal clear. The hotel offers a hot bar breakfast with everything from oatmeal to cheese omelets to bagels and bananas. It does not have a restaurant affiliated with it but there are two restaurants just outside the hotel. The strip mall immediately next to the hotel offers a Subway, Ledo's Pizza and The Fractured Prune - as well as a Verizon Wireless store. Once you arrive at this hotel you really can leave your car in park and walk to most everything you need. The TV only has a limited number of stations and no DVD player. If you have a chance of rain through your holiday vacation, I recommend bringing board games or a DVD player with you. Otherwise - go outside, you're at the beach! You won't regret your stay at this hotel.", "Date": "September 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "new york", "Title": "“Clean Hotel, Excellent Value”", "Author": "adibened", "ReviewID": "UR19182928", "Content": "We are a family of 4, two girls ages 16 and 14. First time in Ocean City so hotel choice was hit or miss. This hotel was definately a good choice. We chose to upgrade to a \"suite\" which is a little bigger than the average size room, the room was clean, the beds had fresh linens, nothing from 1990 - all cotton sheets and no dingy bed cover. The bathroom was a very nice size - remember, we are three women so big bathrooms are important. We were 1 1/2 blocks from the beach and about 5 miles from the boardwalk. This hotel is in a much more quite area of Ocean City. Ocean City in general is a huge step up from a Seaside, NJ hotel and/or boardwalk. The breakfast that is included saved my family $50 per day. The breakfast buffet is fresh, hot and not cheap. Bagels, creamcheese, beanut butter, muffins, eggs, bacon, sausage, cereal, oatmeal, individual containers of milk, fresh coffee and juices. Excellent value. The outdoor pool is very nice and they have an indoor pool for when there is bad weather. The only thing that was hard is check in is 4 p.m. and no earlier; the hotel was booked solid, but they were extremely accomodating. Get your lunch foods and the WaWa and save yourself a ton of money and aggrivation. Great hotel will be going back next year.", "Date": "August 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Delaware", "Title": "“Great stay for our family of 4”", "Author": "MagMagoo", "ReviewID": "UR17822237", "Content": "Our family--my husband, my two boys (5 and 7), and I--stayed here from June 23rd until the 26th. I have nothing but good things to say from start to finish. The reservations were super easy--I reserved a few months ahead of time online (through the hotel's website) and got a confirmation letter via snail mail a week later. On my way to the hotel, I called and asked for early check-in and I also asked for a bayside view (overlooking the park and the bay). The front desk agent I spoke to was VERY accomodating and very pleasant to deal with. She made sure we had a great bayside room with a view and check-in took about 3 minutes, 4 tops! Awesome. The lobby area was very clean and there was a couch and many chairs there, but there was absolutely no loitering. Very nice. The elevator in the hotel was never crowded--in fact, we were the only ones in it the whole time we were there! That was clean and pretty zippy. The hallways were clean and I could detect a faint smell of microwave popcorn, but no horrible smells. Our room key worked just fine and when I opened the door to our room, I was really pleased. Not that I thought I was going to open the door to an icky room, but the cleanliness was outstanding and everything was neat and in place. Our room had two queen beds, a table and two chairs, and a \"kitchen\" area. The kitchen area contained a few cabinets that housed a huge roll of paper towels and spare utensils and a coffee maker with coffee and cups (with lids!). The refrigerator wasn't cold when we first got there--I had to turn it on all the way up to get it cold (fast, anyway). The linens were soft and comfy, as were the beds and pillows. The air conditioning unit was easy to control--we kept it on low, but adjusted the dial just slightly off center to the left to keep it comfortable. :o) The bathrooms were very clean. The only thing I did notice in the bathroom is that the showerhead wasn't the best. Other than that, the water pressure was fine. Also, in the bathroom, there were little bottles of shampoo and conditioner, but no little lotions or shower caps, etc. Not a big deal, but I always think that a basket of extra stuff is a nice touch. The continental breakfast was good. There were cinammon buns (kids loved those), bacon, eggs, English Muffins, bananas, coffee, juice, milk, cereal, and oatmeal. I'm sure there a couple of other things, but it escapes me right now. There weren't any waffles or anything like that--just enough to get you going and that was good enough for my family. The breakfast area was clean and it was restocked often. The area itself was a little tight though--the tables and chairs were very close to other tables and chairs. Just a little tight, nothing horrid, but just to let you know! Also, on our way out of the breakfast area, there was a tiered basket to the left with free newspapers in it (might be for travelers during the weekdays, I'm not sure). Parking--not a problem. We never had to park behind or on the side of the building. We always parked right in front and everything was well lit. All in all, a great trip and I'd definitely return. :o)", "Date": "July 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Twinsburg, Ohio", "Title": "“Good value”", "Author": "Northern65", "ReviewID": "UR17342950", "Content": "I had read other traveller's reviews before staying here and I must say they were pretty well on target. This place is a good value with great location next to Northside Park behind hotel. My family and I went to the park almost every day of our stay. Many restaurants also within walking distance. Hotel staff were very friendly and acccomodating. Hotel was pretty quiet during our stay with little noise from other guests. One downside was the very soft beds we had (unless you like them that way). Choice of soft or firm pillows was a nice touch. Continental breakfast area was clean and frequently serviced but selection was a bit limited. We would definitely stay here again.", "Date": "June 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Oklahoma", "Title": "“Great Hotel”", "Author": "DavisFamilyOK", "ReviewID": "UR16665594", "Content": "Relatively new property on the North Side of Ocean City. Clean Rooms. Excellent service. Standard (and good) continental breakfast. Very family friendly. Boardwalk is about 7 miles away, but beach is walking distance from hotel. North end of the beach seems to be less populated and more family friendly. Lots of restaurants in vicinity.", "Date": "June 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Morehead City, NC", "Title": "“Good place to stay”", "Author": "Korin", "ReviewID": "UR16476812", "Content": "This hotel is what one would expect of a Holiday Inn Express. They have the updated bedding and amentities. The property is located near a lot of shopping and restuarants. Parking is somewhat difficult and awkward. I would stay here again. By the way... AVOID the Olive Tree restaurant behind the hotel. It was the worst Italian I have eaten in my life. I would have been better cooking a meal in the microwave.", "Date": "May 28, 2008"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Fort Myers, Florida", "Title": "“Good hotel while doing business in Ocean City”", "Author": "scottbfdc", "ReviewID": "UR14427563", "Content": "Stayed at the Holiday Inn Express in Ocean City from March 17th to March 20th while attending a trade show at the Ocean City Convention Center... The Convention Center is about three miles or so south so you definitely have to drive there, however at this time of year OC is VERY quiet, no traffic to worry about. This is the second time I have stayed at this hotel while attending a trade show in OC. The hotel is clean and quiet and at this time of year offers a great rate ... under $65.00 per night booked direct with the hotel on their website. I will stay there again. I requested a room on the bay side ... nice view and quiet. At this time of the year restaurant options seem to be few ... I did some Chinese take out from Ying Xing which is about ten blocks north of the hotel ... the food was pretty good and reasonably priced. If you go in the summer, the hotel is not near any attractions (boardwalk) but the beach is right across the street. For business, and especially in the off season, great rate, good hotel, I do recommend this Holiday Inn Express.", "Date": "March 21, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Morgantown, West Virginia", "Title": "“Another Great H.I Express!”", "Author": "Mixie424", "ReviewID": "UR12268433", "Content": "My boyfriend and I stayed here during August of 2007 for a week. I had chosen this hotel for its great price and close location to the beach. We arrived in Ocean City a few hours before our check-in time and were exhausted (we had driven through the night from West Virginia). The hotel staff and desk clerks were INCREDIBLY accomodating and even gave us an upgrade to a room on the 3rd floor with a king-size bed and a jacuzzi tub- because we slept in our truck in the parking lot for those few hours while the room was cleaned. I was very pleased with the cleanliness of the room All Holiday Inn Expresses with the new bed linens are fantastc. No gross bed-spread- only crisp clean white sheets and pillowcases. My only complaint about the room would be the jacuzzi tub. It didn't look very clean around the jets with that brownish yuckiness that some tubs get that haven't been thouroughly cleaned. I didn't plan on using it though- so it wasn't much af a bother. Oh- if you are thinking about springing the extra cash for an upgrade to KIng size/jacuzzi room- you may want to rethink it. The tub is very small. Not much room for one person relaxing- definelty not two. The bed is HUGE though. Very comfortable. The pool area is fairly clean. Both the indoor and outdoor pools were usually very crowded- which is to be expected at a family hotel like this. Our room was above the outdoor pool- which was kind of strange because many times I would open the curtains and find lots of people looking up into my window. We also noticed some trash/clothes/towels in the water before the pool opened in the morning- but they were cleaned up before the area was opened. Another drawback to the hotel was the fact that there were absolutly no balconies. It really took away from the \"beach feeling\", and it made it hard to dry out our beach towels! My boyfriend and I didn't have a problem walking across the 4-lane road to the baech, but I wouldn't attempt it with a family & all their beach gear. We actually packed up the truck with our stuff and drove over a few times. There is free parking (first come first serve) right next to the dunes, which makes it really nice for carrying stuff- expecially if its 90 degrees+ and you are the color of a cooked lobster! (sunburn=PAIN) The hotel is within walking distance of a nice steak/seafood house (Blue Ox), a medical care building, one of those sovenier shops, and the Prune! A must visit donut shop. There is a HUGE park behind the hotel. We saw lots of walkers, dogs, kids riding bikes, runners, soccer games...lots of other activities too. There were police patroling in cruisers throughout the night. I felt pretty safe leaving our vehicle on the opposite side of the hotel than our room. One of the best parts about any Holiday Inn Express is the breakfast- more importantly the cinnamon rolls. SO DELICIOUS!! I don't think that I will stay here again- but only because I wanted a diferent kind of experience when I'm on vacation. I would rather be on the beach than a block away. This hotel would be perfect for a business meeting or as a one night stay.", "Date": "January 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore", "Title": "“Third stay here with no problems”", "Author": "athruz", "ReviewID": "UR11287337", "Content": "This is the third time we have stayed at this motel and we were not disappointed. We went to Ocean City to shop and see the Christmas lights. The lights were right behind the motel in a park. It was very nice. This motel is very clean and has a nice indoor heated pool. Nice breakfast too. We would stay here again.", "Date": "December 6, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Manahawkin, NJ", "Title": "“Out of the way, but also out of the ordinary!”", "Author": "vekkeo", "ReviewID": "UR8708277", "Content": "While this hotel is quite a distance from the boardwalk, that can be a blessing in disguise. The hotel fronts an absolutely wonderful bayfront park that provides walking paths, a fishing pier, a children's play yard, and ball fields, and there are many restaurants within easy walking distance. The hotel itself is one of the cleanest and friendliest I have stayed in. We stayed in a king suite (get a room facing the park if you can, the sunset views are great!) Bed linens were fresh and crisp, and there was an abundance of thick, thirsty towels in the bathroom. There is no balcony in the room and no windows that open, but the room smelled fresh with no stale hotel smell. If you wish to take in the boardwalk, there is a bus system that runs the length of Ocean City 24 hours a day, 7 days a week. For $2, you can use the system for the entire day. Certainly a bargain. The outdoor pool was a great place for sunny warm afternoons, and there is also an indoor pool and hot tub. The ocean is an easy one block walk from the hotel. We thoroughly enjoyed our stay here and plan to return. I imagine in the height of the summer season, this hotel's location would be a welcome change from the congestion and crowds associated with the boardwalk/beachfront area.", "Date": "September 13, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "BALTIMORE", "Title": "“holiday in express in oc you cant go wrong”", "Author": "WNJS", "ReviewID": "UR8460762", "Content": "i have been going to oc on business all summer (8 weeks) and staying at the holiday inn express. check inn is quick and friendly. my rooms have always been clean and neat. the breakfast buffet is good. both pools (indoor and outdoor) are always clean. most importantly the people staying at this hotel are respectful and quiet during the night. this place is priced right and for the best place to stay in oc i highly reccomend this hotel.", "Date": "August 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "fort myers beach, florida", "Title": "“\"Wonderful\"”", "Author": "timmyor", "ReviewID": "UR8262997", "Content": "I just returned from Ocean City with my boyfriend, we stayed at the Holiday Inn Express. It was fantastic, we were happy with the entire stay there. I wen't on trip Advisor several weeks before our trip and read many reviews on this Hotel and \"helpful\" hints about the area. I had been to Ocean City about 9 years ago, I stayed at the hotel which is now the Clarion, and the Holiday Inn was just as wonderful! It was clean, everyone was very nice and helpful, the breakfast in the morning was wonderful and yes, the warm cinnamon rolls were great!! I highly recommend them! If you are not into kids, it's not the place for you, there were plenty of kids, all ages.... The park in the back of the Hotel was just wonderful, we walked every night, the moon and stars were beautiful over the bay... I would highly recommend this area for people who have kids, any age, and couples.. it was great, the beach was right across the highway, not far at all... we walked to a few places, there was a Subway shop and pizza right next door to us, which was good for fast food... and if you have ever been to Ocean City and like buffets, eat at the Bonfire, it's worth it.. I believe it' s on 60th st.. or close to that... we would definitely go back again and I wan't to thank those who also did a Trip Advisor review on this Hotel and rated it just as great as we did.. ps] our room was wonderful with the exception of a balcony, but it didnt matter, that was the worst thing about the whole place... worth the stay!!!! anne from NY", "Date": "July 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Great For Famlies ”", "Author": "james15", "ReviewID": "UR8233614", "Content": "my wife and i and our two boys ages 12 and 8 stayed here from 7/14-7/21/07 ..this is our 2nd time staying here... we love it... the room was great ,two queen beds fridge and microwave... there are two pools one in and one out both very clean...the best part of the hotel is it is across the street from northside park... bike riding ,roller blading.walking, soccer fields baseball fields.also a pier to walk out into the bay an fish or crab... on sundays they have sundaies in the park ..you can make ice cream sundaies for a fee (small) and listen to a band ..the week we were there we heard the key west band paying tribute to jimmy buffet ...we all loved it ...we also went to see the delmarva shoebirds basball team...(a) of the baltimore orioles about 1/2 hour away in salisbury... we loved this hotel very friendly staff... continental bfast was good but they should have a more healty choice ...go to eat at tequila mockingbird a block away good food ... contact me at robert.carricato@us.icap.com for more info", "Date": "July 25, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "PA", "Title": "“Great Hotel!”", "Author": "Parklandmom", "ReviewID": "UR8113681", "Content": "My family and I stayed here June 29, 2007. The staff is friendly. The beds are comfortable. Room was clean. There are 2 pools, one indoor and one outdoor. The property is located across the street from Northside park. I would recommend this hotel to anyone. As a priority club member, I took advantage of the late checkout option.", "Date": "July 13, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Pittsburgh PA", "Title": "“Somewhat Overrated”", "Author": "Longs1", "ReviewID": "UR5597562", "Content": "After reading the reviews here we booked the Holiday Inn Express on fairly short notice through this website and then through the Holiday Inn Express Online Reservations site. We booked a Standard Room and requested non-Smoking. Upon arrival we were told we were booked into a King Suite (one King and one pull out sofa) and it was a smoking room that they had placed an ionizer into. We asked to see the room - it wasn't very large and still smelled of smoke. We went back to the desk and complained, and they \"found\" a non-smoking King Suite like the one we saw, on the third floor. The pullout couch was too small to reasonably sleep two people unless they're really small kids, so we asked for a roll-away. They gave us one at no charge, and said they normally charge $15 per night for it. It isn't that good, but our 10-year old could sleep on it alright. The rooms aren't that big and the \"kitchenette\" is really just a very small sink with a smaller refrigerator underneath, and one double-cabinet about 15\" high above the sink, with a microwave mounted underneath. Comes with a coffee maker but not a toaster. The lack of a balcony or window that opens makes the room claustrophobic. Cleanliness is pretty good overall, with the usual slight dust visibility around the perimeter of the room. There was plenty of dust behind the TV. The king bed is comfortable, but not the pullout sofa or rollaway bed. The bathroom is average sized for a cheaper hotel. When the staff gave us this room, they reminded us that it was an \"upgrade\" to have jets in the tub, but the jets have a lot of black sludge/mold in them and I wouldn't get in the tub and use the jets. The outdoor pool is larger than most, about 5 feet deep at its deepest, and seems fairly clean, we saw someone cleaning it most days. The indoor pool seemed murkier, and is smaller and only 3-1/2 feet deep. There's a hot tub with the indoor pool, and the heat was up but the jets were broken for our entire stay. The chaise lounges and tables use the standard plastic, but they were fine, didn't see any broken. There's plenty of parking on the side and back of the hotel, but the front is completely crowded with the Blue Ox restaurant in front and the \"Olive Tree\" restaurant on the left side of the hotel - there's no sense that the hotel has any of its own \"grounds\" to speak of. There is the Northside Park across from the back of the hotel, a pretty nice park overall. The breakfast is pretty basic - 4 cereals, bagels, tasteless english muffins, other mini muffins, the cinnamon rolls which were good but kind of heavy, one or two fruits - oranges, apples, bananas that were generally way too green, and coffee/tea and orange and apple juice. The women who work the breakfast really hustle and keep everything full, but it's all gone by the published 10:30 a.m. end time. The walk to the beach is pretty easy across coastal highway, there's beach access directly across from the hotel at 127th street. Overall, I wouldn't stay here with 4 people unless you are assured of two queen beds and the parties sharing the beds can get along in them - a problem for our two boys. If you enjoy a balcony, forget it.", "Date": "August 10, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "4.0", "Value": "3", "Service": "2", "Rooms": "4"}, "AuthorLocation": "Herndon, Virginia", "Title": "“One of the best places to stay if you have kids.”", "Author": "minamu", "ReviewID": "UR5434849", "Content": "We decided at the last minute to go to Ocean City for the first time, for the 4th of July. With a 7 year old. From everything I heard, it would be a way to get a slice of classic Americana beach/boardwalk experience. I chose this hotel because it had the best prices at the time I was looking, and practically everything else was totally booked. I was a bit wary because of the distance from the boardwalk and the fact that it is an Express, but I was pleasantly surprised. It can't be beat for the 4th of July if you have small kids and want a hassle-free 4th of July experience. The hotel is across the street from the beach. Up past the 100s, the beach is very nice and not crowded, so we didn't mind not being near the boardwalk a day or two since we were planning on visiting that area specifically anyway. Past the 100s seems to be a swankier part of town anyway. The hotel lobby and common areas are clean and inviting. The staff is nice. We didn't use the indoor pool because we used the outdoor one. It was in very good condition for a pool at a hotel near the beach, with very refreshing, cool, and clean water. It is bigger than many of the hotel pools and kind of kidney shaped rather than oblong. There were nice tables with umbrellas and lounge chairs around it. The only detraction was the maid service. The first day, our person never came to clean the room even though an envelope in our room identified her by name, and we left her what we thought was a good tip/incentive (also untouched). We had to report this and then they got someone in to clean the room within 5 minutes. We later noticed that this backup person didn't take away our old towels, though she did leave new ones. She forgot to leave us new shampoo and conditioner. The next day, our beds were made but the bathrooms were never really cleaned, they just left new towels and other stuff. I don't know if this was the hotel policy because it's a beach hotel where they get overwhelmed with constantly cleaning up sand and so have decided to just leave towels and tidy but not do the floors. It was a little annoying, but I felt like if that was the case, I kind of understood, because we were continually trooping sand in, and at least they were leaving new towels, cups, ice bags, etc., each time. The room was otherwise pleasant, with a little sitting area with a loveseat, coffee table, fridge, and microwave. I agree that the free breakfast never varied, which was a bit tiresome, but that could be easily remedied if they offered yogurt cups and cut fruit to break up the bready theme. On the other hand, if one took the time, one could vary it each day. I think most people are on their way out and rush and grab the mini muffins and cinnamon rolls. One could sit and have a bagel and cream cheese and a boiled egg one day or a bowl of cereal and create some variety. And hey, it's complimentary. In a town where eating can cost quite a bit, it's nice to get something in your stomach in the morning without shelling out more money. Also, the Fractured Prune is a short walk over to the strip mall next door if you want to pig out on the famous donuts. One of the best things about this hotel is where it is located. It is at 126th and Coastal, on the bay side. It is right next to a park where they have a wonderful 4th of July celebration each year. You can literally just walk across the parking lot to it. In a big field they put up huge moonbounces and other inflated obstacle courses, rock climbing wall, etc. They sell tickets that amount to about 50 cents per ride. Kids 8 or 9 and under will love this area. Then there's another adjacent field where they set up old timey arts and crafts stations with things you can buy, even llitlle folksy things like $1 grab bags for kids, and there were bands playing \"beach music\", plus lots of that good/bad food -- cheesesteaks, buffalo wings, funnel cakes, pizza, oyster fritter sandwiches, lemonade, hotdogs, ribs, chicken, ice cream, snowcones, etc. They set up lots of picnic tables with red and white checkered tablecloths. It's heavenly if you like your classic fourth of July celebration. At night, a spectacular fireworks display, the longest I've ever seen (and I've seen many) right there in the middle of a pretty uncrowded field. The finale to the fireworks was the most elaborate I've ever seen, almost as if they had something to prove or wanted to make sure absolutely no one left disappointed. I laughed and laughed and laughed as it went on and on and on. I told my friend that I'd just witnessed fireworks on viagra. Anyway, nowhere else in OC can you do everything you ever wanted to do in OC for the 4th of July and then be in your room having pillow fights with your kids within 5 minutes of the fireworks ending instead of trying to walk to your car and sweating out the humidity. There are also several good restaurants within walking distance. There is Tequila Mockingbird, which has excellent Mexican. There is Babe's blue ox steak house and raw bar. There is a dough roller and dumsers dairy (the only dumsers that sells oyster sandwiches). There is the Olive Tree, which was a little dingy and seemed an almost complete clone of Olive Garden as far as features (the sign out front and unlimited salad and breadsticks), but seemed to have much better food (a seafood marinara was excellent, with al dente pasta and seafood that was very fresh and not overcooked -- including the scallops)/the kid's pizza was an actual, nice, inspired pizza with spices and an excellent crust, not just thrown together as at so many restaurants. All in all, we'd probably stay here for any 4th of July at OC. For a different occasion, we might try to get a suite at the Hilton.", "Date": "July 7, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Eagleville, PA", "Title": "“Pretty good, with one caveat”", "Author": "Steve888", "ReviewID": "UR5415752", "Content": "Overall, the hotel was OK. We travelled with our 2-year-old and got a \"suite\" (which was really just a room). There was a little bit of an off odor when we got off the elevator that persisted throughout the week. But it's a Holdiay In Express, so we weren't expecting 5-star accomodations. The room was clean , and we liked the fact that we had a fridge. The staff was very friendly and accomodating. They all learned our son's name and said Hi to him all the time. They had no problems with us moving our check-out time back an hour to enjoy an extra morning on the beach. The breakfast buffet was convenient, but not great, and it did not change from day to day (bagels, english muffins, cinnimon rolls, hard-boiled eggs, bananas, cold cereal, oatmeal, mini-muffins, and assorted breakfast drinks). It was OK for our purposes most mornings though. It's pretty far up the beach from the main strip - you won't be walking down to the boardwalk, but the section of beach was pretty nice and less crowded than some others, since there's no big hotel there. Our issue was that the hotel is actually pretty far away from the beach, especially when you have a 2-year old. The road you have to cross is six lanes wide, and the hotel is set pretty far back beyond that. Not too bad for adults or older kids, but toughfor a toddler. If we had it to do over again, we'd get a hotel on the other side of the main strip.", "Date": "July 1, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Pasadena, Maryland", "Title": "“Great value!”", "Author": "Coach99", "ReviewID": "UR5229450", "Content": "My wife and I stayed here on a 3-day business trip. (The conference hotel was too expensive so we found the HI XP at a AAA rate very affordable.) The property is on the north end of Ocean City (about 2 miles from the Maryland/Delaware state line), away from the busy downtown and boardwalk areas. While we normally stay at oceanfront properties, this bayside property was nice. Upper floors facing west have the view of Assawoman Bay and 126th Street Northside Park. The park has walking trails along the bay, sports fields (baseball, soccer, lacrosse) and playground equipment for the kids. Shorebirds and a long public pier into the bay(available for fishing and crabbing) made for an enjoyable stay. The Atlantic Ocean, with public access to the sandy beach, is 1 block toward the east. The room with 2 queen beds and cable TV was clean and comfortable. It contained a microwave and small refrigerator. A continental breakfast (muffins, cinnamon rolls, cereal, juice, etc.) was included. The pool area was clean. I would recommend the HI XP for a nice relaxing stay when going \"down the ocean, hon\".", "Date": "May 28, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“Great Stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR4032907", "Content": "I just stayed at the Holiday Inn Express Ocean City for business. This is a great hotel. I stayed in a king suite and it was very spacious, well furnished and spotless. Everything is very modern and up to date, unlike most of the hotel properties in Ocean City. I have stayed at about 8 different O.C. hotels and I think this hotel offers the best overall stay by far. The free breakfast offers some good choices to fill you up, especially the cinnamon rolls! The staff here was also very nice. The location is great. You are right across the street from the beach at 126th street and there are a number of good restaurants and shops within walking distance. The Blue Ox restaurant, right in front of the hotel, has incredible food and a cool bar attached to it with live entertainment. I tried the seafood pasta and a soft shell crab appetizer, it was heavenly! I highly recommend staying at Holiday Inn Express while in O.C.", "Date": "October 18, 2005"}], "HotelInfo": {"Name": "Holiday Inn Express Ocean City", "HotelURL": "/ShowUserReviews-g41298-d223413-Reviews-Holiday_Inn_Express_Ocean_City-Ocean_City_Maryland.html", "Price": "$86 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">12601 Coastal Highway</span>, <span class=\"locality\"><span property=\"v:locality\">Ocean City</span>, <span property=\"v:region\">MD</span> <span property=\"v:postal-code\">21842</span></span> </span></span></address>", "HotelID": "223413", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/3a/7b/3a7bae05ec35951df9da5845057fa75b7large.jpg"}}