{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Great location, amenities, and price!”", "Author": "Carli G", "ReviewID": "UR125694957", "Content": "I traveled here from Ohio for a business trip and was very impressed. I called from the airport hoping to check in a couple hours early and the hotel manager was extremely flexible. I was able to check in early because they had a room available and I was incredibly pleased. Rooms are spacious, and even have kitchens, which I didn't realize. Overall, my stay was wonderful. I highly recommend this hotel to anyone staying overnight to several weeks.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edgewater Park, New Jersey", "Title": "“Great hotel for the price I paid”", "Author": "madmax1965", "ReviewID": "UR125471656", "Content": "Got this room thru priceline great room clean convienantly located two thumbs up", "Date": "March 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South Bend, Indiana", "Title": "“Apartment-style units are a great plus”", "Author": "FamilyTraveler1969", "ReviewID": "UR124941764", "Content": "When traveling with kids you just can't beat these apartment-style units, with two separate bedrooms, a living/dining area and a full kitchen. Great location, generally quiet, very clean and comfortable. Well-trained staff as you would expect at a Marriott property. Just a couple of suggestions: replace the old residential-model toilets with commercial pressure models that don't require frequent maintenance, and upgrade the breakfast. I realize people can stock the kitchen with their own breakfast makings, but not everyone wants to do that. The choices in the lobby are mostly sugary cereals, frozen waffles, pastries and hard-boiled eggs. Even Fairfield Inn can beat that. Also, as a previous reviewer noted, there are no king beds. Overall, though, the spacious, comfortable units; the location near shopping and restaurants; and the bargain prices make this a highly recommended facility.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“This Hotel was Superbowl ready. A+++++”", "Author": "Jerry E", "ReviewID": "UR124354384", "Content": "A friend stayed here while at the superbowl and I got the chance to see the room and hotel....looks like a real nice place even I would stay here it had everthing you needed to stay here for a week. Front desk staff was nice.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "indiana", "Title": "“Great place for price”", "Author": "ohappyday10", "ReviewID": "UR121204623", "Content": "I was really surprised when I got this hotel via Hotwire. In my many, many trips to this part of Indy, I had never seen it. It is literally the perfect location - convenient to the best restaurants and shopping in the area. It was a great location for Black Friday shopping and easy in/out with a stoplight. I definitely will stay here again. Only negative is they have queen beds only - not good when you are used to a king.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Appleton, Wisconsin", "Title": "“Clean, mostly quiet and safe”", "Author": "WITravels1512", "ReviewID": "UR121130293", "Content": "Family of 4 (2 teenage children and wife and I) stayed for 3 nights. Had a 2 bedroom unit. $120 a night. Room was clean, hotel was clean and safe. Marriott has trimmed away all the extras and has a very lean operation in most of the Towneplace Suites. This location is a little tricky to locate, and parking can be a bit of a walk (or lug depending on suitcases). Black Friday must have been 'bring your child to work day' as many staff seemed to have their children with them. Still, the children were not in any way in the way, just odd to see children following parents working at the hotel. Breakfast is almost not worth the bother-eating in a lobby with 9 total chairs and 3 tables is silly (like I wrote 'lean operation'). Cold stuff-cereal and a few toasted things. Front desk clerk also restocks breakfast foods-and if anyone is checking out they have to attend to 2 things at one. Still-for the $$ was fine. Hard to give a low rating but do not confuse with anything close to luxury. This is a place to sleep and be on your way. Aslo, is a place that seems to draw many dog owners and their pooches. If that is OK with you (we like it) then fine. Would stay again if cannot find a higher level of lodging-say with a place to sit for breakfast and closer parking.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Churubusco, Indiana, United States", "Title": "“Favorite Indianapolis hotel”", "Author": "Nancy L", "ReviewID": "UR121028639", "Content": "We always choose this hotel when staying in Indianapolis. It is close to great shopping, lots of dining options, and a very comfortable place to stay. We have never had a problem with one of our stays and I highly recommend TownePlace Suites in Indianapolis/Keystone.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Austin, Texas", "Title": "“Great stay”", "Author": "ann d", "ReviewID": "UR120157234", "Content": "Came to Indianapolis for a conference. Managed to be there during the FFA National Convention and shared space with many of them at the hotel. They were a great group - and the staff managed to keep everyone satisfied. Can't say enough about the helpful, courteous and very friendly staff. Room was great - didn't hear neighbors at all. Full size fridge was a plus. We slept well every night and enjoyed the appreciation night meals as well - what a surprise! Other hotels on the way home just didn't compare at all. Thanks for an enjoyable experience. Warning-don't use Mapquest to find this place - it took us to a dead end with a cemetery.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Port Huron, Michigan", "Title": "“Comfortable Rooms and Just Like Home Atmosphere”", "Author": "Shelly B", "ReviewID": "UR119371843", "Content": "This is our favorite place to stay when visiting Indy. The atmosphere of TownPlace Suites is so welcoming and great for both family trips and business travel. We love the comfortably clean bedrooms, large bathroom and the full kitchen has everything we need to prepare meals and feel right at home. We always are pleased with the free breakfast that has many options for any eater - whether healthy or picky. The pool provides great fun for both for both kids and adults with lots of room to play and plenty of sitting room. The staff are super friendly and always do everything they can to make our stay fantastic. We love this hotel and would recommend to anyone traveling to Indy whether for a few days or for an extended stay.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Wayne, Indiana", "Title": "“Feels Like Home”", "Author": "Amy P", "ReviewID": "UR118494327", "Content": "This has become one of my favorite places to stay while traveling on business. The rooms have all of the comforts of home (including a full kitchen) and I love the ability to use the Lifestyles Family Fitness Center that is just .5 miles down the road - complimentary. The staff are super friendly. Its nice to have a retreat and the option to \"eat at home\" as opposed to by yourself in a restaurant when you're on the road. Its a tremendous value.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Logansport, Indiana", "Title": "“Just what I'm looking for”", "Author": "dlizsmith", "ReviewID": "UR118493799", "Content": "I stay in this area at least once a month and find the Towne Place meets all my needs. Clean, confy, friiendly with a homey atmosphere. I love the option of being able to walk to a nearby resturant or just cook something up myself. I have recommended it to others who have stayed and agree.", "Date": "September 23, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Great Hotel!”", "Author": "Timothy G", "ReviewID": "UR118202797", "Content": "We have stayed at this location several time when our sons play soccer in the area. We like it so much that we have stayed here when passing through the area. The hotel is very clean, the staff is friendly and helpful, and the breakfast is a great start to the day!", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Glen Ellyn, Illinois", "Title": "“Very pleasantly surprised”", "Author": "Jan L", "ReviewID": "UR117370790", "Content": "My husband, our daughter, and I stayed at TownPlace Suites Indianapolis Keystone the evening before we were to move her into her dorm room at Butler University. The front desk staff were very helpful and accommodating; and inquired sympathetically about how the college move went. We were also very pleased with the Keystone area, and the many dining options, casual and upscale, nearby. We definitely plan to stay at this Marriott property again when we visit our daughter.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Grand Rapids, Michigan", "Title": "“disappointed - this is not up to marriott standards”", "Author": "h0nch0", "ReviewID": "UR116287745", "Content": "Based on all the nice reviews we saw. We just expected a better hotel than this. Our first/last try in a TownePlace Suites. We had a studio suite it is a pretty small room with a kitchen crammed into it. AC is very noisy and very close to the bed. There is basically no lobby. Exercise room has only a couple machines. Service was all quite good.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Paxton, Illinois", "Title": "“Accomodating staff & clean facility.”", "Author": "Don1865", "ReviewID": "UR116125415", "Content": "y wife and I stayed at TownePlace suites and found the staff to be very helpfull and the facility very clean and tidy as well as bening secure. The location was good for our weekend in Indianapolis and it was easy to find as we are only occcasional visitors to town. The breakfast was very ample and the room was quiet and inviting.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Great location!”", "Author": "Jane37064", "ReviewID": "UR116118960", "Content": "It was such a treat to find this TownePlace Suites tucked into a great strip mall in Indy. We had been trying to book for our family of 4 in a 2 bedroom in a nearby Residence Inn for one night in transit south from Michigan. They did not have availability and the reservations person suggested this place. We liked it even more because of the location. It has the feel of a Residence Inn but more updated. We were able to do some back to school shopping at the Kohl's around the corner and there were many many choices for dinner. Breakfast was pretty minimal but enough to find at least something to eat and they have a well stocked snack area if you need it. We will stay here again.", "Date": "August 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Very pleasantly surprised”", "Author": "maxbustraveler", "ReviewID": "UR113474586", "Content": "I booked this hotel at the last second never staying at a TownePlace Suites so it was unknown what to expect. Upon arrival I was welcomed with smiles, check in only took a few seconds and I was invited down to the lobby for pizza later that evening. The room was very modern and spacious, and very clean. Overall great staff, wonderful well kept hotel. I would highly recommend this location to anyone.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Indiana", "Title": "“Wonderful Value & Convenience”", "Author": "Thelma56", "ReviewID": "UR113433198", "Content": "We were in town for a family wedding and stayed 2 nights. We rented two rooms for our 4 adult family members. We were pleased to find we had been assigned adjoining suites. This was a wonderful conveniece as it made our space the size of a small apartment. This is a newer hotel and we found it clean and welcoming. (We travel frequently and this hotel is exceptional when compared to other hotels in its price range.) The queen sized beds were extremely comfortable and seemed to have mattress toppers. Bed linens were newer and spotless. Hotel offers a continental breakfast of fruit, packaged rolls, coffee & juice. We enjoy a hot cooked breakfast when traveling so did not partake. There are several breakfast restaurants nearby. We ate at Perkins first day LePeep's the next. (LePeep's is located in the shopping center next door to Towneplace and is a wonderful local chain. Perkins is about 5 minutes east.) Hotel is a bit hard to find and entrance is almost hidden from view of 86th St. The entrance is directly across from Keystone Crossing Mall. There is also a regular Mariott located at Keystone Crossing but after talking to wedding guests who stayed there it seemed the the rooms were no nicer and the cost was considerably more. Only negative was Town Place ran out of hot water about 8:30 am. We contacted the front desk who promptly checked into the situation who I formed us that happens 'once in while'. Within a few minutes of our call hot water was plentiful.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "South Bend, IN", "Title": "“Wonderful weekend for the Indy 500!”", "Author": "Oompa7914", "ReviewID": "UR111658798", "Content": "We love staying at TownePlace Suites Keystone in Indianaplolis. The room are clean and have ample amount of room for a family to stay. The staff is always friendly and helpful when needed. TownPlace Suites is located in close proximity to outstanding restaurants and shopping. I highly recommenend this hotel to many family and friends visiting Indy. We will stay here again for many trips and race weekends to come!", "Date": "June 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "5", "Service": "5"}, "AuthorLocation": "oakpark", "Title": "“Great customer service, spacious & comfortable”", "Author": "shira-eliora", "ReviewID": "UR111506580", "Content": "When we first arrived at 6:30 p.m., my parents' handicapped room was not ready. Needless to say, we were surprised. The hotel had been sold out the night before and the cleaning was still completing their work. But for our inconvenience, without asking, the room fee was reduced. The one staff person was most accomodating, including changing a long lasting light bulb ring that had burned out. Why did we discover this and the cleaning crew had not? We were disappointed that the bath items were generic. The Internet connection was terribly slow and the lobby tiny. But the customer service was strong, they provided excellent driving directions and the beds were great and the breakfast was diverse. And the two bedroom suites are terrific for the price point. We hope to return on our next visit to Indianapolis and will look for this brand on our other travels.", "Date": "June 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Silver Spring, MD", "Title": "“convenient hotel with great service”", "Author": "wildlife_lover", "ReviewID": "UR110980702", "Content": "Stayed here a couple nights to visit family in the area. Conveniently located near the beltway exit and next to shopping. Rooms are nice and large with a full kitchen - microwave, fridge and small stove. Includes breakfast - coffee, cereal, yogurt, but no cooked food. Also, they have free coffee, tea and fruit available all day - a nice touch. Best part - staff was extremely friendly and helpful. Only complaint - asked for a wake up call, but didn't get it because the ringer was turned off on the phone.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Amazing, and great location”", "Author": "akide", "ReviewID": "UR109736244", "Content": "Checked in to the hotel close to midnight, due to a late arriving flight, upon entering and walking towards the check-in desk, the lady behind the counter, knew it was me and greeted me by my name. A pleasant and wonderful surprise, I felt very welcomed at this location, there seemed to be some sort of a graduation party going on, the parking lot was quite full, but I was able to grab one of the last few parking spots available on my late friday night when I checked in. Parking is free! Room was very clean, and comfortable. I enjoyed the kitchen, which had basic cutlery, plates, bowls, pots, pans, and also pans for baking in the oven. Microwave and full sized fridge with freezer was also included. Perfect for buying a big tub of ice cream, and eating it a bit at a time througout my stay. Free wifi was great, being able to stay connected with my family while away from home. Complimentary breakfast in the mornings, basic fruits, cereals, yogourts, muffins, packaged oatmeal. There was no hot food such such as bacon, eggs, sausages, pancakes/waffles, which was a bit of a disappointment. The lack of hot food for breakfast was the only negative about this hotel. Everything else was excellent, great location to tons of shopping, and tons of fast food outlets, such as White Castle a few blocks east of this location, Trader Joes supermarket, and Whole Foods west of this location.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Great value, convenient location, wonderful service!”", "Author": "Asmith3714", "ReviewID": "UR108499407", "Content": "I’m not a frequent traveler but the last 3 times I visited Indianapolis, I stayed at TownePlace Suites at Keystone. They have always exceeded my expectations. Their warm greeting at checkin (albeit I was a bit early) was always a pleasant surprise. This coupled with clean, quiet and up to date rooms with amenities I come to expect when traveling are all housed at TownePlace Suites. This year I was startled by the sirens on the streets. I knew bad weather was approaching the city but I had no idea what to do or where to go. I immediately called the front desk and was reassured that everything was ‘ok’ but if anything more severe was to happen, I would be notified. The clerk was most reassuring and I got a good night’s rest in spite of the weather.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Price, Comfort, Acessability the best in the Indianapolis area”", "Author": "MNevells", "ReviewID": "UR107540945", "Content": "Once again the TownePlace Suites Indianapolis Keystone exceeded my expitations. As a frequent traveler to the Indianapolis area I am alwways looking for a clena, quite, and afortable hotel that will also put me close to my Indianapolis accounts. the TownePlace Suites Indianapolis Keystone provides this and more. The staff is friendly and very helpfull. The scomindations are clean and with the added benifits of a kitchen and suite style room much more comfortable than the standard hotel room. I am always amazed at how competitive the proce is even with all the extras.", "Date": "May 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Good value”", "Author": "biztravelerChicago", "ReviewID": "UR103423575", "Content": "Comfortable accommodation, Kitchen fully furnished and small stove has an oven, too, instead of simply the cooktop in most suite hotels. Dishwasher and full fridge as well. Comfortable beds, clean bathroom. Quiet location despite the proximity to a major street. Great location for mall shopping and a wide variety of restaurants. Helpful and polite front desk clerk.", "Date": "April 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "toledo, oh", "Title": "“Perfect place for a weekend getaway.”", "Author": "asmithers24", "ReviewID": "UR101621739", "Content": "My husband and two of our friends traveled to Indianapolis to visit some friends for the weekend and stumbled upon this hotel online. We didn't expect much for the price, but it was GREAT! The room was clean and well-kept, spacious, and the beds were extra comfy. The staff was very friendly and even helped us pick a great spot for dinner and a night out. Will definitely recommend this hotel and would stay here again when we come back for another visit!", "Date": "March 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Best spot for business travel in Indianapolis”", "Author": "MNevells", "ReviewID": "UR95600800", "Content": "As a veteran road warrior I am frequently in Hotels while on business. Finding ways to control expenses while staying close to business appointments and still having quality accommodations continues to be a challenge. The Towne place Suites Indianapolis Keystone is one of the last remaining solutions to this challenge. The comfort and staff service remain at the highest caliber, the costs remains very competitive, proximity to Indianapolis is great, and the choice of shopping & restaurants in the area is outstanding. As my business needs require frequent trips to the Indianapolis area I will always utilize the Towne Place Suites Indianapolis Keystone as my home away from home.", "Date": "February 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hatboro, Pennsylvania", "Title": "“Home away from Home”", "Author": "PegHanes", "ReviewID": "UR95086427", "Content": "I travel several time a year for business and every time I stay at the TownePlace in Indianapolis the experience is always the same, just like home. The Staff are always very pleasant and very helpful and the rooms are always clean and the beds are bed bug FREE and as comfortable as can be. So when I am traveling in Indianapolis the TownePlace is the only Place for me.", "Date": "January 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Perfect unwind after Business”", "Author": "CarrabbaBen", "ReviewID": "UR90402251", "Content": "I travel a region for my business that takes me over three states. I am in Indianapolis a few times a month and have consistantly stayed at the Townplace Suites at Keystone for the last 3 years. I do so because of the great customer service and quality of the hotel. The fact that it is close to great restaurants (try The Ale Impourium, you will love the food) and other stores that make it easy to forget that you are away from home. I have NEVER had a bad stay at Keystone Townplace. If I have had an issue, maybe once, it was taken care of right away and with great customer service. If you are in the area and need a comfy place to lay your head and relax, do yourself a favor and stay at Keystone Townplace suites. You will not regret the choice.", "Date": "December 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“Spacious, comfortable rooms and friendly service - great for families”", "Author": "Family_R_USA5", "ReviewID": "UR89501125", "Content": "When traveling with three children (ages 10, 7, 21mos), space and convenience trumps luxury, but TownePlace Suites doesn't feel like a compromise. The rooms are very spacious with a full kitchen, dining and living area - much better than trying to stay in a standard hotel room (which we've done in a pinch). The rooms are fresh, clean and the front desk staff are very friendly. We had an early checkout on departure (5am) and they had fresh coffee brewed for us at the front desk. Even though I could use my business points to stay downtown in one of the 4-star properties, I won't stay anywhere else when I'm visiting Indy with my family. The only improvement would be if the two-bedroom suites had a second bathroom.", "Date": "December 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Winter Springs, Florida", "Title": "“great”", "Author": "stanbook", "ReviewID": "UR88624185", "Content": "A very nice experience. Room great and service help excellent. Would stay again if I was in area. Breakfast along with the kitchen in room is very nice. Evening get togethers an added plus as well.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ossian, Indiana", "Title": "“A FANTASTIC GETAWAY SPOT”", "Author": "1ruffus", "ReviewID": "UR87620865", "Content": "We used TownePlace Suites Keystone as our home base. We shopped, at the many near by store, visited the Titanic exhibit and had a great dinner, across the street, at P F Changs. We returned to get a wonderful nights sleep on those oh so relaxing beds. In the morning ,a short walk, to Le-PeePs for a yummy brunch. We look forward to returning .One could not ask for warmer ,friendly place to stay, with such great service.", "Date": "November 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Great Room and Great Service”", "Author": "Hanalei2010", "ReviewID": "UR85977511", "Content": "We stayed at the TownePlace Suites Keystone to attend a wedding near Indianapolis. We were a little early for arrival, but we were greeted very warmly and given a room right away. The room was very nicely appointed, updated and clean. It had a full kitchen with everything we needed. The bed was extremely comfortable and, after a late night at the wedding reception, it felt like a dream. There was a nice assortment of cereals, muffins, bagels, juices, coffee, etc. in the lobby for breakfast the next morning. This was very handy. Again, at check out, the front desk clerk was very friendly and helpful when we asked for directions to the Speedway. We would certainly recommend the hotel and we would definitely stay here again.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Celina, Ohio", "Title": "“We were very pleased with the comfortable beds and resonable prices.”", "Author": "csh5113", "ReviewID": "UR85217516", "Content": "I traveled to Indy with a group of 8 women, we were in town for a show and shopping and were pleasantly surprised with the wonderful location next to wonderful shopping and great resturants. The staff was very helpful with directions and provided a list of the local resturants. Would be happy to return again for the same kind of weekend.", "Date": "October 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Great Staff”", "Author": "pen9796", "ReviewID": "UR85148617", "Content": "I travel 40 weeks each year. This is as good as it gets for the $. Really liked how I was treated. Kudos to the staff. Highly recommend", "Date": "October 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“A great place to stay for travelers with pets!”", "Author": "Travelswithdog55", "ReviewID": "UR83020280", "Content": "A great place to stay for travelers with pets! The manager and his staff are very friendly and happy to help their guests have a great time while in Indy. The grounds are well kept and well light for night time dog walks. Rooms are private, clean, and surprisingly large. The kitchen is very handy when traveling with a pet. The location is wonderful for shopping and great food. There are many motels in this area to chose from, but here at Townplace Suites, the entire staff is focused on making your stay enjoyable.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Richmond, Indiana", "Title": "“I was extremely pleased with The Manager. Any request for advise directions etc. was no problem.”", "Author": "Charmel177", "ReviewID": "UR81258618", "Content": "Great location. One of the best in Indianapolis,besides down town. Plenty of great restaurants , shopping,Movies etc. A great family place. close to the Interstate for easy access.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Great accomodations at a great price”", "Author": "soccerfamily2011", "ReviewID": "UR80836333", "Content": "If traveling to Indianapolis, I highly recommend TownPlace Suites by Marriot. The rooms are spacious and clean. The staff is extremely friendly and accomodating. It is a perfect location convenently located close to excellent dining and shopping. The complimentary breakfast included a wide variety and everyone in our group found something they enjoyed.", "Date": "September 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Great place to stay!”", "Author": "iantess", "ReviewID": "UR20621650", "Content": "My husband and I stayed here for 4 nights for the MotoGP race and we were very happy! The staff was friendly and helpful and the hotel was recenlty updated. It has outdoor pool we used, walking (across the street) to stores and restaurants. The parking was safe for our motorcycles, which was very important for us. The rooms had a kitchenette, sitting area and the bed. The room was a good size and we were very comfortable. We were a little apprehensive about booking this hotel, due to the previous reviews, however it was great and would recommend to anyone staying in the area.", "Date": "October 4, 2008"}], "HotelInfo": {"Name": "TownePlace Suites Indianapolis Keystone", "HotelURL": "/ShowUserReviews-g37209-d223833-Reviews-TownePlace_Suites_Indianapolis_Keystone-Indianapolis_Indiana.html", "Price": "$104 - $139*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">8468 Union Chapel Road</span>, <span class=\"locality\"><span property=\"v:locality\">Indianapolis</span>, <span property=\"v:region\">IN</span> <span property=\"v:postal-code\">46240</span></span> </span> </span> </address>", "HotelID": "223833", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/15/f2/15f2e98d7ff0b3254020c3d67a97c0be10large.jpg"}}