{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Texas", "Title": "“Nice place, good location”", "Author": "D S", "ReviewID": "UR119643939", "Content": "Stayed here for our trip to SD. Paid a last minute price on the website. Room and surrounding were very nice and clean. There are a ton of hotels around the hotel circle area so you have a lot of choice. We wanted one with limited cooking/fridge/microwave etc. and were satisfied. The new girl at check in and out was extremely nice. This is close to the University avenue on the backside just an exit away and close to the area locations. Very satisfied and would recommended.", "Date": "October 23, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Tempe, Arizona", "Title": "“I am hating it and I barely got here!”", "Author": "IDontWantNoName", "ReviewID": "UR116325249", "Content": "As soon as we went to our room we noticed how unclean it is. Then, our kitchen sink won't drain and no one seems to be available to assist us. The beds are very small, not meant for more than one person although the room is booked for 4 people. Just feels as though this place has not been maintained well and there are no employees that seem to give a [--]!! Also, paid for a full kitchen but there are only a few dishes, not enough to actually feed the people staying here without tsaking turns or buying new dishes. Quite annoying!!!", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Riverside, California", "Title": "“Decent hotel could have been better, could have been worse.”", "Author": "coachfrog03", "ReviewID": "UR115763192", "Content": "My boyfriend and I stayed here during Comic-Con. The hotels in San Diego during the convention are ridiculously priced! He waited until the last minute to book our room but was pleased to find a place that had a small kitchen. The price was fair considering the prices everywhere else and we had the luxury of a full refrigerator, microwave, stove, sink, cups, utensils, bowls and plates. The room was average, the bed a little stiff for me but my boyfriend had no problem with it. Good size bathroom with good lighting and A/C in the room. The room was clean and we were able to check-in an hour early. When we checked in there was no soap in the bathroom or kitchen so we had to ask the housekeeper down the hall who only had one on her cart and the box was mangled. The soap was unused so we took it. The people at the front desk were very nice when we checked in and let us check-out and hour later than normal check-out. My only real complaint would be that the walls seem a bit thin, especially if you have someone above you. Very early Sunday morning from 1:30 a.m. and until we checked out at noon, we could hear the people above us walking around; this didn't make for a very nice night's sleep. Overall the experience was good and clean, if we were to stay again, we would request a top floor room!", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "So Cal", "Title": "“Disgusting”", "Author": "imjenx", "ReviewID": "UR115065362", "Content": "I visited my husband over the weekend at the hotel as he was put up here by his employer (we live in another area). There is no way I would have paid for this room, I would have asked for a refund and moved to another hotel. The floors were sticky. The linens were dirty (there was a black hair -we are all fair haired - on the worn out and torn blanket under the filthy coverlet ). There were only four stained towels that were supposed to last him a week. The chair was stained. The tv was small and had poor reception of only a handful of channels. We asked for 2 extra blankets and received 1 hours later. The room and hallway smelled of smoke, when it didn't carry the odors of other guests cooking. The microwave was over 10 years old and barely functioned. At least the refrigerator seemed clean.", "Date": "July 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "San Diego, California", "Title": "“Disgusting and dirty for babies”", "Author": "quesada323", "ReviewID": "UR69429564", "Content": "I awoke in the middle of the night to make my baby a bottle and there are roaches everywhere. This is disgusting. There were even roaches in the bathroom. Granted it is 4:30a.m. in the morning, but when I called the front desk the girl who I spoke to said that I should sleep with the light on until she can let her boss know in the morning. I feel completely disgusted since I went to the market and had baby food items and groceries on the counter. I also brought my 21 month old on this trip so I am really peeved and concerned by this situation.", "Date": "July 2, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "San Diego, California", "Title": "“Cheap and Tacky”", "Author": "sunshinebear72", "ReviewID": "UR68665796", "Content": "We stayed here for a week, my husbands company paid for it so if it came out of our pockets we would have never stayed. I can't believe they had no blow dryer, no complimentary shampoo, no ice machine, no swimming pool. You have no maid service unless you pay for it. You take out your own trash and have to bring your towels to the office to exchange for clean ones. The shower drips constantly and the toilet leaks so we were constantly drying the bathroom floor. I would not recommend this place to anyone!", "Date": "June 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“Good option for San Diego tourists with a car”", "Author": "efsch", "ReviewID": "UR59618752", "Content": "The Extended Stay Hotel Circle in the San Diego Mission Valley hotel strip is the most expensive ($85 NS King including tax) and least maintained (only minor problems, but multiple) ES property we have stayed at, but I still recommend it as a good option for tourists with a car who want to sightsee in San Diego for several days. This ES is clean, quiet, friendly, and conveniently located within a few miles of the SAN airport, the city center, and major tourist attractions (zoo, Balboa Park, Sea World, city beaches, Mission Valley shopping centers, etc.). Like other ES properties, each room includes a kitchen with basic cookware, china, and flatware for two people. This is a great benefit in those cities where restaurant food is either greasy or expensive. Like other ES properties, housekeeping is do-it-yourself, except for a once weekly cleaning and linen change (towels are exchangeable at the front desk daily). The room was clean, but showed food stains on the carpet around the dining table (the kitchen area has laminate flooring which should have included the table area). Like other ES properties, this motel is quiet because it does not have party or convention facilities to attract bridezillas or drunken parties. It is set back from the freeway, so traffic noise is a low hum. Because San Diego offers only rudimentary public transportation, a car is essential, but our Thrifty airport rental car was brand new and cost only $183 per week including all taxes and fees. There is nothing of interest within walking distance of this ES property. The problems we had were minor, but multiple. The front desk took care of most (except the plumbing problems) promptly and politely. There were no hangers for the coat rack. The china and flatware were missing a few items. The kitchen counter trim was coming off. The shower diverter and the tub drain did not function properly -- both leaked. Most important, the tub faucet did not turn off -- there was a constant flow of hot water which made the bathroom warm but damp. This was a pity in a city that has chronic water shortages. This leak was present on our arrival, but it was the only room available at the time, per the front desk. One suggestion for your stay in San Diego. Request a room above the ground floor since the climate is mild and you will want the option to sleep with open windows. Overall, we would stay here again. We always appreciate Extended Stay properties for their rates, kitchens, and quiet guests.", "Date": "March 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "san diego", "Title": "“Don't Stay Here or at Least Be Forewarned.”", "Author": "gofurself", "ReviewID": "UR39688847", "Content": "Yes, the rate is very low and they are pet friendly which is why my husband and I stayed here during our relocation with the military. If you really don't mind staying in a total dive, then this hotel is fine (really, it should be called a motel), just be prepared for what you will get: stained carpets, foul stench in the hallways, filth all over the cabinets/counters/fridge in a supposedly \"clean\" room, stained towels and bed linens, a phone that rarely works, no pans (you get 1 pot, 2 nasty plastic cups, 2 coffee cups, 2 small bowls, 2 plates, 1 butter knife, 1 \"steak\" knife, 2 forks, 1 large spoon and 1 small spoon), and no large bowls to prepare food in. They call the beds Queen Size, but they are actually Full Size (it is written on the sheets in permanent marker). Bring your own comforter, the ones on the bed are DISGUSTING... we won't even let our dogs near them. The doors are regularly propped open on the \"secured entry: doorways, so people can wander in and out as they please, and you need to watch where you step outside because most guests do not pick up after their pets. Be prepared to be bombarded with smoke every time you leave the hotel because people smoke in every doorway and in the stairwells. Lastly on the cons, over half of the washers AND dryers do not work... rather than having them repaired, the hotel just puts a print out that reads, \"Out of Order\" on them while more continue to break. We've been here for 2 months waiting to move into our condo and we've yet to see a single machine be fixed. On the plus side: the staff was very friendly with us, there is an outdoor grill area (1 grill in a cute setting) and most of all, again, the price.", "Date": "September 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "SoCal", "Title": "“Filthy, rancid, unsafe!”", "Author": "VegTrav", "ReviewID": "UR30421273", "Content": "This is the email I sent to the corporate office: I am simply horrified that I had to leave my sister and nephew in your hotel. What a filthy, vile place! The smell of urine fills the halls and is so thick, it's unpleasant to breathe. When she arrived, there was no one to let her in. No one answered the phone in the entryway. She was able to get in through an unsecured door, flag down a woman who barely spoke English, and obtained a key. Although her room is reserved for longer, we will be moving she and my nephew out first thing tomorrow. I don't know if you inspect your properties often, but I suggest you inspect this one and make some changes. The whole setup felt unsafe and unsecure. Additionally, the TV options are very limited. The bedspread had cigarette burns on it, there was no blackout curtain and the curtains themselves looked dingy. The whole space just felt dirty - I didn't want to touch anything.", "Date": "May 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Broomfield, CO", "Title": "“Great location and room for the money”", "Author": "jpe237", "ReviewID": "UR23259182", "Content": "We booked this hotel through Priceline for Labor Day weekend. The rate was awesome for $35 per night. I was a little worried about the hotel after reading other peoples reviews. When we arrived around 2pm check-in was fast and smooth. We had a room on the third floor that was nice and clean. For me a clean room in good condition is all I really expect. We knew ahead of time that the hotel only cleans and services your room once a week or you may pay $10 a day to have it cleaned more, so we weren't shocked at this like other people had been on their reviews. On the first day our a/c unit was not cooling. I called the front desk and they had someone come up and replaced the unit about 30 minutes after my call. That was fast service. The rooms all have kitchenettes and are intended for longer stays. The hotel has a great location near all the attractions and is in a very safe part of town.", "Date": "January 4, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Essex, England", "Title": "“Welcome to the Hotel California”", "Author": "SuzyUK", "ReviewID": "UR20537582", "Content": "... this could be heaven or this could be hell. Well, for us it was the latter and we were scared we'd never be able to leave. I can't say it was dirty, I can't say the staff were unfriendly, I can't say it was uncomfortable .... but it wasn't a place I was looking forward to resting my head at the end of the day. This wasn't the cheapest option on Hotwire so I'm surmising they were charging more as the room had a fridge, microwave and hob. Your rooms are cleaned once a week so if you want any cleaning done it is just over $10 a day (we were there 3 nights so we made our own beds and saved some money). There were strange odours emanating along our corridor but that was to do with our fellow travellers who were cooking some strange things. I'd rather pay the extra and stay in the Old Town or one of the other places along Hotel Circle.", "Date": "October 1, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Boston, MA and NYC.", "Title": "“I had a good stay here with my dog!”", "Author": "Tren2414", "ReviewID": "UR17348477", "Content": "I booked this hotel via priceline for $32 a night. After reading the reviews I was a bit skeptical, but it turned out to be a good bang for my buck! When I checked in, the front desk actually called to check and make sure we were happy with our rooms. The room and bathroom were nice and very clean. It had a full kitchen with a fridge and microwave. If you like to cook and have a place to store food and/or leftovers -- this place is a score. Also, I was able to bring my dog which is also an added bonus! If you don't like firm bed -- be warned - they have very firm beds. I actually like the firmness but I know a lot of people don't. It was convenient to everything (seaworld, san diego zoo, mexico, etc.). All in all -- I would stay again!", "Date": "June 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Phoenix", "Title": "“enjoyed staying at ESA”", "Author": "themoedogg", "ReviewID": "UR13988628", "Content": "My husband and I stayed at ESA for a quick getaway from the Phoenix heat. We have stayed at several hotels in the hotel circle in the past and found for the price this place was pretty good. We arrived very late and someone was there at the desk to check us in. Parking was ample and not hard to find. They also accept pets which is a definite plus. The room was clean and spacious. A major plus is if you are staying for a few days there is a full size refrigerator, stove and microwave if you happen to take back some left overs from dinner.", "Date": "March 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Very nice place to stay- no problems”", "Author": "jdanh", "ReviewID": "UR12425296", "Content": "I booked the hotel off of priceline. My $35 a night bid was excepted so the total with taxes was only $86 total for both nights. A very good deal. Me and my wife got there around 11pm. We called ahead of time to make sure we could check in late and was told that someone would be there when we arrive. Sure enough there was a person behind the counter. We get to our room which was a decent size, nice bathroom, big kitchen area and cable TV including showtime. I was happy with the stay. We were even given a password to use the internet ($4.99 for the whole stay there- that's not bad at all). We had our own car so we were able to drive just 2 miles down the road to Old Town and took the Trolley to Coronado Island. We also took the Trolley to Qualcomm stadium for the playoff game (as parking there with our car would have been crazy). **Hint, if you go to Qualcomm stadium on game night don't leave out of the station at the stadium. The wait would take forever for the Trolley. Instead walk to the next station near Aikea and get on there. I believe there is a bus you can take around there that will take you to Old Town and the Trolley's but I never took it. I would definitely recommend this place for a short stay in San Diego. Nice, quiet, clean and effecient. No complaints.", "Date": "January 8, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "5", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Corona", "Title": "“Aweful, Disgusting Hotel”", "Author": "italiano714", "ReviewID": "UR12101996", "Content": "I went onto Priceline and booked this hotel room. It was the most disgusting hotel I have ever stayed at. When we arrived the hotel outside appearance was fair, nothing wrong with it. However, once we opened the hotel door to the loby it stunk so bad inside. After checking in with the receptionist we bring our bags to the room. I find a pizza booklet that states there are people pushing flyers under rooms that are illegally running pizza business inside of there garage and several guests have complained of illness because of this. Which I found very odd. Then after that it take off the comforter which everyone knows that those hardly ever get washed. But sheets should always be washed by law. Well, as I remove the comforter and fix the sheets I felt a really crusty hard spot on the blankets which made me look closer, I then find SEVERAL PUBIC HAIRS on the sheets. That is absolutely disgusting, I immediately went down to the receptionist and called Priceline requesting an immediate refund. I then booked a room at a Marina Inn which was virtually the same price but the room and sheets were actually cleaned. Please DO NOT stay at this hotel.", "Date": "December 30, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "sac", "Title": "“Rooms OK...Integrity questionable”", "Author": "95833", "ReviewID": "UR10086321", "Content": "I made our reservations thru our timeshare since none of the resorts in san diego were available due to the time frame we were staying our next option was the extended stay. I received confirmation that we would be staying in a deluxe room..which i was told had a KING size bed and was more points. Upon check-in the receptionist advised us our room was ready and it was a queen size bed. I said \"no thats not what my reservation was\". I went on the explain that I requested a KING bed. She proceeded to LIE and tell me \"they didn't have any KING size beds\". I asked once again...\"You mean there are NO KING beds in this whole building\" She once again LIED and said \"NO\". By this point I was getting irritated..I asked for a courtesy phone so I could call my timeshare and straighten this out. She said there was no courtesy phone and to give her a minute. Things quickly changed and said she would get us right into our room. Somehow a KING bed \"Magically\" appeared and we were on our way. The room itself was clean. I would stay there again.", "Date": "October 16, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“purgatory”", "Author": "youngtravler", "ReviewID": "UR7850949", "Content": "I was stuck here as my landlord put me up while my unit was being repaired. 10 days of purgatory. It started out OK. Having been transferred from the Comfort Inn down the road, it was nice to have a newer, larger room with contemporary decor. (Almost) full kitchen was a bonus as well. But they stuck me on the first floor across from housekeeping and literally a door away from the front desk. I heard every guest coming and going. The walls were paper thin so I heard TVs blaring late at night and people's loud, muffled voices at all hours. Housekeeping would start early in the morning yelling right outside my door, cluelessly greeting me with a smile when I exited. One morning they were vacuuming in the hallway outside my door beginning at 7:45 AM!! I tried to ignore it but finally called the front desk at 8:15 to ask why on earth they were vacuuming this early, and they said that it was after 8 AM. I have NEVER stayed any where that vacuumed that early. I told them they started before 8 and they said \"sorry, corporate is coming today and we have to vacuum now.\" I said I guess they care more about corporate than their own customers and she offered me a weak apology with no offer to compensate me in any way for my trouble. The wireless internet was off and on signalwise. Even when I got an excellent signal it was pretty slow. Only a 7 day stay qualifies you for ONE maid service. Any additional cleaning performed by them is $5-10. Any stay of fewer then 7 days does not get you any cleaning at all. Front desk is hit and miss. Some are very friendly and helpful but some definitely seemed like they were new at the job. They are only there until 11 PM. One night past that time I noticed cigarette smoke odor coming from the bathroom vent. I called the front desk to complain since I am very sensitive to this smoke, and they said they would \"call around\" to see who might be violating the no smoking policy. I highly doubt they actually called every room at 11:30 PM to inquire about whether they were smoking or not. I would never stay at an Extended StayAmerica but unfortunately prior to this stay I had booked a night in Anaheim through Priceline. Let's hope that location is better. You can do better than stay at this place if you're visiting San Diego.", "Date": "June 15, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Arizona", "Title": "“Clean and friendly at the right price.”", "Author": "ttchamps", "ReviewID": "UR4998454", "Content": "Very nice, clean, friendly, helpful staff and well kept up premises. Was one of the cheaper priced hotels in Hotel Circle during our time out there so we thought it was well worth it since we had a bad experience at another hotel down the street. My only complaints (and their minor) would be that we were right above the lobby so there was a bit of noise with the people going in and out of the building, and that there were no freebies, just a nice basic place to stay. I would definetley go back.", "Date": "April 24, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Mexico, ME", "Title": "“Left and never looked back...”", "Author": "OOLONGJUNKIE", "ReviewID": "UR4041162", "Content": "OK, the first problem was that my plane got in later than expected, which should be fine, except this the front desk here closes early and doesn't have 24 hr staff...and this was not communicated to me when I booked the reservation...so nobody was there when I arrived...I managed to flag down the desk person just as she was walking to her car to get my room key...I then was able to go to my room...the room was fine, but the whole reason I signed up for the hotel was for wireless internet...and this was password protected...I thus called the front desk, but nobody was there (as they had gone home)...so I called the tech support number for the internet...and they couldn't tell me the password because the front desk had it...so I was paying extra for wireless internet I coudn't use...the desk person was late to work the next morning and wanted to charge me for the password...I refused to pay...I remember leaving and never wanting to go back...", "Date": "October 21, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Barrington, IL", "Title": "“Reservation Was Confirmed But Not Honored”", "Author": "A TripAdvisor Member", "ReviewID": "UR3575974", "Content": "Despite the fact that we booked our reservation over two months in advance, and got a confirmation e-mail on the eve of our stay, we found ourselves without a room at the Extended Stay America Hotel Circle. According to the unapologetic front desk receptionists, the hotel was fully booked due to the San Diego Marathon and they found us an alternate space at another location 5 miles away. We were not the only victims that night. We witnessed a couple denied of their reservation as well. We rejected their offer of another location. We expect that hotels will honor reservations, or at the very least, contact their guests in ample time when they detect problems. To add insult to injury, the front desk staff were very amateurish and unsympathetic to the whole situation. Lesson Learned - Confirmation is not guaranteed at Extended Stay America Hotel Circle.", "Date": "June 19, 2005"}], "HotelInfo": {"Name": "Extended StayAmerica Hotel Circle", "HotelURL": "/ShowUserReviews-g60750-d224242-Reviews-Extended_StayAmerica_Hotel_Circle-San_Diego_California.html", "Price": "$66 - $121*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2087 Hotel Circle South</span>, <span class=\"locality\"><span property=\"v:locality\">San Diego</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">92108</span></span> </span> </span> </address>", "HotelID": "224242", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/ae/8d/ae8dfa4fd8841540bc90ab855528dd4d6large.jpg"}}