{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary", "Title": "“close to airport,highways.”", "Author": "pathfinderfan", "ReviewID": "UR126450748", "Content": "stayed 2 nights in march 2012. The rooms were clean. Front desk is very helpful. Parking is $12/night. The pool is nice and big. The jacuzzi was kinda small and not much pressure. I definitely recommend this place.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“Perfect for quick stay near airport”", "Author": "twowisekids", "ReviewID": "UR126040842", "Content": "This hotel was perfect for a quick one-night visit to Toronto. It was very easy to access from the airport. Restaurants were within walking distance. The front staff was excellent. Very friendly, and helpful for finding a good restaurant match. I did not feel \"un-safe\" here, and the room was quiet from outside or hallway noise. The room was clean and well appointed. Bedding/sheets were very comfortable, and LOVED all of the pillows. Plenty of clean towels. Heat/Air was fine. Toilet/shower were in one room, and had plenty of space. Closet and sink area were outside of this. Desk area, tv and 2 queens. Breakfast was not included in my rate, but the lounge and restaurant areas were very nice. Looked like the typical continental fare. Parking was safe and plentiful. I would recommend this for most anyone.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Stay only if you gave to”", "Author": "Ecosnake", "ReviewID": "UR124744594", "Content": "Not a fan of this place - in a pretty poor location and quality of rooms is pretty bad. Towels were old and stained and the staff try a bit too hard or simply don't care", "Date": "February 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great place to park and fly”", "Author": "johnbalmer", "ReviewID": "UR123598889", "Content": "clean, close to airport, great shuttle, nice rooms and pool", "Date": "January 25, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Leamington", "Title": "“Great hotel if flying the next day”", "Author": "Denisebain", "ReviewID": "UR122568493", "Content": "Great place to stay, flights fly directly over this hotel so can be a little noisy. Shuttle to the airport is very handy. Bar is very quiet a night, resturant has a nice breakfast buffet in the morning. Staff very pleasant.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Montreal", "Title": "“Front desk extremely helpful !”", "Author": "phil252", "ReviewID": "UR122008389", "Content": "The gentleman at the front desk goes above and beyond th answer your questions and give your information ! Great job !", "Date": "December 22, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Barrie, Canada", "Title": "“Second stay was again not up to par”", "Author": "sjhanlon", "ReviewID": "UR120818339", "Content": "I generally try to stay with Marriott branded hotels and as such have been Platinum with Marriott for a while. I had stayed at this hotel on a prior occasion and had a horrible stay. Like some other people on this board I never received my wake-up call. Being an airport hotel I would think it would be one of the most important things they have to take care of. (I usually set my cell phone alarm but had a battery failure). Anyway - dedided to give these guys a try again. Checked in the evening of Nov 7th. A gentleman completed my check-in. He seemed quite distracted. He asked me on three seperate occasions if I wanted points or gift for my Platinum Arrival gift. He gave me the key to my room and I headed to the elevator. Unfortunately the room number he wrote on the key does not even exist (that floor does not even exist). So I headed back downstairs and went to the front desk. This time a nice woman served me. Apologized and wrote a different room number on the card packet. I headed back to the elevator. Got to the room and the key didn't work. As a frequent traveller who travels over 175 nights a year there is nothing that is more annoying then getting to your room and the key does not work. Especially when you are lugging around bags, etc. So I again go back downstairs and tell the woman the key does not work. She says \"Oh - looks like he didn't program the key right... sorry\". She gives me a new key and a maintenance person who was watching offered to come up to my room to make sure it worked this time. Very nice of him. Finally got into the room. Room quality is still not up to par with other Courtyward hotels. The beds are very hard, rooms are dated. Nice pro - They offer free parking for Marriott Platinum Elite Guests (I think this is a great gesture and unfortunately it's not common among very many Marriott hotels; however, the full service Toronto Airport Marriott also offers this) Looking at the reviews there are some people who have for sure had a great stay... unfortunately for me 2 strikes and I generally won't go back. The first incident of the wake-up call failure was bad. Then having to make 3 trips to try and get in my room late at night... they need to get some policies in place at the front desk to ensure these types of issues don't happen.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Southern CA", "Title": "“clean and nice”", "Author": "Lovetravelpskk", "ReviewID": "UR120547822", "Content": "stay here twice in the last few months. clean and nice hotel near the airport. Staff is helpful. shuttle is fast and on time.....for one or two night stay near airport, it is nice.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Nanaimo, Canada", "Title": "“Fabulous Staff!! And great small meeting space!”", "Author": "RoadWarrior", "ReviewID": "UR120130781", "Content": "We held a day and a half business meeting at their hotel and stayed for 3 nights. The one thing I will say about this property is they had FANTASTIC folks working there. From the maintenance man who adjusted the temperature right through to front desk, breakfast server & cleaning staff we were always greeted with smiles and helped quickly. Awesome people. As for the rooms there's good wireless. If you're a couple with 2 computers make sure you ask for a second password at check in. Not a big deal but the password you get only works for one computer. There is not a fridge in the room but otherwise it's equipped and comfortable ... although the beds aren't my favourite. They were fine but after spending many nights in Starwood hotels with their heavenly beds I kind of missed the cushioning and good sheets. The gym is decent - no free weights but some decent cardio machines and a big multi-weight machine. The pool was a popular place for the kids on the weekend. Breakfast is about $15 for the buffet with eggs made to order. Pretty good food. It's the only meal they serve here but there are lots of choices around with the big Marriott nearby (great lounge there if you're interested), Greek in the parking lot and a few other restaurants within a few minutes drive or 10 minute walk. We had a little issue the one night as a boys hockey team checked in and it got REALLY loud about 45 minutes after we'd gone to sleep. Security was on the scene minutes after I called but it took about 90 minutes before they moved them out of their rooms to new rooms. The staff handled the situation pretty well but we did lose 3 hours of sleep over the whole thing... not too fun for us!! But I really commend security for being on top of it. It wasn't an easy scene to control. Overall it's a pretty good place for the price and the staff are going to bend over backwards to do what they can to help you out - and that's a huge thing for me!! And if you're interested in having a meeting there - the meeting rooms was set up exactly as we asked and everything went well. Really great business hotel!! Thank you!!", "Date": "November 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "ny", "Title": "“Nice”", "Author": "rv4life", "ReviewID": "UR120093245", "Content": "A nice hotel. Clean, quiet. Very interesting watching airplanes land from our room at the next door airport but with no noise. Did not notice that breakfast was not free. Ended up buying food at Tim Hortons. Shorter car ride to Rogers Center that the manager on duty stated the night before.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vienna, Virginia", "Title": "“perfectly decent place -- as expected”", "Author": "travel-here-there", "ReviewID": "UR119976230", "Content": "I stayed one night here since I had an early morning flight from YYZ and didn't want a long early morning drive. This location is very close to the airport and easy to get to with enough close by if you need it. The check in gentleman was fine, helpful, offering options for dinner even with a late arrival. I will agree with some of the others who commented about the hard beds... these are a little more firm than most hotel beds and may not be for everyone. I didn't mind being on the side of the hotel that is parallel to the runway as aircraft are fascinating to me. Overall the windows are fairly well sound proof, and with the heating/AC fan on it hides that noise even more.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Unionville", "Title": "“Great overnight stay”", "Author": "Poper118", "ReviewID": "UR119969589", "Content": "Really nice and quiet yet so close to the airport - really comfortable room; fabulous breakfast buffet and a most efficient front desk - they had the cork screw I forgot to pack!", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Very nice hotel”", "Author": "McLeodLA", "ReviewID": "UR119880469", "Content": "Stayed here due to its proximity to the airport and free shuttle service to and from. Very nice and clean and nice staff, originally was going to stay at a smaller hotel beside, but was happy to change to this hotel. It has a nice pool, a bit secluded, its near enough things like a breakfast place really close thats open early so its pretty handy for early flights. (11$ for a bagel at airport, no thanks). Its also near a nice family restaurant at a walking distance which is nice. If you stay here ask for a view of the airplanes landing, its amazing how close they are landing to the hotel! Definitely would recommend to anyone wanting to stay at an airport hotel!", "Date": "October 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "White Rock, BC Canada", "Title": "“Hard Beds and Dirty Carpets not our cup of tea”", "Author": "travels_frequently", "ReviewID": "UR119834154", "Content": "Stayed overnight twice here at the beginning and end of a European trip. The beds were hard and uncomfortable. I would not recommend this hotel for side sleepers. We both kept waking up in the middle of the night because after a few hours on your side the firmness of the mattress springs were pressing on your hips making them sore. On the return we requested a quiet room because we were jet lagged and need sleep in the middle of the afternoon and they gave us a room smack beside the elevator, so we had to change rooms. We also requested an extra mattress pad and were told they don't have mattress pads. Why not? We were given another duvet to put down on the bed and that made the bed more comfortable than our stay the first night. The carpets in our room were so filthy that your white socks turned black as soon as you walked across it once. Were given the ya, ya, ya, we will take care of that right away when we checked out. Not sure if the employee actually made a note of the dirty carpets or not, we sat in the lobby for quite awhile waiting for the shuttle and know that the employee didn't talk to housekeeping on the phone or to the manager who was sitting in the back room. One should keep in mind that unkept dirty carpets can become a breeding ground for bed bugs very quickly.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Great location”", "Author": "gohabsgo24", "ReviewID": "UR119692044", "Content": "Have stayed at this hotel twice for a hockey tournament. The staff is very friendly, but at the front desk, you always have to ask twice for extra things as they never write it down. The rooms are not equipped with a mini refrigerator, but if you ask and some are available, you can get one free of charge. I personally found the beds to soft, the windows need cleaning, but all in all, the rooms were clean. We did not use the restaurant, but if I can make one suggestion, it would be to include microwaves in the rooms, although I understand that most of the guests are there for one night and flying out the next day. There are many different restaurants within walking distance. Being right next to the airport, it's always amazing to see the planes land and take off. The kids really enjoyed that. The hotel was very accomodating towards the team, and we all hope to return next year.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Typical Courtyard accomodations, except breakfast not complimentary (a noticed trend in other recent stays)”", "Author": "Myinbox125", "ReviewID": "UR119310976", "Content": "I travel for business and generally stay at Courtyards. This one is typical Courtyard accomodation (clean & comfortable). Most Courtyards tend to have complimentary continental breakfasts (with some hot items). Come to think of it, some Courtyards are updating lobby areas getting rid of free breakfast for paid options. Dining area was quite large. Breakfast buffet had continental version or hot+baked goods/cereal versions. I only ordered the continental which was again what was typical when breakfast was complimentary. PRO: proximity to airport CON: nothing much around that area. Only a few restaurants, but nothing exciting. *This is exactly next to the Marriot Airport*", "Date": "October 14, 2011"}, {"Ratings": {"Location": "3", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Didn't expect much....got even less!”", "Author": "MillionMilerMan", "ReviewID": "UR118174857", "Content": "When I stay at a mid-priced, limited service airport hotel, my expectations are usually pretty moderate. Unfortunately, the Courtyard YYZ couldn't even meet those moderate needs. We were staying at the hotel for only 7 hours for a very long layover before a 1:40AM flight on Cathay to Hong Kong. The two things we needed were a reliable wake-up call and a reliable shuttle service to Terminal 3. Courtyard failed on both counts. No wake-up call, despite requesting it in person with the front desk manager when we checked in. No shuttle driver at 11:35PM for the bus to the terminal, despite being assured that the shuttle ran regularly and without reservations until 1AM. At 11:35, we asked the front desk about the shuttle. She called the driver who responded he'd be there in 2 minutes. 15 minutes later, still no driver. After our prompting, the disinterested front desk staff again called the driver. Finally, just after midnight the driver arrived, totally unapologetic and blaming us because we had failed to advise them in advance. Worried only about catching or flight to HKG I was in no mood to argue. Was the staff welcoming...or even friendly? No. Are there nearby decent dining options? No. Did we find the staff helpful in any way? No. Would we stay there again? No. Would I recommend the property? No.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "5"}, "AuthorLocation": "Calgary", "Title": "“Overpriced- Average Hotel”", "Author": "manilasfinest", "ReviewID": "UR117870867", "Content": "Had training here in one of the meeting rooms and it lasted a week so my company decided to place me here for my stay. Rooms were big- little bit outdated. Very comfy bed, however you do hear planes flying by every couple minutes but I got used to it (My windows was facing Pearson Intl.) No restaurant downstairs besides the breakfast one- kinda sucked since the surrounding area didn't have much selection. Really small gym- like I think it was a storage room. OK pool. For the price you pay here I would've rather stayed elsewhere. All in all the place was average, helpful front desk but overpriced. Dont think i'll be back if I had a choice.", "Date": "September 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Grand Falls, Canada", "Title": "“Good hotel overall; lacks restaurant/food service.”", "Author": "HomedicMunes", "ReviewID": "UR117030968", "Content": "Courtyard by Marriott Toronto airport We stayed at this hotel on a stopover. We had stayed here on other occasions but this was the first time we had arrived late afternoon, jet lagged and with an early morning departure. The hotel is conveniently located close to the airport and their complimentary airport shuttle service leaves about every 20 to 30 minutes. The rooms are an average size by North American standards, clean and the bed quite comfortable. It also has a sofa, chair, TV with good channel selection and free WiFi. The service at reception was friendly and efficient. On this occasion we arrived late afternoon jet lagged after an 11 hour flight and wanted nothing more than a light meal before retiring. However we were out of luck unless we left the hotel and we were simply too tired to do so.Â The only available items were snacks from the 'market' which Â housed in a very tiny room connected to the Â reception desk. Â We experienced the same problem early next morning.Â  Â For anyone catching an early flight the 'market' has Â a few items consisting mostly of bars, chips, soft drinks, juice, a few sandwiches, Â packets of cereal and a few other miscellaneous items. The selection was neither convenient nor appropriate for a decent breakfast. It's also quite expensive. We were quite disappointed with this lack of acceptable food service especially at a Marriott Hotel. When I returned home I received a request to review our visit. Â I did so expressing my concerns. The reply was prompt, apologetic and polite and indicated there were soon to be changes to the food service. Â These would include a bistro offering dinner and breakfast. Â This was great news but only if the service accommodates flexible dining hours especially for those catching early morning flights. On this trip we were returning from holidays in 2 other countries where we had stayed in similar airport hotels . In each of these hotels they had offered evening dining and room service as well as a full breakfast served from 4:00 a.m. till 11:00Â a.m. I like this hotel and will return if it adds restaurant service forÂ travelers catching early morning flights.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“Overpriced but comfortable bed.”", "Author": "tstarseminar", "ReviewID": "UR114610371", "Content": "We won a bid on this place through Priceline and thought we were getting a steal, when in reality, once we added all the \"incidentals\" to the room price we won, would have gotten a better deal at a nicer hotel (and we add absolutely nothing to our room bill, so for us it was $12 parking just to stay at the place for a night). Room didn't have microwave or fridge, and front desk isn't very friendly. Also if you'd like cheaper wine than what the hotel bar has to offer, buy before 8 pm at LCBO down Martin Grove- everyone closes at 8 and they don't sell at convenience stores in Toronto.", "Date": "June 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Always stay at Courtyards”", "Author": "giuseppeh", "ReviewID": "UR108519330", "Content": "I stayed at as many courtyards as I can, I find this one very efficient. I dont travel to Toronto often but when i did on this stay i got my usual up to standard great stay. keep up the great work", "Date": "May 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fairfax, Virginia", "Title": "“great for business traveller”", "Author": "Floridaguy5453", "ReviewID": "UR104248745", "Content": "I have stayed at this hotel on many occasions and found the staff always to be extremely accomodating. The restaurant and Housekeeping staff are always looking for ways to help ensure I have a great stay. I use the lobby for business meetings with clients, I wish there was a food option available. I usually have to order from the Mr. Greek next door who are always accomodating to my picky food requests. All and all this team does a great job. Joe", "Date": "April 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Buffalo, New York", "Title": "“Another Great Courtyard”", "Author": "Sparky2526", "ReviewID": "UR100710906", "Content": "Had stayed here for the first time and I must say I was very impressed with the level of service I received. Airport shuttle was quick and free and the front desk was great in providing me directions to my two appointments. The morning buffet is priced fairly but it had a great selection of hot and cold items. Morning server was great and very warm (even at 6:15am). The omlette station was a great add. The pool and whirlpool were nice and although the work-out room was a little tight it had all the equipment I need (treadmills and a universal gym). They also had free wireless throughout the hotel and an option for wireless and wired in the rooms. Quick speed! All in all I felt very welcomed at this hotel and would certainly come back if in the area again!", "Date": "March 19, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Connecticut", "Title": "“Genuinely Average”", "Author": "MBAX01", "ReviewID": "UR100136038", "Content": "Hotel was OK, room was clean. Only annoyance was that there was no food available in the hotel in the evening. The closest restaurant was Mr Greek (yes, that's the name) across the driveway. It was OK but I was there for 5 nights and Mr Greek can be repetitive. You can walk to the Marriott next door but it's priced accordingly.", "Date": "March 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ontario", "Title": "“More than I could have Asked for!”", "Author": "Helper_One", "ReviewID": "UR96282571", "Content": "Travelling by one self is often very tiring and stressful. I arrived at the hotel at 11:00 am in the morning and was pleasantly surprised when I could check in immediately..and also given a lovely room on a high floor. Even though this hotel is near the airport I barely heard the planes. The front desk was extremely helpful when I was looking for coffee and donuts late at night and directed me to the Coffee Time (24 hours) next door. They were also very helpful when asking to directions to sites near by and always asked me if there was anything they could do for me when I was in the lobby. The rate for the room was great considering it was near the airport in a large city and getting there was easy! I would recommend this location to anyone.", "Date": "February 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Staff Go the Extra Mile”", "Author": "whitley_gary", "ReviewID": "UR93886063", "Content": "I recently chaged to Marriott properties for my business travel. I have found the properties consistantly above average. This morning though John Aneziris went far beyond the call of duty. I accidentally locked my keys in the car while it was running. The front desk called maintenance and John came to the rescue. He personally called several locksmiths and found a 3 hour wait unacceptable so called out CAA who were there in 10 minutes. After all this he would not accept a tip as an expression of my sincere gratitude. When in Toronto this is my property of choice.", "Date": "January 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Berlin, Germany", "Title": "“Some minutes by car from airport”", "Author": "Gabriele60", "ReviewID": "UR77715732", "Content": "Hotel's location amongst several other hotels near the international airport, area not very inviting, however, near industry and companies' area in Toronto. Did not hear any noise from planes, as windows could not be opened. Air condition did not work very well, could not increase temperature, it was rather cold inside. Heating produced dust and strange smell, so I stopped that. Breakfast not really great but staff polite and friendly. Parking space was 12$ per day.", "Date": "August 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Atlanta", "Title": "“Good hotel near the airport”", "Author": "ammatlanta", "ReviewID": "UR68988408", "Content": "We stayed here one night waiting for a flight. The hotel has a regular shuttle to and from the airport. The hotel is located with other 'airport' hotels. There are a few restaurants within walking distance. It had all the amenities you would expect from Courtyard. The only downside was construction nearby.", "Date": "June 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Surrey, Canada", "Title": "“Good for an Overniter”", "Author": "Son_of_a_Sailor_51", "ReviewID": "UR62082999", "Content": "Close to YYZ, with a shuttle. Good fast check-in. Rooms are a bit dated, but clean and bed as comfy as usual in a Marriott. Close (withing walking distance) to several restaurants and bars. Good for a short stay.", "Date": "April 21, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Tahiti", "Title": "“Nice hotel at decent price”", "Author": "Kaveka", "ReviewID": "UR39393620", "Content": "I stayed there just one night to catch my flight the next morning. Though the outside didn't look so nice, the inside was surprisingly nice and clean, including the room itself (clean bathromm, very comfortable bed). The staff at the reception was really efficient. For checking in, there were 5 people in front of me, and it was all done in 10 minutes ! Very nice when you're tired and just want to go to bed.", "Date": "August 31, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Miramar, Florida", "Title": "“Good for a one night stay”", "Author": "fee57", "ReviewID": "UR38530860", "Content": "Stayed here for one night. Yhe pick service from the airport was poor so expect to wait a long time. Whilst waiting we saw buses for other hotels making 2nd and 3rd trips. The room was clean and the bed very comfortable. We had a very comfortable night. We went to Mr Greek a restaurant nearby....did not think much of the setting but the excellent food made up for it. This was a recommendation from the hotel. At check out on the 15th August, we came up on a very grumpy receptionist. It would have helped had she said \" Thank you for staying at the Courtyard Marriott and did you have a good time?\". Some training here might assist. Overall a nice place to spend a night.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Montreal", "Title": "“Nice play, on the expensive side”", "Author": "NYC_is_for_lovers", "ReviewID": "UR36232660", "Content": "I stayed there 1 night in May, and the place was OK and classy, but expensive for what I've gotten. I could stay in a Staybridge for the same amenities at half the price. Staff was courteous, room was big, but leftovers were found in the fridge (housekeeping anyone?). We had a great stay, and the breakfast was good (mmmm Canadian coffee!!), but we would not stay there again, as it is way too expensive!", "Date": "July 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ontario", "Title": "“Great location close to airport”", "Author": "Weswee", "ReviewID": "UR22923835", "Content": "We stayed at the Courtyard by Marriott Toronto airport 2 nights - before and after our trip to the Carribbean. The hotel is very close to the airport but nice and quiet. It was spotlessly clean. The staff at the front desk and at the restaurant were extremely polite, friendly and helpful. We booked through the CAA and got a very cheap price. The room was excellent value for what we paid. When we arrived, the person at check in said that for the rate we were paying, normally we would have to pay to leave our car for the week, but he said he would not charge us at all. Ask for a room away from the ice machine - it made noise all night. The (cold) breakfast buffet was ok, nothing special, but again, dining room was very clean and waiter very nice. The shuttle to the airport runs every 20 minutes from 4 a.m. to 2 a.m. and is only a 5 minute ride. All in all, I would highly recommend this hotel for anybody catching a flight and having to leave their vehicle.", "Date": "December 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Charlottesville, Virginia", "Title": "“Great Hotel”", "Author": "KitKat003", "ReviewID": "UR18286288", "Content": "We were looking for a hotel that had a good price and located near Wonderland. Well the price wasn't too bad and Wonderland was 15 minutes away. When we arrived the kids enjoyed the cookies waiting at the front desk. Our room faced the airport, and we had fun watching the planes coming in. No real noise from them which was a nice surprise. The beds were very comfortable and the pillows were great!! The room was clean, great internet connection. We had the \"deal\" with breakfast...it was great!! Hot items and cold, nice sitting area and friendly staff!!! Travelling with children, a pool is a must. This hotel did not disappoint!! Nice size pool, room to swim...and hot tub was nice as well. One night we ate at the Greek place next door....very enjoyable!! We were quite happy with this Hotel and would stay there again..", "Date": "July 26, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Canada", "Title": "“no service!!!”", "Author": "worldtravel71", "ReviewID": "UR14259155", "Content": "the room was Ok but booked this location because of being told U could leave your car there for 2 weeks as part of the deal. We arrived at 3am from a stressful flight to find our truck plowed in. The staff offered a shovel and never showed there face until we returned the shovel. Fortunately my husband was able to do it but it took him more than 30 min to free it. i complain to Flight Center and to Marriott directly and they saidtoo bad!! Good thing my husband was in good health!!! In fact FLIGHT CENTER said maybe stay there in the summer to avoid this type of problem, good customer relations!!", "Date": "March 13, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Upstate NY", "Title": "“Spiffy room, but some shortcomings”", "Author": "The_Conductor", "ReviewID": "UR13242795", "Content": "This is a smallish high-rise very close to the Pearson Airport. I have used this hotel a couple times. It seems to be a favorite of my employer's local sales force. When not co-ordinating with them I choose another (usually the Sheraton Four Points back behind the airport on Dixie Rd) due to shortcomings I mention below. On the positive side, the rooms and common areas are cleaner and more nicely appointed than is usual at this price point. The pool and breakfast buffet is nicer than most. The location relative to the airport is about as convenient as it gets. The parking lot is crowded, but that seems to be a problem with all the hotels near the airport. The lay of the grounds and the slope of the hill, however, make unloading the car here rather aggravating, especially when (as when I stayed here in Feb '07) it is -4 F and they didn't do a good job removing snow. More important to me is the incomplete equipment in weight room. I don't ask for much: All I really need is a bench press and a set of free weights, or equivalent Nautilus-style machines. But the tiny exercise room doesn't have any free weights at all. There is no way, for example, to do curls. The most glaring shortcoming, however, is poor compatibility of the internet connection. Linux/Mac/PDA users beware. The wired connection will not work with Linux (well, I got it to work with an artful hack, but I can't expect ordinary users to do what I did). The Wi-Fi won't work with a Palm TX PDA. This is unacceptable to me. I left feedback to the management about these two shortcomings. If they fix the internet & put in a rack of free weights, this would be my favorite hotel in the area. Until then, I shall avoid it. If those shortcomings matter to you, I recommend you avoid it also; otherwise, it is a good choice.", "Date": "February 3, 2008"}], "HotelInfo": {"Name": "Courtyard Toronto Airport", "HotelURL": "/ShowUserReviews-g155019-d224671-Reviews-Courtyard_Toronto_Airport-Toronto_Ontario.html", "Price": "$112 - $247*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">231 Carlingview Drive</span>, <span class=\"locality\"><span property=\"v:locality\">Toronto</span>, <span property=\"v:region\">Ontario</span> <span property=\"v:postal-code\">M9W5E8</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span> </span> </address>", "HotelID": "224671", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-f/01/e8/92/85/courtyard-by-marriott.jpg"}}