{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Darlington, United Kingdom", "Title": "“Value For Money”", "Author": "Steven P", "ReviewID": "UR126299368", "Content": "Just stayed 2 nights, great vaule as always. Was a little noisy at night outside, as is on the edge of a housing estate. Would go back for sure, if the price is right", "Date": "March 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Keighley", "Title": "“Clean and comfortable”", "Author": "KeighleyJetsetter", "ReviewID": "UR126264527", "Content": "Have stayed in about 10 different Travelodges In London and this one is very good. Very quiet for central London. No noise at night, however, the Travelodge is surrounded by large tall buildings so the rooms are dark and do not get much natuarl sunlight. Not a problem as you are in London and will not be spending much time in your room. If you are travelling from Kings Cross you can get there on bus 205, takes about 20 minutes. It is a 5 minute walk from Liverpool Street station. Breakfast room very small by Travelodge standards but the food was hot and plentiful. Would stay here agian.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“Good place to stay”", "Author": "Sheena K", "ReviewID": "UR126150062", "Content": "Have just spent two days at the travel lodge. Staff could not have been more helpful. Location good for two underground stations. Very quiet location for London, rooms clean and comfortable.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ireland", "Title": "“Top class for the money”", "Author": "ronans", "ReviewID": "UR126144662", "Content": "Stayed yet again in Liverpool Street Travelodge and as before could not fault this hotel. Was a bit worried that the standards may have dropped since our last visit having read some of the recent reviews but fortunately we had an excellent time. This hotel is in such a good location. Right opposite Liverpool street station making it an ideal location for sightseeing in London. The hotel is basic as they all are. Spotless clean, warm, quiet. Booked breakfast and that was excellent. Needed more towels and asked at reception and was given them without any question. Staff very friendly as extremely helpful when we asked for advise and also for booking taxis. Will certainly stay here again.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "harlow", "Title": "“handy hotel”", "Author": "lilyrose8", "ReviewID": "UR125987730", "Content": "great location,check in staff gret (check in after 3pm)shooort walk from 2 stations.no noise clean room but bathroom needed a second clean.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“Good Location - thats all.”", "Author": "LewisBoffin", "ReviewID": "UR125902051", "Content": "The location of this hotel is close to Liverpool Street Station and easy to find. That is really where the advantages end. I wanted to travel light, but as the hotel does not supply toiletries needed to bring those with me. I never spoke to anyone at the hotel the whole time I was there. I had to check in on an automatic machine as there was no-one in reception (at 6pm) and just left my room card on the desk in the morning. When I first got into the room I thought that they had forgotten to put a cover on the duvet - until I realised that the duvet cover was off white. The room window looked directly into an office which was still occupied, and the shower was not great.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Telford, United Kingdom", "Title": "“Average hotel - Excellent location”", "Author": "whukev", "ReviewID": "UR125859032", "Content": "Stayed here for 1 night on business. The location of this Traveloge is excellent - just a 2 minute walk from Liverpool Street station so as a central base for using the underground network you couldn't be better positioned. The hotel is a standard tired travelodge in need of an upgrade, but if all you need is a bed for the night then the location makes it worthwhile. I booked breakfast at Â£7.95 for convenience, but would not recommend it. Food served in a cramped bar area and the quality was really quite poor. Overall, I would have given this hotel a 3/5 rating, but the location pushes it up to a 4.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chesterfield, United Kingdom", "Title": "“Good, clean hotel near Liverpool Street station”", "Author": "Tony S", "ReviewID": "UR125843784", "Content": "This is a typical Travelodge. The staff were friendly and the room was clean. Check-in and check-out was straight forward although as expected you can't check in early. What surprised me though was how quiet the room. I had expected it to be noisy from reading other reviews but I guess it depends where your room is. I booked 3 months in advance for a Friday night stay as I had an exam in Westminster on the Saturday and the room only cost Â£35.", "Date": "March 9, 2012"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Rooms": "4", "Value": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good for City”", "Author": "820Angel_D", "ReviewID": "UR125767455", "Content": "stayed for a late meeting in town and hotel represents good value. Wouldnt find much better for budget price in area", "Date": "March 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Overnight Stay”", "Author": "Peter11435", "ReviewID": "UR125632488", "Content": "My wife and I were just staying for the night before getting a flight out from Stansted Airport. True, its basic, but at a special rate of Â£25, we could hardly complain. The staff were both friendly and helpful and although there was a slightly unpleasant foody smell, the room was both clean and well appointed.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "5", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "london", "Title": "“very cheap very basic but good location”", "Author": "bluestar1967", "ReviewID": "UR125222665", "Content": "suitable just for a bed fr the night very very basic, take some ea and coffee with you and shower products its basically a bed for teh night when in london, location is excellent and check in staff were friednly", "Date": "February 26, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Rotherham, United Kingdom", "Title": "“Business Trip”", "Author": "loundy1", "ReviewID": "UR124868995", "Content": "Me and my partner recently went to London as he was attending a meeting all day so I decided to tag along and we'd make a weekend of it. We arrived at the Travelodge Liverpool Street late so we got our key from reception and made our way to our room on the 4th floor via the lift. There is only 1 lift in the hotel and we only got in once as we thought the doors were not going to open, the doors kind of stuck for what felt like forever so we decided not to take our chances in it again. When we arrived at our room we were really dissappointed especially as the room had cost Â£100 per night. It was very basic had a flickering light, grubby marks on the lamps and walls and no bath in the bathroom. We opened our curtains to see what the view was and we backed onto a housing estate that looked like something from the Bill, not the best of views! The bed was the most uncomfortable thing I have ever laid on and we got hardly any sleep over the 2 nights that we were there. I dont know if this is what is to be expected when staying in a big city like London but I certainly wont be booking to go back any time soon.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Location": "5"}, "AuthorLocation": "Truro, United Kingdom", "Title": "“Would go back”", "Author": "Bongebon", "ReviewID": "UR124513328", "Content": "A very central hotel. Bargain prices, lovely hospitality, a really enjoyable stay. Would recommend as it was in a really safe area and very close to the train station. Reception staff were friendly and helpful.", "Date": "February 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tunbridge Wells, England", "Title": "“You get what you pay for”", "Author": "Astronaught", "ReviewID": "UR124129181", "Content": "We stayed at the hotel in Feb 2012. Located within easy reach of Tower Bridge. It was VERY cheap compared with other hotels so top marks for that. It was however `tired` with screws sticking out of walls, damage to the walls etc. Bed wasn`t very comfortable, but on the plus side, the room was warm. One final thing, the breakfast, also cheap, was excellent. So in summary, don`t expect a top notch hotel, but it`s more than adequate.", "Date": "February 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Edenbridge, United Kingdom", "Title": "“Great value and location”", "Author": "EdenJules", "ReviewID": "UR124123479", "Content": "I was surprised to read some of the derogatory reviews about this travelodge on this site. My husband and I stayed here last night and we were most pleasantly surprised by the friendliness and excellent service of the staff. We booked in the sale and got the room and breakfast for Â£38 for the both of us so it was amazing value given the location too. The bed was a little soft for our taste, the decoration was plain and you wouldn't choose to spend a romantic weekend there, but it does not profess to be a luxury hotel. The breakfast was varied and tasty, with fruit, cereal, yoghurt, pastries, full cooked breakfast, etc. If you want cheap accommodation in the centre of London it's all that it needs to be.", "Date": "February 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Stafford, England, United Kingdom", "Title": "“Poor but extra rating for Location and Staff”", "Author": "jimhooker", "ReviewID": "UR124003334", "Content": "The hallways smell a bit mouldy (4th floor), and the wet room floor lino was not meeting the shower so water could get in. On the second night the room heater stopped working along with a draft coming from the windows, I woke up cold. However the Location is fantastic and the staff are very friendly and helpful. If you are getting it cheap stay here - if not shell out a little more for at least a premier inn.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“basic and clean, good location”", "Author": "Brummig07", "ReviewID": "UR123684937", "Content": "The hotel is 5min walk from Liverpool Street Station thus wonderful for getting anywhere, and super convenient if flying to Stanstead Airport. Supermarket and pubs open also in the weekend. We ate at The White Heart pub where for a good price we both had some of the best English beers and traditional English dishes, good home cooked quality. On our many visits we found the hotel always clean and the staff friendly. There is a possibility of an early (12pm) check-in and a late (3pm) check-out. Both at an extra Â£10, I think. Despite always visiting on weekends, the rooms are quiet. We could never hear the lift, maybe because it NEVER works (4 visits now in 2-3 years). There is also just one armchair in the room so if you both want to sit at the table and eat the food you ordered from downstairs etc, take turns or eat in bed.. It is fine for a short stay as the price and location are really good but, if possible, we always try to look elsewhere first.", "Date": "January 27, 2012"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Ardrossan, United Kingdom", "Title": "“Only if you must!”", "Author": "52PaulS", "ReviewID": "UR123488408", "Content": "Back street typical Travelodge hotel, basic room, no character, the rooms really need at least a decent upgrade to take them away from their dull, bland uninviting feel and look. Outside was a highly over perfumed common hotel corridor (designed to hide some really bad smell?) and in the morning the basic breakfast only just gets pass marks. One positive point is that the staff were nice when in contact. To summarise, you certainly pay for wanting to stay in this part of the city no doubt, but in hindsight if there was a choice I should have stayed elsewhere and tubed it as necessary.", "Date": "January 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Wiltshire", "Title": "“Get what you pay for”", "Author": "lilosplash88", "ReviewID": "UR123353694", "Content": "Room was ok, very basic, but can't complain because we didn't need to pay much! Restuarant was run by one man, running frantically about manning the bar and cooking everyones food AND serving the tables. Food was microwaved and heated up which was obviously quick but for the money we paid this should have been better. Was in a good walking distance to Liverpool station and the tubes. Overall, you get what you pay for with this place.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kent, UK", "Title": "“Great location”", "Author": "Loriners", "ReviewID": "UR123121747", "Content": "Great value for money - Â£49 for a double room. Reception staff were helpful and friendly. Room was clean with a comfortable bed. Quiet on a Saturday night. Only a few minutes' walk from Liverpool Station and Spittalfields Market. In the shadow of The Gherkin and on the doorstep of Petticoat Lane Market. Perfectly fine for an overnight stay. Only disadvantage was the lift was out.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Chesterfield, United Kingdom", "Title": "“Tired and in need of refurb”", "Author": "Marsbar999", "ReviewID": "UR122987404", "Content": "1 night stay in a tired and not all together clean hotel. I gave stopped at a number of Travelodges up and down the country and usually they are fairly similar, no frills but clean and practical. The bedroom furniture caws chipped all over, dirty walls, hairs in the bathroom etc. Not what I would expect from Travelodge! On the plus check in was easy and the location is great with only a 2 min walk to Liverpool Street Railway Station/tube. At Â£105 you are paying for the location and not the standards", "Date": "January 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Great and Ideal”", "Author": "soundzkul", "ReviewID": "UR122962085", "Content": "The hotel was ideal for travelling around in and around london, we were there for a long weekend stay. the hotel was basic and it the shops are quite close by if you need any thing. the tube station was only a few minutes walk and it was ideal. Great for a few days and if you want to travel around london", "Date": "January 12, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Unpleasant”", "Author": "Jess H", "ReviewID": "UR122924283", "Content": "Me and my partner thought the hotel was over priced for what it is!! The lift doesnt work properly, the rooms are small and very old fashion! We found the breakfast staff really rude and we were spoken to very rudely because it had past 10am when breakfast ends and we were finishing off our coffee still, we were told to hurry up and leave else we would get locked it! As anyone would we went down to complain to the manager whos name is MILLIE and told her what had just happen when the member for staff came down and lied saying we had been rude, instead of apologising to us she was very rude towards us a sided with her team and said we should have been out by 10am.. when it clearly says breakfast served till 10am meaning you can still sit down and finish your food after 10am!(like we have in the past in all the other travelodges and not had any problems) After deciding to agree to disagree we went bak to our room.. 30mins later the police knocked on our door asking us to leave all because the manager millie didnt want us there!! We tried to speak to her and come to an arrangement as she was completely over exaggerating but she was being really cold hearted and didnt want to know! This was very upsetting for us as we had done nothing wrong but complain! We have stayed in alot of travelodge in and around the london area for the past 2months whilst looking for a rental and never had a problem.. We now have been put off going back to any travelodge because of the way we were treated!!", "Date": "January 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "belfast uk", "Title": "“Great location no problems”", "Author": "lisaBelfastUk", "ReviewID": "UR122810699", "Content": "Stayed here for 4 nights on a post New Year break. Didnt pay full price for 2 of the nights so it was very cheap. I know the area well having lived there for many years so no surprises apart from it was very quiet considering its so near the City and also the fact that like a lot of the City areas it goes quiet at night,. Great location if you want to go to the hip bars in Shoreditch and Hoxton , 10 mins walk away and only 20 mins from the West End by bus or train. You also have a lot of attractions within walking distance and it doesnt feel full of tourists or packed like the West End hotels. You get what you pay for but my room, 418 was quite spacious quiet and clean no problems with cleaning and the staff were pretty friendly . However they did run ot of pillows when the hotel was full so it was a bit much not having any extra pillows till the 2nd day! Didnt eat there so cant comment. Overall thought it was a good Travelodge and would stay there again", "Date": "January 9, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "carlisle", "Title": "“Central location, poor quality hotel and expensive”", "Author": "leadyb", "ReviewID": "UR122022236", "Content": "This hotel is very central to London, being a few minutes walk from Liverpool street station and less than 5 minutes walk to 'the Gerkin'. However the hotel is very expensive for the quality, and clearly the only think you are paying for is the location. I stayed here one night as a business trip, hotel was falling apart and looked like an old hospital in the corridors. This is the worst travelodge I have ever seen- I was not even given a duvet! I had to wait half an hour for the receptionist to come back as he had just dissapeared, then I was given the only duvet left, which was not fresh and clean. I would avoid this hotel is possible, as it is not up to the quality one would expect for over Â£100 a night. Breakfast was also poor.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Great for a simple overnight stay, super location”", "Author": "Greg3802", "ReviewID": "UR121784620", "Content": "Hard-to-beat location to Lloyd's and the Aldgate tube station. Ideal for the experienced traveler with realistic expectations. Breakfast buffet was very good, particularly for the pre-paid price. The pre-paid wifi voucher email never arrrived; however, found the required info at the Travelodge webpage for my account (free wifi in the Cafe). Shower may be a bit tight for larger travelers, about 30\"x36\".", "Date": "December 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Surrey", "Title": "“Fine for one night”", "Author": "GoodorBadSurrey", "ReviewID": "UR121758836", "Content": "Stayed here for one night this week. It's a short walk from Liverpool Street and tucked away a bit, but nothing to tricky to find. Check in was good, out of the two machines one was not working and while I was heading towards the second, a receptionist arrived and checked me in with a smile. Room was standard Travelodge, although this one is starting to look a bit tired. Due to being tucked away, there was little or no traffic noise, which made for a good nights sleep. Would use again, although possibly not my first choice, a good second!", "Date": "December 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Gdynia, Poland", "Title": "“Poor quality, good localization”", "Author": "slawekg07", "ReviewID": "UR121715513", "Content": "Hotel is very good situated close to Liverpool Railway station and close to bus stops.It is perfect when you are going to Stansted airport. Hotel is old and needs rebufnishment. Carpets are old and worn. Room was not co clean.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Fine for a budget overnight”", "Author": "bellini6", "ReviewID": "UR121380943", "Content": "Very convenient for rail, bus and tube and Spitalfields Market is only a 5 min walk away. Bed too soft for me but that's a matter of taste. Room 202 was clean and basic but for the price good value. Unfortunate smell of strong B.O. in corridor when we arrived. And why do Travelodge staff only ever supply one set of towels when you've stated 2 people will be using the room? Had to go down to reception for extra towels which were provided speedily and with an apology. Good value overnighter.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Antwerp, Belgium", "Title": "“This is ok, for a Travelodge - very good location”", "Author": "djg2018", "ReviewID": "UR121300872", "Content": "As always, I would never pay full price to stay in a Travelodge nor stop more than one night - so on this occasion I was on a stopover before a flight and booked for Â£30 earlier in the year. That said, this hotel is pretty much ok and well located for Liverpool Street station ( 5 mins walk) ; the fabric of the hotel is usual Travelodge standard; a bit tired all over but not yet thrashed , with all the charm of \"secure accomodation\" , rooms are functional ( bed+shower+TV) and the bed adequate . Can't really comment on the check-in experience, as reception was unstaffed ( they were unloading a laundry truck) however the two touchscreen check-in machines worked fine and issued me with a key and room number; (the reception was staffed when I checked out). On this occasion, I didn't have breakfast Overall, this hotel does what it says on the box - good location, adequate stay, just don't pay too much for the Travelodge experience", "Date": "December 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "lincs uk", "Title": "“get what you pay for and good value for central london”", "Author": "deebeeLincsUk", "ReviewID": "UR120971639", "Content": "Stayed overnight last weekend. Arrived at midnight but the desk was manned. Clean room and actually a comfortable bed, good controllable heating and working TV - what more do you need. See alot worse in Central London. Booked for breakfast and it was edible and plentiful. The staff were all helpful and friendly. Cant understand why people complain about the lack of toiletries etc in the rooms - it is very clear when you book exactly what you get for the money, its functional! The only point I would make is that if you are a lone lady traveller you plan your route to the hotel carefully to avoid going down a dimly lit deserted alleyway to the front of the hotel.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Coventry, United Kingdom", "Title": "“Not Worth 1/4th the price”", "Author": "Shaat-el", "ReviewID": "UR120659070", "Content": "This is an overpriced piece of crap of a joint. I was chargeed Â£70 for one night and they give nothing. not even shampoo or anything just soad. the rooms r like a cheap motel place which it is. small tv two cofee n tea. no mini bar nor refrigerator no microwave but an water heater. Bath is crap! Not worh it! Find a 3 star hotel with similar rates my friends", "Date": "November 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "North York Moors National Park, United Kingdom", "Title": "“Poor location and customer service”", "Author": "Skygotraveller", "ReviewID": "UR120364435", "Content": "Stayed overnight on a business trip. The hotel reception is scruffy and the council tower block behind hotel looked pretty dodgy which meant I didn't want to go out after dark. The 'bar/breakfast' area looked like a youth club -didn't bother with my pre-paid breakfast. Will not say there again.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Birmingham", "Title": "“Great for a night in london”", "Author": "star7474", "ReviewID": "UR120335214", "Content": "Every time i go to London, i stay in the Travelodge Liverpool Street. Its situated less than a 5 min walk to the hotel from Liverpool street station/tube station. You can check in at the desk or by using the computer using your reference number so no waiting around to check in. Check in is usually 1500 but you can pay an extra Â£10 to check in at midday. The hotel staff are very friendly and helpful as when myself and a friend went to our room, the kettle was missing so they moved us to another room. The location is great, bed is comfortable, room is basic but includes a tv, obviously a bathroom and towels. If you need an iron or hairdryer you have to collect it from reception.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Leigh-on Sea, United Kingdom", "Title": "“Good Location - But Was It OK?”", "Author": "SimonTony39", "ReviewID": "UR120305624", "Content": "Approached check in, \"hello you have a reservation for me, it's Mr M\" You will have to pay Â£10 extra if you want to check in now, checked time 14.25, when can I check in then, 14.30. Waited 5 minutes. Good start. Room ok, clean and functional albeit don't expect a view from the window, come to think of it no matter what room you have in this building, all you will see is a mass of concrete buildings very close on all 4 sides. There is no air conditioning and if you do open windows for some air, then you will suffer from rather busy through trafic, especially commercial vehicles. Depending on which way you go on leaving the hotel you will either end up very close to Liverpool Street which is very convenient for onwards travel to West End and just down the road from Spitefields Market with great selection of shops, antique stalls and bars and restaurant's. However if you go the other way, you will end up very close to a rather less pleasing run down area where I found myself feeling very uncomfortable walking in the daylight let alone what it would be like after dark. Facilities in the hotel are basic, small bar area and cafe, don't expect quality cuisine. but in fairness it's not that type of hotel. I felt it was more geared to back packers and it reminded me of my days spent in youth hostels abroad. Sorry to also say that the staff were rather distant, and found it difficult to understand them at times even when asking for basic information. At Â£120 per night accommodation only, puts this hotel in same bracket as more pleasing hotels with far better service, comfort and setting. So my first experience of this hotel, will be my last. I am sure that other Travelodge Hotels are better and I will if needs be try them, but my recommendation would be to seriously look at alternatives in this area of London.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Poor place”", "Author": "Wolves42", "ReviewID": "UR120303924", "Content": "I booked in and the room had no bathroom light and a broken window. Informed reception at 7.30am and when I returned at 7pm the issues were neither fixed or recognised. the staff in the bar however are great", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Health & safety was not their main concern!”", "Author": "AngelNE", "ReviewID": "UR120210974", "Content": "Firstly I was given the key to a room that had not been cleaned, I was quickly moved to another room. The door handle of the bathroom was extermely loose, the walls were very marked and dirty and the oevrall room was run-down and didn't feel particularly clean. The worse thing was when I asked to borrow an iron (which you can only do for an hour at a time!). The iron had gaffa tape around the wire and the ironing board cover had huge holes in it. I took it back to reception and demanded they throw the iron away. I wouldn't care but it was the cheapest looking iron I've ever seen and can't believe they would risk people's safety for the sake of replacing it. At Â£110 for the night it was a complete rip-off. The only redeeming features was the excellent location and half of the staff were very helpful.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“lovely hotel with excellent staff”", "Author": "nyatili", "ReviewID": "UR120168305", "Content": "This was my second stay at this property. Rooms were very clean and as usual the staff were excellent. requested room 401(stayed here last time) which is in a pretty quiet location and was lucky enough to get it. Nothing is too much trouble for the staff to deal with and Skeeter at the reception is a credit to this hotel. When in london, will definatetly stay here again!", "Date": "November 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Venlo, The Netherlands", "Title": "“Nice place, but”", "Author": "yizzll", "ReviewID": "UR120109532", "Content": "This is a nice place. We got a room for disabled people because the other rooms where full. The room was very large (dont know about the normal double rooms) The room was clean. Bed was okay. I slept well. There was no noise from outside. Cleaning could be better. Bathroom was very large. We got new towels every day (4 pieces for 2 people) The location is great. 2 minutes walk from liverpool station. The hotel is in a busines area. In the weekend very quiet but from mondays a lot of people in suits getting there lunch in the little park across the street. But as you can read in the title there is a BUT. The staff was very very very rude. They where never in the lobby, you had to press a bell everytime. If you pressed it they werent very happy that you did. They where not helpfull. Not nice AT ALL. They never said hi when you came in, never said bye when you went out. Everytime I asked something they wouldnt even look at me and said I dont know. Overall a clean place, good value for youre money. Dont ask something at the staff and youre stay will be okay.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hull", "Title": "“Not bad”", "Author": "gilliandyson", "ReviewID": "UR119978555", "Content": "The hotel benefits from being in an excellent location, walking distance from Liverpool Street, Brick Lane and Spitalfields. There's also a really good (very busy) Italian-run cafe next door for breakfasts, and a supermarket and newsagents too. Despite the exterior of the building appearing modern and well kept, the interior is shabby and in need of some tlc. The lift was really really slow (we thought it had broken down). The room was familiar - I've stayed in a few Travelodges! Again - getting shabby, but bedding was clean and room smelt fresh. There was only one plug socket working however, and there was no mirror anywhere near a plug socket. I would recommend this hotel for business or short stay use - but not for anyone intending to spend time in the room. I want to add- why does a London hotel not have a left luggage facility? Travelodge charge a lot (as a percentage of the room price) for early check in - this is really cheeky!", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "ireland", "Title": "“A good hotel”", "Author": "dgosul", "ReviewID": "UR119789004", "Content": "Stayed here Monday night, very convenient for the train station, the usual travelodge set up, basic & clean. Would stay here again.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ipswich, United Kingdom", "Title": "“Average hotel in a convenient location”", "Author": "Tripy_777", "ReviewID": "UR119762975", "Content": "This hotel is located just within 7 mins walking distance from Liverpool Street Underground station. Apparently this is the only positive aspect of the hotel. However this hotel is not bad though. You get what you have paid for. Hotel was clean and tidy. The toilet and shower room were big enough. But only 1 bulb was lit out of 2 in the toilet However there was no fridge, no iron box and no hair drier available in the room. Also no toothpaste, shampoo, shower gel and hand wash. They gave a small soap for both of us and we had to live with that. Hotel will charge you extra to serve the breakfast. They allow you to check-in only after 15:00 and check-out before 10:00, they will charge extra if you fail to do so. To summarize: If you are not very familiar with London and looking for a budget accommodation, then go for this.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "argyll", "Title": "“quiet and comfortable”", "Author": "jackgr", "ReviewID": "UR118923669", "Content": "I have stayed in several Travelodge hotels and this was in a quiet location unlike some of them. I chose this as i had an early morning flight from Stansted and the hotel is close to Liverpool st station for the Stansted Express. The menu in the bar is rather limited but there are a couple of pubs closeby which do food.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "The World", "Title": "“Great Location”", "Author": "TheRoamingJoe", "ReviewID": "UR118665950", "Content": "Had an early flight from Stansted one morning, so decided to stay the night before in London, with the Stansted Express train running from Liverpool Street station, this hotel made perfect sense. Typical Travelodge, arrived quite late and nobody appeared to be on reception when I came, but came soon enough when I rang the bell, I advised I would be leaving early the next morning, to which I was advised would not be a problem. Would stay again.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Cheap, but clean and in a really great position.”", "Author": "TheMrMatt90", "ReviewID": "UR117929427", "Content": "It's a cheap hotel but it's clean and the position is really great, it's located on \"The City\" the financial neighbourhood, so it's quite and secure, Liverpool Street Station is really near so you're connected with the underground and the trains, there are good pubs and restaurants too.", "Date": "September 11, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“No where near as nice as travelogde Waterloo.”", "Author": "Zlm90", "ReviewID": "UR117855952", "Content": "We had 4 rooms as there was 10 of us.. Each room had one towel so we all had to go ask for more. Each day we was still only provided with one towel but it wasn't much of a problem getting some more. Breakfast was okay, but the evening meal was a joke. We ordered a soup (obviously powdered) and it was far too salty to eat which came with 2 slices of hard bread not a bread roll. The nachos was fine. Garlic dough balls were Â£4 and when they came there was only 4 on the plate. We also order chilli prawns, which was supposed to come with a salad. The waiter gave us a quarter of a lemon and half a tomato and told us that was a salad. We was refunded for the dough balls and prawns. The room was okay, was a little warm at times but kept window open and it cooled down.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "PDX", "Title": "“Nothing Great - But What Can You Expect For the Price”", "Author": "ukkylie", "ReviewID": "UR117802278", "Content": "We stayed here for one night after a rather long flight. The hotel is a little difficult to find (if you don't know your way around). the staff are friendly and helpful - though they will push you to eat in their bar / restaurant. The wi-fi access is expensive (unnecessarily so) and the rooms are small, A room for 3 people included a double bed and what we thought was a pull out sofa - turns out it is just a sofa with a sheet throw over the seating area. There is no air conditioning whatsoever anywhere in the building and the windows barely open - this makes it almost impossible to sleep in summer time in London. The bathroom was not clean when we arrived - toothpaste was spilled down the front of the counter, there was also a sticky substance on the bed side table. The restaurant is outrageously over priced and there is little around the area of an evening, if you want to get a bite to eat - that isn't KFC or McDonalds / Burger King. There is a pub down the road a little and as most of the patrons usually are our on a Friday night (this is the night we stayed) you can hear an incredible amount of noise up until 1:00am - despite the windows barely being open! I can recommend it for really, really cheap accommodation but I am glad we are not staying there upon our return to London.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "5", "Service": "2"}, "AuthorLocation": "birmingham", "Title": "“Usual Travelodge, bit noisy but great location”", "Author": "BirminghamMouse", "ReviewID": "UR117630275", "Content": "I have stayed at many Travelodges in London. In terms of location this one is great - just off Bishopsgate and near Marco Pierre White SteakHouse . But next to a block of council flats you get noise ( I really dont care who is paying whose rent but dont want to hear it at 1 am). Staff friendly, place clean, just a bit noisy if you have the window open - which you have to if you dont want to suffocate with the heat.", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "2.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Cheshire", "Title": "“Cheap and not so cheerful”", "Author": "Digby98", "ReviewID": "UR116806987", "Content": "We stayed two nights here in August 2011 and to be frank chose it because of the price - around Â£100 for two nights, which is good value for central London. However, a lack of ventilation to the corridors results in a stale smell and the internal noise from doors shutting was consistent. The room was small and the window handle was missing. This was fixed through use of a spoon handle but window restrictors meant little air came into the room and there was no additional ventilation. The heat was pretty unbearable, even on the cooler of our two nights, but when the window was open the drone of machinery from local buildings was constant which, along with noise of people from the street and early morning rubbish collections (before 8), meant poor quality sleep, even after having sampled Londonâ€™s nightlife. There was no bath but as with Most Travelodgeâ€™s, rooms were clean and staff efficient. Unlikely to stay again.", "Date": "August 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“A great base to go sightseeing in London”", "Author": "Namruts", "ReviewID": "UR116643829", "Content": "We stayed at this hotel for 4 nights august 2011, yes it's basic but for the price it's fantastic value. We had a family room and ate breakfast in the hotel everyday, the food is good with a nice choice of items but the cafe area in which you eat is not big enough which means there are not enough tables and chairs, the waitress tries to keep on top of everything but she could do with an extra pair of hands. The hotel is located in between Liverpool street and aldgate stations and can be walked to either in 5 mins. It is a basic cheap central London hotel i would stay here again.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Wrexham, North Wales, UK.", "Title": "“Provides what it says on the can.”", "Author": "Prince-of-all-men", "ReviewID": "UR116630406", "Content": "Stayed at the Liverpool Street Travelodge for 5 days. It provides cheap and cheerful accommodation, a place to sleep and not much more. Others have slated this Travelodge but as we only needed a place to sleep at night with breakfast in the morning it suited us just fine. Its no frills but that is what Travelodge provides a room a bed and a bathroom. The hotel is slap bang in the middle of the financial area of London and a stones throw from the \"Gherkin Building\" and close enough to walk from either Liverpool St train station or Aldgate tube station. The area felt very safe even when we walked back from the station at 11pm after taking in the theatres. The staff were mostly friendly but as the hotel was packed full the evening staff were a bit rushed off their feet and when we asked for some more towels and pillows they could not get them for us (a family of 4 in a family room with only three towels and two pillows was a bit off putting). All was rectified the following day after asking a couple of more times. The bar / cafe is very small for such a large hotel and breakfast was a bit of a battle ground to find seating and a game of musical chairs, breakfast consisted of any cereal you would like tea coffee fruit juice and sausage/bacon/scrambled egg and beans each morning. Good enough to fill you up for a hard days walking around London and eat as much as you want, so you cant really complain. Variety is not on the menu. Room was showing its age a bit and had a few loose fittings and a missing light bulb but again cheap and cheerful and the bed was comfy. Would have benefited from air con as it only had a small window so was a bit warm at night . Be careful of the lift it is up 5 stairs (there is a wheelchair lift) to access it, but it has a mind of its own and seemed very reluctant to open its doors when you reached your floor, the kids thought it was hilarious. All in all it provides cheap accommodation for a trip to London and the theatres with breakfast in the morning, nothing more or less.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Hinckley, United Kingdom", "Title": "“OK But Basic”", "Author": "Stu31", "ReviewID": "UR116473171", "Content": "Stayed at Liverpool Street Travelogue for a weekend Was OK clean and very basic room was clean but not the best Hall ways smelt damp and very warm no air to circulate Food was OK but not the best Cheap Don't think will stay again.But was cheap so did not expect much", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Not up to scratch !”", "Author": "HJA63", "ReviewID": "UR116370559", "Content": "we booked 2 rooms at the same time, they put 1 of us on 1st floor & the other on 6 ! Apparently they don't automatically put you together when you book together; luckily I hadn't taken the children ! The boiler was going all night & then we awoke- not that I slept , to NO hot water. There was only 1 bath towel in the room. Our room was changed & the nights stay refunded, we were then put on floor 1, a lot better but still only 1 towel. Room was clean but with cracked sink & terrible bed in which we spent the night rolling into the middle .Poor Travelodge, very poor", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "merseyside", "Title": "“Nice hotel for what we paid”", "Author": "MerseysideSam", "ReviewID": "UR116316154", "Content": "Our room was clean, maids come in everyday with fresh towels and refill tea + coffee. Room only has a tiny window so it did get very hot with 2 adults and 2 children sleeping in the same room needs air con or ceiling fan ! We had breakfast and tea in the hotel food was lovely the chef is friendly and fast, it takes abit of time trying to order food as the lady is abit dizzzy but nice, there was one night my husband was still ordering the food for 4 of us, he hadnt even paid for it and the chef had put the food on the table ! Again the lady at breakfast is nice just dont expect her to rush to give you ur breakfast plate. You need to give her your room nimber then you will be given your breakfast plates, just know one tells you this ! The lift broke while we was there but it was fixed the same day. Before we arrived the hotel had, had a leak on the second floor ( our floor) so the landing didnt smell very nice but they got cleaners in to clean the carpet and it helped with the smell. They acted fast on anything that went wrong i cant knock the hotel for that.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "norwich", "Title": "“Very good for the money.”", "Author": "deank", "ReviewID": "UR116157303", "Content": "Stayed here for for a night whilst going to see War Horse, on entrance it does look tired but once in and being greated by some of the nicest, welcoming and friendly staff we have ever experienced really, really made up for it. Every member of the team were so happy and it really showed they enjoyed there job. Ok, its not the ritz, but nor is the price. I would and will deffintly go back.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Ireland", "Title": "“Basic and does the job”", "Author": "Marse86", "ReviewID": "UR116120247", "Content": "Stayed at Liverpool Street Travelodge as I often do when in London and I personally think it is always fine. It is not the Hilton, and you won't get anything above a bed, a toilet, and a shower, but what more do you need? Always find the rooms to be clean, and big (anytime I have stayed in Liverpool Street, other Travelodges wouldn't let you swing a cat). Very near Liverpool Street Station, and for the price you can get it at, I would recommend. If you only want a place to sleep at night, then this is just fine. It does get a bit warm at night though, could do with better air con.", "Date": "August 1, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Halifax, United Kingdom", "Title": "“Ok if you get a good deal”", "Author": "Tones-and-Sue", "ReviewID": "UR115927267", "Content": "Stayed here for 4 nights last year around general election time. The room reminded me of student accomodation, it was dated with a poor quality bed. The shower was dated but this was a good thing - it was really powerful unlike the the newer water saving ones! Getting breakfast was a pain, each day we had to go to reception to purchase a breakfast voucher which we then handed in at the restaurant - a funny carry on! No complaints about the brekfast itself though. Greeat location - a short walk to Liverpool Street station and close to the Gherkin. If you get a good rate it is worth staying, but if you are paying full price, as we did, then it is worth paying a little extra and staying somewhere else.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "1.0", "Value": "4", "Service": "1"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“DO NOT STAY AT THIS HOTEL”", "Author": "rhymas", "ReviewID": "UR115856265", "Content": "We stayed in this hotel overnight and would not recommend to anyone who is looking for a short budget break. The bathroom had cockroaches in and in the morning when we informed them they didnt hessitate to give us a 50% rebate. When we got home we decided to write a e-mail of complaint... We were informed that in no uncertain terms thst we were not being believed and when i sent a e-mail back saying i still wasnt satisfied with there response they informed me that unfortunatly they had investigated and the matter was now closed.A large company with terrible customer complaints ... terrible", "Date": "July 27, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Colchester", "Title": "“hotel needs some TLC”", "Author": "ThelmaandLouise50", "ReviewID": "UR115758635", "Content": "I know this is part of a budget chain but I have stayed in other Travelodges that are much better than this. Only one staff member at reception at busy check in times causing long queues.. Carpet in room dirty. Light bulbs and sink plug missing (when complaint was made we were told that these problems could not be rectified as there was no maintenance engineer at weekends). The only solution would be to move to another room but this one had similar problems. Piles of dirty linen left in corridors. Tables in restaurant area all needed clearing. Plates for cooked breakfast only handed out on request and staff were not always there to hand them out so people queueing. This hotel would be fine if there was any sort of management to deal with problems.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Nearly a great hotel & location”", "Author": "DBenedict", "ReviewID": "UR115695744", "Content": "Ok, so I stayed here for one night so I could attend a meeting the next day. The hotel is located virtually next to Aldgate tube station which is perfect for getting into the heart of London. Aldgate East is a five minute walk around the corner if you want to use that one instead. On arrival, the receptionist was a bit narky with me as he couldn't find my booking even though I gave my name three times, each time spelling it for him but, instead of listening to me, he just ignored it and got more annoyed. Eventually he found it and I got room 315. It was easy enough to get to the room, lift or stairs, and the room was very clean and tidy (a lot better than the Farringdon I stayed in last year) and everything worked. The only grippe was that the shower sprayed everywhere! Even with the shower curtain in the cubicle, it still got on the floor but not a major issue. The other problem was that there are some bars close by which got very busy. This was a friday night so it may be different on other nights of the week. Anyway, this is good if you want a night out close to the hotel but if you want a good sleep then it might hinder it as a lot of noise could be heard. The bed was more comfortable then expected though! So, the room itself was great but the receptionist and the loudness brought it down a bit. The price won it for me and if you were going for a short break then it might be a great option with the closeness of the tube and price.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "durham", "Title": "“better than expected”", "Author": "businesstraveller078", "ReviewID": "UR115368708", "Content": "Was apprehensive after reading a mixed bag of reviews. But booking late, at the rate my company would pay and clashing with an event in London, this was all I was left with. Very close to Liverpool St but when reading the directions on their website replace Virgin store with Tesco Express. Pleasant staff on reception. One of the refurbished Travelodges (done in the blue decor like the TV advert). Check in and check out very quick and none of that nonsense about taking a card swipe for extras. Vending machine with sweets, pop & water at reception. Found the room clean, fittings all clean and in good working order, bathroom (only shower) clean apart from shower curtain that trailled in slow draining shower tray which showed the classic signs of not being able to dry out properly. Good shower and plenty of hot water. With it being in the financial district very quiet after dark so got a good night's sleep. The only gripe I have is that the mattresses in Travelodge don't have a protector on them - best not to dwell on that! Room could have been on the warm side if outside was one of those hot sticky nights as no visible sign of fan etc but window did open (with safety restraints) so probably not too much of a problem. Corridors might give wrong impression of a place in decline but this is what Travelodges are about - no frills. Plenty scuff marks but with the probably high turnover only to be expected. Breakfast hit the mark for me although I don't partake of the cooked stuff - yoghurt, grapefruit, toast, cereals and they have Earl Grey tea! Help yourself so can't grumble. Plenty of pubs and eating places in short walk distance - we went up to Spitalfields Market which offered loads of choice (mostly chain type) but other independents on offer on streets surrounding location - depends on your price target. All in all, changed my opinion of Travelodge and after saying I would never set foot in one within London again, I would return to this one.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Stratford-upon-Avon, United Kingdom", "Title": "“Happy staff -) & good value for money”", "Author": "starjohnday", "ReviewID": "UR115095047", "Content": "This is a hotel that has a really good location to the sites and transport link's (Liverpool st less than 10 minutes away) the staff are friendly and helpful. The room is a standard Travelodge room, which was clean and basic. It did have a kettle and tea making facilities though. There is also a cafe on the first floor. There is a cafe next door that does a variety of really good traditional breakfasts, now it is not fancy but if you are looking for a good filling cooked breakfast this is the place to go. If you want cash point facility there is one at the back of the hotel.", "Date": "July 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Exeter", "Title": "“Friendly staff, basic but clean - just what you expect”", "Author": "MariaNExeter", "ReviewID": "UR114153293", "Content": "Always a bit of a gamble, especially with such mixed reviews but we were pleasantly surprised. Staff very friendly and welcoming. Room as you would expect - basic but comfortable and clean; also quiet which was a bonus. Unfortunately no cold water so reported it at 12.00 and receptionist thought it was just a washer needed replacing and said she would get someone to fix it - how efficient we thought. Only to return at 2330 sans eau. Receptionist said he would get us a jug of water which didn't materialise so husband had to go down again and requested some bottled water out of the machine. After a little negotiating, this was delivered free to our room 5 mins later - a room change at this time was not on the cards! All in all though, we were pleased with the service and location. Price a bit steep at Â£107", "Date": "June 18, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "new york", "Title": "“Great location, clean and bed comfortable”", "Author": "belanger500", "ReviewID": "UR114147051", "Content": "This is in the Financial district, bed are comfortable, bring your shampoo and amenities as not included for Travelodge. Breakfast available and easy check in and checkout. Elevator. This is a 3 stars hotel but my stay is always comfortable and consistent.", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“quite sressed under presure”", "Author": "mantabr0ther2", "ReviewID": "UR113665608", "Content": "we had a pleasant stay here for two nights when we arrived the man on the front desk was fantastic as we had travelled down from norwich by train we booked two rooms and one early check in we knew we were two early but as we were there for such a short time we asked if he had one room ready we could leave our bags in he rand around the hotel and sorted this he was fantastic he was called silvester. breakfast on the first morning was ok but they had no sausage left by the time they came for me the rest of our party was finished not the same saturday morning though there were no fruit juice glasses no bowls no ceral the chap i charge looked so stressed they know how many people have booked breakfast surely this can be sorted better", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Scotland", "Title": "“Does what it says on the tin”", "Author": "ScottiePaul", "ReviewID": "UR113466691", "Content": "Pretty basic travelodge, could do with a paint and a new carpet but for a short stay in the centre of London it was fine. Easily reached from London Liverpool Street and plenty of restaurants and bars round about.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Convenient location, basic minimum service”", "Author": "Senex81", "ReviewID": "UR113373011", "Content": "The hotel has pared down its services to an efficient basic level. Check-in is simple. The room was clean, but with only one set of towels, one extra pillow, one small soap and two plastic cups. The light over the sink was broken. I suppose Â£100 a night for bed only is what you have to pay for budget accommodation in the City, but it felt like a minimum level of customer service. It must be worth having shares in Travelodge.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Northern Ireland", "Title": "“Everything We Needed!”", "Author": "littleme21", "ReviewID": "UR112936178", "Content": "Me and my partner decided to book a few days in London towards the end of May 2011, start of June 2011. We wanted a good base for exploring London, a central hotel that didnt cost too much and the Travelodge Liverpool Street provided that. This hotel is in a great location, it is literally 5 minutes walk from Liverpool Street Station, across the traffic lights and down the street. It is central to the tube/train stations and a number of eateries and bars. The member of staff on reception during check in was friendly..He provided us with a map of London and recommended some places to eat. We got checked in quickly and up to our room. The room, as with all Travelodges, is basic, but clean and tidy. The room was cleaned everyday for our 3 nights stay. The room was extremely warm at night and we did need to leave the windows open, which did result in some noise from outside. However I know the Travelodge cannot be held accountable for what happens outside the hotel. The room was comfortable, the bathroom was clean and other than the temperature, I could not fault it. We were in the hotel bar just once, again this was basic, but clean and tidy. The staff manning the bar were friendly and cheerful, however did not have much knowledge about prices of drinks, they did have to go and find another member of staff. The carpet was also slightly sticky. Bar service is maybe something to be improved on but we didnt spend much time there, so cant really say a lot. We didnt eat at the hotel either, so cant comment on that. Overall, we had a relaxing and enjoyable break in London. The hotel was everything, I expect clean, comfortable and friendly staff....I would recommend it to friends and if was visiting London again, wouldnt hesitate to book this hotel.", "Date": "June 12, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "2", "Service": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Worse than a University Campus Dorm”", "Author": "selinabaybee", "ReviewID": "UR110934377", "Content": "I went to stay at the hotel with my boyfriend for a one nights stay because we was planning to go out for my birthday in central london and we liked the transport links in Liverpool street so we stayed here.... DON'T GO TO THIS HOTEL!! 1. It is in a corner alley way kinda road secluded from the main street and is kinda intimidating to walk through at night time. 2. When we got there they said they didn't have are names booked on the system and forced us to spend money on the hotel computer cafe to log on to my hotmail to show proof, after we showed proof on the computer of our email confirmation we did not get any apology from the receptionist for the misunderstanding. 3. The hotel needs alot of work from the reception up to the rooms the corridors to the room are stuffy and have a mild scent of B.O 4. the room is basic and the shower had rusting and fungus in the corners I wish i took a picture to show everyone. 5. receptionist are very unhelpful 6. THE VIEW OF THE HOTEL IS OPPOSITE A OFFICE I didn't realise till after when I had finished showering that I can see the office people who could have potentially seen me naked!!!! I WILL NEVER NEVER GO THERE AGAIN i am not fussy I have been to other travel lodge hotels and was satisfied I was not expecting a hilton hotel but this should be a 1 star hotel...", "Date": "June 1, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cheddar, United Kingdom", "Title": "“Served a purpose”", "Author": "sbarrett91", "ReviewID": "UR110666212", "Content": "After reading mixed reviews on this travel lodge me and my partner decided to 'risk it' and take advantage of a Â£30 room on a sunday night in May. We don't expect much from a travelodge room given the prices we pay however we do expect the room to be clean. We were 'greeted' by a receptionist who treated us as an inconvinence which wasn't a good start! Upstairs in our room we had a 'complimentary' magazine that had obviously been left by the previous customers and some sweets all over the dressing table. Not a good start really. On checking the bedsheets were stained with what looked like blood and the pillows with black smears which looked like oil/grease. The walls were even dirty in places I didn't know they could get dirty! Off I go to 'brave' the bathroom and I find half a bar of used soap on the floor of the shower - didn't fancy washing my hands with that! We sorted out what we could and slept after getting in from a night in chinatown (worth a visit if you're in the area!). We had a fairly good nights sleep, a bit stuffy but after having the windows open for a bit we realised that the drunks would not let us sleep like that! There are currently roadworks going on so if you decide to stay here use the aldgate tube stop not the liverpool street one! On checking out we complained but were not understood by the staff - something to do with our strong somerset and bristolian accents maybe? I will be sending a letter instead! I wouldn't recommend this travel lodge to anyone visiting london however I would recommend the snaresbrook travelodge and also the Kingston upon Thames travelodge! Worth noting that we werent brave enough to eat in the restaurant so can't comment on that!", "Date": "May 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Durham, United Kingdom", "Title": "“Great location, comfortable, but a bit frayed around the edges”", "Author": "cazzzie987", "ReviewID": "UR110313329", "Content": "We needed an affordable hotel for one night in London. At Â£80, this Travelodge fits the bill. It's only a few minutes from Liverpool St station, so getting there isn't taxing. Sadly, if anything lets it down, it's the standard of decor in the rooms; nothing major, but our room could have done with a refit - veneer was peeling off the bedside table, the walls were in dire need of a repaint and the bathroom was a bit tatty. Not the end of the world, though and if you're after somewhere to lay your head at an affordable price in Zone 1 then you could do much worse.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "scotland", "Title": "“Good deal”", "Author": "edinburghandglasgow", "ReviewID": "UR110191874", "Content": "Cheap cheerful good enough room Interesting location near to Petticoat Lane and Spittalfield Market lots of place to eat round the University Near to tube and easy journey from Kings Cross/Euston. A little bit tricky to find from tube so check map but once found takes only a few minutes to walk to Aldgate or to Liverpool Street station.", "Date": "May 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“Great place to stay, but...”", "Author": "UsernameNotFound", "ReviewID": "UR108883191", "Content": "Whenever I travel anywhere, I always book to stay in a travelodge and I've never been disappointed. That's not to say I was disappointed this time, but I wasn't as happy as I could have been. I travelled to London for a birthday weekend with three of my friends. We decided to book two rooms, and because we arrived early, we checked into one room earlier but did't check in to the other one until 3pm (which is fine, I knew this already). What I was disappointed with was that out second room was about six floors above our first room! I was under the impression that if I book more than one room, they would be together? Apart from that little problem, any travelodge is a nice place to stay! Of course it's basic, but it's perfect for those who just need a few hours sleep while spending the rest of your time out and about exploring the wonderful city that is London.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Exeter, United Kingdom", "Title": "“Good Location, Suitable for short stays, Extremely helpful staff”", "Author": "Eleanorfayelucy", "ReviewID": "UR106079125", "Content": "The room was fine, beds and linen were clean, you pretty much get what you pay for. It is basic, but suitable for all customers (I visited with my boyfriend and used it as a place to just rest our heads after being out and about in London). Great location and really short walking distance to more than one tube station. The staff couldn't do enough to help me when i left my ipod in my room and was unable to return to london to collect it. They kept in contact with me about the post and were genuinely really helpful.", "Date": "April 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Llantrisant, United Kingdom", "Title": "“Nice Enough if you aren't expecting too much”", "Author": "Dirne72", "ReviewID": "UR103870569", "Content": "Itâ€™s a Travel Lodge so you know what to expect. Tidy and clean but basic and functional room. A bed, TV tea and Coffee making kit thatâ€™s all you want or need out of a place like this. The window in my room did lack a handle so at first I couldnâ€™t open it (on the hottest day of 2011 so far) but thatâ€™s when the tea and coffee making facility came in handy as I managed to use the spoon as a makeshift handle and jimmied the catch open. Bath room worked, water worked and there were plenty of clean soft towels. Breakfast was in a small cafÃ© type of room on the first floor, self service with everything you could want really. Have to especially say that the guy on reception was friendly with a big smile was pleasant to deal with both in booking me in and serving breakfast with the same big smile!!", "Date": "April 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Ok for the money”", "Author": "salbot", "ReviewID": "UR103622425", "Content": "We stayed here for 2 nights over a weekend. The hotel was clean and the rooms were fine. The bed was really uncomfortable which caused us to have a bad nights sleep - it was so bouncy, whenever one of us moved it woke the other up! The shower tray filled up when taking a shower. Overall it is a cheap option in London - the location is great. 2 mins walk from the tube. Oh - note to hotel - tell your staff to lay off the hard sell on the breakfast! We should only have to say once that we don't want to buy breakfast. We were bombarded with reasons to buy breakfast about 4 times! We said no the first time.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Port Elizabeth, South Africa", "Title": "“the stay was great, easy, no problems affordable”", "Author": "steven080", "ReviewID": "UR102138179", "Content": "A good place, central, near station, close to London city Centre, no noise, seems safe, affordable with good service and assistance, very much recommended.", "Date": "March 30, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Exeter, United Kingdom", "Title": "“Nothing to get excited about”", "Author": "stanlion", "ReviewID": "UR100055712", "Content": "All around the hotel, and in our room, there were lovely little pictures of people sleeping peacefully and contentedly - the implication being that the hotel is so comfortable and quiet, you will soon be drifting off into Nodland. A shame, therefore, that the windows are only single glazed and that London, even in the City at the weekend, never really goes quiet. Whilst my earplugs ensured I got a fair bit of sleep, there were plenty of drunks outside shouting to ensure that both I and my partner were frequently disturbed. The room itself was clean, the bed and pillows just about passable but it all felt pretty basic - well that's a Travelodge, I suppose. I had no contact with staff at all and felt I would have been hard pressed to find someone had I needed them. I have stayed in luxury hotels elsewhere in the country for less than this and had breakfast. It is pretty poor that so many hotels seek to charge you an extra extortionate amount for a few bits of egg and bacon.", "Date": "March 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "uk", "Title": "“Shabby but functional, just!”", "Author": "taichichick", "ReviewID": "UR99487973", "Content": "This hotel is considerably more shabby than it was just six months ago for my last visit. Toilet bowl was cracked, broken tiles in shower were grotty and dangerous, bedroom window didn't close properly so cold and noise were problems. Breakfast was unappetising, with scrambled eggs that looked like they were from a dried egg mix, and rubbery greasy bacon.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Coventry, United Kingdom", "Title": "“As expected”", "Author": "DontCareAboutName", "ReviewID": "UR99346521", "Content": "Another Travelodge that didnt let you down on the companies promise - simple, affordable rooms. Dont expect a marriott or hilton and you'll be happy enough.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Berlin, Germany", "Title": "“Absolutely disgusting place - avoid it”", "Author": "JuWe", "ReviewID": "UR95607044", "Content": "On checkin the \"system\" was down, so an employee who had no idea had to let us (a group of about 15 people who wanted to check in) wait until someone who had an idea would arrive. Luckily, this person arrived about 20 minutes later................ So checkin into room 201 happened then. Room was quite small and with basic furniture (that has seen better times already). A very soft mattress on a bed, that made squeaking noises on every slightest move, but contrary to that the pillows were solid as rock. Same was the thick limescale that was residing in the kettle, as it was on the bathroom facilities. But the worst was the black mould that was resident in the shower - wins the price for the most disgusting feature in the room. As I had paid in advance (never again with a travelodge, big mistake) I tried to sleep, but on a Saturday night it seems its a place where drunken idiots and noisy cars seems to be present all night....... Location is good ( close to Liverpool Station and Brick Lane entertainment venues), but I would only return if they burn that whole place down and rebuild it - and not let it be managed by travelodge again. Most disgusting place that I have stayed in for a long long time.", "Date": "February 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Oxfordshire", "Title": "“One of the worst budget hotels I've ever stayed in - terrible”", "Author": "jumpingjon1975", "ReviewID": "UR95372892", "Content": "I've stayed in a number of different classes of hotel and in terms of condition and service this has to rate one of the worst! The room was one of the first on the corridor and the door kept banging all night with people returning to their rooms - Room hadn't been cleaned properly - A light bulb was missing from the bedside table - The remote control missing from the TV, to the extent a sticker was placed stating 'Please access the TV manual, apologies for no remote control'. (pretty much impossible as the channels are set up so far apart!) - Staff at the desk were unhelpful - No shampoo, shower gel and no assistance from the front desk - instead they offer things you don't actually need to be helpful Amusingly the website suggests they offer a great service 'Weâ€™re not in the business of disappointing' (well they went out of your way when I visited), 'which is why at Travelodge we now have over 360 hotels offering everything you need for business' (couldn't really be further from the truth, a wash in the morning is fairly essential in modern times) 'simple hassle free accommodation' 'Travelodge helps you feel better off not only in your wallet or purse but also by helping you to make your life a little simpler and less hassle'", "Date": "February 3, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Badly maintained rooms”", "Author": "Richie1974", "ReviewID": "UR94567771", "Content": "Stayed here as a cheap option as only wanted a bed for the night. Tried to check in earlier as we were going out in London for the day but were told we would have to pay Â£10 early check in fee before 3pm-not a good start! I haven't stayed in a Travelodge for several years and it would appear that this hotel has given up on providing basic clean rooms which is how I would have described the chain. I stayed in room 102 Positive points - The bed was actually pretty comfortable - Decent location Negative points - The carpet was filthy -visble dirt especially nr the bathroom entrance. - Bedside lamp not working-not even a bulb inside it! - No tv remote control - No toiletries (not even soap fixed to the wall) - Bathroom surface was badly stained near sink - Bathroom taps would not turn off! You had to twist them hard to try and turn them off it felt as though they would come off the basin. Overall a disappointing experience.", "Date": "January 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bedworth, England", "Title": "“Clean & Comfortable. Value For Money.”", "Author": "pajawa", "ReviewID": "UR94455729", "Content": "I was put off by previous reviews before and so stayed at other hotels. However this time we decided to \"give it a go\". I was surprised by the friendly welcome, clean rooms, breakfast and little to no external noise. While walking throughout the hotel to leave and return we come across cleaning, restaraunt, and porter staff who where ever so friendly. The service was something you'd get from a 4 star! Yes, we could find a few problems but nothing that affected our stay. We will definately stay there again!", "Date": "January 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Paris", "Title": "“Most uncomfortable bed ever”", "Author": "Parisfox", "ReviewID": "UR92902079", "Content": "The day after I stayed here I said to someone 'we just stayed in an awful hotel in London' and they answered, without prompting, 'Was it the Travellodge in Liverpool street?' Ok, so lets state the advantages first- it's cheap and it's central. So of course one expects no thrills. I was surprised that they had a policy of charging Â£10 for 'early check-in' if you arrive before 3pm. As there were 3 of us we booked a family room which is supposed to be able to accommodate 4. When we got up to the room it was only made up for 2 people. When we enquired they said if there are more than 2 people in the room the additional guests have to make up the beds themselves. Ok, but this didn't explain why there was only enough cups and towels for two people. I was one of the two people who was supposed to sleep in the main double bed but it was quite simply the most uncomfortable bed ever so I ended sleeping on the floor. The hotel was cold and there was a lot of street noise. Personally I wouldn't be inclined to stay here again. It was like the RyanAir of Hotels. I think if you stayed more than a few nights you'd be inclined to throw yourself out the window!", "Date": "January 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Moves around a lot!", "Title": "“The most uncomfortable bed EVER”", "Author": "Travelling_Cup_Cake", "ReviewID": "UR92891021", "Content": "I know this is a budget option, but I still think you should actually be able to SLEEP. The double bed in our family room was AWFUL (room 525 - if you get this room, ask to move!): springs sticking through and uneven. In the end my partner tried to sleep on the floor under his coat! We also were not impressed that, despite booking a family room for 3 people, the room was only equipped for 2 when we arrived: had to go down to reception (no phones in rooms) to collect ourselves extra towels, mug, duvet, pillow. Finally, we arrived at 2.40pm and were told we could not check in as we had not purchased \"early checkin\"!!! (checkin is at 3pm). C'mon.... It's not like we were trying to get access at 10am. All in all, a thoroughly unpleasant experience. Definitely would not stay there again. I stay in budget hotels a lot and this was by far the most uncomfortable night I've had in a very long time.", "Date": "January 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Trondheim, Norway", "Title": "“After all complaints : a surprise”", "Author": "Truffles21122010", "ReviewID": "UR91222374", "Content": "I have read more complaints than I liked, but on arrival and during our stay there for ten nights I am more than pleased. The rooms were clean, new clean towels every day, no traffic-noice at all, the hotel is in between office buildings and there was no noice from neither Bishopsghate nor Houndsditch /Aldgate. Safe area as there are no dodgy places/ pubs etc nearby. Staff: friendly, nice, helpful - one of the receptionists even speak German! We were recognized already shortly after check-in. Sorry - all complainers - I have got no complaints - a budget hotel is a budget hotel and if someone complains about a soap - o dear - buy it at Liverpool Street Station. By the way - there WAS a piece of soap in the bathroom !!. And I do know - I am going to stay there again next time London is on my schedule !! All the best to you all in Harrow Place !! Happy New Year.", "Date": "December 31, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Warwickshire", "Title": "“Awful - don't stay here!”", "Author": "TerryMWarwickshire", "ReviewID": "UR89493296", "Content": "As per other reviews, surely you should get a bar of soap in the bathroom and be able to deal with staff who can speak English. I can honestly say that this is the worst hotel that I've stayed in within the UK. For the money, I wish that I'd got a train home !", "Date": "December 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dundee, United Kingdom", "Title": "“Good Value Travelodge”", "Author": "ScottishTourist", "ReviewID": "UR87911672", "Content": "Just stayed at the London Liverpool Street Travelodge for the third time. If I'd paid attention to some of the reviews on here I'd probably never have booked it at all. At the end of the day it is what is - a Travelodge! We got a good price for our 3 night stay. The hotel is located just a few minutes walk from Liverpool Street Station. The staff we encountered on check-in and during our stay were friendly and helpful. The room was fine, again it is a Travelodge so if you book a Travelodge you know what you'll get. The room was clean, comfortable and fairly quiet. You will need to bring your own hair dryer. There are of course slight issues with the room - i.e. the bathroom taps were stiff and noisy, there was a slight crack in the basin and don't get me started on the shower curtain..... however the bathroom was clean and perfectly adequate for our needs. What else can I say? If you want somewhere reasonably cheap (for London), easy access to transport or walking distance to Brick Lane, Shoreditch, etc, then give it a go and make your own mind up.", "Date": "November 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Coulsdon", "Title": "“Yuck”", "Author": "MrAKW", "ReviewID": "UR87532023", "Content": "I booked this \"hotel\" as its close to the office and I thought it'd be good value for money if basic. As it turned out Â£98 for the night without breakfast even when booked a couple of weeks in advance. The room on the 3rd floor was scruffy at best with poor decor, bulbs missing from light fittings and a less than average bathroom with similar decor. The window didn't shut properly so there was street noise throughout the night. On booking in I found a large pile of used sheets and towels just outside my bedroom door and this was still there the following morning when I checked out. We'd joked in the office about this \"hotel\" charging by the hour and my stay didn't do much to change this opinion. Only when leaving did I put rubbish in the bathroom bin to discover that it hadn't been emptied from the previous guest's stay and still contained a used condom and soiled sanitary towel. The \"hotel\" itself is in a poor condition - the lift left me wondering whether we'd make it to the 3rd floor. All I can say is never, ever again!!!!!", "Date": "November 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "San Jose CA", "Title": "“Poor staff”", "Author": "nicolast", "ReviewID": "UR87145501", "Content": "Arrived at 2.45pm and the man behind the desk was very rude and would not let us check in till 3pm. I asked to print something out and was sent on a wild goose chase to Liverpool Street station! Did not manage to get it printed. It comes across here that the staff dont like their job! After check out I realised id left the Sat Nav at the side of the bed when I rang up to ask them to put it to one side and id go back I was told there was no Sat Nav in the room. I assured them 100% there was and exactly where it was. I am yet another person who has been robbed from at this hotel (see previous reviews)", "Date": "November 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“Typical Travelodge..Just Fine for What Its Meant To Be!!”", "Author": "WILLYONE", "ReviewID": "UR83950715", "Content": "Stayed here for just one night, i was attending the Brandon Flowers gig at The HMV Forum but as i was returning to Norwich from Livepool Street thought i'd stay close by so as not far to go in the morning. Got the room for Â£29 plus i added the breakfast for Â£6.50 which is normally Â£7.50 but if you book on line you get a quid off! All in all i have to say that i found it to be just fine. Got checked in quickly, was given my breakfast voucher and after being told about breakfast times etc i was soon on my way to my room. The room was an average size, very basic but clean which is the major thing we all want. Small LCD TV..The remote didn't work as one or two others have said, but there are buttons on the top of it so it can be worked manually! Bathroom ok..Toilet, Shower...not much else!!!! No smellies..be warned!!! But i guess i'm the same as numerous others and always take their own anyway. Security wise..You need your key to access the rooms and lifts etc which is good. The hotel is only a few minutes walk from Liverpool Street Station so can't see any issues there! Breakfast was good..Nice selection of hot and cold items. You can have as much as you want! Room not very big so there could be problems at certain times! Generally i was very happy to stay here..Would i stay for longer? Originally i probably would've said no..But after staying there i think i could! All in all suprisingly impressed!!!!", "Date": "October 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "suffolk", "Title": "“Reliable budget option”", "Author": "longliein", "ReviewID": "UR82621636", "Content": "Three cut-price stays have all satisfied. A touch battered but meets basic needs for comfort & cleanliness, peaceful mornings at weekends. Great location minutes from Liverpool St. Staff always friendly & efficient & happy to dole out extra tea bags and milk. Always been able to push the checkout time back an hour or so without asking. Handy convenience store around corner in Middlesex St, great if pricey breakfast options in nearby Spitalfields.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Worst experince ever - no running water and exceptionally rude staff”", "Author": "B6NG6C6T", "ReviewID": "UR81958765", "Content": "I booked a double room at London Liverpool Street Travelodge arriving in August 2010. I was booked into a double room on my arrival and tried washing and cleaning my teeth before retiring to bed. Unfortunately the cold water was not working. Hoping that this would resolve itself by the morning I went to bed. I awoke at 7:30am to have a drink of water, shower, shave and clean my teeth. Again there was no cold water and very nearly scalded my self using the hot tap. I wanted to ring reception to ask for some cold water to be bought up and for some reason Travelodge do not have telephones to reception in any of the rooms. I had to get dressed and traipse down to reception without having washed which was very embarrassing when encountering fellow residents. I explained the situation to the receptionist and asked for some cold water to drink and wash with. I was first told I had to buy bottled water from the vending machine and would also have to move rooms onto a different floor until finally she suggested I could visit the restaurant to obtain a glass of water. She finally found an unoccupied room on the same floor which whilst it had a bed with a broken foot I could use the washing facilities. I then has to transfer all my luggage to this room in order to shower and shave, despite the fact that the room was not made up with scum marks all round the sink. I would have thought that the provision of running cold water was a basic service at any hotel and whilst I understand that sometimes things do not always work I was surprised this was not reported by the staff when the room was last made up. I was also dismayed that Travelodge don't provide a phone to reception and/or complimentary bottles of water to accompany the coffee and tea making equipment unlike comparable establishments. The service and initial attitude of you staff was second rate and despite complaining to the manager and in writing I have not been offered an apology or refund.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Loud buzzing noise!!!”", "Author": "BIRCHYBOY", "ReviewID": "UR81466061", "Content": "We stayed at this hotel on the weekend of the London Tattoo Convention. We picked this hotel as it stated it would be a short walk to Tobacco Docks... this was not true as it took about 50 mins! And also we were bringing our own car so needed to park it somewhere for the whole weekend. We were advised that there is a 24hr carpark costing Â£10.00 per day just around the corner. This closed so had to drive back to the hotel to get help on where to park!! The gentleman on recepton had to contact his friend to find this out. After parking our car we got back to the hotel to check in after ringing the bell for 20 mins a man turned up. The room was clean and tidy the bed was very comfortable. We stayed in Room 618!! Which must be above the boiler room as we were disturbed during the early hours of the morning with a loud noise!!! That seemed to go on and off for a long time. We payed extra for breakfast in the morning which was stone cold!! When telling the lady in the breakfast room that it was cold she replied \"ohhh sorry\" .... and nothing more! When we checked out, the staff on reception were very nice.. We then had another blow when we went to pay for the carpark!! it cost us Â£70.00 !! not Â£10.00 per night as stated it would be.... We will not be returning to this hotel again.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Lancashire UK", "Title": "“WORTH THE PRICE”", "Author": "ennismore", "ReviewID": "UR80876385", "Content": "Paid Â£32 a night and it was clean, comfortable and quiet. Couldn't find the TV remote so couldn't get the TV to work. Didn't ask about that as wasn't all that fussed about it so can't say how efficient they would have been about getting it sorted. All in all well satisfied for what I paid, Stayed at travelodges on City Road and on Kings Cross Road and thius was far quieter which was good", "Date": "September 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Great Value for price paid”", "Author": "RCK09", "ReviewID": "UR80181019", "Content": "Stayed for one night, booked as a bargain for Â£25 a room and had more good reviews than bad (lots of London T/lodges have very bad reviews) however we did find it a bit of a trek from St Pancreas as a Â£15 taxi ride. Checked in about 10 at night after a long trip from Paris with two young children and while reception were friendly in spite of prebooking our baby cot they had no room set up ready for us. So at 10 oclock at night we did find it a little annoying that after the long trek to our room we then have to wait for the cot to be brought to us and then have to make it up ourselves. Our \"family\" room was also quite small and a bit of a struggle with the cot and extra bed made up (again had to do this ourself) and only one towel between us all, at this time of night I couldnt be bothered to trek down to reception to get more. My Dad also had a family room and his was much larger than ours with more towels so I pinched one from him. However for Â£25 I feel happy with what we got, the room had a modern tv, was clean, comfy beds and fairly quiet. Room noise was minimal however workman did seem to start on the building opposite just before 7 am and this was quite noisy. However I was quite pleased making it to 7am in central London with no other noise. Also had breakfast for Â£7.50 each and the kids ate free which we thought was good value. Food fine and a good selection however it was left to one person to keep replenshing and serving and he seemed rushed off his feet. Overall a bargain for the price paid.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "5", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Rayleigh, United Kingdom", "Title": "“Basic but cheap (with advance booking)”", "Author": "CDM52", "ReviewID": "UR79523101", "Content": "Hotel and area around was quiet on a holiday Monday. Hotel was in a new building but inside showed lots of wear and tare / damage in public areas and room. Check in was friendly. Room was normal Travelodge standard. Hotel has a small bar restaurant but this had closed early.", "Date": "September 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Manchester", "Title": "“Two sleepless nights”", "Author": "KirstyHenderson", "ReviewID": "UR79346762", "Content": "I stayed for 2 nights at this hotel and after doing so I would not recommend it to anyone. The overall cleanliness was not very good, the doors to the rooms and lifts were very noisy and you can hear everything that is going on in the street below. Although the location is quite good, I would not stay here again as I basically paid Â£200 to have 2 of the worst nights sleep ive ever had.", "Date": "September 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "glasgow", "Title": "“good budget hotel”", "Author": "glasgowgigi", "ReviewID": "UR78680841", "Content": "I loathe travelodge BUT this one came up trumps. It is 5 minutes from Liverpool Street, Spittalfields market, good restaurants, great pubs, Brick Lane etc etc. It is clean, good budget accommodation and you can't fault it. They even gave me a tiny bar of soap. They only have double beds, no twins, in this hotel - but they are, I think, Queensize, not basic double size. I thought it was just astonishing value for money and the staff all seemed pleasant and intelligent room 112 was very quiet", "Date": "September 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "cleveland, england", "Title": "“Let down by travelodge”", "Author": "wiz1964", "ReviewID": "UR77878093", "Content": "Avoid room 302 at all cost, the room is disgusting, it smells of damp this is due to the fact that the shower doesn't empty and spills over. The handles are all falling off the doors, the tv didn't work, the curtains were hanging off with moth holes in so the sun shines through like stars. The carpet is filthy. The breakfast room was too small to accommodate all the guests, with poor choice, the lift too slow. I am amazed this hotel has not been closed down by health & safety", "Date": "September 1, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "5", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "BANBURY", "Title": "“Very small room, very hot, breakfast room too small for the number of people, hotel needs updating”", "Author": "TIMMSBanbury", "ReviewID": "UR77464807", "Content": "We had a family room which had a double bed and two pull out beds. The room was very small and far too hot. There was no way to change the temperature. The window was restricted, so we unable to let anymore air in. The room was pretty shabby. The pull out beds were okay for our young children, but older children probably wouldn't like them. The breakfast room was so small that that I had to stand to eat my breakfast. We also had to wait for the food to be replenished. I would have expected the hotel to be alot smarter given that it is in the financial district of London. The hotel was difficult to find at night and if you were on your own your might feel vunerable. The hotel is about 5-10 minutes walk from Liverpool Street station. The hotel is within walking distance of Tower Bridge and the Tower of London. The hotel was good value as we booked using an offer and paid Â£80 for bed and breakfast for 2 adults and 2 children for 2 nights, although I wouldn't want to pay the normal going rate.", "Date": "August 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Grantham, United Kingdom", "Title": "“Better than expected”", "Author": "Raystravels", "ReviewID": "UR77151799", "Content": "Having read all the negative reviews I asked for a quiet room. We were allocated room 615 on the top floor. The negative side of the room was a few stains on the carpet and bathroom, howver we had a good night sleep in a comfortable bed. The staff were helpful and friendly and it was in a good location for the main Liverpool Street station. I would stay there again but only for a single or two night break if it was at a good price. We paid Â£35 in advance in a Travelodge sale. We thought the area was good, however Travelodge needs to invest in keeping its rooms up to date and clean.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Shropshire", "Title": "“Why the bad reviews?”", "Author": "gayleharp43", "ReviewID": "UR76966350", "Content": "I stayed in this hotel with my daughter so we could celebrate her hen party along with 7 other friends who all had rooms at this hotel. After booking we read the reviews and were a little worried but thought for the money we had paid what do we expect? However, we shouldn't have worried as the room was spacious and clean. The bed was nice and comfortable. The staff were very friendly and we booked in and out with no fuss. The security was very good and the location excellent. We were mins from the tube and a short taxi ride from Covent Garden. I would recommend this hotel as a good budget hotel for a few nights stay to anyone looking for a cheap weekend in London. Our total trip including train fare from Shropshire, hotel and Dirty Dancing tickets cost us just Â£88 ea in total! Not bad at all.", "Date": "August 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Chelmsford, Essex", "Title": "“Oh Dear, Travelodge are now cutting corners on the basics”", "Author": "ChirpyTurkey", "ReviewID": "UR74802545", "Content": "OK, w have stayed in Travelodge before and know it is basic. They are now cutting corners on the basics and paying Â£60.00 a night it is not worth it. The room was incrediabily hot with little ventilation. The market and bin men start work at 5.00am so don't expect much sleep. The reception had run out of hair dryers to loan out (probably worth asking for one on check in and keeping hold of it for the morning) Toilet had not been cleaned. The two plastic cups had water marks on them, so they had just rinsed them out from the previous customers. I would not recomend, try and find somewhere else, but appreciate Â£60.00 is a good rate.", "Date": "August 11, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "4", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "UK", "Title": "“\"Good clean hotel but no sleep due to room hot”", "Author": "mark_bates09", "ReviewID": "UR74430279", "Content": "We wanted to find a cheap place to stop in London, and having looked at various reviews on here, this hotel had a good balance of positive reviews. The location is good, but could be difficult to find. Less then 5 mins from Liverpool St, make sure you take the Bishopsgate exit and then down Devonshire Row which will take you to the hotel. The hotel on arrival is fairly new and clean, however our stay was completely ruined by the room being unbelievably hot. We kept the window (which only opened a couple of inches) open all night, but this only provided a small reduction in the heat and then we were woken by the noise outside from 6am. There was no way to control the room temperature.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“Great location... but safety worries for a solo traveller”", "Author": "alexular", "ReviewID": "UR73999303", "Content": "I stayed here, alone, for one night on a Monday. The location is fantastic, and in a safe-enough feeling area. However, I had safety worries actually INSIDE the hotel. On two seperate occasions, other guests had been given a key to my room and entered, whilst I was in there! This obviously is completely unacceptable. Value for money is great, but it was mortifying having people walk in.", "Date": "August 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dover, United Kingdom", "Title": "“stopover in london”", "Author": "kcchiu888", "ReviewID": "UR73828706", "Content": "I stayed here for 1 night. It was easy to find only 5 minutes from Liverpool Street Station. There are clear directions on the Travelodge website. On Bishopsgate there is a KFC, Corals, Tesco amongst other eateries, bars and shops. I paid Â£22 for a double for 1 night during a promotion a couple of months ago. I was checked in quickly and stayed in room 203 on the 2nd floor. The lift was working. I was very happy with my accomodation the room was large and clean and over looked the front of the Travelodge. Everything that i needed in the room worked and i did not find it over noisy and slept like a log. For what i paid this was perfectly acceptable stopover and because it is so close to Liverpool Street Station i would stay here again for a reasonable price. I left very early and cannot comment on the food provided at this Travelodge.", "Date": "August 4, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "5", "Service": "5"}, "AuthorLocation": "brisbane", "Title": "“Good hotel near Liverpool street”", "Author": "lonboi", "ReviewID": "UR71824990", "Content": "Had a good stay room was large,was clean no complaints.was little warm opened window didn't effect me.lift not workin had to lug my suitcase up 5floors.meed to get it fixed fast.I'm young and I struggled. Stayin here again in december booked cheap 19 pounds rooms", "Date": "July 21, 2010"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Kendal, United Kingdom", "Title": "“not good hotel”", "Author": "rflat911", "ReviewID": "UR71470115", "Content": "Me and my boyfriend stayed in this hotel, I would just like to advise people that its not a good standard of travel lodge . Room was clean and towels got replaced but the heating was out of control and in the middle of summer it was not good. The bars in the area around the hotel close at weekends so getting a drink on the way home was not an option. Staff where friendly and let us check in half an hour early which was good, I just expected more from a standard chain of hotels and by that I don't mean luxury.. just everything to be well kept and not to feel like i was sleeping in an oven. We couldn't open the windows as there was noise from the neighboring tower block at very early hours. Building work is going on but this wasn't really a problem. I would definately not stay here again.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Good location, clean but noisy outside”", "Author": "lakelands67", "ReviewID": "UR71094235", "Content": "Very handy for Liverpool Street station. Lift was out of order during most of my stay. Staff quite helpful and room was larger than expected and clean but very hot.. Noise from building being refurbished next door made sure I didn't need my alarm clock.", "Date": "July 16, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Newcastle", "Title": "“unclean unpleasant, not safe on an evening - not recommended”", "Author": "NCL_Business", "ReviewID": "UR69410363", "Content": "stayed here as close to Liverpool St Station, defo not a safe place on a night, a bit grim, rooms are shabby, the whole experience is remenicent of a drug den.", "Date": "July 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wetherby", "Title": "“Great value for money”", "Author": "jpsykes", "ReviewID": "UR66693687", "Content": "We had a 1 night stay on Sat 5th June & booked Travelodge as it was much cheaper than any other hotels. All we wanted was a nice clean hotel in a good location. Its only 5 min walk from Liverpool St station & was in a very quite area as all the banks are shut at the weekend.", "Date": "June 7, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Cumbria", "Title": "“Clean, comfortable, convenient”", "Author": "Keith_Ulverston", "ReviewID": "UR66613041", "Content": "Booked this for 2 night stay Very easy to find, quiet, off main streets, handy for bus and station. Room adequate , bed very comfortable staff friendly No quibbles", "Date": "June 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Dublin", "Title": "“It is not too bad. Good location for Liverpool train station (Stanstead Express)”", "Author": "Srubka", "ReviewID": "UR65519849", "Content": "The hotel is not too bad. We had to stay close to the Liverpool street train station therefore it was quite handy.The rooms were okay, nothing special but nothing bad either, Is it value for money....hard to say considering that the hotels in London are a bit more expensive than other European cities. The metro station is 5 min walk.To walk to city centre (London Eye) it takes at least an hour but you can walk by the river from Tower Bridge which is a very pleasant route. We needed up walking every day. There are coffee shops around. All together an okay hotel but if we didn't need to stay close to Liverpool train station i wouldn't have stayed there. Would look for something closed to town.", "Date": "May 27, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "South West", "Title": "“Great Position Squandered”", "Author": "The_Cleric", "ReviewID": "UR63868193", "Content": "They double booked my room (3 Nights). Was told buy the staff I had to ring the booking line to fix it! 45 Minutes on the phone to barcelona later (And 2 people being turned away because they are fully booked!) they manage to cancel 2 nights of the double booking. The third I need to contact the Web booking dept! Room was clean and comfortable. Radiator was hanging off the wall on hinge leaving it at 60 degree angle. Tap leaked for three days making me feel like I was a P.O.W. being tortured. Went to the bar and stood there for 10 minutes waiting for someone to take an order for food. No one came figured IM IN LONDON go somewhere else. Wireless Netwok was up and down and wouldnt support VPN to work (So waste of money). Positives Price, being close to Algate station, clean bed.", "Date": "May 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "N. Yorkshire", "Title": "“Decent value for money”", "Author": "Graham_Y0rkshire", "ReviewID": "UR58827535", "Content": "We booked this hotel for a four day break in London and was pleasantly surprised by the quality for the price. The room was on the small side but had everything we needed. Kettle, TV, shower and WC. We had heard that the lift was always broken down here and my heart sank when we were given a room on the 4th floor and a notice in reception said the lift was out of order. Happily the notice was out of order and the lift was OK. We had booked breakfast and evening meals for the length of our stay. Breakfast was fine with full English buffet and choice of cereals, toast and a selection of conserves etc. The choices for evening meal was limited but I can recommend the Steak and Mushroom Pudding if your very hungry. Staff were polite and very helpful. Hotel was clean and inviting. Close to Liverpool St. Station and the Underground it's an ideal place for a short break.", "Date": "March 17, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "london", "Title": "“This hotel- far from 3 star title..”", "Author": "kohik", "ReviewID": "UR57826674", "Content": "On my arrival where was no one in reception ( it happen more than on one occasion . Later on i was given a room on the 6th floor, but lift was not working. I had 2 bags and a suitcase and no help with suitcase was available. At the reception desk where was very laid back attitude ( expecially in the evenings) . In the room was not enough towels, shower was leaking and sockets for hairdrayer were not working...After complaning about it ,only next day our suitcases where transfered to another room,but hairdryer was taken away by the people who transfered the suitcases.Apparently hairdryer was subject to the availability and maximum time allowed 15min.! Room was not cleaned even once, towels where not replaced...Purchased shower gel has disapeared on the day suitcases where transfered to another room...From my experiance, this hotel not even close to have 3 star status!", "Date": "March 5, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Try harder Travelodge”", "Author": "nownownoonoo", "ReviewID": "UR57429279", "Content": "Time â€“ 14:15 Receptionist: Check in isnâ€™t until 15:00 Boyfriend: Oh. Are there no rooms ready? Receptionist: Yes, but it will cost Â£10 extra to check in now. Boyfriend: You want to charge me Â£10 to check in 45 mins early? Receptionist: Yes. Boyfriend: Ok, can you just add it to the total cost of the room? Receptionist: No, it has to be paid now. Boyfriend: What do you think? Me: Â£10 for 45 minutes seems disproportionate. Boyfriend: Okay, we'll come aback later and check in. Can we leave our bags? Receptionist: No. Boyfriend: So, we either pay Â£10 or carry our bags around until check in? Receptionist: Yes. You can leave your bags in the lockers at Liverpool Street Station if you want. Boyfriend: What do you think? Me: I would rather spend Â£10 and 45 minutes in the pub thank you! And that was our first impression of the Travelodge Liverpool Street. Miserable! Iâ€™m sure this information about early check-ins is available on the Travelodge website, but the room was booked by my boyfriendâ€™s company (tight gits), so we only knew the booking reference and the address. Plus, the next day, I saw a much friendlier receptionist take in bags for other guests. After 45 minutes in a pub nearby, we tried to check in for a second time. There was a bit of a carry on finding our booking, but the receptionist â€“ not the jobsworth weâ€™d had earlier â€“ was more pleasant and said she was going to put us in one of the better rooms. We had a chuckle in the lift about what exactly would constitute a â€˜better roomâ€™ in the Travelodge. A mould free shower curtain? A kettle with a plug? The room we were given was stark, rundown and grubby. One of the walls was sticky and grimy, made more obvious by the slightly cleaner patch where there had once been a picture. There was a wine cork and Valentineâ€™s confetti on the floor from the last occupant. The roomâ€™s only saving grace was the comfortable bed. If you want to stay in central London on a budget, and all youâ€™re looking for is somewhere to lay your head, then this place is fine. However, on principle, I wouldnâ€™t recommend this hotel to anyone. Large chains like Travelodge should be setting the bar on the quality and service offered to those travelling on a budget. But in this case, theyâ€™re using â€˜budgetâ€™ as an excuse to cop out on the levels of customer service and facilities.", "Date": "March 1, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Leeds, UK", "Title": "“Mediocre”", "Author": "ecp98rjs", "ReviewID": "UR56896232", "Content": "I usually try to stay in a travelodge when away with work as I know what to expect - basic but clean and reliable. This one was pretty poor. The lift was out of order so I had to walk up to my room (on the 6th floor). I stopped off at the bar and had to hunt around for someone to serve me. Breakfast was basic with limited options of cereals and the coffee was awful. The room was clean and bed comfortable. But it was quite noisy outside and the bathroom had a couple of issues - the door wouldn't close properly as the pin in the top hinge was missing, and the light above the mirror wasn't working so hard to shave. I mentioned this to staff on checkout but didn't get an apology.", "Date": "February 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Really really enjoyed my stay.......will deffo be back!”", "Author": "jomca", "ReviewID": "UR55952679", "Content": "Really pleased with this Travelodge Hotel, I have stayed in many around the country and found this to be on top. Spotless clean, Reception staff very very helpful. Rooms were ideal and very spacious as we booked 2 family rooms there was more than enough room for 3 adults and 1 teenager in each room. The buffett breakfast was well worth the money and even better 15 and unders eat free with a full paying adult. Location was ideal just a short walk to LIverpool Street Station. We had dinner in the hotel also which was good value and very tasty. All in all nothing bad to say about it at all.", "Date": "February 14, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "northern ireland", "Title": "“Wont be back”", "Author": "marky15", "ReviewID": "UR55840755", "Content": "We have stayed at travellodges in the past and found them to be fine for the money but I wont be back to this one. We arrived and were given our Key which was fine but I opened the door to find a half naked man coming out of the bathroom and he had checked in several hours before this was embrassing to say the least. I went back to reception who did say sorry and gave us another room which was on the sixth floor the lift was out of order so we had to walk up 6 flights of stairs with our luggage ad the room we were given wasnt a family room like I ordered . We also asked for late check out when we arrived and were told that was fine just to pay on the morning of departure for this but whe we tried to do this we were told we couldnt as you have to pay on arrival so we had to carry are luggage around the rest of the day. This has put me off travelodges for nearly Â£ 150 for the weekend you expect better", "Date": "February 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Disappointing”", "Author": "RachelEFMY", "ReviewID": "UR55495690", "Content": "I chose this Travelodge because I was staying on in London after a one day business trip, and wanted a safe convenient hotel. The location is great for Liverpool St Station, but the hotel was shabby and run down, and only just on the right side of clean. Given the midweek price (over Â£100), it felt like a bit of a rip off", "Date": "February 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“basic but great value”", "Author": "brianmefc", "ReviewID": "UR54648001", "Content": "we stayed in this hotel for one night and it cost just Â£40 for the room. The Hotel is a five minute walk from Liverpool street train station and is therefore very conveniently located. The staff are very helpful, frinedly and approachable and all of them, from reception to cleaning staff, greet you with a smile. The rooms are very clean and basic but great value. There is a bar /restaurant on the first floor and several food outlets and pubs within reach in the immediate area of the hotel. All in all I cannot fault the hotel as it was great value for money.", "Date": "January 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“one of the best places I have ever stayed in...”", "Author": "sisisico", "ReviewID": "UR53460003", "Content": "We stayed in this hotel in December 30, 2009. Although we paid 45 quid for the night, I had the impression that I will find a cheap budget hotel with simple amenities. But soon I was amazed and surprised regarding the hotel and the quality of the service provided. Our room was absolutely clean, calm and tidy. It had everything you may think of: a TV, nice, clean towels, a nice, clean bathroom, enough hangers, tea/coffee making facilities, very effective heater. The check in/check out process was smooth and easy. the elevator was working well. Everything seemed great. Highly recommended and will go back again.", "Date": "January 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "cheshire", "Title": "“horrible hotel.. you can find somewhere better..”", "Author": "trueblue08", "ReviewID": "UR53402661", "Content": "This most of been the worst hotel i have ever stayed at, dark, grotty and dirty. The was marks on the walls, carpets are stained, had very bad lighting in the corridors. The rooms could do with a tidy up but were not too bad, they were basic but comfortable, only gripe that the no hairdryer was included. The breakfast was awful, if you could get a table you were faced with very low quality food and indifferent service. The only saving grace was the location, close to Liverpool st and Aldgate tube stations.", "Date": "January 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Glasgow", "Title": "“Good Value in a good location”", "Author": "dan1506", "ReviewID": "UR53149595", "Content": "Stayed here for one night in Jan, Hotel was easy found from Liverpool St station which was ideal for getting around Central London. Travelodge room was basic but clean and have no problems with the room. There was a awful smell in the corridor, but to be fair there was a sign up apologising and saying this was due to the carpet cleaning that was taking place. Didnt try the breakfast so cant comment on that. Only downside was the lack of open pubs in that area, went back around 11.30pm to find them all shut however a local tescos provided us with a bottle of voka and all problems went out the window. Overall great value for money and if staying in London again I'd certainly consider here again.", "Date": "January 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Braintree,Essex", "Title": "“Clean comfortable accomodation”", "Author": "discotrevor1234", "ReviewID": "UR51873704", "Content": "Very reasonable rates for the room which was clean and comfortable bed with T.V. Wouldn't have the breakfast again, very poor quality.", "Date": "December 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic Manageress”", "Author": "Gas10", "ReviewID": "UR51508437", "Content": "We had cause to complain very politely, regarding our room, the curtains did not close and the bathroom door was broken , together with the shower thermostat, BUT, Milly dealt with us with professionalism and cheerfulness and following this incident could not do enough for us, we will use this Travelodge again as the location for the City is perfect.", "Date": "December 19, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Wakefield, United Kingdom", "Title": "“Avoid Avoid Avoid”", "Author": "DANNYANDSTACEY", "ReviewID": "UR50221972", "Content": "Stayed at this travelodge for 1 night 27/11. Tried to chek in at 1pm to be told check in is 3pm and there is nowhere to store your baggage unless you pay Â£10 early check in charge which i paid as had no alternative. On our return to our room at midnight after seeing a show we were settling down to sleep to find a Mouse on the edge of the sofa bed. We were eventually moved rooms and did have some money refunded the next morning. The hotel is disgusting, please everyone avoid at all costs ! We were told by the manager the mice are an ongoing problem due to building work and pest control have attended and thought the problem was sorted. Obviously not !", "Date": "November 28, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Channel Island", "Title": "“Try somewhere else”", "Author": "AnnaSmiles", "ReviewID": "UR49920337", "Content": "I booked this hotel for a large group for a weekend, We arrived to find out that they wouldn't store our luggage, after about 10 minutes of trying to get some help from them, they told us that we should take our bags to the Station (Â£8 per bag) - we had to do this! More examples...... *) In the family rooms they didn't give enough breakfast vouchers and it took a request to speak to the manager to finally get the correct amount. *) In the evening after watching a show I wasn't able to get into my room as the keys didn't work and I didn't have any ID on me. *) Not enough towels in the rooms etc etc etc Rooms were ok, the bathrooms were damp The floors were being washed with the dirtest bucket of water i've seen in a while. It may have been cheap but you can get the Premier Inn etc for the same kind of price and thats where we shall be staying for next years stay", "Date": "November 23, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Dundee, United Kingdom", "Title": "“Does exactly what it says on the tin”", "Author": "ScottishTourist", "ReviewID": "UR49913857", "Content": "Having stayed here and in other Travelodges before, I knew what to expect from our 3 night stay at Liverpool Street Travelodge. What can you say about a Travelodge? Room fine, bed could have been more comfortable but certainly not the worst, could have done with more pillows - why only 3 in a double room? TV worked, no hair dryer supplied, no where practical to dry hair as only mirror near a plug socket was tucked away in corner of room with no space to sit on chair. Bathroom ok. Shower annoying as it flooded bathroom floor on each use due to useless shower curtain. Hate shower curtains..... Bathroom taps also need some maintenance as nearly impossible to turn off completely. Not enough towels supplied - 2 adults need more than one towel per day. Hotel location good for access to Liverpool Street Station and the surrounding area is interesting too. Close to Brick Lane and Spittalfields Market. Petticoat Lane very close too although I was not impressed! Overall complaints are minor and not anything that would stop me staying here again.", "Date": "November 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "England", "Title": "“Lift STILL out of action, more than a year on!”", "Author": "Mijit", "ReviewID": "UR49400192", "Content": "A pretty typical Travelodge, worth booking if you can get a very cheap deal, but certainly not worth the full rate. For anyone who's been following the broken lift saga, you might want to know that it was out of action yet again for the whole of last weekend - with a notice put up (see photo) apologising, but pointing out that there's been a warning on the website for more than a year. Does it really take that long to fix a lift? No joke if you're having to walk up 6 floors. There's noise from the trains, as others have pointed out, and there's a warning on the website about noise from the building site next door. The room wasn't filthy, but could certainly have been cleaner - I can just about live with someone else's toe nail, but nasal secretions on two of the walls really should have been dealt with! The LCD television works fine, though it's difficult to see why Freeview channels aren't provided - they are free, after all. And why no Radio 4? The bathroom was fine, if a little damaged and mildewy. The fixed shower head is hopeless, though, particularly for women and people with children. As always, the window won't open beyond a few centimetres, and it would make the room unbearably hot in the summer, or even the spring and autumn. I know it's supposed to be a health and safety issue, but how would anyone get out in the event of a fire? In summary, it's a Travelodge. Good value if you can book a cheap room in advance, but you have to be prepared to accept the limitations. I think the non-opening windows are a serious risk to life, though.", "Date": "November 17, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Hornchurch,England", "Title": "“Another Good Stay”", "Author": "Joegeez", "ReviewID": "UR47896899", "Content": "This is my second review for this Travelodge. I booked this room for Â£19 when they had the sale on in April. This time i took the family so had the family room. Check in was a breeze, the room and sheets were clean. We had a first floor room so can't comment on the lift as we used the stairs. If i had to be negative there were 3 cups in the room for 4 of us, we only had one pillow each and the stairwell smelled as if someone had thrown up in it recently (can't blame them for their guests antics ). Didn't use the cafe on site as we walked to mcdonalds for breakfast at Liv st station (5 mins away). I'd go back again for the right price as it meets all your basic needs.", "Date": "October 27, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Nottingham", "Title": "“Reasonable budget hotel in good location”", "Author": "Squawk66", "ReviewID": "UR46904912", "Content": "You will be pleased to know that the lift has now been fixed! Not bad for a budget hotel in London. Reasonably priced for London at Â£85 (92 euros, $137 US) for a double room. There was a mild damp smell, but not too all-pervading and the staff seemed to occasionally spray fragrance to get rid of it. The receptionist was friendly and efficient and the room was clean. I was in room 615 on a Thursday night in October 2009. There was no telephone in the room, but there was an electric kettle, coffee, tea, milk (Milk Maid â€œtastes like fresh milkâ€�). The bathroom had a shower (no bath), no plug in the sink, and a small bar of soap was provided. The television had the 4 main terrestrial channels, BBC1, BBC2, ITV, Channel 4, but no Channel 5. Close to local food shops, cafes, pubs and bars.", "Date": "October 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "cambridge uk", "Title": "“Â£40 - Great Value and location”", "Author": "marypa", "ReviewID": "UR46483677", "Content": "I spent 1 night at this travelodge. All the usual stuff. Very good on reception. Chose a family room which was huge Great location for city sightseeing or business very close to Liverpool Street. Plenty of shops and eateries close by Quiet and comfy Def stay again for an overnight Make sure you take all of your own toiletries", "Date": "October 10, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Essex", "Title": "“Cheap But You Get What you Pay For Here!”", "Author": "trickyd64", "ReviewID": "UR46078406", "Content": "I have stayed at Travelodges before so I knew what to expect, but this didn't even meet any of them. Arrived earlier than the 3:00pm check-in so wasn't expecting to have a room but was told we couldn't leave our luggage any where unless we paid Â£10 for early check-in, which we had to do as we weren't likely to return until late at night. When we got to the room it was very bare with no pictures on the walls, the carpets were dirty and the room had a musty smell. The bathroom was no better, the shower was dirty and I didn't need one of those ultra-violet lights to see the dirt on the toilet seat and bowl, as you could see the streaks all over it. We wont be staying here here again!", "Date": "October 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Isle of Man", "Title": "“Cheap nice location”", "Author": "iomboi", "ReviewID": "UR45596396", "Content": "It was Cheap and in a good location although the hotel itself smelt quite stale. like it hadnt been cleaned in a while or it was cleaned with dirty equiptment.", "Date": "October 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Cork, Ireland", "Title": "“Excellent Value!”", "Author": "joanneclairemc", "ReviewID": "UR45452176", "Content": "I have just returned from a 2 night stay in Travelodge Liverpool Street in London. After reading some of the reviews on here, I was a bit nervous about my stay. How wrong I was. From the minute we arrived to the time we left, we had a very enjoyable stay. The staff were great, not intrusive, but helpful when you needed them. Check in took less than 2 minutes, and of course the lift was out of order and we got a room on the top floor! But, the advantage of this is it put me off going for a cigarette once i went to my room! The room was very clean, as was the bathroom. There was a flatscreen t.v , with decent channels too! The bed was very comfortable and although the room got a bit warm at night, you just kck off the duvet and hey presto! you cool down! I think that this is a simple hotel for people looking for a cheap comfortable stay in London. It's pretty central, less than a 10 minute walk to London Bridge, and Liverpool Street Station is a 2 minute walk and you can get anywhere from there! Don't let the cheap price put you off!! This is a great hotel!!", "Date": "September 29, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Derby, England", "Title": "“ONLY AS A LAST RESORT!”", "Author": "mrspinkrat70", "ReviewID": "UR42729554", "Content": "We are used to Travelodge and usually know what to expect - basic but clean, with pleasant staff. Hmm....this Travelodge did not live up to expectations. It was very smelly (damp, dirt, cigarettes), it was quite run down and the staff not very bothered. On our arrival the lift was broken so we were moved to a room on a lower floor which was nice but on heading up the stairs were greeted with dirty linen being thrown down the stairwell be cleaning staff!!! Anyway, the room was ok. Again, quite run down. The area is a bit scary. I wouldn't have wanted to be out alone. It was probably only just worth the Â£19 we paid for the one night and I would only go back if there was no-where else to stay in London!", "Date": "September 18, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Very disappointing!”", "Author": "Mrs Mopp", "ReviewID": "UR40667301", "Content": "Have used Travelodge a lot in recent years because you know what to expect - nothing fancy, but clean and comfortable. However, this one failed to live up to expectations. As other reviewers have said, the lift was out of order (and we were on the 5th floor); My husband and I had to share a towel the first night as there had been a problem with the delivery - new towels didn't arrive until the next day; Room very hot - so we had to leave the window open - which meant that we were woken at 5am both mornings by lorries outside the window and the sound of trolleys being loaded/unloaded. I don't think this was from the building works - but maybe it was the towels being delivered! We paid extra for breakfast and evening meal. Whilst there was a good selection (and quantity) of food for breakfast, the 'hot' food was left standing under heat lamps and was lukewarm at best. However, the main problem was with the evening meal. The first evening there was no one around to take our order. My husband went down to reception and eventually someone came up to take the order. We couldn't have what we wanted because the fryer was broken - so we opted for Steak & Ale Pie. Fine - except there were no peas and no alternative veg - so we just had pie & mash. I ordered Banoffee pie for pudding. When it arrived it was frozen solid. I took it back to the kitchen and complained (nicely|) that it had not been defrosted. I was told it was meant to be like that and that was how they were trained to serve it.. and they offered me a knife to cut it with!! The second night the menu was reduced even further to either pizza or curry! I wouldn't have bothered booking the meals had I known - they definitely were not value for money. The final straw was cold water on the last morning of our stay because the boiler had broken. Whilst you could say that the hotel staff can't help it if things break down -and if it was only one thing at a time it would be bearable - it didn't appear that a great deal of effort was going into resolving the issues. As someone else said, maintenance doesn't seem to be high on the list of priorities.", "Date": "September 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "NI", "Title": "“You get what you pay for!”", "Author": "mley4", "ReviewID": "UR39500038", "Content": "When I arrived the first day there was a notice up saying the lift was broken. I didnt mind, I was aware from other reviews that it never worked! Woke up second day to see a notice saying that due to an accident there was a shortage of linen and towels for that day, but more would arrive later - and they did. Third day, yet another notice, this time saying that the hot water was broken and would be fixed shortly, if not we would be moved to another hotel - Thankfully it was fixed! Also, when we decided to try the restaurant, they had no food, except for curries! And the rooms were roasting, the window was kept open all week and the quilt was abandoned, using just a sheet instead! But these things didnt bother me or spoil the trip.. I just thought they were hilarrious! The staff were friendly, rooms were clean and food was good. Also, its really close to Liverpool St Station! And that's what matters... Right?", "Date": "September 1, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "manchester", "Title": "“An Underated Location; usual Travelodge (sub) standards”", "Author": "ybyd", "ReviewID": "UR38797026", "Content": "Right - I dislike Travelodge as some of you may know but I really couldn't complain about this one for Â£29 for the night (Sunday). I chose it because it is only a 20 minute night bus from Vauxhall (I was going clubbing) and it is dead close to Liverpool Street Station - on the Central line and just a couple of stops on the West End. It is literally a two minutes walk away from the station in a quiet street. It is also close to the gateway to the East End - Shoreditch, Brick Lane, Hoxton. Shabby chic personified just a stroll away. The hotel is as unpredictable as all the other Travelodges I've been to. The lift was out of order and there were several panes of smashed glass in public areas. In my rooom there was a huge dent where door had slammed open and there was a bedside cabinet missing with only the drill holes to show for it. None of this really bothered me but I'd expect more if I had paid more. That said the room was clean and quiet and had a flat screen telly and there was an occasional mechanical chugging noise but then I always carry ear plugs with me....as some of you may know already ;-)", "Date": "August 25, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Loch Lomond and The Trossachs National Park, United Kingdom", "Title": "“Would not stay again...”", "Author": "sammysu", "ReviewID": "UR38748957", "Content": "This travelodge is in a great location for tube stations and walking distance to most places...but it is situated down a dodgy looking lane from Bishopsgate, it seemed harmless enough after a few days of knowing where we were. The actual hotel itself was a disgrace though. We arrived at 2 am to no one on the reception desk (there never was anyone there unless you pressed the bell, and on one occasion the reception girl was very annoyed that we uncovered the bell, which she'd hid with a sign!) Anyway, we were told that we were on the 5th floor and that the lift was out of order, we asked for another room on a lower floor because I have asthma and was told no. After climbing the stairway, which was smelly and damp with cracked windows, all we wanted to do was sleep. Which we couldn't do because the building had no air conditioning at all and it was boiling. At 7:45 am we were awaken to the sound of the building works right outside our window, which no one had mentioned. This went on for the four days we were there. I tried to close the window for some peace and quiet to get my head together, but there was no handle on the window. When we woke up properly and had a good look around I was horrified. There were stains on the carpet (do not walk in bare feet!) spilt coffee or whatever on the walls, cigarette butts in the window frame, our quilt cover was torn, the lamps on either side of the bed were stained and thick with dust, one of the coffee cups was cracked, the bathroom tap was loose and dirty and every time the toilet was flushed upstairs there was a fowl smell coming from our toilet. There is no hair dryer or iron in any of the rooms, but if you ask for them at reception you will get one IF they are available and you have to give it back straight away due to the small amount they have. So to have a shower and dry my hair I had to run down five flights of stairs and back, get ready then run down five flights of stairs again. I complained about the lift and asked when the engineer would be out to fix it, I was told \"it doesn't look likely it'll be any time soon\". On our third day there we came back to our room and no one had been in to empty the bins or give us fresh towels, although we had passed the cleaners earlier that day, who had left piles of dirty laundry lying on the corridor floor. I wasn't running down the stairs to complain, I just wanted to sleep. Not that the reception staff would have helped, they were the most unfriendly people I have ever met. When we were checking out the man on the desk was dealing with someone else and asked if we were checking out, I said yes to which he replied \"just leave your key there then\" and continued with his conversation. No goodbye or thank you. I know Travelodge is a budget hotel and you pay for what you get, but all I was expecting was a clean and working room and to be treated well. It doesn't cost much for cleanliness and to teach their staff about customer service. I have since emailed Travelodge to complain and explained everything that happened. Their response was that they have sent my complaint to the hotels manager and that he/she will be in touch personally. Will wait and see if I hear anything at all.", "Date": "August 25, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "UK", "Title": "“A very noisy hotel”", "Author": "reviewer891", "ReviewID": "UR37633003", "Content": "We went there to celebrate my daughters birthday, and although the travelodge was very close to the tube station and a tesco, it was very shabby and noisy. Our two rooms backed onto the stairs, and all night we could hear people going up and down the stairs. The rooms were also very hot, and there was very few fans. The windows would only open about 6 inches too. In the morning we were woken up early to hear the sound of lorries and gates. Also the lock on our bathroom door would not lock, and the lift didn't work as well. The hotel was amazing for getting around, but it was just not up to scratch.", "Date": "August 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Wirral", "Title": "“Great location and great value”", "Author": "kd66", "ReviewID": "UR37407151", "Content": "Stayed at the end of July 2009 for 4 nights in a family room on the 6th floor. The room was clean and spacious. The bathroom was also clean and adequate for our needs. There was building work going on in the surrounding area (which obviously the Travelodge does not have any control over). This started very early in the morning, but did not impact too much on our stay. All the staff were most courteous and we were able to check in promptly at 3pm. Great value for the Â£19 per night - could not have asked for better value. The hotel is in a great position close to Liverpool St station, but situated off a quiet square. We went to a couple of shows and came back late at night, but there was no problem as the businesses surrounding the hotel had nightwatchmen, so we did not feel vulnerable walking in the dark. There are plenty of food outlets a short (approx 3-5 mins) walk away and a Tesco metro opposite the station. We bought cereal and milk from here to eat in the room for breakfast. I can also recommend the Slug and Lettuce (virtually opposite) for a meal (50% off all food on a Monday night). All in all a good travelodge if you want to be close to all the London sights and very handy for the underground.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Willington, United Kingdom", "Title": "“Shabby room, high noise levels and lift out of order”", "Author": "louisedomville", "ReviewID": "UR37362442", "Content": "Have stayed in Travelodge hotels previously and they have always been clean and tidy and this one although quite clean was very shabby, dirty carpet, pictures missing from wall and missing plaster from wall. It seems maintenance is not a priority in this hotel. There were very high noise levels throughout the night, people coming and going, chains and gates rattling from neighbouring buildings and the underground could be heard and felt even though we were on the top floor. For the 3 days we stayed here the lift was out of order, we did not return much as we had 6 flights of stairs to contend with and couldn't be moved as we had a family room of which there were only 2 available both on the top floor. The only benefit was the location of the hotel which was very close to both Liverpool Street and Aldgate tube stations.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Scotland", "Title": "“Average”", "Author": "Superles", "ReviewID": "UR36881662", "Content": "It took us forever to get checked in for reasons they didn't give us. The hotel is a good location for the underground, if your wanted to get out and about BUT the down side to it is you can hear the underground through the night which kept me up.", "Date": "August 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“Excellant Value and Stay Once Again”", "Author": "CliveUK", "ReviewID": "UR34474314", "Content": "Another stay at the Travelodge Liverpool Street. What can I say. Super value, I paid Â£9 a night for four nights (currently on my 2nd night) and booked an early check in. Got to hotel at Noon, checked in with a very pleasant receptionist and given a nice room on the 5th floor..Very clean and tidy as have all my experiences over the years been at this hotel. Staff friendly and polite at all times. I cant understand why people moan so much about the showers: if you adjust the head the bathroom does not get flooded out...just be sensible. Always plenty of hot water; unlimited tea and coffee if you ask for more at reception. Same with towels; always at least two in the room (plus one spare on shelf in room), howmany does one need?? Whenever I stay in London, usually every 2 months I always stay here if I can get in, the location for both tubes, mainline rail and bus routes is excellant, central but just off the main strip in the city so you generally get a good nights sleep. The hotel cannot be held responsible for the odd drunk in the street..that the same anywhere. If the hotel had air con like the newer lodges in town it would be 100% but you have to remember this is the first and original TL in London, still superb value in my mind, the staff are always very helpful...I always find its the way you speak to people, just remember everyone is human and they all work on the minimum wage..just remember that fact!", "Date": "July 11, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "5", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Liverpool", "Title": "“Purpose built, perhaps not the best though.”", "Author": "GraemenBec", "ReviewID": "UR34339169", "Content": "To start, it was a bit out of the way from the station, not ideal for people on their own arriving late in the evening. On seeing that this hotel was purpose built, I expected it to be a similar quality of the Euston Travelodge, however I was wrong, it wasn't great and was very plain and boring. No art work on any of the walls, very narrow staircases and just simply cold and boring. The room was quite small, more spacious than the Euston one, but not as nice, would have preferred the Euston size for the quality. We saw the bathroom, and I was quite excited that there was a bath, however, it wasn't a bath, it was a 1/2 size bath. I'll draw you an image, me in the bath, torso in the bath, legs up the wall. Not comfortable!!! The service was typical of any Travelodge, so acceptable.. The views were not exciting and the window had a fixed curtain... Overall I found it to be acceptable, but wouldn't stay again. On the plus side the station was quite close, I ran and got a mcdonalds and brought it back for breakfast to eat in the room, it was considerably cheaper than the bowl of cereal they offered in the restaurant!", "Date": "July 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "BC, Canada", "Title": "“Decent hotel for the price”", "Author": "Lily82", "ReviewID": "UR34026120", "Content": "We stayed at the Travelodge Liverpool Street for 5 nights and overall, found the hotel to be decent. The room was clean, the bed fairly comfortable and it is in a great location to catch the tube. There are several pubs, grocery stores as well as Spittalfield's and Petticoat Market all within walking distance. The staff in general were polite and helpful but 2 we encountered were neither. The shower leaked as there was only a shower curtain to hold in the spray and the shower stall is small and the shower head couldn't be adjusted. The in room wi-fi is a bit pricey (as you can see on their website) but they do have computers in the lobby where you can send off a quick email at 1 pound for 20 mins (apparently this was a special price and it's usually 1 pound for 10 mins). My only real complaint is their booking system which wouldn't allow me to book all nights together and still get their super-saver rate, so I booked our first 3 nights separately and we had to get our key re-programmed every morning. The area was pretty quiet on evenings and weekends but we did get woken up as some guests made their way home around 3 am a few nights.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "England", "Title": "“Horrendous ! the hotel was hot, smelly & dirty”", "Author": "MrsS2BEngland", "ReviewID": "UR34007778", "Content": "I booked to stay here with a friend as somewhere to use after going to a concert at Wembley. We paid an extra Â£10 to check into our room 2 hours early (1pm) our room was located on the 4th floor, we look the lift only to discover the button for the 4th floor didn't work so you had to get off at the 5th floor and walk down. When we arrived on the 4th floor the corridor was full of dirty laundry as the cleaners had left piles of dirty bedlinen and towels outside all the rooms!! this is not something you expect to see at 1pm in the afternoon, the smell was horrendous, also the corridor was really hot as the air con wasn't working. The carpets in the corridors are old and tatty and all the walls are marked from peoples bags, it just looked old and tired. When we arrived at our room it was basic which is what you expect for a Travelodge. My friend inspected the bed and when she pulled back the quilt we could see there was no mattress protector on the bed and stains on the mattress, we pulled the bottom sheet off for a closer inspection only to find the mattress was badly stained with the stain going through to the otherside and on the bedframe ! My friend went back to reception to complain. A member of staff came to inspect the bed and finally agreed to move us. Our next room again was on the 4th floor. This time the room was slightly cooler and thankfully the mattress has a mattress protector on, at this point we decided not to look under the mattress protector!! however we notice that the bottom sheet had a nice big hole in it, thankfully this was located on the side of the mattress rather where we would sleep. In the bathroom we discovered we'd only been given one bath towel and one hand towel between the two of us and the shower cubicle was full of mould. We left our room to head off to Wembley, we called the lift to take us to the ground floor. After returning from the concert in the early hours of Saturday morning, we had to swip our room card at the reception entrance to allow us back into the hotel. As soon as you walked through the reception doors the heat hit you ! we decided to get a snack from the machine in reception a packet of crisps where Â£1.60 !! When we finally got back to our room we discover that one of the bedside lamps didn't have a bulb in it. My friend was the first one to use the shower in the morning by the time she'd finished the bathroom floor was soaked, so by the time I'd had my shower the bathroom floor was more like a swimming pool ! it was just horrendous we had to put the hand towel on the floor to stand on to clean our teeth. When we checked out a we were asked to rate our stay between 1 and 10 we gave it minus 20 to which she was very shocked. We asked what we need to do to give an formal complaint, she wasn't very forthcoming and said we would receive an email following our stay where we could write our review, we insisted she took our numbers and that the manager should call us. I'm still waiting for the call..", "Date": "July 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cork Ireland", "Title": "“A brake in London”", "Author": "PassageWest", "ReviewID": "UR32816828", "Content": "Picked this hotel as it was central to Liverpool St Station and going on the reviews I got from Trip Adviser, also they were having a sale. I can only say that we enjoyed our stay there. The room was clean the staff were friendly. I will stay there again even having to pay full price.", "Date": "June 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Coimbra, Portugal", "Title": "“Very good value, for a short trip”", "Author": "JMPFF", "ReviewID": "UR32660444", "Content": "If you want a great location (5 min walk to Liverpool St Station, where you can take trains, tube and buses) and if you don't mind a good \"low-cost\" hotel, this can be the one. We were aware we had to bring our own shampoo, bath gel and so on; we knew check-in would be only after 3 pm (but, at the reception, we were kindly informed 2.30 was ok enough); we knew also we had to pay a bit more for breakfast, so we knew what to expect. Breakfast was good (7 ou of 10), all you can eat buffet; The only thing we did not like was the fact they only had 1 set of towels for a double room, so we needed to ask for another set. Considereing pros and cons, i think this hotel is a very good value for a short trip to London, if you travel on a budget.", "Date": "June 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Stoke-on-Trent, United Kingdom", "Title": "“Fantastic value & great location”", "Author": "milmol_7", "ReviewID": "UR32272894", "Content": "The location of this travelodge is brilliant, short walk from both Aldgate and Liverpool Street underground. Also literally one street away from Petticoat Lane Market. Room was spacious, clean & tidy, bathroom was also nice and clean, girls just remember there are no hairdryers in the rooms! Breakfast was good value too. Considering we got the rooms on one of Travelodge's Â£19 a night offer we couldnt fault it.", "Date": "June 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Twin Cities, Minnesota", "Title": "“Good location for underground, lousy hotel”", "Author": "Visitor8675309", "ReviewID": "UR32131907", "Content": "I stayed in the Travelodge Liverpool Street for three reasons - price, proximity to the underground, and proximity to a business center where I completed training for three separate days. In respect to all of these aspects, this Travelodge met my needs - it's less than five minutes from Liverpool Street and Aldgate stations by foot. The price was also pretty competitive (I believe we averaged around 100 GBP a night). That being said . . I have some major qualms with staying at this hotel. First of all, I realize you don't go to Central London and expect to pay a small price and get a ton of amenities . . I get that. . however, I think certain things should be expected. For example, they only had one pillow in our room when we got in - and they did not have any more at the front desk, so we had to make due until the second day when more came available. How can a room only have one pillow? I have no idea. . Other things that were problematic and annoying . . no phones in the rooms, no fan or air conditioning, a window that opened to the street that people were using / arguing / partying on all night so it was difficult to sleep, they only cleaned our room one out of the four days we stayed, no soap for the shower, the hallways reeked of mildew and there were some really gross stains on the floor of the room. . . A few minor positives of the hotel worth mentioning: the breakfast was a fairly good deal (7,5 GBP for an all-you-can eat buffet of relatively good quality), the elevators did work (despite their web site stating that they did not) and there are a fair amount of pubs in the area of ranging nationalities, so there are places to eat and drink pretty close. . but expect to need a suit jacket to go to any of these, as this is the financial district of London and tourist clothes really make you stick out! Overall. .I wouldn't stay in this hotel again, but would probably consider staying in this area again. We were a very short tube ride from all of the touristy stuff, the neighborhood felt pretty safe, and the price was right. . but yeah, the hotel was very dirty and seems to have had all of its better years behind it. . We stayed at the Premier Inn at London King's Cross for the last 4 days of our trip, and that was an AMAZING place to stay compared to the Travelodge (and actually cost about the same amount) - I highly recommend you go there instead of here.", "Date": "June 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "suffolk", "Title": "“very good hotel”", "Author": "caspops", "ReviewID": "UR31037110", "Content": "stayed in with my 4 and 7 yr old and husband very easy to get to from liverpool street station. hotel staff very friendly .. clean, ask for extra pillows and got them. welcoming from cleaners.front desk staff. good security needed your key to access the building and then a 2nd door:) close to a tescos metro and a M+ s and local resturants.. downsides , The fryer was out of action so after we ha taken a seat and looked at the menu for 10mins was told No chips and a range of other things not avaiable.:( no vegetarian menu for the english fried breakfast..a vege sausage would have bin nice .. the breakfast set up was a bit crazed. we had a ticket for it and for kids .the first day noone seemed to want it and the 2nd day we were asked for it again and again. the lift was abit mental..floor 4 didnt seem to work..and guess wat floor we were on! ahem 4", "Date": "May 28, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "New York", "Title": "“MICE!!! Beware!!”", "Author": "somebodyguy", "ReviewID": "UR29948312", "Content": "Good location, looked a little more clean than some Travelodges I've stayed in but I was woken at 5.00am to a strange sounds coming from the bin. I looked over and found mice in it. Since there are no phones and only a callcentre or a number (no front desk) I simply threw it out the window. Staff the next day were dismissive and wouldn't refund the follwing two nights I had booked. Disgusted.", "Date": "May 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Northampton", "Title": "“Good Travelodge”", "Author": "Northamptonians", "ReviewID": "UR29187981", "Content": "We have stayed in a fair few Travelodges. Some good and some very bad. We thought this one was good. It was usual Travelodge spec but it was clean, well located with two tube stations close by (Liverpool Street and Aldgate) and had a nice bar/breakfast room. Whilst Liverpool street is a nice big station, Aldgate is the closest in walking distance. The girls on reception were very cheerful, polite and helpful. All in all we had a pleasant stay at this hotel which was made even nicer by the fact that we managed to get our room on one of Travelodges promotions for Â£19.", "Date": "May 2, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "UK", "Title": "“Felt like Fawlty Towers”", "Author": "Aviatrix", "ReviewID": "UR28819865", "Content": "I don't expect luxury when staying at a Travelodge... but this one was so bad as to be almost comical. When I arrived I was greeted by one solitary distraught-looking employee who seemed to be completely out of his depth. He was struggling with the computer system which he didn't seem to be able to get to work, and when another one of the waiting guests asked him if there was a toilet in the public area (she seemed desperate) he told her he didn't know because (quote) \"I don't work here\". (!!!) However, he eventually managed to sort himself out sufficiently to be able to check me in. Walking to the lift I found the ground floor corridor strewn with blood-stained tissues.... perhaps I should have beaten a hasty retreat then but I was TIRED and just wanted to get to bed. But worse was to come... when I got to my room I found the bed was unmade and the bathroom had wet towels on the floor. Clearly the room had not been cleaned. I returned to the reception desk and was duly allocated another room (room 115). .. but when I got to that room I found that it was occupied! When I double-checked my card key wallet I discovered that 115 had been crossed out and 206 had been written above it... but how am I supposed to know these things if no one tells me? I made my way to room 206 which proved acceptable... though only just! There were large cracks in the wash basin and coffee stains on the desk, and the room was very cold when I arrived as the heating had been turned off. Even after I turned the heating back on the room never really warmed up, and there was quite a bad draft coming from the window. I complained to the hotel chain, and to give them their due they did phone with an apology... blaming absolutely everything that had gone wrong on the poor overworked chap behind the counter who had, apparently, been brought in at short notice to cover for someone who had gone sick.", "Date": "April 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“A decent no-frills lodge at a great location at a great price!”", "Author": "gwyne", "ReviewID": "UR28572555", "Content": "Stayed with the lodge for 3 weeks, first impression on the room.. pretty depressing, but after sometime, got used to it, and got pretty comfortable with the room. I stayed on the 2nd floor, once in a while, there will be some loud commotions between some street thugs and the police... Nonetheless, great location, friendly reception, 3-5 min away from Liverpool Street Station, bars and restaurants are easily available around the vicinity, tower of London and tower bridge are nearby, 15-20 min away. Petticoat Lane Market on Sundays, lots of Indian cuisine on Brick Lane. There's a nice Chinese Restaurant nearby as well, so food-wise, no problem. And it has got Flim4 as one of its TV programmes which helps to kill much of my boredom.", "Date": "April 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "manchester", "Title": "“good base for a good price”", "Author": "universalfan", "ReviewID": "UR28314582", "Content": "a good place to stay as its an easy 5 minute walk to the tube station. Safe area and near to a few resteraunts and shops. It was basically clean,only negative things i could say was that the shower must have been blocked as the bottom filled with water and started to overflow if you wasnt quick! The other thing was you could hear a bit of noise from the tube. Other than that was perfect, clean bedding, t.v, towels changed every day, somewhere to sleep for Â£39 a night", "Date": "April 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Great hotel, would stay again”", "Author": "mwc88", "ReviewID": "UR28312206", "Content": "We paid Â£9 a night for 3 nights at Liverpool St due to the Travelodge Â£9 stay. It is in a prime location for anyone who wants access to the underground as it is only five minutes walk away. It's also in a quiet area and was always peaceful. The quality of the rooms was great and it was very comfortable to sleep in. Would definitely recommend it to anyone who wants easy access to travel networks whilst touring London and would also recommend it to anyone who wants a cheap and comfortable stay in central London.", "Date": "April 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Newcastle upon Tyne", "Title": "“Just what we expected - great value”", "Author": "brucewp", "ReviewID": "UR28025719", "Content": "Got three nights and paid Â£19, Â£59 & Â£89 for family of 4. No noise from street as in a quiet side street, even on 5th floor there was a distant rumble of trains from underground whihc surprised me. ALso were warned of building work, tower block being built opposite our room, however we were up and down at brakfast by 8pm each day and they hadnt started at that stage so not a problem. Breakfast room a bit small, as was our room but staff were all fine and so was breakfast, will definitely be back", "Date": "April 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Glasgow", "Title": "“Great location & value for money”", "Author": "member1000", "ReviewID": "UR26920224", "Content": "Perfect location, just 5 min from Liverpool St station where Stansted express comes in. Room was adequate with en suite shower. Did not have hairdryer, but we were able to borrow one from reception. We did not have breakfast- plenty of coffee shopes etc around and we walked to Borough market in 15min to get breakfast there on Saturday and then to Spittalfields market on Sunday- 5min away. There is pay per use internet in foyer but that is very slow.", "Date": "March 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Bedford", "Title": "“Good value, bad smell”", "Author": "Martin K", "ReviewID": "UR26783691", "Content": "Can't complain about value for money and location but the corridor on the 4th floor smelt of bo, travelodge have since advised me they have a plumbing problem and currently fixing it.", "Date": "March 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Londonderry, New Hampshire", "Title": "“Good enough to come back a second time”", "Author": "TiptreeGirl", "ReviewID": "UR26663835", "Content": "This is the second year that I have stayed at this hotel. Staff is friendly and helpful, rooms are basic and clean and the saver price makes it a really great value.", "Date": "March 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cardiff", "Title": "“excellent location”", "Author": "Heather81Cardiff", "ReviewID": "UR26165962", "Content": "we have stayed in this Travelodge at least 3 times in the last year or so and have never once had a problem. It is in a perfect location, so close to Liverpool Street but it is on a quiet square, off all main streets. We tried the Travelodge on City Road once but it was so horrendously noisy. It is generally cheap if you book far enough in advance. The perfect location for a cheap stopover in London if you aren't planning to spend the whole time in your room! definitely recommended.", "Date": "March 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Devon, UK", "Title": "“Above average for a Travelodge”", "Author": "DCTH", "ReviewID": "UR26024675", "Content": "I was in London for a conference, but my hotel allowance isn't great, so my first place to look for a hotel was Travelodge. I've stayed in lots of Travelodges of varying quality around the country and in London. In London I've stayed at Travelodge Royal Scot, Marylebone, Farringdon, Covent Garden and Park Royal, but this one I would rate as the best one I have stayed in when in London. It is in a quiet area because everything else is either an office block or somewhere to get a snack at lunch time, there was nothing to disturb your sleep. The other guests at the hotel (or at least the ones I saw at breakfast) seemed to be business people on their own and not tourists. The hotel is also only a 5 minute walk from Liverpool Street Station and Tube. The hotel was clean (no funny smells up the corridor that I have smelt at other Travelodges), the lift was working and the staff friendly and helpful. So if you are looking for a hotel in London that doesn't suffer from traffic noise, then I'd recommend this one to you.", "Date": "March 11, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Dissapointed, as Generally Travelodge's are good.”", "Author": "RouseysTravels", "ReviewID": "UR26009039", "Content": "Think we had that once in occasion back luck. Booked our family room 4 hrs before we arrived as our weekend trip was off the cuff!! Location was great, no problems there, in a quite area no problems there. But we where on the first floor, lift was broken so not a bad thing! At night we found out that our window would not properly close/lock, so the 'noise' from outside was very audible! We had a 'mini riot' with about 10 youths and 6 police for about 90 Min's, where language was choice, not nice when you hear ever word and your 8 year old has no option but to hear it!! The customer toilets outside the bar had a very strong urine smell that drifted along the first floor on your way to breakfast, and at breakfast the food was not all available at the same time!! Overall travelodges are a great place to rest, clean and tidy and at a very good price, but on this occasion, not up to scratch!", "Date": "March 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lincoln", "Title": "“Good Value and Location”", "Author": "Claireypopz", "ReviewID": "UR23222828", "Content": "Stayed here recently for one night. The room was clean but need a little redecoration maybe. However with the room rate you can't complain and after all when in London you never spend much time in the room anyway. The staff were fairly average. The location was excellent, only a few minutesâ€™ walk to the tube station and the area in general felt safe to walk through at night. The only downfall is that there isnâ€™t a free luggage hold so we had to pay for the service at Liverpool Street station which was around Â£7.50 per item per day however as this was fairly close by wasn't too much of an issue. I would certainly book this again due to the location, especially when the room rates are on offer.", "Date": "January 3, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Hartlepool, United Kingdom", "Title": "“good location”", "Author": "hangus_8", "ReviewID": "UR23216383", "Content": "hotels a bit dated but as with most travelodge's cheap and you get what you pay for good location for getting around on tube etc", "Date": "January 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Irvine, Scotland", "Title": "“You only get what you pay for!”", "Author": "davemac617", "ReviewID": "UR20879133", "Content": "Had stayed in this hotel last year so knew what to expect, or so we thought! Arrived a wee bit early but girl on reception wouldn't let us check in until three, to check in early or to leave your luggage you pay an extra Â£10. We arrived early (1 hour) last year and they let us check in no problems. Once checked into our room on first floor discovered window wouldn't shut properly, cold water tap came off in my hand and fold down bed was falling to bits (family room). Asked, and was given another room immediately on fifth floor. Room was fine, clean and comfortable and everything worked although was supplied with only one towel everytime cleaners had been. My wife and I in room. Really annoying having to trudge up and down stairs all the time because during our whole stay, 3 nights, lift didn't work. Just as well we are all reasonably fit. The corridor outside our room stank of dampness or something. Overall, general maintainance seems to be neglected and hotel is a bit shabby but for price and location hard to beat.", "Date": "October 14, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "cheshire", "Title": "“Excellent location”", "Author": "c8320", "ReviewID": "UR20524051", "Content": "We had a FANTASTIC time in London on 28th and 29th September. The hotel is obviously basic, and as we only paid Â£29 for the room this was all we were expecting! However the room was very clean, and in a perfect location just a few minutes walk away from the underground. Check-in time was 3, something they arent very flexible on! We initially arrived at 2.10, the guy on reception was extremely rude and very unhelpful - just grunting loud enough for us to hear 'check in is not until 3'. So we waited outside for 40 minutes, which wasn't too bad as the weather was ok but it isn't something you would want to be doing in January! When we returned to the hotel at about 2.50 we were greeted by another member of reception and she couldn't have been more helpful. She even gave us a map which was attatched to lots of discount vouchers for various attractions and restaurants. Once we arrived in the room it was of a reasonable size, and had plenty of storage space for a short stay. The bed was very comfortable, and theres also a plasma in the room. Bathroom was very clean, and the noise was minimal. London is brilliant, theres lots to see and do so plan your time wisely. DONT but theatre tickets in advance as they are so much cheaper buying them on the day. The tube is very easy to work out, and the underground staff were generally very helpful. We ate in China Town on the first night and the food was excellent.", "Date": "October 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "glasgow", "Title": "“Great value”", "Author": "shazzie_canuck", "ReviewID": "UR20510758", "Content": "The hotel is within a 5 minute walk of Liverpool Street rail station and excellent value at the Â£50 we paid for a double room. The room was clean and comfortable and a great base for exploring London", "Date": "September 30, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "leicester", "Title": "“great value and very well situated”", "Author": "tigers8880", "ReviewID": "UR19871316", "Content": "i stayed at this hotel 5 and 6 september and have nothing but praise.the hotel rooms were clean and reception staff efficient and check in was no problem.i asked for a sheet for the sofabed and this was sent to me immeditaly.it is very handy for visiting most of london as liverpool st station is less than 5 minutes away.there is a tesco metro store within 5 minutes and plenty of eating places within the station if you are booking a travelodge dont expect 5 star luxury for less than a 100 pound,but you will be surprised at the size of these rooms and the good cleanliness of this one i worked 17 years in the corporate travel industry and would reccomend this hotel", "Date": "September 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chester", "Title": "“A very good if suprising experience”", "Author": "browny28", "ReviewID": "UR19436026", "Content": "I stayed here whilst in London to see George Michael, I paid Â£29 for the room and felt it to be very good value. Travelodges are much for muchness but this one is situated in a quiet square, on the edge of the financial district (round the corner from The Guerkin), away from the main road and consequently a very good nights sleep was had. The room was small but spotlessly clean and check-in/out was efficient. and the bed was super comfy. The hotel has it's own bar/cafe but we didn't use it as the area around Liverpool Street has plenty of amenities, shops, supermarkets, pubs and places to eat. Overall a very good experience.", "Date": "August 27, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“For the price it's great !!!!!”", "Author": "Codmother", "ReviewID": "UR18853429", "Content": "Having stayed in a number of Travel Lodge's we were pleasantly surprised with this one. We accept that you get what you pay for and that the rooms are basic. This was huge (in comparison to others) the bath room weas enormous and you didn't feel like you were in a shoe box. The room was spotless with tea and coffee a plenty. There is a lack of toiletries but \"you get what you pay for\". The area was fine as the underground station was 5 minutes up the road. Brick Lane / Petticoat Market etc was on the doorstep along with assorted takeaways / restaurants / pubs + clubs etc. The only thing that let it down was the negative attitude of staff (which appeared to be all foreign) they seem to have a don't care less attitude. We stayed 3 nights for the price of Â£88 so all in all a bargain. Get yourself a bargain with this hotel ..... book early abnd get the best deals.", "Date": "August 11, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Good location but very noisy”", "Author": "IsabelUk", "ReviewID": "UR10006177", "Content": "We stayed in room 616, and at 4am we had a very loud sound (sounded like a generator) and the vibrations of the entire room felt like it was going to take off to space. This continued till about 7 am! eventually we moved rooms only to find out the other side of the building had builiding works...more noise!", "Date": "September 26, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "saltash, england", "Title": "“smashing location”", "Author": "trid33", "ReviewID": "UR8750740", "Content": "Would reccomend staying here for two main reasons. 1. Price - Â£52 for a two night stay in central London can't be bad 2. location is brill 5minute wlak for liverpool st then just go and see london.", "Date": "September 18, 2007"}], "HotelInfo": {"Name": "Travelodge London Liverpool Street", "HotelURL": "/ShowUserReviews-g186338-d224754-Reviews-Travelodge_London_Liverpool_Street-London_England.html", "Price": "$116 - $206*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1 Harrow Place</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">EC1 7DB </span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "224754", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/87/68/8768f281c3d6932083fda078a66f5b881large.jpg"}}