{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "", "Title": "“Overpriced, bad staff, fights, beaten prostitutes”", "Author": "AngryBirdMSP", "ReviewID": "UR124839817", "Content": "First off, I knew I was booking two rooms super bowl week. I knew I would pay too much. But I hoped it would be clean and decent. I am a many year member of choice hotels and have earned well over 1,000,000 points. With that said. Tried to check in and staff says. Internet should have not let you book your rooms so cheap. We may not be able to give you those rooms at that price. I'm like what? 300 a night for a normally a 70 dollar a night room. So after 30 min we get room. Get in room. Room is tired, wore out. And needs cleaning bad and paint and rehab. Besides Budweiser has made it one of there hotels and the place is decorated beyond tacky. Also hotel has contract with trucking company. Nothing but lines at the counter at all times. And always maid carts. Even though. It doesn't seem clean. Then. Besides fights in hallways. Prostitutes getting beaten up and cops. Still room still dirty. Hallway dirty. So yes I would never advise anyone to stay here. 6 nights two rooms 3700 bucks. I feel screwed. Lol", "Date": "February 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hamilton, Canada", "Title": "“Stayed here super bowl weekend”", "Author": "sdothbc", "ReviewID": "UR124718217", "Content": "The Quality Inn & Suites was a decent hotel, but hopefully with the money they made from super bowl weekend they can make some much needed improvements. The room was fairly clean, but outdated, which means it had some old stains and marks on the walls, nothing major but clearly needed some updating. The bathtub leaked water so everytime I showered I had to dry up the pretty much 3/4s of the bathroom floor, and the tap didn't really produce hot water. If you tried to hard to push the faucet to the left to get hot water, water sprayed everywhere. The worst problem for us was the phone system- it was impossible for us to make a call back to Canada. We tried every option on the system, spoke to a couple people at the desk, and there was absolutely no way to make a call, we couldn't even reach an operator, and there are no payphones in the vicinity(are there any payphones anwhere anymore?). But these were really the only issues with the room I had, as well as the soundproofing, we could hear a fair bit from other rooms. Nothing major that would make me avoid the place. The wi-fi, if you're interested in that, is available in the hallways and lobby, but not the rooms for some reason, doesn't bother me but I know other guests were a little put off by it. As for the positives- staff was very friendly and helpful, everyone I talked to at the front desk through the duration of our stay always did their best to help us out. The beds were clean and comfortable, although they had these tiny pillows that were about 1/2 the size of a regular pillow, comfortable enough but you needed 2 of them to sleep on. There was plenty on tv for the rare times we were in the room, the temperature control worked great, and I think the biggest upside to this hotel is the location. It is only a short drive into Indy. There was a waffle house right out front and a convenience store beside it for snacks and other necessities. Overall, the hotel isn't a 5 star or anywhere close, but for a hotel with a great location relative to both the city and the airport, that will get the job done for a couple nights, I would say this hotel would fit the bill.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Illinois", "Title": "“Not a Bad place, but poorly managed and staffed”", "Author": "JnR2", "ReviewID": "UR122377786", "Content": "We made reservations 1 day in advance (Friday evening, after 7:00pm), for two nights, for Saturday and Sunday. When we arrived Saturday, the desk clerk told us we were listed as a \"no show\", because we were suppose to be there on the previous day and she couldn't tell us whether or not we were charged. We then were told we were quoted the wrong rate and rates were going up the next day. When we gave her our confirmation number she replied \"I can't do anything about that and there is no manager here.\" We were later told we were not charged the \"no-show\" night. She gave us the original rate for one night, but quoted a higher rate for the next night. We stayed only one night, went somewhere else for the second night. When we asked if she could correct the no-show, we were told again \"I can't do that, only a upper manager can correct that.\" The room was OK , a large king, with the small pillows, appeared clean, not a problem. The indoor pool and hot tub were sufficient, however the water had a dirty tint, and the floor was filthy as evidenced by the dirt from our feet when we dried off. Breakfast was biscuits and canned gravy, waffles, and the usual cereal and pastries, orange and apple juice. No fruit, yogurt, or breakfast meats. There is a fee for internet use in the lobby. The motel is located in the airport area, with easy access, parking, 3-story w/elevator. Overall, the facility is average, but we feel the desk clerk was somewhat \"cold\" and had multiple excuses for not being able to correct the no-show error, and the fact she had no authority to correct the rate problem was not acceptable. This would make our second stay at this facility, but we will not stay here again. There are other equal/better places, with less hassle and in the same rate class.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Little Rock", "Title": "“check the sheets”", "Author": "Clearsailing", "ReviewID": "UR121471514", "Content": "There was dried blood, not a previous blood stain, but a large spot of dried blood on one of the double beds. Sheets on this bed were not washed before our arrival. Also, dirty laundry was in one of the drawers. Management was unresponsive to our requests to address the problem.", "Date": "December 6, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Champaign IL", "Title": "“Forget late-night reservations”", "Author": "cinzian", "ReviewID": "UR115292077", "Content": "We decided at the last minute to overnight near the Indy Airport for an 8:30 a.m. flight. We live several hours away and felt it’d be safer to make a late-night rather than early-morning drive. We called Choice Hotels near midnight and reserved a non-smoking room with two doubles. It was just two of us, but we like to spread out when we travel. Operator noted two such rooms were left, so we took one. Upon arrival at 3 a.m., we were told the room was being cleaned. We didn’t go elsewhere, because the reservation was non-refundable by this time of the night. Finally checked in at 3:20 a.m. only to get upstairs and learn it was a smoking room. I can’t breathe in that. Back at the front desk, I told the clerk that the operator had said two rooms were available. If the rooms weren’t ready to go, they shouldn’t have listed them as available. His response: “We have the rooms, they’re just not cleaned.” We finally ended up in a non-smoking room w/a king-size bed. Though we adjusted for the situation, we lost an hour of sleep waiting for an “available” room. I’d recommend staying elsewhere.", "Date": "July 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Louisa, Kentucky", "Title": "“Very Nice”", "Author": "Richard41230", "ReviewID": "UR98271630", "Content": "I loved the hotel, I have stayed at a few but not many. I can honestly say that i have only 1 complaint about the whole experience which is the hard bed i had to sleep on . It was absolutly worth the price though because i got very good room service and it was quiet in the room and also has a pool and a jacuzze (spelling). I didnt use either one but they look very nice and big. Everyday i would leave and come back at the end of the day and the room had brand new (folded) towels and coffe packets, made bed and pillows, clean trash bags and ash trays, ice bags, toilet paper and it had a safe inside your room which you have a code to if you ask for it. (might cost extra) . The cleaning lady done a very nice job. I was amazed at the price because the value you get and cleanliness and very nice staff was well worth 52 $ per night. they have vending machines and pop machines, A nice tv in the room w- remote that actually worked, the room had a heater/ ac and it worked very well. Not to mention the little fridge they had in the room was a very good thing to have ,so i didnt even have to use the ice bucket at all. I stayed here a week and i was very happy and to be honest i didnt want to leave because its hard to find the quality in a cheeper priced hotel like you find there. I would recomend this hotel to anyone.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Champaign, Illinois", "Title": "“Great Value - Clean Rooms - Comfortable beds”", "Author": "DLP53", "ReviewID": "UR74273242", "Content": "We have stayed at this hotel several times - the most recent stays were a week apart in June - July bookending early morning and late night flights into/out of the Indianapolis Airport. We have always found the service to be very good, the rooms exceptionally clean. On our most recent trip, which involved stays in several different places, my husband kept saying \"This bed isn't as comfortable as that one at the Quality Inn!' In fact, when we returned, we were taking off the sheets trying to find out what kind of mattress it was! So, in reference to the review that states there were bed bugs here, I can positively state that was most certainly NOT our finding. (We didn't find a label either. :( ) Rooms include a small refrigerator and a microwave which is unusual for a hotel in this price range. The breakfast buffet is well attended and includes a hot entree, a waffle maker. Hard boiled eggs, fruit, yogurt and bran cereal are availble for those like me who are trying to make healthier choices. This hotel is set back far from the road, so I don't get the people complaining about road noise, either. We have never had it be a problem And, with the relocation of the Indy airport farther south, the Sam Jones expressway probably is not now getting the traffic it formerly did. You can also park you car here for a small feel. Shuttle service is provided to/from the airport. Beats airport parking rates. Bottom line: I don't think you will be disappointed. We weren't, and I will definitely making this my hotel of choice when flying from Indy.", "Date": "August 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Germantown, Tennessee", "Title": "“Terrible Service”", "Author": "nickel1612", "ReviewID": "UR70220541", "Content": "I have stayed here a couple of times and both times I had terrible service. First the good things. The location is close to the airport and there are restaurants nearby. That's about all. The rooms in general need to be updated, they are old and my sink was leaking. The first time I stayed there I was signed up for the airport shuttle at 6am. I signed up the night before. When I got to the shuttle in the morning the capacity of the van was ten and there were thirteen people with two of us left behind. I asked the front desk what happened and they said they didn't know,The front desk then offered to call a cab, of course I was to pay for it. By the time the cab came I barely made my flight. The next time I stayed there I recieved a wake up call I didn't ask for at 3am. I understand things happen but when I brought this up to the desk agent he didn't even appologize. It just seems as the staff really doesn't care about customer service. I would not suggest staying here.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Westerville, Ohio", "Title": "“So-So”", "Author": "fbrusca", "ReviewID": "UR37266821", "Content": "We booked rooms at this hotel because they were pet friendly and the rate was decent. The hotel is right next to I-70 and the highway noise was at times deafening. The rooms was clean but cramped. The beds were fairly uncomfortable (both of us woke up with aching backs). The pool was OK, but it had no AC and it was like a sauna in there. My biggest beef was the Internet access. The wireless coverage did not go further than the lobby. In the room I had to use the wired service - which would have been OK, but the supplied ethernet cable (12 feet long) was way too short.", "Date": "August 10, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Decatur, IL", "Title": "“Bedbugs!!”", "Author": "janie64", "ReviewID": "UR26131124", "Content": "I have never written a hotel review in my life, but finding bedbugs compelled me to do it. Fortunately, the bug came out before we got in the bed. I caught it & took it to the desk. The girl didn't seem too concerned. We left & stayed at the Candlewood nearby- which was very nice.", "Date": "March 13, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "indianapolis", "Title": "“Bugs and Spiders”", "Author": "wallfly", "ReviewID": "UR24347439", "Content": "i stayed at the hotel and there were guests that checked out with complaints of bugs and quote lice in their room. I myself received a spider bite while I was there and had to go to the emergency room and there appeared to be other guests that had similiar problems that required trips to the emergency room. I would not recommend this facility", "Date": "February 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Loveland, OH", "Title": "“Slept very little”", "Author": "mysei", "ReviewID": "UR19491017", "Content": "Had an early flight so I thought I would drive to Indy and stay overnight and save some time for sleep. What a mistake. I slept very little because of the expressway that was right outside my window. Trucks were rumbling by the entire night. I literally did not sleep the entire night. I would not stay there again.", "Date": "August 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Champaign, IL", "Title": "“Cant complain, espically for the price”", "Author": "Elliotterae", "ReviewID": "UR15972860", "Content": "We booked a non-smoking double beds room on Thursday for Sat night (mothers day weekend) on priceline for $52 We were very pleased with the value of our accomodations. At check in, the clerk was friendly, not super outgoing or extra helpful but it only took about 30 sec for her to ask my name and give me my key. We were on the second floor, close to the elevator. The room was clean, and although not fancy or spectacular it was more then expected. The bedspreads were not super attractive to me (gold damask) but they looked brand new. There were 4 pillows on each bed. The room had a microwave and mini-fridge. Everything seemed well maintained, the only flaw I saw in the room was an area above the shower that had a few spots of peeling paint that could be repainted (I was looking for a flaw to mention or I would not have found/noticed this). The bed was a bit firm for my liking but my husband said it was more comfortable then our bed at home. The pool had a bit too much chlorine but it was very nice. Plenty of towels and chairs and the water was a very nice temperature. I am a cold water baby and usually skip swimming with the kids and husband to sit in the hot tub but the pool here was warm without being so warm it felt like bathwater. The continental breakfast was great. Waffles, cereal, eggs, yougurt, bagels, biscuits and sausage gravy, fresh fruit, 3 types of juice and multiple types of muffins/danishes. Very good value there as it would have cost our family nearly $15-20 to go get coffee, juice and waffles elsewhere for breakfast. I had only 2 complaints- the first one can not hardly be helped when in that close proximity to the airport and major hwy. It was a bit loud at nigh. The fan covered most of the noise but I am a light sleeper and next time I will bring ear plugs if we stay here again. (The rest of the family had no problem with this but if you are a light sleeper too you might want to take it in to consideration) The other is the floor in the bathroom. It is clean and in good condion but instead of tile or a textured linoleum it is a smooth surface. Both of my children slipped and fell even though I had the bathmat down. (the mat obviously doesnt cover the whole floor). Acutally they both slipped and fell twice and I was even in there with them. The surface is just the type with no texture that when even a little bit wet is very slick- not a good choice for a bathroom. Overall I would choose this place again if ever I need a place for a quick trip to Indy. Especially if I was taking an early flight.", "Date": "May 12, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Portland, Oregon", "Title": "“Clean, comfortable, a little small”", "Author": "timekid", "ReviewID": "UR12828746", "Content": "My wife and I stayed here while traveling from point a to point b. We stopped in Indy to see friends on our way home from being with family. The room was clean and well-maintained but small. The wireless was virtually impossible to use but a wired connection was available. Staff were extremely helpful and friendly both at check in and at departure. The breakfast was standard faire--nothing fancy but not too minimal either. Our biggest complaint was that directions to the hotel were flawed. Fortunately, we're not directionally-challenged and figured it out quickly.", "Date": "January 20, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Indiana", "Title": "“Hope to never experience again!!”", "Author": "GramgramIndiana", "ReviewID": "UR12742081", "Content": "I went to Indianapolis because my granddaughter was in a Christmas play at her school. After the play my granddaughter stayed with me. Her mother later joined us so she could take my granddaughter to school the next morning. During the night about 2:00 I awoke because of the street noise. I turned on the bath light looked to the other bed and noticed a dark place. I then turned on the light and it was blood. I thought that one of them had a nose bleed. Looking more closely there were BUGS crawling on both of the beds. I immediately awakened them and called the front desk. They sent an employee and of course they put us up in another room. The next morning I washed our things and thought the manager would come up but he nor his assistant made any effort. I checked out and once I was home I researched what the bug was. They were BEDBUGS. They were filled with blood when I tried to save them as proof. I emailed the manager told him I would not pay for the room. Of course I did get an apology....but was given and explanation as to how sooo many travelers go in and out of their hotel and sent me a free one night stay which I returned. There was no excuse what so ever what we had to go through!! So beware and check the mattresses out because I know I will the rest of my life!", "Date": "January 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Could Have Been Better”", "Author": "Dancing_Boy", "ReviewID": "UR10088029", "Content": "I had read previous reviews about the noise from the freeway so I requested a non-freeway room. I got a freeway room. I wanted to print out my Southwest boarding pass for the next day. Their printer was broken. I wanted to check my e-mail. The high speed internet didn't work and the number provided to fix it... well 40 minutes later... the room was fine and the air/heat was fine, but for 71 bucks, I expected a lot more.", "Date": "October 16, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "West Lafayette IN", "Title": "“Very Noisy, worn around edges”", "Author": "azogal", "ReviewID": "UR5931846", "Content": "I stayed here in October 2006 before catching a morning flight out of Indianapolis. I booked this hotel because of the good reviews here on trip advisor. I have to say that I think that this time the reviews here steered me the wrong way. The front desk was very helpful, but I felt that many other hotels near the airport provide the same services (free parking, airport shuttle, high-speed internet, and breakfast) without the major negative of being very noisy. The reason to spend the night near the airport before a morning flight is to get a good night's sleep and to be closer to the airport. I didn't sleep at all because our room faced the interstate and we heard noise all night long. Also, the rooms weren't exactly dirty, but they didn't exactly feel clean either. After our trip, when we called for the shuttle to pick us up at the airport, we waited about 15-20 minutes (and the first time the driver drove right past us so we had to call back) which seems long given that the hotel was only 5 minutes from the airport. I would say this was an \"okay\" place to stay, but other airport hotels probably provide the same services in a newer, cleaner facility, so I will stay someplace else next time I have an early flight. If you stay here, request a room on the parking lot side of the building.", "Date": "October 9, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Illinois", "Title": "“wow, this was a surprise”", "Author": "ldasz", "ReviewID": "UR5435884", "Content": "We did the park-n-fly rate for this hotel on our way to the airport for Mexico June 16, 2006. When I booked this hotel, I thought another $99 for nothing, it seems lately every little hotel (Quality Inns, Super 8's etc.) are going to the dumps. I think they are all getting bought out by the wrong people, that could be the problem, I don't know??? Anyway, this hotel was quite a surprise, the beds were actually quite comforable even. The pool and the hot tub were great. We left for the airport at 5:00 am, and there was even breakfast ready. They even had biscuits and gravy. We always fly out of Indy, so we will definitly stay at this hotel again!", "Date": "July 7, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "St. Louis, MO", "Title": "“Great People & Very Accomdating!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5375204", "Content": "Sometimes you don't know what you will get when you stay at a hotel but this hotel was more than I expected! We got there after a long drive and found the pool & hot tub to be very enjoyable & relaxing. They did a happy hour which was nice & the girl at the desk was very pleasing to talk to and we felt very welcomed. The next morning they served a breakfast that was a lot more than you see at most economical hotels. Not just a donut, this breakfast had biscuits & gravy, waffles, muffins, hard boiled eggs and lots more! Very impressed & again had a nice person that checked us out in the morning.", "Date": "June 22, 2006"}], "HotelInfo": {"Name": "Quality Inn & Suites Airport", "HotelURL": "/ShowUserReviews-g37209-d224819-Reviews-Quality_Inn_Suites_Airport-Indianapolis_Indiana.html", "Price": "$69 - $183*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2631 S. Lynhurst Drive</span>, <span class=\"locality\"><span property=\"v:locality\">Indianapolis</span>, <span property=\"v:region\">IN</span> <span property=\"v:postal-code\">46241</span></span> </span> </span> </address>", "HotelID": "224819", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/69/96/6996fa3a95a084effe051199ed1252983large.jpg"}}