{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Will never stay anywhere else in Indy!”", "Author": "MarineWife211", "ReviewID": "UR124367441", "Content": "This is the second time I have stayed here. The front desk receptionist is beyond excellent when it comes to customer service. We stayed here last time in November 2011, and she remembered my 3 year old son by name this time (now February 2012). She went above and beyond making us, especially him, feel at home. The rooms are great. I stayed in the room next door to the one I stayed in last time I think, but both are exceptional. Large living space with flat screen tv, along with another flat screen tv in the bedroom. Everything was super clean, and I felt completely comfortable. Last time we stayed was great, and I have learned this time that our last experience was not an exception. This place rocks, and we will be back every time we travel between home (NC/VA) and Iowa. I intend to get the receptionist's name because she deserves a review all her own for making my son feel so special. When you please a child, you ultimately please their mother, haha! In case it wasn't clear, the rooms are fantastic. Very modern, very clean, with everything you need. Couldn't ask for more! Neither room I've booked have been wheelchair accessible so I can't mention them, but these two are great!", "Date": "February 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Randolph, mA", "Title": "“A decent stop”", "Author": "Teddy K", "ReviewID": "UR121050066", "Content": "I don't really understand some of the reviews for this hotel. It seems like they may have some rooms with dated interiors, while others - such as the one I stayed in that are quite clean and modern. I stopped here on a cross-country drive from LA to Boston and will say that these were the largest rooms of the hotels/motels I stopped at. Two HD TVs, one in the living room and by the bed, which helps out, say should you be driving with someone who has different TV watching habits. The rooms were clean, the beds comfy and breakfast was decent with scrambled eggs, cereal, coffee and OJ to mention a few. For the price, this one was under $70), this was a relaxing respite. Right off I-270 and five miles from I-70. The reason why I’m giving this place a 4 ranking is because the service didn’t leave any impression whatsoever. Going across country, Indianapolis struck me for having some of the nicest and talkative people I’ve met (of course I was only in town for about 16 hours), and staying at this hotel, it didn’t match up to that. And while there’s the cheapest gas station across US-36, there isn’t much else around. When we asked the front desk clerk where there were places to eat, she directed us west on US 36. It felt we could have driven back into Illinois before we saw a restaurant. Luckily about a mile down the road, we discovered a great pizza place, Circle City Pizza, so we never had to discover how far the strip of restaurants were. I chose this location for the fact that it was between the I-70 & the Indianapolis Motor Speedway, and while I’d recommend the location, would be open to finding another hotel/motel if it were more convenient.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Wellsboro, Pennsylvania", "Title": "“Worst hotel stay ever”", "Author": "Nick P", "ReviewID": "UR119457757", "Content": "checked into the hotel early in the morning was the only good thing about it. We drove 11 hours to the hotel and stayed 3 nights. When we got there and into our room we noticed it was very dusty, there was about 1/2 of dust in the vents to the AC and Heat. The door to the heating and AC unit was open, it was a full size door, on the heating and AC unit there was even more dust, FIRE HAZARD, the inside of the door was caked in dust also. We decided to stay in it since we drove thro the night. Also the toilet seat was very disgusting and broke. Lights were not working also the electrical outlets didnt work and there was an iron burn in the rug, trash still in hotel room on the floor. One more thing of it was that the window didnt have any safety features on them, not even a screen. We were on the 2nd floor and we have 2 kids that could have opened the window and fell out. We informed the front desk and they said that they would take care of it. After being out of the Hotel for most of the day, we returned to the lights and outlets not working and nothing done to our room. They wanted us to pack and move to another room after we told them that we had 2 little kids who were sleeping. The next morning we went to switch rooms and the room they gave us the phones were not working, tv's were not plugged in, and only 1 tv remote for 2 tvs. Finally got another room which was OK. There were safety features on the window of this 3rd floor room. We returned to the room the next day and our keys didnt work. We went to the front desk and they said that they should work but then gave us new keys. We went through 16 keys the whole stay there. While leaving the room later that day the door lock catch on the doorway came off and the lady at the front desk said that she might find screws and fix it. Before we left the room we also found mold and mildew on the shower curtain", "Date": "October 18, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Champaign, Illinois", "Title": "“Fair hotel”", "Author": "jgmaa", "ReviewID": "UR115218758", "Content": "Stay was ok, just needed the room for the night. It was clean, employee was friendly. Only issue was the forever running toilet so if you are a light sleeper as I am it was a bit annoying.", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "1", "Location": "1"}, "AuthorLocation": "New York City, New York", "Title": "“Dingy hotel & room”", "Author": "metzie", "ReviewID": "UR82914617", "Content": "After driving over ten hours, all we wanted to do was get some rest. First off, this is not close to I-70. You drive through some very sketchy parts of town. We felt isolated when we arrived at the hotel because the surrounding area was iffy. We went into the hotel room, it was hot and very stuffy. Our eyes quickly focused on a large circular stain on the bedding. The room overall was very depressing. The bed looked like someone just slept on it. The room also appeared to be not 100% cleaned and prepared by housekeeping. The best part was the free internet, which we used to book a new hotel in downtown Indy. We checked out within 15 minutes. I have no clue what these other people were thinking with their reviews.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Blandon, Pennsylvania", "Title": "“Great Place To Stay For The 500!”", "Author": "RaceTrackHunter", "ReviewID": "UR71229952", "Content": "Stayed here for two nights while attending the Indy 500. Very nice hotel. Very nice, very helpful staff and a clean, comfortable room. Visited some friends and did some sightseeing while there, so cannot really comment on the anemities (pool, breakfast, etc.) but I'm sure they are fine based on the service we received and the cleanliness of the hotel. Lots of good place to eat nearby and not far from the track. Had a very enjoyable stay and will return here for sure next time we are in Indy.", "Date": "July 17, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Warsaw", "Title": "“What a RIP-OFF!!!!”", "Author": "warsawgrandma", "ReviewID": "UR68698111", "Content": "My husband, myself, and 8 yr old daughter--plus My married daughter, her husband, and a 4 month old grandaughter had to travel to Indy for my grandaughter to see a physician at Riley Childrens Hospital. Yes we booked on the phone and was told they had an indoor pool. But when we arrived--THERE WAS NO POOL--like we had been told. My husband and son-in-law went in and tried to cancel the reservations. The desk clerk said that she was unable to cancel the reservation for us--I guess because we had booked on the phone. We made several attempts to cancel the reservation on the phone--but kept getting foreign help--who did not understand what we were trying to say. To make a long story short--they are now charging our credit card--as a no show--HELLO--We were right in front of the building!!! Trying to get the matter resolved!!! So I would say--BEWARE!!!!", "Date": "June 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Helena, Montana", "Title": "“Nice Hotel”", "Author": "bemyguestMT", "ReviewID": "UR63113939", "Content": "Staff needs to be in uniforms (especially night auditor). Stayed 2 nights, a Thursday and a Sunday. Hard to find with construction and when I called the hotel to see where it was from the Microtel, she did not know where the Microtel was - it was just on the other side of the Interstate. Halls and rooms need \"edging\" - much dust. Airport transportation was convenient - but I was surprised they charge tax on this service? (requirement in IND). Hotel was not as close to the airport - but then the Indy airport is all grown up now.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "ohio", "Title": "“Bring shower shoes”", "Author": "Qyet", "ReviewID": "UR35368127", "Content": "I make a visit to Indy by car and pick up a travel coupon book at a rest stop. The coupon advertises this establishment with new rooms, I disagree. I arrive with the coupon and they approve the rate, the hotel clerk was nice by the way. This is a 3 story hotel and we were placed on the 2nd floor. The elevator is not fully visible like a normal one would stand out. You have to go down the hallway a bit and like a door to the side in a house hallway you spot it. Arriving to the 2nd floor, the hallway smelled stale/old smoke residual-like and the whole floor is a nonsmoking floor! Inside the room there is a hint of mildew aroma, blah. This is a suite with 2 TVs, mind you both TVs shared ONE remote. The tub needed more cleaning, dingy...brought my showers shoes though. The towels did not have any fluff to them, but they were clean. The bed didn't appear to be a queensize. The mattress was hard, top cover was nice and clean, however the sheets were dingy and torn. I found a few strands of hair in the sheets, which makes me wonder if they changed the bedding at all. We slept on top of the blanket that enveloped the sheets. I was unable to partake in the free breakfast in the a.m., but the next lot over is a Bob Evans for all your breakfast, lunch and dinner needs. The breakfast here was great. I only used this hotel to sleep and shower. Pass this one by, not worth the coupon value or otherwise.", "Date": "July 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Knoxville", "Title": "“great location and great room”", "Author": "utvolsknoxville", "ReviewID": "UR32542213", "Content": "When I arrived to the hotel it looked great. Right when I saw it from the outside I knew it was going to be a good stay. Was I correct. Everything from check inn to checkout was great and very smooth.", "Date": "June 17, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Indiana", "Title": "“Park and Fly. Or Not.”", "Author": "Traveledon", "ReviewID": "UR5602330", "Content": "Overall, this is a serviceable, though somewhat spartan, hotel that is somewhat farther from the Airport than most alternatives. We chose it intending to leave our car for a week while we flew out of town, thus requiring that we avail ourselves of their free airport limo early the next morning, and again upon return. However we were not informed when we made the reservation that their limo only runs from 6 AM to 11 PM, which would get us to the airport too close to our departure time, and require extraordinary luck and hustle for us to catch the last limo of the night when we returned. We had no choice but to abandon our plans and drive to the airport the next morning, incurring an additional $50+ charge to park there. When we complained to the front desk of the hotel, we were given a $10 discount, lowering our rate to the posted rack rate for the room, which was was still $15 more than we would have paid had we originally booked their least expensive alternative rate. We have previously stayed at several hotels closer to the Indianapolis airport that provide 24-hour limo service in conjunction with their Park and Ride plans, and if we find such service is still offerred the next time we fly, we will definitely choose one of them, even at a higher cost. Our room had a refrigerator and a microwave, though we didn't have the opportunity to use either, so we can't comment on their functionality. Nor did we try the hide-a-bed provided in the \"suite\" part of the room. The hallway smelled strongly of smoke, though we were on a non-smoking floor, and the elevator temperature was probably over 90 degrees (the room temperature was fine). The room was reasonably clean, though as noted above, it was pretty bland and utilitarian for a suite hotel. We think there are much better options.", "Date": "August 11, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Blanchester, Ohio", "Title": "“Not so great”", "Author": "A TripAdvisor Member", "ReviewID": "UR4740309", "Content": "This is a hotel that we \"discovered\" on our getaway to Indianapolis. We love the city and this hotel provided room and amenities for our family. On our last trip, this would make our third visit there, we found food in the frig and cabinets, the shower head was off and the hot water did not work. To make matters worse,my children found used condoms in the pull-out. The staff was not helpful, nor did they appear to be shocked by our encounter. We received different responses depending on the shift change and no one was working with us to make this situation better. I had to be the one to request a new room, it was not offered. No one apologized.This experience was horrible, no one should have to see what we saw. Even after contacting the corporate office, who said that they would investigate, we did not reach a resolution nor did we ever hear from them. They have lost my business.", "Date": "March 28, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Winter Haven, Florida", "Title": "“A great suite!”", "Author": "awar58", "ReviewID": "UR3507885", "Content": "We had an early flight and decided to stay at this hotel since it was close to the park/ride/fly where we had to return our rental car. The hotel was really much nicer than we expected and the staff was great. For a total of $94 we got two double beds in one room and a sleeper sofa and table and chairs in another, each room had a TV. In between rooms was a fridge, microwave and sink, along side a makeup desk. A really great deal!", "Date": "May 29, 2005"}], "HotelInfo": {"Name": "BEST WESTERN Airport Suites", "HotelURL": "/ShowUserReviews-g37209-d224809-Reviews-BEST_WESTERN_Airport_Suites-Indianapolis_Indiana.html", "Price": "$82 - $152*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">55 South Highschool Road</span>, <span class=\"locality\"><span property=\"v:locality\">Indianapolis</span>, <span property=\"v:region\">IN</span> <span property=\"v:postal-code\">46241</span></span> </span> </span> </address>", "HotelID": "224809", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/6c/b5/6cb56d3a1c7fcaaf888a4889708041276large.jpg"}}