{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "IL", "Title": "“Don't waste your money”", "Author": "grammajulie", "ReviewID": "UR27020624", "Content": "This place is soooo bad. It smells so bad and the sheets were yellow. I wouldn't keep my dog in that room. We only stayed for 5 min checked in and checked out. The pictures on the internet are a lie......... Not that hotel at all..", "Date": "March 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Jonesboro,Arkansas", "Title": "“Gerat value and close to speedway”", "Author": "Ralfrodent", "ReviewID": "UR20375349", "Content": "After reading reviews of this location I was afraid it had suffered from the previous years I had stayed there. I am glad I decided to see for myself. Evidently some folks can never be made happy! The rooms were clean and well taken care of. The staff was courteous and helpful. True,only coffee and no continental breakfast but the $47 room rate mare than made up for it. The key to good prices is book ahead. There is a resturant/bar accross the street that is really good and you don't have to drive. Unfortunately this location will be torn down in early 2009 to make way for the expressway interchange but the motel has not been allowed to \"run down\" in antipitation of this. I wolud definately stay there again.", "Date": "September 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Berlin", "Title": "“Simple place close to race track, too expensive”", "Author": "vvddss", "ReviewID": "UR20364179", "Content": "This Red Roof is pretty close to the race track, but not really nice and too expensive. For just a place to stay, there are probably better ones, but also worse ones. The price (walk-in w/o reservation) was $90 which is just too much for a simple place like this.", "Date": "September 25, 2008"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Novi, MI", "Title": "“Terrible Stay at the Red Roof Speedway”", "Author": "Berners_Travel", "ReviewID": "UR13636384", "Content": "I needed to find a hotel in Indianapolis and saw all the positive reviews on this one so I booked a room for two nights...bad idea! On arrival I was extremely disappointed as the grounds were not at all well kept and I didn't feel it was the safest area to stay at. When I walked in the room there was a strong musty odor and the heat was stuck on so I had to turn the air on (which was extremely loud) to cool off the room. The room may appear clean on the surface but the carpet was questionable and the bathroom wasn't very clean either. I'm not accustomed to cheap rinky dink hotels so this was a nightmare for me. The only reason I even stayed the first night was because we got in at 12:30 am and had to be up by 6 am. I hardly slept due to a very uncomfortable bed and the fact that I was concerned about the cleanliness of the linens. Needless to say I didn't feel comfortable taking a shower there so we pack up bright and early, canceled our next night's stay and didn't look back. We stayed at a Holiday Inn the following night that was such a huge difference in cleanliness and comfort. Red Roof did send me a survey which I filled out honestly. To their credit they did apologize and offer me a free night's stay but I don't plan on ever staying at a Red Roof again, free or not. If you care about comfort, cleanliness and basic hotel necessities don't stay here!", "Date": "February 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“Good Value for the Price”", "Author": "NancyWorldTraveler", "ReviewID": "UR7246937", "Content": "This hotel is very conveniently located to the airport and the freeway. It is a good deal for the money. Rooms are clean and well kept, front desk staff is friendly and helpful, lobby offers free coffee, parking lot is adequate and several restaurants can be found within a mile or two. I would stay here again in a heartbeat and I recommend it to others.", "Date": "March 29, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "St. Louis, MO", "Title": "“Great place to stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR5373895", "Content": "I have and will continue to stay at the Red Roof Inn in Speedway. I love the Indy 500 and stay there on qualification and race weekends. The GM of the Red Roof has worked very hard to make it a clean, safe and comfortable place to stay. I should know, I have stayed there every year since 2000. You could do far worse staying either in Speedway or Indianapolis. If you are on the west side of Indianapolis and want a place that would be relatively inexpansive and clean that this is the place.", "Date": "June 22, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Parker, Colorado", "Title": "“Simple, but sufficient”", "Author": "ackart", "ReviewID": "UR4496900", "Content": "I stayed here Feb 2006. This room seemed recently remodeled, clean and the bed was comfortable. THe people at the front desk were fine. My only complaint was the sheets were very worn. Ask for a hairdryer when you check in if you will need one. ALso I didnt see an iron in the room. No coffee maker in room but they had a coffee machine at the front desk. The price was right.", "Date": "February 23, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Columbus", "Title": "“Good Price, Standard Room”", "Author": "clboehm", "ReviewID": "UR3416772", "Content": "The motel was clean. It is your basic motel room. No frills, but the price was right. The management was very attentive.", "Date": "April 26, 2005"}], "HotelInfo": {"Name": "Red Roof Inn Indianapolis Speedway", "HotelURL": "/ShowUserReviews-g37209-d224821-Reviews-Red_Roof_Inn_Indianapolis_Speedway-Indianapolis_Indiana.html", "Price": "0", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">6415 Debonair Lane</span>, <span class=\"locality\"><span property=\"v:locality\">Indianapolis</span>, <span property=\"v:region\">IN</span> <span property=\"v:postal-code\">46224-3572</span></span> </span> </span> </address>", "HotelID": "224821", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/61/b8/61b885ef107654416197e47f1834dade1large.jpg"}}