{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "OKC", "Title": "“Went for the indoor pool - but never used it. Don't go for the breakfast!”", "Author": "lightsluvr", "ReviewID": "UR140335290", "Content": "My wife insisted we book a hotel with an indoor pool. This hotel has a very nice heated indoor pool, but we never used it. By choosing the Grand Victorian, we missed several hotels with lower rates, better locations and real honest to goodness hot breakfasts. The room was comfortable and clean. Gaudy Victorian furnishings and wallpaper fit the theme. Tea time between 2:00 and 4:00 p.m. didn't interest us. Traffic was scary day and niight trying to get on highway 76 - we were never told about the back exit of the parking lot. And now the breakfast. We arrived on a Friday - they offered waffles (long line and we never got one), a watery mixture of scrambled eggs and ham. They ran out of doughnuts by 8:30 and never restocked. White bread for toast but no jams or jellies. Coffees were lukewarm. The orange juice dispenser suddenly went \"out of order\". A big pot of canned fruit cocktail was the centerpiece of the breakfast. Yum. Anyway, we figured maybe we'll get Waffles if we go early on Saturday. HA! No waffles on Saturday. Instead they offer more of the same fare as Friday, plus some tiny biscuits out of a bag. All in all, the hotel was clean, fairly quiet. Staff was seldom seen, but maybe thet's just as well. For $100 a night, we'll look at other options next time.", "Date": "September 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oklahoma City, Oklahoma", "Title": "“couple get-away”", "Author": "mlheili", "ReviewID": "UR140282753", "Content": "Traveled to Branson as a one-night get-away; enjoyed this hotel so much we stayed additional night. Very unique decor in the various sitting rooms throughout the property. Will definitely stay again on future visits. Upper room at back side face the wonderful view of the Ozarks while front side give view of the strip; depends what you want to look at. We chose the back side and enjoyed day and night views. Two pools; one inside, one outside. Used both quite a bit. There wasn't a lot going on in Branson during the day that was of interest to us so we utilized hotel accomodations quite a bit. The only disappointment was the breakfast buffet was poor-pickings. Scrambled eggs, waffles, and the usual cold cereal and muffins line-up. Choices of nearby restaurants is endless so wasn't a neccessity.", "Date": "September 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "judsonia", "Title": "“SMELLY”", "Author": "JudsoniaLloyd", "ReviewID": "UR139382003", "Content": "had a room on 4 th floor when getting off elevator it smelled as if 100 people were smokeing in hallway. water bottle in fridge will cost 3 dollars if you open or drink it. parking would be impossible during winter due to steep grade with lack of parking in front. a holiday inn would have been better if it had been open, but was closed due to latest tornadoe damage.", "Date": "September 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Muldrow, Oklahoma", "Title": "“Our new favorite place to stay!”", "Author": "dagizle", "ReviewID": "UR138544210", "Content": "My sister and I stayed here this past weekend and it was an exceptional stay. The rooms are gorgeous and very comfortable. Plus the private balcony's are a great place to sit and watch the morning sun come up. We will definitely be staying here again.", "Date": "August 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Springdale, Arkansas", "Title": "“Nice Hotel, clean friendly service.”", "Author": "Michael A", "ReviewID": "UR136980619", "Content": "The hotel is a little outdated, but clean and very good service. Rooms are comfortable, beds are firm. The hotel is located on the strip, this is good and bad, easy to find things, but traffic is a bear. Very quiet, and easy access. Breakfast could have been a little better.", "Date": "August 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“A nice older hotel we would use again.”", "Author": "planecrazyusa", "ReviewID": "UR136325607", "Content": "The hotel is right in the middle of it all. Central location. The rooms were nice and clean. Little balcony with a couple chairs. Small bathroom with tub and potty. The mirror and sink are in the entry area-which makes it hard to get ready if others are sleeping. Breakfast was good for us. Enjoyed the outdoor pool.", "Date": "August 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Archie, Mo.", "Title": "“Vacation”", "Author": "CraigArchie_Mo_", "ReviewID": "UR136135444", "Content": "My wife and I stayed here and liked the hotel overall. We found the breakfast to be somewhat limited in selection. Ham and eggs, fruit and waffles if you wanted to make them. Would have liked to have had biscuts, seperate eggs, sausage, etc... The room that we stayed in had a jacuzzi in it and though nice, seemed aliitle small. The room was of average size, but had to much furniture in it making quite cramped. The chair on the balcony was broken, though maint. replace it right away. While there a thunder storm hit quite hard and blew pool furniture and such into the pool. But right after the storm maint. was out there cleaning things up, and this was around 10:30 at night. Kiddos! The room was very clean and adjoining room noise was non-existent. Staff was very friendly. We noted through reviews before booking to ask for a room in the back facing the mountains in which we did. Very good advice unless you want to look at the back of a billboard or into the driveway. Overall, nice hotel. Denny's right next door, Ducks ride right across the street.", "Date": "August 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lincoln, Nebraska", "Title": "“Best hotel stay”", "Author": "Andrew K", "ReviewID": "UR135932452", "Content": "Nice, charming rooms, reception and dining areas. Friendly staff, even though in a very busy tourist trap. Great hot breakfast everyday (eggs and ham served 2 of 3 days we were there) with lots of fruit, cereal, yogurt, choices. Tea & cookies every afternoon 2-4. Nice outdoor pool and larger indoor pool. Each room has a small back-door veranda.", "Date": "July 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "northern michigan", "Title": "“Would stay here again”", "Author": "boogity", "ReviewID": "UR134671257", "Content": "Front Desk Staff VERY friendly and helpful. Liked that we were on the first floor where we could park the car right outside our door and the outdoor pool was just a hop, skip and a jump away. Liked the large refrigerator in the room. Breakfast was available but debatable. Would stay here again.", "Date": "July 17, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Huntsville, Arkansas", "Title": "“Smelled of a wet dog...”", "Author": "4hogfans", "ReviewID": "UR134534229", "Content": "When walking up to our door I looked down and the dated carpet, which smelled like a wet dog, was nasty. It looked as though it hadn't been vacuumed in several days. Open the door to the room and was knock in the face by air freshener. I went to the front desk to see if they had plug ins or anything we could get rid of. They were less than helpful. The ladies said not that we know of. The proper response should have been to contact housekeeping. I get terribly ill with air freshners so I searched and sure enough there was a gel like air freshener by the filter. Our beds were worn down. I paid as much as I do when I stay in a lot nicer places like the Hilton, Embassy Suites, Doubletree(by the way those places were booked) with much cleaner and better rooms. Oh did I mention the fecal matter on the side of the toliet. Yuck!", "Date": "July 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "st. louis mo", "Title": "“terrific staff, average room and great prices”", "Author": "mytwosonsdad", "ReviewID": "UR134189357", "Content": "i am happy to share with you that the four stars are due to the staff and the location. the hotel seems quite average and would be similar to what you would fine at a best western or quality but the staffing is friendly and helpful. each member goes out of their way to make our stay delightful. the helped my family with directions, tickets, meals and everything in between. if the room was bigger or more updated it would have received five stars. if you are looking for the Westin type experience then search elsewhere but if you are the family that enjoys best western then save some money and stay here.", "Date": "July 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Council Bluffs, Iowa", "Title": "“Nice Clean Hotel in the middle of it All”", "Author": "Tom S", "ReviewID": "UR133646712", "Content": "Rooms were updated and clean. Only problem we had was didn't get maid service one day but got clean towels from front desk and problem solved. Free breakfast consisted of scrambled eggs, biscuits and gravy, waffles, donuts, cereal, fruit, toast, oatmeal...very adequate. Had a nice gathering area on 3rd floor balcony where we met other family to play domino's. In laws stayed in first floor handicapped room and had a walk in shower which worked well for them since mother in law can't walk well. Indoor and outdoor pool were nice and clean and had small game room the kids liked with an air hockey table and video games.", "Date": "July 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“The best hotel in Branson!”", "Author": "Amber1970", "ReviewID": "UR133132197", "Content": "The front desk ladies are very friendly! The hotel is beautiful and the rooms are very nice! Its the only place I'll stay when in Branson!", "Date": "June 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oklahoma", "Title": "“The Friendly helpful staff make this a good place.”", "Author": "trans4med", "ReviewID": "UR132734003", "Content": "The friendly helpful staff, from the front desk to maintance, make this hotel a good place to stay. The rooms are good size, but the bath is very small. The breakfast is just ok, and it does get very crowded at times. I think the price is a little high for this, but I know that this is Branson, and it's on 76 hwy.", "Date": "June 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Northwest Arkansas", "Title": "“Conveniet to Outlet Mall”", "Author": "skzfskzf", "ReviewID": "UR132698520", "Content": "This was a very nice family hotel. The room was clean and the hotel staff was helpful. There is a free breakfast and it was okay. The reason I say okay was for this reason, the size of the dining room for breakfast looked as if it should have been adequate when we checked in, but every morning we found it to be very crowded. Every morning you could make your own waffle, or have ceral or a pastry. What we did enjoy was that they had a small breakfast buffet that was different each day. But for a free breakfast, I really don't have any complaints. The location is great if you plan on doing shopping at the Tanger Outlet Mall, which sits right behind the hotel. It is located right on Highway 76, so it is very close to many of the attractions. It can be a little tricky getting out of the parking lot, but we found most drivers to be very considerate letting us out eventhough traffic was heavy. All in all, this was a nice place to stay and we will consider staying here on our next visit.", "Date": "June 25, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fenton, Missouri, United States", "Title": "“Front desk rude, rooms very cleen”", "Author": "Ken H", "ReviewID": "UR132486732", "Content": "Front desk staff was rude,rude,rude. But rooms were very cleen.", "Date": "June 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Baton Rouge, Louisiana", "Title": "“Great Hotel,Very Clean,Very Friendly...”", "Author": "LIV4JESUS1", "ReviewID": "UR131586342", "Content": "Very nice hotel! The staff are very nice and very helpful. The rooms are very spacious & clean! All the rooms have a small balcony with chairs! Great location. Will Definitely stay again!!!!!!", "Date": "June 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Miami", "Title": "“Value is the word here...”", "Author": "BigBransonLover", "ReviewID": "UR130712839", "Content": "If your looking for an affordable hotel and your not expecting alot of extras then you will be pleased with this hotel! We went to Branson last minute on Memorial Day weekend and took a chance here. We got a reasonable price but did find out if you book ahead you can get an even better price! The room was clean which is the most important to me! It wasn't overly spacious but enough room for the 4 of us. The balcony was nice;) The outdoor pool was nice and warm and clean! The indoor pool had alot of chlorine and I wished I had told the front desk about it just so they would know and could fix it. The hot tub was in great need of a cleaning....there was brown stuff floating in the foam. I'm sure if notified the hotel would take care of it!! The staff was really friendly! The breakfast was not much and I would probably just plan on going to the Denny's next door if we stay again! When they say the breakfast closes at 9:30 they mean it! At 9:25 they started packing it all up...even the doughnuts and cold cereal was whisked away! I'm not sure what they were going to do with the doughnuts but they were put up quickly...hopefully they didn't save them for the next day;) Overall this hotel was good for the price we paid! Tip: book ahead! On thier website if you book 2 nights you can get the rooms for $69 a night! That's a really good price for Branson. The hotel is starting to show it's age, wear and tear a bit but it's clean and for $69 a night you can't beat it!", "Date": "May 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbia, South Carolina", "Title": "“Quiet Hotel Great View”", "Author": "martywhite", "ReviewID": "UR130060326", "Content": "Spacious rooms and nice decor. Very clean and quiet. Good location. We had room on back which had a great view but if you stay on front of hotel, your view will be overlooking Hwy 76 and a billboard. Ask for a room on the back. The \"free\" breakfast left a lot to be desired. We ate at a reasonably price breakfast buffet next door at Great American (giant chicken on front) the last two days. Hotel location was very convient and staff was very helpful and friendly. Cookies and tea in the afternoon, but we were so busy seeing shows we never made it back in time for tea. This was our second trip to Branson. The first time at a \"chain\" hotel. We would definitely stay here again.", "Date": "May 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tulsa, Oklahoma, United States", "Title": "“Weekend Getaway!!”", "Author": "Jeanette J", "ReviewID": "UR129938998", "Content": "Me and my family had a great stay at the Hotel Grand Victorian in Branson. The rooms were very clean, we had a double spacious and the bathrooms nice, also had little balcony furnished with chairs so you can sit out and enjoy the fresh air and even has views. Rooms were quite never heard any one in the halls, nice lobby very friendly staff quick check in. We didn't have the breakfast there that was our choice, but it looked good. We walk to Denny's that was just across the parking lot. The Tour Ride the ducks is just across the street from hotel, Dixie Stampeed and Titantic Museum is few blocks down the street, and Dick Clark theather, Large put golf course, Kid's rides park, restaurants all in walking distance of the hotel the traffic is busy so if you don't mind walking this is the spot for you. I really liked the hotel and we are planning to come back with family members from Atlanta in July this year. I told my co-workers at the bank I work for and they say they will most likely plan to stay there since it's so close to everything and the walking factor sounds appealing to them.", "Date": "May 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bolingbrook", "Title": "“Spring Break at Branson, Mo.”", "Author": "Velvetsguy", "ReviewID": "UR128438198", "Content": "My wife, myself and grandson (on spring break) took a trip to Branson to see how it was post-tornado earlier this spring. I was happy to see the damage to the downtown area was not as bad as one might think. The damage was spotty at the worst, minor in just a few areas and quite a few attractions were business as usual. The town is starting to show it's age in spots but there are several that are updating following the storm that went through town. We did have a good time at The Grand Victorian Inn, right across the street from \"Ride The Ducks\", which my grandson absolutely loved! Better trip than I thought.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Pleasantly Surprised”", "Author": "sasejt", "ReviewID": "UR127335502", "Content": "We were thrilled to find a nice place to stay after a day at Silver Dollar City. Jonah at the front desk was incredibly helpful. We did not have a reservation and we were so happy to find such a great place to stay at such a reasonable price. My kids loved the indoor pool and game room and it was wonderful to have a balcony and get some fresh air.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "River Valley", "Title": "“Loved It!!!”", "Author": "birdamundo", "ReviewID": "UR126566400", "Content": "We had such a great stay at the Grand Victorian. We didn't have reservations and walked right in and were warmly welcomed. The room was clean and fresh and had a balcony.Even though it is right on the Strip and close to many attractions and resteraunts--it was quiet and we slept very well. The afternoon tea and cookies were a huge hit with my family.", "Date": "March 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Beautiful hotel, great location”", "Author": "camillenesler", "ReviewID": "UR125047357", "Content": "This gorgeous hotel is located on the main strip in Branson really close to several of the attractions. It's gorgeous on both the inside and out, and was really decorated all fancy for Christmas. I love the indoor pool with the fireplace right by it too.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Place looks awesome on the outside”", "Author": "Iceman26k", "ReviewID": "UR121155853", "Content": "The main complaint was we were in a room facing the ride the ducks sign and at three in the morning that light is still flashing and really bothered me to the point where I could not sleep very well the 3 nights we were there I asked to be moved but they were packed and would not refund my money to go t", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Good hotel for the price”", "Author": "Ken B", "ReviewID": "UR120079223", "Content": "The hotel was well kept and clean. The staff was very nice and accommodating. The price and location were great, which is why we chose the hotel. The location was right next to the outlets so that was great. Those were the good things. The other things that could have been better are: breakfast, temp of the pool, decor, size of the room. All of these were fine, but it could be better. The breakfast had limited options and it was very cramped there when we went. The temp of the pool was freezing! The decor was outdated, but not a huge deal in my mind. The TV was a nice flat screen, but the beds were very hard. I have some back issues and the beds did not help. Lastly the bathroom was not big, so if you have issues with small spaces, this might not be for you. All in all it was a nice hotel for the price and met my expectations.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Grayslake, Illinois", "Title": "“Excellent Hotel”", "Author": "Bob C", "ReviewID": "UR119901110", "Content": "We stayed here for three nights and found everything excellent. The building,the room,the food,the service,and the location was just great. We will be staying here every time we come to Branson. We have recommended this hotel to other people, and they all were very very happy with their stay.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent!”", "Author": "UnityTech", "ReviewID": "UR119847794", "Content": "I reserved rooms twice this past year for my family. I was told by my family that their stay was wonderful and they enjoyed their stay immensely. Staff was excellent... Great hotel!", "Date": "October 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Petersburg, Florida", "Title": "“Excellent Motel”", "Author": "Bella1202", "ReviewID": "UR119324909", "Content": "This motel was just beautiful. The rooms are spacious and kept very clean. The beds are very comfortable. Bert at the front desk was the nicest person you will ever meet and very helpful. We used the jacuzzi every night and we stayed for 7 nights. The breakfest was very good and always kept with plenty of food. We had cookies and tea in the afternoons. If I ever get the chance to come back to Branson this would be the only motel I would stay at.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "North Port, Florida", "Title": "“Hotel Grand Victorian”", "Author": "Philbert63", "ReviewID": "UR119150898", "Content": "A very pleasant experience. The rooms were spacious and very clean. Beds comfortable. Lobby area nice. Continental breakfast was great.", "Date": "October 10, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Leavenworth, Kansas", "Title": "“Just a Warning”", "Author": "mary906789", "ReviewID": "UR119100402", "Content": "We recently stayed at the Hotel Grand Victorian with pets. Let me give everyone a warning if you are traveling with pets. DO NOT STAY IN ANY ROOM NEXT TO THE ELEVATOR. You will not sleep past 5:00am because the headboards are next to the elevator mechanical room. You continously hear the bangs and swishing of the elevator. In their defense they did offer me another room when I complained; however I had too much to move and since we were on vacation we did not want to hang around until a room became available so we could move our stuff. I was just disapointed because they could have offered more to make up for the horrible noise distraction, such as a free night or something, but it did not seem like they cared that much. The rooms are clean, breakfast not that great, friendly staff, just if you like to sleep do not stay near the elevator.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kansas City, Missouri, United States", "Title": "“Good place to stay!”", "Author": "LynnaBeach", "ReviewID": "UR118819525", "Content": "The hotel staff was very courteous and friendly. The pools are beautiful and the rooms are very nice. It was a good place to stay and I will return again.", "Date": "October 1, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Ida Grove, Iowa", "Title": "“Great location on the strip!”", "Author": "KevinPeggy", "ReviewID": "UR118149949", "Content": "Nicely kept up hotel in a great location on Hwy. 76 (the strip)...we walked across the Highway to go ride the Ducks! Denny's is located right next door, and 75 feet from there was a Krispy Kreme donut shop! Branson Mall is a block down the road, so any Wal-Mart shopping can be done very quickly.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Texarkana, Arkansas", "Title": "“very clean hotel”", "Author": "Lisa L", "ReviewID": "UR117809066", "Content": "The hotel is very clean and has nice rooms. It is in a great location. Wal mart is across the street, Dennys and Krispy kreme donuts next door. The beds are slightly firm but still comfortable. The decor needs to be updated. The pools are nice. The hotel offers balconies which was why I chose the hotel. Just be sure and ask what view you will have because ours overlooked the roof of the indoor poolhouse. We could not see anything, which was disapointing.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Wellington, Kansas", "Title": "“Love, Love, Love it!”", "Author": "reneemcguire", "ReviewID": "UR117391314", "Content": "Only \"bad\" part was the soda machine taking money - but hotel staff was courteous and refunded money; no questions asked : )", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "2.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Houston, Texas", "Title": "“Will never come back here.”", "Author": "kdavis11", "ReviewID": "UR116381408", "Content": "They did not clean our room Saturday morning. The staff was extremely rude and acted like we were invading their space. I came here to celebrate my mother's birthday with my sister, daughter, sister in law, nieces, etc. We spent a significant amount of money to meet here only to be treated with disrespect. The only way I would ever stay here again is if I was about to freeze to death out in the cold. And that would only be if my car was out of gas. Absolutely terrible! Stay somewhere else", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Fort Smith, Arkansas", "Title": "“Our \"new\" place to stay in Branson”", "Author": "sewingmom1", "ReviewID": "UR115433525", "Content": "After many weekend getaways to Branson and always staying at the same hotel, I decided to try a different place. I chose the Grand Victorian mainly out of curiosity. I had always admired it from the outside and wondered what the inside held. Well, let me just say, I have found a \"new\" place to stay! I absolutely loved it! The rooms are nice size and I LOVED the many pillows on the bed! Very comfy! Breakfast is served from 7:00-9:30 and it is very good. They have 2 waffle makers and you can make your own...they are big and yummy! Also available is fresh fruit, canned peaches, cottage cheese, toast, donuts, muffins, cereal and scrambled eggs and of course, juices, milk and coffee. In the afternoon from 2:00-4:00 they offer cookies and tea and you will be sipping from nice dishes, not styrofoam! There are microwaves and refrigerators in the rooms and I loved the fact that the vanity is seperate from the bathroom...makes getting ready so much easier when there's more than 1 person in the room. You will definitely be pleased with your stay here. If not, you are very hard to please!!", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fayetteville, Arkansas", "Title": "“We'll be returning for sure!”", "Author": "justine55711", "ReviewID": "UR115323948", "Content": "Our room was quite large compared to our past hotel experiences. Requesting an average room I was expecting no more then a bed, bathroom, T.V. & a tiny table with chairs like most hotels would offer but was surprised with much much more. The room was very spacious, clean & complete with a mini refrigerator. The hotel had two pools on the property which kept crowding to a minimum. The free breakfast wasn't spectacular but better then the usual coffee & donuts provided elsewhere. There is no bar in this hotel, but there is a game room complete with a pool table. I would reccomend this place to everyone. Great experience!", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Edmond, Oklahoma, USA", "Title": "“There are no other hotels in Branson that compare!”", "Author": "AColvin", "ReviewID": "UR114889416", "Content": "We have been to Branson 4 times in the past 2 years - and this was by far the best lodging we have experienced! When we arrived we said, \"Are you sure this is our hotel? This is amazing!\" We were greeted warmly by the front desk staff and invited to afternoon tea and cookies (my kind of happy hour!). Our room on the 3rd floor was near the Victorian Parlor which provided a nice space to read and access the free wi-fi to plan out our days. (The Ice Cream vending machine was also on the floor and made my youngest daughter very happy). When we got in the room, not only was the Gideon Bible in the room, but it was actually opened to a passage in Ecclesiates - I really liked that and we received a handwritten note from Tonya (our housekeeper) letting us know that if we needed anything during our stay to let her know - HANDWRITTEN folks - small personal touches mean alot! On the days we woke up in time (very late nights + very comfy beds + being away from home and work = sleeping in!), we enjoyed a warm breakfast - not just coffee and toast, but eggs, waffles, biscuits and gravy, yogurt, oatmeal, bagels, cappucino, juice...(and the coffee was brewing 24/7 - I know cuz I had some in the middle of the night on several occasions). We even met Hank Williams one morning at breakfast! We used the indoor and outdoor pools daily (well, nightly thanks to the LATE hours it was open - loved that) - Only ding I would have would be with the indoor pool. I know you gotta keep it clean for the guests, but the chlorine content was so high that even with both doors open in the gazebo, our eyes / lungs were burning and we had to make a hasty exit to the outdoor pool. The staff was accomodating and met all of our requests quickly and with a smile. I love the fact they dressed their parts, did not try to upsale or push anything on us, but were available for any and all questions we asked. That being said - I know HOTEL GRAND VICTORIAN will be our choice for future stays in Branson!", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Peoria, Il", "Title": "“Great front desk staff”", "Author": "Linny_10", "ReviewID": "UR113560907", "Content": "We stayed here 3 days in April before the Branson rush really begins.It was a very nice hotel, clean, centrally located, family friendly. Good contnental breakfast that included a different hot selection each day, waffles, scambled eggs, biscuits & gravy. The rooms were standard size, the beds had plenty of pillows & each room had a patio or balcony.. The most outstanding thing was the helpful front desk staff. They could get you tickets to most shows, had plenty of info & discount coupons. also shared where to go to eat for best values & quality of food. Only bad thing was getting out of the parking lot. Since it is on the main road, there is constant traffic on weekends, turning left is almost impossible.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Versailles, Indiana", "Title": "“Housekeeping is lacking in this hotel.”", "Author": "kidscott4", "ReviewID": "UR110360102", "Content": "The Hotel was beautiful, the view was beautiful, and the location was ideal. The housekeeper we had was another issue: the beds were pitifully made; the sheets were never changed and were soiled from a mishap; the soiled towels were not removed from the bathtub twice; the vacuuming was inadequate and did not include the entire room; and a sign in the bathroom to re-use towels, I thought, was ridiculous; I do not re-use towels even at home. Candy wrappers were left in the hall 2 days; and a dirty pillow case was in the elevator all of one day. The air conditioning unit was very loud.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Branson, Missouri", "Title": "“This Hotel and its staff is the epitomy of Hospitality Extraordinaire, especially \"Bert\"”", "Author": "barbcantrice", "ReviewID": "UR109259700", "Content": "Well where do I start at the beginning. I wastelephoned a year ago by Wyndham resorts about a vacation package. I decided I wanted to surprise my husband. So I decided to have my mom in kansas City put the payment on her card and then I would pay her back. I saved and was able to get enough for gas and we decided a rental would be best. So a year or so later we set out from Onalaska, Wisconsin to drive to Branson Missouri. We finally were able to leave about 7:00 a.m.. I had to call and let the check-in and the Hotel know I was coming in late. As we finally got closer the weather looked bad, it was raining and I fally picked up a packet that was left for me and we drove to the hotel Grand Victorian. We were initially greeted by \"Bert\". I and my husband were exhausted from the drive, not to mention I brought everthiing, but the kitchen sink so we could have a nice celebration. Imagine my utter thanksgiving to God when she said oh your room is on this level and right around the corner. We were so please. Also a parking space right out front. Then we were tired and just wanted to eat and got to bed. bert and sam I think were nice enough to pull a map and designate all different kinds of food. I have some recent illnesses that preclude my eating certain types of food. We actually ende up going to Denny's next door. The accomodations in the room were perfect, no to mention a wonderful balcony for two with a view of the outdoor pool. The next day started with a late wake up, but in time for the quaint breakfast and reading of the newspaper. It was said that there would be rain but it turned out wonderful. We were back to the desk and by the time we got there, Bert was back and we asked about going to see the movies again a map and designations, we did end up going to the Branson Meadows Cinema, Oh by the way I forgot to tell you that we found out the car had not been cleaned that we rented and so there was some type of brown liquid in the console that needed to be cleaned out so we asked about a car wash as well. We were given directions. Lets get back to the movies. Not only did she give directions, but looked up the places which should have been in the paper and when she could not find them she looked up the numbers and then gave them to us. I wrote them down. We had the ducks ride and then dinner at Applebees. When we returned my husband wanted to open the special wine I had given him for his birthday. We had no wine glasses . One trip to the front desk and champaign glasses were borrowed. Then back to the room, oh no guesss we will take the glasses back no cork screw, back to the fron t desk and lo and behold a cork screw. What's even more wonderful is the attitude of those behind the desk. Bert and the other staff were so pleased to be able to help. I have to end cause I need to spend time with hubby, but had to get this down before I forgot. All I can say is \"Hotel Grand Victorian, where the hospitality is Extraordinaire. God bless all that contribute to making it possible.", "Date": "May 21, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Jose, California", "Title": "“We would definitely return”", "Author": "Shayne15", "ReviewID": "UR107020777", "Content": "My 81 year old mother and I stayed at the Hotel Grand Victorian for 3 nights in July 2010. We had a well appointed room - which was quiet ALL the time, even though the hotel had many families with young children staying at the same time. We were greeted very pleasantly by the front desk staff each day, our questions were answered quickly and accurately, we took full advantage of the complimentary breakfast -- and would definitely return for another stay.", "Date": "May 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Springfield, Missouri", "Title": "“Enjoyed our stay”", "Author": "sherrylatimer", "ReviewID": "UR106753542", "Content": "This was our first trip to the Hotel Grand Victorian and it was better than I thought it would be. They had a great pool the kids loved and the staff was very friendly. It was very comfortable and clean too. Some family members recommended this hotel, and it was a little higher than what we usually pay but it was worth it. Everything was better than I expected. We are going to have a family reunion there in 2012, and we already made our reservations before we left.. cant wait to go back. Maybe this summer during the heat of the summer to enjoy the pool again.", "Date": "May 3, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Lenexa", "Title": "“Don't believe what you read”", "Author": "disappointelenexa", "ReviewID": "UR105856962", "Content": "I located this hotel online and checked out all of the reviews and also called direct to verify availability, price, and details on the breakfast provided. Nothing was as it seemed but not terrible. Rather outdated, not the cleanest although it was not filthy. The biggest disappointment was 2 fold--went down for the breakfast to find hardly anything listed on website or what we were told by front desk people. There were no biscuits, no gravy, no eggs. There were waffles and day old do-nuts. After returning to my room to review my notes and their website I called the front desf--2nd part of disappointment--to inquire about the lack of advertised items on the breakfast, only to be told they only have 1(one) hot item per day and \"sorry\". Needless to say we will never be back and will let friends know so they can also make other plans.", "Date": "April 27, 2011"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“AWFUL!!!!!!”", "Author": "chunter2008", "ReviewID": "UR97522573", "Content": "It began with booking the room on their website. When we got there the room was not as described. When we spoke to staff about this the reply we received was \"Well they got the website wrong, not all the suites are as the website says they are.\" The room was so dusty you could write your name in it and the shower squealed the entire time it was on. To top it off there was a 3 inch piece of metal sticking out of the bedframe that was covered by the bedskirt. I found this out because it took a 2 inch gash out of my leg/ankle when I got out of bed that morning. When I told and showed the staff the only reply I received was \"Oh thanks, we'll let maintenance know\". Definately deserve a zero rating, customer service is NOT their strong suit.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portage la Prairie, Canada", "Title": "“Would Stay Again”", "Author": "robynscrafts", "ReviewID": "UR97521430", "Content": "We stayed for 6 nights and were very pleased. Staff was very friendly & helpful. The room was clean, well appointed & very comfortable. The hotel was quiet, except for our final night but when I called the desk at 1am it was dealt with immediately. Keycards gave us some problems but the young lad working the front desk managed to fix them on our second day and we had no further trouble. The decor in the room could use a little attention but that had no affect on the quality of our stay or comfort. We will definately stay here again when we visit Branson", "Date": "February 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Nevada", "Title": "“Very nice, staff very friendly, enjoyable stay”", "Author": "skbkjb", "ReviewID": "UR84728782", "Content": "The staff was very friendly at all times, especially the afternoon-evening worker. The room was very clean and the beds were comfortable. My daughter loved the pool and it was also very clean. The only complaint I would have is the breakfast isn't much and there wasn't much room (not the hotels fault as they were busy-had a bus staying there). My overall experience was great. Would stay again, one of the best I have stayed in.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "clinton", "Title": "“Great even with reservation mess-up!”", "Author": "trish816", "ReviewID": "UR69646552", "Content": "I booked our stay via the hotel website. I had booked a king whirlpool, which the site says it will have 2 person jetted tub, king bed and a private balcony! When we arrived the room was not such. It was the room which had a 4 poster bed, 2 person jetted tub and a bay window. The main reason I wanted to stay at the hotel was the balcony. We go to Branson often and I have always made comments that I wanted to stay there. This was a mini vacation without our kids and I was looking forward to sitting on the balcony with my husband. I had decided to call the front desk and let them know of the mess up. She had told me the room I booked was not the one with a balcony. While I was on the phone with her I went to the website and read the room descriptions to her. She said she thinks there was a mix up on the website. Also that the price I paid for my room was cheaper then then the actual cost. She DID offer to give the room I had wanted, but told her no since I didn't notify them right away and joked with her, told her that it would probably rain and the balcony would be of no use. With all that The hotel is very clean, very nicely decorated. I can't tell you about the breakfast or pools...we don't use the pools when we don't have the kids with us and we always eat at other places. The view was great..I was able to have my curtains open. I appreciate that she offered to change the room for me, but when you pay higher prices for a room I expect to get what I ask for. When companies offer website and reservations via the internet...they should feel secure in getting what the think they are. There are over 100 hotels in varying price ranges in Branson to pick from. In the economy we are in, trust is IT. We are planning another trip with our kids and I am not sure we will use the hotel again. I also think from now on I will call the hotel. I am not saying stay someplace else, the hotel was beautiful....just make sure you know what you are getting!", "Date": "July 4, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "missouri", "Title": "“Pleased time after time”", "Author": "seinMO", "ReviewID": "UR69096848", "Content": "We have been staying here with a large group (20-50) once a year for a family reunion for the past 4 or 5 years. The hotel is always VERY clean, well maintained, spacious and the staff is always friendly, helpful and quick to handle any requests we have. We are usually there in Feburary, and since that's the off season, the rates are very reasonable. We like to stay here for several reasons, one of which is the large common area on the second floor. It is set up like a huge living room with couches, chairs, tables and even a 'wet bar' type of area. We always have a local resturant deliver dinner one night while we are there and this space is a perfect place for us to eat together, visit, play games and just spend time together as a big group. Breakfast in the morning is nice. The choices include hot and cold items, always fresh and well stocked. Several choices, not just muffins and cereal. The basic rooms are nice, nothing too fancy, but are always perfectly maintained and very clean. Most rooms have a little balcony which is nice for morning coffee or relaxing at night. The last time we stayed there, 8 of us stayed in the family suite. It was very nice, with a full kitchen and nice little living room. The downside of the suite is it only had one bathroom, which would of been perfectly fine, except that it was located in one of the bedrooms, which meant whoever slept in there didn't have the most privcacy. The beds in the suite were WONDERFUL however. Hotel is located right in the middle of everything, so you are literally just minutes from shows, dining and outlet mall. Parking can be tricky if the weather is bad with snow or ice, because (as is common in Branson) a lot of the parking is on a steep grade. It's normally a little pricey for us to stay during the summer months, but for the time of the year that our big family goes down it is perfect. It really is as nice as it looks from the road. We look forward to staying here for years to come.", "Date": "June 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“The rooms were clean and our 4 year old daughter LOVED drinking tea out of china tea cups.”", "Author": "pkartist", "ReviewID": "UR65282952", "Content": "My husband, daughter and I stayed in a king jacuzzi suite. There was a fold-out sofa and plenty bed linens. The room was clean and a nice size. We have no complaints. The staff was wonderful. The hotel was quaint and I love Victorian era furniture and the hotel had some beautiful pieces. The hotel was convenient and we recommend it and most certainly will stay there again.", "Date": "May 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kansas City", "Title": "“Best $35 stay ever.”", "Author": "justalittlecrazykc", "ReviewID": "UR56140357", "Content": "Just a quick review of the property -- we recently stayed here overnight for a funeral and we were all pleasantly surprised. I think the hotel is targeted at a little different demographic than us (young family with a 3-year-old), but we enjoyed it nonetheless. For the price, it was a great stay. Clean & comfortable with plenty of little extras (who serves afternoon tea anymore?) It's not the Waldorf, but it's an extremely great value for the price. Indoor pool was nice - and open late (midnight). Only downside was that the room doors didn't have any sort of security latch -- not really worried about keeping people out of the room, but with a 3-year-old, it's nice to be able to keep him in the room. We ended up chasing him down the hall a couple of times...", "Date": "February 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "US", "Title": "“convenience”", "Author": "Annie449", "ReviewID": "UR37058346", "Content": "Grand Victoria is in a great location on the strip. It is right across the street from the Branson Music Mall, Walmart, and a short walk to Moonriver theatre and the Haygoods Theatre. In walking to these different places you saved alot of time from being in a traffic jam. The hotel was clean and update, they are now replacing regular TV.s with LCD. The swimming pools were well maintained and the rooms were clean. A continental breakfast was provided and had good variety. This is a good value for the money.", "Date": "August 8, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "5"}, "AuthorLocation": "USA", "Title": "“Staff was Rude and housekeeping wasn't done!”", "Author": "Travler2Usa", "ReviewID": "UR35529166", "Content": "4 Years we plan a trip to Branson the shows was excellent, The Staff was Stiff the last day we stay. OK after walking for hours to see other events and 2 shows, plus all you can eat seafood. We arrive back to a unclean room. 1. Sheets was not change 2. Bathroom not clean from the night before and all that walking, we wanted to soak into a clean bathtub. 3.We had to use a face towel and soap to clean the tub. 4. All the trash can was full with yesterday trash, beers and junk food. 5. And yes we call the front desk and complain it was 10:00 pm, we left that earlier that day at 12:00 pm and left the sign for outside on the door handler for ROOM SERVICE. I want reader to know the 2 day we had to ask the Font Desk to have room service because the maid have not show up, The Front Staff lady said I have to go fine her myself for she alway taking off. (wow) The last day we checkout we once again complain and told the Front Desk Staff, that person should be docked of pay. I will never stay here plus it wasn't even crowded. I also written a letter to who ever own the hotel, we pay $110.00 per night plus taxes bought all the shows tickets there too. We stay 4 days in all plus there was plenty of Hotel up and down from the Grand Victorian staring at $29.99 and up. We should have save money and stay there. SHAME ON YOU GRAND VICTORIAN HOTEL !!! :(", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Central Illinois", "Title": "“Very nice hotel.”", "Author": "Chl0e01", "ReviewID": "UR35440156", "Content": "This hotel is very nice and clean. The rooms have complimentary microwave and refrigerator, which can save some money for those frugal people. Rooms are spacous. Nice bathroom. Nice view. Great location. They have tea and cookies every day for a short period of time. Both the indoor and outdoor pools were great. Jacuzi was very relaxing. Unlike most hotels, they keep the pool towels stocked at all times. There is a game room for kids, and us kids at heart adults. My kids, ages 9 and 13, loved this hotel. The staff was very friendly and helpful. The interior design is geared probably towards the older crowd, but was not in need of repair at all.", "Date": "July 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Oxford, MS", "Title": "“Nice and in a great location of attractions”", "Author": "mb2951", "ReviewID": "UR34248716", "Content": "It was nice. I would stay again. It seems to have been another hotel that was remodeled. Rooms were sort of small but I enjoyed it. Again, I would stay again.", "Date": "July 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Iowa", "Title": "“Well taken care of considering the problems!”", "Author": "kstrckr", "ReviewID": "UR32935771", "Content": "I have to say I was a little scared to stay at the hotel after reading the reviews from other individuals that stayed at the hotel. I expected a nightmare with no way out. We booked our room as non refundable for a friends wedding. We were at the hotel for five days and I have to say we will very well taken care of. Wednesday - Friday's stay we were in room 515 which was wonderful for my husband and our 10 year old daughter. Saturday night around 10:30 our air conditioner started to smoke, my husband unplugged it and called the front desk. Within seconds the front desk clerk was there assessing the problem. We were immediately moved to another room down the hall to 538. This room was very lovely although Sunday morning we found out that our shower didn't work. We were then moved to room 529 which was a king bed, jacuzzi suite. The room was nice, but, I could have done without the elevated bed that I had to use a stool to climb into. With everything that went on during our stay, I would say that we were very well taken care of. The staff was always very considerate and attentive to our needs. I am planning another trip in September with my ten year old daughter and my mother. I will be staying at the Grand Victorian Hotel again. Some ask why I would go back after everything that happened? I simply say, some things are out of human control. It was no one's fault that the air conditioner started smoking and it wasn't anyone's fault that the shower didn't work properly. The staff did everything in their powers to make our trip pleasant and very memorable and it was. Thank you Grand Victorian Staff you did an excellent job!! See you in September! Kathy Hauge-Struecker", "Date": "June 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Arkansas", "Title": "“Nice but won't stay again”", "Author": "southern_darlin1975", "ReviewID": "UR31796217", "Content": "This is a nice hotel but we won't stay there again. The rooms are small, and bathroom even smaller. The beds were not queen size, they were full size. When we asked about the beds the lady at the front desk was hateful and said they were queen. The indoor pool area was not clean and the hot tub had way too much chlorine in it and had scum on the sides of it. The continental breakfast was not as good as other hotels, so therefore we didn't eat breakfast there. They only hot food they had was eggs made in a crockpot. THey did have friut and bagels and donuts. They were not friendly and were hateful.", "Date": "June 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Midland, TX", "Title": "“We really enjoyed our stay”", "Author": "happytravelers79705", "ReviewID": "UR31647786", "Content": "Staying at the Grand Victorian helped us overcome disappointment with our Branson trip. The facility is well designed, amenities including family attractions, are great! Hotel compares very well with luxury hotels we have enjoyed in the US and abroad. The service was superior. Location is very convenient but coping with traffic getting in and out of hotel was a 24/7 nightmare that the hotel can't fix. We'd like to find this hotel in other locations we'll visit this year.", "Date": "June 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Missouri", "Title": "“Very nice”", "Author": "CathysTrip", "ReviewID": "UR28162736", "Content": "I stayed here with my young children and we enjoyed everything! The rooms are very clean and the staff was so helpful and courteous. The great thing about this hotel was the location...so easy to get to everything... also we enjoyed the indoor pool and breakfast every morning which had some hot items..... My kids LOVED the tea and cookies every afternoon... What a nice surprise...... We will definitely be back again.... Dont forget to ask for the 20% off coupon when you leave... They will give it to you if you ask them =)))", "Date": "April 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "SE Iowa", "Title": "“Average Hotel - Nothing Special”", "Author": "EatGoats", "ReviewID": "UR25157504", "Content": "The hotel from the outside is a spectacular looking building. Inside the building, the decor is very nice - it has a baby grand piano in the foyer. The staff was very helpful. The pool and jacuzzi were also nice. The continental breakfast was okay - nothing to brag about or write home about. The beds were used somewhere during the Spanish Inquisition and were as hard as a board. We did not sleep very well and was glad when it was time to leave (we only stayed two days). There are no wireless internet in the rooms, you have to go to the foyer on the third floor to use the one and only computer with internet access in the building. The machines in the game room were antiquated and showed the use/abuse. My overall impression of our stay at this particular hotel was okay. I will not stay here again.", "Date": "February 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NW Arkansas", "Title": "“Great Hotel, Great Price, Friendly atmosphere”", "Author": "thiessen_j", "ReviewID": "UR23902528", "Content": "This place was awesome. Right on the strip. Very friendly front desk staff, very clean rooms, indoor pool nice and warm on the 20 degree day that we stayed here. Very good breakfast, though limited choices due to it being only a continental style breakfast. The only thing was that it was kind of loud in our room when the water was running in either the room next to us or above us, not sure which it was, but for 59.95 for a King bed, jacuzzi tub, coffee maker, hide-a-bed couch, private patio and very good heat and air unit, who could ask for more. We will stay here from now on anytime we go to Branson.", "Date": "January 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Liberty, MO", "Title": "“Thought It Was Great For A Girls Get-Away & Family Too”", "Author": "girlfriends_8", "ReviewID": "UR21250868", "Content": "We stayed at the Grand Victorian the first week-end of November, 2002, 2003,2004,2005. Three of the 4 years it was girls week-end. One year it was my daughter, 2 young grandsons and myself. EVERY YEAR WAS THE VERY BEST!!!!! The rooms are great, it is decorated beautifully!!!! In fact, we took the little boys picture at the piano with all the Christmas decorations for their Christmas card. The boys swam in the pool, played in the video room and we had a great time. In fact, we were there on Black Friday. My daughter could get up and look down at the shopping center to check out the crowds. She went shopping at 4:00 a.m. and I stayed with the boys. Breakfast was great, I have nothing but praise for this hotel. We are on a Branson Get-Away this time and they are placing us in a different hotel. We are so disappointed - just may have to walk in anyway to see the beautiful lobby.", "Date": "October 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "St. Louie", "Title": "“It was average”", "Author": "wegolfn", "ReviewID": "UR20402284", "Content": "This was just an average place to stay. Our room was clean, the breakfast was okay, the only thing hot were scrambled eggs, the rest of the breakfast was your normal continental. The front desk was friendly & did let us check in quite early as we arrived into town earlier than expected. We did not use the pools as we were on the go but they looked really nice, indoor & outdoor pools & a hot tub. They serve cookies & tea from 2-4 in the afternoon but we missed that too. The decor was cute & old-fashioned in the hotel. We stayed in a double queen with a balcony on the 5th floor overlooking the pool , it wasn't bad, we payed the internet special with no cancellation for 69.95. The location was very good & we walked to the Moon River Theatre, maybe 2 blocks if that! We really enjoyed the Andy Williams show, you must go see, booked that over the internet a week before & our seats were 2 rows from the stage! Andy can still belt them out & he was involved in the whole show & sang quite a few songs! We saw the variety show & it was fun! We had dessert after at the Moon River Grill, delicious & big carrot cake & bread pudding.We also ate on Branson Landings at Cantina Laredo & sat outdoors overlooking the lake It was delicious! Just a few tips for you!", "Date": "September 26, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Left with mixed feelings”", "Author": "ousoonergirl1", "ReviewID": "UR18637328", "Content": "We book rooms over the internet using their website. We were traveling with another party so we booked them separately. The other couple purchased the \"internet special\" and we purchased the queen beds. Well when we arrived we found that the rooms were identical and we paid $30.00 more each night (3-nights) so I recommend if your staying there to go for the internet special. We asked since we we're traveling together if we could have the same rate and we were told they only reserve 3 rooms in the entire hotel for that rate and they were already booked... Oh well, you live and learn. The lobby is very nicely decorated but the rooms are extremely small especially the bathroom. I had to stoop down to rinse my head in the shower and I'm only 5'4\" my husband is 6' 2\" so it was very difficult for him. It was also very difficult to give my children a bath because the bathroom area itself was so small. So if you have children and they need assistance in the bathroom you may consider this. The continential breakfast was okay, it served eggs, cereals, breads, donuts, cottage cheese and peaches. It's pretty typical of all the hotels around Branson. Most rooms have a balcony but our view was horrible. We had to look at the back of a very large billboard the whole time. The rooms were clean and also have a fridge and microwave which is nice. The couple we traveled with did have some problems with their room. The staff was blaming them for having an ice chest in their room (which they didn't have) that leaked to the floor below dripping water on the pillows of the guests below. Come to find out the hotel had a leak inside the wall which caused their room and the one below to get soaked. I felt the staff could have handled the situation better instead of insinuating we were at fault. The housekeeping staff was friendly however, the front desk staff needs some customer service classes. They were rude!! Other than that the Grand Victorian Hotel is an okay place to stay. I don't believe I will stay there again but it wasn't totally horrible. I've stayed in worse places. I would check around at other hotels. I believe for $100.00 a night you could find something better. Victorian maybe? Grand..Not!!", "Date": "August 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Illinois", "Title": "“Very Disappointed”", "Author": "IllinoisFamilyof4", "ReviewID": "UR17340559", "Content": "I was very disappointed in this hotel. I booked the room for 5 nights and ended up only staying 1 night. The beds were so hard, I could not take another 4 nights. The room needs updating, very rundown. When you open the door to the bathroom you almost hit the toilet and you cannot lie down back in the bathtub. Although the lady at the front desk was very nice about me moving to another hotel. The location of the hotel if great. That is all I like about the hotel.", "Date": "June 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "iowa", "Title": "“Used to love it....not anymore”", "Author": "Iowa0701", "ReviewID": "UR17007686", "Content": "This was my third time staying at this hotel and I was very disappointed on this trip. I called in and made a reservation several weeks in advance. We were going with a group of individuals, supposed to be on a designated floor, together. One of the group had reserved the large suite on the third floor. Only one other room was on that floor. The remainder of us were on the fifth floor, where the rooms we had do not have a balcony or windows that open (they are made that way) When we checked in, we were told there was a balcony and there wasn't. We had a room with an adjoining door that was with someone not in our group. The desk staff was extremely polite on the phone, when I made my reservation and they could charge my credit card, but not so much in person. Rarely did they look up and greet someone when they came in the. All of the ladies in the group and most of the men were disappointed with the hotel, the service and the staff. This hotel used to be very elegant. We stayed there in 2005 and 2006. Maybe the hotel was purchased by someone else. But is has definately gone down hill. It appears the only thing \"grand victorian\" is the name and the \"window dressing\" . The staff used to be very professional in their dress, must have been casual days, and their actions. I can most definately say it was not that way anymore. I don't think the table cloths were changed from Saturday to Sunday. The tables and chairs were moved in the dining area on Sat in the early afternoon and they were still sitting in the same way on Sunday morning at breakfast. The garbage can was being emptied Sunday morning around 6.30 am and the individual was snapping the bag in the air in order to get it opened up. I know that they were changing out mattresses, the dumpster was in the back by the pool and smelled just lovely, when we went to the pool on Sat and Sun night. But even that was a little bit much for me. The down hill for my stay was when I encountered a pizza deliver guy coming onto the elevator. With all that is going on in the world these days, I would think that this would not be allowed any more and delivers would have to stop at the desk for pick up by the hotel guest. Security is a huge thing to look at and this was the last thing for me. They need to upgrade also. One computer with interent access for the hotel, which is 5 floors...and you have to pay. There are nicer hotels for less money, close to this one. I won't go back.", "Date": "June 17, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Oklahoma", "Title": "“Does Not Honor Travel Buddy Coupon”", "Author": "bransonlover", "ReviewID": "UR10740777", "Content": "I have always been a fan of this hotel, and my husband and I always chose this one when we go to Branson. I have left previous reviews in favor of this hotel. However, recently I booked a room with the hotel and mentioned over the phone that I had a travel buddy coupon, and the employee of the hotel replied, \"Not this weekend, honey.\" So, I asked her what is this weekend, to which she replied \"Oklahoma Fall Break.\" Are you kidding me?!!? I do know that those coupons exclude holidays, but OKAHOMA FALL BREAK?!!? Yes, this is a nice hotel, but no, it is not worth $100/night. For the same price, you can spend a lot less and stay somewhere just as nice.", "Date": "November 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "St. Louis", "Title": "“Nice Hotel”", "Author": "jjmmkkl", "ReviewID": "UR10040953", "Content": "We stayed 2 nights , nice hotel with with great ammenities. They have a microwave, refrig and coffee maker in each room and a nice balcony. Looks like they just remodeled, new carpets and nice furnishings, though a comfortable chair would have been nice. It was nice and clean, bathroom small. They had coffee and tea available 24 hours and nice continental breakfast. They also served tea and cookies from 2-4. We saw the Bob Nelson comedy show which was hilarious and the highlight of our trip.", "Date": "October 4, 2007"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "High ridge", "Title": "“It was nice”", "Author": "shebug26", "ReviewID": "UR8740019", "Content": "My husband and i went here for are anniversery we stayed in a jaccuizesuite the room was clean and we loved it the bathroom was a little tight and all though we loved it along with the privat balconey i would get the cheaper room with ourt jaccuzie my husband and i did not fit comterybly in the jaccuize so we didnt not even get are moneys worth as far as that but they had a hot tub and pool that is open till midnight that we enjoyed for 3 nights there was no one in there so we had it to are selves so it made up for not being able to use are prvate tub the breakfast was good notting fancy cearal bagles and donuts wonderful for kids and a light breakfasts overall we had a great stay and would stay there again !!! if we could pay half the prices i will add photos later", "Date": "September 17, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "arkansas", "Title": "“If you have a pet ...”", "Author": "NGK", "ReviewID": "UR8522378", "Content": "I booked a room 6 wks prior to our visit. I told the reservationist twice that I wanted a room on the front with a view of the major street and that we had a small dog (7 lbs). The location of the room was very important to me. I called one week before our arrival to verify the reservation and once again, told her that I wanted a front room. We arrived at 2:00pm and were told there were no rooms ready and that official check-in time was 3:00pm. We drove around Branson for an hour. We returned at 3:00 and were told \"the room\" still wasn't ready. I asked if there were other cleaned rooms we could have. This is when I was informed that pets were allowed only on the bottom floor, on the back side of the hotel and in a limited number of rooms. I explained that I had explained precisely when making the reservation that I wanted a front room. She said those were the rules. Checking in was not the time to find out that I had been misled. We were put on the bottom floor in back of the hotel near an exit door and directly across the hall from a large room where the maids' supplies were kept and the hotel washing was done. The door was constantly being opened and closed from early morning until late afternoon with conversations and loud talking in the hallway. The bathroom tile in the room next to us was being repaired and there were hours of hammering sounds. The rooms directly above us were being recarpeted which added even more noise. This went on for five days and the hotel would not give us a different room. We travel extensively and have stayed in many hotels including 5-star hotels where they not only welcomed small pets but gave them gifts. Never, have we been treated so poorly because we had our little dog. I would never, never stay in this hotel again. NGK", "Date": "August 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Arkansas", "Title": "“Good place to stay”", "Author": "Ilike2go", "ReviewID": "UR8401372", "Content": "Nice hotel. Good location. Clean rooms and friendly staff. Experienced no problems. Would stay again.", "Date": "August 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arkansas", "Title": "“Wonderful Hotel!!!”", "Author": "Lisalaw1", "ReviewID": "UR8062570", "Content": "This hotel was wonderful!! Very clean, nice staff, nice breakfast. My family loved the art work on the walls and they were finishing up putting brand new carpeting when we were there. I will stay here from now on when we visit Branson. Just a wonderful hotel!", "Date": "July 5, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tennessee", "Title": "“Awesome!”", "Author": "Ashmmack", "ReviewID": "UR7937219", "Content": "My mom and I wanted to get away for a little shopping and stay in a hotel that was on the strip! We have been coming to Branson for around 22 years. This hotel was very comfy and the room had a nice arrangement. We thought the beds were comfortable and clean. We had a balcony looking out to the strip, which was preferrable. We enjoyed our stay...", "Date": "June 19, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "dosherfamily", "Title": "“I would NEVER stay here!!”", "Author": "dosherfamily", "ReviewID": "UR7854432", "Content": "My daughter and her Aunt stayed here. When I went to visit I was SO surprised in the Nastiness, Old smell and filth that I experienced. It smelled like and old museum. My daughters aunt had to change rooms due to MOLD in her room. My youngst daughter called me crying and wanted to come home because of the aweful smell in the room. IF you are a clean person that likes a clean house, you will NOT like it here! Trust me, it's nasty!", "Date": "June 16, 2007"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indiana", "Title": "“Absolutely loved this hotel”", "Author": "Love_to_travel0", "ReviewID": "UR7844629", "Content": "We were in Branson a total of 6 nights. We stayed here one night and now I wish we had booked there all 6 nights. It was an incredible hotel! Gorgeous decor. Absolutely loved our room! Would gladly stay there again.", "Date": "June 13, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "HOT SPRINGS, AR", "Title": "“Worst Hotel Yet!”", "Author": "TWOSHIPPS4JESUS", "ReviewID": "UR7552971", "Content": "King bed hard as a rock. Hair in the shower. Dirt/dust on the windows blocking the view to the dirt construction work behind the hotel. Save your $100+ and spend a little extra for the Hilton.", "Date": "May 6, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Saint Peters, Missouri", "Title": "“Awesome Breakfast Deals”", "Author": "spikerchick17", "ReviewID": "UR6852630", "Content": "We booked our hotel on Expedia after reading such good reviews on it. The pictures seemed nice and the reviews made it sound like a nice place to be. I know how that turns out sometimes--you know, you read great things and see great pictures, but then it turns out to be a total dump. Well, not for this place. The staff was friendly to us and gave us a great room. (I had read that if you want certain amenities in your room, you must ask for them in the reservations.) Everything I asked for was given to us, like a mini fridge, microwave and great view of the strip. Although the balconies are small and some are located at the base of the hill which the property is on, you can still get a good view of the infamous 76 strip. (We were on the second floor and our view was fine.) The rooms are kind of plain and there's nothing too special about them. But they're perfect for relaxing in at the end of the day. The main entrance to the hotel features a baby grand piano, winding staircase and luxurious decorations all around. It makes you feel like royalty. As for the continental breakfast, it totally rocks! On day one I did not wake up in time for the feast, so my dad brought me back a boatload of items. You can get anything you want at this place! The eating area is on the main floor and located just a few feet from the desk. It's decorated like a tea room, and tea is exactly what you can get any time of the day. On the second level, if you were to walk up the winding stairs, you'd immediately see a community computer, checkers, a snack bar and lots of comfy couches. It's an area for those who need to gather their parties or just get away from their rooms for awhile. It's rather quiet, so you could read a book or just nap for a few. (The computer is a pay by the hour.) Overall, our stay at the Grand Victorian Inn was pretty good. We didn't have any problems and the staff treated us very nicely. The room was clean, the building seemed in good repair and it was just a nice, relaxing place to come back to each night. One thing to be aware of: The hotel offers free Wi-Fi and this was definitely a mistake on my part, but while checking my Ebay account on their internet connection, my account was hacked into. Someone had set up an auction listing and charged my account $52! The matter was resolved, but I probably won't be taking my laptop on vacations anymore for this reason. I believe they got my password from something that secretly finds out keystrokes or whatever. Just beware!", "Date": "February 28, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "1", "Overall": "3.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "montpelier", "Title": "“Nice Place to stay”", "Author": "travellady248", "ReviewID": "UR6588847", "Content": "I stayed at the Grand Victorian and was very pleased with almost everything, the only problem was the lady at the front desk. She was rude to us on the phone when we were asking for directions and by time we got there her mood was even worse. She seemed irritated by us and quickly sent us to our room. We had a wonderful room that was extremely clean (and I am a very picky person for clean). When we were leaving to go to a show the same lady was there and said that she didn't know where it was (later to find out it wasn't even 2 miles down) and that she couldn't help us. When we were upstairs on the computer I even heard her talking to another guest saying how stupid they were! On our way in from the show I asked her what her name was and she said it was Judy. When I asked who the manager was she proudly said that she was the manager - I couldn't have been more surprised. Who would make such a rude person a manager? The rest of the staff was very pleasant during the rest of our stay but I would not stay there again just because of how rude the \"manager\" was to us.", "Date": "January 13, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "East Grinstead", "Title": "“A single traveller's point of view...”", "Author": "Caroline Jane", "ReviewID": "UR6515488", "Content": "Having read some of the reviews, I was not exactly looking forward to my stay at this hotel. In fact, having read one recent review in particular, I was seriously considering cancelling my booking altogether... As I was only staying there for three nights, though, I decided I might as well stay with it, and I was very glad that I did. I was travelling on my own, and the staff really looked after me. The room they gave me was larger than I usually get as a single traveller and, unusually, one with a view too. The room was clean and well looked after, and they could not have done more for me if they tried. Whist it is highly unlikely that I shall be returning to Branson, should I ever go again, I would definitely stay here again.", "Date": "December 29, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "2", "Overall": "2.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Beverly Hills, California", "Title": "“Grand Victorian Let Down”", "Author": "jackcolton74", "ReviewID": "UR6231692", "Content": "I am a group leader for our tour. We are currently at the hotel and I am accessing the Internet via free access (a good perk in the hotel's favor). Two items, facts only: 1) We have a group of 54. REquested in writing and triple checked with hotel for non-smoking rooms. One of our clients is currently in a smoking room. Front desk could care less. I asked her to call her next higher up. It is now 11:07pm and I am still waiting for the call from the management. 2) another of our client's requested additional pillows. Front desk clerk refused and was rude. Client went to front desk and ditto. Perhaps this employee is simply in a bad mood. The unfortunate thing is this employee is the only one on duty and therefore outright represents the Grand Victorian Hotel. Pity.", "Date": "November 29, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "st louis", "Title": "“Stay Away!”", "Author": "ironman-42b", "ReviewID": "UR6152953", "Content": "My 12 year old son planned my birthday getaway for me. We stayed at The Hotel Grand victorian the room # 102 smelled like an animal cage at the zoo. I complained Jakilynn at the front desk but nothing was done. The next morning I was having Raisin Bran cereal at the continental breakfast and after eating almost a whole bowl I found mouse droppings in the bottom. I again went to the front desk ( with the evidence) and showed Jakilynn, her response was \" we are going to remodle soon\". I am going to file a complaint with County Health Dept., Chamber of Commerce and dipute the charges with my credit card company.", "Date": "November 19, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Vancouver WA", "Title": "“Recomend the Breakfast”", "Author": "Vancboys", "ReviewID": "UR6145865", "Content": "We stayed in this hotel in October with my family in 3 rooms. Stopped at Lamberts on the way from Springfield to experience the meal and traditional roll toss and catch, fun place. I agree the rooms were fair, as far as cleanliness, but could use improvement in the bathrooms. The decor I thought was nice, as far as what I had seen online of the other hotels in the area. Nice view of the mountains, rooms on the small side since we were one of the upper dormer window rooms. The refrigerator and microwave were very convenient and not a common item in the other hotels that I found online. The Continental breakfast consisted of cereals, oatmeal, fruit, toast, bagels,donuts, juices. Much better than some I have experienced. I have found the listing of continental breakfast varies widely, sometimes consisting of just a bowl of apples. We made the indoor pool a number of times. Very nice to unwind, exercise after the day. The gas fireplace by the pool was a nice touch. Traffic on Country Music Blvd in front of hotel is horrible but can be navigated around by taking Roark Valley Rd (Blue Route) and then either Forsythe or Wildwood. The hotel is located between the two streets. Then its a shorter drive in the stop and go traffic (mostly stop) Had a great time celebrating my moms 70th, enjoyed the shows. Recomend Andy Williams and Yakov!", "Date": "November 17, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Augusta,Ks", "Title": "“Great Hotel”", "Author": "papa2", "ReviewID": "UR5823914", "Content": "My wife & I stayed here 4 nights, we had a 3 nite stay get 1 free internet special. The staff is GREAT!!!!! They were very nice always smiling & helpful. This is our 2nd stay here & it will not be our last. Our room was always clean & the maid service was always there to clean the room when we went out. We had a balcony room on the second floor on the back side of hotel, which we loved very much!!! It was out of the noise of the \"strip\" & very serene looking at the hill's.Sitting out on the balcony in the evening watching the sunset was awesome.Indoor & outdoor pools were very nice.Spa was REALLY nice after a long day shopping or sight seeing. I would highly recommed this hotel to anyone.", "Date": "September 21, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "2"}, "AuthorLocation": "Round Rock, TX", "Title": "“A mixed experience”", "Author": "artmachine", "ReviewID": "UR5351479", "Content": "The staff was very kind and tried hard to be helpful, but my husband and I had a few problems with the accomodations. We had a king jacuzzi room and were disturbed enough by the condition of the jacuzzi tub to go to a local store and purchase our own Ajax and scrubbing sponge to clean it. There were quite a few hairs left on the bathroom floor and in the tub from previous occupants. The pillows on the bed were quite thin, so we requested one extra pillow and were told there were none. So we went to a local store and bought an extra pillow. The indoor pool was closed while we were there.", "Date": "June 15, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Oklahoma", "Title": "“Enjoyed the Hotel Grand Victorian”", "Author": "obitwriter", "ReviewID": "UR4828485", "Content": "We spent three nights at the Hotel Grand Victorian in Branson. The hotel was nicely decorated, clean and comfortable and an affordable price. The bathroom could have been larger and the showerhead definitely needed to be higher. Loved the balcony and the view. Afternoon tea was a nice touch. Wish they would have had some bagels & cream cheese on the breakfast buffet. Gayle at the front desk was always helpful, cheerful and pleasant as were all the front desk personnel we encountered. We will definitely stay at the Hotel Grand Victorian again.", "Date": "April 2, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Unknown", "Title": "“Not recommended”", "Author": "A TripAdvisor Member", "ReviewID": "UR4456584", "Content": "We stayed at this hotel after driving by it several times and admiring it. From a far it looks just gorgeous! But wait till you get inside. The minute you drive up closer you start to notice that it is not as great looking as you thought it was but then may think that it is the inside that is important. Well, once you step inside, this will be another bubble that will burst. The entire interior decoration is supposedly Victorian-style but actually looks like they bought all their furnishings at estate sales and added some tacky decorations as it was customary in the Victorian times. This hotel looked like an old Motel 6 after an overhaul. Wallpaper peeling off in several places, cracks in tiles, baseboards detaching from the walls, etc. The shower was very narrow (and I am really a small person) and the shower head is WAY too low for anybody over say 5'2\" (I am 5'8\"). The rooms have thick curtains and they are there for a reason. On both sides of the hotel will be flashing neon signs ALL night, so intense that you think you are in Las Vegas! The views are either onto those neon signs (i.e. the Ride The Ducks attraction and a fast food restaurant) or onto a shopping center/outlet mall. The personnel is aweful, no matter how nice you are. They seemed bothered whenever we approached the front desk and despite the fact that the hotel was almost empty the same front desk coordinator who we originally checked in with asked us if we had a reservation EVERY time we approached her without even giving us time to ask what we needed to ask first (we wanted to ask about show tickets and about directions on another occasion). The advertised free internet service was down during our entire stay, the free continental breakfast reminded us again that you should not expect anything if something is free (they offered stale doughnuts and bagels even though Krispy Kreme is right next door!). The free coffee was bitter both times I tried it. As much as I am trying to be fair and look at it from a different perspective, I cannot honestly say much good about this hotel. My recommendation would be to find a different place to stay at.", "Date": "February 13, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Rooms": "4", "Value": "4"}, "AuthorLocation": "Unknown", "Title": "“A very nice place to stay.”", "Author": "A TripAdvisor Member", "ReviewID": "UR4104367", "Content": "We have been going to Branson for nine years, usually 4-5 days per trip. This was our first stay at the Grand Victorian. We thoroughly enjoyed it. I would recommend it to friends. There were no problems of any kind and the price was right. This is just a comment, not a complaint. They should get a universal gym in the Fitness room. All they have is aerobics equipment.", "Date": "November 10, 2005"}], "HotelInfo": {"Name": "Hotel Grand Victorian", "HotelURL": "/ShowUserReviews-g44160-d225112-Reviews-Hotel_Grand_Victorian-Branson_Missouri.html", "Price": "$88 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2325 West Highway 76</span>, <span class=\"locality\"><span property=\"v:municipality\">Branson</span>, <span property=\"v:region\">MO</span> <span property=\"v:postal-code\">65616</span></span> </span></span></address>", "HotelID": "225112", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/6d/03/6d03f412728537243ac4bc3ea1e82d656large.jpg"}}