{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Continues to excel”", "Author": "Maxsar911", "ReviewID": "UR126456827", "Content": "I have stayed at the Peninsula maybe once a month for the last six months. There have been a couple glitches from time to time. That is to be expected if you travel a lot. At the Peninsula they take active steps to fix those glitches, and do so in a very positive way. The rooms are very nice. I would recommend one of the suites. The bar downstairs has a great atmosphere. I made a mistake of ordering a double of a fancy bourbon and drinking the whole thing. The location is right in the middle of things. That helps on those cold windy days when you want to go somewhere, but don't want to spend a lot of time outside. The fitness center has the best overall range of equipment that I remember for a dedicated exercise facility that is not part of a larger independent fitness center that just so happens to be attached to a hotel. I have stayed at most of the high end hotels in Chicago. The Peninsula is the best in my opinion.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indianapolis", "Title": "“I'm a beleiver!”", "Author": "traveller4444", "ReviewID": "UR126298302", "Content": "I decided to go to Chicago this past weekend for a little business and a little pleasure. EVERYTHING was booked! All along the Mag Mile....Omni, Allerton, etc. etc..... I'd stayed on the Peninsula years ago but was too green to know a good hotel from a great hotel. But I left today...TOTALLY satisfied, and I am one PICKY SOB. :) I walked in Saturday to the registration desk and was greeted by Cecilia. I told her I'm in town for the night, don't have a room booked anywhere, and I don't want to pay a LOT of money. Well, she fixed me up with a room, and what was simply the best rate available...no special deals even with my charm and good looks, ha, ha. So....$395, and away I went to a slightly upgraded room. It was GREAT. The lighting, the colors, the cleanliness, the unmistakable attention to detail in every inch of the room was like being wrapped in a luxurious warm blanket. It just felt to GOOD! Super comfortable bed, a bathroom fit for a king, nice view, wonderful electronics (A/V, lighting, music, etc.) Five star...all the way. But here is what is different. I'm indeed used to nice hotels all over the world. But HERE, HERE, I found true customer service in EACH and EVERY employee! The Valet gentleman, the porters, Cecilia at registration, the MAID SERVICE was amazing!!! On this one point, let me elaborate. Each time I left my room (seemingly) I'd return to find my iPad cord wrapped up neatly, my toiletries, arranged label out, towels refreshed, slippers by the bed, plasma screen extended, ice in the bucket, bottle of water by the bed, etc, etc.... WONDERFUL! Our lovely maid from Sierra Leon in Western Africa was a gentle, proper, elegant woman who could NOT have done a better job. It's as though I had a dream about GREAT SERVICE, and thanks to my poor planning by not having a room reserved and serendipitously ending up at the Peninsula, it all came true. It was a pleasant surprise at EACH turn. They don't nickel and dime you either. Free WiFi, free coffee, shoe shines, tea, newspaper, and such. I know it's petty to mention that but so often at a hotel, you pay through the nose and then get hit for WiFi. I hate that. And I've NEVER had a free shoe shine. I didn't accept it, but it was all offered. Made me feel like royalty. I'm not a rich guy, and really shouldn't spend $395 plus parking and such on a night in a room, but let me say...it WAS worth it. It makes me want to work HARDER in life so I can afford such luxury again and again. Plus they're in my FAVORITE cities! Bangkok, Beijing, Paris, LA, NYC, Manila. Wonderful, wonderful, wonderful in every way. Expensive? A little . Worth it, yep!", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Simply Fabulous”", "Author": "areviewer", "ReviewID": "UR126235073", "Content": "I love this hotel. The second time I have stayed here - it has to be the best hotel in Chicago. The rooms are really comfortable and the bathrooms fantastic. The bar is very cool and the staff are really helpful The spa is wonderful with an amazing gym and beautiful 25m pool The location is perfect. Just around the corner is the Ralph Lauren restaurant which is a must do - certainly my favourite in the CIty. I would definitely recommedn and always stay here if available", "Date": "March 17, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“Just ok but I would never give 5 stars...”", "Author": "Violet A", "ReviewID": "UR126048203", "Content": "I stayed at The Peninsula for 3 nights in February. I always stay at 5 star hotels, mostly Trump or Park Hyatt. When I found out I was supposed to go to Chicago, I called Amex and the Peninsula was recommended to me as one of the most popular hotels chosen by Amex holders. The hotel was fine but.. I received a $100 spa credit. Great gift if you can use it. I was not able to. There were only 4 available spa appointments during my 3 day stay, neither of them was what I was interested in. I was told they were booked because of the Valentine's Day.. When I asked to exchange my benefit to food and drink credit, the answer was 'no'. I had to call Amex and they spoke to a hotel manager about it. The room was nice, clean and comfortable but small - if you go to the Trump Hotel, you are immediately upgraded to a suit. Their swimming pool is much smaller than the one at Trump. Hard to find a concierge - I tried 3 times, unsuccessfully. Finally, when I found him (with a little help from a receptionist), I was told they had no business facility in their hotel ! I personally had called the Peninsula before I made a reservation and I was assured the business room would be available. The concierge recommended \"a nice bar\" in the area... I spent extra hours looking for a place where I could meet my clients. Overall, the Peninsula did not meet my expectations and I would not recommend it.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "lisbon", "Title": "“Wonderful.”", "Author": "mylolisbon", "ReviewID": "UR125845741", "Content": "Had a wonderful stay at the end of February. The hotel is all you expect from a Peninsula and both the breakfast area and room are fantastically welcoming and comfortable, makes you feel right at home....will definitely go back on my next visit to Chicago.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santa Barbara", "Title": "“Excellent!”", "Author": "SBtraveler1", "ReviewID": "UR125817917", "Content": "The Peninsula exceeded my expectations. The service throughout was excellent. The rooms were extremely quiet with very comfortable beds. They have one of the best equipped excercise rooms of any hotel (in addition to the beautiful city and lake views). I liked being able to control all the electronics in the rooms from a panel on the nightstand. The location is superb. I will defintely be returning here when back in Chicago.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "hawaiiluver", "Title": "“The BEST hotel”", "Author": "hawaiiluver", "ReviewID": "UR125727401", "Content": "This hotel is one of my favorites. The service is fantastic from the front desk to the bellman - everything is top-notch. My room overlooked Michigan Avenue and the Water Works Dept. Lovely beyond belief at night... When I left, I was already yearning to go back... Maybe one day soon!", "Date": "March 6, 2012"}, {"Ratings": {"Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Orlando", "Title": "“Relaxing Afternoon Tea”", "Author": "cuffy.fla", "ReviewID": "UR125698935", "Content": "The afternoon tea service is divine. On the pricey side, but you will get plenty of food (like having a full meal) and the atmosphere is so relaxing. You sit in a big, bright room with lots of flowers and live musicians. It is a great break from shopping.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Beautiful Experience”", "Author": "Larry W", "ReviewID": "UR125660576", "Content": "Peninsula Hotels are always good but the one in Chicago is especially nice with a great location near Michigan street. The rooms are very large and nicely appointed, with huge beds and views from higher floors. A nice view from the bathroom as well a larghe window on the top of the bathtub. Nice breakfast, exellent service.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania, United States", "Title": "“POOR CUSTOMER SERVICE!!!!!!!”", "Author": "soma0506", "ReviewID": "UR125620536", "Content": "Spent one night this past weekend at the Peninsula and couldn't wait to leave by check out time. This past weekend my GF and I decided to spend 1 night in Chicago to celebrate my birthday. I am an AMEX Platinum card member and called their travel service to book a room. I narrowed the choice between Trump Chicago and Peninsula, decided to go with Peninsula to take advantage of the $100 Spa Credit they offered to Platinum members. Arrived late friday night and left saturday afternoon. Positive: The room was a nice size with a great view of Magnificent Mile. Negative: It is the first and last time I will visit this hotel. The customer service was poor. When I voiced my concern to the night manager that his security staff was being aggressive, disrespectful and inappropriate. He dismissed and antagonized me. The staff was inattentive. I had to call room service multiple times to have my ordered completed. My GF cancelled her Spa massage because the staff completely ignored when she arrived there. This place needs an overhaul and they need to treat all their guests with the respect they deserve. I recently stayed at the Trump Chicago. Hands down in my opinion Trump is a better hotel and experience.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toledo, Ohio", "Title": "“Top notch hotel in Chicago.”", "Author": "Chip B", "ReviewID": "UR125410175", "Content": "Stayed at The Peninsula this past weekend on a college visit for our son in Chicago. Great staff, accomodations, and location. Very attentive, almost too attentive when we arrived, as they kept dropping off \"welcome gifts.\" The one quibble we may have is that the drapes did not quite close all the way, making the room very bright, very early in the morning. The Spa is not to be missed.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Weston, Connecticut", "Title": "“Beautiful hotel with great, large, quiet rooms...”", "Author": "TOWestonCT", "ReviewID": "UR125159106", "Content": "Peninsula Hotels are always good but the one in Chicago is especially nice with a great location near Rush Street restaurants and a block over from the Magnificent Mile of high end stores and sights. The rooms are very large and nicely appointed, with huge beds and views from higher floors. I like quiet and the rooms are quiet indeed. I lost a button on my jacket and called for repair and it was back and pressed in my room in an hour. The restaurant in the lobby is very nice with an afternoon tea and a good luncheon. I would stay no where else in the windy city.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Awsome stay”", "Author": "Jinx223", "ReviewID": "UR124896331", "Content": "Will always go back it was the best service,location and really clean. Just amazing the inside of the hotel and the suites were huge i will always reccomend it for any one who likes luxury and treated the best.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Caversham, United Kingdom", "Title": "“Excellent”", "Author": "njhlab", "ReviewID": "UR124861368", "Content": "A brief, one-night stay for a business meeting but I was very impressed. I am a smoker, so I long ago resigned myself to tired-looking hotel rooms but this was immaculate. Best of all, from my perspective, was the bathroom. A separate shower and a full-sized bath (so rare in US hotel rooms), with the luxury of watching TV whilst lying in the bath. One small complaint: I only used the room service menu while I was there. Breakfast was excellent, but I do object to paying close to $15 for a pot of tea. No choice, as there isn't tea or coffee making facilities in the room.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Shhhhh....Hear that service on the Peninsula?”", "Author": "BillyTeddy", "ReviewID": "UR124855218", "Content": "Surrounded by three sides of water you would expect to hear and see just about everything on a Peninsula. At the Peninsula in Chicago you get the spectacular views (rooms, \"Bar\", the restaurant and MI avenue views are grand) but you have no clue how it all comes together. It just does and it does in world class fashion. The service and staff are spectacular in their silent ways. My spouse had a 90 minute massage and rated it as one of the better experiences. I on the other hand took advantage of the well outfitted gym (just imagine running over the top of the water tower....that is your view) and finishing it off with a steam and/or hot tub in the pool area. The lap pool only is astonishing in its view and the staff is very very attentive on EVERY simple detail. Impressive! I am not sure if people \"with money\" read TA but for those of us who want to maximize the $ you won't go wrong at the Peninsula. From the Friday/Saturday night chocolate bar and live jazz to the fresh, and I mean fresh pastries the Penninsula is worth the splurge. Look for the packages that include breakfast ($21) and parking ($54/night) and it becomes a bit more attractive. Not inexpensive but most TREATS cost a bit more. We hand a grand deluxe king with a decent view of the water tower. But you never really want to leave the comfy bed or get out of the wonderful marble shower! Of course this slice of land is set in the ideal location and you really won't want or need a car. Save for a while and spend it on this little slice of heaven called the Penninsula. You will love the views and be in awe of the service. Wherever and however it happens.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Amazing at every turn”", "Author": "dhyland", "ReviewID": "UR124759397", "Content": "Highly recommend this hotel. Location is perfect and the hotel leaves no stone un-turned. Our 4 night stay was flawless. Service was great. Staff was wonderful. 5 star all the way", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Slatersville, Rhode Island", "Title": "“One of the best!”", "Author": "Khouree", "ReviewID": "UR124041907", "Content": "We loved every second of our New Year's Eve getaway from the moment we arrived until we had to fly home. Service was impeccable and the suite was everything we could've asked for and then some. Enjoyed a massage to start off the new year right and I loved the relaxation room in the spa - the beds are so comfortable that I almost fell asleep. The staff went out of their way and accommodated our friends with a toddler and provided a crib complete with stuffed animal to make the little one happy! The hotel was kind enough to send us chocolates and fruit as a small holiday gift which was a nice touch and we did enjoy them along with some champagne. I miss the plush robes, the mood lighting and the tub in the executive suite...I would most definitely stay again when I return to Chicago, in fact I can't wait to go back!", "Date": "February 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Naples, Florida", "Title": "“Peninsula tops Ritz in my opinion”", "Author": "JohnS46", "ReviewID": "UR124027704", "Content": "Outstanding service, great rooms, good/great food choices and perfect location are all contained at Peninsula. Group dinner for 30 was as well done as any I have attended. Service levels were unquestionable at the top. Rooms were well designed and with all the necessary features. Mini bar was well stocked with a broad selection of items. Overall an excellent experience.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Pete Beach, Florida", "Title": "“I have stayed here about 20 times”", "Author": "intrepidtravelerfla", "ReviewID": "UR123992667", "Content": "And The Peninsula never ceases to amaze me. It is one of the very few places where you can stay and be assured that your entire experience will be PERFECT. Frankly, when paying the rates at a 5 star hotel like this, one should have perfection. You will. I have stayed at many of the other 5 star hotels in Chicago, and none can compare to the Pen.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ashland, Ohio", "Title": "“Service, service service!”", "Author": "ngerwig", "ReviewID": "UR123835629", "Content": "I took my daughter and some friends here for her birthday. The staff was incredible from the moment we checked in making sure that she felt special for her birthday weekend. This hotel knows what it means to \"go the extra mile\" when it comes to service! The suite was fantastic! We will absolutely stay here when we return to Chicago.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Grand Rapids, MI", "Title": "“Impeccable. First rate accommodations and service.”", "Author": "Foo-D-GR", "ReviewID": "UR123606015", "Content": "We found this the perfect place for a relaxing get-away. And, just outside the front door is an amazing array of things to do and see in the Windy City. For example,Tiffany's is on the ground floor. Where else can you find that? The hotel staff is expertly trained in customer service and are so friendly and helpful. The rooms are tasteful decorated and impossibly clean - everything gleams - and the whole hotel exudes a feeling of quiet and calm. You'll rarely, if ever, see the maids and there are no carts in the hallways. Everything happens as if by magic. Our room had fantastic amenities. Huge bathroom and guest bath in marble and glass, luxurious bed, fluffy bathrobes, tons of closet space, large living room, unique controls for mood lighting, electronics, privacy light, make-up room light, and even a door bell. The desk was outfitted with a printer and its own fax phone #. The concierge desk and pages were at our beckon call for everything our hearts desired. We didn't use them often, but it was great knowing they were there. There are simply too many thoughtful touches to list here. I highly recommend that you take a break and discover it for yourself!", "Date": "January 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lexington, KY", "Title": "“Wonderful!”", "Author": "like2travel86", "ReviewID": "UR123575393", "Content": "This hotel is very, very nice! Our room was sized very comfortably with a king sized bed, desk w/2 chairs, sofa, and coffee table and overlooked Michigan Avenue. The bed was very comfortable, just like home. You pass through a small dressing area with bench as you enter a lovely marble bathroom. The sound system in both sleeping area and bathroom are a treat. It was also very clean, something I'm pretty picky about! Someone in an earlier review mentioned thin walls, I'm not sure what they were talking about. I couldn't hear anything outside our room. We didn't use the spa but will if we are fortunate to have the opportunity to stay here again.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indiana", "Title": "“Fabulous New Years!”", "Author": "DashAmpersand", "ReviewID": "UR123459509", "Content": "We stayed two nights over New Years. The rooms were spacious and immaculate. Best bathroom I have ever seen. The dining was superb. Service was beyond expectations. The New Years gala was exceptional with a dynamite 13 piece band. It costs a bundle to stay here but when you are looking for a top notch experience, this is a great hotel.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“A wonderful classic 5 star hotel”", "Author": "Wowtravels", "ReviewID": "UR123044386", "Content": "I had stayed at this hotel back in June (yes a little late for my review) and truly enjoyed my stay. I stayed here on my last night while in Chicago, and I was so impressed with the Penn, from the minute I walked out of my cab. Highlights: â€¢ Gorgeous decor and ambiance all throughout the hotel, by far the nicest/grandest hotel in Chicago, for a 5 star hotel â€¢ Lots of natural light all threw out the hotel â€¢ Beautiful and very creative floral arrangements, thanks to Kehoe Designs â€¢ Very professional yet friendly service all threw out the hotel with excellent concierge service â€¢ Incredible rooftop pool/patio with lots of natural light â€¢ The Asian restaurant and the French bistro where both wonderful with great authentic ambiances and wonderful food/service â€¢ Lovely rooms, with gorgeous bathrooms and surprisingly great city views â€¢ Very comfy beds with soft linens and lots of pillows â€¢ Cool bedside controls (for lighting and drapes) â€¢ Very central location right on Mag Mile (great for shopping) Downfalls: (only a few minor gripes) â€¢ The biggest disappointment I had for this hotel, as much as I love it, for a five-star hotel, rooms surprisingly had horrible soundproofing windows (you could easily hear loud city noises and even hear people talking loudly, even thou I was up on the 7th floor) â€¢ Slightly dated decor in the rooms (lots of brass) â€¢ At times the service was stuffy and even to-over-the top I will for sure return back to this hotel, because I love the ambiance so much. It's well worth the $$$$ to stay here.", "Date": "January 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chetek, Wisconsin", "Title": "“Great location”", "Author": "jvand00", "ReviewID": "UR122621371", "Content": "The location of the hotel is perfect...right off of Michigan Avenue. Excellent concierge service and room service. Spotless. High tech \"command station\" by every bed allows guests to control all the lights, curtains, and room temperature. The marble-filled bathrooms have separate shower stalls and tubs, vanities with plenty of room to sit. Add in the flat-screen TVs, and you have a classic hotel that feels very up-to-date.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Always Top Notch”", "Author": "Mark J", "ReviewID": "UR122604701", "Content": "This is our go-to hotel for Chicago and my favorite big-city hotel in the US. The service is exceptional, the food is top-notch, and the location cannot be beat. I've probably stayed 50 times in the last 5 years and they have never missed (when things go wrong (and they sometimes do) they are very quick to fix them and make it up to you).", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Fine city hotel”", "Author": "ADSGWD", "ReviewID": "UR122594392", "Content": "Pretty standard as far as luxury city hotels go. That being said, the service, amenities and property are first rate. There was just nothing that was outstanding or unique to this hotel. I will stay here again and would recommend it for those willing to spend the money. We didn't use the spa but plan on it during a future trip. The hotel has a wonderful, clean gym with a lovely view. Also, we very much enjoyed the cozy, quiet bar - very refined atmosphere.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“A treat in Chicago”", "Author": "Cheyenne2_11", "ReviewID": "UR122586654", "Content": "My wife and decided on a whim to take a min-vacation for a few days to Chicago. Bought a package deal and stayed at the Peninsula. this is a hotel worthy a 4 or 5 star rating. Beautiful/elegant surroundings and public spaces, our room was spacious and beautifully appointed, and the staff service was helpful and efficient. you getthe feeling that everyone here is well trained and know how to deliver customer service. It's location is also excellent, steps from the Mile and from many attractions, we walked most of the time. It's not cheap, and the restaurants are a bit on the expensive side (a Light Breakfast was $65 for two) but worth it just for the surroundings. We'll be back.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "chicago illinois", "Title": "“Fantastic”", "Author": "lawdogs1", "ReviewID": "UR121986741", "Content": "Stayed for 2 nights in December. This hotel does what it does quite well. Impeccable service, spotless rooms, lovely amenities. The room was quite large with a nice selection of high end products. The bathroom had a deep run as well as separate marble shower with a glass door - a must in my view for a hotel of this calibre. Our choice of newspapers delivered in the AM, extremely comfortable bed with housekeeping service like stealth - you never knew they were around, yet everything always picked up and immaculate. Location in the heart of North Michigan. Ate breakfast both days at the restaurant - overall quite good. Sunday hosted an unbelievably well stocked buffet. Workout room clean and well equipped with cardio and weights- complimentary for guests. We expected alot here, and we were not disappointed. A great splurge!", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Park Ridge, Illinois", "Title": "“Outstanding Hotel in the Heart of the Gold Coast”", "Author": "AlanH1", "ReviewID": "UR121980514", "Content": "Room as well laid out and very spacious (for Chicago Standards)! Service was excellent throughout our stay (we were doing some shopping downtown for the holidays). We spent one evening at the bar downstairs and I must say that it was cozy, warm and the bartenders/drinks were outstanding. Not the cheapest place to stay in Chicago but at least you are able to obtain a great experience in return. Cannot go wrong with this property.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Nice Big City Hotel”", "Author": "lovetotravelChicago", "ReviewID": "UR121835760", "Content": "This is the first time either my husband or I had stayed at The Peninsula. It is one of the nicer hotels in Chicago we have been wanting to visit. We took our 2 year old daughter, so opted for a suite. I looked at the floor plans prior to booking, and had decided that their least expensive Executive Suite would work best for our needs. Upon check-in, we were offered a drawing for some in-house prizes, and we drew a room upgrade to a Junior Suite. I was concerned about the lay out working as well for us. I tried to get the woman at registration to explain to me why the Junior Suite would be a better option for us, and all she kept saying was that it is a more expensive suite - as if it would be silly not to take it. We finally gave in and took the upgrade, and it was a lovely room overlooking Michigan Avenue, although I still think we maybe should have stuck with our originally reserved room. I just didn't feel the woman who checked us in was as helpful as she could have been at this level of property. We encountered other members of the front desk staff who were very helpful and friendly, and everyone was very kind to our little one. We had breakfast both mornings in The Lobby restaurant. The food was good, and the service was great the first day and just okay the second day. Valet was efficient, all things considered with that location, and very friendly. We used the pool several times throughout our 2 night stay, and the people who worked in the spa were always very kind to bring goggles and toys for my daughter. The pool area was very nice, with the air temperature kept warm and the water slightly cool for those wanting to swim laps. The entire property was spotless at all times. Housekeeping was very good, and we appreciated them remembering to make up the sleeper sofa for our daughter the second night. Overall, a very nice stay and a lovely hotel, even if it didn't \"wow\" us as much as we expected.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milwaukee", "Title": "“Tops in Service”", "Author": "MUFanMilwaukee", "ReviewID": "UR121642361", "Content": "This is the second year in a row my husband and I spent a weekend at The Peninsula Hotel in December to enjoy the lights and do a little shopping and I just don't know that you can beat the service! The employees welcome you so warmly and constantly are thanking you for patronzing the hotel. They are quick to meet your every need. In my opinion the guest rooms are just wonderful, from the great big bathroom, to the decor to the comfortable beds. We always like to get a drink in the bar and order breakfast from room service which a real treat. They bring a table with a hot box up and you just indulge! Location is top notch. I just can't say enough about the way we are always treated at The Peninsula!", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Great location, very nice rooms, very good service, busy hotel.”", "Author": "agpklp", "ReviewID": "UR121427225", "Content": "Location just off Michigan can't be beat. Close to great restaurants and shopping. Rooms are as nice as anywhere (Ritz, Four Seasons etc.) although more high tech. Every light can be controlled by a master control for brightness, mood etc. There is a temperature reading by the door that tells outside temp - very useful in Chicago. Great sound system that plays throughout entire room and bath. Bed is tops. Bath and shower - as good as it gets. TV in bath. Service is very good all around. Maids fold any clothing left out, have shoes shinned, coil up lose cords from cell phone, computers etc. Lots of nice personal touches. No real negatives. Like many city hotels the lobby is up a floor and a little inconvenient. Very active hotel with parties, banquets etc... If you like slow and quite a boutique hotel might appeal to you more.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "MICHIGAN", "Title": "“Greatest Hotel in the Windy City”", "Author": "AGoodCupofJoe", "ReviewID": "UR121365133", "Content": "We stay there at least once a year. Again they prove in all ways large and small that they are the greatest hotel in Chicago.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Best City/Business Hotel In America”", "Author": "charlesa3rd", "ReviewID": "UR121136118", "Content": "Hands down, this hotel delivers \"perfect\" stays more consistently than any other city hotel in a major market in the country. When your room door closes behind you, you feel completely secure and \"in residence\". Great spa, awesome gym with a commanding view. Flat screen TVs, iPod docs with advanced audio visual. Friendly staff eager to anticipate and serve your needs.Terrific bar, also a decent place to eat if you are dining alone.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Tied for #1 in Chicago (in my book)!!”", "Author": "fvrbtmn", "ReviewID": "UR120916617", "Content": "I cannot say enough how much I like Peninsula Chicago - all the staff are great. The room was wonderful. Yes, the bathroom itself is another treat. You can listen to music or watch tv while you are enjoying a nice long bath in the tub. Complimentary coffee and tea every morning at the lobby or the health club are of excellent quality, as you expected. The breakfast the the \"Lobby\" always great - spacious seating with amazing sunslight coming through the window. Food at Shanghai Terrace was delicious and I did not need to go to Chinatown (unless you want Dim Sum or other special dishes). Hotel location was perfect for shopping, meeting, and sightseeing as well.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Best Hotel in Chicago!”", "Author": "Robj47", "ReviewID": "UR120827921", "Content": "Stayed again at Peninsula for Holiday Lights Festival and the entire experience was superb. Friendly helpful staff, amazing rooms, an absolutely heavenly stay!", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Glastonbury, CT", "Title": "“Lovely”", "Author": "Colafina", "ReviewID": "UR120739918", "Content": "My stay at the Peninsula was wonderful. The location was perfect and I was pleasantly surprised by the 60 degree November weather which was great for walking around the city! I wasn't able to take advantage of all of the amenities at the hotel since I was working, but the rooms were comfortable and spotless. The bathroom was amazing. Only complaint is that the service is too good; I do not like that the room attendant found my dirty laundry and folded it nor did I like finding my toothbrush in a different place. I would highly recommend this hotel.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "California", "Title": "“recommended”", "Author": "BillStickers_7", "ReviewID": "UR120738289", "Content": "Pros: Fantastic hotel. Huge room with couch, extra chairs, wood-and-glass table, thick carpet, desk with stapler, highlighter, rubber bands, sticki-notes. Bathroom with extra deep tub and tv; complete clean shower (that is, no mold on the grout â€“ a pet peeve of mine.) Great view of Michigan Ave., the water tower and John Hancock building. Locally owned pizza places, Walgreen pharmacy, fancy shopping (Nieman Marcus, Macyâ€™s) all within 1-2 blocks. Nice lobby bar â€“ lights not too bright, music not too loud, drinks not too overpriced, gas fireplace for extra atmosphere. Attentive, courteous staff. Cons: No thermostat in room (at least none I could find), so it was a little too cool in the morning, too stuffy at night. No direct access from room to street level â€“ need to take one elevator from room to lobby then another from lobby to ground level. A bit of street noise on 11th floor â€“ maybe itâ€™s quieter higher up. Except for a single siren, things quieted down for the most part at night. (I often need to wear ear plugs to sleep in hotels, but not this place.)", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“five star”", "Author": "ibeplato", "ReviewID": "UR120724318", "Content": "Simply one of the nicest hotels I've ever stayed in. Classy, great service, fantastic room, and right in the heart of Chicago. If your budget allows for high-end accommodations, look no further.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“one of the best hotels in the world”", "Author": "travelerdocmom", "ReviewID": "UR120569525", "Content": "We stay at the Peninsula Chicago once or twice a year and are always impressed by the stellar service and luxurious rooms. I travel frequently for work and am dismayed by the poor service that seems to be routine at most other hotels. It is a rare event when I can check out of a hotel without having some constructive feedback for the management. But the Peninsula staff know how to treat their guests. Although downtown Chicago was crowded with tourists and traffic, once we arrived in the upstairs lobby, we felt like we were in another world. There was no line at the check in counter, and they made us feel welcome as returning guests and even greeted my daughter by name. When we have stayed there for birthdays, they always leave a lovely plate of fruit and treats for us. The rooms are supremely comfortable, and the tv in the bathtub is always a highlight for the kids. The pool is clean and large enough for laps and is rarely crowded. The gym is well equipped and the spa services are fabulous. We were in a rush to get to the airport on the morning of check-out and told our waiter at breakfast in the lobby restaurant that we needed to get out quickly. Our food arrived within a couple of minutes, perfectly prepared. The small touches, like free bottled water in the room, free internet access, free local calls, and New York Times delivered every morning, make a real difference. The rates are high, but unlike many other so-called luxury hotels, where guests are charged for lots of extras and service is spotty, the Peninsula Chicago is worth every penny.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "maidenhead", "Title": "“Wonderful....expensive but worth every penny!”", "Author": "goombie", "ReviewID": "UR120398345", "Content": "Excellent few days in Chicago...hotel is a haven to relax in post meetings. Staff are helpful and do not beg for tips which is great as you don't feel hassled. Rooms are quiet, bathrooms and bed lovely, nice cosmetics etc...all good!", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "clarks summit", "Title": "“First Class al the way!”", "Author": "andiamo123", "ReviewID": "UR120346195", "Content": "We just returned from a 4 night stay at the Peninsula. We are annual guests as we attend a law conference each November. I can only say it is truly the most wodnerful hotel we have ever visited. The executive suite is perfect to allow enough space without feeling restricted. The views are magnificent!! I would especially like to mention the concierge desk, namely Robert and Gianna. We enjoyed fabulous meals and a wonderful stay due to their assistance in dining suggestions, securing reservations etc. Their attention to detail is beyond any I've experienced anywhere!! Also, Liz in the Spa is truly a gem and I would suggest stopping in for a faciol if you ahve the time. She is FABULOUS!! The entire staff at the Peninsula from reservations to heousekeeping and check out is superb. Scott at the front door....thanks again for your umbrella!! And to all of you who personally greet us each day, filling our ice bucket, providing special amenities we requested....it is all 100% class and top notch. I would (and HAVE) recommended the Peninsula to EVERYONE!! If you have the opportunity, by all means go and stay as long as you can!!! It is fabulous....I could go on all day......!!! The lobby restaurant, the Pierrot Gourmet (felt like Paris!!), the Bar, jazz combos in the evening, afternoon tea.....well, again, go and enjoy!! Kudos to the staff and management. A true gem!!!", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Castle Shannon, Pennsylvania", "Title": "“Expected a wonderful stay, but wow...”", "Author": "TJGREY", "ReviewID": "UR120291472", "Content": "Just got back from two nights at this truly remarkable hotel. Of course it's beautiful and elegant and I love all of the simple electronic amenities, but beyond that, the service was magnificent. The location is excellent as well. Wish we could have stayed longer. There are many hotels, and hotel chains that pretend to be first-class, but the Peninsula Chicago truly is.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "missouri", "Title": "“Wonderful experience”", "Author": "likesunusallodging", "ReviewID": "UR120111722", "Content": "Our recent \"American Girl\" package was absolutely wonderful. My granddaughter was amazed at the care and attention we received for herself and her doll. We also enjoyed afternoon tea and later the chocolate buffet, a must for a stay here. My granddaughter later pretended to be the clerk who checked us in, using all the wonderfully polite wording and attention we were given. Will stay there again when in Chicago", "Date": "November 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Brussels", "Title": "“Very good hotel”", "Author": "Peter_DC", "ReviewID": "UR120046774", "Content": "If I need to comment something then it would be to cold welcome at the front desk, but this personal and will not make me pick another hotel next time. I also found the temperature in the common areas way to low, but now i am realy looking to find something. Would defenetly recommend this hotel and go back, good chinese restaurant, good breakfast, great rooms with walk in shower etc.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lees Summit, Missouri", "Title": "“Wonderful Hotel!”", "Author": "JeanieTG", "ReviewID": "UR120024518", "Content": "We were there at the end of September 2011 and I love this hotel! It is a great location on Michigan Avenue. The staff was extremely helpful and courteous. Our room was so nice. Lots of space, great view, lovely bathroom and amazing technology. The fax machine in the room is a huge amenity when you are there for business. The bed was very comfortable. The TV swings out into the room for watching from bed which is pretty cool. We needed an iron and called the front desk. Within minutes there was someone at the door with an ironing board, iron, and starch. He offered to set it up for me! They have complimentary shoe shining which is so nice. You just put your shoes in a bag and they return them freshly waxed and shined. Overall, I loved this hotel. It was a treat!", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Coral Gables, Florida", "Title": "“Perhaps the best there is, not just Chicago, but North America.”", "Author": "Papa070", "ReviewID": "UR119938959", "Content": "Chicago is gorgeous and there are numerous great hotels. The best is the Peninsula. The location is perfect, right off Michigan and in the midst of everything. The entrance does not completely portray the beauty of the hotel, as you leave your luggage, and take the elevator to the lobby level. Then, it begins--a beautiful arcade/hallway, leading to the concierge and reception, with a continental restaurant serving three meals and afternoon tea and the best Sunday brunch. They also had a talented three piece jazz band on Saturday night. Down a flight is a top Chinese restaurant, and in the building is a french brasserie. The decorating is absolutely first rate, and then there are the rooms. We were fortunate to get their 2 for 1 deal, and also an upgrade to a suite, which included a complimentary mini cooper with driver. The bathrooms are large and perfect, there is a dressing room and closets and drawers, and the beds and furnishings are comfortable and lovely. My granddaughter began SAIC, which is the art school attached to the beautiful Art Museum down the street, and I also met with specialist doctors at Northwestern Medical down the street. Simply, a great weekend at a truly great hotel.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hoboken, New Jersey", "Title": "“Perfect Hotel”", "Author": "rjrdomer", "ReviewID": "UR119681479", "Content": "I only stayed here for 1 night and did not take full advantage of the hotel's ammenities. All I have to say is that it is a beautiful property, with very well appointed and spacious rooms (especially for an urban hotel). The bathroom was very nice with a full tub and separate shower. The bed was comfortable with superior linens. We did go to the hotel bar for a drink and the service was impeccable. The host who sat us actually went out of his way to seat us first when he saw us waiting at the entrance and another couple barged in and went right up to him for a seat. He politely refused them and came over to seat us first as we were in line first. Now that is class!", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Excellent staff”", "Author": "dcdowntown", "ReviewID": "UR119624531", "Content": "My family and I have been to this Peninsula twice in the past few weeks. The first time (Sept) we went to install my daughter in college and the second (Oct) for the school's \"parents weekend.\" On the earlier trip the hotel went far beyond our desire to give our daughter a pleasant start to her transition to dorm living. We booked two adjoining rooms for ourselves and our two children. We flew into town early and decided to have our bags held at the front desk while we started out for that don't-want-to-carry-it-on-the-plane-but-gotta-have-it-for-your-dorm shopping excursion. The woman checking us in spent some time chatting with my wife, told us our rooms weren't ready yet and took our bags. While we were making our big-box store rounds, we were called by the front desk manager who offered an upgrade to a suite, at no increased cost. We said yes. On returning to the hotel we were shown to a very large suite with views of the lake. It was an extremely generous upgrade. The rest of the good reviews are consistent with my experience. The lobby, bar and public spaces are pleasant, the rooms well-appointed, the proximity to Michigan Avenue excellent. Small points to add. There is a weekend p.m. chocolate buffet in the lobby with live jazz that is very well done. Traffic on Superior, the street out front, can be jammed at times, so if you have a car or need one, allow for that if you are in a rush when traffic is snarled. There is a famous deep-dish pizza joint on the next corner, Giordano's, that everyone (adults and kids) likes; so much so, that there are more rules than East Germany if you want to get a pie anywhere near the dinner hour. They deliver promptly to the hotel, so you can choose to tackle the long waits in comfort. The exercise facilities (large with plenty of equipment) and pool, located in the spa on the 20th floor have great views.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Perfect location, perfect stay”", "Author": "Dom S", "ReviewID": "UR119597706", "Content": "After an exhausting business trip with several meetings in Chicago I checked into the Peninsula for one night before heading on to Toronto. Immediately I realized that I did the right choice. The room on the 17th floor was spacious, elegant and calm. Everything I needed was there and everything was done with good taste. Although the hotel is celebrating its 10th anniversary, it was in top condition, updated and fresh. After a relaxing shower in a marvelous bathroom I run out to do some shopping on Michigan Street with its international top brand stores only a footstep away. It was just before the shops closed, but still in time to find a small gift for my wife. All in all a perfect experience in Chicago!", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Much has been said and its all true!!!”", "Author": "ninasch1976", "ReviewID": "UR119530998", "Content": "I can only say it is the best hotel in North America that i have stayed in. The Service is top, the Location can not be better, you just step out of the hotel and there is Tiffany, Ralph Lauren, VictoriasSecret and more in the same builing! WOW! The Pool is very convenient, the ESPA Spa a must go and all therapists there (especially the male) was perfect. Shanghai Terasse is their high class Chinese Restaurant, its devine. Breakfast was so convenient and nice in the Lobby, my goodness when can i go again. Last but not least: The rooms are huge, the beds amazingly cozy, i have found my paradise in Chicago. Do not hesitate, just go!", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lexington, Kentucky", "Title": "“Best hotel in Chicago if not all large US cities”", "Author": "CVO719", "ReviewID": "UR119197336", "Content": "I stayed at the Peninsula in October 2011. Everything is meticulous and detailed. The food is fabulous from the fresh squeezed juice to every other item that I tasted. It is perfectly located for shopping even if you are there on business. I cannot recommend this hotel highly enough - it's only drawback is that you do get what you pay for. Just the bathtub with the TV at the end is worth the money!!", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bedford, United Kingdom", "Title": "“Great business hotel”", "Author": "Mav1244", "ReviewID": "UR119098208", "Content": "I stayed here for a conference and found the staff to be extremely attentive for a such large hotel. The rooms were a very good size and comfortable although i did find it odd that I had to phone for room service to provide me with a kettle and coffee/tea so that I could make a drink first thing in the morning. It is definitely a business hotel and is conveniently right next to the main shopping street.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Nice with one glitch”", "Author": "Maxsar911", "ReviewID": "UR118940824", "Content": "Great hotel in a fantastic location. Have stayed there many times. Good food, service and rooms It has a nice exercise room that is listed as being 24 hours. I went downstairs at 5:00am after I couldn't get the elevator to go up to the 20th floor. The clerk at the desk said that the elevator was closed until 5:30 which would be the earliest I could exercise. I didn't have time so I moved on. I did complain on the comment sheet after double checking that the hotel says it has a 24 hour fitness center. A couple things happened. I got an email from a manager saying they had made a mistake and had gone back to make sure that their staff know to get security for guests if they want to exercise early. I sent back an appreciative thanks. He called me at work, but couldn't get me. I forgot about the whole thing, then I got another call from him about 5 days later. He just wanted to make sure he apologized personally. It was well done. Mistakes happen. How people and companies respond shows how good an organization is.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“Disappointed for the Second Time”", "Author": "jillyp16", "ReviewID": "UR118761951", "Content": "We just returned from a weekend at the Peninsula with our children. We have stayed at the Peninsula several times in the past. But this is the second time I have been disappointed with our stay there. The last time we stayed there (which I failed to review until now) was a disappointment for this reason: We had decided to stay at the hotel in order to try the Hastens mattress that they at one time advertised. We specifically requested a room with a Hastens bed, as we were considering purchasing one. When we arrived to check in, they did not seem to know about the request and said that particular room wasn't ready and so we waited for quite some time. Long story short--we called the front desk to tell them we didn't think it was a Hastens bed (they have a distinctive checked pattern) and were assured by the front desk, in a somewhat snotty way, that it in fact was. As we were getting ready to check out, housekeeping pulled the sheets off & I saw that it was a Sealy mattress. I just felt kind of ripped off. We decided to give it another try last weekend. This time we were disappointed due to the overall attitude of most of the hotel staff. The concierge desk (more than one) was unorganized and a bit snotty in booking dinner reservations, etc. I asked a female concierge for advice on a restaurant and she was uninterested in helping me. I should also add that it is quite difficult to call the concierge from outside of the hotel. Go ahead, try it. You will not find the number online and will have to be given another number to call, be transferred, etc. Not a big deal if everyone is nice and helpful when you finally get through. What, to me, separates a luxury hotel from a regular hotel is the degree of service and how that service makes you feel as a guest of the hotel. For example, at most Four Seasons properties, the staff makes you feel like a rock star. Cheesy, but true. Guests want to feel important. Here, the service was very inconsistent and I felt the attitude was almost like an East Coast snobby vibe (no offense intended). No major rudeness, just like we were inconveniencing them to ask for something. Room service was at times wonderfully polite and then mediocre, depending upon who answered. As for housekeeping, we left one morning at around 9:30am & put the \"please make up room\" light on. When we came home at 5:30pm to shower and change for dinner, the maid had just arrived and had not started cleaning yet. Just kind of an inconvenience. The one bright spot was the bell and valet staff. They were exceptionally courteous and helpful. In fairness, I should mention that the hotel is lovely. And it is quite welcoming of families with children. There was a very nice welcome treat (with gummy bears) that my kids really enjoyed. They were also thoughtful enough to provide small robes and slippers for the kids. While they do have a nice-sounding children's menu, some of the food we ordered was really subpar (ie-chicken fingers were pretty bad, as was the \"children's tea\"--my kids wouldn't eat it). Overall, my main issue is attitude.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fairfield County, CT", "Title": "“Excellent Hotel. Check out the roof deck on 4th floor”", "Author": "nodrama1", "ReviewID": "UR118533371", "Content": "A truly high end hotel. I was at a conference and several functions were held on the rooftop overlooking Michigan avenue. When the weather is good the roof deck is fantastic. Beautiful rooms with easy to function alarm clock, lights and thermostat (don't under rate this - many times at other hotels I have had to call the operator to work things out). Location is excellent - right in the heart of Michigan Ave", "Date": "September 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Palm Springs, California", "Title": "“Best Place for Service”", "Author": "Baddydaddy", "ReviewID": "UR118526155", "Content": "Though pricey, this place delivers unsurpassed service. You definitely feel like you are getting something special.", "Date": "September 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Exceptional Service!”", "Author": "Blondie2846", "ReviewID": "UR118381739", "Content": "Amazing hotel. You can easily understand why celebrities stay at this hotel. The level of service lived beyond its reputation. Everyone anticipated your needs and was very pleasant helping. From the mini-driver to the concierge to the wait staff bringing breakfast every morning, the service should be what every 5 star hotel aspires to. Clean, beautiful, comfortable. Best hotel experience I've had.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Exceptional Experience!”", "Author": "Jeff D", "ReviewID": "UR118287840", "Content": "This was among my best hotel experiences ever. I've stayed hundreds of nights in places all around the world and the service at this hotel is exceptional. After I checked in, the attendant took me to my room and gave me a run down of all the accoutrements. Despite numerous guests, I waited for nothing. Immediate access to facilities, concierges, and services. The property itself is very comfortable. The bed in the room itself was initially great but settled through the feathers to a firmer style I generally don't like. The bathroom was awesome and the TV near the tub was cool. Very comfortable and a quick walk to many places in the heart of gorgeous Chicago. Right across the street from Giordano's if you like the famous stuft crust pizza! I had great weather that day and it was an awesome overall experience.", "Date": "September 18, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Santa Monica, California", "Title": "“Unparalleled Service”", "Author": "98chevysub", "ReviewID": "UR118024911", "Content": "The Peninsula Hotel chain is known for exceptional customer service. I recently found this to be consistent while staying at the Chicago location. I have stayed at this location before, as well as Beverly Hills and New York City. My trip September 10, 2011 was just for one night, for a friend's baby shower which I flew in for. My room was upgraded as I am a repeat guest and I appreciate being recognized as such. The concierge, Robert, greeted me with a huge smile by name even after not seeing him for a few years! I ordered room service and found the food as expected- fresh, beautifully presented and delicious. I enjoyed the spa- I used the steam room and also luckily grabbed a toiletry kit as I had forgotten my tooth brush. I also enjoyed the Peninsula bar which is one of my favorite hotel bars, and the dining room for breakfast with a friend. The hotel location is perfect for shopping, sight seeing, city life, walking/strolling, and enjoying Michigan Avenue. My room was so comfortable and luxurious- a corner room on the 17th floor where I was mesmerized by views of the full moon rising out my windows. It was a lovely 24 hour splurge with comfort, service, and the pleasure of excellent attention to detail.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "USA", "Title": "“truly the best city hotel in the US”", "Author": "SearchingUsa", "ReviewID": "UR117992842", "Content": "We've been loyal Peninsula visitors for years and returned this year for another weekend retreat. It is truly the best of the best for its level of personal and dedicated service. In Chicago, the location is outstanding and the restaurants are of the highest quality anywhere. My wife is a passionate advocate of the Spa and the pool space - again the best in Chicago. We'll be back for certain.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Arlington, Virginia", "Title": "“Understated Luxury”", "Author": "Arlington7175", "ReviewID": "UR117713560", "Content": "There is really nothing more that I can add to all of the positive reviews written by others. We try to go to The Peninsula once a year, and I always look forward to staying at the hotel. Yes, as others have stated, it is expensive, and if you want over the top glam for the money this is not the right place for you. If you want very comfortable, under stated luxury, then The Peninsula fits the bill. Service is impeccable and the rooms are designed to anticipate your needs. I have not experienced a hotel room that is laid out as well as the rooms here. Also, we have never done the chocolate late night buffet, but I've heard many good things. We have had the Sunday brunch several times, and it is outstanding each time. Once again it is expensive, but it includes a wide range of options of extremely high quality. I'm looking forward to returning soon.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto", "Title": "“Perfection”", "Author": "Lawrence2300", "ReviewID": "UR117700542", "Content": "I have stayed in many hotels, perhaps hundreds. None come close to the Peninsula in terms of getting it right. This hotel defines every standard. Sorry to say, I could not find a flaw. So, my review will simply define some of the extra touches that went into this definition. In no particular order: When you arrive, you face the concierge desk, not the reception. The concierge, rather than point my to the reception walked with me over to the reception, and struck up a fascinating conversation. The room with more logical electronics, well laid out, with easy to read instructions, even a TV remote that illuminated when you touched it. A welcome fruit layout (I was not VIP'd or anything like that). A breakfast, where upon ordering oatmeal, I made a comment to my colleague that the sugar was not real brown sugar. I did not ask the staff for n alternate; they came with it in any event. We were working in a suite on a business program, ordered coffee. It arrived, and about an hour later, they brought a second carafe, because the waiter thought we looked as if one was not going to be enough. (He was so right!) When I went to leave, I did not check out, as I was late. Yet, the doorman, somehow, knew my name...there was no way he could have been alerted to my depature! The bar has been set very high.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "chicago", "Title": "“Quiet pampering”", "Author": "ck5", "ReviewID": "UR117553175", "Content": "This is their anniversary year, so through December, you may find some special rates or add ons. The Peninsula staff is what makes the hotel so wonderful...never pushy, but always accommodating, they are quick to answer all requests. The pool, spa and gym are on the 20th floor with fabulous views. In warm weather, be sure to sit on the small outdoor terrace by the pool. The Lobby Restaurant serves nice food in a lovely setting as does Shanghai Terrace.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New York, New York", "Title": "“Comfort & Elegance”", "Author": "das317", "ReviewID": "UR117234999", "Content": "We stayed at the Hotel for 6 nights. The service and mamagement was excellent. The rooms are comfortable and staff is well trained, friendly and eager to accomodate requests. The Hotel is centrally located to the main shopping district and near other attractions like the Water Tower. We did not like the dinner we had in the Lobby restaurant but breakfast was good and it was not a buffet! This Hotel is worth paying a extra for.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "portland, oregon", "Title": "“The best hotel in America-redux”", "Author": "hotelfan", "ReviewID": "UR117008847", "Content": "I have had the good fortune to stay in this wonderful property 6 times. I have been so spoiled by each experience that I am always terrified that there is no way it can live up to my expectations. I just spent 5 nights there with my 20 year old son (before he returns to college) and I'm delighted to report that, as usual, The Pen exceeded all of my expectations. This hotel has it all. An unbelievable staff, a phenomenal location, 4 great restaurants, a terrific bar, and perhaps THE best fitness center/pool in the world. The cardio machines are beyond state of the art and the pool is gorgeous and inviting. Every time you interact w/a Peninsula staff member, you are greeted with someone who meets your gaze and wishes you a good morning/afternoon/evening. These folks are genuinely vested in your visit and consistently go beyond and above the call to insure that all of your needs/wants are met. The staff, from the doorman to housekeeping to room service are all professional, warm, unpretentious, and wonderful. The director of guest relations, LeeAnn Brown, has become a family member and friend. She is genuinely concerned about our well being and has-miraculously- found a source for \"Chuckles\" which are sadly, very difficult to find for all but Ms. Brown. I travel a lot. Nobody but Ms. Brown has sought out and procured \"chuckles\" for me. Thank you! On this visit, we had a wonderful experience in the Shanghai Terrace and another in the street level restaurant. I'm really picky but this place is beyond the call. From the size and weight of the towels to the TV/radio in the bathrooms to the free wi-fi and water that is set out for you each night, this is THE place you want to come home to. I cannot recommend any property, anywhere, with greater enthusiasm than I do the Chicago Peninsula.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sausalito, California", "Title": "“The Best Hotel Experience in the U.S>”", "Author": "Tiffany T", "ReviewID": "UR116899777", "Content": "My husband and I loved our stay at The Peninsula in Chicago. The hotel room was plush, quiet and with an elegant floor plan. The hotel has excellent restaurants, a cool bar and a great spa with a full-sized lap pool which we used every evening before dinner. The location is perfect for visiting Chicago and our room was always a tranquil sanctuary from the hustle and bustle of the city. On our last night we had excellent room service from the Shanghai Terrace; we felt very well taken care of (and had dinner in our pajamas)! The service at the hotel was top notch, especially housekeeping. They do and excellent turn-down service before bedtime. Staying at the Peninsula was the best hotel experience we have had in the United States.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Louisville, Kentucky", "Title": "“\"You get what you pay for \" and more!”", "Author": "Ted1348", "ReviewID": "UR116771713", "Content": "I wanted to treat my 20 year old daughter to a gala weekend in Chicago and could not have picked a better hotel than the Peninsula.I had stayed at the Peninsula once before. I was very impressed with this hotel, so I knew we would have a excellent hotel experience ahead of us. And we did as I will explain. We were lucky to be part of The Tenth Year Anniversary Celebration that the hotel had to offer. This basically was an offer for the first night room rate at full price and then the second night rate at $10 dollars!!! Yes I took the offer! I had called the hotel for an early check-in. When we arrived we were able to get into our beautiful Delux Suite 3 hours early!!! Upon entering our suite we had a welcome card and assorted fruit and nut tray. After going out for a few hours we returned to a complimentary bottle of fine wine and chocolates. We had room service twice a day. If you can afford a Delux Suite I would say go for it.We had two queen beds in the bedroom although you can have the choice of a one king bed in this type of suite.This suite also has a pull out bed in the living room if needed . The suite had an luxurious master bath and off the living foyer is a very nice half bath. My daughter said that she would actually love to live in this suite.We did have a small view of Lake Michigan. The gym on the 20th floor is well equipped with even better views of the city and servral views of Lake Michigan.We did not use the spa but I will on the next visit. We had afternoon tea in the main restaurant/lobby area both days.The tea selection is over the top as you might expect. We enjoyed the orchid oolong tea with a vanilla -coconut flavor. Our first night we had dinner in The Shanghi Terrace at 7:30 pm. There were quite a lot of children having dinner before this time. I opted for indoor seating which I felt to be more intimate and quite than outdoor seating. By 7:30 pm most of the children had had their dinner and there were no children seated indoors when we had our very fine 2 and half hour feast on a friday night.. I enjoyed the Crispy Duck as my entree. One nice feature about our suite is that several side windows could be cracked open a bit letting lake breezes fill the room if you wish.. I had asked my daughter before we left to leave the city if she could think of one flaw that the Peninsula possessed. She said after some thought \" No\". I totally agreed with her! Yes, you get what you pay for and more.The more is all the little things that a hotel of this quality does for you. A concierge that I only briefy talked to, and who was not our main concierge, new my name the next day! I used to be a loyal to The Mandarin Oriental Hotels.I thought they were the best. Now the Peninsula in Chicago is my number one city hotel, by far.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "south carolina", "Title": "“Great hotel if you can afford it”", "Author": "2Itravel4fun", "ReviewID": "UR116721876", "Content": "First off, this is a very expensive hotel. No doubt if you are considering staying here, you already know this. For this reason, it seems a little unfair to compare it up against hotels that are charging much less for a nights stay. It never feels quite right to me to expect the same thing out of a Kia as one would out of a Masserati. So...in my review, I'm really only comparing it up against similar hotels who charge fairly handsome prices. First of all, it's an attractive hotel. Clean, comfortable, great location just around the corner from Neiman Marcus and Saks Fifth Avenue. If shopping is your thing, you won't have far to cart your new treasures. The staff is understandably and appropriately solicitous. And they should be. For the price, an extremely helpful staff in not a nicety, but a given. We stayed in a one bedroom suite. Obviously, everything was clean and reasonably state of the art. There were many remote control features, my favorite being the television that could be accessed from the bathtub. (The technology was slightly old, but still very nice.) The bed was extremely comfortable, the room reasonably quiet considering it looked out onto the traffic of Michigan Avenue. The hall noise was non-existent. Room service was quick and efficient, and the food was acceptable, if not mouth-wateringly delicious. My son had high praise for the club sandwich with avocado and egg, but not having tasted it personally, I really can't comment. We dined at the Michelin Two Stars Avenues restaurant. It is the pride of the Peninsula, and it's a pretty decent restaurant if you enjoy adventurous eating. If not, I'd say skip it. Our bill for three people - this includes four alcoholic beverages - was over $600.00. So...this was a pre-fixe menu, and included roughly eight courses of Very Unique food. Amazing presentation, amazing service...Very Unique food. This is the type of thing one probably encounters on very upscale cooking shows, but rarely encounters in their everyday life. I'm glad I tried it, but a little bit of sea urchin goes a long way. Capiche? We ate breakfast one morning in the lobby restaurant, and I would have to say that those orders of Eggs Benedict and that bowl of oatmeal were pretty lackluster. I don't mind paying for things if they hold merit, but I don't like to be taken any more than the next person, and the day that a few skimpy plates of eggs and overcooked hash browns combined with a bowl of oatmeal and berries equals out to over $80.00 - well, that's a sad day in my culinary digest. Anyway, the hotel owns a far better breakfast and lunch cafe adjacent to the lower level of the hotel, and it's a much better choice for casual and tasty dining. So, in closing, the Peninsula is a fine enough hotel, but certainly nothing for bargain hunters. The location is probably it's most pertinent distinction, but clearly it's a top notch hotel as well. Just bring your wallet, and be prepared to use it.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Dusseldorf, Germany", "Title": "“Excellent and outstanding! I wish I could stay here forever”", "Author": "YoshiDus", "ReviewID": "UR116534019", "Content": "We had the great pleasure to stay at this really wonderful hotel for 7 nights in July 2011 during a short summer trip to Chicago. I am a big fan of the Peninsula chain of hotels. Having stayed in Peninsula hotels in Bangkok and New York our expectations were somewhat high and the Peninsula Chicago absolutely fulfilled them. The location is one of the best in Chicago right on Michigan Avenue. The lobby and the property are gorgeous. Staff was extremely friendly, professional and welcoming. Our room on the 8th floor looked and smelled like we were the first guests in it. Immaculate clean, no spots, everything as accurate as you would expect it from one of the worlds-best hotel-chains. Housekeeping did a great job twice a day. The room itself was huge, more like a junior-suite in other hotels with a separate dressing-area and a walk in closet. We slept excellent. There was absolute no sound from outside or the other rooms on your floor. There was plenty of storage room and closet space. The marble bathroom absolute perfect and clean. Robes, slippers and the really wonderful Davi bath-products added up to the experience. Our room did not provide much of a view but it was OK for us. A big plus is the location and the Concierge Service. Many thanks to Garry Schneider, one the concierges, who really provided exceptional service and suggested many hidden restaurants and trips of the beaten track. Personally I appreciated the small things that makes this hotel a 5* one: shoe-trees in your shoes after complimentary shoe-shine, collar-sticks with the hotel logo on it in your shirt after laundry and so on. Overall I would highly recommend The Peninsula for your Chicago visit. There is only one small negative to mention: the pool looks much better on the pictures than in nature, but who cares about a pool in Chicago?", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Opelika Traveler", "Title": "“Outstanding”", "Author": "OpelikaTraveler", "ReviewID": "UR116489943", "Content": "This was the first time I've stayed at a Peninsula Hotel and It met my expectations and more. Every staff member from the front desk to houskeeping was obviously extrememly well trained to provide outstanding customer service. While the rate was very pricey, it was worth the money because of the impeccable service.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Ormond Beach", "Title": "“Great Location, Great Service, Great Hotel!”", "Author": "MarkOrmondBeach", "ReviewID": "UR116133841", "Content": "Top quality property with superb service and luxurious room. Spa was excellent, as was the breakfast in the lobby restaurant complete with a string quartet. We had a child with us that was also catered to with special treats in the room on arrival. Concierge also very helpful with directions and suggestions.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Luxembourg City, Luxembourg", "Title": "“As usual, tip top”", "Author": "Kuni1407", "ReviewID": "UR116114041", "Content": "Stayed here for 9 days. Coming back to the Peninsula after 3 years was as it has to be: the \"welcome back\" greeting, the service, the summer special upgrade to an executive suite (awsome bathroom with a view on Michigan avenue), the environment and not to forget the service. Special mention for reception and concierge who had always a listing ear and ready to make your stay as confortable as you wish. So, for me it was good \"to be back\". If you want a hotel without negative surprises with a stable level of (very) good quality of service, do not hesitate. Try out also the food from the Shanghai Terrace or The Lobby (yes I skipped Avenues because I did not want to have dinner alone, but I tried it out previously and it was good). The Peninsula is may be not the cheapest around :), but price/quality it suits me perfect.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Cybertron", "Title": "“Beautiful Hotel, Top Notch Service, but Smelly Room”", "Author": "AllSpark1", "ReviewID": "UR115941031", "Content": "Ultra-Luxurious Hotel. Beautiful room. Outstanding top notch service. The pool at the top of the hotel with floor to ceiling windows overlooking Michigan Avenue is one-of-a-kind awesomeness. The thing that killed it though, was the stale, dirty-sock odor that pervaded our room during our 4 day stay : ( It was VERY unpleasant.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Service": "5"}, "AuthorLocation": "Tucson, AZ", "Title": "“Gorgeous hotel, not without kinks, however”", "Author": "sandatucson", "ReviewID": "UR115936163", "Content": "The Peninsula is in the heart of the City, a heartbeat away from the famous shopping stores like Sax 5th Ave., Nordstrom Rack, etc. This is a plush hotel and we enjoyed the executive suite we stayed in. Excellent staff, very helpful. I had one meal in the room, and I did not think it was particularly great. I had a drink ( 4 glasses of wine in total were consumed) with a friend and the bill was $44 for Pino Grigio. The cell phone reception from our suite was practically non- exixstant ( I use Verizon) and the WIFI was terrible. I was constantly bounced of and finally they had to just connect me with a dsl connection. I am not sure that if I had to pay for a hotel I would choose it.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "ohio", "Title": "“Worth the money to an extent......”", "Author": "ohiorona", "ReviewID": "UR115864641", "Content": "I must say that you expect to pay to stay at the Peninsula. We got a great deal I just happened to find a night free and discounted nights on top of that. That being said it was worth every penny, as we wanted to be pampered and basically do nothing. This is our 8th trip to Chicago and this was just for the love of the city and of course the food. If you're just there for shopping and never in your room don't stay here because you'd never appreciate the amenities, like the spa, sundeck and pool. They are very customer service oriented, which when I travel I want, and I really can't say a negative thing about our experience except I found it rather odd that they didn't have an ironing board and iron alreadly in your room. Of course as soon as I called down they immediately sent up the iron, ironing board and spray starch, magic sizing etc anything and everything you'd need. That being said there is a reason this is the best hotel in Chicago and I've stayed all the other comparible hotels. Just save up your cash and really look for the deals because at normally $600 a night and up you need to get the most bang for your buck.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“One of the best hotels I have ever stayed at”", "Author": "AlvinMonk", "ReviewID": "UR115846025", "Content": "I attended a wedding this last weekend and decided to also stay at this hotel for four nights to take advantage of a special wedding rate that was extended to me. I had a room on the 15th floor (20 is the top floor I believe) and it had ample view of the city, other large buildings, city life, etc. Proper sun/shade/drapes were in place... although nothing allowed us to escape the blaring sirens that are almost constant in city life. Someone really needs to talk to the Chicago fire department to tone down all the unnecessary noise they make. The room was medium in size, very well laid out with a separate dressing area and very large bathroom. All lights, utilities, furniture, art, rugs, tile, bathroom, etc, were completely modern, clean, and well maintained. Extremely high tech, yet simple to use, lighting, air system, safe, phone, DVD, TV, stereo, tv in bath tub, etc. Makeup mirror, safe, mini bar, etc. They have a one hour service to remove wrinkles in your clothing, or they will bring you: an iron, a board, spray can and spray water... all very clean and now, so your clothes wont be ruined. Turn down service is done nightly. All requests for room clean and do not disturb are electronic and not paper/hang based. We lives strangely in the room and did not want the room cleaned until 7PM each night when we left for dinner. They respected our DO NOT DISTURB electronic sign and never once did they knock or call trying to get us to have the room cleaned. Never once did we hear noise in the hall way, including never hearing any knocks on someone else's door, etc. There were many subtle and not so subtle high tech things throughout the room... each were very impressive and useful. During the room clean, if you had a cable wire plugged in (like a phone charger) they would even ROLL IT UP NICELY as if it was BRAND NEW. Each night during turn down service they also set your slippers on each side of the bed and placed them on a cloth mat. The bathrobes were long enough for a change, very clean, and very comfortable. The towels were extremely white, plush, and perfect in every way. There was a scale, hair blower, and plenty of high quality soap/shampoo. The service was incredible in every way. If you ask someone where something is, they TAKE YOU THERE. We requested a 2PM check out time and that was not a problem at all. The SPA was very clean and the people who work there are very respectful and helpful in every way. The GYM was constantly being cleaned, even though it was already clean. They offered water and fruit, cold towels, stretching room, modern equipment, yoga paraphernalia, etc. I believe there was a pool, but I did not use it. I will separately review their restaurant and catering food separately... but I will say here that they were all 5 star. I cannot wait to go back and I was unhappy to leave. Lastly, the concierge was dead on with everything they assisted with. This is a DOG FRIENDLY hotel and you will see some of the cutest dogs walking through the lobby... often being walked by a member of the hotel staff, dressed as a bell boy, with white gloves, taking the pooch our for a walk. Very impressive, cube, and RICH!", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Glenview, Illinois", "Title": "“Favorite spot in Chicago”", "Author": "creardon", "ReviewID": "UR115667917", "Content": "You feel welcomed the minute you enter the hotel. The staff is friendly, helpful, and professional. Great rooms that you don't want to leave. Spa is great with top notch staff. Always my favorite stay in the city.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“Outstanding service, room and location”", "Author": "fredalynn", "ReviewID": "UR115619120", "Content": "This is one of the finest hotels my wife and I have stayed at during our many years of worldwide travel. The service is impeccable. Highly attentive but not intrusive. Great attention is paid to the most minute details. You don't need to ask for turndown service. What a relief! The concierge desk is knowledgeable and most accommodating. The rooms are are quiet. You are able to concentrate without interruption. This is a hotel run for individuals who are accustomed to a high level of service and know how to appreciate it.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "los Angeles", "Title": "“wonderful location”", "Author": "mstravelgoddess", "ReviewID": "UR115486325", "Content": "This was my first time to this city and what a pleasant surprise. Great location and wonderful staff. Nice rooms with modern amenities, beautiful dining room with a piano player but the concierge was what really made it. robert suggested that we take our daughter to the local aquarium and offered us tickets to it, told us hold onto them, if the line is too long use them to go to the front of the line, they were 10$ more per ticket but we did not need to purchase them now, only use them if we needed. Well when we got there not only was there a line but the wait was three hours long! Thank god for Robert because we used those tickets and went straight to the front of the line, had he not given them to us we would of never waited and would of missed out on one of the best aquariums in the world! This hotel is worth the five star rating.", "Date": "July 18, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Chicago, IL", "Title": "“Not a 5-star hotel.. rooms too noisy!”", "Author": "EuroAmerican773", "ReviewID": "UR115391515", "Content": "I just wanted to throw my own two cents in on all the claims about the Peninsula being a 5-star hotel.. We stayed there one night recently (at the same time Dave Mathews was a guest!) As many locals know, the Peninsula is only a couple of blocks away from Northwestern Memorial Hospital. Ambulances arrive there throughout the day & night. Even on a high floor, the street noise is very apparent in the guest rooms. In this aspect, the Peninsula is no better than any 2 or 3 star hotel. European 5-star hotels I've stayed at have two sets of windows in the guest rooms. Two hotels that come immediately to mind are the Hotel Paris (\"Pariz\") in Prague & the Berkeley in London. Our rooms in both these hotels had two sets of windows, with a wide air gap in between.. It really makes a difference! Fortunately, I always keep a pair of earplugs in my travel kit, so I was fine. But my friend was a bit annoyed by the constant wail of sirens & made a number of unfriendly remarks about \"the city\". If street noise isn't a concern, then I would agree that the Peninsula could be considered 5-star. Otherwise, it's 4-star at best. There really isn't any excuse for the hotel to skimp on proper soundproofing for their guests.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "NoVA", "Title": "“It's the best”", "Author": "numberonueve", "ReviewID": "UR115322780", "Content": "The hotel lives up to the \"its the best\" reputation. As a native Chicagoan - in town to visit the fam but had a one-night getaway to celebrate our anniversary - I know to appreciate luxury and location. We had a standard room, which was spacious, comfortable and had all the bells and whistles you would find in any 5 star hotel. The pool/hot tub were perfect. The gym was huge with many machines...but that was the one drawback, so many people also appreciated the fully stocked gym that no one paid mind of the people waiting for a treadmill. So I left and went for a walk along the lakeshore, which is just a couple blocks away. Don't forget to shop...you're right in the heart of the Magnificent Mile!", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bow, New Hampshire", "Title": "“Fantastic Hotel that keeps us coming back”", "Author": "dandkm88", "ReviewID": "UR115296081", "Content": "Attentive service, clean and well appointed rooms, fantastic restaurants in the heart of the city. We walked to Millennium Park, the Art Institute, many bars and restaurants, shopping, everywhere! So much more to do than we could possible fit into 3 days. We really could not ask for anything more. Yes, it can be a bit on the pricey side but discounts can be found and the feeling of being in another world is worth every penny.", "Date": "July 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Hamilton", "Title": "“Beautiful hotel and super central”", "Author": "Ivana88", "ReviewID": "UR115190231", "Content": "Lovely hotel. Excellent standard for 5 star status. Enjoyed it very much. Tiffany & co on corner along with all the main shopping areas", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Doesn't get any better than this!”", "Author": "diverbuds", "ReviewID": "UR115157322", "Content": "Most fabulous stay ever! Were treated like royalty. Booked though Whatahotel and because we got a complimentary upgrade to a suite with our package, we were entitled to a 3 hour mini cooper drive, including wherever we wanted to shop or see. Avenues restaurant fit for a foodie king! Sit at Chef's table if you can. All in all, best stay of my our lives!", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Sublime”", "Author": "DietBoost", "ReviewID": "UR115034304", "Content": "The perfect hotel experience. The room was impeccable, clean and thoughtfully set up - the TV/lighting/climate controls next to the bed was incredibly convenient and useful. Everyone - from check-in, the concierge to the valet - went out of their way to make our hotel experience absolutely perfect. There was a certain warmth to the staff and their efforts to make our stay a wonderful experience. By way of example, my wife was waiting for me near the front desk, when a woman sitting across from her coughed a couple of times. Immediately, the person at the front desk asked her if she needed some water. That's just one example of the incredible service at this hotel. That's in addition to the incredible lobby and the perfect rooms. I will absolutely stay here again!", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“The world's best bed and incidentially a great hotel”", "Author": "PFoggSydney", "ReviewID": "UR114896523", "Content": "Flawless. Excellent Service. Front desk and Concierge were utterly professional. The Chinese restaurant was as good as the best in China. The breakfasts were top notch. The Executive Suite was wonderfully comfortable for our week long stay. The suite came with 3 hours in the Pen mini, which was fun. An excellent swimming pool. But even given all that, the very best bit was the bed. It was the most comfortable bed in the world. I still dream about it. The location was perfect for shopping and sightseeing. Tip: Any tour by the Chicago Architecture Foundation will be worth it http://caf.architecture.org/", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Beyond outstanding service”", "Author": "Robengar", "ReviewID": "UR114814949", "Content": "We stayed here for a wedding during Memorial day weekend. The hotel's public areas are very beautiful and the rooms are spacious and comfortable. We would recommend the formal afternoon tea. The service at this hotel is second to none. Even the housekeeping staff went above and beyond anything we have ever experienced. This included hanging up and/or folding clothes that had been left in the changing area and even rolling up power cords that were left on the desk. The bathroom had a large soaking tub with a tv. The views of Lake Michigan and Michigan avenue are great. This is by far our favorite hotel in Chicago and we will definitely be staying here again.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Virginia", "Title": "“Truly 5 Star”", "Author": "acagreene", "ReviewID": "UR114774929", "Content": "The Peninsula is absolutely gorgeous and the service is impeccable. They truly go out of their way to make you happy. The room was gorgeous and quite spacious and I could have stayed in the oh-so-comfy bed for days. Soft sheets and down covers..... wow. The bathroom was massive and had everything you could need. The attention to detail by the housekeeping folks was truly impressive as well. Every time we came back to the room, everything was put away \"just so.\" The hotel itself is located in a prime location. Right across from our window was Neiman Marcus and I was able to walk to various landmarks each day. Chicago is a great city and, if you can afford it, the Peninsula is the place to stay!", "Date": "June 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Hampshire", "Title": "“Best conference hotel”", "Author": "Preposterous", "ReviewID": "UR114655500", "Content": "100 plus delegates were effortlessly handled for three days. Service discrete and accommodating at a surprisingly competitive price. Organised similar meetings in several cities - this was special. Rooms excellent.", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Peoria, Illinois", "Title": "“Top Notch all the way!”", "Author": "owehay2", "ReviewID": "UR114620419", "Content": "Everything in this hotel is exquisite. I would stay here every visit to Chicago...if I could afford it. We got a great corporate rate during our stay and I continue to look for deals on this hotel to go back again. You can't beat the location and the details put into the rooms are just top notch. I met 3 celebrities during my stay...great for sighting VIP's of the world. Plus the spa is to die for! If you go in the summer...plan a day just to lay out outside on the spa deck. BEAUTIFUL views! Only negative, our check in process was unnecessarily long and the check in staff was snooty. EVERYthing else was so superb that we quickly forgot our checkin experience.", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Downunder", "Title": "“Good City Hotel”", "Author": "SpiderBoy", "ReviewID": "UR114103979", "Content": "The Peninsula is well located in the main part of Chicago. Close to shops and restaurants. It's easy to get to all the main parts of Chicago CBD in less than 20 minutes. Positives: Room size; service (very efficient); location. FREE WIFI. Negatives: None except entrance to the hotel is a mystery of design. Why hide the reception up an elevator on another floor? A mystery but it does not impact on a great stay.", "Date": "June 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Toronto", "Title": "“Nothing else to say except that the Peninsula was perfection”", "Author": "hotski7", "ReviewID": "UR114003237", "Content": "From the moment we arrived, at 10:00am on Friday, and were greeted warmly by Klara, to the time we left on Sunday, we marveled at the opulence of the hotel. The rooms were beautiful and large, the location perfect, and the overall attention to detail unmatched... The hotel was worth every penny. After checking out we enjoyed a wonderful brunch in the main restaurant, and that too was worth the $75 price tag. We will be back!", "Date": "June 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "NYC, NY", "Title": "“Beautiful hotel with top-notch service”", "Author": "NYLady4", "ReviewID": "UR113090087", "Content": "It is no surprise that the Peninsula Chicago systemically gets annual acclaim -- it is a beautiful, service-oriented hotel in the heart of Chicago. While there are some little things that can use updating (i.e. the TVs affixed to the bathtub are old), there really is nothing to complain about with this hotel. The gym is one of the nicest hotel gyms I have ever seen (and I have seen a lot), and the lap pool is fantastic with a great view. While in town I did have an opportunity to check out the new(er) Trump hotel a few blocks away where a friend was staying -- also gorgeous, so probably worthwhile doing a price compare before booking.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Loved 99.99 percent!”", "Author": "psconcierge", "ReviewID": "UR112946995", "Content": "We had to attend a party at the Peninsula, so decied to stay overnight. Had a roomy wonderful deluxe suite facing East to Michigan Ave and the lake, North up Michigan Ave and the Lake and south down Michigan Ave. Check in was great, informative and friendly. Brought up to room and mentioned we needed a few things (pants pressed, shoes shined,) and that was taken care of immediately. While my friend went to the spa, I just relaxed in the room. Went to get a cup of espresso from the in room Nespresso machine, but could not get it to work. Called someone who verifyed I was doing it all correctly. Turns out it was unplugged. I could not move the large desk/mini bar, so it was taken care of while we were out. The party was wonderful, the room beautiful the food fantastic (drinks too!) Wonderful sleep. Next morning had breakfast in the lobby restaurant. We both ordered Eggs Benedict. My friend doesn't eat potatoes, so aksed for none. But was not offered any options such as fruit, tomatoes anything. Should have been offered without asking. So except for the two small inconveniences, it was a great stay. I would recommend it wholdeheartedly!", "Date": "June 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gulph Mills, Pennsylvania", "Title": "“Amazing! Fell in love with the hotel”", "Author": "philatravelgirl_11", "ReviewID": "UR110447329", "Content": "My first visit to Chicago and I managed a great internet package on the Peninsula website. The hotel is well situated to shopping and attractions - the Art Institute, Grant Park, River tours, Navy Pier are all within 15-20 mins walking. The staff in the hotel is the best! The Concierge team is outstanding - no other team can compare in my travels thus far. Prior to my visit, they sent me a listing of all recommended restaurants in the area at all price ranges including a diner and Whole Foods On site, they made reservations, confirmed by in room fax and provided their mobile numbers in case I needed them while I was out exploring the city. The hotel offers free wi-fi in the room which always had a strong signal. Free access to the gym and classes - the class instructors were wonderful. I managed two classes during my stay which were hard workouts and usually had about five students in a private room with a view of the city. The Pierre Gourmet on the ground floor served a good breakfast, amazing pastries and chocolates to bring home to the family. I ordered a room service burger and it was one of the best ever! The room was a good size/layout. I loved the controls next to the bed and the outside temp readout by the door. The housekeeping staff - Wow! I had my various chargers on the desk, I came back and they were all organized with rubber bands around the wires. I had clothes on top of my suitcase and came back to find they were folded and inside the suitcase. So many little touches that were unexpected but appreciated This is a hotel I didn't want to leave but alas i did need to see the city of Chicago. There is so much I didn't get to do or use in my 3 day stay but there is always next time....", "Date": "May 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“One of the best near the Mag Mile”", "Author": "dadofgirliegirls", "ReviewID": "UR110413934", "Content": "I don't typically stay in $600/night hotels, but they have an American Girl package that gives you gifts for the kids' dolls, custom embroidered pillowcases and very nice dessert package. My girls absolutely loved it and the fact that the American Girl store is 2 blocks away was a dream. The hotel is in a great location and the service is awesome. The only drawback is the price, but then again, this is a full service, luxury, family friendly hotel - so you do get what you pay for.", "Date": "May 29, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "bedford", "Title": "“Luxury in every sense of the word”", "Author": "june576", "ReviewID": "UR107904933", "Content": "We stayed at the Peninsula in April for a week to celebrate a Wedding Anniversary. We were expecting something special But I have to say that our expectations were exceeded by some way. The hotel is beautiful and the staff excellent. Nothing was too much trouble for them and the hotel room was just wonderful with every facility that you could want. The spa and pool were also fabulous - we had great difficulty in persuading our 5 year old son to get out of the pool each day. Food in the restaurants was also very good and the location of the hotel would be hard to beat in Chicago as it is located just off the Magnificent Mile in the hub of everything. Although it is expensive - you only get what you pay for. Highly recommended!", "Date": "May 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "new jersey", "Title": "“Outstanding experience,highly recommended”", "Author": "welltraveled77", "ReviewID": "UR106272165", "Content": "The location is perfect for shopping and restaurants. The service was outstanding. Employees were always willing to help without being \"in your face\". The concierge Todd is the best anywhere. Nothing negative to say.", "Date": "April 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“Discerning accommodation with Eastern flair straight on NoMi”", "Author": "Priv_Dis_Lux", "ReviewID": "UR103400493", "Content": "Got in Chicago and had a Grand Room at this perfectly located Hotel. Usual attentiveness in the service and friendliness of the staff and particularly of the Japanese receptionist escorting me to the accommodation.Extremely pleasant room on the 12 floor up to the high standards of this chain. Dressing area, marble bathroom with separate bathtub and shower with wine scented toiletries. Welcome fruit platter was really appreciated. King bed of outstanding comfort due to its quality (Simmons ). Outstanding common areas and interesting SPA at the top floor. Regarding bfast I dislike non buffet offerings and I will not provide my review on this.", "Date": "April 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Carmel, Indiana", "Title": "“Great Hotel-Great Rooms-Great Location-Ok Service”", "Author": "Jobo59", "ReviewID": "UR101278667", "Content": "We have stayed at the Penninsula in Hong Kong which in my book is what all Hotels in this 5 star category should be measured against in all aspects so we were excited to give this Hotel a shot in Chicago. We came away overall with a great stay and were not disappointed. There were however some shortcomings that we felt did not put them at the 5 star level (more like 4.5) since 5 star really means near or at perfection. For example, we had a waiter for tea in the lobby (Reuben) that did not know how to smile and was slow; we had the same experience on two different occasions in the venue area where the service was slow to realize you were seated and slow to accomodate. Food was great though. Spa service and facilities were also excellent (we stayed at hotel for 5 days so we really experienced a lot). Housekeeping also fell a little short. For example, we had a suite with a hide-a-bed that our daughter slept on and on second night turn-down service failed to show up so we had to pull the hide-a-bed out ourselves which had no sheets so we had to call for them to come make up the bed (why they stripped it from the night before I have no idea). Again, not a huge huge deal, but something a five star should not miss. Certainly would stay again, but at their rates I might also give Trump a try or Four Seasons.", "Date": "March 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Beverly Hills, California", "Title": "“THe best hotel in Chicago”", "Author": "HelloHorsey27", "ReviewID": "UR98600508", "Content": "While some people may turn their noses up because they have been better places, I thought the Peninsula was WONDERFUL! The service was incredible, the people were kind, the views were spectacular, and the location was superb. The beds were comfortable, and we appreciated the complimentary food in our room at the end of each long (and awesome) day. This hotel was absolutely wonderful, down to the smallest detail. The breakfasts were the meals of a lifetime, and I would go back in a heartbeat.", "Date": "March 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“the difference between one five-star and another is the details...”", "Author": "andergtr", "ReviewID": "UR98529684", "Content": "and the peninsula proves to me why it is considered one of the best hotels in the country, and certainly the best in chicago. i usually stay at the trump, and that is a wonderful hotel that i love and would stay at again, but the peninsula's staff and their attention to detail is in a different class. several other travelers already mentioned the control center device on the nightstand, but it really makes sense. little things, like the staff communicating via your personal fax machine and having a small light illuminate on the control center when there was a message on the fax, were what made the difference. you got the feeling that the they were always available, but never intrusive. other things, like asking them to send up silverware and napkins when i brought back takeout from a restaurant, or ordering pizza and having the staff deliver it to my room, were indicative of a place that valued not only the privacy but the security of its guests. niggles? ok, the room isn't as spacious and modern as the trump. and the toiletries aren't as nice, either. but if you've stayed in enough five-star places, you know that you can get the same level of room decor and size at a hilton, but you don't get the same quality of sheets or attention to detail in housekeeping. a female friend came to visit, and i gave her a set of the slippers they use for turndown. the next day, another set came. when i decided to use the cloth laundry bag for my dirty clothes, another one was placed in the same place as the old one. to see if this was a fluke, i took the next set and hid them in a drawer. they replaced them again. at other places i've stayed, you get one set, and that's it. it's little things like that that show that housekeeping is paying attention to the little things. clothes, for example, were always neatly folded if they were sitting out. shoes were placed back in the closet. the indoor lap pool and the whirlpool were wonderful, and i would recommend bringing a swimsuit to take advantage of this. other things? free internet access, which is huge because if you're like me, you travel with a work laptop and an ipad. if you have to pay for internet access, you end up paying twice if you want wi-fi. for this level of hotel, internet should be included. also, every room has a personal fax machine and number, so you can send and receive faxes. the machine doubles as a copier, as well, which is helpful when you need to scan something fast. you can also smoke in the room (assuming it's a smoking room), unlike the trump. again, that's a huge thing for me when you want to unwind after a long business day and have a nice cohiba. absolutely the best stay i've had in chicago. i am back in a few weeks for leisure, and i'll be back at the peninsula.", "Date": "March 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City", "Title": "“Superlative Service”", "Author": "nhdb", "ReviewID": "UR96250509", "Content": "It is easy for a five-star hotel to be a pleasure to stay at when all goes smoothly - the real test is when everything goes wrong. I traveled to Chicago on what was supposed to be an overnight business trip that turned into a six-night stay due to a sudden client emergency. I had only brought one change of clothes with me and, as it turned out, the hotel was fully booked for the days after my first night's stay - all at a time when I was working around the clock due to the client emergency. The hotel staff rose magnificently to the occasion - my clothes were cleaned and neatly pressed for me every morning, and hung with care in my closet. In addition, depite the hotel being fully booked, they assured me they would find a place and within an hour called me to let me know that they had found another room for me and would move my things. All in all, the staff made a seamless pleasure out of what was a very stressful week in my professional life.", "Date": "February 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "atlanta", "Title": "“it doesn't get any better than this hotel”", "Author": "hsg130", "ReviewID": "UR95207346", "Content": "my wife and i were scheduled to go to new york the week of january 24. as we were boarding the plane, all flights into la guardia were cancelled due to the weather. we're from atlanta and were packed for really cold weather so we decided to go to chicago. air tran could not have been more accomodating; they charged us nothing extra to change flights and put us in first class to boot. we have stayed in some very elegant hotels but had never stayed in a peninsual property. the hotel was running a third night free package; we booked through our amex platinum card, which includes a one room upgrade; we were upgraded to an executive corner suite; i think it was 750 sq feet.; it worked out to approximately $375 per night. the room was magnificent; the service in the hotel was extraordinary; the hotel is immaculate; the location is perfect. the suite also came with a complimentary car and driver for 3 hours to drive us where we wanted to go and to wait for us; how incredible is that? ask for robert in concierge; top notch person to deal with. if your plans include going to chicago, do not miss the opportunity to stay in this hotel. you will not regret it.", "Date": "February 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "nyc", "Title": "“Profoundly Good”", "Author": "Dangank", "ReviewID": "UR92695433", "Content": "The Penninsula is quickly challenging if not surpassing both The Four Seasons and The Ritz Carlton for a few very important reasons: 1. Staff attends to guests in an old-school manner that is both gracious and intelligent. 2. Rooms are large, beautiful, comfortable, and surprising... 3. Surprises: many small details both in the rooms and elsewhere amount to a feeling of happiness and ease-of-living. For example, the way the flat screen TV swivels to face the bed; the lighting in the spa; the palm trees in the lobby. I can't imagine a better urban luxury hotel.", "Date": "January 12, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "phoenix, az", "Title": "“5 star in every way”", "Author": "MichelinFoodie", "ReviewID": "UR92430918", "Content": "I've stayed here 4 times over the past 2 years, every stay has been perfect. Best location right off Michigan Ave close to all the shopping and dining, very large rooms for the city, and service is always exceptional. Much better than the Four Seasons Chicago where I stayed on one occasion and later regretted. Afternoon tea is fantastic. Used the fitness center (free) which was one of the best I've seen in any hotel. Can't think of anything they could do better, they nail all the small details.", "Date": "January 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Worth Every Penny”", "Author": "prpro70", "ReviewID": "UR90743384", "Content": "I held a corporate meeting at the hotel for 30 and had the pleasure of staying the night. The hotel staff was amazing (Kenneth the concierge rocked and the ELV technician LENT his personal flash drive to me for 24 hours when my work flash drive died!). The rooms were gorgeous -- traditional contemporary and the bathrooms were the stuff of my HGTV fantasies. Loved the oversized tub and the TV facing it. The room was a nice size (not overly spacious but decent), the bed linens were so soft and comfortable. I came back after hosting a dinner for 35 outside of the hotel and experienced fantastic service in the hotel bar. Even received a \"on-the-house\" champagne refill when I said I was going back to soak in my tub. Not sure if it was the champagne, the tub or the great bed but it was the best night's sleep I had in a long time. Thank you Peninsula. I will be back this summer when I plan my next in town \"stay-cation\".", "Date": "December 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "All Over", "Title": "“OUR FAMILY FAVORITE”", "Author": "WorldTravelSnob", "ReviewID": "UR89089705", "Content": "The Peninsula Chicago is one of our favorite's when we visit Chicago. The adults love it, the pamper the children and make them feel so special so it's certainly great for kids and it's close to the Mag Mile where we love to shop. It's a luxury hotel with a luxury price but after being out all day in the heat or cold, I just wanna head to my spacious accommodations, take a nice hot bath/shower and crawl into a comfortable bed with soft, high thread count linen with everything I want or need just a phone call away. The gym and pool are fantastic and if you REALLY want to treat yourself, then go to the SPA! When you check out it'll put a dent in your pocket, but also leave a big smile on your face.", "Date": "December 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Francisco", "Title": "“The Best Hotel in Chicago”", "Author": "Professor44", "ReviewID": "UR87950809", "Content": "With large, quiet, well-designed, refurbished rooms and excellent service, this hotel is better than others I have stayed in including the Four Seasons, Intercontinental, Hilton, and Hyatt. My room on the 18th floor had a hallway that led to an alcove with closet and storage area (for luggage) on the right and off that was the bathroom complete with separate shower. The bedroom was large and well-equipped. Service was impeccable, as was the decor. Just excellent in every respect.", "Date": "November 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "WI", "Title": "“Elegant hotel with fantastic service”", "Author": "helloashley", "ReviewID": "UR84790133", "Content": "I stayed at the Peninsula Chicago for two nights for a work conference. The hotel is beautiful and has many thoughtful amenities for guests. The rooms are spacious and comfortable, with free Internet (too many 4 star hotels neglect to offer this) The beds were very comfortable, although I personally advise asking housekeeping for additional linens because the bed has only a comforter on it and nothing else, so if you want a lighter sheet or blanket, it's not in the room. For sending messages to your room (about housekeeping, etc) they send a message to the fax machine in your room. The thermostat for this room is a little odd. It's located next to the phone next to your bed! The bathroom has a separate area for the toilet, a shower stall, and a bath. The bath was great, with a separate showerhead for washing off, it was large to comfortably lie down in, and it faces towards a TV. Service is impeccable, whether it's with housekeeping, restaurant staff, or concierge. My only complaint with this hotel is that the catered food for our business meeting was not as good as it could have been. For example, our group was only offered coffee, tea, or water during our meeting, no selection of soft drinks or juices. The breakfast selection was small (eggs, toast, bread, croissants only). And the reception dinner could not be classified as a dinner (it was casual, h'orderves style, but pasta & bread only is NOT dinner! plus two drink tickets, and they took your drink ticket when you got a soft drink or a water) Overall, it was a beautiful hotel and I enjoyed staying there, but I think there is room for improvement when it comes to the food offered for meetings.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Philadelphia and Seattle", "Title": "“Perfect indulgence with my granddaughter”", "Author": "n_bi-coastal", "ReviewID": "UR82633758", "Content": "Took my 8-yr-old granddaughter for a 4 day adventure in Chicago. Informed the Peninsula that it was her birthday, and they treated her like the Princess she'd like to imagine....They sent a large platter of happy birthday sweets/famous popcorn/cards/truffles...In addition, shortly after we arrived, housekeeper appeared with a terry robe and slippers in my granddaughter's size. The Concierge remembered her name and called out to her everytime we passed. Housekeeping also artfully arranged the stuffed animal that had accompanied us on different pillows twice a day...very cute..The Peninsula package included breakfast for two either in the room or in the restaurant. Once she discovered the flat screen tv in front of the bathtub, I never thought I'd get her out of the hotel. It was a perfect hotel for creating memories.", "Date": "October 8, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Salt Lake City", "Title": "“Absolutely Perfect!”", "Author": "abbey_315", "ReviewID": "UR82050154", "Content": "We stayed at the Peninsula for 3 nights with our 5 month old baby and the hotel, staff, everything was wonderful! The hotel is beautiful, and in a great location. The lobby restaurant food was fantastic, we ate lunch and breakfasts there and thoroughly enjoyed the leisurely experience of it. Every detail of this hotel is amazing! We LOVED it!", "Date": "October 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wilmington, North Carolina", "Title": "“Excellent”", "Author": "verdegallardo", "ReviewID": "UR80776459", "Content": "This is what other hotels should strive for. Lobby, and hotel in general is beautiful and staff is very nice and polite without being pretentious. I stayed here with my wife for our anniversary and they upgraded my room for free, and also had complimentary chocolate covered strawberries and red wine waiting in the room. The chocolate bar was very enjoyable, but man I wanted to kick myself after it thinking of all the calories I just ate! My only complaint is the cost. A rather small room (especially for the price) plus the chocolate bar for two ended up almost a grand for a one night stay. Plus valet parking is $50.", "Date": "September 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "LONDON, UK", "Title": "“First Class”", "Author": "LENGLAND12", "ReviewID": "UR77159743", "Content": "Traveled with my wife and had a great experience. Even though the room rates will kill your wallet, the overall experience is absolutely wonderful; you really are getting what you paid for. I decided to go for the cheaper rooms, a double suite. Even though it was one of the cheaper rooms, it was still luxurious. The bed was soft, with numerous pillows, down blankets and sheets. Amenities such as a universal remote control, responsible for the radio, television, phone, alarm clock, etc. was at my disposal. The bathroom was awesome. Bathing while watching ESPN was particularly fun. Plush towels and good quality toiletries (instead of the generic hotel conditioners, toothpaste, etc.) were a definite plus. Room service was prompt and courteous.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bloomington", "Title": "“Great hotel and a great location!”", "Author": "ckgosch", "ReviewID": "UR74512872", "Content": "Like all the Peninsula Hotels, this is a beautiful property with an outstanding staff. The location makes for a great spot for either business or leisure travel.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rockville, MD", "Title": "“Wonderful Hotel with great service”", "Author": "lucinjo", "ReviewID": "UR74446741", "Content": "We were in Chicago to catch up with family and friends, unfortunately we chose Lollapalooza weekend so the city and hotel were packed with people. The Penisula did a fabulous job, from the first minute we arrived. From the fast check-in to the beautifully designed room (we especially liked the wall mounted reading lights over the bed and the TV which could adjust more than 90 degrees, so you could watch from the bed or the sofa) to the great facilities it was a great time. The manager sent truffles to our room. Our rate included $100 to be used for incidentals. We met friends both in the bar and on the terrace for drinks, service was outstanding. For breakfast, we skipped the lobby restaurant and went to street level to Pierrot Gourmet for a wonderful outdoor meal. The concierge was extremely helpful with making dinner reservations on the spur of the moment. Location was terrific just south of Water Tower and just off Michigan Avenue.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Madison, Wisconsin", "Title": "“Best Hotel on the Planet”", "Author": "Maralora", "ReviewID": "UR73526836", "Content": "We still talk about our great stay there and are still enjoying the fabulous products we purchased while visiting their Spa. This is not the place you go to save money or stay on a budget. It is expensive and worth every penny! I would rather save all year for 2 nights there then to go on a week's vacation somewhere that could never be as remarkable. The service we were given was beyond the meaning of customer service...we felt like Royalty. My daughter and I enjoyed our stay so much that we are planning to return again next year even if it's for one night or two. Fabulous time, fabulous service, and we felt like New Women when we left. This was a life changing experience. Highly recommended for women especially...girlfirends, mother and daughter, etc. You won't regret it. Also, recommend the spa pkg as even though it is more costly per night you get more than your money's worth for not doing it the ala carte way.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sherman Oaks, CA", "Title": "“A giant splurge but worth it.”", "Author": "KathySShermanOaks_CA", "ReviewID": "UR73125466", "Content": "Having never been to Chicago, we were wanted to make it an excellent experience, starting with the Peninsula. If you are able to save on airfare, use your extra $$ to stay here. Everything about it is outstanding-location, service, super clean and luxurious rooms. The only problem was the sirens going by at night. The dessert buffet in the lobby at night looked spectacular but we managed to control ourselves : ) Nothing about this hotel is inexpensive, so be prepared for a huge bill. The fitness center was outstanding as was the spa, but spa appointments need to be booked in advanced.", "Date": "July 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sunnyvale, California", "Title": "“Superb”", "Author": "skadudie", "ReviewID": "UR70205757", "Content": "In Chicago on business and stayed here for the first time. This is just a sensational hotel in every way. The service is spectacular and the hotel, well, matches the service. I did not have the opportunity to dine here, though I certainly would have liked to. Tremendous concierge program and a great location off Michigan Ave---just a great spot to be in this beautiful city by the lake. My room was super, clean to a tee, great bathroom, amenities, decor and views. Confortable bed? Of course. Excelllent. Expensive? Yes. How could it not be. Without doubt one of the very best hotels in the Unites States in my view. The kind of place you feel bad about leaving. A fantasy world in Chicago.", "Date": "July 8, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Curitiba, PR", "Title": "“Excellent”", "Author": "SandraSJ", "ReviewID": "UR69736483", "Content": "Very good hotel, good location, nice staff, good food.", "Date": "July 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "IOM", "Title": "“Good and bad”", "Author": "IOMGEOFF", "ReviewID": "UR69625017", "Content": "Great location, overlooking Michigan Ave but be prepared for street noise of hooking and sirens due to close proximity to many hospitals. Opulent hotel and well presented. Room: 1115 grand deluxe 2 queen beds, good size room and large bathroom with separate bath and shower and plentiful toiletries. Excellent maid service. On arrival we found the bath did not hold water, hair dryer did not work, shower head loose and electric socks loose on walls. But to be fair these matters were resolved within an hour of us contacting reception. We requested a room in a quiet position, and were given a room facing the staff floor entrance, which meant constant banging of door. Was disappointed that there was not drink making facilities in the room, considering the cost. We also found that the room was not well sound proofed. When our credit card was swiped on arrival, they put it on 'hold' so we were unable to use it in shops. Be aware and bring a second card. We also found it inconvenient that you had to take a lift from the ground floor which was excessively slow to the lobby/reception area. Compared to other hotels the number of floors are limited rooms up to the 18th floor only, next time we would try taller hotel more than likely Trump Towers due to its position and scale. Overall, found more bad points than good points.", "Date": "July 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "portland, oregon", "Title": "“The Best Hotel in America-redux”", "Author": "hotelfan", "ReviewID": "UR68607205", "Content": "This hotel is simply perfect. Its rooms and their amenities, the location, staff, service, fitness center, business center, roof top pool, room service, dining options and bar are all spectacular. They think of everything including the weight of the towels, the count of the sheets, the free and fast wi-fi, the free bottles of water, and every other indulgence one could ask for. This place is expensive but they do not nickel and dime you once you check in. This is I think my 5th visit and I'd sell my house and become a permanent resident if it were economically feasible. I stayed in a deluxe double with my 15 year old daughter which gave us a west facing view, 700 square feet, two beds, and an incredible bathroom with 2 vanities, a separate bathtub and shower, a TV at the foot of the tub-which is equipped so that you can talk on the phone while you watch TV and bathe. Everybody should do that once. We were taken under the wing of the superbly competent and extremely kind Lee Ann Brown, the director of guest services, who is wonderful and looked after us in every way. The hotel is great for a walk on the Magnificent Mile as it fronts it. We explored Michigan Ave., Millenium Park, The Chicago River Architectural Tour, and The Art Institute, all easy walks from the hotel. We had the fantastic prix fixed buffet lunch and thought it was delicious and a remarkable value. After visiting us several times during our stay, my oldest friend who resides in Lake Forest has decided to check in to his own room when we inevitably, and I hope really soon, return to The Pen. I simply cannot recommend any property-anywhere-higher than The Peninsula Chicago.", "Date": "June 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "raleigh", "Title": "“outstanding in every way!”", "Author": "redwing1", "ReviewID": "UR67596935", "Content": "great property. perfect location on mag mile. close to everything, walked everywhere. service excellent--all employees go out of there way to talk to you. decor is beautiful, rooms very comfortable with all amenities. in addition to a box of welcome chocolates, they left popcorn, gummie bears and a huge cookie for my son the first night. as close to a perfect city hotel as you can get. would recommend it to everyone.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wilmington, Delaware", "Title": "“The Peninsula - simply the best!”", "Author": "evoLotlevarT", "ReviewID": "UR66537624", "Content": "Room 1627 over the Memorial Day weekend. I have stayed at the Ritz Carlton and the Four Seasons here in Chicago and they donâ€™t even come close to the Pen. This hotel and their staff are exceptional! The rooms are luxurious with large bathrooms featurein spererate tubs, shower and WC. There is a TV in front of the tub, a sitting area for the ladies and a lighting systems that took almost 3 days to figure out! They do not nickel & dime you on the extras like free internet which was fast and ample complimentary water bedside when turndown service was performed. The Spa is a bit small but quite nice along with a narrow lap pool, hot tub, and small sun deck on the 19th floor facing east with stunning views of Water Tower Place. The Bar is well stocked, but expensive. We ate only in the Lobby Lounge for a late lunch and everything was quite good. The public areas are terrific, on the modern side with dramatic staircases. Special thanks to Kenneth, our concierge who recommended a very good restaurant. We canâ€™t wait to return.", "Date": "June 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Beautiful Hotel”", "Author": "Newmoongirl", "ReviewID": "UR65196357", "Content": "Went a few years ago with work (I worked in Travel Ind), the staff cant do enough, the hotel is great and very luxurious! Central in Chicago, brilliant.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Shaker Heights, Ohio", "Title": "“Fantastic”", "Author": "jmk5", "ReviewID": "UR64849733", "Content": "I wish all hotels were as good as this one. The room was not large, but was large enough for one or two people. The detailing in the room was fantastic. The bed was extremely confortable--one of the best I ever been in. The television and entertainment system was top notch. There was good channel selection, a fantastic TV, a way to hitch all of your electronics up, DVD player, separate, TV, phone and radio in the tub. There was also a wonderful dressing area with seating, drawers and the closet outside the bathroom. Very well thought out and very tasefully done. The pool spa area was quite large for a Downtown Chicago hotel. There was an outdoor patio, indoor pool and hot tub, and steam room. Throughout the facility there were complentary water and tea. Robes and swimming togs were provided. I really enjoyed the use of these facilities. The food was fantastic. I was at the hotel for a conference, and the breakfasts, lunches and buffet dinner were of the highest quality. All of the food and drinks were fantastic. In \"The Bar\", I had a drink called the French 77. It was maticiculously made and delicious. The Chinese resturant made perfect tea. Not over extracted. I've never had tea made that perfectly in the United States. The service was excellent. The hotel provided a complimentary shoe shine. I called for that service. The lady said there would be someone there within 10 minutes. She was there in 2 minutes. I requested an ironing board to touch up my clothes from packing. The board was there in 2 minutes with an iron and complimentary spray starch delivered in a basket with an ironing towel. Bottled water with a glass was provided with the turndown service. I could go on, but the hotel had wonderful, thoughtful rooms, excellent service, beautiful facilities, and excellent food and drink. The best thing was that most of the added touches were complimentary. I wasn't charged for water, tea, spray starch, or other things in the facility. The Beverly Hilton (see my recent review of that hotel) could learn a lot from this place. I have not had service this good outside of Asia.", "Date": "May 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Big rooms”", "Author": "Kazm76", "ReviewID": "UR64445164", "Content": "Spent two nights at this hotel. We thought our hotel in New York was fantastic, we couldn't believe it when we got to our room at the Peninsula. The rooms were massive. You could live here they were that big. The rooms were well appointed, very modern, awesome bathroom. We only stayed two nights but could have stayed longer. It is also in a great location, very close to everything.", "Date": "May 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Racine, Wisconsin", "Title": "“Disappointing Return Trip”", "Author": "GlobalMogul", "ReviewID": "UR64247657", "Content": "My wife surprised me with a overnight-er to The Peninsula in Chicago, for my birthday the weekend of Mother's Day. We had recently been to the same property a month earlier and loved it. I have to say that the property is amazing but the service this time left much to be desired. My wife had planned that a couple trays of chocolates, fruit, and nuts be in the room upon arrival. We we arrived and checked in she had to call down and remind them that she ordered these items:strike one. She had also communicated with the staff to have a special cake prepared as a surprise for my birthday, a red velvet cake that was supposed to feed eight people. Upon our finishing dinner in the Asian restaurant in the hotel the brought out a smaller cake that said \"Happy Birthday Jason\"....my name is Jerry. So I kindly pointed out to them that there probably was a Jason expecting this cake since my name isn't Jason and the cake was wrong. They apologized and cam back with the correct cake which beautifully ready \"Happy Birthday Jeremy\". We laughed it off and ate the cake. Strike two. Upon finishing dinner the staff were to have placed the cake in a pastry cooler until our departure in the morning. Well....when we checked out they basically lost the cake. It took them about a half an hour to find it. Strike three. No all of there are not major blunders but when you take into consideration that we spent about $1000 for an overnight stay at this property it begs the question: Was it worth it?. I would say that in comparison to the Drake or The Hilton towers it was not. I would have preferred to stay at either of those properties or even the Wit for about $250 a night. The Peninsula need to focus a little better on execution if they want to maintain the reputation that they have earned over the years. I must say that I will not be staying there again soon. Jerry Bloom", "Date": "May 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Detroit", "Title": "“Elegant, and a (known) gem”", "Author": "Srcolb", "ReviewID": "UR60061632", "Content": "I stayed at this hotel, having been there many times before, and loved it. I was at the hotel for only 2 nights, having traveled to Chicago to see \"The Addams Family\" in previews, at the Oriental Theatre. I have but not one bad thing to say about this hotel. It's located in a superb area, the staff is beyond remarkable, the food, the rooms, the beds, the technologicaly-kept aspects were all in tact, and elegant, glamorous, and most of all enjoyable as always.", "Date": "April 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Great location”", "Author": "PalmBeach9", "ReviewID": "UR60052310", "Content": "Very nice hotel,excellent service, good food. Right off Michigan Ave. The rooms was very well appointed.", "Date": "March 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Lovely hotel”", "Author": "venice4504", "ReviewID": "UR58664882", "Content": "We stayed here on a business trip. The hotel is on the 6th floor, so you enter at the bellhop area, then have to take a ride in an elevator, then have to shlep down a marble hallway and turn left before you even see the check in desk. Other than that the hotel is very swanky. The rooms are large and well appointed. The bathrooms are lovely. The price to stay there is astronomical. If a business wasn't paying for it I don't see how the normal person could justify the $550/night cost. If we were being put up again in Chicago and it was at this hotel, I would be a happy camper.", "Date": "March 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“The perfect place”", "Author": "German_Party_of_Six", "ReviewID": "UR56990684", "Content": "This review will be short, because all I wanted is to let you know, that this place is flawless. The room was beautiful, the staff is friendly and competent, the hotel is most elegant and the gym is fully equipped and has a beautiful view over the city.", "Date": "February 24, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Salt Lake City", "Title": "“Pretty Impressive”", "Author": "PG32", "ReviewID": "UR56001783", "Content": "This is a grand old property. The location is perfect. The service excels. Matt Damon was rumored to be on the property while I was there. The Peninsula is a unique brand of luxury. It's an experience worth having at least once. Enjoy your stay.", "Date": "February 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, IL USA", "Title": "“5 Star and all that goes with it”", "Author": "J_Plus_L_4Ever", "ReviewID": "UR55055236", "Content": "Even though we live in Chicago, my wife and I rented a room for fun after a gala event in the hotel ballroom. Pretty much everything about the hotel is 5-star. All of the staff are extremely courteous. The place is quite upscale and perhaps a bit stuffy in my opinion, though it's fun if you want to enjoy the royal treatment. The location of the hotel is fantastic if you want to hang around downtown Chicago. It's just steps away from Michigan avenue with all of the shopping on the magnificent mile, the art galleries, Millennium park, etc. Like most locals we don't spend a lot non-work time downtown, but we had fun and enjoyed our stay.", "Date": "February 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Beautiful hotel”", "Author": "Canadian-Beagle", "ReviewID": "UR51509954", "Content": "We spent two nights at the Peninsula. It was our first stay at a Peninsula hotel. The common areas are beautiful (substantially nicer than at the Four Seasons) and the rooms are spacious and very nice. The room size was very comfortable. The washroom was also beautiful with nice touches such as a tv next to the tub. The gym facilities were very good. We had room service one evening, and the food was excellent. It would be hard to find much to complain about with this hotel. If you do not find a special or discounted price, it is quite pricey. That being said, this is a very top notch hotel and I would have no reservations staying here again.", "Date": "December 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Greensboro, NC", "Title": "“Another incredible stay at the Peninsula”", "Author": "cobramax", "ReviewID": "UR50598446", "Content": "We arrived for our annual visit to Chicago the weekend after Thanksgiving and, as we have experienced each and every time we have stayed at the Peninsula in Chicago, everyone from the bellman to the receptionist to the maids were so attentive and kind that you felt special during every single interaction. The room and the service were flawless, the front desk personnel, the concierge, and the bellmen remembered our names, and went out of their way to help every time we approached. One of the very few hotels I have every visited that was worth every cent. The staff is first class and the facilities are as well!", "Date": "December 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Fabulous hotel and service”", "Author": "lgt565", "ReviewID": "UR46199230", "Content": "Wanted to stay downtown and the Peninsula was perfect. The room and view were fantastic. The service was impeccable. Every employee you passed genuinely greeted you. The management here clearly does a wonderful job. The only thing I would point out was that I emailed the concierge prior to my arrival for restaurant recommendations and noone ever responded back. Other than that the stay was absolutely amazing.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Round Rock, Texas", "Title": "“Great Room, amazing bathroom”", "Author": "MiaT", "ReviewID": "UR45676019", "Content": "LOVED the Peninsula. Excellent Location. Loved the bar downstairs. The rooms are large and have every amenity you can think of. I loved the bench outside the closet for throwing suitcases. My son loved the fact that he could watch cartoons while taking a bath. They even gave him a little Peninsula bear to take home dressed as a bell hop. Will return.", "Date": "October 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "los angeles", "Title": "“good chicago hotel at the right price”", "Author": "tripindicular1", "ReviewID": "UR40266617", "Content": "We normally stay at another competitor in Chicago. There was an unusually good special so we decided to try the Peninsula. We had a 1 BD suite. Views in this hotel are not as good as the FS where we we usually stay but we did have a nice view of Water Tower, and a little bit of the lake. Main bathroom is a little small, suite had low ceilings and the TV was outdated. Our mini-bar was not refilled during our stay once....no diet sodas after the first day. The restaurants were empty or having special events during our stay, so even though we were offered a discount we could not use it and try them. Hotel was nice enough to credit toward the stay. Concierges were very good at getting basic info, though they push the restaurant of a former chef that we thought was a poor suggestion. The bar is old school but really smells of smoke even though it is non-smoking. The pool/ spa is nice. The location is central Michigan Ave near the major dept. stores. I would return only if I found a great deal again.", "Date": "September 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Kabul, Afghanistan", "Title": "“Superb in every category”", "Author": "Entscheidungsproblem", "ReviewID": "UR39544514", "Content": "I stayed for four nights in an Executive Suite at The Peninsula while visiting friends from my college days. This was my second stay at The Peninsula and it won't be my last. In addition to the stunning service and facilities, I was able to get a very decent rate under one of their summer specials. My room was extremely spacious (see photos)--separate living room, entrance hallway, connecting hallway, etc. One of my favorite things about the Peninsula is the amount of room devoted to dressing--plenty of closet space, drawers, and mirrors. The sound-proofing was superb--windows open you could hear sirens and all the other sounds of the city, but once they were closed there was no sound from outside. One of the most attractive things about this room was the bathtub with a window overlooking Michigan Avenue--I took baths just to be able to look through the window! The technology is, if anything, over the top--I counted six telephones or equivalents (like the voice-operated one in the bathtub) in the suite, two televisions, a stereo system, and the Peninsula-standard electronic control systems (see photo)--on one morning when I slept in light and housekeeping knocked on the door (a long way from the bedroom) I just had to roll over and hit the \"Privacy\" button on the phone--a light turned on outside the room and that was it. No complaints at all about this trip, but I do have two suggestions, both from The Berkeley in London-- 1) The deck chairs on the sun roof outside often appeared occupied even though no-one was there--it would be worthwhile to clean these more frequently or to put up a sign asking people to clear away their belongings when they were done so that more people could enjoy the sun deck. 2) Shoes left overnight for polishing should be returned with temporary shoe trees.", "Date": "September 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Absolute Perfection....Didn't want to leave!!”", "Author": "krittert", "ReviewID": "UR39489797", "Content": "Hands down the nicest hotel I have ever stayed in. The hotel is in a great location, the room was gorgeous and the public areas of the hotel are beautiful. The service is stellar. The hotel staff knows what you need before you even know yourself, but they do it in a way that is not \"in your face\" and too much. We went to the Bears game and the whole time I just wanted to get back to the hotel to enjoy the roof-top bar overlooking Michigan Ave. We finally made it back and the bar was awesome (not to be missed), and the staff treated us to complimentary champagne for my birthday. The next day I had lunch w/ a friend at the restaurant in the lobby and I mentioned to her that we were there celebrating my birthday (I don't even recall the waitress being w/in ear shot) but the next thing you know there is a birthday dessert served at the table. The waitress overheard me say we were there for my birthday. I cannot say enough about the wonderful hotel. I stayed at the Trump a couple of months later and let me tell you that it PALES in comparison to the Peninsula. Not even in the same league. If you can afford it, stay at this hotel when in Chicago. The Peninsula has won a regular client. Will be staying at the Peninsula in NYC soon, hope I am not dissappointed!", "Date": "September 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Francisco, CA", "Title": "“A reason in itself to visit Chicago”", "Author": "SuitNflipflops", "ReviewID": "UR38063787", "Content": "Always perfect. Period. One of my favorite hotels in the world.", "Date": "August 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Germantown, Wisconsin", "Title": "“Off the charts good.”", "Author": "Brewer21", "ReviewID": "UR34646681", "Content": "This is a spectacular hotel. There isn't one thing I could complain about. The service, ammenities, location and room were all great. It is very expensive but you get what you pay for. Flat screen in the room, iPod dock, free wi-fi, the most comfortable bed I've ever slept on and one of the best showers I've ever had in a room. Everything is first class. I'm not sure I'd take kids here although there were some around. The pool is nice but mostly set up for lap swimming and there is a hot tub as well. Both are indoor.", "Date": "July 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "nyc", "Title": "“An enjoyable experience”", "Author": "2broadway", "ReviewID": "UR34203909", "Content": "I booked this trip at the last minute so naturally the rate was pretty high. I've read so many favorable comments about the Peninsula that I just had to check it out for myself. Needless to say, I was not disappointed. The service I received from the moment I stepped in front of the hotel (greeted warmly by valet) until the day I departed was memorable. I am hooked. While there I visited the pool area and felt so relaxed I fell asleep in no time. The iced lemon water and iced strawberry water was a nice touch. Breakfast in the lobby restaurant was nice as well. I also visited the bar and received great service. The servers were friendly and offered great suggestions on where to view the fireworks. Fridays & Saturdays the hotel provides live jazz in the lobby area where you can enjoy cocktails and meals. The lighting was perfect for the setting. I must say the thing that I like the most was the control box that is placed on the nightstand. You can control the TV, the lights and the alarm clock. No more looking for the remote. I must get one for my bedroom. One other thing that I found favorable was the fact that the hotel places your newspaper in a small handled bag which is hung on the door knob. No more bending down to retrieve the newspaper. The money was well spent. I can hardly wait to return.", "Date": "July 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Best Luxury in Chicago”", "Author": "RLA", "ReviewID": "UR33972184", "Content": "These comments are a year delayed; we stayed in Aug, 2008. Peninsula Chicago is by far the best luxury in Chicago -- perfect location, boutique-like stellar personal service, gorgeous spa, beautiful marble bathrooms in the rooms, traditional rooms with modern amenities and superb linens. Absolutely the best in five-star luxury in Chicago. NB: We viewed our friends' room at the Four Seasons Chicago and, while perfectly adequate for a hotel in general, for five-star, it seemed a bit stale and outdated; the common areas of the Four Seasons were unimpressive for \"five star\" -- if you're spending this kind of money, absolutely opt for the Peninsula vs. Four Seasons => no contest.", "Date": "July 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "West Palm Beach", "Title": "“Well Located”", "Author": "G8TR73", "ReviewID": "UR32392351", "Content": "Probably the best hotel in Chicago considering the location and quality of the property.", "Date": "June 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Best Weekend aside from our Honeymoon”", "Author": "henslcc", "ReviewID": "UR31853284", "Content": "I booked a Fri and Sat Night stay at the Peninsula for my wife and my 1st wedding Anniversary. To simply put it, the Peninsula exceeded our expectations of luxury, service, and relaxation. Check-in was fine, it is a nice touch for the front desk attendant to peronally escort you to your room, give you a brief tour, and inquire of any other needs. The Deluxe king we booked was very clean, spacious, and comfortable. The kingsize bed was very comfortable with plenty of pillows and soft comforter. The bathroom was very large, marble everything, the highlight is the tv/radio controls for use while in the bathtub. The deep soaking tub and seperate shower have excellent water pressure and space for two. On Saturday night we went to the lobby for the Jazz at the Pen. The jazz quartet was very good, able to read and play off of the crowd. The spa and finess center were top notch. The pool is very nice and sun filled, there is an outdoor sundeck, but it can get quite windy 20 floors up. Room service, housekeeping, and the front desk staff are very efficient and accomodating. Our weekend at the Peninsula Hotel was arguably the best we have ever had, aside from our honeymoon.", "Date": "June 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“What a town, what a hotel, what a meal...”", "Author": "UKtraveller9569", "ReviewID": "UR30515119", "Content": "Great 5 nights at The Peninsular where the service was supreme, the room great, the location perfect and the food delightful. Ate the mad 15 course tasting menu at Avenues - little bit too much food for our delicate UK stomachs though the locals seemed to fare better! Great room service food and excellent staff. Concierges were superb and really did know where to go and what was what in terms of tours, restaurants and places to visit... Spa worked a treat - great views and great massage - nothing too much trouble.", "Date": "May 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Redlands California", "Title": "“Excellent Business Hotel”", "Author": "enr12", "ReviewID": "UR29808458", "Content": "You come into the hotel and come up one floor to the main lobby to register. The rooms are large and very well decorated with mood lights even in the bath room. The shower was one of the best I've had and the hot water comes on right away, with excellent pressure. The health club is well situated in the top floor with and indoor pool. The bed was outstanding, with very comfortable down comforters. Meals are a little on the high side, but very well presented, but with small portions. Meals are served in a beautiful lobby and a delightful place to hold a business lunch. Service in the whole hotel was excellent and lived up to the reputation of the Peninsular. It is well located opposite Saks 5th Ave, and half a block from the main shopping street.", "Date": "May 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Florida", "Title": "“Fabulous Hotel - Absolutely Worldclass”", "Author": "FlyOneWorld", "ReviewID": "UR29187707", "Content": "My wife and I spent 3 wonderful days at the Pen Chicago. It was our anniversary so we received a double upgrade (one for Amex FH&R and one for the anniversary). We booked a junior suite so we ended up in a deluxe suite. The room was very fresh and new looking. The furniture was in excellent condition, electronics were of the highest standard (Ipod ports at TV's, memory card ports at TV's, the usual Peninsula bedside console, DVD players and a TV in the bathroom). Kudos for the free wireless! The bed was comfortable with soft sheets, the bathroom was large with a big shower plus a separate soaking tub and the sitting area was spacious. The soundproofing in our room was excellent and the blackout curtains made for a great sleeping environment. Service was top-notch. The bellmen were fast and friendly. The front desk staff accompanied us to our room and were exceedingly gracious. Housekeeping was thorough yet almost invisible. The concierge made good recommendations about dining and places to see. The hotel arranged airport transportation which was flawless. Dining: Shanghai Terrace is exceptional for high end Chinese, I cannot adequately praise this place. Be warned it is pricey but worth it. Room service is both prompt and quite good albeit very costly. Pierrot the French cafe is ok and a quick place to grab lunch or breakfast. The Bar is always crowded and if I had one complaint we had a sour waitress the one night we went down who shorted me on my scotch as I received the \"last shot\" in the bottle. That was not an excuse for a short drink. On our anniversary the hotel sent chocolate covered strawberries and a bottle of French Champagne which was unexpected and very nice. This hotel delivered a product and service at an exceptional level for the United States. As a very frequent traveler this hotel is among the best I have seen in a US city. Yes, it is very pricey but they deliver a top notch experience with great rooms and great service. The location cannot be beat either.", "Date": "May 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "new england", "Title": "“Quiet wonderful luxury”", "Author": "gams1000", "ReviewID": "UR27008173", "Content": "Everything about this hotel is lovely without being obnoxiously so (well, ok, sending up a bellhop in an all white sailor suit with white gloves to deliver a grimy fedex package was farily silly but I'll overlook that). Had the most relaxing two day hotel stay and I'll def stay here aging if only for the assurance that a pair of fresh padded slippers, a plush robe, and the best bath towels I've ever encountered will be waiting for me. (Also really like that they have a push button system that declares your room off limits to housekeeping until you push another button that asks for them to make up the room.)", "Date": "March 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Atlanta, Ga", "Title": "“Beautiful, but exorbitantly expensive”", "Author": "heathspeak", "ReviewID": "UR26208689", "Content": "I stayed at The Peninsula for three nights in August. The room was on the 15th floor, somewhat near the elevator, but wonderfully quiet and luxurious. The staff were exceedingly polite, but forgot to retrieve the room service cart, sometimes for hours. Having to take two elevators to get to my room was a bit of a hassle as well. The room service food, and the food in the Lobby, was not worth the money- don't eat in the hotel, go elsewhere. Extremely expensive- but if it's no object and you want a gorgeous, quiet and comfortable room, then go for it.", "Date": "March 15, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "NY", "Title": "“Completely Over-rated”", "Author": "PoLR", "ReviewID": "UR25910329", "Content": "This hotel is completely over-rated. The staff was mediocre, the rooms had an odd odor. I've stayed at much nicer, actual 5 star hotels. This was not one of them. Maybe it works for Chicago, but I'd rather stay at the Four Seasons, Ritz, or the Park Hyatt. Really, don't believe the hype.", "Date": "March 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Connecticut", "Title": "“Wonderful Family Trip”", "Author": "saint22", "ReviewID": "UR25837466", "Content": "Amid comments of, why are you going to Chicago in March?, I planned a short trip and booked a room at the Peninsula. My wife and I were accompanied by our two children . Our son is aged 5 and and our daughter is aged 18 months. We had never been to the Peninsula before, but its reputation convinced me to stay there. I arranged through the hotel to have a car to meet us at the airport upon our arrival. Inside the terminal a man was waiting for us holding a Peninsula Hotel sign. He greeted us and led us outside to the waiting car. Our car was a black Lincoln stretch limousine. My son loved the car and the driver whisked us away from the airport for a relaxing ride to the hotel. We pulled up to the hotel which is guarded by two very large oriental lion statues. We were greeted by a very friendly doorman named Timothy. He took my name and said our bags would be delivered to our room shortly. We proceeded inside the hotel and took the elevator to the lobby to check in. We were greeted warmly as we completed our check in. The Lobby Restaurant room was near the elevators and it is just as stunning in person as in all pictures I had seen of it. The friendly woman who checked us in led us to the elevator and took us to our room on the twelfth floor. We had booked a junior suite #1217 because we needed the space. The room was done in shades of yellow and gold. The truly great hotels always do the little things that set them apart and the Peninsula accomplished this brilliantly. On the cocktail table in front of the sofa in the living room was a paper model of a 1956 light blue Ford Thunderbird convertible. Inside the seating compartment was a linen napkin wrapped around two chocolate chip cookies. Next to the car was a martini glass filled with gummy bears. Next to the martini glass was a small teacup and saucer and a small silver spoon. Inside the teacup was orange gelatin. There was also a beautiful purple box of Vosges Haut-Chocolat exotic truffles on the desk. The room looked out onto N. Michigan Avenue and the large window made the view exceptional. The room was spacious and inviting. The next wonderful detail that the hotel accomplished still puts a smile on my face. In the closet were robes for us to wear while we relaxed. There were two adult robes and two robes for the children. The robes for the children had hoods and were sized so as to fit them each perfectly. We got some great photographs of the kids in those robes. The room was equipped with consoles by the bed that controlled all the environmental adjustments for the room. The bathroom was gorgeous and well-equipped. There was a television that could be viewed while bathing in the bathtub. The kids loved watching TV while taking their evening baths. Turn down service was completed every evening much to our satisfaction. We had lunch at the french bistro connected to the hotel. The food and service were both excellent. After our visit to the observation deck of the Sears Tower, we returned to the hotel and had dinner at the Lobby Restaurant. This restaurant is a gorgeous palatial space. The food was wonderful as was our server Don. I enjoyed a Peninsula Martini and my wife enjoyed her Blood Orange Martini. After dinner we retired to our room and I slept deeply on the very comfortable bed. The next morning, I watched the kids while my wife indulged in a swedish massage at the Spa. She said Donald did a great job. After that we all had breakfast in the the french bistro and headed out to see some of the culture of the city. We took the kids to the Science and Industry Museum, Millenium Park and the Art Institute of Chicago. The weather was cooperative with the temperature in the mid to upper 40's and mostly sunny. The Cloud Gate was fun to see in person. Upon our return to the hotel, my son and I enjoyed the pool and the hot tub before we went to dinner. What a scenic setting to swim laps. I loved it. I wanted to try Chicago style pizza on our last night so I phoned the Concierge and she recommended either Gino's East or Giordano's. Since we had the kids, we chose Giordano's because it was right across the street on North Rush Street. We ordered the stuffed pizza and it was incredibly good. I was raised on the thin crust pizza of New Haven, Connecticut but I got to tell you, the stuffed pizza here, while different ,was every bit as enjoyable as any pizza I have ever had. After dinner we retired to our room, bathed the kids and fell asleep. The next morning we had an early breakfast in the Lobby Restaurant. Again, the food and service were excellent. We returned to our room and collected our luggage and proceeded to check out. I used the express checkout method and we took the elevator to the ground level. Timothy the doorman saw us off and our limousine returned us to O'Hare for our trip home. What a fabulous stay at the Chicago Peninsula.", "Date": "March 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "milan", "Title": "“impeccable”", "Author": "trillo", "ReviewID": "UR23435074", "Content": "everything was great, food, room, service, concierge. i would definately recommend it.", "Date": "January 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Orlando, FL", "Title": "“Not my cup of tea.”", "Author": "courtney7888", "ReviewID": "UR23383185", "Content": "My family and I visited the Chicago for a few days after Christmas, and for the most part we enjoyed our stay at the Peninsula. Upon entering the hotel, you take an elevator to get to the lobby and then another elevator to get to your room. The elevators were quick, but give yourself a few extra minutes to get downstairs if ever in a hurry while staying there. Our room was on the 11th floor and had excellent views. My family of four shared two bedrooms which were separated by a parlor that had a desk, couches, TV, and a half bathroom. The bedrooms were average in size and dÃ©cor and generally underwhelming. The bathrooms however, were fabulous. There was a television above the bathtub, and ample space to get ready. The hotel supplied Molton Brown products as well as toothbrushes, razors, sewing and nail kits, etc. Beds were comfy, and free bottles of water piled up after turndown. My major qualm with our room was the technology. I was under the impression that everything would be very high tech and sleek and it just wasnâ€™t. The bulky control centers were confusing and outdated. And the plasma TV and DVD players I thought I was getting were clunky and old. I think its time for an upgrade. The service was mediocre at best. While everybody was polite, I felt as if the Peninsulaâ€™s employees were only greeting me because it was their job to do so, not because they cared about me. Several times I had to be the person who initiated the â€œhelloâ€� or â€œgood morning.â€� I donâ€™t expect to be waited on hand and foot, but the occasional feeling that the concierge or front desk or dining room servers were happy to see me would have been nice. In terms of hotel food, the room service was average. My family ordered some snacks one day and nothing was exceptional. Breakfast at Avenues was delicious, but nothing I couldnâ€™t get at any other fine hotel. I do not recommend tea. The tea was ok, but the food was horrible. I donâ€™t think I enjoyed a single thing, and there was plenty to choose from. The thing that I liked best about the hotel was its location. All of Chicagoâ€™s highlights, including the shops on Michigan Avenue and Navy Pier, are just a walk away. Thereâ€™s plenty to do, see, buy and eat, and no need for a taxi or rental car to get there. I absolutely love Chicago, and its hard to fault the Peninsula for making my time less fun filled, because it most certainly was. However, next time, Iâ€™ll opt to stay at the Drake or the W Lakeshore, where I can get a little more bang for my buckâ€”and a little personality.", "Date": "January 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mount Dora, Florida", "Title": "“loved the Peninsula”", "Author": "joelfranceusa", "ReviewID": "UR20927280", "Content": "Wonderful stay, pure luxury, excellent service, we will go back", "Date": "October 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Excellent hotel with great food”", "Author": "TravelCuties", "ReviewID": "UR20843295", "Content": "I stayed at the Peninsula Chicago for two nights in October 2008 while on business. Had a room on the 15th Floor with views of the Water Works. Everything about this property was wonderful. The lobby and conference areas were beautiful and put together really well to host a large event with multiple meetings. The quality and selection of food made attending meetings a real treat, and room service, salads and burgers at least, were great. Now for the room: it was huge! The bathroom had its own couch! Excellent desk and business set-up with extremely comfortable bed. I don't even think I used every piece of furniture in the room it was so big! Can't beat the location either - you're literally steps away from Michigan Avenue shopping and world famous pizza.", "Date": "October 13, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kuwait City, Kuwait", "Title": "“Close but no cigar at the Peninsula Chicago”", "Author": "cubswincubswin", "ReviewID": "UR19068765", "Content": "I stayed here for a week while in town visiting family and friends. I've stayed at 5 of the 8 Peninsula locations and although this is certainly one of the more luxurious properties they have, the service lags behind the other locations. Now by no means is the service \"bad;\" just not up to par with it's sister hotels. At the other Peninsula locations, I would consider the service (relative to other hotels, not just the Peninsula Chicago) above and beyond; over-the-top; and sublime. At the Peninsula Chicago, I would consider the service as above average. For instance, at other Peninsula locations, they welcome you with a welcome drink in the room and possibly a light snack. No such greeting at the Chicago Peninsula. At other Peninsula locations, when the Spa was booked, the receptionist offered to either call me if there were any cancellations and even recommended some local Spas - not at the Peninsula Chicago. The rooms are great, the location couldn't be better and the restaurants are top-notch. My friends that live in the neighborhood all love The Bar at the Peninsula as well as the Chocolate Bar they have every Friday and Saturday. It's a wonderful hotel... the service just isn't over-the-top as I've come to expect having stayed at most of their other properties. The hotel accommodations are important but not as much as customer service. At the 5-star level one expects a high level of customer service. The Peninsula Chicago's customer service is attentive at best, mildly impersonal at worst. The Park Hyatt next door isn't quite as luxurious (a little too contemporary for my taste) however their service was surprisingly helpful. If location and a high level of customer service is all you desire, you may want to look into the Park Hyatt Chicago; for shorter trips, I know I will.", "Date": "August 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "texas", "Title": "“Excellent”", "Author": "jj1972Texas", "ReviewID": "UR18818165", "Content": "Fabulous. We stayed with our two toddlers at the last minute for one night due to an airline mishap. Our son has severe food allergies and they were very accommodating of his needs. The service was excellent, the food was excellent, the rooms are delightful, and the bed is exceedingly comfortable. Expensive, but definitely an example of 'you get what you pay for.'", "Date": "August 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Palm Beach Gardens", "Title": "“Best Hotel Experience Ever!”", "Author": "Aflores02", "ReviewID": "UR18754922", "Content": "We had a great time staying at this hotel. From the concierge service to the Laundry service to management, everybody is just so kind and wonderful. Everything was perfectly timely and arranged in detailed to please the customers. The Hotel has an excelent Buffet that serves breakfast and lunch. What a variety of delicious food! Love it! We had a problem with our Limo service which had a miss-schedule out pick up time and the hotel manager called the company and had limo picked us up in 25 minutes. Just in time so we did not missed the fly back home. We would move to live at the Peninsula if we could afford it all year round!", "Date": "August 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "los angeles", "Title": "“Stay in Style”", "Author": "tvl20", "ReviewID": "UR18696095", "Content": "Stayed on a corporate rate for business. I was impressed with everything the hotel had to offer, especially the pool. The crowd was a little old for my tast - looked like a lot of bankers. I did enjoy watching the working girls pick up on them in the lobby bar.", "Date": "August 6, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“A very good choice”", "Author": "Sagittarius_7", "ReviewID": "UR17122522", "Content": "I wanted to stay in what I hoped was the best hotel in town and so my expectations were high.The Peninsula did not disappoint.My room was a kingsize deluxe and although it overlooked another building on a side street it was very quiet (unless you open the windows) and well appointed. The staff were all very helpful, efficient and courteous. The spa is very well designed with a nice indoor pool. The outdoor sundeck enabled some sunbathing and room service could be ordered there.The massages in the spa were good but the standard varied.I had three different therapists and one was considerably better than the other two.For 155 dollars for sixty minutes I would have liked more consistency. The location of the hotel is excellent...right by Michigan Avenue. I would recommend Peirrot Gourmet for breakfast which is quite casual. It is part of the hotel so you can charge to your bill but is accessed from the street by the hotel so is very close by but gives the feeling of being out of the hotel.", "Date": "June 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Great & Pricey Place to Stay in Chicago”", "Author": "beverlyblvd", "ReviewID": "UR17111187", "Content": "We stayed here for a long weekend in June, and had a great time. The accommodations are first class, the location is stellar, and the staff is top-notch. You get exactly what you pay for. Our room was very large, the beds were very comfy, and the location is right off of Michigan Ave., so everything we did was walking distance away. We even caught the train to Wrigley & the airport, so I think we only took one cab -- which was to the hotel.", "Date": "June 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, CA", "Title": "“Nice, but a little dated, and problems with the electrical systems”", "Author": "Court_SF", "ReviewID": "UR16880700", "Content": "I have heard great things about this hotel, so I was a little disappointed with conditions on my stay. We were in Room 1523, an executive suite. Here are the pros: Location is excellent--you can't beat it. Right off of Mag Mile. Service is excellent. Friendly staff, we got an upgrade when we checked in. Courteous prompt attention the whole time. When we checked in, we had a little fruit/nut plate waiting for us, and they brought us welcome green tea within 1/2 hour of check-in. That was a nice touch. Suite size was great. Laid out well, lots of room, and it had my favorite thing--a bathtub with a giant window above it. They gave us a late check out of 3pm, which was awesome. Here are the cons: The decor is a little dated and worn. The carpet in our room had what at first looked like a huge water stain running down the hall, upon closer inspection was a tread path from overuse. The very complicated lighting system did not work. There are panels all over the room to control lights and other systems, and they malfunctioned the whole time. Which meant that when we tried to go to sleep that night, we could NOT TURN THE LIGHTS OFF. We had to call maintenance. To their credit, they sent someone up right away to reset. However, the problem continued throughout the night with the lights going on and off as we were sleeping. Yeah, REALLY annoying. Luckily I had a couple cocktails (hey, it was Bluesfest), so I was able to go back to sleep each time. We told the staff when we were checking out about the problem. They were nice enough, and told us that they were in the middle of a \"green update\" (right, right) that was causing the problems. I just feel like for $700 a night, the lights should work in the room, no?", "Date": "June 12, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Chicago", "Title": "“A++ Hotel”", "Author": "droses", "ReviewID": "UR16783064", "Content": "The Peninsula is everything a 5 star hotel should be. The staff is professional, poised and very helpful. The rooms are well appointed, the counsel next to the bed is unique and fabulous. We finally found a hotel bed that's MORE comfortable than ours at home (not an easy task). The spa is beautiful. Although we didn't have treatments, we enjoyed the facilies (workout room, steam room, pool, hot tub, outdoor patio). The spa had very thoughtful touches throughout - e.g. swim diapers for kids, various flavored water and tea, plush towels - all terrific. Avenues (one of the three restaurants). Oh my. Fantastic food, unbelievably creative, delicious. The service was terrific. HOWEVER, the portions are pathetic. For $375 (for two), we should not leave hungry. The waitress explains that each course is 2-3 bites. So, the four course is 12 bites for $75. And, she was right. The 8 course is $115. One should not have to select the 15 course to fill their stomach. I understand that the new chef cut the portions which is a terrible mistake. I would go back in a heartbeat if the portions doubled. We have been to several other top Chicago restaurants (Tru, Trotters, Les Nomades, Everest, Moto), and we have never experienced anything like these miniscule portions. Overall, our experience at the Peninsula was wonderful and I would highly recommend this hotel.", "Date": "June 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "preston", "Title": "“What 5 Star Should Be”", "Author": "naaman60", "ReviewID": "UR16482744", "Content": "Everything aspect of our stay from start to finish was excellent. The hotel is immaculate, rooms are a nice size, well appointed and quiet. Staff are really helpful and the concierges I worked with were *real* concierges: they were happy to answer questions, make bookings and their advice on Chicago was very good. Front desk staff was helpful, honest and friendly. Gym is beautifully equipped with plenty of machines and an excellent class/stretching room, all with big windows. Pool is a full 25 meters with windows right down to the floor, a great place for a swim! Apples and coffee to go at the gym and pool were a very nice touch in the morning. I travel over 50% of the time and a hotel like this stands out for the comprehensive high quality of all services and facilities offered. I'll certainly stay here again when I'm in Chicago.", "Date": "May 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“The Absolute Standard”", "Author": "mannym99", "ReviewID": "UR16351934", "Content": "This hotel is the standard by which ALL hotels should be judged, not just Chicago, but anywhere. It is first-class in every way, from the doormen, to the bellhop, to the front desk staff, to the housekeeping. The location is perfect for downtown shopping and sightseeing. The rooms are gorgeous. The food was outstanding. I did not visit the spa but heard only great things. Obviously it is expensive, but this is the pinnacle of hotels.", "Date": "May 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando", "Title": "“Romance at the Peninsula”", "Author": "Tashatart", "ReviewID": "UR15430554", "Content": "Flawless! Nothing more can be said. Service was excellent, the food was awesome and the location is amazing! Situated atop Tiffany's on Michigan (does it get any better?!) its in the middle of everything. The staff is very helpful. Of course it all comes at a pretty penny, but the suite is worth it - with a plasma in the bathtub, press button EVERYTHING, floor to ceiling windows, its exquisite.", "Date": "April 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "midwest", "Title": "“Almost perfect”", "Author": "screen_nameMidwest", "ReviewID": "UR15373938", "Content": "I stayed one night on a business trip. The room was fine; the bathroom exceptional. I love the way a light comes on in the closet when you open the closet door. The staff was friendly and repeatedly offered to help. I have two relatively minor quibbles: I had to search the room for a water glass to brush my teeth. I finally found one in the bedroom with the water bottle. A slip up by the staff? Secondly, I like to have a cup of coffee in the morning without ordering it through room service. There was no coffee maker in the room. (I noted when checking out, though, that coffee urns and paper cups were in the lobby. )", "Date": "April 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Durham, North Carolina", "Title": "“I'd Give It Six Stars If I Could”", "Author": "adamunc", "ReviewID": "UR14713562", "Content": "This was one of the best hotel stays of my life, from start to finish--maybe THE best urban hotel experience. Every need was anticipated and there was a thoughtful touch at every turn. I spent Easter weekend in Chicago and stayed at both the Four Seasons and the Peninsula, and though the 4S was nice and thoroughly professional, it paled next to the Peninsula. My stay here was starting off well anyway, since I had gotten a special holiday rate of $295/night. That's practically unheard-of for this hotel. Despite the low rate, I was still upgraded to a premium-view room on check-in, with a direct view of the water tower and the Hancock Tower. The rooms are wonderfully plush, with closet and drawer space set in a vestibule outside the bathroom so that there's room for a full sofa even in the standard rooms. Bedding is tops, and though the color scheme is still primarily beige, there are nice colorful touches in the textiles. Of course you've probably read about all the high tech gizmos and how practically everything is controlled by a button [Except, oddly enough, the curtains, which are still pullcord-operated. That and the fact that the hotel really needs to upgrade to flat-screen TVs would be my only small quibbles.] The bathrooms are glorious, with deep soaking tubs, easy-to-operate fixtures with great temperature control, and the TV/radio operated from a tubside control. I was checked in by a professional, warm staffer who handed me confirmed restaurant reservations--even though I had booked them through OpenTable; there must be some sort of name cross-checking. I then got a personal tour of the room including its electronics. The Lobby is a huge, beautiful space with tall columns and an airy feel. It's Art Deco with Asian touches. Lunch service there was flawless; the menu is fairly standard for this sort of place, though they do have purple sweet-potato fries. I also went back for the weekend evening chocolate fantasy. At $33, it's a bit of indulgence since you can really only eat so much chocolate late at night without making yourself sick. However, it's a nifty signature offering and just the selection of offerings is fun; plus, they were all tasty. Just off the bright lobby is the bar, which is a totally different environment--dark and moody, with sofa seating as well as the bar itself. Again, attentive service and nice selection. I also had dinner at Shanghai Terrace where I was again pampered beyond belief and found the food delicious. I was there at opening, so had the place almost to myself for a while. It's not cheap, but $115 per person including appetizer, soup course [lobster, mmm], entree, dessert, two cocktails, and tip certainly isn't outrageous. The top-floor pool here is a nice amenity. Always plenty of seating, and the floor-to-ceiling views over the neighboring buildings certainly make it an unusual setting and experience. Just know that there are usually children there and with the hard surfaces, it's not a quiet and relaxing place. The spa certainly is, though. In short, if you can handle the cost for when you're staying, you can't do any better in Chicago. The hotel sits dead-center of the Miracle Mile, and the Chicago subway stop is about a 3-minute walk away. It's less than ten minutes to the theatre district door-to-door.", "Date": "April 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "1", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Newport Beach, Calif.", "Title": "“Good, not great...”", "Author": "AmoItalia", "ReviewID": "UR14577910", "Content": "We stayed for 2 nights last month in a deluxe double room. Overall, I'd have to rate the hotel as just ok, and not on the same level as the other Peninsula hotels we've visited. Our check in experience was inexcusable for a hotel of this reputation and star rating. A week before our arrival the hotel contacted me regarding our arrival time (1pm), number in our family, names, ages, etc... When we arrived the woman that checked us in was less than friendly (much less) and informed us that our room wasn't ready. She also asked how many people would be staying in the room, eventhough I clarified that before our arrival. I asked if it would be possible to pay for an upgraded room that was currently available, but she waved me off saying \"no, nothing's available\" and that she'll call my cell when the room is ready. (By the way, I knew for a fact that the hotel had a very low occupancy at the time and that rooms of all categories were indeed available.) She didn't bother to even estimate when the room would be ready, or direct us to a place to wait. We, myself and 2 children, then wandered the hotel looking for an open restaurant (it was 4 degrees outside and I didn't feel like bundling the kids back up and walking around). It was a Sunday and there was literally ONE place serving in the hotel, which was the lobby lounge. We asked the hosted to be seated at one of the empty tables, but she insisted that they were reserved and nothing would be available for half an hour. I then asked if there were ANYPLACE in the hotel where we could wait and the hostess rudely pointed to her left and said \"maybe over there\". After over an hour of waiting \"over there\", I finally gave up on being seated in the lobby and approached the front desk again. It was a different agent, this time a very friendly gentleman, and I asked the status of our room. He responded that our room was indeed, and had been, ready for some time and apologized that I had not be notified.... This wasted hour and a half was certainly not a huge deal, but also certainly not something that should have happened at The Peninsula. The room was fine, if a bit outdated, and clean. With the exception of the bathrooms, there was nothing exceptional about the space. The carpet was in need of replacement, and I'd cetainly hesitate to pay the rack rate of $600 a night! The majority of our stay was without incident, and I encountered many employees that were extremely curtious and helpful. However, I do believe that our next stay in Chicago will be at either the Ritz or Four Seasons.", "Date": "March 27, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Traverse City, MI", "Title": "“Still great, but needs an update”", "Author": "tmgeneral", "ReviewID": "UR14526059", "Content": "I have now stayed at the Peninsula Chicago 6 times since the year 2002. I stay here for many reasons, including location, exceptional service and spa/workout facilities. The staff is incredibily courteous. The bathrooms are spectacular with separate garden tubs and showers along with marble accents. The TV above the bathtub is the bomb! The workout area and swimming pool sits on the 20th floor overlooking Michigan avenue and is spectacular. While the Peninsula has never failed in the area of exceptional service, I now feel that this hotel is overdue for an upgrade. Considering the fact that the cheapest rooms run over $500/night there are some areas that need attention. First of all, the carpeting in the rooms is in dire need of replacing. I have stayed in 3 different levels of rooms over the past six years and they all seem to have the original carpeting. My latest stay was no different and the carpeting in the room had some stains and showed a lot of wear and tear. Secondly, they need to upgrade to flat screen televisions. The current TV\"s are housed in an armoire that is to the side of the bed and provides for awkward viewing. While the overall room decor is very nice, it is starting to look a little dated. While I will continue to stay at the Peninsula, I believe there may be other options in Chicago worth exploring at this price. Once the rooms are upgraded though, I think the Peninsula will again be the best place to stay downtown.", "Date": "March 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cambridge MA", "Title": "“23 hours of perfection”", "Author": "jg617", "ReviewID": "UR13476489", "Content": "Wow, best hotel I've ever stayed in, bar none. The service is of a caliber that is beyond words. All the reviews pretty much lay out all the details, so no need to repeat all of the wonderful amenities (okay, I will anyway -- molton brown bath products, TV in bathroom, oversized bathtub and separate oversized shower, temp controls, in-wall sound system, amazing bed to name a few). We were there for my 40th birthday and were upgraded to a nicer room (without us asking), and they sent up a bottle of champagne and strawberries w/ fresh whipped cream on the house. They also sent up an additional dessert plate with truffles and raspberries. Best night's sleep of my life on what must have been 2000-thread-count sheets and a perfect-weight duvet. The spa is unbelievable -- the nicest I've ever been to, and I've been to my share of spas. Unlimited supply of towels, sandals, cucumber water, amazing steam room, the best 90 minute massage I've ever had, everything was so clean and beautiful. Tiny snag at breakfast in the hotel restaurant -- we came down at 9:15 after having called down at 8 to ask about breakfast options, and we were met with 1/2 hour wait. But I simply told the concierge that we had to be somewhere at 11 (the massage) and that we needed to be seated now or I wouldn't be able to really eat breakfast without feeling nauseous during the massage and they figured out a way to seat us right away. Had a perfect breakfast, and we watched them as they set up the sunday brunch, and that looked just over the top amazing. I wasn't sorry to miss it though, since I had just had 2 of the most delicious cups of coffee ever, perfectly cooked eggs, and a bowl of really wonderful museli with cream and blackberries. We were granted a late checkout (2pm) with no trouble. I've just never met that level of service in my life. I could go on forever about this place. If I could ever afford it I would stay there every chance I get. Also--we ate at Shanghai Terrace for dinner -- appetizers were outstanding, entrees and dessert were just okay in comparison, but the atmosphere and service were 100% perfect, so I'd recommend it for sure.", "Date": "February 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "chicago, il", "Title": "“Perfection”", "Author": "lizrogatz", "ReviewID": "UR12097470", "Content": "My husband and I stayed here for 2 nights with our 3 daughters. The room was exceptional - loved the outdoor temperature reading right by the unit door, the wall controls for all the lighting next to the beds, the tv in the bathroom and the sound system. The beds were so cozy, the welcome amenities for the children were delightful and the furnishings in the room lovely. As someone who hates indoor pools, I found this indoor pool in a category all it's own. It was beautiful, the furniture comfy and the wall of windows overlooking Michigan Avenue was unbelievable. We spent hours there and I still didn't want to leave. My husband treated himself to a massage which he was very pleased with. We did eat in the Shanghai Terrace, which was not great with kids. I highly recommend this hotel. The service, decor and pool are impeccable. It is my favorite hotel ever....", "Date": "December 30, 2007"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new york city", "Title": "“Perfection”", "Author": "CPS200", "ReviewID": "UR12089286", "Content": "I stayed in a 1br executive suite. I think this hotel is slightly better than the Chicago Four Seasons. They are both very similar-new hotels located in an office tower. Great location and terrific service. I will come back.", "Date": "December 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Another World of Luxury!”", "Author": "blondarm", "ReviewID": "UR11094022", "Content": "My wife and I stayed here for my birthday and let me tell you, it truly is a different world of luxury. Upon check in we were upgraded to an Executive Suite (without asking) that had a living room, HUGE bathroom and a king sized bed overlooking the Water Tower. Also had some dried & fresh fruits as well as a box of Vosges Chocolate Truffles waiting in the room for us. Oh, the bathroom had a jacuzzi tub with a TV in the wall! While we didn't eat at the hotel (we went to Gibson's), we did grab some pastries & coffee from the French bistro on the 1st floor for breakfast that were perfect. Obscenely expensive, but an experience we'll remember forever. Well worth it! p.s. The shampoo/lotion they provide is from Molton Brown which you should try your hardest to use all of, it's fantastic stuff!", "Date": "November 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“Great”", "Author": "MisstheDogs", "ReviewID": "UR10901521", "Content": "I honestly have no idea what people here are complaining about. This may be the single nicest domestic hotel in which I've stayed-- and I spend a lot of time in hotels. Check-in was quick and efficient. The room was -- wonderful. It had every convenience I could imagine. Large bathroom with separate tub and shower. Can watch TV or listen to the radio while soaking in the tub!!! In-room stereo. Great lighting. Free, easy wireless internet. Comfy desk/chair and sofa. Can see TV from anywhere in the main room. Terrycloth bathrobe and slippers. Free bottled water in the evening. Really, I can't imagine anything that was left undone or anything more that I'd want. No room noise. Never any wait for elevators. The hotel is within walking distance from many stores and restaurants. They offer you a choice of 4 newspapers -- I asked for 2 and got a third! Concierge was great -- wonderful recommendation for sushi restaurant. I had a minor issue with the mini-bar (which wasn't cold). I called the front desk. Literally within five minutes, I had room service at my door, bringing two of what I'd wanted -- on the house. They replaced the fridge while I was at dinner. Impeccable service. Didn't try the spa -- unfortunately --so no comments on that. The hotel bar was fun -- but they do allow cigar smoking, so beware. You can take drinks up to your room. Room service was timely although the food was only average, especially for the price. Food/drink prices are high for Chicago but, as noted, there are many great places to eat nearby. This is a great hotel with great service. Absolutely recommend it! Can't wait to return to Chicago to stay here again.", "Date": "November 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“The Best!”", "Author": "stainged04", "ReviewID": "UR10693619", "Content": "WOW! Iâ€™m not sure that there are enough superlatives in my vocabulary to completely describe my experience at The Peninsula. The only downside is that this hotel will possibly ruin you for all lesser offerings. My wife and I moved here for one night after spending two nights across the street at the Ritz-Carlton. The desk staff at the Peninsula was accommodating was able to get us assigned a room at the early time of 10:00 AM even though we were visiting on a very busy weekend. This was a nice surprise to begin our stay. The friendly clerk then walked us to our room, introduced us to the many features of the room, and verified that everything was to our satisfaction. I found the level of service throughout the hotel to be exceptional. Every employee that I came into contact with was polite and helpful. The room was very nice. We had reserved basic room, and found it to be quite comfortable and spacious. The earth toned dÃ©cor is elegant without being overwhelming. The bed and linens are just wonderful, and it can be hard to coax yourself out of bed in the morning. The fact that you can control all of the electrical for your room from a bedside panel was a feature that I had never before experienced, and I just loved it. The bathroom was also large and well appointed. A two person soaking tub with a television perched above was on the far wall. Another control panel for the lights, radio, television, and phone are within easy reach. The tubâ€™s speakerphone even neutralizes the sound of the water so that a caller does not hear that you are calling from the tub! The bathroom which is all finished in marble and frosted glass also includes a large shower and other necessary facilities. The room also contains a fair sized closet, electronic safe, personal fax machine, DVD Player, and well stocked mini-bar. The 19th and 20 floors are where the pool and spa are located. We found these areas to also be very nice. Most of the common areas were stocked with chilled bottled water, and the lobby had a coffee bar set up in the AM hours. The hotel bar is a warm, inviting place to have a drink. However, it can get quite crowded. If there are any negatives to mention, I would say that the selection of soaps in the room could have been better. Also, parking $$$ will break you if you bring an auto, but I guess that is pretty standard for downtown Chicago. In conclusion, this place is just the best! At least the best I have ever stayed in. the Peninsula has a great location right on North Michigan, a warm, friendly staff, and very comfortable rooms. What else can you ask for?", "Date": "November 8, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Loved the hotel”", "Author": "Lawyermike", "ReviewID": "UR10384728", "Content": "This was my first trip to Chicago and my first stay at a Peninsula hotel. The room and the staff were both great. I plan to stay at other Peninsula hotels in the future.", "Date": "October 27, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“wonderful”", "Author": "nycsf", "ReviewID": "UR10219635", "Content": "High class hotel, with large rooms and huge bathrooms. Luxurious bathrooms especially. Great rooftop pool.", "Date": "October 22, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Very disappointing and not worth the price”", "Author": "TexasTandE", "ReviewID": "UR10051922", "Content": "My husband and I booked a $795 Executive Suite for a birthday weekend. A person from the hotel called last week to ask our newspaper, drink, fruit, and housekeeping preferences. Nice touch, right? Well, we thought so too until we arrived and the front desk asked us the questions again. Unfortunately none of our preferences were acknowledged at any time during our stay. Why ask if you're not going to attempt them? We checked in at the front desk, and were truly taken aback by the rudest, most short tempered front desk person we have ever encountered. It really surprised us how someone like this could be checking in guests at such a nice hotel. It made such a poor first impression. My husband - whose ears were still stuffy from the plane - asked twice on what floor was the fitness center located. The second time she answered, she huffed and snapped at my husband. It was a very unsettling experience. Our suite was okay, but not great. The furniture was very scratched up. The outdated TVs had very poor pictures. The phones were also very outdated, and one did not work. We had to call for housekeeping 4 times on Saturday. We received half a newspaper on Sunday (they are placed inside a locked box so we knew it was delivered that way!) The suite did not meaure up to its price, hype or reputation. We thought the location was good - but saw many other luxury hotels in the same location. The bed was comfy, and room service was good. We will not stay at The Peninsula when we visit Chicago in the future. We strongly suggest you stay somewhere else.", "Date": "October 7, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Rockford, IL", "Title": "“Disappointing”", "Author": "DRGWAGMOM", "ReviewID": "UR8828752", "Content": "Maybe my expectations were too high but I must say that I was very disappointed in my stay at this hotel. My trip was relative to three days in Chicago on business and was booked by my company. Finding out I was staying at the Peninsula seemed like quite a treat, but I won't be back. The hallways and rooms are looking worn (surprising for a hotel of this caliber) and service was average at best. Also, upon getting to my room it had a very odd smell to it ... I even double-checked to insure I was in a non-smoking room. As I went into the bathroom to unpack, there was a used tissue, used towel, used soap and water all on the bathroom counter. Also, it was obvious that the toilet had been used. All I can come up with is that someone else had checked-in, decided not to deal with the odor and checked out of the room; however, no one took the time to clean it or even double-check what the previous guest possibly had done to the room. When I called the front desk, I was immediately moved to another room but it kind of set the tone for my visit. I have enjoyed stays at other Chicago hotels much more and I know they did not charge what The Peninsula does. While I may be back on business, I would never book this hotel on my own.", "Date": "September 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh, PA", "Title": "“Second visit - consistant high quality”", "Author": "mike0steff", "ReviewID": "UR8525736", "Content": "This was my second stay at the hotel. This time I came for a get-a-way weekend with my wife to celebrate our anniversary. The location was great and the room was excellent. Check in was quick and flawless. The front desk confirmed all of our dinner reservations booked via concierge (reservations were for both in and outside of the hotel). The hotel gave us a complimentary bottle of wine and chocolate covered strawberries for our special occassion. Prior to our arrival my wife ordered Congac and cigars to surprise me. She was a little upset that they were not in the room upon arrival as she had requested and confirmed. The room was very comfortable. The bed was incredible - wxtremely comfortable!!! There was plenty of closet space and a large, well appointed bathroom. The room was service was excellent. Every time we ordered ( a least once a day) we were quoted a time of arrival. They arrived almost to the minute from the time we were quoted (I don't know how they do that unless they are waiting outside our room and knocking right at the quoted time.) Finally, the staff treated us like movie stars. Everyone remembered our names and always asked how our dinner reservations turned out the previous evening. We truly enjoyed our stay and would highly recommend the hotel to couples.", "Date": "August 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Lake Forest, Illinois", "Title": "“Tired room and weak spa.”", "Author": "Wilson50", "ReviewID": "UR8511363", "Content": "We had high hopes for our stay but were disappointed. First, we booked a deluxe superior room; the view of an exterior wall of an adjoining building left something to be desired. I turned on the water in the sink and it started filling up with water. I pushed the lever down to open the drain and the entire lever came off in my hand and something metal dropped to the floor. Next my wife took a shower and the shower door would not stay closed. Needless to say, it was surprising to find that things were broken and not working properly in our room. The next morning I went to the spa and BOTH the steam room and the whirlpool were broken. While in the pool area, I spoke with a fellow guest who stated that while using the hair dryer in his room he received a rather large electrical shock. The management offered to take 25% off his bill. On the whole, the Peninsula was a nice hotel but they need to work harder at keeping the mechanical elements working.", "Date": "August 26, 2007"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "1", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St Paul, MN", "Title": "“Swanky, lovely hotel”", "Author": "Spacrawler", "ReviewID": "UR8375864", "Content": "The women in my family stayed at the Peninsula for three nights in August 2007. We had three rooms adjacent to each other, one with a Bed and Breakfast package. Two of our rooms were ready at check in time, but the third was not ready even an hour later. We found out that a prior guest had smoked in the room and they were trying to air it out. It never did air out over our stay. To the credit of the hotel, they did offer to move us on our second day, but we declined because of the hassle factor. Otherwise, check-in was the low point of our stay. The person that checked me in seemed to not know what to ask me, how to print out the check in card, and never asked me questions about newspaper preferences, food allergies, etc. that the others in my party were asked. The woman who checked in my mother was downright rude, talking down to her in an insulting way. We believe she is the assistant manager, but we aren't sure. This did not start our stay off well, especially when we found out her room was the one that had been smoked in. Actually, the main level with the restaurants, check in, and concierge always reeked of smoke. We wondered if there was a cigar bar in the hotel. A good reason to ban smoking in all public areas of hotels, in our opinion. Other than this worrisome beginning, the rest of the stay was great. We loved the rooms - regal, warm decor, a stupendous bathroom, great a/c during a very hot time, and staff that catered to our many requests prompty and graciously. Softest sheets ever and large, thirsty towels -- heaven! We had a number of treatments in the spa, all great. The facilities were top notch and very clean. We had afternoon tea the day we arrived and it was lovely. However, the breakfast package proved to be a bust. Their breakfast menu is fairly limited and the food was outrageously expensive. I don't mind paying $30+ per person for breakfast, but I want a lot of choices, served promptly. Service was uniformly slow in the Dining Room, although waiting in such a grand space was not the worst thing in the world! It is hard to decide if the experience was worth the price we paid. I have stayed at the Park Hyatt and the Four Seasons, and I found this experience on par, although more pricey. I don't think we would go back to the Peninsula, especially with the opening of a Mandarin Oriental and a Shangri-La property in Chicago in the near future. I think we would try these other properties, especially if their rates are competitive.", "Date": "August 8, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“That's why you choose the Peninsula”", "Author": "stadt2", "ReviewID": "UR8041863", "Content": "Fabulously professional service and elegant rooms. Some of the room electronics and televisions could be updated, but it's even a stretch to find fault with that. Perfect business stay.", "Date": "July 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Really great. Lots of perks”", "Author": "cosmic_babygirl", "ReviewID": "UR7985570", "Content": "Great location. Next to water tower which is great for taking the free trolley or the bus. Rooms are very clean, crisp. There is a small crack on top of the bath but who cares? Large rooms with separate corridor for luggage & wardrobe so you are not cramped in like with most hotels. Bathroom has a shower recess with 2 showerheads (one fixed and one portable). Bathtub also has a showerhead. TV in the bathroom. Free slippers, internet (which I am using now to write this review), Molton Brown lotions/shampoos and bottled water which are all very handy. Pet friendly (seen a dog in the lobby). Highly recommended....Did I mention the powder/makeup area in the bathroom as well?", "Date": "June 25, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "chicago IL", "Title": "“rude and unprofessional service at the Spa at the Peninsula”", "Author": "lpqmember", "ReviewID": "UR7796510", "Content": "We stay at the best five star hotels all over the world. We really love the Four Seasons for their consistent service. We live in Chicago and travel often. I booked a spa appointment at the Peninsula spa in Chicago although we have stayed more often at the Park Hyatt and love it-- better service and great room up to date rooms. My husband booked my spa appointment as a gift which I was excited about and received an excellent treatment but the spa manager was rude and hung up on me when I asked her a simple question..Her name is Tiffany Craig. I would never book another appointment or stay at the Peninsula Chicago again under the circumstances. If this person represents the Peninsula style, I guess no one I know would be interested in staying at the Peninsula Chicago. My grandfather and my family were frequent guests for many years at the Peninsula Hong Kong. Unfortunately, those days are now over.", "Date": "June 6, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“\"Handicapped room\"--Great stay”", "Author": "Bracing", "ReviewID": "UR7581437", "Content": "There are lots of reviews of this hotel, which is why I decided to stay there; but I thought I would review the \"handicapped\" room we got when we booked a couple of days before and were given almost the last available room in the place. Obviously they like to save it for people in wheelchairs or with disabilities. Perhaps others may like to know what to expect from these rooms at the Peninsula. Because of delays (we landed in a snowstorm), we arrived at the hotel after midnight, but were greeted pleasantly. If I had wanted, someone would have taken our bags up to the room, but I liked that no one insisted. There were no stairs to negotiate in or out of the hotel. The entrance is on the ground floor, but then you take an elevator to the lobby floor. Our room was large and comfortable with room for a wheelchair to go around the beds, through the doorways and into the bathroom. The bathroom was designed for wheelchair use and all the storage, except for the closet, was at wheelchair-accessible levels. On a side note, the Chinese restaurant at the hotel gave me one of the two best Chinese meals I have experienced in my life-- the other was Hakkasan in London a few years ago--, and I am a Chinese-food aficionado. I was not surprised when I made inquiries and found that the chefs in both cases came from great hotels in Singapore, Raffles and the Mandarin Oriental respectively. The Peninsula is perfectly located and I will certainly try to stay there whenever I go back to Chicago.", "Date": "May 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oak Park, Illinois", "Title": "“Absolute best ever!”", "Author": "sparkysgirl", "ReviewID": "UR7430506", "Content": "I swear, this is the best hotel in Chicago. Nowhere else will you be treated with such kindness and respect. The attention to detail is superb. My husband and I stayed here over the 4th of July weekend in 2005 and it was awesome. I had breakfast in bed the next morning while my husband went swimming. It was sooooo good. This is definitely worth the price and it is a treat to stay here. They will go out of their way to make your stay as comfortable for you as they can. And they do everything for you. . . We were in awe when they asked us what newspaper we would like in the morning. . . =)", "Date": "April 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Well Worth It”", "Author": "atateka", "ReviewID": "UR7201266", "Content": "My ten-year-old and I recently returned from the Peninsula. When making my reservation the hotel inquired if they should note a special occasion for our trip. I told them we were celebrating a child's birthday. Much fuss was made of this. A Peninsula Bear, gummy bears, chocolate chip cookies, and special bath treats were delivered to our room. My child felt very special for all the attention while the surprises lent a festive air to the day. We enjoyed the pool frequently. The lanes made for perfect lap swim while children enjoyed themselves in another corner of the pool. Coffee, tea, ice water and fresh fruit are there for guests to enjoy. Check-in and check-out were swift. Our room was ready when we arrived before noon. Concierges Gary and Robert went out of their way to help us secure reservations and make recommendations. The property is beautiful. Our Grand Deluxe room was well-designed, while common areas are luxurious and comfortable(just right for the two of us, but would have been crowded for a family of four). Room service comes at a price at any hotel. Here it was speedy with quality food and a lovely table. Like so many things at this hotel, room service was attended to in great detail. It felt like a treat rather than just a convenience. Where else would I be asked if I prefer milk for my coffee to be warmed or served cold? The tariff is dear, no getting around that. I felt that for a special occassion such as ours, the value was there in the grandness of the hotel, the superior service, and the staff who were friendly and helpful. The Peninsula staff is hardworking, but they always appear to be cheerful. It makes for a pleasant atmosphere. Thank you to all Tripadvisors who reviewed this property, for good or not-so-great. These and other Chicago reviews helped me to select a property.", "Date": "March 22, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Michigan", "Title": "“Poor service”", "Author": "llis1", "ReviewID": "UR6928809", "Content": "It took 45 minutes to check in -- not fun with our two children. Then they told us that the room we booked was not available. We had written confirmation of our reservation, and showed it to them. First they said it was a computer error, then they changed the story to something else. They said that in any event they didn't have any rooms available except a small single room with one king bed -- certainly not sufficient for the 4 of us! We spoke with the manager, and then that person's manager, and they wouldn't do anything except see if they could squeeze in a cot in the small room, admitting that at best it would be a tight fit. I explained that I've stayed at many nice hotels, and that if this happened at, for example, a Mariott then they would give us an upgrade. He pretended to type something into the computer, and then told me that no upgraded rooms were available. I then had a friend call and reserve a small suite for the same night. Lo and behold, my friend was able to get us into the suite that he paid for. Unbelievable.", "Date": "March 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Phoenix, AZ", "Title": "“A very nice stay at the Peninsula”", "Author": "AZHaveKidsWillTravel", "ReviewID": "UR6777424", "Content": "We stayed at the Peninsula Chicago in January for a weekend with our 2.5 year old daughter. We were booked into the lowest ranking room, a superior with a king sized bed. Although there wasn't much of a view (we looked onto another highrise), the room itself was wonderful. The decor/furnishings were unblemished and that bathtub was pretty neat with the TV. The only weird thing: the toilet is enclosed by frosted glass walls within the bathroom. Not a big deal, but as our little girl gets older, that could easily become an annoying privacy issue. Speaking of kiddie stuff, the crib that they supplied was adorable - linens for a little girl, bath supplies, a stuffed peninsula bear. Very cute - she loved it. The downstairs restaurant supplied me with complimentary milk each evening to take back to the room for her. The manager also arranged for a complimentary bottle of champagne and a trio of chocolate desserts upon arrival into our room - aside from attending a family wedding, we were celebrating my husband's birthday and they certainly made a nice effort towards making it special. The indoor pool/spa is nice -although a bit chilly! We didn't have spa appointments, but the public area of the spa has been newly redecorated and looked great. Other things to note: this is downtown Chicago, so if you are renting a car, be prepared to pay for parking. I think it was just over $40 at the Peninsula for valet, per night. Drive-in and drive-out priviledges included. Also, there is a chocolate buffet each evening on the weekends - make sure to get reservations if you're interested in going. Overall, we loved the Peninsula and wouldn't hesistate in returning.", "Date": "February 10, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Good, but not a top ten in America...”", "Author": "MonteChicago", "ReviewID": "UR6534137", "Content": "We are both in our 30's and have stayed in very nice resorts both internationally and domestic (four seasons, etc) My honest opinion being a native to Chicago is the hotel is of course beautiful but overall just OK. This hotel is a \"top ten\" in every list, but no WOW factor at all. The room is very nice and good bathroom (not much better than a deluxe hyatt) The tea service was 'OK\" You expect perfect service, food, attention and overall it was nothing better than a decent lunch. The peninsula bar is a great place to enjoy a scotch, cigar, champagne ! We once had our privacy please on and were in the shower when housekeeping came in. I called down and asked why they did not look at the sign. They really had no response. Half the time you call concierge they forward you on somewhere else. At four seasons you can ask any staff member for something and he will personally call the right people and call you back. Nothing wrong with this place, but 600-800 a night let's get something clear - it might not be worth it. The pool (3rd time there in 3 years) is not beatiful and again no wow factor. Small hot tub and the spa renovation makes no sense.", "Date": "January 1, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Chicago, IL.", "Title": "“Not worth it”", "Author": "GGK", "ReviewID": "UR6510302", "Content": "Overall our stay was just okay. The room we reserved was not available so they offered an upgrade but honestly the upgraded room (small suite) was cramped and was definitely not as open as our double deluxe room would've been. I thought the bathroom was nice but that alone was not worth the $400+ room rate. I did have a couple of issues, the main issue being that the breakfast we ordered via room service was terrible. I actually had to send it back because the eggs were completely overcooked, the ham was rubbery from sitting in the warmer too long and the english muffin was completely cold and untoasted. Overall we were disappointed and have had much better experiences at 5 star hotels like The Ritz and 4 stars like Westin hotels.", "Date": "December 28, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Illinois", "Title": "“Excellent”", "Author": "Wilson7444", "ReviewID": "UR6132231", "Content": "Stayed in a Juior Suite with my three kids in early November, four day weekend. Beautiful suite, if a bit small for four people. The much praised bathroom was a hit with the kids (they spent most of the first hour watching TV in the tub), but I found it a little cramped and the slight lack of privacy for the toilet was a bit of a pain for the four of us. Kids liked the high tech room, but I couldnâ€™t get the thermostat to keep the room cool enough without being too cold. The bed was very comfortable. Wireless internet, unlike, I think, the Ritz. Location just off Michigan Avenue was nice, but views were plain. A nice look at the Walgreens/residential tower across the street. A sliver of beach & waves available. Too low to see far, but couldnâ€™t watch the street traffic because our room was set back. Excellent service, mostly. On the second night, they hadnâ€™t brought our rollaway when we returned around 11:00 and we had to wait almost 45 minutes for it to be setup. Excellent room service, everyone liked their food. Shanghai Terrace was great for lunch. Nice fitness center and pool, though the hot tub was too hot -- another guest agreed. Great free snacks for kids. Price was comparable to a Ritz or Four Seasons suite, though I think perhaps a bit smaller without as nice a view. Overall, I think I slightly prefer the Ritz, but the kids liked the Peninsula better and I wonâ€™t veto if I get outvoted.", "Date": "November 15, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NJ", "Title": "“Maximum comfort, minimum headache”", "Author": "watering_can", "ReviewID": "UR6121952", "Content": "Spent 3 nights with my family of 6, including 4 children ages 9 to 16, and all I can say is wow. My husband and I are well-traveled New Yorkers and we were impressed with just about every part of the experience. The only hotels that come close in our experience are the Oberoi's we stayed in in India. The Peninsula offered prompt, courteous, professional and highly competent service throughout, in a serene and elegant setting. We would stay there again in a heartbeat. When we arrived we found we'd been upgraded to the Topaz Suite and it was stunning. Quiet, immaculate, tastefully decorated, with a kitchenette, dining area big enough for all of us, lovely bathrooms, etc. There were fresh orchid and other flower arrangements in every room. Complimentary champagne, chocolates and other treats for the kids were very much appreciated. And the rooms had wonderful views of the water tower, lake and Michigan Avenue. The concierge and front desk were extremely helpful. We were allowed a late checkout at 5:30pm, which was great. Room service was excellent, always arriving within 30 minutes, and the food was fantastic. I mean, really really good. We also enjoyed the Chinese restaurant downstairs. Not your ordinary Chinese restaurant, the food seemed more interesting and authentic than the usual fare. The only thing that was even close to a disappointment was the lobby restaurant. The chocolate buffet was probably not worth the cost, unless you take the live music into account, which on the night we were there was an excellent small jazz group with a fantastic vocalist. Might have been better to just have a drink and skip the buffet. At the other end of the spectrum was the Sunday brunch buffet. This was truly outstanding, with more choices of foods, of the highest caliber, than I've ever seen at a Sunday brunch. This was one of the high points of our stay. The kids loved the pool and hot tub. My husband and I fell in love with the fitness center. I'm partial to working out, if not outdoors, then in a room with big windows, and the fitness center really delivered, with excellent machines facing huge windows on the 20th floor. The location of the hotel is great as well. We'd definitely go back, but maybe next time for a romantic weekend by ourselves . . .", "Date": "November 13, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Iowa", "Title": "“Personal service, but no wow factor.”", "Author": "IA_Hawks", "ReviewID": "UR5959177", "Content": "Yes, The Peninsula offers a very personal touch to staying at a hotel but we were not \"wowed\" by our overall experience. After checking in, we arrived in our room and were greeted by mood lighting and soft music, about 30 minutes later, we received a complimentary plate of fruit for our first time staying here. Our Superior King Guestroom was nice and inviting but nothing we haven't had before at other hotels. We did not use the spa, but we did use their workout room. It offers a great view (from the treadmills) looking out towards Lake Michigan or Michigan Avenue and a small assortment of weight machines. Headsets and bottled water are also available. The rooftop lounge area only has enough chairs for about 10 people so get your seat early if you want to soak up the sun. The chocolate buffet on Saturday night offers a large table full of chocolate treats, but we found most of them dry and bland. Hardly worth the $30+ per person. We booked this hotel for a weekend getaway and enjoyed the location, but we will not be returning next year.", "Date": "October 15, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "2", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milwaukee, WI", "Title": "“Magnificient...”", "Author": "usagary", "ReviewID": "UR5897878", "Content": "If you have the money to spend on a top notch, 5 star hotel in the loop of Chicago, look no further than the Peninsula. The bellmen in the front were very courteous. The room was excellent -- defiinitely the best we've stayed in. If I have a complaint, it was with the front desk. They fell through on a couple of tasks. Other than those things at the front desk, this hotel is a 10+.", "Date": "October 1, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Mateo", "Title": "“My Favorite in Chicago”", "Author": "Tipster2000", "ReviewID": "UR5883463", "Content": "While the views don't match the Four Seasons or Park Hyatt, the Peninsula rooms are superior, close to flawless and very quiet. No sounds from adjacent rooms and street noise almost completely muffled. The rooms, dressing area and bath are spacious--at least in the Grand Deluxe. Separate shower in bright marble bath. Impeccable service in all regards. Superb location. This was my 3rd or 4th annual stay and i continue to consider this my favorite hotel in Chicago.", "Date": "September 27, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“I will never look at another hotel the same again!”", "Author": "MidnightMarauder21", "ReviewID": "UR5799428", "Content": "I have to disagree with the previous post about the Peninsula being unfriendly toward African Americans. I took my husband there in August as a birthday surprise and I am still recovering from the extreme pampering and luxury. The staff was very accomodating, and everyone went out of their way to make sure we had an enjoyable stay. My husband and I, who are both African American, checked into the Peninsula at around 1:30 in the afternoon. Not only was our room ready, we were also offered a complimentary room upgrade. The room was unlike anything I had ever experienced. We had tea in the Lobby that afternoon. Everything was delicious and the service was impeccable. We were seated immediately, and the wait staff was attentive. I couldn't have asked for a better experience. As a matter of fact, there was a table with about 10 African American women having tea right next to us. Later that night my husband and I wanted dinner from Grand Lux Cafe, but we were too lazy to walk there. I called the concierge and she sent someone out to pick up our food for us and deliver it to our room. I didn't see or experience any discrimination at all during my stay, and I plan to go back often.", "Date": "September 13, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cambridge, MA", "Title": "“The ultimate in comfort and elegance”", "Author": "theresama40", "ReviewID": "UR5546857", "Content": "Beautiful and supremely comfortable room (where else can you get a TV at the foot of the bath); a enormous beautiful roof-top pool with an amazing view; and excellent food -- not to mention the extremely attentive service (I would actually prefer if it were slightly less fawing, but that's my taste). I can't even complain about the price (high), because it was certainly justified by the quality. What's not to like?", "Date": "August 3, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Southampton, New York", "Title": "“best in chicago from a new yorker”", "Author": "jhh", "ReviewID": "UR5506791", "Content": "stayed 2 times before, once in Aug of 05 and in Feb 06 and am booking agian this August, the hotel is first class, food and personal service was perfect, am booked again, i go to Northwestern Medical every 6 months from Southampton, NY and have had nothing but the best experiences, great location.", "Date": "July 24, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Avon, CT", "Title": "“Back on Top!”", "Author": "AvonTravler", "ReviewID": "UR5439352", "Content": "The first time we stayed at the Pen in Chicago was in 2004 and the hotel was ranked by T&L magazine as the best in the US. While the hotel was very nice, it did not live up to our expectations. Well, it is two years later and things have changed! We have tried both the Four Seasons and Ritz in Chicago since our last stay and from now on we will stay at the Pen when in Chicago. My main complaint the last time was the bed - it was impossible to get a good nights rest because it was hard as a rock. Well, the Peninsula has rectified that issue - slept like a baby last night in a very comfortable bed. This is truly a five-star hotel - the location is perfect, the rooms are state of the art (very high tech), and the customer service from EVERYONE on the staff was top tier. The Peninsula Chicago has my business forever...", "Date": "July 8, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York, New York", "Title": "“Wonderful, Wonderful, Wonderful”", "Author": "A TripAdvisor Member", "ReviewID": "UR5315317", "Content": "This place is heaven on earth! The room was divine - I only had a view of the parking lot, but who cares when the carpet is a foot thick and the bathtub is huge! The bed was so comfortable I almost overslept and missed my meeting I was in town on business for. I ordered breakfast in and was perfectly satisfied. I had a few hours before my flight home, so I had a glass of wine in the lobby restaurant. When I needed to run out to make a phone call, my waiter kept watch on my bags near my table while I was gone - that is what I call service! They even had models wearing the latest from YSL walking around the room in case you had a couple thousand dollars to spare. The cost is high, but if you want to know what superior service coupled with ultimate luxury is, stay at this hotel!", "Date": "June 6, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Providence, RI", "Title": "“Worth every penny”", "Author": "30yo", "ReviewID": "UR5006953", "Content": "My husband and I stayed in this hotel for new years eve and had a wonderful, wonderfl time. The room was beautiful and the service phenomenal. I had a massage at the spa and met my husband afterwards in the pool. The pool facilities are amazing - i wanted to spend an entire day in the locker rooom. They had fluffy towels, a menthol steam room and fancy bath products in the HEALTH CLUB showers. Back at the room we had a huge bathroom with tub and double shower. There were Molton Brown products there as well. The bed was divine and there was a remote control next to it on both sides that controlled the drapes and lights in the entire room. There was a welcome bag with little treats when we got there. The next morning i had breakfast with girlfriends in the little cafe next door which was wonderful, too. One of the best new years eves I have ever had.", "Date": "April 24, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Honolulu, HI", "Title": "“One of the Best in the US”", "Author": "drewomite", "ReviewID": "UR4735060", "Content": "Spent five wonderful nights at this terrific hotel. It is the staff and service that set this hotel apart from others. First class, professional and friendly. I normally only experience service like this in five star hotels in Asia. The Pen Chicago brings five star service to the U.S. Management is doing something right here. The lobby bar dinner was quite expensive and not too great. Other than that, no complaints. Cannot wait to return to Chicago and stay at the Pen.", "Date": "March 26, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Bloomfield, Michigan", "Title": "“Elegant with excellent service”", "Author": "A TripAdvisor Member", "ReviewID": "UR4462997", "Content": "My husband and I stayed at the Peninsula Chicago over the New Year's weekend. The hotel is elegantly decorated and the service was excellent. I was a little disapointed with the food. We had afternoon tea on New Year's Eve and felt the food could have been a little better. It lacked freshness ever so slightly. Okay, so I'm comparing the food to my tea experience at Claridges in London in October 2005. I would still recommend the hotel.", "Date": "February 15, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Cincinnati", "Title": "“Truly a pleasure”", "Author": "Charles415", "ReviewID": "UR4366317", "Content": "Stayed at the Peninsula for one night in late December, and had an absolutely wonderful experience. From the first contact with the staff to the last, everything was flawless. A request for a high floor, even though I was paying a discount rate? \"Certainly sir, how about a room on our 18th (top floor) overlooking Michigan Avenue.\" OK! 15 minutes later, housekeeping wants to confirm the age of our daughter to get the appropriate robe and slipper size. An hour later, room service is knocking (or, ringing the doorbell, rather) to deliver a complimentary welcome gift; a tray of fresh chocolate chip cookies, a bottle of coke, gummy bears and jello -- all for the kids. (Rooms without children seemed to be receiving a tray of dried fruits and nuts, which also looked very good). Upon checkout, which took all of about 30 seconds, the clerk was efficient and friendly, while also acting warm and sincere. Physically, the hotel is gorgeous, and impecabbly clean. Our double bedded room was large with a nice seating area, comfortable desk, and a nice little hallway between the bathroom and bedroom. Molton Brown amenities and super-soft towels completed the experience. In the bedroom, bed sheets were soft and luxurious, although I must admit, the bed wasn't as good as some in lower-class properties, although it was still comfortable. The Spa is a must on the upper two levels of the hotel, with great locker rooms, a cool pool, fitness room, and a great selection of teas, coffee, citrus water and fruits in between. The conceirge staff effortlessly handled our questions and gave great recommendations for breakfast. When I called down for directions to a theater, they had it drawn out in minutes. But, thinking back on the experience, it all goes back to the staff, which truly made the trip. Every member of the hotel made an effort to greet us in the hall, and all seemed to care about their jobs, delivering service that was super-professional, but also not snotty. Needless to say, I can't wait to go back.", "Date": "January 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Richmond, Virginia", "Title": "“Family Trip to Chicago for Thanksgiving”", "Author": "FS_Junkie_with_kids", "ReviewID": "UR4145413", "Content": "We stayed at this hotel from 21-25 November with our children, ages 4 & 6. Since many of the reviews touch on the beauty of the hotel which is as beautiful as everyone says, I'll gear my review towards those traveling with small children and trying to decide if this hotel is a good fit. 1. Location. The Peninsula was perfectly situated for all our excursions to the various museums around town since it's a block from Watertower, the Disney store on Michigan, a couple blocks from Lake Shore Drive and about 2 blocks from the \"El\" elevated trains/subway. The American Girl store is on the same block around the corner and the Hershey Store and Girardelli were just a few steps more. Plenty of shopping for everyone on Michigan Ave. 2. Staff. Everyone was friendly to us and our children. The staff of Avenues was fantastic. Those on the Lobby Restaurant were hit or miss. 3. Restaurants/Food. The Children's Afternoon Tea in the Lobby was yummy with mini hamburgers, PB & J, & ham and cheese in addition to the sweets and a pot of hot chocolate. Pierre Gourmet, the French Cafe just outside the main entrance, was perfect for breakfast (and probably for lunch). The staff and friendly and attentive to us and our children. Room service did well by us when we ordered dessert for the family one evening. Everything arrived on time and was as ordered. The hotel does have a children's menu at the Lobby and Avenues but the selection is somewhat limited. 4. Pool. There are three swimming lanes and a hot tub on the 19th floor. There were a few swimmers swimming laps while we were there who were politely tolerant of the 10+ children in the area. While not ideal for children or those who are swimming laps for that matter, it might make a good 30 minute diversion. 5. Pen Kids Package. We researched the various packages at the Four Seasons and Ritz Carlton before picking the Peninsula. The most kid friendly package was at the Ritz Carlton and it provided the most value for the $. If you choose the Peninsula, I would go with the standard room rate or the American Girl package and spend the additional $60+/per night from the Pen Kids Package elsewhere. With the package, the kids got a nice welcome snack, Pen Kids multi-color backpacks, a signature bear (who can't keep it's pants on), crayons and some coloring paper. We also received two coupons (one for ice cream at Bloomingdale's and children's admission to the Children's Museum at Navy Pier). A better investment is to buy a family membership at your local ASTC museum which had reciprocity at a number of museums in Chicago (Museum of Science & Industry, Children's Museum and Field Museum, to name only a few). 6. Room. Our bathroom was a nice extension of the main room. Whenever we were there, the kids wanted to take a bath and watch cartoons. This came in handy if one of the kids wanted to nap or as a diversion if one woke up before the other in the morning. 7. We also took advantage of the Thanksgiving buffet offered by the hotel. The food came from all three restaurants and exceeded our expectations. The hotel had also created a separate kids area with movies, playstation, and crafts that our kids enjoyed. The only negative were the $18 mimosas we ordered with the meal but thought were included with the buffet. All in all the Peninsula is a wonderful hotel, in a great location. It is clear that the chain is trying to cater to families - the kids room during the buffet was a good example of this.", "Date": "November 26, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great experience in Chicago”", "Author": "jah123", "ReviewID": "UR4144978", "Content": "When I arrived at the Peninsula after the usual traffic filled ride from O'Hare, I was completedly frazzled and must have shown it. The check in person asked me for my favorite wine and 5 minutes after I reached my beautiful suite, a glass of complimentary wine arrived. What a treat!!! I have stayed at the Peninsula again and the rooms and service are terrific. So are both of the restaurants. I have stayed at the Peninsulas in Hong Kong and Bankok, both of which have better views, but in all other respects the Chicago Peninsula is in their category of among the best hodels in the world.", "Date": "November 26, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New York, NY", "Title": "“Close (but not quite) perfection”", "Author": "Porpex", "ReviewID": "UR4136818", "Content": "The Peninsula in Chicago is an adventure in extravagance. Our suite was charming; spacious, and with the most extraordinary bathroom I've ever encountered in a hotel, complete with an enormous soaking tub overlooking the Chicago skyline...and a built-in television behind glass, so you could catch the news while indulging in a bubble bath. (It became my habit.) Our bedlinens were crisp and soft at the same time; and control panels for the lights, the radio, the television, and the front door \"privacy\" light were well-placed throughout the suite, always a finger-touch away. The hotel's public areas are unapologetically grand; amazing vistas, endless ceilings, and gleaming marble floors. Our only complaints? Room service could be a bit time-consuming; it often took forty minutes to an hour (a far longer wait then, say, the Four Seasons in Beverly Hills or the ever-speedy Covent Garden Hotel in London). Once we even placed a simple order (a pot of coffee) and it never arrived. And the valet wasn't too speedy delivering our luggage upon departure; we must have waited fifteen minutes. If the staff can learn the value of alacrity, then this hotel will rapidly become a true favorite of mine.", "Date": "November 22, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Wow! I can see why this hotel is #1 in the USA!!”", "Author": "sheltieloverfrancis", "ReviewID": "UR4081075", "Content": "After our trip fell thru down to florida b/c my parents still didnt have power from Wilma, the hubby and I decided to take a short trip to chicago. We usually only stay at the Four Seasons, but decided to try the Peninsula based on pics and reviews on here.. and WOW!!! We loved it! From the moment we arrived.. how the head doorman greeted us and they took care of our bags. we got there early at 11am and our room was ready.. we were personally brought to it and given a tour. we then stepped out and got some lunch.. unfortunately their french bistro was booked solid and i didnt want to wait 1 hour.. so, we ate on michigan. upon returning to the hotel they had placed a bottle of champage and choc dipped strawberries and whipped creme out for us!! what a TREAT!! :) i then took a bath in the great tub with the tv.. adn set the mood lighting! so much fun! we had a dinner reservation at Shangai terrace.. and i will agree with the last review.. i wasnt that impressed with the food. to me, it didnt seem to have much taste at all- i got the wok seared lobster and my hubby got the kobi filet.. we also got a bottle of wine and splurged on $20 teas which were amazing. we had a 9pm reservation for the chocolate buffet.. but, we were so exhuasted from the day we decided to pass.. but, i bet it is amazing!! upon waking up sunday morning i called to see if we could get a late checkout... they just told me to \"name the time\".. so, we didnt even have to check out until 3pm!! i had booked my hubby for a massage at the spa and myself a facial.. the spa and pool are GREAT! on the 19th and 20th floors of the hotel! great viwes! my hubby loved working out and looking at lake michigan! :) we did have lunch at pierre gourmet then.. it was only a 10 min wait.. EXCELLENT food! i felt like i was back in france! :) tables are very close together and the wait people have to watch out from bumping into one another-- but, itsnt that truly what a french cafe is?? one other thing about the hotel-- im an Orchid lover.. and i could not believe the huge, gorgeous orchids they had all around the hotel!! such an oriental, gorgeous look!!!! location as well cannot be beat! right across the street from Saks and Neimanns and within walking distance to all that i love about Michigan Ave! What a great trip! The hotel made all the difference and we will be returning!!", "Date": "November 2, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "England", "Title": "“Superb”", "Author": "admg1963", "ReviewID": "UR4018913", "Content": "Pure luxury ! It would be difficult to find fault with this hotel. The rooms are fantastic - you can't argue with a TV in the bathroom - the staff always anxious to help - and the location for perfect for the Magnificent Mile. If you are able to stay here take the chance!", "Date": "October 13, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Maine", "Title": "“A remarkable hotel...”", "Author": "LuvNE", "ReviewID": "UR4017263", "Content": "This hotel is remarkable; every possible need of every guest is met. The staff is perfectly trained; food (even for meetings) was excellent. I will return without fail.", "Date": "October 12, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "5"}, "AuthorLocation": "NY, NY", "Title": "“Absolutely Wonderful”", "Author": "A TripAdvisor Member", "ReviewID": "UR3942589", "Content": "We went to Chicago for a wedding and chose the Peninsula after struggling through numerous recommedations and reviews on Trip Advisor. I have to say we made an excellent choice; our room (junior suite) was spacious, the beds were comfortable (although not a 'heavenly bed'), the 'at your fingertips' in room gadgets were great as well. The living area was actually very comfortable, which is in contrast to most hotel living areas (e.g. the sofa was soft comfortable, not hard and rigid). My only negative experience was with a gentleman on the concierge staff - on Sunday we wanted a nice brunch spot; he recommended the same places the day before and upon pointing it out to him, he seemed frustrated and asked me to 'then tell me what it is you want' in a less than pleasant tone. I ended up telling him to forget it and walking out. Maybe I am too idealistic, but he should have gone out of his way. I realize they are busy, but this is his job. On the flip side, we encountered many other eager and helpful staff members. I highly recommend this hotel; however, you should book any spa appointments well in advance as they fill up quickly.", "Date": "September 27, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Edina, Minnesota", "Title": "“Best in Chicago, by far!”", "Author": "drvalgemae", "ReviewID": "UR3937465", "Content": "There is no doubt that this is the best hotel in Chicago. We have stayed at the Four Seasons, Ritz Carlton, Drake, Whitehall, Hyatt, and others, and none of them have come close to the quality of the Peninsula. The location is perfect, right next to the Water Tower - all the great shopping and restaurants in walking distance, and the \"L\" two blocks away. The hotel is new (I think it opened in 2002), so all the features and amenities are up to date. The bedside control panels allows one to turn on/off all the lights, control the radio and TV, adjust the thermostat, check the outside temperature, and turn on the do not disturb light outside your room. The beds are as good as the famously wonderful beds at the Four Seasons. The baths are big with double sinks, separate tub (with a TV) and shower, big thick towels, and the toilet is behind a separate door. I just stayed there for my birthday and the hotel gave me a complimentary bottle of French Champagne and a chocolate cake as an arrival gift. The double corner exective suite is spacious and full of light, and at $535/night is less than similar (but not as nice) type rooms at the Four Seasons and Ritz (I think the standard rooms start at around $350). The restaurants are wonderful. Avenues is one of the best restaurants in town, the beautiful lobby restaurant with 2 story wall of windows is great for lunch, tea or cocktails, and the deli/wine bar on the ground floor makes for a great lunch/brunch (we didn't get to the Shanghai Terrace). The service is absolutely wonderful all around. The concierge are friendly, very knowledgable, and helpful. They of course have slippers and robes. The rooms have stereo, DVD player, VCR, fax, and high speed internet access. I noted no negatives (allowing dogs is a major plus in my book); you just can't beat this place!", "Date": "September 25, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Guttenberg, NJ", "Title": "“A class apart in Chicago”", "Author": "A TripAdvisor Member", "ReviewID": "UR3718585", "Content": "It lived up to all my expectations of a Peninsula hotel (this being my first one). The decor, restaurants, rooms and bathrooms were top notch - although service was not up to the standards of a Four Seasons. The cigar bar is a trendy spot on a Friday night, the lap pool and outdoor terace gives the feel of an urban resort. All in all made my first trip to Chicago a memorable one!", "Date": "July 29, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "5", "Value": "3"}, "AuthorLocation": "Noblesville, Indiana", "Title": "“Could have been superb”", "Author": "A TripAdvisor Member", "ReviewID": "UR3684623", "Content": "Well - what can you say about one of the elite 35 five star hotels in the country? Besides being EXPENSIVE (Room - minibar-room service), It is a sublime experience - right down to the slippers. Most people that stay here are used to being pampered and the Peninsula does not disaapoint. However - I was very disappointed with the valet service - insomuch to the point of being downright cranky about it. I called down from my room prior to checkout at about 8:30 am and asked for my car to be sent. At 9:15, I was still waiting for it with a 10:00 am flight from Midway (needless to say I missed my flight). The gentleman at the valet podium was very apologetic and trying hard to compensate with extremely charming conversation but I was upset, nonetheless. My car did not arrive until 9:30 - ONE WHOLE HOUR after I called for it. This is very bad. They explained that they were putting air in my tire - which is very nice but it had been there overnight and had plenty of time to do so without jeopardizing my flight. Will I stay at the Peninsula again? Ye, of course. It is one of only two five star hotels in Chicago. The other being the Four Seasons. And even though the Peninsula is more expensive (about $100.00 more per night for a standard room), it is less \"snobby\" (my opinion), less \"put on\" with all the amenties and ambience expected for the $600.00 per night plus room rate. The room service menu is good but a little to PanAsian. Could do with a little more versatility, though there are a few \"midwestern\" options. The bed and linens - excellent - better than home. I slept like a baby. The bathroom is fantastic - way better than the Four Seasons. Just take my advice and make sure they bring you your car on time! I luckily was able to catch another flight 30 minutes later and it didn't really affect my trip - but if I had bee going somewhere else it could have been a real issue.", "Date": "July 20, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Canton, MI", "Title": "“Beautiful Hotel”", "Author": "beach47", "ReviewID": "UR3682250", "Content": "My husband, 10 year old daughter, and I just returned from a weekend at the Chicago Penninsula Hotel. It was great! The hotel was beautiful and the staff was wonderful! While we were checking in, my daughter was playing with her 2 American Girl dolls. One of the people at check in noticed and sent up 2 little bathrobes and 2 little beds for the dolls without us even asking for it or being told about it! Also, after returning from dinner that night, we were pleasantly surprised to find a note not only welcoming us, but cookies, gummie bears for my daughter, and a fruit tray for us! We loved the hotel also because of all the little details to attention. We tried the chocolate buffet one night as well...which is not to be missed! It was excellent! We stayed in a Grand Deluxe king room. It was a very nice room..the only thing is, it is a little tightly spaced, but not too uncomfortable. I also tried the spa, and it was very nice as well. The exercise room and pool area had a very open feel too it. Overall, it was a great hotel and I would highly recommend it to anyone.", "Date": "July 19, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Pure Heaven!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3679132", "Content": "We stayed here for two nights-our wedding night and one more. You would have to pry us out of the room because we didn't want to leave! We were pleased to find an upgrade, and waiting for us in the room was champagne, chocolate-covered strawberries, and Blackout cake we requested from the Cheesecake Factory (that we were not charged for!). The room itself was stunning and we couldn't believe the door bell, lighting system, and master bath, bigger than our livingroom in our apartment. The concierge was able to make us a dinner reservation (and when we arrived, I overheard them on the phone saying they were booked) and arrange a car to take us home, which ended up being a stretch limousine. Everything about the hotel was classy and wonderful, yet warm and friendly. We are hoping to save up enough to make it back next year!", "Date": "July 18, 2005"}], "HotelInfo": {"Name": "The Peninsula Chicago", "HotelURL": "/ShowUserReviews-g35805-d225105-Reviews-The_Peninsula_Chicago-Chicago_Illinois.html", "Price": "$366 - $825*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">108 East Superior Street</span>, <span class=\"extended-address\">at North Michigan Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">Chicago</span>, <span property=\"v:region\">IL</span> <span property=\"v:postal-code\">60611</span></span> </span> </span> </address>", "HotelID": "225105", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/fa/d0/4c/welcome-to-the-peninsula.jpg"}}