{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Florida", "Title": "“Great Hotel!”", "Author": "redgirl4ya", "ReviewID": "UR126568347", "Content": "I read the reviews before booking this and trip advisor was right once again. This hotel is eco friendly, had Miami charm, and definetly the best Hampton Inn I have ever stayed at. They upgraded me since I am a Hilton Honors Gold member. We had a spacious suite and the decor was nice. The hotel is near shopping and great food! I will stay here again. The staff was fantastic. Keep up the good work \"Aerial\" :)", "Date": "March 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gainesville, Florida, United States", "Title": "“Amazing”", "Author": "Keith D", "ReviewID": "UR126442318", "Content": "I love staying here - great location and great property. Everything I need and more.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "NJ", "Title": "“New and nice, but not full Service, area a bit sketchy”", "Author": "PT8", "ReviewID": "UR126441557", "Content": "Hampton Brickell is a new 2011 hotel. Reception, common areas, breakfast, meeting rooms are all of Floor 6. Parking garage below 6. Rooms are quite nice, and an ultra modern bathroom. Breakfast a step up from Springhill Suites. While the hotel has no restaurant, you are close (2 blocks) to nice restaurants such as http://doloreslolita.com/. You walk to Dolores by exiting right out of the hotel. BUT exit left out of the hotel toward the train and Publix, and the area is a bit sketchy", "Date": "March 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NoVa", "Title": "“Impressive \"boutique\" hotel”", "Author": "HoosTravelin", "ReviewID": "UR126423796", "Content": "Spent one night at the Hampton Inn Brickell (Sunday night) after staying in South Beach over the weekend. Even with the high expectations from reading reviews on this site, I believe this hotel actually exceeded those expectations. I think this is probably the best H. Inn I've ever stayed at (although I haven't really stayed at that many). Very modern, and eco-friendly, with a boutique feel to it. The hotel must be pretty new, based on its appearance. The lobby is on the 6th floor, and is very inviting. The staff were very friendly and definitely helpful. There is a lobby bar and a pool on that floor. There is a rooftop bar as well, but I didn't make it up there. As a gold member, I got upgraded to a studio suite. Pretty nice suite! Not huge, but sufficient. The suite had a small pantry area with a separate sink and small refrigerator. Comfortable bed, shower with really good water pressure and a nice-sized TV for the size of the room (estimating 40\") that would swivel to give you the best view from anywhere you were sitting (or laying). The hotel was very clean, from inside the room to the lobby and the hallways. The location was ideal - within walking distance of Mary Brickell Village, with lots of shops and good restaurants - and close to the Metro Mover (the free tram that travels throughout the downtown area). I would definitely stay here again, and have already recommended it to others. I agree with the high ranking on this site.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rising Fawn, Georgia", "Title": "“More than what you'd expect for the price”", "Author": "soarjean", "ReviewID": "UR126216828", "Content": "Fabulous rooftop bar, lobby is upstairs, wonderful views, all new hotel. Within walking distance of most of downtown (on the bay) Miami. Great restaurants just around the corner and just off the interstate.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ann Arbor, Michigan, United States", "Title": "“Nicer than I expected”", "Author": "LRG355", "ReviewID": "UR126143684", "Content": "I didn't expect the hotel to be as nice as it was. Clean, new, very nice staff (especially housekeeping), good free breakfast. Would also have been great to have some food at the bar. Nice having the pantry to buy drinks and goodies to snack on.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pueblo, Colorado", "Title": "“Business trips”", "Author": "Kathi C", "ReviewID": "UR126119418", "Content": "Hampton Inn & Suites is in a great neighborhood. Plenty to do and eat within walking distance. Feels safe! The staff is very professional and delivers high quality customer service. They have been very accommodating for our large business groups.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Best. Hampton. Ever.”", "Author": "Rgoodwi3", "ReviewID": "UR126080676", "Content": "A beautiful new hotel in a great neighborhood. There are tons of restaurants and nightlife and it's right next to the Brickell train station. I stay here regularly for business and have never been disappointed.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Treasure Island, Florida", "Title": "“Art Deco upscale hotel”", "Author": "sea4metoo", "ReviewID": "UR126019183", "Content": "My wife and I have been travelling for over 25 years and this is one of the best hotels we have had the opportunity to stay in for a 3 day weekend. It is centrally located to many fine restaurants and drinking establishments. The hotel itself is designed in art deco with various types of artistry around the hotel. It has a nice exterior pool and lounge area. Full hot breakfast each day and a fully equipped business center. We were pleased with the suite, the employees attention to detail and the quality that this hotel has to offer for the price. Because there are other hotels in and near the downtown area that cost more and offer less.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "kent", "Title": "“Good hotel in downtown Miami”", "Author": "KentFred", "ReviewID": "UR125938399", "Content": "Stayed three nights pre cruise. Location is good with the metro mover 2 minutes walk with shops (Publix, Walgreens) and restaurants all within 5 minutes walk. Stayed on top floor which was ok as the lift was very fast and efficient. Breakfast was a nice touch with hot food if required. Pool area was adequate as unless you are wanting to do a few lengths before breakfast.Sun on the pool area during the afternoon and evening for sun bathing. Lots of loungers available and shaded areas. Room was a bit small (we reserved a twin room with upgrade if available which was not offered or mentioned and after a 12 hour flight I could not be bothered to ask). I agree about the the toilet paper and the toilet seat was loose. Beds were comfortable.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Greenville, South Carolina, United States", "Title": "“Amazing Hampton Inn & Suites!!!”", "Author": "Judith A", "ReviewID": "UR125937804", "Content": "You will not believe that this is not a full-service hotel! With a rooftop pool and hot tub with an indoor/outdoor bar, this hotel boasts spectacular views along with an excellent location. Our room was incredibly spacious and tastefully decorated (opt for the suite and you won't be disappointed -- VERY large with a fridge and microwave plus a pull-out sofa!). The artwork throughout the spacious lobby is worth looking at by itself, and the staff are all courteous, friendly and extremely helpful. The free Metromover rail is directly across the street and makes travelling downtown Miami a breeze (my 13 year old and I used it often and it is VERY safe and clean!), and there are some excellent restaurants within walking distance. Being only 3 1/2 miles from South Beach and only a 15 minute drive from Coconut Grove made this Hampton the best centrally located hotel, and we can't wait to stay there again!!", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“New and very clean”", "Author": "SandyEva1", "ReviewID": "UR125929643", "Content": "We enjoyed our stay here. Everything was very new and clean. The staff was very pleasant and helpful. We always enjoy the breakfast waffles. The rooms seemed a little small, but that was just fine for the 2 of us.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Baltimore, MD", "Title": "“Awesome location, new hotel, decent rooms”", "Author": "fin_essential", "ReviewID": "UR125808581", "Content": "This hotel is located is in a prime spot. it is conducive to going out and not having to worry about driving, with great restaurants and nightlife. The hotel itself is nice in that it is new and for the most part it was a nice place to stay with a couple quirks. The free breakfast offerings are pretty good, they even offer to go snack bags which is nice. Decent coffee is available 24/7 which is nice. The in and out parking privileges are awesome, especially for those that don't care to valet. The staff is very friendly and hospitable and make you feel welcome. Ok, so a few gripes, the pool is tiny, seriously. The sheets felt like sandpaper, and the toilet seat was too small for the toilet making it seriously awkward. The only other thing is that there are a lot of items like the phone and clock that give off bright light, which was annoying. If some of these problems were corrected I would give this 5 stars. But sandpaper sheets are not fun. Overall it is a great hotel. If you aren't there to sleep or if you can sleep easily anywhere then I would definitely recommend it. Otherwise, you may want to shop around a bit While there go to Perricones market, awesome sandwiches, awesome desserts. Also Balens for HH, $3 beers even imports. Stay away fr", "Date": "March 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Guilford, In", "Title": "“Outstanding Service!”", "Author": "Lisa K", "ReviewID": "UR125773288", "Content": "Great hotel, great location, very helpful staff. Will definitely return.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pound Ridge, New York", "Title": "“Look Forward To Coming Back”", "Author": "dankaprodu", "ReviewID": "UR125717597", "Content": "The room is first rate and surprisingly affordable, the staff very friendly and the lobby fascinating, especially to art lovers. The hotel is steps away from dozens of restaurants and lots of night life but is just far enough away not to be disturbed by it. Missed going in the pool - next time.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "clauotero", "Title": "“Simply amazing”", "Author": "clauotero", "ReviewID": "UR125712920", "Content": "CanÂ´t beat the location, we walked everywhere. The mary brickell area is two blocks down the street. The rooms were clean and modern. The breakfast was great !!! Internet connection was good. Staff was helpful. Only suggestion is to have a small fridge in the rooms for mini bar, or grocery pruchases besides that everything was amazing. Will stay here again and recomend", "Date": "March 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Key West, Florida", "Title": "“Incredible hotel all the way around!”", "Author": "Amber D", "ReviewID": "UR125626057", "Content": "We picked this hotel after reading the positive reviews and it's convienent proximity to the Metro Mover to get us to the American Airlines Arena to go see Michael Jacksons Immortal Cirque de Sole. This is a brand new hotel. It is a \"green\" hotel so they are eco-concious in every way. Every single thing is perfect starting with the neighborhood. Parking is only $18/nt and breakfast and a free drink at the bar were included. The rooms were spotless. The staff was very, very pleasant and the service was impeccable. The rooftop pool is very nice with a hot-hot-tub and a couple of covered cabanas. One thing that would be nice is if they served beverages and snacks during the day. Other than that this hotel is next to perfect. It feels like a five star hotel but with 3 star rates. I will definitely stay here every time we travel to Miami and would recommend it to everyone.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Jupiter, Florida, United States", "Title": "“Best on Brickell”", "Author": "Joe A", "ReviewID": "UR125610784", "Content": "Great hotel at a great price in an awesome location. Thie is NOT your typical Hampton. This is an Art Deco Miami style Hotel at a great price. I come down to Miami 2-3 times monthly for business. The hotel location is great! My wife comes with me and is close to all the action in Downtown/Brickell Miami area. She walk everywhere as I have the car. Lots of great restaurants within walking distance. My favorite is Mare Nostrum....incredible food And atmosphere. We truly look forward to our visits! This is now my only Miami Hotel.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Perfect in every sense of the word”", "Author": "COLEMAN A", "ReviewID": "UR125595083", "Content": "Great location, friendly staff and just an all around nice Hilton hotel. I would surely recommend this Hilton property to anyone. My room was ALWAYS clean and smelled fresh upon my return each day. The views the hotel have to offer are breath taking and the happy hour is just what the doctor ordered. Great Great Great!", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“Great stay in Miami!”", "Author": "tired_travel_guy", "ReviewID": "UR125593941", "Content": "The hotel staff are always very accommodating and the rooms are always clean. I would recommend this hotel for any traveler who wants to stay in a great eco-friendly hotel while in Miami.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Port Charlotte, Florida", "Title": "“Nice and Convenient Place to Stay”", "Author": "jetbiker", "ReviewID": "UR125514841", "Content": "My husband and I stayed here during the International Miami Boat Show on Februrary 17 and 18, 2012. We reserved a standard room at $310/night, which was pricey. The room was nice and roomy. The only complaint was we were \"fighting\" with the comforter during the night. They should use lightweight ones. There was a blanket in the closet, which we should have used instead. I swam in the pool...the water was cold as well as in the hot tub...but very nice otherwise. The service clerks and conceirge were very helpful. We ate the hot complimentary breakfast which was very good. The food included eggs, sausage, waffles, cereal, fruit, pastries, juice, and coffee. The Mary Brickell Village was within walking distance along with several restaurants. There was a metro system nearby but we used our car. Parking is additional at $18/night. The parking deck was convenient to the elevators. There were conference rooms and a bar area for meetings and entertainment. We would stay here again and recommend this hotel to anyone who can afford to stay here.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fayetteville, Tn.", "Title": "“Wonderful Stay”", "Author": "crabbyannie", "ReviewID": "UR125482282", "Content": "My girlfriend and I stayed here before leaving on a cruise. This is a hidden jewel in Miami. Everything about this place is good. Location, staff, hotel itself, and things around it. We walked less than a block to some wonderful restaurants and shopping. We loved the local night life there and felt safe walking to and from the hotel. We will and have recommended this hotel to friends and will stay here again. The staff here go out of their way to help you and take care of things. They are great and we greatly appreciated them. S. Carter", "Date": "March 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Stayed 1 night prior to cruise”", "Author": "nstitches2", "ReviewID": "UR125423607", "Content": "We gave the address to our cab driver and he found it easily. The room was very nice and had comfortable beds. We enjoyed the breakfast in the morning. Publix is an easy walk, if you need anything. My only complaint is the front desk tried to get us to take a shuttle from the hotel to the cruise report. The charge was $8.00/person. I thought this was high because I had read that cab fare from this area to the port is about $15.00. We had 4 people. I mentioned this to the man (I believe was a manager, but could be wrong) and he told me that the shuttle takes you straight into the port and that a taxi can not, so we will have a ways to walk with our luggage. He was a little pushy about taking the shuttle. We did not reserve it. The next morning we had the front desk call a taxi for us. We took the taxi and the fare was $13 before gratuity. The cab driver also took us straight into the port right where you drop your luggage off. It's not like the port is blocked off in a certain area for cabs vs shuttles. I feel the hotel person was dishonest vs misinformed.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hertfordshire", "Title": "“Fantastic stay , couldnt fault it”", "Author": "AlexHertfordshire", "ReviewID": "UR125421876", "Content": "Let me start by saying, we have travelled a lot and usually stay in at least 4 or 5 star hotels. This hotel - being only 2 and a half stars i only booked due to its rating on trip advisor. I can honestly say could not fault the place, And boy, am i picky....! Parking, there were loads of places, $18 a night, not too bad in my opinion, the staff were soooo frindly, efficient and helpful. The hotel is new so all very clean and modern. The room was very good, all clean, very comfy beds, good tv , bathroom all clean and shower pressure good. Offers of more towels etc but were not needed. Cot for bAby turned up within being in the room for 5 mins. All very hygienic in the room amd coffee machine provided too along with free tea and coffee in the lobby, ut i didnt realise until we left!! Breakfast, also ncuded and big choice, all covered Nd clean. I have stayed at many hotels, but. Honestly couldnt knock this one. If you book it, you really wont be disappointed. Supermarket, rest and starbucks are all within 2 blocks. Wll defo cme to stay again.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ohio", "Title": "“solid choice”", "Author": "tdoll", "ReviewID": "UR125309702", "Content": "tough location for the taxi to find, I had to find it for him. Good location in the business district and Brickell area provided good restaurant choices, shopping and people watching. Took free peoplemover to Bayside MarketPlace- easy to use and safe. Hotel is well decorated and very good free breakfast. Only issues is lack of refrigerator and no food service, do have a nice lounge/bar. The hallway noise is about the worst I've ever experienced as the doors are very solid/heavy and close loudly, the hall is like an echo chamber as well. Dont stay near the elevator or ice machine if you are a light sleeper. Fix those 3 issues and I'd rate it a 5 instead of a 4.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Amazing Hotel!!!!”", "Author": "Ambrosini2709", "ReviewID": "UR125241854", "Content": "It is a very well located hotel. The breakfast is not a 5 star hotel, but it has everything we use to eat. The waffle machine is fantastic. The only issue is regarding the mini-bar which our room do not has. There was no place to keep our water cold.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Houston", "Title": "“5 star hotel with a Hampton name”", "Author": "VistaHost", "ReviewID": "UR125222018", "Content": "Nicest Hampton in the world great location why would anyone stay any where else if you were in downtown", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Relaxing”", "Author": "Jpm383", "ReviewID": "UR125059646", "Content": "Here for three weeks on business. Complimentary room upgrade for either length of stay or being an hhonors diamond member....but an upgrade nonetheless. Huge \"thank you\" for that! Also fitness center was nice to have. Lobby bar kept me sane! Bartender very friendly and has even stayed late for our group because out work schedule was erratic. I hope she doesn't get in trouble for that! If she does, I'm not drinking there any more.....(ya hear that, Fernandez?....where I come from, bars stay OPEN till 2!", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Very clean and near many nice places to shop and eat!!”", "Author": "Claireab2000", "ReviewID": "UR125006404", "Content": "You won't be disappointed....nicest Hampton inn !!!", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "puerto rico", "Title": "“Amazing”", "Author": "JEISY", "ReviewID": "UR125003444", "Content": "Amazing location within walking distance of great restaurants and a short drive to south beach. This hotel is recently open so everything is pretty much brand new. Very nice staff. Would have liked that the heater in the jacuzzi worked. The bar need it also more variety in brands and flavors, also a bartender that at least smiles, I dont remember the name but the bartender that worked this past weekend feb 17-20 needs needs to step up her customer service to the rest of the staff standards, front desk gave ticket for free drinks so I guess she was not so happy, other than that was a very pleasant valentines weekend getaway.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Grand Rapids, Michigan", "Title": "“Best pre-cruise hotel.”", "Author": "ladyjane550", "ReviewID": "UR124974961", "Content": "We stayed here on 2/10/12. It was my husband's birthday, so they upgraded us to a suite. It was beautiful. The staff was fantastic. It was raining out and we wanted to go out. As we were walking down the street here comes a staff member running behind us, and handed us an umbrella. WOW. Very quiet. Bed very comfortable and room was spotless. Breakfast was also wonderful. We stayed on one night pre-cruise. They have a company $$ that picked us up and took us to the cruiseport the next morning. A wonderful way to start a vacation.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Fabulous--location, location, location!”", "Author": "kreb", "ReviewID": "UR124940910", "Content": "I just returned from a wonderful stay at the new Hampton Inn and Suites in Miami. This hotel is fabulous--great location, nice pool area, fully equipped gym, clean and comfortable rooms. I have stayed at other Hampton Inns, but this hotel is in a class all by it self. The staff was warm and friendly. I would definitely return on my next trip to Miami.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Charlotte, North Carolina", "Title": "“Comfortable and well trained service”", "Author": "usachaz", "ReviewID": "UR124878391", "Content": "There are many places to stay in downtown Miami, but this is one of the best for the price. The staff really cares, which is a nice plus.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great place to stay”", "Author": "Julie992", "ReviewID": "UR124759363", "Content": "I recently stayed here for 3 nights and thought the service was excellent. Very attentive staff and the rooms are lovely and spacious. Great location at affordable prices. And to top it off, there is wonderful original art in the public areas.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "SP", "Title": "“Great surprise”", "Author": "Jen_Sp", "ReviewID": "UR124646101", "Content": "When we booked a downtown hotel we didn't know what to expect, we wanted to stay in South Beach but most hotels were sold out. What a nice surprise! The area around the hotel is just GREAT, full of nice restaurants, a Publix supermarket an shops within walking distance. The hotel itself is new , modern and eco-friendly which means a lot to me, personally. The reception guy was really friendly and helpful, our room was spotless, very clean. All brand new fixtures, carpet, everything. And it was very very quiet. The bathroom had a massage shower head, bed was heaven. For the price we payed it was a great surprise. Would definitely stay there again.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Texas, United States", "Title": "“Great Pre-Cruise Stay”", "Author": "AMCCMC", "ReviewID": "UR124472683", "Content": "We chose to stay at the Hampton Inn Miami - Brickell Downtown for our two night pre-cruise stay. Our cab from MIA was $30 with tip. The hotel has only been open since November 2011, so we understood when the cab driver didnâ€™t quite know what hotel I was talking about! Luckily I had the actual street address, which helped him. We arrived at the Hotel at about 8:30pm and were given a beautiful room on the top floor (the 16th floor). We could even see a bit of Brickell Bay out our window, which I didnâ€™t expect. I wouldnâ€™t hesitate to book this hotel again for a pre-cruise stay. The newness of the hotel itself is definitely a draw, and the convenience of the location makes it a ridiculously easy choice to make. The pool area is beautiful, and the Lobby bar looks out onto it. The bar stayed open until the pool closed at 11. Loved that. For dinner, we walked over to Mary Brickell Village and ate at Burger & Beer Joint. AWESOME! Excellent burgers...rare beers that I have a hard time finding where we live. My only complaint about the hotel was the breakfast. I am HHonors Gold, and do stay at quite a few Hampton Inns. I am usually happy with the free breakfast, but even going down for breakfast at 8:30 both mornings, we were greeted with an empty vat of oatmeal, and NO bananas. Two things I eat for breakfast every morning! We actually laughed about the fact that we were in Miami and there were no bananas. We were there just before the Miami Marathon, so we thought maybe the runners bought out the whole city. :) During our free day in Miami (Friday), we hopped on the Metromover (just steps from the hotel) and rode it down to Omni Station, where we boarded the Beach Max #120 -- limited stops to South Beach for $2. It was a quick trip out to the beach. We ate at Front Porch Cafe, strolled along the sand, did a fair amount of people watching, and then headed back out and found a bus stop back to downtown. There are also two Publix supermarkets within walking distance, so we were able to buy some items for the cruise. The shuttle to the Port of Miami was $8 per person. If we ever cruise out of Miami again, we will definitely stay here.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Giengen an der Brenz, Germany", "Title": "“Stayed a week and a half due to work and...”", "Author": "Jose_Roberto_V", "ReviewID": "UR124333325", "Content": "I stayed at this hotel for a week and a half in late January due to work and the nearness of the hotel to where I needed to stay. Personnel was attentive and diligent. Rooms where always clean and the people in charge of cleaning the room everyday paid attention to details. I will look to stay at this hotel when I am back to Miami and I can recommend it without reserve.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago area", "Title": "“New hotel with lots of great touches”", "Author": "tweeter_23", "ReviewID": "UR124191540", "Content": "This is a great location near downtown. It's slightly outside the downtown center, but at a lower price and with lots of perks. The hotel just opened a few months ago, so everything is new and looks/works great. The complimentary breakfast was really good - many hot and cold options. You also get a free drink ticket for the hotel bar at check-in. My room was very comfortable and had complimentary toiletries in the bathroom. The eco-friendly touches are nice - low flow fixtures, reminders to hang up your towel rather than having it replaced every day, etc. It's just a couple minute walk from the MetroMover and Metro train stations, making it easy to get anywhere downtown from the hotel (and the MetroMover is free). There's a cute little bar/restaurant district just a few blocks away. I would recommend this hotel to anyone staying in Miami.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Brasilia, DF", "Title": "“Great Miami Hotel”", "Author": "Odarci", "ReviewID": "UR124166113", "Content": "We stayed at the Hampton Inn & Suites Miami Brickell for 6 nights (1/22 â€“ 1/28/2012). We arrived early in the morning, after a cruise, so we need to leave our luggage at the hotel greeting area on the first floor because there is no room available at that moment. The first five floors are parking spaces and the hotel lobby itself as well as the breakfast area were located on the 6th floor. The room was spacious and clean with very comfortable beds. The bathroom is functional and clean (it would be better if more hangers were available). There is a metromover station (downtown Miami free transportation vehicle) and a Metrorail (subway) station on the corner as well as lots of restaurants nearby. Two Publix (supermarket) are also available at two/three blocks of distance. There is a very nice business centre at the 6th floor with five computers and two laser printer connected to the Internet. You will need your room key in order to operate the elevators (a security plus). Our room was always perfect when we returned. The breakfast was very nice. The check out was fast and efficient - you just need to leave your room key at garage exit, if you booked with a credit card. A final account statement is available at your room in the last morning. We will certainly stay at Hamptonn Inn Downtown/Brickell again and would recommend it.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Richmond, Virginia", "Title": "“Pleasantly surprised”", "Author": "Tina C", "ReviewID": "UR124133431", "Content": "This is our last night of 4 here and overall it is been very pleasant. However, when I arrived, my bathroom counter had obviously not been cleaned - there was dried up makeup or toothpaste left on it. The next morning I had just gotten out of the shower when housekeeping knocked - I had the privacy lock on - I told him I was just out of the shower. He laughed and said that is all that I have to say. BUT, 5 or 6 more very loud knocks came over the next 20 minutes, all housekeeping. That same morning, our towels were taken but not replenished, so we had to go to the front desk for more that evening. When we complained of all of these, we were told that our stay would be completely free. If this is true, I will most definitely recommend this hotel and will return on future business trips. The bed is one of the most comfortable and everyone was very friendly and incredibly helpful, making my stay in a faraway city less stressful. Location was good with the free metromover a short walk away and plenty of places to choose from to eat.", "Date": "February 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Saskatoon, Canada", "Title": "“Great Service”", "Author": "Riley J", "ReviewID": "UR124028342", "Content": "We stayed for business from January 28th to February 1st, 2012. Because of some business reasons I had three separate bookings, which can cause headaches for some hotels and be very messy with changing rooms and payments. These guys had it taken care of in a matter of minutes with no hassles and no room changes. The Continental breakfast is a nice change from the typical muffins and fruit with omlets, waffles sausage and bacon.... yummy. And the drinks at the bar are cheap even when it's not happy hour. Check out is at noon, which allows you to sleep in after a few drinks on your last night in Miami. There are some nice restaurants nearby like \"Delores but you can call me Lolita\" and the \"Tobacco Lounge\" (apparently the oldest bar in Miami) and its half a block away from the MetroMover. I'm not sure what is standard for Miami, but I thought this place was awesome. Staff was friendly and efficient, and service was impeccable. Highly Recommended.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Manchester, New Hampshire", "Title": "“Precruise Stay”", "Author": "sandylovesCT", "ReviewID": "UR123994027", "Content": "We stayed in Hampton Inn & Suites Miami/Brickell for only one night 1/6/12 before taking off on cruise. Extremely clean, quiet, very comfortable bed. We could not be more satisfied with stay. Staff are attentive & courteous and highly professional. The only thing that could make this hotel perfect is that they need to have a shuttle from airport. That would make it perfect. We rented a car but would have preferred to have a shutte from airport. We will return to this hotel and highly recommend it!!!", "Date": "February 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bloomington, Indiana", "Title": "“Great downtown hotel”", "Author": "rmn812", "ReviewID": "UR123929774", "Content": "Staying in a brand-new hotel is always a great experience in itself, so our stay at the Hampton-Brickell in early January was made even more enjoyable by its attractive art-deco themes and wall art, the spaciousness, excellent breakfasts, services like Wi-Fi, etc. and the very friendly staff. In previous visits to Miami we had stayed with relatives in the suburbs, but this time the hotel's location right in downtown within walking distance to restaurants, shops and the Metro-Mover though still easily accessible to be picked up by friends/family from the suburbs, was a terrific choice for us and our Miami relatives. We highly recommend this beautiful Hampton Inn, one of the best of the Hamptons we've ever stayed in.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“Great value for business traveler”", "Author": "alexaks", "ReviewID": "UR123910724", "Content": "I stayed at the Hampton Inn & Suites Miami/Brickell for 2 nights 1/18 â€“ 1/20/2011. The check in was super fast and efficient. The room was clean and the bed was very comfortable. The A/C is very well designed and keeps the set temperature perfectly without making a lot of noise. The bathrooms are functional and clean, but look more like â€œcontractor editionâ€�, nothing special. Internet access is free and speed is acceptable to check your emails and browse the Internet. Self parking is $18/day with unlimited access. The hotels offers free breakfast which, while not being fancy, is very convenient and is more than adequate to get you through the morning. As for the area, there is Brickell Village a couple of blocks from the hotel with a few restaurants and shops; the hotel is about 1/3 of a mile to the water; there is easy access to public transportation, but I did not use it, so cannot give specifics. Overall the hotel is a good value for a business traveler. Most likely I would stay there again when I am in the area.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hollywood, Florida, United States", "Title": "“A Pleasant Surprise”", "Author": "Alexis R", "ReviewID": "UR123564719", "Content": "We usually book rooms for our corporate visitors at the JW Marriott in Miami. They were sold out and we had to resort to another hotel within walking distance. Although a difference in star rating, we were very pleased with the ambiance, location, decor and service at the Hampton Inn Brickell. I've never seen a Hampton Inn like it! This feels like a boutique hotel - from the lobby to the rooms and the chic Miami style rooftop pool! Of course you also receive complimentary breakfast, wi-fi and afternoon cocktail hour. I would choose this hotel moving forward for our corporate guests and would reccommend it to anyone. The rate is a bit higher than other hotels in the area, but you cant argue because you get so much for your money here and it is brand new. Not to mention, it is just steps away from Mary Brickell Village restaurants, shops & night life.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“The rooms are beautiful and the bartender (Tiffany) is a \"ray of sunshine\" in a busy city”", "Author": "iandonovan1", "ReviewID": "UR123378997", "Content": "The 1st ever Hampton Inn bar is a huge hit mostly because the bartender Tiffany is a fantastic mixologist and hostess.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“Awesome”", "Author": "Jacob O", "ReviewID": "UR123375192", "Content": "We had an amazing experience with this Hampton Inn. It was one of the nicest hotels we have ever stayed at and the gentleman at the front desk was very helpful in giving us the best price he could on such short notice. The staff there was extremely helpful and would recommend this hotel to anyone traveling to the Miami area. Also has the best continental breakfast on the planet.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rockford, Michigan", "Title": "“A Great Find and night and day difference from Courtyard Marriott”", "Author": "Kris J", "ReviewID": "UR123369602", "Content": "Outstanding experience this location. My first night in Miami I foolishly stayed at the Courtyard Marriott. Big mistake. Took gamble changed hotels at fell safely into the warm and luxurious arms of the best Hampton Inn I've stayed in. I could not ask for a more enjoyable stay. Stay Here fellow per diem road warriors, stay here.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester Center, Vermont, United States", "Title": "“An unforgettable 4 day getaway!!”", "Author": "Rich W", "ReviewID": "UR123326417", "Content": "BVICAPT Having a short time to get to the warm weather before winter we chose the new Hamton Inn & Suites Inn Bricknell..What a pleasant suprise. From check in to check out everything was nothing short of perfect. It is amazing that such a large operation can get it RIGHT in such a short period of time. The check in on the 6th floor above the parking made everything so easy.The front desk staff were dressed to the 9's and were very helpful and polite.Having the pool and spa and the buffet breakfast on the same floor made everything very convient. The pool was extreemly well kept and at the right temperature. Loved the buffet breakfest.Different every day except the make your own waffels!! The houskeeping staff was very friendly and there were always staff in the common areas cleaning. Our room was always perfect when we returned. The hotel is within walking distance of many fine resturants. ALso you can drive to South Beach in about 20 minutes and getting to the Keys is convient. We will be back. Congratulations on a great operation Congratulations on a great opening.and much succes in thefuture", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boca Raton, Florida", "Title": "“A weekend at the new Hampton Inn Miami/Brickell”", "Author": "Harvey K", "ReviewID": "UR123271738", "Content": "We had a truly exceptional experience at the sparkling new Hampton Inn in the bustling Brickell area of downtown Miami.The accomodations were outstanding and the staff was hospitable and eager to please. We were particularly impressed with the creative art displayed throughout the hotel and the art deco theme as well. This was probably the most luxurious Hampton Inn I have ever stayed at. The location just steps from many outstanding restaurants and nightflife makes this a real desirable hotel to hang your hat. I would strongly recommend this Hampton Inn on your next trip to downtown Miami. There is ample indoor parking and our entire stay was flawless.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Portland, Maine", "Title": "“Great new property”", "Author": "MRVEGAS711", "ReviewID": "UR123229336", "Content": "The Hampton Inn Brickell is just 4 months old. It has that new car smell going!! Rooms are nice and the lobby area is simply beautiful. Great artwork on the walls lead to a fine pool and jacuzzi. Would stay here again for sure.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“BRAND NEW HOTEL - AWESOME!”", "Author": "Francois D", "ReviewID": "UR123202145", "Content": "New Hotel - Excellent location close to the Brickell area. We had a huge suite with a nice view.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Orlando, Florida", "Title": "“Great Value for Miami and on the Higher End of Hampton's.”", "Author": "CCTVTrainer", "ReviewID": "UR123126908", "Content": "Let me start by saying I've stayed at just about every Hampton Inn in the Miami area and this one is tops! I know it's a brand new property but you cannot beat the rates for the downtown area, staff was nothing but nice, and it's a beautiful new property! I've stayed in Hampton's in almost every state and this one makes you feel your staying in mid to high level property. Lot's of restaurants in walking distance and a decent amount that deliver too. I would highly recommend this property as it stands right now. The one complaint I do have is that my days start early and I was ready to eat breakfast at 6:00 am which is when Hampton is supposed to start serving it. Most days I stayed it was closer to 6:15 to 6:30 before they had everything out. So if you start your day early like me good luck taken advantage of the free breakfast.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Fantastic Bar Tender!”", "Author": "Mike B", "ReviewID": "UR122955173", "Content": "This hotel provided a fantastic atmosphere to relax after a long day of work. My night was made considerably better by the warm personality of the bartender. Â The art of conversation is a diminishing skill among the service industry these days and I found this hotel to buck that trend in a major way. Â This place has my loyalty for life!", "Date": "January 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Usa, Japan", "Title": "“Perfect New Years hotel”", "Author": "BradAndLee", "ReviewID": "UR122936673", "Content": "Clean & comfortable hotel with real business center. The hotel also offered very pleasant pool/jacuzzi area...loads of sunny seating. The location was excellent a 2 min walk to Miami's Peoplemover & Metrolink or less than 5 min walk to more than a dozen resturants ( & a few bars). Down town was crazy for new years & the hotel was a quite refuse from the parties.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Panama City, Panama", "Title": "“Excellent Hotel”", "Author": "Reinaldo-1969", "ReviewID": "UR122823387", "Content": "When looking for a \"room for five\" it is not always easy to find good options. This hotel offers great brand new suites for families in the great location of Brickell Downtown. Outstanding beds, comfortable pillows and rooms with a very good size, including a big flat screen TV, a fridge, a coffee machine and a microwave. We could not use the pool and the gym but looked very nice. Overall this hotel offers a very good service. Highly recommended for families or any other type of trips: business, couples, etc...", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“Hampton Inn - downtown Miami”", "Author": "Amy R", "ReviewID": "UR122431040", "Content": "Never stayed in \"downtown\" before- but was easy access, lots of restaurants nearby - all in all, a great stay. Beautiful hotel, great amenities, super friendly and helpful staff.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Potomac, Maryland", "Title": "“The Bar Is Raised”", "Author": "Shelah L", "ReviewID": "UR122425472", "Content": "This Hampton Inn is brand new and everything in the hotel reflects it. The registration level is bright, interesting art work is displayed there, and there are coffee urns that are always full. The bedrooms are \"green\" and the mattresses are extraordinarly comfortable. The pool is welcoming, chairs and towels are provided for guests and the depth is four-and-a-half feet. The staff is ALWAYS delightful! It's an easy ride to Miami International Airport.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Sophisticated yet family friendly”", "Author": "leslieberger", "ReviewID": "UR122413839", "Content": "Big bang for your bucks: modern, clean, friendly service, excellent location near superior restaurants and the highway.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cedar Grove, New Jersey", "Title": "“jgrandaer”", "Author": "juliaripps", "ReviewID": "UR122399608", "Content": "We stayed 3 nights at the Hampton Inn Brickel. We found the rooms comfortable and clean. We especially enjoyed the hot breakfast and the pleasant atmosphere of the breakfast room.Although the hotel seemed to be in an office bldg area we appreciated that there were also residential buildings close by. It was very nice to be able to walk to good restaurants.We give this Hampton Inn a triple A rating", "Date": "January 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“Good value in Miami”", "Author": "divachitown", "ReviewID": "UR122362762", "Content": "We stayed for two nights at the end of December. It was very clean, nice and my favorite was the pool area! The breakfast also had plenty of options for adults and children. We did use Hilton points for our stay and were reminded of this a couple of times, in terms of what we get for that, which I thought was a little strange. The first night we were in a room next to the utility room and there was a banging noise all night. They did easily accommodate us and move us to a new room the next morning. It is a new property so the staff is very nice but some of them need further training and skill development to handle the stress in busy times. We left on New Years Eve Day and they seemed understaffed and/or needed managers in the busy areas to keep things moving. There is also a weird set up on the Lower Level where it seems like you are checking in but they don't give you room keys and then they send you to the sixth floor to check in. I recommend going directly to the sixth floor which is where you check in. All in all I think it is good value for Miami and a good option for a couple nights.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Crusin”", "Author": "Mskaos", "ReviewID": "UR121889053", "Content": "I found this hotel before it was even open so there were no reviews and I was a little nervous. It was easy to find with GPS, very convinient to the metro rail and bus stations. We didnt eat or do anything near the hotel, we went to south beach, so I can't comment on that. Very close to the Port of Miami a 10 minute cab ride. Rooms were large, clean and comfortable. Breakfast was pretty standard (waffles, eggs, bagles, cereal). Staff was very helpful/polite. Couldnt get the wireless to work in the room when it said it would, it did work in the lobby though. And when we went to print something in the business center the computers froze up. We didnt use the pool but I did step out there and it was absolutely beautiful! The layout is alittle odd. You go in on the street but then have to go up to floor 6 for the lobby. It looked like they were still doing some finishing touches while we were there. Our drain in the shower was very slow draining. All in all it was more than I could have asked for.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“there for weeks on business”", "Author": "raleightraveler_123", "ReviewID": "UR121883047", "Content": "Nice, new facility. Great staff, the breakfast ladies, desk staff, hospitality staff all were great. I was there on business for almost 6 weeks, and got to know a lot of the staff. Be aware the the basic room does not have a fridge or microwave. Overall if I need to go back to Miami that's where I'll stay.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Very nice, new, mid-price hotel”", "Author": "wayway2muchtravel", "ReviewID": "UR121834486", "Content": "Excellent location walking distance to all the clubs and restaurants, plus a beautiful room and a great view.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Downey, California", "Title": "“Great weekend staff”", "Author": "Gregory A", "ReviewID": "UR121380945", "Content": "I came in from Los Angeles for cruise to Jamaica with group of 30. The moment I got here last Friday night the staff were so efficient, helpful, and the all went the extra mile for us. Staff members Oscar, Vanessa, and Eric were like family to us. Our breakfast days were excellent. I left my glasses at computer station, Vanessa called my room to inform me immediately to retrieve them from front desk. Oscar made me maps, called good cab drivers, and put in touch with the right people and things for a first time visit. Eric did great work initially when I had trouble with a bad taxi driver from airport. I left here last Saturday & returned & I decided to stay over another 3 days because I felt so at home & comfortable here. I am coming back to Miami next summer & I will always stay here at the Brickell!", "Date": "December 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mexico", "Title": "“Very nice!”", "Author": "diankito", "ReviewID": "UR121264544", "Content": "Beautiful hotel, location and service! A little noisy when there are people in the hall. I'd stay there again.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Looks and Acts Like a Hyatt - Great Hotel to Begin a Cruise”", "Author": "Hohja_md", "ReviewID": "UR121138125", "Content": "As noted by other reviewers, this is a newly opened property. That said, everything is fresh and new and that is sometimes hard to beat in a hotel. We used the property as \"jumping off\" point for our Caribbean cruise. Finding the hotel was out greatest challenge as it sits directly off of S. Miami Avenue. Miami has unique naming of its streets (i.e., SW 11th Street, SE 1st Avenue) and that was confusing. However, once we located the property, we were all set. The hotel sits on a quiet street directly in front of a high rise condo building and a bank on the corner. The actual hotel starts on Floor 6. You enter the building and are greeted by a building security attendant who directs you to the elevator and the hotel. The extra sense of security is a nice touch. Our room was on the fifteenth floor overlooking the northern Brickell area and was perfect in all ways. Check-in was quick and efficient, plenty of available on-site parking ($18/night charge), the room/bathroom was clean and there are lots of nearby dining options. Our room was not large, but well designed and efficient for 2 travelers. Our bed was comfortable with many extra pillows. The bathroom was clean and did not have a tub; rather, a large double door shower. Plenty of sink counter space. The property is unique in that you need your room card in order to operate the elevator - a very nice security feature. The area is quite safe. You can easily walk to many different dining options and specialty stores as well as a Publix grocery store. The area is very active in the evening and walking north along S Miami Avenue is best. Two blocks east is Brickell Avenue, a main thoroughfare, which has many high rise office buildings and condos. Breakfast is included in the daily rate and was quite good - lots of both hot and cold ala carte options. There is a bar on the 6th floor as well. We used the hotel as a starting point for a cruise from the Port of Miami. Taxi fare to the port was $15 and we where there in less than 10 minutes. Our daily rate was quite reasonable as well. Miami hotels can get quite expensive and our rate was about $110 including taxes. I think once this property becomes established, the rates will increase dramatically. This property looks and acts very much like a Hyatt as opposed to a Hampton. Highly recommended.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“No bathtub!!!!”", "Author": "dino4897", "ReviewID": "UR121100104", "Content": "Excellent location. Near shops bars restaurants major highways and public transportation. The only downer . . . no bathtub. I enjoy soaking in a hot tub after walking around all day. Otherwise i would return", "Date": "November 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Paper walls cold breakfast”", "Author": "lindsaynd09", "ReviewID": "UR120525206", "Content": "If you want sleep, don't stay here. Paper walls. Nice hotel design, free computer use. Breakfast was ok, not good. Cold potatoes and old bananas among other foods. Coffee was good. Nice gym. Doesn't do anything about the noise at night. Would stay again if management makes an effort to minimize noisy neighbors.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gothenburg, Sweden", "Title": "“Good choice for families”", "Author": "ma65", "ReviewID": "UR120509726", "Content": "The hotel is only half a block from the Brickell Metromover and Metrorail stations, which makes it very convenient if you want to move around Miami without a car (yes, it is possible!). Metromover is free of charge, by the way. Lots of pleasant restaurants within a short walking distance. We had a large room (queen studio suite) with two queens and a sofa-bed, which was very comfortable for a family, as were the kitchenette with fridge, coffee maker and microwave. The dÃ©cor does not really fall in my taste, but it does not bother me for a couple of nights. The beds were very comfortable (not surprisingly, as the hotel had only been open some weeks). A good complimentary breakfast was served every morning, a pleasant touch. Internet is also complimentary and effective.The swimming pool is not large, but good enough for the children to have some fun. Finally, the staff is friendly and helpful. For the prices they offer, I would definitely be back!", "Date": "November 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“This place is awesome”", "Author": "shaunc64", "ReviewID": "UR120374890", "Content": "I have stayed all over Miami and not one of those hotels compares to quality, location, amenities and the friendliness of the staff. I have already booked my next 2 trips at this hotel.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, FL", "Title": "“Great value for downtown Miami”", "Author": "Circusdog", "ReviewID": "UR120232774", "Content": "I stayed at the Hampton Inn & Suites on SW 12th St last week and thought the hotel was great value for money. It's located within approximately two blocks of the Mary Brickell shopping and dining area and within a short walk of the US-1 business district and the Miami metromover monorail system, making it centrally located for business travellers and tourists alike. The hotel had only been open a month during my stay so the parking garage barriers weren't working correctly but this didn't cause me any problems. The parking garage was very well lit - parking was an absolute bargain for Miami at $18. The elevators are swipe card access-only for guest floors, which I thought was a very good security feature. The hotel is vibrantly decorated with a modern, relaxed feel. Although there are lots of bright colors it was tastefully decorated and well laid out. Unfortunately, I didn't get to use the gym, so can't comment on the equipment or layout. The breakfast was included in the price and was satisfactory. There was a selection of hot foods (sausage, eggs, etc), waffles, fresh fruits, yoghurt and coffee. The hot meal on my first morning was luke warm but still edible. The next day the meal was hot .The breakfast staff were attentive and friendly and the eating area was very clean and well laid out. The seating area was a mixture of tables and a breakfast bar, and well spread out. My suite felt airy and was well lit with natural light, despite being directly over the road from a large apartment building. I kept the net curtains closed for the majority of the time for privacy. The room had a number of nice touches, such as chaise lounge in a corner that doubled up as a sofa. The large screen TV was flat against a wall and folds out to allow you to watch it in bed or from the chaise. The small entry area had a refrigerator and work surface, which was nice to throw keys, phone, paperwork on. I also had a large desk with table lamp to use in the room. The bathroom had a bath/shower and toilet and plenty of lighting. I noted the bathroom door had rubber stoppers on the moulding to stop the door from making noise when closed - a great touch to stop you from waking up your partner in the middle of the night when nature calls. The large king-sized bed was very comfortable. I used the complimentary wireless internet connectivity and found it to be one of the most hassle free I'd used to date. It was fast enough to let me video conference without jerkiness or stuttering. Following my experience, I intend to make this hotel my regular accomodation when I'm in Miami on business.", "Date": "November 6, 2011"}], "HotelInfo": {"Name": "Hampton Inn & Suites Miami/Brickell-Downtown", "HotelURL": "/ShowUserReviews-g34438-d2253238-Reviews-Hampton_Inn_Suites_Miami_Brickell_Downtown-Miami_Florida.html", "Price": "$164 - $310*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">50 SW 12th Street</span>, <span class=\"locality\"><span property=\"v:locality\">Miami</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">33130</span></span> </span> </span> </address>", "HotelID": "2253238", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/33/2d/e6/hotel-exterior.jpg"}}