{"Reviews": [{"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Munich, Germany", "Title": "“Not my first choice in Mexico City”", "Author": "Anna H", "ReviewID": "UR125283741", "Content": "The hotel was said to be newly restored. That is true ... they tried their best and it was okay ( not high class, but equipped with new stuff and in a nice way ). BUT the work on the restaurant was still going on .. it was so noisy that during the day it was better not to stay there. They are building a new restaurant in the courtyard of the hotel ... if this is a good idea the future has to show, maybe it will be very noisy in the night. Our room was dark, but very spacious. It had a small kitchen and that was great. The hotel staff was friendly. I think the hotel might become better when all the work is finished. But the situation of the rooms ( many are quite dark ) might not change; so my advice is to ask for details before you book a room. I gave a low rating because the price is too high for what you get. We had shortly before another hotel in Mexico City ( center ) for less then half the price. Roma is a more costly district in Mexico City because it is \"in\" , but still the price was too high. But let us give the hotel a chance and see how it developes in future.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“terrible experience”", "Author": "ss2dc", "ReviewID": "UR122321003", "Content": "The chemical smell of air freshener in our room was overwhelming. The lighting in the bedroom was so poor that it was impossible to do anything other than unpack bags by the light of 40 watt wall sconces. The beds were so hard, it was like sleeping on a concrete floor. Desk personnel in the evening were both efficient and helpful but generally speaking, the place was a dump.", "Date": "December 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "blackfoot", "Title": "“great hotel”", "Author": "samdeck", "ReviewID": "UR121841022", "Content": "We took the wife's parents and booked 2 villas. One was the hillside and the other the river. Both were fabulous. From the pick up at the airport to being dropped back this was the one experience where it is difficult to imagine how the resort or the staff could have been improved. Everyone was so friendly and helpful and everything was perfect. That includes the restaurants and spa. Special mention should be made of Jo. She was wonderful. 24/7 butler service is hard to go past. We will go back.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Sverige", "Title": "“Warning! Don't book this hotel!”", "Author": "MrsMSverige", "ReviewID": "UR117695727", "Content": "Unfriendly Staff. we booked tje hotel 6 months before we arrived and when we got there they told us there was no booking. After a couple of hours we finally got our room. We had to make several phonecalls to sweden on our own cellphone! The room was prepaid! The room was terrible! Bedbugs, dirty carpets and dust everywhere. It was à terror to spend our last days of our vacation in such à bad \"hotel\".", "Date": "September 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Berkeley, California", "Title": "“Great location, great neighborhood”", "Author": "wbreuer", "ReviewID": "UR97232094", "Content": "This is my second stay here. Nothing fancy, but clean and functional. Staff helpful with suggestions on where to eat, etc. Faces a delightful park with fountain. Restaurants and cafes abound. Since I was last here in fall of 2009, two new bookstores have opened up. Great neighborhood for walking. Can also explore La Condesa, nearby. A good launching pad in a great city.", "Date": "February 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Seattle", "Title": "“A Good value, comfortable hotel in a quiet, convenient location”", "Author": "JimFromSeattleWA", "ReviewID": "UR95708959", "Content": "With my wife the first night, I stayed another 4 nights in this clean, quiet hotel in the Roma area. The location is near restaurants and shopping, with 2 Metro stops each about 8 blocks away. For the price, this is a very good value. The staff was very helpful for advice and directions. I would certainly stay again, and highly recommend it to others.", "Date": "February 6, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "minneapolis, mn", "Title": "“This hotel does NOT look like it is portrayed in the picture.”", "Author": "carolann_harrison", "ReviewID": "UR94318292", "Content": "This place was such a dump that I did not stay (I went to the Maria Cristina instead). The bed was rock hard, the furnishings were incredibly dated. I will say it was clean, but that's about it.", "Date": "January 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "5", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Poor Service and Room Maintenance”", "Author": "TravelMexico_11", "ReviewID": "UR90227479", "Content": "TV did not work, remote did not work, cable did not work, very dark room and washroom light did not work. Service pretty poor. Did not have the room i paid so they downgrade me instead of upgrade me. They did not reimburse me the money even if purchased many nights in advance. I left to other hotel and lost the cost of 5 nights of hotel.", "Date": "December 19, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“I would stay here again. A great location and a comfortable room.”", "Author": "I_Heart_Delicious", "ReviewID": "UR60285567", "Content": "After leaving a noisy, dirty hostel in the Historic Centre we were pleasantly surprised at what we had booked online for only $10 pesos more... HUGE room with a double and single bed (only needed the double bed mind you - but our luggage had a comfortable 3 nights). Free wifi that had a strong signal is always good. The location was great - not exactly in the heart of the city but as Mexico City is so spread out everything was easily accessible walking or via metro. The Square the hotel overlooks is great too, nice for an evening stroll with an icecream from the shop downstairs. The rooms were spacious with kitchenette but the bathroom was tiny, no matter though, the shower had excellent pressure and it was clean.. but our room turned out to have a mouse in it, that lived in the bathroom, and pinched the toilet paper from the bin each night.. once we figured out what was happening we left the light on all night and it didnt bother us again. We told the staff in the lobby on the last night and they offered to switch rooms but as we were checking out early the next morning we opted not to. The staff i think have probably been alerted to this mouse's antics before, they didnt do a very good job of acting surprised, but this could have been the language barrier.. although my spanish is pretty good. I have read in other reviews this hotel has had bed bugs, we did not experience this. For the price (super-discounted online rate of $49usd/night) we are not complaining. If you have not heard, in Mexico they prefer you not to put toilet paper in the toilet, rather in an uncovered bin next to the toilet.", "Date": "April 3, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brooklyn", "Title": "“Great Location - True 2 star property”", "Author": "doogiebklyn", "ReviewID": "UR57085384", "Content": "We ended up at this hotel as their other property was oversold. This location, in Roma Norte, was actually much better than what we had booked. Our room overlooked a park like square where it's located and had a balcony. The room was huge for hotel standards and included a kitchen area. That's where the good stuff stops. The room was dingy and smelled like mothballs and we didn't want to go barefoot anywhere. The bed was only a twin size, very hard, and with pillows as hard as a phone book. My wife woke up with bites from something every morning. We're not sure if they were bed bugs or mosquito bites. The TV is tiny and located on the other side of the room. They give you the remote control at the front desk when you check in. That says it all. The staff was nice and professional. The bathroom was no better. I had to bend my head (I'm 6' tall) to get it under the shower head and the water pressure was horrible. The good thing was that we didn't spent very much time in the room and I would have minded less if I traveled on business. But if you plan to spend more time in the room or going away for a romantic trip, then stay away from here. Last time I stayed at Hotel Del Principado for about the same price in Zona Rosa and that was so much better and included parking, too.", "Date": "February 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sacramento, California", "Title": "“I like the place very much”", "Author": "Braveheart0", "ReviewID": "UR55820568", "Content": "The hotel is quiet, clean, secure, & personable. The room was nicer than we'd expected. The staff was very courteous and the neighborhood & location was ideal for our needs. The staff had a small but functional grasp of English. Breakfast area was convenient and enticing. It is a solid 3 star establishment in my judgement. I liked the competitive pricing. I've paid more for less elsewhere. I'd go back again if and when I re-visit Mexico City. It fits my temperament and tastes well. I'm not high maintenance & appreciate value. Brent", "Date": "February 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "1"}, "AuthorLocation": "parkerbowles", "Title": "“BEDBUGS”", "Author": "parkerbowles", "ReviewID": "UR45331626", "Content": "Really liked this place, liked the location, no complaints at all except that the room had bedbugs! Friend and I both had bites, found them on us in bed. Later found them in my luggage. Had to toss everything. Too bad, because otherwise its a great place.", "Date": "September 28, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Wilmington, Delaware", "Title": "“Not great, but I keep coming back...”", "Author": "From_Delaware", "ReviewID": "UR32560909", "Content": "Most of the negatives you've read here about Casa de la Condesa are correct: shabby rooms in poor condition, pluming or electrical problems, surly staff. And yet I've stayed there three times and probably will do so again. Here's why: As others have said, the location is great on a residential Roma block just a short walk south from Avenida Alvaro Obregon. Not many other choices in Roma are so appealing in this regard. I always request an upper-floor room overlooking the pretty Plaza Luis Cabrera, where I can nap in the hammock to the ambient sounds of the kids in the plaza kicking a soccer ball around. The hotel's rates are great and, when you get right down to it, I'm not in Mexico City for the hotel -- I want to be close to the part of the city I like. So, I put up with the shabbiness and occasionally rude service at Casa de la Condesa and I have a great time. I should note that I haven't felt unsafe in the hotel, and have never had any problems with security. Although I do wish the hotel rooms had a deadbolt or a chain that blocked access from the outside.", "Date": "June 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Australia", "Title": "“Cute, inexpensive, perfect for us.”", "Author": "crayolamagic", "ReviewID": "UR32170048", "Content": "We had a room at the front of the hotel overlooking the street and a lovley park with a fountain. It was not noisy which may be due to the area being more residential than commercial. Our room was cleaned daily. We had a hammock on our balcony and the bed was comfortable. A Mexican continental breakfast was included (note that a continental breakfast in Mexico consists of toast and coffee) and the kitchen staff were lovely. The front desk staff were mostly very friendly and helpful and probably would have been moreso if our Spanish was better. There are a few places to eat but you have to do a bit of searching for them. I would suggest avoiding the Italian on the corner except for drinks as the food wasn't very nice. The hotel is within walking distance of the metro station (about 15 minutes) and the Turibus stops about two blocks away. Overall, I was very happy staying here. Oh, and they played FANTASTIC instrumental versions of tacky songs in the patio during breakfast. Seriously. And there was free WiFi.", "Date": "June 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Great value in an ideal location”", "Author": "mitchell6780", "ReviewID": "UR24384080", "Content": "Just back from a two week trip travelling round mexico and this was possibly the best little gem we stumbled upon. It was myself and a friend and the room was ideal - two double beds, a little kitchenette with fridge - very handy and a microwave. Location is great. Less than ten minutes walk from a number of metro stations and lots of nice little bars and restaurants around in a pleasant setting with parks and fountains. Easy enough to get anywhere but a little away from the hustle and bustle. As a base for exploring Mexico city we found this place perfect and would highly recommend it", "Date": "February 8, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Run down place. Incompetent, mean and unhelpful staff!”", "Author": "TeneraTraveler", "ReviewID": "UR22386098", "Content": "We were told that the reservations that we made (and paid for) would not be honored because there were no rooms available. They offered to send us to a different hotel owned by the same company. We refused, and went to a big chain hotel instead. The best part was when I called to get a refund, they told Hotels.com that they moved us to a different hotel and even paid for the taxi (a total lie, in fact, their taxi driver ripped us off). So they refuse to issue a refund. The place looks run down, although the neighborhood is beautiful. I would highly recommend Lamm Restaurante. Gorgeous place with phenomenal food.", "Date": "December 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "", "Title": "“This may be the most over-rated hotel in all of Latin America”", "Author": "jtjohnson", "ReviewID": "UR17770599", "Content": "I have been traveling in Latin America for more than 30 years and many times to Mexico. My wife and I like to play the game of trying to find the best small hotel in whatever country/city we are visiting. This one was recommended via TripAdvisor, and I, in fact, stayed here a year ago. Then I had to ask to change my room because things like the shower and air conditioner just didn't work. This time, because I had to make some quick reservations, I re-booked this joint. The neighborhood is quite fun and convenient to some places we wanted to visit. Because I was traveling with my wife, I figured I would spring for the extra 10 bucks and go for a suite. OK, I was fooled the second time, shame on me. *) Ever booked a suite with basically no furniture? The supposed living room had a breakfast bar with two plates, cups, spoons and forks. Those were the total supplies in the so-called kitchen, save for a micro-wave which may have worked. The \"furniture\" consisted of a small kitchen table with two 1950s-style kitchen chairs. Total. *) There was a large window looking into the central court, but it was covered with a curtain that couldn't be opened. *) The queen-sized bed was actually two singles pushed together. That's OK, but there was only one small lamp beside the bed and a king-ugly, tall floor lamp that only pointed to the ceiling. Basically, no good for reading. *) The TV only received 12-15 channels, all on the upper end of the system so we got a full dose of home shopping channels and second-rate, English-language movies. The closest thing to news -- in any language -- was ESPN Sports. *) Bathroom. Yeah, to find any old Mexico City building with decent water flow is a mission for De Soto. In spite of that, the owners could at least invest $6-7 bucks in a real shower head, one that isn't clogged by mineral build-up and literally sings. Equally stupid, there are florescent lights in a dropped plastic ceiling, but those lights are not over the mirror, which makes such exotic acts as shaving or applying make-up truly a shot in the dark. There were two, large bath towels (maybe the best thing about the room), but no hand towels or wash clothes. For the first day, there was no bath mat for the all-tile floor. *) Living in a jungle. Mexico City's climate is conducive to plant growth. Vines were crawling up the inner court walls so much that they were hanging into the walkways. \"So what?\" you say? How about vines with thorns. *) Check-out time? Couldn't the owners invest in a new ribbon -- or re-ink the old one -- for the printer so clients can read the bill upon checkhout. All in all, the $90 per night charge (plus the charge for the so-called breakfast) is a true rip-off. I suspect this hotel might be owned by the kind of person or corporation who refuses to invest in the property to drive down the overhead and pump up the profits to get the books ready to show potential buyers. The front-desk staff was quite helpful and efficient, but I suspect -- or hope -- they are all looking for jobs at an establishment they can be proud of.", "Date": "July 11, 2008"}, {"Ratings": {"Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Horrible, Horrible, Horrible.”", "Author": "tinyshiny", "ReviewID": "UR14014824", "Content": "When my friends and I arrived at Casa De La Condesa, we were told that the reservations we had made over two months previous would not be honored. No credible reason was given; the manager at first said that \"other guests had stayed longer than expected,\" and then, when that explanation did not satisfy us, made a vague claim about plumbing problems. Additionally, he initially refused to let us use the hotel phone to attempt to book rooms elsewhere. For all I know, this place is paradise--we never even saw the rooms that we had paid for ten weeks in advance--but don't plan to stay there unless you are comfortable with the idea of finding yourself hotel-less upon your arrival to Mexico City.", "Date": "March 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great Location, Great Staff and Go for the suites only not the standard rooms”", "Author": "Chulolaw", "ReviewID": "UR13774539", "Content": "I enjoyed my stay at the hotel, The hotel is close to 2 subway lines within 10 mins walk east and north. Close to Zona Rosa (8 blks) and close to insurgentes and hospital general subway stations. There is a restuarant at the Hospital General that offers great breakfast for about $8 US bread, coffee, toast, eggs, fruit and jello. I enjoyed the hotel, do not go to the standard room, we paid the $30 extra for the upgrade but stayed one night in the standard, which was horribly too small and just seemed tight and unclean. The suite was bigger, nicer, with fridge and microwave, table pull out chair and a bed, bigger tv, and was immaculate. The hotel staff, very nice, the gelateria was nice outside and a nice restaurant on the corner with outdoor seating. The area is a huge park, very safe at night to walk even at 4am, when we stumbled in from the Zona Rosa. Also the staff very helpful gave us good directions. There is a market on Yucatan and San Luis Petosi for all your needs, about 3 blks one way and 2 blks the other. Supresa. Very inexpensive, food fruit and home products. highly recommend this place for its coziness and location", "Date": "February 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“The hotel is depressing but location is great”", "Author": "NewYork_NYTra", "ReviewID": "UR12919882", "Content": "We booked a standard room online and arrived to find a bed that barely fit into the allotted space. There were windows facing the hallway that were painted open, allowing for no privacy. We couldn't take the depressing, 'pay by the hour' atmosphere and paid extra to move to a larger room in the front of the hotel with a balcony. If you do stay here, choose one of these rooms (They come with a fridge and microwave- good for long stays and are pretty nice).", "Date": "January 23, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "UK", "Title": "“Disappointing........”", "Author": "EnglishSettler", "ReviewID": "UR11992606", "Content": "I had the junior suite and have to say it was disappointing. Yes, the room was large and the bed ok but the bathroom was ridiculous....tiny and you had to battle to fit into the shower, no joke. There is also a strange kitchenette with basin and 2 cups and a fridge with nothing in it which amazed me given that the bathroom was so poor.........could have done so much more with the room for a small investment. There was no tv controller for the tv and only 7 channels and the tv was near the ceiling other side of the room. The night staff for the reception when i arrived were rude and unhelpful. Ok for a budget traveller for 1 night, nothing more", "Date": "December 27, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Jose, California", "Title": "“Good Value With Some Minor Problems”", "Author": "lipsticktraces", "ReviewID": "UR11676401", "Content": "We had a suite (with kitchenette) overlooking the fountain in the plaza and really enjoyed our stay. The room decor is cute, the service very friendly, and the food in the cafe (breakfast/lunch) basic and good. The internet did not work the first day, but was ok after that (and one staff member tried fixing it for me for over an hour the first day). The TV offered many Spanish language stations. The bathroom is very small (shower only) and ours had a small problem with mold. The neighborhood is very pleasant and full of surprises. Historical Casa Lamm is just a block away (and supposedly has a great, upscale cafe). Downstairs from the hotel is a gelato place, a casual cafe/bar and a nice Italian restaurant. A block away is a chocolate-focused coffee shop. A few steps further the retro-Bar Italia. Across the plaza is a trendy pizza place. All food options offer outdoor seating late into the evening. Insurantes Metro station is about a ten minute walk and from there you can get just about anywhere in the city. Take a map with you (available at the front desk) whenever and whereever you go. It is easy to get lost walking and we never did find a cab driver that could easily find the place (and there are other Condesa-named hotels -- so beware.) We stayed at Casa de la Condesa for a full week and never had bad or unfriendly service. The price is very reasonable.", "Date": "December 18, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Great little hotel in a nice area”", "Author": "easytravels", "ReviewID": "UR11105864", "Content": "For $44 a night (booked on Expedia), Casa de La Condesa is a great deal. It's located in Colonia Roma, which is a beautiful, safe neighbourhood with nice houses, college campuses, restaurants and coffee shops. The standard room is small but everything is clean and functional. It's a nice (and safe) 10-15 minute walk to the Insurgentes metro stop (north on Orizaba avenue) , or if you walk west, about 20 minutes from Parque Mexico in the Condesa neighbourhood. Since the hotel is on a small street, there is no noise from traffic, which I imagine is hard to find in DF.", "Date": "November 27, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“shame about the managerÂ´s attitude after a theft from a locked room”", "Author": "vixen_mexico", "ReviewID": "UR10928480", "Content": "This is a really nice hotel but there are buts On the last day of my stay i popped ou for a couple of hours and left 500 pesos (50 dollars) in my room which was not there when i returned I spoke to the front desk about this and the woman just said sheÂ´d report it in a rather uninterested way. You know, itÂ´s a small hotel with no access to the street except thru the front desk. I would at least have expected and appreciated an apology from the manager (and anyone who was concerned about the security of this hotel, guests and staff would have wanted full information on the incident iÂ´m sure) When I did speak to the manager as I was checking out, I mentioned this. He said that i hadnÂ´t used the safe deposit box and then started scanning the terms & condiions to ensure I knew that it was my liability not his! All i wanted was some kind of concern... not for me but for hotel securiy in general. Because of this attitude IÂ´d never stay there again Other than that it is clean and in a great area with peaceful rooms... I really loved in on both my stays there, until this incident. Another bad note is the plumbing is not too reliable and the complimentary breakfast is 1 piece of toast and 1 cup of coffee. they even charged for a cup of milk for my son, who wasnt drinking coffee obviously.", "Date": "November 19, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cabarete, Dominican Republic", "Title": "“Excellent Location - Great Hotel”", "Author": "Expat-in-Cabarete", "ReviewID": "UR10202722", "Content": "This is a small hotel located in an absolutely great area with great boutique restaurants, coffee shops, etc. I stayed in a Jr. Suite, very comfotable and nicely decorated Mexican style, overviewing the courtyard. My room had a kitchenette with small fridge and microwave, but no range. A/C was being installed. Cable TV okay. Service generally very good. It's not a luxury hotel, but it's not a budget hotel either. I was lucky with my reservation through hotels.com. I paid just $47 a night, and was expecting a standard room, but actually my reservation confirmation said Jr. Suite, which is about $30 more. I understand that for about $80 a night you can get an even larger room with a view to the park and it's incredible nice and large fountain. Best of all, this hotel is located in a very safe area. No problem walking around day or night. It's also about 10 blocks from Condesa. The neighborhoord where it is located (Colonia Roma Sur) is a pretty bohemian place and so are the shops around the area.", "Date": "October 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Austin", "Title": "“Great for the budget traveler”", "Author": "gregntommy", "ReviewID": "UR8619469", "Content": "I speak fluent Spanish so I do not know if the staff speaks English. This hotel is for the budget traveler only. If the hotel had not been prepaid through Tavelocity, I would have changed locations. The staff was very nice and the rooms were clean. The hotel did not have any parking but I made friends with the doorman of the apartment building next door and he watched my rental car every evening for a tip. It was a little warm when we arrived and I found out that there is no air conditioning. There was a unit installed in the room that looked brand new but the front desk explained that they were being installed but had not yet been wired for electricity. The staff kindly brought us a fan. Upon arrival there were no more standard rooms available so we were upgraded to a Jr. Suite for free. The bathroom was tiny and getting the door closed in the shower required some agility. The room had a double bed and a small eating area with microwave and mini-fridge. There is no hot water in the evenings so plan on showering early. There is very little water pressure as well. The hotel is on a plaza with a nice large fountain in the middle. While we were there a commercial was being filmed for a bank in the square. There is a great gelato place on the first floor of the hotel with tables and chairs on the sidewalk where we watched the commercial being filmed. We did not try the hotel cafÃ© but had delicious coffee there every morning that we took back to our room. We stayed in room number 501 and it was very quiet. We even slept with the windows open and heard very little noise. I am sure there are other budget hotels with air and hot water but the location was perfect and the staff were very friendly.", "Date": "September 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami", "Title": "“Perfect hotel”", "Author": "44ase", "ReviewID": "UR8518744", "Content": "Unless you're looking for a fancy hotel, you should stay at Casa de la Condesa: perfect location (close to bars, turisbus, metro etc), very friendly staff, very good bedrooms (clean, new furniture)... some downsides (small, though): the hotel taxis are much more expensive than the town taxis, the TV has not much channel options, noone to carry your luggage... that's all... stay in Casa de la Condesa.", "Date": "August 27, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Fantastic stay at the Condesa!”", "Author": "s0lender", "ReviewID": "UR8377974", "Content": "I stayed in one of the standard rooms (i.e. no kitchenette) for 3 nights. The room was small, but very clean. I was on the 4th floor, facing in toward the hallway. My room was extremely quiet which was the thing I appreciated most. The hotel is in a great location, in a plaza facing a garden with a fountain. There isn't alot of noise or traffic on the street. The restaurant in the hotel was quite good (and cheap!) and the whole staff is extremely friendly. I ate breakfast at the hotel every morning. There is also a great panini restaurant just a few doors down. The rooms have wifi and there is also an internet cafe really close by. Slight drawbacks: The water pressure in my shower was very very weak. At one point it was just a little dribble! I didn't bother complaining though, since I was only there a few nights. One day I asked for an iron, which was promptly brought to my room, but there was no ironing board! The 2 subway stops are not super close... about a 7-10 minute walk to either one. If it's not raining, this doesn't really matter. My room was a little bit stuffy as there was only a small window in the bathroom, and no overhead fan above the bed. Again, I probably could have asked for a portable fan, but I wasn't really bothered since the temperature at night went down to around 12 degrees (Celsius) and I was fine.", "Date": "August 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Laurderdale", "Title": "“Great hotel !”", "Author": "Ginaaa", "ReviewID": "UR8193585", "Content": "My stay at this hotel was great ! \"Thank you\", to all the employees of this hotel. They made my stay fantastic! The hotel is in a great location, and the rooms are really comfortable, clean and well decorated. I wished we would have stayed more days, but if we ever have to go back to Mexico City, this will be my first lodging option.", "Date": "July 19, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New York, NY", "Title": "“would go back!”", "Author": "NYCArchivist", "ReviewID": "UR7545667", "Content": "junior suite was clean, safe in room. great neighborhood: fountain, dogs, cafe con leche, bookstores, galleries, cafes...", "Date": "May 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Wolfeboro NH", "Title": "“pleasant neighborhood hotel”", "Author": "De_Bob", "ReviewID": "UR6926774", "Content": "Casa de la Condesa is in in a great neighborhood with cafes, a nice little fountained park, super little restaurant for Mexicana eggs, toast, cafe con leche, and fresh squeezed juice each morning. The staff was extremely accomadating with directions on where to get a bottle of wine, ribbon for my wedding gifts, a pharmacy to pick up those neccesaries ( lost luggage, found and delivered on day two) The hotel has two patio areas to catch some rays, read and relax which we did while waiting for our luggage to arrive, the rooms are a little thread bare and in need of a decorator but clean and comfortable with daily maid service. Two things missing that almost all hotels have in rooms, a coffee maker and hair dryers. Oh, and I should mention the WORST pillows, nothing to them. With the restaurant downstairs it's easy enough to get coffee.The hotel has 4standard rooms and 27 suites with a little kitchenette ( fridge & microwave, silver plates and glasses & cups for two) When booking with Expedia I just assumed we'd get a suite as there were 3 of us traveling, nope we got a standard room. Made a deal with management, instead of paying the extra $30 a night for the larger suite we only stayed 4 nights, as we had booked for the week with a good price with air included, but weren't going to be there for the weekend anyways. So for us it worked out fine.The turibus, with a stop a block away at Casa Lamm is fantastic way to view the city. Taxi's are so inexpensive the Casa de la Condesa is a quick taxi ride out to the Reforma, to the zocalo, or the park. A random thing hapened on the tuirbus, at the autotorium a film crew got on with a bunch of actors, a makeup lady ,lighting people and a segment of Amor sin Limites (a mexican soap opera on channel 2) was filmed on our bus on the upper deck where we were seated, how cool is that! I've decided that Mexico City has more statues and monuments than all of the US's cities combined. The city is a terrific blend of really old and new.", "Date": "March 7, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Durban in Paris", "Title": "“One night is enough”", "Author": "Nextvacationnow", "ReviewID": "UR6778250", "Content": "Booked a standard double room through hotels.com Upon arrival I was given a tiny room with single bed. My complaint did not get through as (unfriendly ) staff speak very little english. One night was enough.", "Date": "February 11, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“For that price: Great Hotel in a conveniant location”", "Author": "golas", "ReviewID": "UR5805025", "Content": "We really enjoyed our stay especially since Plaza Luis Cabrera and the neighbourhood has some really nice restaurants and while being really close to the city, we had a quiet nice room with TV. The only downpoint- it smelled of chlorine. But frankly, I prefer that smell if it gets the place clean (and it does)", "Date": "September 15, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Netherlands", "Title": "“Highly recomend this hotel”", "Author": "jorgecastle", "ReviewID": "UR5544397", "Content": "Had a beautiful suite and there was exelent service. Great stay in Mexico City and I will be back soon !", "Date": "August 2, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Bloomington, Indiana", "Title": "“Perfect place to stay in DF!”", "Author": "evdean", "ReviewID": "UR5353582", "Content": "I just loved this place. Convenient, pleasant and safe location - the park and fountain across the street provide great atmosphere. And the rooms were so charming and comfy. This was my first time in Mexico City and I didn't know what to expect, but I was pleasantly surprised by the level of comfort and service I got for such a low price. I highly recommend it!", "Date": "June 16, 2006"}], "HotelInfo": {"Name": "Casa de la Condesa", "HotelURL": "/ShowUserReviews-g150800-d225532-Reviews-Casa_de_la_Condesa-Mexico_City_Central_Mexico_and_Gulf_Coast.html", "Price": "$54 - $72*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Plaza Luis Cabrera 16</span> | <span class=\"extended-address\">Col. Roma Sur</span>, <span class=\"locality\"><span property=\"v:locality\">Mexico City</span> <span property=\"v:postal-code\">06030 </span></span>, <span class=\"country-name\" property=\"v:country-name\">Mexico</span> </span> </span> </address>", "HotelID": "225532", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/fc/be/fcbec56276446211b532dfe9ea2d1dca3large.jpg"}}