{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "MA", "Title": "“Decent hotel- great front desk staff!”", "Author": "Lucinarei", "ReviewID": "UR124094914", "Content": "We stayed here on a recent trip to visit family. The location was great (although the hotel itself was somewhat difficult to find at night- just keep following the signs!). The rooms were nice, if dated. There didn't seem to be too many guests when we stayed, which was probably a good thing, because the walls seemed paper thin (we heard EVERY noise in the hallway and adjacent rooms). But, it also meant great parking spots in the attached garage. It might also have affected the hot water, because it needed to run for quite awhile before it got hot enough to shower each morning. The worst part of the room, for us, was the Sleep Number bed. We were very uncomfortable and barely slept during the two nights we stayed. This is most definitely a personal thing, but I will be making an effort to stay away from Radissons because of the beds! The front desk staff was courteous and friendly. The housekeeping staff member who took care of our room was very pleasant- although she didn't leave new towels in my mother-in-law's room after cleaning it. She needed to call down to the front desk to have them delivered when we returned to the hotel that evening. All in all, it was a very nice hotel and we enjoyed our stay (despite the no sleeping!). I would recommend this hotel at the right price.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Agree with dated rooms, great staff!”", "Author": "Marybeth58", "ReviewID": "UR123762288", "Content": "It's always a tad uncomfortable to stay at a hotel that's near a major medical center. This hotel is very near John Hopkins medical center so many guests seem to be there for treatment or medical appointments. I was in the area for work and this was the most convenient hotel. The facility and rooms are dated apart from the sleep number bed which was very comfortable. If there were options, I'm not sure I'd choose this hotel. But the staff was very pleasant and helpful. I had forgotten a charger for my phone and a staff member offered to share his to help me out. The restaurant was closed while I was there but you could get food in the lounge.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Dated rooms, courteous staff”", "Author": "Blek42", "ReviewID": "UR123649607", "Content": "Most importantly, rooms can be had for ~$50-$60 per night on priceline's \"name your own price\". I stayed in a Jr. Suite (upgraded by request). The room was large, with a wet bar/mini-kitchenette, living room with setting for 6 and a tube TV, the bed was a king sleep number bed. The room was a bit musty and the decor was dated and rustic/woodsy. The staff was unbelievably courteous and accommodating. Free WiFi, free bottled water in room (budget brand) and free covered parking are a big plus++. No complaints here.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Bristol", "Title": "“A lovely stay”", "Author": "LozBristol", "ReviewID": "UR123106481", "Content": "Very pleasant location; lovely little cafe next door for food, set in a nice little up market shopping centre. The hotel was well appointed, comfortable, and clean - what I'd expect from a Radisson. The staff were very very helpful and informative. I enjoyed my stay. It would be a difficult location without a car.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Great Neck, NY", "Title": "“Perfect for our needs”", "Author": "DonsPromo", "ReviewID": "UR123024744", "Content": "We just checked out from one night there for a family wedding. It was absolutely fine and perfect for us. Rooms clean, check-in easy, gave us exactly what we needed in terms of rooms, great towels, strong showers, easy parking, etc., no problems at all. If you need to to be in that area, it is just fine for a night or two.", "Date": "January 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Western Maryland", "Title": "“strange room decor but great location and staff”", "Author": "mdmbfly", "ReviewID": "UR121697527", "Content": "Stayed here for business. Location is great, connected to an outdoor mall/plaza. Gated at night. Not very quiet, could hear the guy in the next room coughing so I knew he coud hear me using the hair dryer in the early morning. The lobby had very nice contemporary decor but the rooms were \"country\". The lamps were birdhouse with handpainted flowers, I think. In the bathroom, the towel holder was a country folk art house. I've not encountered that kind of decor in a franchise hotel before. It wasn't bad, just unexpected. Bed was comfy and the room was a nice size and clean. The bathroom was dated. Perhaps they are in the middle of a remodel.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Boston MA", "Title": "“Spacious room, near highway, free parking”", "Author": "avaheh", "ReviewID": "UR120578150", "Content": "I was attending a meeting at the Radisson Lord Baltimore in Baltimore which was overbooked and so Radisson booked me at the Cross Keys and Radisson central reservations said there was a free shuttle bus that ran between the two properties. When I arrived directly to the Lord Baltimore they had no knowledge of the shuttle between the properties. I ended up taking 2-$30 cab rides each day between the Lord Baltimore and the Cross Keys. When I arrived at the Cross Keys the front desk said they did have a shuttle but it run a couple time per day to the hospitals and inner harbor on a set schedule. The morning runs are to the hospitals and the first service to the inner harbor area does not leave the Cross Keys until 9:30 am so I took cabs for 3 days. My room was spacious, parking is free and there is a connected shopping center for browzing (Chicos, William Sonoma, a cafe etc). I received an email survey after check out and commented that although my room was fine I would not have booked at the Cross Keys while I had downtown meeting without having a rental car and only did it because central reservations assured me that there was a free shuttle. Although at check in and check out I was only given an verbal apology, I was pleasantly surprised to have the hotel manager issue a credit to my hotel bill for the cost of the cabs ($ 140) in response to the email survey. So overall the room was good and if you have a car and do not need to stay in town the hotel is fine and the follow up customer service was great. However do not believe Radisson Central Reservations if they tell you there is a convenient free shuttle.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ithaca, New York", "Title": "“Relaxing”", "Author": "Rumbarox", "ReviewID": "UR120035826", "Content": "Stayed twice here in May and August 2011 with both visits pleasant. Hotel restaurant is relaxed and with attentive staff though not busy at that time. Outdoor pool is nice. Locations is pleasant if visiting University and yet still convenient if you have a car to reach the Inner Habor. Parking is plentiful and included with hotel stay.", "Date": "November 1, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Roanoke, Virginia", "Title": "“Needs a remodel”", "Author": "lgwacbb", "ReviewID": "UR119916212", "Content": "Stayed there H'ween weekend. Got in late and the signs to the hotel aren't well lit. The hotel is in a shopping center, so it took a bit of wandering through the parking lot to find the door. After checking in, we were met at the elevator by a manager from the bar who took us around to the freight elevator, telling us that the regular elevators were all broken. Got in the room and it was late, so went to bed. Next morning I realized the heat had been broken all night (it was freezing), the fan in the bathroom was broken and the light attached to it was falling out of the ceiling. The wireless is technically free, but throttled unless you pay to have a faster connection. On the positive side, the sleep number bed was nice. We had reserved a king room but were put in a two doubles room. We were pretty tired at check in so we didn't bother switching, but I'd imagine the sleep number would be even better if the bed were bigger. Also a positive is Village Square Cafe - a little coffee shop next door. The food is great and the coffee is hot. Skip the in-hotel restaurant for breakfast and score a fresh muffin and a cup of joe there!", "Date": "October 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Scarsdale, New York", "Title": "“Hotel needs updating”", "Author": "ne1410stoday", "ReviewID": "UR119332023", "Content": "The location of this hotel is ideal for parents visiting college students at MICA. The tennis club across the street and the little shopping mall were added pluses. However, the hallway on the third floor (where the pool and health club are located) smelled damp, the sleep number bed didn't adjust (the remote elicited some interesting noises, but the firmness never changed), and the room lighting was very dim. At this price point I would have expected a flat screen HDTV in every room, terry bathrobes to be provided, and a fridge/mini-bar and safe in every room. I requested a fridge, and after 3 reminders, it was cheerfully provided. The staff was very friendly, courteous and helpful. I thought that $12.50 plus tax for an omelet and coffee in the hotel restaurant was a bit pricey for Baltimore, although the omelet was well-prepared.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“Wonderful beds where you can dream of shopping”", "Author": "JerseyJean", "ReviewID": "UR119206304", "Content": "This Radisson is a comfortable and nicely functioning hotel. Location is suburban and feels safe, but conveniently located only a few minutes' drive from downtown, in a small shopping mall. Staff were friendly and helpful. Not a palatial \"wow\" experience, but a good-sized, clean room with a well-appointed bath, plenty of counters and storage space should you be spending a few days, as well as exercise room, and free parking. My room overlooked a pretty courtyard with the outdoor pool. The \"wow\" came from the \"sleep number\" beds. Mine was extremely comfortable. There was no separate exhaust fan in the bath, so after showers the room remained foggy for a while. Also, the door opening mechanisms took getting used to, with a strange double movement of the handle needed to unlock after inserting the key. But overall, very nice experience. I was there for a conference and had a reasonable rate, and would happily return.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Silver City, New Mexico", "Title": "“Location is its main strength”", "Author": "MitchHellman", "ReviewID": "UR118677715", "Content": "Most of Baltimore's chain hotels/motels are located either at the airport or the Downtown/Inner Harbor area. The Radisson is located a few miles north of the city center, convenient to Johns Hopkins University (but is *not* near Johns Hopkins Hospital) and the more upscale residential neighborhoods of Roland Park, the Village of Cross Keys and the newly-hip Hampden, and is just off of I-83, which runs from the Inner Harbor all the way to the state line and into Pennsylvania. The hotel is average and, as other reviewers have noted, in need of a update. I could overlook some of the property's foibles if the price was somewhat more reasonable... but the location is a big plus for me, as is the free parking, the nearby shops, and the park-like feel of surrounding area, which is a welcome respite from the busy city.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Richmond, Virginia", "Title": "“Dirty and Dated”", "Author": "nocares67", "ReviewID": "UR118494744", "Content": "The hotel looks very '70s (lots of paneling everywhere) with a possible late '80s/early '90s refurbishing, which by now itself is also very dated and never really cured the '70s look of it in the first place. Not only does it seem dated, but it looks like it hasn't been kept up properly - it's not just an issue of styling, it's dilapidated as well. Altogether, it makes it very dreary. Two things that are not helping: 1)there's a musty smell (especially in the rooms, and 2)the elevators (which inexplicably look far older than the rest of the building) are iffy, having been sllloooow when we first checked in, and completely nonfunctional later in the trip. The rooms are a bit odd. Pretty spacious, but decorated with a strange timber/wood motif that seems totally out of place in Baltimore. The bathrooms are small, and the shower was very, very dark. The construction must not be great, because we could hear people in the halls and other rooms much more clearly than in most hotels. Also, there was not individual heat/AC control; while we could pick a temperature, we could not opt to switch from heat to AC or vice versa, because the units are not in each room. It was strange, and not really a problem for us, but it's just another thing that needs to be renovated and could be frustrating in certain times of the year. We discovered that our room/linens had not been cleaned before our arrival (which, alone, is enough for me to say with certainty that I would not recommend this place, nor stay there again), and getting it fixed late at night was a bit of a fiasco. Customer service was hit-or-miss, and we were given many false promises about rectifying the situation. It is in a nice little tree-filled area with good restaurants (Donna's and the Village Square Cafe were both delicious), and the parking is free. That's about all the good I can say.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Wales", "Title": "“Good and bad, but customer service on the decline.”", "Author": "GJonesWales", "ReviewID": "UR118406327", "Content": "We stayed at this hotel from the 6th to the 18th of September, 2011. The hotel is located in a safe relaxing location in a middle of a leafy upmarket shopping centre. Here you will in addition to the hotel amenities a tennis club, restaurant, spa, and cafe. The hotel benefits from free parking, and free shuttle to the inner harbour which is a big bonus. Down to the hotel, the bar is totally inadequate althought the staff especially Corey is great. There are no draught beers, and it is pricey. The net result is that its void of atmosphere and customers.. The food at the bar and restaurant is very good, especially the new york strip steak which is a good as youll get in Baltimore. The hotel reception , bar and restaurant, and all public areas, are stuck in the early 90's, it is dreary, and tired, and way overdue for a refurb. The rooms are sizeable, and the sleep by number beds are very comfortable. The decor is again stuck in the 80's / 90's and is tired and dreary. The baths do not drain properly. Things are being maintained, for example in our room the TV didnt work, (but was replaced) im sure the TV's are worth more as antiques. The telephone didnt work. On our floor, the ice machine, and vending machine didnt work. At the end of the corridor was a bucket holding water from a leaky roof, although I know from last years visit that it was re roofed. There is free wifi which works well. The bathrooms although some have been retiled, still look tired , dreary, and old fashioned. Im told that the hotel is in line for a 7 million dollar re fit, this is well overdue. Customer service. In previous visits I had no complaint, but standards have definitely slipped, especially at the desk. In previous visits they couldnt do enough for you, now they are inflexible and some are quite rude, others are great. The day before the end of my visit i received a bill stating I was leaving on that day, I contacted the desk, by phone, and they stated categorically that I was leaving today, but they would match the rate given by my booking agent opodo. The receptionist even had the audacity to tell me to check my flights in case id made a mistake there too. My travel document clearly stated my check out date. Later I visited the desk to query this further, and asked them to check their records and showed them travel documents. They refused and I wasted a further 45 minutes in an arguments. In the end the inflexible receptionist (female, late 20's, slim-same person I spoke to on the phone) re checked their system and discovered an error by the check in clerk. I received no apology even though we missed a day trip to Washington as a result, I contacted Radisson customer service twice by email, but have still to receive an apology or even any response. My family and friends stay here maybe 3/4 times year, not any more. This hotel has great potential, but it needs an urgent re fit, and lessons in customer service.", "Date": "September 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Long Island, NY", "Title": "“Great location for JHU visit”", "Author": "ltunick", "ReviewID": "UR116803987", "Content": "I was in Baltimore with my son to visit the JHU campus. The hotel was a bit hard to find (in the driving rain), as it is part of the cross keys shopping center. But, once there, all was good. Their corporate rate for campus visitors was very reasonable. It was about a 10 minute drive to campus. The room was clean, the beds were Sleep Number models so we could 'dial up' our level of firmness. Good experience overall!", "Date": "August 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Bridgewater, New Jersey", "Title": "“Overnight for JH visit”", "Author": "tajkd", "ReviewID": "UR116301728", "Content": "We were visiting Johns Hopkins and this hotel is within minutes of the campus. The check-in was pleasant and quick. The rooms were clean but dated. We didn't use service or other amenities. Restaurant was terrible but I'll write another review for that.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Connecticut", "Title": "“Comfortable and near Restaurants”", "Author": "SojournerToo", "ReviewID": "UR115936950", "Content": "I have just returned from spending three nights at the hotel. This is my seventh time in the last two years. Some rooms are better than others, but I think that may be due to newer renovations occurring. The room was very spacious, the bed was new, and the mattress very comfortable. It was during the heat wave and the air worked very well. What I like about the Radisson at Cross Keys is the location. It sits off Route 83 but in an upscale shopping village. You can walk and visit the shops, as well as finding restaurants there and nearby. My favorite is Petit Louis, which I always make sure I visit.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Oklahoma", "Title": "“Love, love, love this hotel. I will go back”", "Author": "50toes", "ReviewID": "UR115266515", "Content": "My daughter had a swim meet at Meadowbrook Pool, this hotel was perfect in all ways. It had free parking, it was close to the pool, great shopping and restaurants right outside the door. The staff was very helpful, from the front desk to the housekeeper. We were looking for a place to eat dinner and decided to eat at the hotel restaurant, it exceeded our expectations. The food was great, the server was superb, it was a unexpected treat. I would highly recommend this hotel.", "Date": "July 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Athelstane, Wisconsin", "Title": "“Quiet Natural Setting”", "Author": "Tom_in_Manty", "ReviewID": "UR110563530", "Content": "We traveled to Baltimore for the Preakness Stakes and had a most enjoyable stay at this hotel. The location in a wooded & nicely landscaped area was an unexpected surprise! Also, we want to acknowledge the \"two Corey's\" one at the front desk and the other in the lounge both of which provided superior service. On Sunday (the day after the race) we spent much of the day at the attached Red Door Spa!", "Date": "May 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Location": "5"}, "AuthorLocation": "Havre de Grace, MD", "Title": "“Delightful Brunch”", "Author": "HappyCus2mer123", "ReviewID": "UR108010839", "Content": "My kids treated me to the Mother's Day Brunch at the Radisson Cross Keys and it was delightful. The selection of foods from fresh fruits and salads to make to order omelets and waffles with may side dishes and tempting desserts was both festive and delicious. All of the staff were very friendly and wished me Happy Mother's Day and our very sweet server presented me with a long-stemmed rose and kept the mimosas coming. This was the perfect start for a beautiful Mother's Day. Thanks!", "Date": "May 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fallston, Maryland", "Title": "“Mother's Day Brunch couldnt have been better!”", "Author": "jmsanfilippo", "ReviewID": "UR107825012", "Content": "Mothers day of 2011 was hands down the best brunch i have ever experienced. Growing up in the hospitality industry, I have a very high standard and expectation of my dining and hotel experiences. The property of the Radisson Hotel at Cross Keys was so clean and so inviting and thats just the beginning. The Service that we had was perfect, every drink was full and every dirty dish was professionally pre bussed from our table. The food was out of this world. we had a buffet and the lay out could not have been better. I would stay at this hotel any night of the week and i would certainly eat in the hotel restaurant any time i stay in the area.", "Date": "May 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Middleburg, Virginia", "Title": "“Noisy but Tolerable”", "Author": "clh6262", "ReviewID": "UR103685748", "Content": "The walls must be paper thin because I could hear everything and everyone. It seemed pretty clean and I actually had an acceptable meal. The bathrooms are quite outdated and the decor is - interesting. I would probably choose somewhere else next time. But, having just come from a stay in one of the worst hotels ever, this seemed pretty good at first. It's disappointing because of the great location. They really need to pay attention to these reviews - the staff does not really seem to be that concerned with service.", "Date": "April 11, 2011"}], "HotelInfo": {"Name": "Radisson Hotel at Cross Keys", "HotelURL": "/ShowUserReviews-g60811-d225792-Reviews-Radisson_Hotel_at_Cross_Keys-Baltimore_Maryland.html", "Price": "$125 - $214*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">5100 Falls Rd</span>, <span class=\"extended-address\">(100 Village Sq)</span>, <span class=\"locality\"><span property=\"v:locality\">Baltimore</span>, <span property=\"v:region\">MD</span> <span property=\"v:postal-code\">21210</span></span> </span></span></address>", "HotelID": "225792", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/98/33/9833b3cf6daf8e8cf1fc69f12163cc514large.jpg"}}