{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Yonkers, New York", "Title": "“Hotel Gioberti Rome”", "Author": "Elaine H", "ReviewID": "UR128073929", "Content": "Recently spent two nights at Hotel Gioberti. This hotel is directly across from the Train Station which is very convenient and is a short taxi ride from all of the major attractions. The rooms were kind of depressing with very high ceilings and truly hideous orange striped walls, The lighting was very poor. Rooms were adequate size wise but just not my cup of tea.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cardiff", "Title": "“Room for improvement”", "Author": "George D Posted by an Easytobook.com traveler", "ReviewID": "UR127904888", "Content": "Ideally located for easy transfer from termini rail station. Excellent access to Roma for walking. Good choice of sensibly priced restaurants in surrounding area. Double glazed windows cut out a lot of noise but obviously all city centres are bustling so don't expect tranquillity. We experienced poor service in the breakfast room. We had to set up our own table both mornings and we waited 40 minutes for the hot food option of bacon and eggs to be replenished the first morning, which it never was, we gave up. Did not bother to enquire the second morning made do with a good selection of cold options. We would use this hotel a second time for the convenience and cleanliness but the four star rating is excessive it is 3 star at best.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Pleasant”", "Author": "ClaudiaR2092", "ReviewID": "UR126446473", "Content": "The hotel was alot nicer than i anticipated. I went as part of a university sponsored trip about two weeks ago and I found the staff to be nice. Sometimes i felt they were a bit rude, but then again we were a bunch of loud american college students so it could have been us who were rude first. the housekeeper on the fourth floor was very sweet and said buon giorno every morning which i thought was nice.My room, 411 was tiny but cozy and i loved the view of the street and the city from the front facing window. I liked the location because it made getting around Rome alot easier.The only thing i did with my group/ friends was come back to the hotel to sleep and shower so it served its purpose well. i didnt like the breakfast simply because I wanted to have a legit cappuccino and cornetto almost every morning, and I could eat ham and cheese back in the states so i wasnt missing out on anything great. Overall, i loved the trip and would probably book here again when I return to Rome soon! And there was an internet cafe like 20 feet away on the corner of the street so wifi was not an issue.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Pleasantly suprised”", "Author": "BakingQueenMtl", "ReviewID": "UR125624751", "Content": "I went into this hotel with low expectations and must say I was pleasantly surprised. I stayed in one of the triple rooms along with two friends. The room was very spacious and spotless as was the bathroom (the shower was a bit narrow though), there was a safety box and even a fridge (which we did not notice until the last day - it's below the desk). When we arrived, the room was extremely warm and it took some time to figure out the system but eventually we did and had no more problems. Some reviewers claimed the beds were too hard, but we did not find that to be true in our case. Location-wise the area is not always the nicest but it is a step away from Termini (bus, train and metro) and you can totally walk to the Colosseum from there. Breakfast was pretty good with a variety of food and drink and the friendly hotel staff offered to prepare us a \"to-go\" breakfast on our departure morning as we would be leaving before the breakfast room opened. Two things I would change would be having free wi-fi and better TV channels (only CNN International was in English). I would not say the hotel is a 4-star but I can honestly say I have no complaints.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Liege, Belgium", "Title": "“NO SLEEP!!!”", "Author": "Lagonda321", "ReviewID": "UR125387123", "Content": "Hotel is clean enough although far from 4 star in my opinion. The beds are solid and uncomfortable which is really no problem because the noise from the traffic outside wont allow you to sleep anyway! The staff on the whole were reasonable with the exception of the manager who thought shouting was the way to get his point across and the receptionist who thinks that a 25 euro surcharge is appropriate simply for calling a taxi all in all a poor example of a hotel/B&B", "Date": "February 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oklahoma", "Title": "“Good Location - Decent Hotel.”", "Author": "pamAndRick", "ReviewID": "UR121391963", "Content": "We stayed at the Gioberti for 3 nights in November. It was very clean, and the front desk guys were very helpful - in addition to having a great sense of humor. The rooms were small but comfortable, though the shower stalls were so small that dropping anything on the floor was a problem. There wasn't enough room to bend over to pick it up! Aside from that, it was a reasonable place to stay. The breakfast buffet was basic but enjoyable. We usually made sandwiches from the cold cuts and rolls for use later in the day, which saved some money. We had no problems with the quality of the food. The mattresses were very firm but comfortable. Since my back usually complains about being walked around a lot, which we did while in Rome, the firm mattress was great. The hotel is a block from the Roma Termini, but we didn't use it. We did a lot of walking, and found we were within easy (for us, we hike a lot) walking distance of the Coliseum, forum, and many other churches and piazzas. After our first two days in Rome we joined up with our tour group, so after that we usually had a tour bus taking us to other places. Basically though, we enjoyed our stay at the Hotel Gioberti and would return if given the chance.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ft. Worth, Texas", "Title": "“Italy Trip”", "Author": "rangerbob1957", "ReviewID": "UR121033843", "Content": "The best thing about this hotel is the location. A lot of the best sites are located within walking distance. It is located a block and a half from the Roma Termini station. The metro is also located in the same place. If you are coming from the Fiumicino Airport on the Termini Express be fore warned that this train stops before any to the other trains. Don’t take the elevator or the steps down to the lower level that is located at the end of the track. Instead stay to your right and stay in the terminal. If you do go to the lower level and exit the building turn to your right. You will go up a hill for about three blocks and across two busy streets then turn left for half a block. If you come out of the Termini exit look for the McDonalds across the street. This will let you know you are at the correct exit. Upon exit from the Termini turn left walk to the far side of the first street to cross then turn right. The Hotel is located half way down the block. . The hotel is clean and quite as long as the windows are closed. If you leave the widows open the traffic runs all night with some on the truck traffic starting at three in the morning. The rooms are small but almost all the rooms in this price range are about the same. The worst thing I found was the size of the shower. Don’t drop the soap because you can’t bend over to pick it up. Our room had a King size bed and there was still enough room to get around. They do have wi-fi but it is a extra 6 euros a day. If you don’t like a hard bed this is not the hotel for you because the bed is like sleeping on the floor. The front desk is a mixture of people. On the day shift Alessandro is buy far head and shoulders above every one else. He speaks perfect English and will help with any problems you have. He always answered any of our questions where something was located, how far it was from the hotel and advice on where to eat. The Hotel doesn’t have a Restaurant but it does have a breakfast that is well worth the extra cost. (see photos) There is a Restaurant close to the hotel with free wi-fi and good food. Turn left when you leave the hotel and it is on the corner of the block same side of street. If you want to site see close to the hotel turn left when you leave the hotel go three blocks south to Basilica di Santa Maria Maggiore. There is a grocery store (hard to find) across the street from the Basilica (east side) in the basement. It is not marked on the outside of the building but it has a lot if items. If you turn to the right (north) when you leave the hotel go the end of the block and turn left (west), walk five blocks to the Fountain of the Naiads. Look to the north side of Pizza Della Repubbica and you will see La Certosa de S. Maria Degli Angeli. This shows Galileo’s ideas and his genius in detailed form.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“it isn't a 4 star hotel”", "Author": "william r", "ReviewID": "UR120560056", "Content": "My husband and I stayed here for 4 nights this isn't a 4 star hotel the breakfast was basic, the staf was unhelpful the bed was hard as a rock the hot water stopped working on the second day the room was small but clean the TV didn't work and took two days to repair these problems aren't in a 4 star hotel the positive point is the location. it is located just from termini station and you can find buses trains and metro for any destination never stay there again", "Date": "November 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Cairo, Egypt", "Title": "“Basic hotel, Do not expect much”", "Author": "Ayman Z", "ReviewID": "UR119288755", "Content": "I have read most of the reviews in the page before staying in this hotel as part of group trip. Most of the comments are very true. The hotel is very basic. Breakfast is very limited. Beds are actually hard, and staff are not that friendly (but not rude) The shower is actually very limited in space. It was strange that they are not allowed to give you two rooms key. First day of arrival, they had problem with the water plumping and the room has not water, but they solved this problem quickly and we did not face it again during the whole stay. The positive point is that the rooms are very clean, and the location is perfect near termini where you can find transportation for any destination you want and the city tour buses stations. Generally, you can use Gioberty as a place to spend the night after your full day tours in Rome, do not expect much more.", "Date": "October 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Adelaide, Australia", "Title": "“The beds are really hard at Gioberti Hotel”", "Author": "Diamargas", "ReviewID": "UR117059434", "Content": "We stayed at this hotel for 6 days = 5 nights. It was rather clean, had good-working air conditioning but for a 4 star hotel it was pretty basic. We stayed in 3 star hotels that were at least as good as this one. We hated its beds. We did not rest well there because of the beds, which should be an essential good quality feature when one travels. My daughter and I had a twin room: the beds were the narrowest we ever slept in. Single beds for children I would call them. A more corpulent person could not possibly sleep in a bed that narrow - s/he would not fit, definitely. We are slender people and do not take much room at all, and still was hard for us to fit in them. The mattresses were so hard, it felt like they were made of wood or concrete - we woke up each morning with pins in our muscles and pain in our bones. Now we have at home very firm beds - because a firm mattress is much healthier than a very soft one, but there's a big difference between \"firm\" or \"sturdy\" and \"hard\" as rock. Also, the mattresses had no buttons on their surface as most of them have, but plastic bits in the shape and the size of a match-stick to hold the woolen content and the springs in place. Those sticks were protruding through the sheets because there was no proper mattress protector and every night we got scratches on our legs from them - it was like sleeping on a bench in a park lined with a bunch of horizontal nails or twigs... The other thing we did not agree with were the towels in the bathroom and the space in the shower which was the tiniest we ever had. A shower for very skinny people, when we showered we hit our elbows in the walls all the time. The large shower towels were OK, normal, soft, clean, white and fluffy etc. But all the smaller ones were ..TEA TOWELS!! Thin as calico or linen - it was hard to dry one's face without wetting entirely the whole towel...To dry one's hands repeatedly in a thin towel like that was impossible - it was soaking wet from the first attempt. Only in Italian hotels I saw that type of towels and I am wondering how could they benefit themselves or the customer offering that? I do not think the washing of the towels is cheaper that way - unless they are charged by the kilo..? Other than that, the rest of the services were OK, very good sound -proofed windows on such busty streets, good curtains to pull over to get the room dark if you need to sleep in, good sized room with lots of storage space. Unfortunately for a 4 star hotel, the safe was not even connected to electricity and could not be used, was there just to comply with the inventory. The breakfast included was quite all right, the beds were made daily, the room was not dusted daily though, but we could live with that. Perhaps the supervisor of the breakfast room would have looked much better in our eyes if he was less arrogant and did not want to show his importance so much, to the point that the boys under his control looked always frightened by him and he constantly raised his voice at them like they were naughty kids and he was the head-master showing off. All together, this is a pretty good hotel, 2 minutes away from Roma Termini Station and and within roughly 1 km walk from most attractions . Handy to public transport, close to the trains serving the airports. There are a couple of convenience stores near-by and lots of little restaurants, and the taxi-rank is 2 minutes away. But be warned, the area is really dirty, as most areas are around train stations and that is not something unusual for Rome in general. The hotel is not cheap, therefore the charge of 3 euros/day/person for city-fees was a surprise for us when we left, especially as we were not warned about it by Agoda, through which we booked our stay there. In all the other 13 countries we visited the city-fees were included in the overall price.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Ottawa, Ontario", "Title": "“Close to Termini Station”", "Author": "8achan", "ReviewID": "UR116123332", "Content": "We stayed here for a couple of nights. The hotel is literally right across from the Termini Station. It is in a very busy traffic area but overall it was very easy for us to get to the airport or hop on the trains to travel in and out of Rome. They had breakfast included in the hotel price too!", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Hornchurch", "Title": "“Lovely hotel - perfect location”", "Author": "Cher2011", "ReviewID": "UR116054444", "Content": "Stayed here for five nights in July, all the staff are very friendly and helpful, let us keep our bags there when we arrived early and when we left late. Rooms are cleaned daily and are spacious and comfortable. Had a lovely stay and would return to Rome in a heartbeat. Have also recommended the hotel to family. x", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Hotel Gioberti”", "Author": "IMV_11", "ReviewID": "UR115339384", "Content": "Exactly what we wanted. Across the street from the Termini train station. Subway and buses at your doorstep. Close to major sites. The hotel was very nice, clean, spacious room, the front desk staff were very helpful. Very nice breakfast with lots of variety. Would stay there again and would recommend without hesitation. Good value for the middle of Rome.", "Date": "July 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Derry", "Title": "“Basic hotel”", "Author": "JohnOF", "ReviewID": "UR106453922", "Content": "I stayed in this hotel, with my wife, as part of a mixed group of 32 people on a B&B basis. It is situated reasonably close to an underground station which was quite good. The room was adequate, clean and tidy. the bathroom (WC, bidet and shower) was also adequate re size, but the shower was very poor. The sink plug did not close; I reprted this and it was \"fixed\"; however, it still leaked water resulting in having to balance the water in from the tap to the water out through the plug! The room had A/C which created quite a bit of noise but no cooling whatsoever. There was a safe, very firm but confortable beds, the usually too low-powered room lighting, a dreadful TV service and a poor hairdryer. On the plus side, breakfast was good and the room was spacious. A packed breakfast was provided on two days due to our very early start; it was dreadful.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Not a 4-stars at all.”", "Author": "alicelam2004", "ReviewID": "UR80624161", "Content": "This hotel said it is a 4-stars but it is really old and rundown. The service (reception desk) varies depends who is on the shift, there is one guy who serves the morning who is really mean and rude. The room is like in the 70s and seems like it was not renovated since then. Very old. Small shower, I can hard to bend down to pick up stuff that I dropped. The only good thing is the location where is it like less than 5 mins from Rome Termini station. Will not return to this hotel.", "Date": "September 22, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Campbell CA", "Title": "“Neighborhood looked unsafe....”", "Author": "eroom", "ReviewID": "UR68659855", "Content": "The hotel itself was clean fairly comfortable but very old. The location was a block from the train station. If this was you were going to use the location is great. However, we were an older group that did not use that service and was told by our tour operator not to go out at night walking. the walls were coverd with graffiti ....looked very unsafe people lottering about.. Not a good location for the Vatican which was our main reason for being in Rome. The ammenties at the hotel were very limited. Extremely small lobby area. Would not reccommend this hotel.", "Date": "June 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Good basic room close to Stazione Termini”", "Author": "TravellingGal2", "ReviewID": "UR60554342", "Content": "Good basic room. Plentiful breakfast buffet. Helpful front desk staff. Upon arriving, it was obvious someone had smoked in our non-smoking room on a non-smoking floor. The desk staff was most apologetic but unfortunately all other non-smoking rooms were booked so we wouldn't be able to move till next day. Immediately a hotel worker was sent up with room spray, we opened all the windows then left for dinner. Upon return, we found the bedcovering had been changed which indeed helped remove smoke odor. We appreciated their sincere efforts to remedy the situation. Although the hotel is near the train station and the neighborhood is not particularly pretty, we felt safe walking to and from the station. Being near the station was advantageous since we had several pieces of luggage to haul. The biggest complaint we had... extremely hard mattresses and flat pillows made sleep somewhat restless.", "Date": "April 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Nice hotel, great location”", "Author": "clarant", "ReviewID": "UR57707076", "Content": "Stayed here for 3 nights last weekend and was very pleased with the hotel. It was always clean, staff were very friendly and helpful and room was a decent size with everything you need for a weekend stay. The hotel's location is the biggest selling point in my opinion as it's beside the Termini station where you can easily get bus/train transfers to and from the airports. It's also located 10 minute walk to the Colloseum and other attractions are only a short walk away. We were also very greatful to the staff as on our last day we had checked out of our room but left our bags in reception until we flew out later that evening, when we returned to collect our bags they had found my partners ipod which she had (unknown to us) left in the room by accident and had it waiting in reception for us. Overall very happy with the hotel and would have no problems staying there again.", "Date": "March 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Curitiba, PR", "Title": "“Nice hotel near Termini”", "Author": "eghack", "ReviewID": "UR54603730", "Content": "The best thing about this hotel is the location, a few steps from Termini and subway. On Termini there is also a shopping center with fast foods places and a supermarket. The hotel is very nice, rooms are large and clean. Breakfast was adequate. Staff friendly and helpful. It only lost some points because internet didn´t work on our room. It´s provided by cable, that didn´t work on my room. I´ve complained to reception, but it remained the same. The wi-fi also didn´t work. Both connections were paid, i think hotels nowadays should provide it for free, like water or eletric energy.", "Date": "January 28, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Brazil", "Title": "“STOLEN IN THE ROOM”", "Author": "HADT", "ReviewID": "UR46107124", "Content": "We stayed for three nights in Hotel Gioberti from September 27th to September 30th 2009. It was a family trip that was celebrating My mother’s 70th birthday. I was traveling with my mother, my wife, two sisters, my brother-in-law and two nieces. We stayed on the 5th floor in the rooms 504, 506, 510 and 514. We have been traveling around the world in the last 20 years and we never had any kind of problems until the morning of September 30th during our checking-out in Hotel Gioberti Rome. We had STOLEN during the night of September 29th from room 506 two professional cameras XTDS-canon 126151 with lens SIGMA DC18-200 between 7:00 pm and midnight. We went back to hotel at 6:30 pm in that day where we left inside the room 506 our cameras after a day of leisure and working around the city. One was recharging next to the bed and the other we left inside our backpack. We left hotel for dinner at 7:00 pm and returned at midnight because we had a flight early in the next morning. How surprised we were when we closed our bags in the next morning and the cameras had disappeared completely. TWO PROFESSIONAL CAMERAS registered in custom in our country before we left on September 19th. In spite of this terrible episode, unacceptable for tourists in the world, and for tourist operators, we didn’t have any kind of assistance from the hotel staff in the morning. The young woman that works in reception in the morning is completely incompetent to be in a hotel: unpolite, rude and unhelpful. We didn’t have any assistance for calling police, or any kind of document to register to the hotel the happening (in despite of a box at reception) as well as the internal circuit of cameras in hotel that the receptionist told us that only owner could access. After email to owner/manager we received a reply unsigned and how surprised giving us too later the instructions that the hotel staff should have done in the morning during our checking-out. To finish I am talking about a four star hotel not cheap and absolutely irresponsible for assistance to guests. AVOID it at any price!", "Date": "October 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Leinster, Ireland.", "Title": "“excellent”", "Author": "franceg77", "ReviewID": "UR31931097", "Content": "I have just returned from 5 nights in the Gioberti Hotel, we had 2 double rooms and 1 twin room on the 3rd floor; 2 of them overlooking the front. We found that the rooms were cleaned every day including fresh linen for the beds and clean towels. The shower was very good with plenty of very hot water and good power, the twin room had bath with shower overhead and the two girls were happy with both. A big plus was the very good air conditioner in all the rooms as it was very hot for all but 1 night of our stay. The breakfast was cold buffet with lovely meats and cheese, plus yogurt, fruit and breads. The location is very convenient for both taxi and metro and we saw nothing scary on the streets around the area at night. Taxi to Ciampino airport is 35 euro from Termini which is accross the road, or the hotel will get a mini bus if needed. there are lots of very good places to eat at very good value within 5 mins walk, also a good trattoria next door. I would go back again to the same hotel. Also some very good shops at Termini Station and the streets near the hotel.", "Date": "June 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Stroud, UK", "Title": "“Great hotel and location”", "Author": "lizStroud_UK", "ReviewID": "UR29538570", "Content": "This was a great hotel for doing Rome. Very central opposite the Station termini - so great for drop off from airports. Staff helpful and friendly. Breakfast great - lovely croissants! Could do most of Rome on foot from here. 10 min walk to colleseum. Can also reccommend restaurant by hotel", "Date": "May 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Washington State", "Title": "“Expect a 2 star hotel, very utilitarian but adequate.”", "Author": "JetLagQueen", "ReviewID": "UR28156591", "Content": "The best thing about the Hotel Gioberti is its location. We took the airport train to the Roma Termini across the street and were checked-in within 10 minutes of arriving in Rome. Very busy neighborhood, don't even think of leaving your windows open because of the traffic noise, but once the windows are closed, the soundproofing is great and it's relatively quiet for a huge metropolitan area. Cons: The bathroom was small, the hairdryer is a joke (20 minutes and hair still wet). The beds are rock hard and there aren't adequate electrical sockets. Internet access is 3 euro per hr. Typical cold breakfast buffet. Pros: Extremely convenient to Metro and bus stations. Felt safe even at night (lots of police and pedestrians in the area), lots of take-out cafes close by (try the tavola caulda next door, awesome roasted chicken and potatoes). The rooms have mini-refrigerators and safes. If you're satisfied with 2 star amenities and won't spend much time in your room, then this hotel is OK.", "Date": "April 16, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Manchester", "Title": "“Not 4 star, dingy locality, few services, no room service - POOR HOTEL.”", "Author": "HowardLines", "ReviewID": "UR26309354", "Content": "Proximity to the Termini Station is the only positive. The locality is dirty/seedy, you are constantly harassed by beggars and there seem to be many poor immigrants of African origin wandering around. I don't think this is an area you would want to wander round after dark. No way is this hotel 4 star - a little over 2 star at best. Whilst the rooms were quite clean they were somewhat utilitarian, the bed was hard, our room looked out onto a central well with washing lines from tenements opposite strung across the void.......unsightly and no privacy - you couldn't have your windows/curtains open because you were so closely overlooked. Breakfast was a basic cold buffet. No room service and little information given about any other services available. Rooms on the front would be no better because of traffic noise & fumes. The toilet in our bathroom broke down 5 times during our 5 day stay - same problem each time - it wouldn't flush and would malfunction again within a few hours of the \"engineer\" fixing it. A few times we had to resort to sluicing the toilet overnight with waste bin filled with water from the shower! We never received any expression of regret from the uncaring hotel management or indeed the offer of a move to another room. Never stay there again and would advise others to steer clear of this one.", "Date": "March 17, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Don't expect too much”", "Author": "NewxGate", "ReviewID": "UR25362912", "Content": "I’ve been meaning to write this review for some time. I stayed at this hotel last September (2008) I wanted a hotel near the station so I could make a quick exit for the express train for the airport first thing in the morning. This is not a great hotel, in-fact it is a very poor one. The only good thing is that it is close to the platforms for the airport train and it had good aircon and good sound proofing. The bed was hard and uncomfortable a small shower that hadn’t been cleaned properly and had several old bars of soap in the soap dish covered in black hairs. It had high speed internet access, but there were no spare plucks sockets to plug in your laptop, without having to unplug something else. This is not a good place to stay and there looked like there were better hotels close by, would I stay there again, NO.", "Date": "March 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "ontario, canada", "Title": "“Great Hotel in Rome!”", "Author": "Taralynne", "ReviewID": "UR21061647", "Content": "For our first trip to Rome the Gioberti Hotel was great. We took the train from the airport to the Termini and the hotel was less than a block away! Coming from small town Ontario, I at first thought the hotel area to be a bit seedy. But as my trip went on we found it perfectly safe and walked around at night with no issues. We were also able to walk to all attractions except the Vatican and the metro is super easy to use. We walked all day and ran from tour to tour so all you need in Rome is a clean place to sleep. This hotel has a lobby and good breakfast room. Where you can grab cereal, yogurt, bread, jam, meat, cheese, juice and very STRONG coffee for no cost. There are fresh towels everyday and the rooms are a good size for a European hotel. The front desk staff is great and booked us a car to the airport for an early flight. When it comes to Rome this hotel delivers everything you need! Note: And i warn if its your first trip to Rome the traffic is crazy...look both ways is an understatment :) And renting a scooter is suicide.", "Date": "October 21, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NY", "Title": "“Good Value”", "Author": "tdboldt", "ReviewID": "UR18199843", "Content": "My wife and I had a very nice 3 night stay at Hotel Gioberti from July 4th through the 7th. The hotel is conveniently located within a stone’s throw of the Rome’s Termini Station, which was great for cheaply getting two and from the airport (we took the express train whcih cost 8 Euro each i think) and for easy access to all the sites of Rome. The location is also nice because it’s located very close to all the car rental companies. We were renting a car for 5 days in Tuscany. It was very convenient for picking it up. The Staff at the front desk spoke English well (which was nice). They were friendly and were helpful with things like directions and with making suggestions about local trattorias. The room and shower were clean and very adequate, especially for European hotels. Unlike the previous person's air conditioner experience, ours worked great the room was very cool. I would definitely suggest this place to anyone looking for a good value on a Rome hotel.", "Date": "July 24, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Liverpool", "Title": "“Handy Location”", "Author": "JoJoLiverpool", "ReviewID": "UR17606404", "Content": "Me and my boyfriend stayed here, 3rd July-6th July. Room was very clean as was the bathroom, clean towels every day. Air Con in room was not so good. It was 30degrees outside so I don't think the air con could cope. It was quite stuffy. (My boyfriend said it was like a complementary sauna it was that hot in the room) On the Friday night, there was a power cut around midnight (just as we were getting in- if we'd been one minute later we'd have been stuck in the lift!). Good job we have a sense of humour. Have to say though, the location was brilliant as far as I'm concerned. We got the Terrevision bus from Ciampino airport which stopped on one side of the Termini. We walked straight through the Termini and the hotel was in the road opposite (about half way down the first block). If you walked down the street away from the hotel (the opposite way from the Termini) we found a selection of good bars there and the view from outside them was of Santa Maria Maggiore. There was also a restaurant on the corner of the street, a 10second walk from the hotel. We had a meal there one night and it was lovely. It was ideal for what we wanted, all we did was sleep in the room, the rest of the time was spent outside exploring. Just one point to make also, the mini bar was sooooo cheap! The water and cans of coke were only 1.50euro. The bottle beer was 3euro (compared to 8euro in some bars). Definately a plus side!", "Date": "July 7, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Wallend Tyne & Wear", "Title": "“Good hotel”", "Author": "holplan", "ReviewID": "UR16765304", "Content": "Stayed here for 3 nights in April. Room was spacious and well furnished and was spotlessly clean although I did find a cockroach in the bathroom on the first evening. This was however the only one I saw despite a thorough search so I convinced myself it was a stray! I was happy with breakfast which was tasty with a reasonable choice of meat, cheese, rolls cereals etc. I did hear a little street noise but far less than I have heard in other cities. The hotel was in a good location with lots of very nice restaurants within easy walking distance. I was here with a group of friends and for this type of break I would stay again.", "Date": "June 8, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Union City, New Jersey", "Title": "“Great Location - okay overall”", "Author": "michellef16", "ReviewID": "UR16615544", "Content": "Absolutely agree that this place has an amazing location. It is literally right outside the train station which was perfect for us. We entered and exited rome via train so it was nice to not have to drag the bags far. Also being near the train station allowed us to use the subway a lot. The 2 subway lines intersect here plus mostly every bus line goes here. Overall the hotel itself is very basic. We were barely there so it gave us what we need - a place to sleep. The breakfast was very basic but included. The beds were a little hard. If you are in rome to do a lot for a day or 2, I would recommend this highly since it provides an amazing location. Looking for a romantic place to stay - go to the spanish steps and pay more money.", "Date": "June 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dorset", "Title": "“Great Hotel.....at the heart of everything!!”", "Author": "L0veR0me", "ReviewID": "UR14677167", "Content": "This Hotel is at the centre of everything. It is just a few steps from the Termini station and walking distance to pretty much everywhere. After reading some of the reviews on here (after booking) I was a bit nervous about staying at the Gioberti but they must have stayed somewhere different to me, I'm sure! Although the beds and pillows were a little hard, after a tiring day out in Rome you don't even notice! They certainly weren't uncomfortable. Yes, the room was small but it had everything - beds, dressing table, bedside tables, wardrobe, bathroom.......... The staff were very friendly and helpful and the hotel itself was spotless. Breakfast was good with a choice of croissants, cereals, bread, meat and cheese, jams etc, orange juice and a huge range of coffee's and tea's!! I can't fault it.", "Date": "March 31, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "ireland", "Title": "“Great location”", "Author": "condelini", "ReviewID": "UR13867276", "Content": "Brilliant location across the road from the main bus and metro station. Hop on hop off bus around the corner. Hotel is clean and staff are very friendly and helpful. Kind of dirty outside but not that bad. Plenty of restaurants and bars nearby. Beds not that comfortable a little hard but this is good for your back anyway. A little noisy at night due to the bus stop outside. Visit the maria maggiore church only 5 minute walk away. Overall pleased.", "Date": "February 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Utrecht", "Title": "“OK hotel, but not 4 stars!”", "Author": "amnsmit", "ReviewID": "UR12319775", "Content": "We booked this hotel some time in advance and got better rates, but I think this also meant we got a room that wasn't as nice. The hotel is situated almost next to Termini station and a lot of sights are walking distance. The location is perfect! The room was small and a tight squeeze. The furnishings were nice, but the beds were in need of new mattress and you could really feel the springs in your back. This is not something I would expect from a four star hotel. The bathroom was fine, but the shower is very tiny! You bruse your elbows when trying to wash your hair. Besides this, the room was clean and tidy and you get clean towels everyday. The breakfast was ok, nothing special. Personel is very friendly. All in all it was ok, but not four star.", "Date": "January 4, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Leven, United Kingdom", "Title": "“Noisy but nice!”", "Author": "fortchio", "ReviewID": "UR10330127", "Content": "We stayed here from Sunday 21st Oct to Wed 24th Oct 2007. positives; *the rooms are a good size with mini bar, flat screen t.v. and a safe. *the bathrooms are nice and fresh with a very good shower *location is fine in relation to the sights, we walked to most including roman forum, trevi and pantheon negatives; *surrounding area can be very noisy at night *breakfast is very basic (but then this is the same at most hotels) overall this is a typical city hotel, clean but no frills. as the previous post said it is best described as adequate. as for the staff, they are not full of charm but did see to any request we had.", "Date": "October 25, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London", "Title": "“Adequate....”", "Author": "LyndseyLondon", "ReviewID": "UR10039078", "Content": "Gioberti is certainly very handy for Termini station - just across the road. Don't be put off by mention of the \"dodgy\" surroundings in the guidebooks - yes, it is a typical station area but there are a couple of decent places to eat and drink. Walk a couple of streets up to Cavour (which leads down to Collosseum) and you'll feel like Termini area is a world away. Hotel itself is satisfactory but you get what you pay for. If you're out seeing the sights all day, Gioberti is fine as a place to lay your head (on a rather firm mattress)!!!", "Date": "October 4, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "California", "Title": "“Beware of this hotel”", "Author": "ddbCalifornia", "ReviewID": "UR10018209", "Content": "We recently traveled to Italy and stayed in the HOTEL GIOBERTI in Rome, Italy. We and our traveling companions (who were also staying at the hotel) went to dinner and before doing so put our money belts in our respective hotel room safes (5 digit codes). We were gone two hours. In the morning we checked our money belt for cash and found it gone ($1000). We told our fellow travelers who checked and found that their cash ($500) was also gone. We went to the front desk and after explaining what had happened we were told that it was \"impossible\". We explained that, indeed, it WAS possible. They admitted that the manager had access to the safes. We asked to speak to the manager and was told she was home and did not speak English and that there was nothing they could do! We both filed police reports and have not had any feedback. This is about the most unusual theft we've ever heard of. Beware of the Hotel Gioberti - do NOT trust them.", "Date": "September 29, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Canberra, Australia", "Title": "“So close to the Railway station”", "Author": "Wattamillsy", "ReviewID": "UR8679168", "Content": "this hotel was a pleasant surprise being so close to the railway station we had expected it to be a bit run down. Gioberti exceeded all our expectations and comes highly recommended by two middle aged Aussies who travel extensively. It was comfortable, quiet and everything worked as it should. With only 100m to the station we could sleep in for our next journey.", "Date": "September 9, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Close to Termini, little remote for a single”", "Author": "jennibeans", "ReviewID": "UR8224441", "Content": "Booked thru GTAHOTELS... I found the hotel itself to be a nice value hotel. The staff were extremely helpful and friendly, so much that as a single traveler, I found myself hanging out with the night desk clerk chatting... The tours run from the hotel were great (depending on the guide) - especially the morning and afternoon tours! The night tour was beautiful, but the guide was constantly translating everything into 4 languages, so we missed a lot of information. The day tours were separated in buses by language, so you got much more for your time. The train station, Termini, was right across the street, couldn't ask for a better location for quick hops on and off, to and from the airport. Unfortunately, there were quite a few beggars and otherwise shady characters around, so I didn't feel comfortable venturing out alone at night. Nearby restaurants weren't open very late, but provided decent food, nothing special after a long day of tours, but adequate. The hotel's breakfast provided a similar continental style to most American value hotels, maybe similar to Residence Inn... The room was nice enough, the bed a little uncomfortable. Nice storage and mirrors, and a bigger bath than I'm used to in Europe. I would recommed the hotel to save money. However, I'm returning with my boyfriend this year, and we plan to stay somewhere that we hope to rate a 4-5...", "Date": "July 23, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Average hotel in excellent location”", "Author": "screen-gem", "ReviewID": "UR8079037", "Content": "Recent reviews are bi-modal: some loved it, some hated it. I'll be middle of the road and rate it a \"3\". Clean, good-sized rooms, though a little tired. On one hand, the location is great. Close to the Termini. We arrived in Rome by train and departed 3 days later by air. Platform #24 for the direct airport train is about 100 ft. from the door of the Gioberti. Excellent if one has to get to the airport early for an 845am departure. From the Gioberti, we walked to the Palatino, the Colosseum, Spanish Steps, Trevi Fountain and more. The Termini is a bus hub; from there you can get buses to the Vatican, Borghese Gallery, and anywhere else you want to go. It's also a Metro station, so you can take the Metro and get robbed as I did. But it is a \"train\" hotel, so the environs are a little seedy. You have to keep your wits about you - this is Rome, after all. There are many nice little restaurants within a few blocks. And lots of shops, internet cafes, and the like. The breakfast room is on the first floor (i.e. one above ground level). No views, bland decor, ho hum. You might get an espress or cappucino from the adjoining coffee bar, if you ask nicely. My wife says to mention the foot spa in the bathroom. After a long day roaming the Palatino, Colosseum, Vatican Museums, Sistine Chapel and other sites, she was delighted to come back to the room and soak her tired feet in the spa. Wow, a foot spa in a 3-star hotel!? You mean the bidet? Well, the etymology of \"bidet\" is from an Old French word \"bider\", which means \"to trot\". So if you have been trotting around Rome all day long, it's a great place to rejuvenate your tired tootsies! The front desk staff were friendly and helpful, particularly Stefano. Bottom line: nothing remarkable, no complaints, good value.", "Date": "July 8, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Florida", "Title": "“Terrible beds and Pillows”", "Author": "marjorieheckler", "ReviewID": "UR7726697", "Content": "Large pretty room, but not in a good area, had a few scary incidents on the street outside. Air conditioning not good. The worst was the beds and pillows. The beds were hard as a rock, and the pillows were thin and hard, and when I asked for others they brought two of the same. Plumbing didn't work well. TV didn't work and took two days to repair it. Location good central to attractions and termini station, but you get the riff-raff that comes with that area of town. Breakfast good but nothing to write home about. Most of the staff was friendly, except one man on evening shift that was rude and grouchy. Also towels very scratchy and not enough of them and they smelled of smoke. All in all I wouldn't go back.", "Date": "May 31, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Asia", "Title": "“Average hotel with excellent location.”", "Author": "Euro_Italytrip", "ReviewID": "UR7634523", "Content": "The rooms are big and clean, the breakfast complete though monotonous.The staff are friendly (except one Mr know-it-all) and quite helpful.The location is excellent, opposite the train and bus terminus makes it a bit noisy - the windows are sound proof so that helps.There is a supermarket in the terminus so buy your suff from there.The McDonalds is one minute walk. They could improve the lighting and reduce the chlorine in the water supply though.", "Date": "May 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kent", "Title": "“Wow! What a great hotel”", "Author": "LaDolcaVitaLadies", "ReviewID": "UR7594841", "Content": "This hotel was in the perfect location for five ladies travelling for 4 days to Roma! The staff were polite and helpful at all times. We arrived early and our room was ready, which was a wonderful bonus. We had a late flight going home, but our bags were looked after and we were invited to use the facilities to freshen up before we left. Great resturant at the side of the hotel with well cooked and resonably price food and drink, beware of others as we did get ripped off with 5E for a Sprite at another cafe in the area! Recommend the open top bus for a good all round taster of Rome, you can jump on and off all day. Another good way to get around is to buy a 4E ticket that you can use the Metro and buses all day long! Roma we miss you!!!!", "Date": "May 13, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Northern Ireland", "Title": "“Fantastic Hotel”", "Author": "MaryNorthernIreland", "ReviewID": "UR7420279", "Content": "I stayed in this hotel at Easter & i was impressed with it. The rooms were lovely & the breakfast was nice. It was easy access to the termini which was a great help", "Date": "April 23, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Ireland", "Title": "“Well pleased with this hotel”", "Author": "julesirelandeire", "ReviewID": "UR7393466", "Content": "Spent 5 nights at this hotel with a group of 9 persons from 5th April 07 to 10th Aril 07 and was well satisified with this hotel. Staff were very friendly,helpful and courteous. Hotel ideally located - close to Termini and close enough to walk to most of the major sights. Breakfasts were really good: cereals, rolls ,croisants, ham, cheeses,breads, yoghurts, tea and coffee and plentiful supply throughout the breakfast period. Rooms were roomy,clean and well serviced each day. Bathroom large and shower was good enough. I would certainly recommend this hotel to anyone and would certainly stay there again.", "Date": "April 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Somewhere in England", "Title": "“Friendly hotel”", "Author": "jsteveiona", "ReviewID": "UR7301755", "Content": "We have just returned from Rome and stayed at the Gioberti Hotel. We had read other reviews before we went and so had an idea what to expect. That said our expectations were far and away exceeded. we found a very friendly hotel with excellent staff throughout who could do no wrong, very polite and helpful, which made our stay all the better. We found our room very comfortable, and the beds really relaxing, especially after walking miles round Rome each day, we found ourselves having an afternoon nap, before we went out again for dinner. The rooms were spotless and cleaned each day to a pretty high standard. Our only gripe, was that there was no kettle in the room to make a cup of tea or coffee, but that was the only minus. The bathroom was very clean and had a great shower with plenty of hot water. The breakfast bar had plenty of continental food, which was very good. Again the staff could not be faulted when they were asked for something. The hotel is situated in a very busy area of Rome, very near to the train terminal, which made it easy to get to with our luggage. Although noisy outside it was very quiet on the inside, with double glazing in all rooms. We would definately stay here again if we went back to Rome.", "Date": "April 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "BRISBANE AUSTRALIA", "Title": "“Great Find. Excellent Location”", "Author": "gik", "ReviewID": "UR5973474", "Content": "My husband and I along with my sister stayed in this hotel for 4 nights in early September this year. We found that the location and staff excellent. The rooms were very clean and well maintained, the breakfasts were very good in catering for all tastes and it far exceeded our expectation. Having travelled extensively in Europe and Italy in the past we were pleasantly surprised by the size of the rooms. We would have no hesitation in recommending this hotel to anyone and will certainly use it again shoould we travel back to Rome.", "Date": "October 19, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "ontario", "Title": "“LOCATION LOCATION AND THATS IT...”", "Author": "goldengem", "ReviewID": "UR5943737", "Content": "This hotel was good for one reason...ITS LOCATION,. it is very cose to termini station literally 3 minutes walking distance. The hotel staff seemed nice but we didnt get a chance to speak with them. they were never acknoledging anyone. The hotel seems old and very out dated and there is a smell to it, and the sheets made me very itchy but i have to say its ok if your not picky. The room was very very small and so was the washroom and the small shower. the food in the morning at breakfast was ok but nothing grand. i wouldnt stay there again for comfortability. What ever you do do not drink anything from the fridge it will cost you an arm and a leg.", "Date": "October 11, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“location the only plus”", "Author": "rose_ling", "ReviewID": "UR5631411", "Content": "Execllent location! Very close to Termini, easily visible as well so not much of a need to ask for directions. The metro has a stop at Termini so its convenient to move around from the hotel as well. Good only if u're on a serious budget and need to be right next to Termini. Honestly we would have gladly paid more & not stayed there had we known. Place was quite old, furniture dated & its just not that exciting. Abit of a musty smell too!", "Date": "August 21, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ambler, Pennsylvania", "Title": "“Easy access to the Termini!”", "Author": "Nikkidog", "ReviewID": "UR5563638", "Content": "We spent our first night in Italy at this hotel and purposely booked a hotel close to the Termini....and it is a hop, skip and jump from the Termini! The hotel itself was adequate, although outdated. It definitely served it's purpose! Would not recommend to anyone unless they wanted some place extremely close to the train station.", "Date": "August 6, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "ENGLAND", "Title": "“Recommend”", "Author": "BARNYARD", "ReviewID": "UR5370982", "Content": "My wife and I stayed for our Anniversary weekend 16-18 June at the Gioberti and would certainly stay there again. The staff were very helpful and friendly, the rooms clean and well looked after. Breakfast was buffet continental and included selection of meats, cheese, cereals, orange juice, bread, coisants and a selection of breads, but beware of the drinks in the bar at night, we got charged 18 euros for 2 glasses of wine! The situation of the hotel is handy for the metro (2 stops, 2 minutes from the Coloseum) and the bus station. Some nice bars and restaurants nearby and close to the Tourist Office for the shuttle bus and other tours.", "Date": "June 21, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Sunrise, Florida", "Title": "“Nice location - Hotel OK”", "Author": "A TripAdvisor Member", "ReviewID": "UR5326903", "Content": "My husband and I stayed at the Gioberti, Rome in May 2006. It is located just steps from the Termini Station (trains, buses and metro). The rooms are small but clean, I can say the same regarding the bathroom, small but clean. Breakfast was included and we found that the buffet is very good, breads/pastries, ham, prociutto, salami and cheese, fruit salad, coffee, juice, cereals and yogurt. The recepcionists are nice and helpful. For the price it is OK. After coming back and seeing so many nice areas in Rome, I just tkink that I woul've preferred to be somewhere else in the city with more attractive streets.... being near the terminal has it pros and cons - the pros; near the ground transportation \"hub\", the cons: a lot of informal vendors in the streets selling purses, glasses, belts, t-shirts, etc.and naturally.... hundreds of people rushing by the streets pulling luggage.", "Date": "June 9, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Portland", "Title": "“friendly”", "Author": "Andy97239", "ReviewID": "UR5316948", "Content": "Just got back from our trip to Europe and while in Rome we stayed at Hotel Gioberti. Conveniently located next to Tremini Station and within walking distance from several attractions, this hotel would probably be a 3 stars hotel in my book. Our room was smaller than expected just based on all the pictures they have listed online. The tinny shower would be a hard challenge for anyone unless you have been practicing Yoga for several years. Over all was clean, with friendly personnel – they actually allowed us to check in couple of hours earlier than normal, having travel for 13 hrs. that was very nice. They have a terrific breakfast, unusually complex for Italy and Europe in general. The surrounding area is a little shady especially at night but probably no more than any areas close to the railway station in a big city. Overall a good choice if you are looking for convenience.", "Date": "June 7, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "belfast, ireland", "Title": "“great location, clean, friendly good breakfast i recommend”", "Author": "mcilduff", "ReviewID": "UR4628219", "Content": "we had a great time here the hotel is around the corner from the main train station and from were the bus from ciampino airport drops you of so no need for a taxi, it is within walking distance from most of the attractions including the collessium,trevi fountain,spanish steps,shops, bars you cant go wrong staying here, friendly staff with a sense of humour as we are 4 ladys with sense of humours and we like a good laugh although saying this the hotel is very quite. you can catch the open air tour bus just down the street and it is 12 euro you can hop on and of so is handy for visiting the Vatican although if going to the cistine chapel go very early about 8am as very long ques to get in. so all in all adding everything up i would definitely stay in this hotel again and i plan to do just that.", "Date": "March 17, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "NI", "Title": "“A decent enough hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4108875", "Content": "Stayed for 4 nights in Oct. Rome what can i say the weather was beautiful and what sights to behold. The hotel was fine, the room was clean, a good size but in general I would have to say that overall the hotel is deifinitly not UK standard 4* more like 3* but hey you get what you pay for and this hotel is VFM. The bed was comfortable, room safe was free, no street noise in the room we had at the back of the hotel and maid service every day. Breakfast the usual cold buffet type affair but never to badly queued, copious quantities of whatever took your fancy. Hotel bar wasn't open at night until i mentioned it at reception and asked them for a comment card. Previous reviews concerned me but we found the staff FRIENDLY absolutly no problems, happy to talk in english and give advice. The area is muti cultural and prime city centre. Consider your budget again and if poss I recommend move up to 5*", "Date": "November 13, 2005"}], "HotelInfo": {"Name": "Hotel Gioberti", "HotelURL": "/ShowUserReviews-g187791-d226624-Reviews-Hotel_Gioberti-Rome_Lazio.html", "Price": "$108 - $307*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Gioberti 20</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "226624", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/ee/48/ee482d500d920d9f8e77aba9c1c8d2d75large.jpg"}}