{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“Clean room”", "Author": "Tari_TX", "ReviewID": "UR137370000", "Content": "The rooms were on the small side. But included a refrigerator, microwave, coffe/cookies daily, and complimentary breakfast. The location was convenient to all activities our family had planned for the week.", "Date": "August 16, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sedalia, Missouri", "Title": "“Our stay in Branson”", "Author": "Charlotte S", "ReviewID": "UR137004819", "Content": "The room was clean enough. the lady at the front desk was very rude. Mini golf was free if you stayed at the hotel but the only person that told us that was the manager of the mini golf. He was very nice.", "Date": "August 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edmond, OK", "Title": "“Excellent!!!”", "Author": "D P", "ReviewID": "UR135492649", "Content": "This was a great place to stay. The hotel staff was really friendly and the rooms were up to date and very clean. The location was perfect with a miniature golf course basically in the parking lot! Overall a great place!", "Date": "July 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oklahoma City, Oklahoma, United States", "Title": "“\"In the money\"”", "Author": "Robin D", "ReviewID": "UR135293535", "Content": "Great location, staff was very friendly and helpful. Breakfast was great! Rooms were pretty clean, we did notice some trash under the bed. All in all pleased with hotel. Will probably stay there again.", "Date": "July 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Joplin, Missouri", "Title": "“Pleasantly Surprised!”", "Author": "VacationsForMe2", "ReviewID": "UR135201924", "Content": "I rented 2 rooms for 2 couples a few weeks ago and chose this place based on the promise of everything being remodeled and new and the extremely cheap price. We were only staying 1 night and though to give it a try. Check in was great, but neither couple got the rooms we booked. My husband and I got a room with 2 beds and we requested 1 bed, and my parents had also requested a room with 1 bed which they did, but it was in the \"presidential suite\". Neither of us complained because it wasn't that big of deal. FYI - the presidential suite means it has a separate bedroom from the main living room and bathroom, there was nothing special about it. Anyway, both rooms were very nice, appeared clean, had microwaves and refrigerators, comfortable beds, and double sinks in the bathroom, all of which was really nice and we were pleasantly surprised considering the price we were paying. The outside of the buildings are pretty, however building 1 has outside entry rooms and building 2 has interior entry rooms so I'm not sure what's going on there. Breakfast was continental and it ends very early and there wasn't much left an hour before it. Loses when we went down so get there early. I would rate this hotel 3 out of 5 because it's a terrific deal and is very nice. You don't even get a fridge at the Radisson if you need a comparison. I would recommend this hotel.", "Date": "July 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Not what I thought it would be!”", "Author": "JEH00", "ReviewID": "UR134939781", "Content": "Well after reading the reviews I decided that my husband and I would stay here. When we walked into the room I thought it was very nice for your basic hotel. I hated the fact that we had to walk up the stairs. The carpet seemed clean, but after my husband walked on it with no shoes on I noticed his feet were BLACK. The breakfast was not as good as the reviews said it was. Also just a word of advice, if your room is in the first building and you have trouble with walking or walking up steep hills, I would take the time and drive to the second building which is we're the breakfast is located. With that said, for the price it was and ok choice.", "Date": "July 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rensselaer, Indiana", "Title": "“Great value”", "Author": "Stasia1104", "ReviewID": "UR131848387", "Content": "Rooms are small but nice for an econamy Inn. Really enjoyed the Breakfast which was wonderfull every morning. Biscuts gravy, eggs, yougurt, cereal, coffe, juice, bagels. Great easy way to start a busy day. One less thing to worry about. loved how close it was to everything. Lots of neat things for pics right outside the hotel, was able to lounge in the pool and enjoy fireworks and sight and sounds of the city!! Would stay there Again.", "Date": "June 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wetumka, Oklahoma", "Title": "“Not completely satisfied”", "Author": "Betty L", "ReviewID": "UR128289496", "Content": "The location of the hotel is great, rooms were pretty nice. We stayed in the rear building which is where the breakfast is served so that was nice. The thing that I was most disappointed in was that my daughter's nike shox shoes were stolen by the housekeeping staff. I told the front desk but nothing was done about it. They said they would ask the staff. Ok place to stay if you keep your nice things under lock and key.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Saint Louis, Missouri, United States", "Title": "“JUST AWFUL!”", "Author": "Amela M", "ReviewID": "UR119206547", "Content": "I was here once before in their rear building and it was okay to say the least. The front building that houses the lobby is horrible and the staff is downright nasty!!! All I got was attitude from all of them and anytime I asked for anything I felt like I was inconveniencing them. I checked my bed sheets before I went to sleep (as anyone should). The sheets were full of black hair and had brown runny marks. I was absolutely disgusted! I am OCD when it comes to clean...and this place does not charge cheap either! I would say that Motel 6 for 39.99/night has better service. When I called the front desk to have the sheets replaced she said it would be an hour before someone could get there...with a nasty attitude of course. She brought me the sheets and with the look on her face might as well have said replace them yourself, so I did. I took the old one's off replaced them with the \"clean\" one's. At this point I was skeptical about what was clean and what was not. If you wanted to be treated like a person and not feel like you are sleeping in a barn that do not go to this place...go elsewhere! Unless you like being treated like crap than this would be a perfect fit.", "Date": "October 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Oklahoma", "Title": "“Good Hotel”", "Author": "nanaof5Oklahoma", "ReviewID": "UR116349361", "Content": "We stayed here from Tuesday ~ Friday, 2~ 4 of August. This was a decent hotel/motel. The bed was great but the pillows were HARD. Room was small but we weren't there to spend much time in the room. It was clean and so convenient to Tanger Mall and other places we went. There is a pool and by late afternoon it was pretty much in the shade. Didn't do the mini golf, just too hot. We enjoyed the cookies and thought the breakfast was good, especially since it was included in the price. We were in room G104 which was easy to get too. We walked down to breakfast which wasn't a bad walk. It is uphill coming back but almost everything in Branson is on a hill. I would recommend this to anyone who needs a clean, decent room for a great price.", "Date": "August 6, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "3"}, "AuthorLocation": "cadet", "Title": "“Choose a different hotel.”", "Author": "rrteacherCadet", "ReviewID": "UR115860825", "Content": "At check in, the two lady clerks were very rude and acted as if I was an inconvenience. The room was very small with oversized furniture in it. Breakfast was in another building so we didn't partake. Outside needs a good power washing. Bed was great.", "Date": "July 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hallsburg", "Title": "“Great location with adequate ammenities.”", "Author": "HallsburgSodbuster", "ReviewID": "UR107370780", "Content": "Close to all shows and resturants. This one of many older type motels in Branson that are a bargin. Has free putt putt 18 challenging holes. The continental breakfeast isn't worth the walk (down hill then up hill) if you stay in the main building. We had room 1200 a King room per pictures showed a couch not there. The room is on the end and faces west. This was a very largeroom but only had 2 plugs behind bed and TV.As large as this room is should have more and a desk would have been nice. The closet is an armoir so limited and the ironing board is a tabletop which the only place yo put it in order to iron was in the sink area and use the plug by the sink (really not safe). We didn't complain because of the value which was our choice. The carpet needs to be re-streched. The King size bed was very very good!!! Front desk were nice!! Two awesome shows to go to is The Haygoods and SIX awesome shows!!!", "Date": "May 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "corunna, indiana", "Title": "“OK hotel. Good location.”", "Author": "amandajh79", "ReviewID": "UR101969057", "Content": "Stayed March 25 and 26, 2011. The room was free as part of a travel club tour. From the pictures I thought the hotel would be more upscale. The rooms have been update though. Our room could have used a good spring clean. But for the normal price things were ok. Hotel consist of two buildings. We were in the second building. This is were breakfast was located. Make sure you don't have a room near the breakfast area on the first floor. Things would get loud in the morning. If you stayed in the first building (where front desk is) you will need to walk or drive to the second building for breakfast. Not a large distance between the two building, but there is a HILL. I didn't really understand the whole free cookie thing. They were on the front desk counter in the first building. So unless you were checking in you weren't going to go to the front desk to get one. The location of the hotel was good. Easy access in and out using the main entrance or a back one. Staff was friendly. Free Wi-Fi worked good. We had a king room. Had sleeper sofa, table w/2 chairs, flat screen tv, two sinks, blow dryer, ironing board. No swimming pool, but free mini golf.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“overrated”", "Author": "katsobiz", "ReviewID": "UR101569627", "Content": "The building was way in the back! very steep hills. Seen older building old fashion. Unfortunately, internet was out of order in the back building. So, I had to go main building to use my Laptop for my internet. The front desk clerk was very nice to me. Made a fresh bake of chocolate cookies! I think Chris was his name. Breakfast was little overrated it was fine.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sebring, Florida", "Title": "“Good value for the money, with excellent friendly staff”", "Author": "moe10000", "ReviewID": "UR89964689", "Content": "We found this hotel to be conveniently located, near everything interesting, and with an immediately friendly , very helpful and accommodating staff. Kyle was super, so was Chris, and the threesome on the front desk was rounded out by Melissa (?), also very helpful, patient, and efficient. I think it was Mary W. who did our rooms, and we were very satisfied with her service. The one negative is : please get a better breakfast menu, the gravy would be suitable for French plaster (just add straw). A minor point, as we were renting a good-for-the-value room, not the chef (but,,,, maybe the cookie-chef could make the breakfast. Mmmm, warm liquid cookie dough gravy). Enjoyed ourselves, would recommend for the price range. Point: beware! Be aware, the local airport has a monopoly on ground- transportation to/from, we were trapped there because we did not rent their-approved car, and friends of ours were TRAPPED there for 4 hours with a baby, with no mercy, and finally taken and dumped by the side-of-the-road offsite, (with the baby), ( I think the town fathers might be invested in this UnAmerican business activity, as we were told they would do nothing about it). Travelers are not warned ahead of time by the airlines of this amazing arrangement. I wondered if we had somehow landed in some south-american dictators regime, where they skin the gullible-gringo with all sorts of scams' This was a rude welcome to Branson, and departure, but the rest of our visit for 10 days made up for it. Sincerely MoeSmith", "Date": "December 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Nice place to stay”", "Author": "ousoonergirl1", "ReviewID": "UR84787129", "Content": "After traveling to Branson for over 25 years. I have stayed at some terrible places...the 1st Inn is not one of them. Check in was a breeze. Chris was super friendly as well as the rest of the staff. The rooms were updated and clean with flat screen televisions, refrigerator, and microwave, which comes in hand y with small children. The only problem I had was the bath tub didn't seem to have been cleaned from the previous guest and we found a pill under the bathroom sink. The room we had was very small, with 3 children (2,6,9) we seemed to be in each others way all the time. Other than that, 1st Inn is a nice place to stay. If your a couple or a family with no more than 2 small kids, it would be a great place to consider.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "2", "Overall": "2.0", "Value": "5", "Sleep Quality": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Collinsville, Illinois", "Title": "“Cookies what cookies”", "Author": "streetrodderfamily", "ReviewID": "UR83254686", "Content": "Well we booked through a booking company and it was ok for the price. Close to most of the major attractions. The marquee showed and they advertised cookies in all their literature. There were never any available anywhere (liar). Several issues with the room. First it was noisy-the rooms above and next door shower was terribly noisy in our room, could hear the camodes flush during the night. Next the room carpet really needed a shampoo. The bathroom was very dirty in the corners and all around the permiter of the room was filthy and the mattresses next to the headboard were filthy. Fire your housekeepers - there is someone out there that needs a job that would do a better job.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Independence, Missouri", "Title": "“Excellent place to stay, close to attractions & fun!!”", "Author": "sterling2010", "ReviewID": "UR82641932", "Content": "We spent 10 nights, enjoyed the comfy bed & accomodations. Free continental breakfast was very good, as were the delicious cookies baked fresh every afternoon. We played miniature golf (free) several times and even enjoyed it at night!! Lisa checked us in and was most genial during our stay. Chris and Kyle did their best to help in any way they could. Chris even got us the name of a tow service, dealership & car rental agency when friends had car trouble. If that is not going beyond the call of duty, then I don't what is!!!!! Claudette Bolin was very nice when she came to service our room on several occasions. She is a great example of the entire staff making \"you feel right at home\"!!! Definitely will come back and recommend to all our friends!", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lincoln, Nebraska", "Title": "“Over the top service ...without a reservation!”", "Author": "smiles5169", "ReviewID": "UR81940118", "Content": "Our last minute decision to stay in Branson brought us to this hotel after several stops at the competitors. Good value. Room, free breakfast , and free 18 holes of miniture golf...all on the premises...not to mention free cookies and coffee at the front desk. The clerk, Lisa, went out of her way to make our stay a memorable one. In Branson, one can be bombarded with offers for attractions and eating spots. Lisa's recommendations were spot-on helpful...We'll be back!", "Date": "October 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Had a Great Stay at First Inn Branson.”", "Author": "davedot", "ReviewID": "UR80383103", "Content": "We would like to state that the entire staff treated us great and took care of all our needs.", "Date": "September 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "S.Beloit,IL 61080", "Title": "“Good value”", "Author": "Judy_Garland_10", "ReviewID": "UR80220074", "Content": "Friendly helpful service from Lisa W. Free miniature golf is an unexpected plus in the middle of a very busy vacation spot.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Detroit, Michigan", "Title": "“BEST ON THE STRIP”", "Author": "deegoines", "ReviewID": "UR80160666", "Content": "The staff at this hotel was quite frankly the epitome of customer service. I checked in this Inn after checking out of the Riverboat motel. When I arrived at 1st Inn Branson, Kyle, at the front desk was very friendly and kind. I asked to see a room, and he was quick to show me one. The room was very modern and comfortable. Queen size bed with jacuzzi in the room! I spend 175 days of the year out of town, and I am convinced that the staff at 1st Inn Branson should conduct a customer service seminar. This hotel even included hot breakfast! not just some toasted bagels, but biscuits and gravy! The pool was very clean, and you could play mini golf for free! I absolutely love this hotel after only spending 24 hours there. I highly encourage you to look into this hotel.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Branson, Mo.", "Title": "“We have been very impressed with the hotel and kyle was very helpful to us.”", "Author": "Norm85", "ReviewID": "UR79835568", "Content": "We have been very impressed with the accomidations. The trip was a last minute thing and we had some trouble with the other vacations because we were doing this last minute. Our other plans fell thru with some friends of ours who had an RV they decided at the last minute not to come with us due to the wifes surgery. So we were left with finding our on accomidations. Doors kept closing and i just stumbled on this web site and the Mr. Nice Guys was very nice and then when we got here we were very satified. Kyle was very helpful with finding a church for us to attend while we are here our faith is very important to us so we were not relishing the idea of not being able to go. Thank you.", "Date": "September 16, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "1.0", "Rooms": "4", "Service": "1"}, "AuthorLocation": "", "Title": "“Never again”", "Author": "Clayt171", "ReviewID": "UR73070545", "Content": "While the renovations are nice the good ends there. There is no working ventolation in the bathrooms. You can not get dry in there after a shower. Hope you get a room in the lower building or breakfast will be a chore. There is a really steep hill between the buildings so if you walk you will work up a sweat. The pool water was cloudy and green. We were assured that it had been tested and was safe but it was the only pool at any of the area hotels tha looked that way. If I wanted my kids to swim in river water we would have vacationed on the Mississippi. The fire alarm went off twice in one evening. The second time was while my kid was in the shower. One small issue with a hotel I can understand but this was just nuts. Find someplace else.", "Date": "July 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mexico, Missouri", "Title": "“Great place to stay!”", "Author": "Catewompus", "ReviewID": "UR71532459", "Content": "Courteous staff. Clean rooms. Great continental breakfast. Would highly recommend.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fort Gibson, Oklahoma", "Title": "“Nice rooms”", "Author": "tonyjen02", "ReviewID": "UR70499868", "Content": "Upon check in, I found the front desk employee's very curtious and helpful. The room was clean and had all the items the on line ad had shown (microwave, iron, frige, etc). My family and I stayed a total of 3 nights. Every day our room was cleaned and restocked. There was however, some negative issues such as the long walk up to the pool (we stayed in building 2) and the disappointing breakfast. There was no veriety and if your not fond of biscuits and gravy then, well? Dispite the negatives it was overall a pleasant stay.", "Date": "July 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Broken Arrow, Oklahoma", "Title": "“everyone in our group of 8 family members give a big thumbs up”", "Author": "grininman", "ReviewID": "UR67649506", "Content": "Our four rooms were next to the dining area and some of our group thought it might be a little noisy in the mornings. But decided that was an excellent spot, not much noise at all and we used the area to meet in the evenings and talk. Everyone loved the setup with the microwave and refridgerator in the entertainment center. However, the one in our room needed the cabinet door to open the same direction that the fridge did. Had to keep turning the fridge at an angle to get it open and it was still rubbing the wooden cabinet door. The other three rooms had doors on their centers that opened the same direction as the fridge. No complaints on all other rooms. The free golf was great. It was as challenging as some of the fancy ones and saved us some moolah! We'll be back!", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Anaheim, California", "Title": "“Great room, staff and breakfast, could not ask for more.”", "Author": "2oldtravelersusa", "ReviewID": "UR65540108", "Content": "We had a package deal with two shows, Jim Stafford (okay) and Shoji Tabuchi (our second time) great show, don't miss this one... Also went to the Baldknobbers and they are hysterical, we were able to walk to the show from !st Inn which saved trying to get out of the parking lot after the show. Our room was very clean and large, bed comfortable, large flat screen TV. Closet to hang your clothes, table and chairs, plenty of towels and large sink area. Nice shower. Our car was outside the door easy to unload the luggage. We were by the office where they have a computer you can use. Breakfast is down a good size hill, if you have a disability better to get a room at the bottom or drive your car down. Breakfast is continental style with coffee, juice, cereal, hard boiled eggs, danish, toast. Large area with plenty of tables and a tv and outside eating if warm enough. Staff were all friendly and Terry the young man at the desk when we arrived was very helpful. We will stay at 1st Inn on our next trip. It sure spoiled us for the rest of the hotel-motel stays, they were a lot more $$$ and not as nice.", "Date": "May 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Wisconsin", "Title": "“No Recommendation here!!! At least not a good one!”", "Author": "Stifflersmom2", "ReviewID": "UR50977077", "Content": "This was the worst hotel I've stayed. The rooms are definitely overrated. Carpets were stained and ripped. Ceiling was falling apart in the bathroom. Smelled of cigarette smoke that they tried to cover up with Lysol. But that wasn't even the worst part. Our room was in another building from the main office. We had to drive around the back down a hill. So, saying that they are just across the street from the Grand Palace is not exactly a fact. We were told we wouldn't need a rental car, that we could get around in Branson very easily. Not a fact. Attractions are miles apart and the hotel is not a mere 25 minutes from the airport. It is 45 minutes to an hour and would have cost over $100 one way by taxi. I specifically called the hotel and asked how far it was from Springfield to their hotel. Again, they had their facts wrong. The night we got there, we tried calling the front desk around 11pm for a wake up call and no one answered after over 20 rings! We left early the next morning and were gone all day. We came back at 5pm to find no one had made the bed or replaced the towels or emptied the trash. We had been totally forgotten. I called the front desk. They sent someone down with towels. I had to ask them for another bar of soap...since the ONE they gave us the day before was used up. No replacement for coffee or shampoo were brought back the second time either. That night we called the front desk at 6pm to ask for a 5:30 am wake up call. They told us no problem...but we set the alarm clock in the room also just in case. At the last minute, I set my alarm on my cell phone...................You guessed it. No wake up call. The clock radio never went off. The only alarm to work was the alarm on my cell phone. We made our flight. This hotel was the most poorly run hotel I have ever seen. I would definitely stay somewhere else next time and be sure to rent a car with my flight ticket. Nothing is within walking distance....NOT EVEN THE FRONT DESK!!!!!!!", "Date": "December 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Little Rock, AR", "Title": "“Appreciated the central location on the strip.”", "Author": "SeeCubsGo", "ReviewID": "UR35981641", "Content": "We stayed at the 1st Inn Branson as part of a Travel Package with the obligatory Travel Company Presentation. The hotel was nicer than the couple of others we've stayed at in the past with these types of packages. So we were pleasantly surprised with the good location (on the strip, but down a little hill which kept it very quiet), updated rooms, and overall cleanliness of the hotel. The breakfast was not fancy, but adequate to start the day. Steve the manager and others at the front desk were always helpful and positive.", "Date": "July 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "California", "Title": "“Good Place To Stay”", "Author": "golfatpv", "ReviewID": "UR32210529", "Content": "We found the staff to be very friendly and helpful. The rooms are clean and comfortable. A flat screen TV is provided in each room along with a refrigerator. The Continental breakfast offers a variety of foods including cereal, yogurt, breads/rolls, toaster waffles and juices. Internet access is provided for the guests use in the lobby.The property is centrally located to most all shows. Elavators provide access to the various floors. For a moderately priced establishment, I think it's well worth a stay.", "Date": "June 12, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "3"}, "AuthorLocation": "missouri", "Title": "“Do not stay here”", "Author": "marktuc", "ReviewID": "UR29335554", "Content": "First inn Branson put a 250.00 fraudulent charge on my wifes credit card,Which we are pursuing thru the Attorney generals office and our credit card company.DO NOT STAY HERE OR GIVE THEM YOUR CREDIT CARD INFO.If we had read all the terrible reviews@yahoo Travel and others we would never have stayed here.BEWARE worst experience ever was at this place!!", "Date": "May 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Illinois", "Title": "“GOOD CHOICE”", "Author": "mariejackson", "ReviewID": "UR28331786", "Content": "Since we went to Branson on a time share promotion we did not pick this hotel ourselves, but we were not disappointed. The front desk were very friendly and the afternoon cookies on the counter were to die for. Our room was a double queen in the back side of building 1. We were glad there was a back exit so we did not have to drive up a steep hill onto route 76. Loved the flat screen tv and our room was clean. The pillow top mattress was comfortable and each bed had 4 pillows. Our room had a coffee pot, microwave, and refrigerator. For breakfast we had to walk down a hill to building 2. This part of the hotel had indoor corridors and best for handicapped accessible. Both building 1 and building 2 had elevators. The breakfast room was very nice and clean. The counter that was set up for breakfast was very small. They only offer waffles, bagels, English muffins, donuts, cereal, fruit, yogurt, juices, tea and coffee. The lady that set up the breakfast was very very friendly and kept the area very clean. If I stayed here again I would request building 2 which is a flatter area for walking. Would I stay here again-yes.", "Date": "April 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "5", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "High Ridge", "Title": "“Noisy, misadvertised and overpriced!”", "Author": "atime2dance", "ReviewID": "UR21029332", "Content": "We were put in a room directly under the carport, so LOUD diesel trucks and small buses would drive under at random times to check in, check out, or for some other unknown reason. Plus the carport serves as a PERFECT tunnel for the noise from large tourbuses who are loading and departing at times like 7am. Automatic wake up call right there. The walls are also still old and so are paper thin...we heard much more than we would have liked to over the course of late nights and the early mornings. We were not given a price and were shocked to find out that it is not comparable (as we had thought) to the other Branson small scale inns on the strip. 72.95 a night...81 with their two taxes, for ONE bed in a tiny room. The \"fitness\" center consists of one fold up treadmill and one stationary bike. Our bed did not get made by roomservice on the Saturday we were there. The bed looked very nice but when you sleep on it you feel a different situation the next morning...neck pains, back pains...you name it. The staff of this hotel is very nice and yes, they did do a great job remodeling it. But, you could get much more for your money at a different accomodation.", "Date": "October 20, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, OK", "Title": "“Loved it!”", "Author": "IanDin", "ReviewID": "UR20652936", "Content": "Great room, flat screen tv, comfortable bed, 4 pillows in each bed, clean bathroom, reasonable price. A 110 percent better than the nightmare we had from the previous hotel we stayed in.", "Date": "October 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arkansas", "Title": "“Great! Newly remodeled!”", "Author": "rev_angie", "ReviewID": "UR8616184", "Content": "What a wonderful remodel job they are doing. Still in the midst of construction, we were provided a room that looked new. new Beds, flat screen tv, microwave, refrigerator, and wireless internet. We felt like we were staying in a five star hotel. The staff was friendly and helpful. The room was spotless and quite roomy. If you decide to stay here while they are still remodeling, ask for a room away from the construction. We were awakened to sounds of construction at 7:15 am. However, when mentioning it to the front desk upon check out, we were quickly taken care of and offered a lower rate for our room. We will definitely be back.", "Date": "September 3, 2007"}], "HotelInfo": {"Name": "1st Inn Branson", "HotelURL": "/ShowUserReviews-g44160-d226629-Reviews-1st_Inn_Branson-Branson_Missouri.html", "Price": "$53 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2719 West Highway 76</span>, <span class=\"locality\"><span property=\"v:municipality\">Branson</span>, <span property=\"v:region\">MO</span> <span property=\"v:postal-code\">65616</span></span> </span></span></address>", "HotelID": "226629", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/a9/dd/a9dd4f92b72dd84394c2017f45d293d33large.jpg"}}