{"Reviews": [{"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dover, AR", "Title": "“Great place for the money”", "Author": "grandmaDover_AR", "ReviewID": "UR115822115", "Content": "This is not a 5 star motel, but it served our purpose of a place to sleep, good swimming pools for grandkids, and easy access to Hwy 76, We had 3 rooms rented and they did a great job and got the 3 rooms together in building 3. I have read other reviews about this motel and I would like to comment that we did not find any bed bugs or filthy beds in any of the 3 rooms. Rooms were very large and no outside noise to keep you wake. For the price it suited our needs. Grandkids loved the indoor swimming pool, didn't get a chance to try the outside one. Staven Marven restaurant is right there that has all you can eat crab leg buffet at night, so that even made it better. We will use this motel again.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Fairland, Oklahoma", "Title": "“Bed Bugs!”", "Author": "dodgedriver", "ReviewID": "UR115244055", "Content": "Although the rooms were nice i woke up with bites all over my back and arm itching like crazy! sheets had stains on them carpet was sticky i had to keep my socks on the entire time they put us way in the back all the way up on the top floor the hotel was not full?????internet never worked.i dont have medical ins so i cannot go to the doctors!", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Kansas City, Kansas", "Title": "“Can You Say \"Bed Bugs\"?!!!”", "Author": "larrydana", "ReviewID": "UR115198560", "Content": "My husband and I stayed there just a couple of days ago. The room was dated but we did see it before we agreed. We knew it was an older place...liked the 2 pools and 2 hot tubs. We were told the beds were queens when in fact they were full size. Thought it was not a big deal...5 hours on the road ready to rest and swim. When I went to shower the curtain had mold all over it. My husband had his own pillows and I had mine. I did use one of the pillows and woke up with bites on my chin area. When we got home after 3 nights there..went to the Doctor and was confirmed bed bug bites. Bites on my chin, my side and on my stomach. Even though the staff was kind, I will NEVER stay there again!", "Date": "July 9, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Greers Ferry, Arkansas", "Title": "“Stay away from Blue Bayou!”", "Author": "scrapingChick", "ReviewID": "UR101805971", "Content": "My husband and I come to Branson for our 14th Anniversary. We wanted a room with a jacuzzi. We tried the Caprice first but they were booked so we tried the Blue Bayou. They had a room for 69.95 with tax 78.00. I took the room without looking since we were in a hurry. We dumped our stuff in the room and went to eat. We got back to the room about 10p.m. and decided to try out the jacuzzi. I started filling it when I noticed hairs all over in the jacuzzi. I called the office and the lady said she would come clean it. I thought I might better look at the sheet. It had a big stain on it. I asked her to change it. She said they had a new housekeeper . She asked if she could check the bathroom to make sure it was fine. Awhile after she left I went in the bathroom and noticed hairs in the tub. The floor had not been vacuumed either. It was the nastiest place I have ever stayed! I would have left if we hadn't been so tired. The bed was uncomfortable with a blanket for a mattress pad which shifted all night. To top it just before we left someone was going down the stairs and the bottom one broke! The manger offered to give me a free night stay (which I refused!) or give me $23 cash. I took the $23 cash, but will be calling health dept and chamber of Commerce tomorrow. STAY AWAY FROM BLUE BAYOU!!!!!!!!!!!!!!!!!", "Date": "March 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Illinois", "Title": "“No Problems”", "Author": "JnR2", "ReviewID": "UR78005389", "Content": "We have stayed at this motel several times and experienced NONE of the problems of other customers. We made advance reservations and they were kept. Our room was small but typical older motel, comfortable beds, and a great location. We stay in the section near the outdoor pool and hot tub. This is the older section, but a good deal. This is not a 5-star hotel, but unless you're going to stay in your room instead of seeing the sights, you're safe here. The restaurant (Starvin Marvin's) is a typical older place, the food is fresh cooked and good, but could be a cleaner and updated. The seafood buffet is very good. We already have reservations for another weekend stay.", "Date": "September 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "aclark03", "Title": "“Great stay for the price”", "Author": "aclark03", "ReviewID": "UR56200520", "Content": "This was a great hotel for the price. It wasn't the nicest hotel room ever, but the service was amazing, the room had a Jacuzzi, a minifridge, and a microwave. So we had everything we needed. The beds weren't terribly comfortable, but like I said, it's a great deal for the price.", "Date": "February 17, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "ME", "Title": "“The terrible place ever”", "Author": "smallicelatte", "ReviewID": "UR43582602", "Content": "I was on vacation and stayed at this hotel. It's incredible nasty. When I first walked in the room, I just smell something stink. And the trash can's already full. There's something like mold on the pillows, then I returned them to the housekeeping And I asked for the new one, but they said they didn't have any. So my bf and I went to the office, but the manager's kind of rude. We was in the line for 10 minutes, but he skipped us casue he knew that we'd ask for something. He just told us to wait. Then kept skipping us when others're coming. I was so mad. He acted like we're not there. And all time i was there, my socks always turned black. The toilet's also broken. We even needed to spray the room to kill germ. Also it pissed me off more when there's a bunch of flies in my room, and again we needed to spray them. And the housekeeping nver came down at all. I will never recommend this place to anyone.", "Date": "September 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "oakwood oh.", "Title": "“great”", "Author": "samansandy", "ReviewID": "UR41417917", "Content": "our fourth time staying at the blue bayou and loved it the rooms wee clean our housekeeper was the best looking forward to our next visit", "Date": "September 13, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Illinois", "Title": "“Totally Disgusting”", "Author": "littleprincess7975", "ReviewID": "UR36433986", "Content": "Oh my gosh can we say filthy. Our socks turned black on the bottom. The shower curtain had black mold on it. Our comforter closest to the bathroom had a pee stain on it. They could never give us the right amount of towels even after telling them and leaving notes. The caulking on the tub was falling off and coming away from the wall. The toilet would hardly flush had to hold it down to flush it. We were going to complain and cancel our rooms but you can't even get your money back because of their wonderful sign that says if you cancel they can only give you a voucher to stay there again. Who in there right mind would want to stay there. REALLY. Please if you have small children don't stay there not good for their health my daughter who has asthma started coughing every night after baths and finally found out why the black mold. All I can say is disgusting disgusting rooms.", "Date": "August 1, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Worst Motel Manager Ever”", "Author": "jdnok74", "ReviewID": "UR35616585", "Content": "This motel overcharged us by charging our credit card for two nights when we only stayed for one. They charged our card as soon as we checked in, which they aren't supposed to do. They then told us they weren't able to credit the mistake and would only send us a voucher in the mail for future use at their motel. The manager was extremely rude and unprofessional. We had to contact the credit card company and dispute the charges in order to get the issue resolved. We travel to Branson often and will NEVER stay at this motel again, nor will we recommend it to anyone.", "Date": "July 23, 2009"}, {"Ratings": {"Overall": "1.0", "Location": "5", "Value": "1"}, "AuthorLocation": "Middleton, Tennessee", "Title": "“HORRIBLE ROOMS, HORRIBLE STAFF, HORRIBLE HOTEL!”", "Author": "Shelbylynna", "ReviewID": "UR33188623", "Content": "ok well we made reservations for this place a while ago and when we got there, they said they didnt see any reservations, they said they had put down 1 room for 31 people. As if that is even possible. So after we get that situated, they give us all one key and my aunt and her family had a man walk in on them because the people gave him their other key. . . .That night when i took a shower, i felt nastier after i took a shower then before i took it. It had mold on the shower curtain and had a long hair on the bottom of the tub and um my dad was the first to take a shower and HELLO he has short hair! And my mom had a roach fall in the tub while she was taking a shower and thats gross. Our comforters didnt even match! and the whole time i was in there, i never took my shoes off. Its a good thing i didnt bring a blue light because i cant even imagine what was on those sheets! ugh . .so anyways when me and my friends went to swim close to midnight, the people walked in and said that the pool closes at midnight but the night before there were little kids swimmin at 1 o'clock. So that was kind of bogos! And we also had shirts on because we were with our church group and they told us that we couldnt wear dark clothing because of the filter or someting. Um ok i have a pool and i guarenteed thats not true. They are very uneducated and dumb if you ask me. They do not know how to run a hotel and need to do something about that dump! Its unhealthy and pathetic. I will never ever go back to that place! It was pretty much torture. GROSS!!", "Date": "June 25, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Poplar Bluff", "Title": "“BAD CHOICE MADE...NASTY!!!!”", "Author": "prettygirltlm", "ReviewID": "UR32886167", "Content": "Arrived late Friday night got a room at Blue Bayou (Starvin Marvin's next door and we love to eat crab legs.)my husband and I and our 8 year old son and a nephew entered the room the smell was bad :( Oust or Lysol couldn't even tackle this smell). We stayed the night-put the towels on the floor to walk on and when we left the towels were nasty. We checked out the next morning and requested a refund for second night. Attendant wanted to know why we were leaving and we told him that it was too nasty for us to stay again. Our money was refunded and the attendant wrote on the bottom of receipt \"refunded to go find another dirty hotel\" . We will NEVER stay at this inn again. Needless to say we did not eat at Starvin Marvin's and after being in the room and knowing the same person owns both we will NEVER eat there as well. I'm going to check the health deparment reports on these businesses and hate to see what I find. You should check also. Wish I had before I stayed there.", "Date": "June 22, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "arkansas", "Title": "“will never recommend!!”", "Author": "dogluvr01", "ReviewID": "UR18214792", "Content": "My family had stayed at this hotel for 3 years in a row. In 07' we reserved our room for 08'. we go every year to the car show. They had messed up our rooms before, but this was the icing on the cake. Two weeks before our vacation in 08', they call to tell us they gave our room to someone else. we argued with these people for days. they would tell us we had the room then that we didnt. Finally, they proceded to get rather hatfull over the phone and even hung up on me. they then said that they had cancelled our room and we were not welcome at there hotel. A huge mess!! I wouldnt recommend staying at a hotel that is so unorginized. they are a greedy business.", "Date": "July 24, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Russellville, ARK", "Title": "“vacation room from hell”", "Author": "umanpapa", "ReviewID": "UR17383482", "Content": "Web site stated children under 12 stay free but was charged $10 a night for an 8 year old because I used a travel coupon. I was not given the room I requested There was a hole in the wall of the room Television had to be unplugged after using Bath room door did not latch. I refuse to stay there again. Motel was extremely run down. Management insisted I pay $10 a night for my 8 year old even though the website stated children under 12 stay free with parent. Extremely unhappy I would not stay in that motel again under any circumstances.", "Date": "June 30, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Kansas", "Title": "“You get what you pay for”", "Author": "campmomm", "ReviewID": "UR14900176", "Content": "We arrived in Branson with no reservations and selected this hotel simply by driving down the strip and looking at the prices on the signs. Price was great. Two rooms for under $100.00. Our 2 teenagers stayed in a room that was at the end, by the go cart track close to the street. Our room was right next door. The end room had newer carpet and was quite satisfactory. Our room had very old shabby carpet, smelled like vomit (I had to go and buy some Febreeze) and the cockroaches ran on the floor of the bathroom at night. The rooms were very dated and in need of remodeling. With all that said, we did stay for 5 nights and eventually the vomit smell did go away. We did enjoy the three pools. They were very clean and the hot tubs were in working order. Very welcome after long days of sightseeing. The location was GREAT! Walking distance to Ripleys Museum, Titanic Museum, Go Cart Tracks, Restraunts, and of course the three swimming pools and little shops. Thought about eating at Starvin Marvins, the seafood buffet looked pretty good, but there were so many other choices in Branson, we just didn't do it. All the staff were really nice. Very friendly and helpful. All in all even tho I was afraid I wouldn't be able to stay 5 nights in the room, it all turned out okay.", "Date": "April 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tennessee", "Title": "“Loved The Place and The Staff”", "Author": "CharlotteTennessee", "ReviewID": "UR11127940", "Content": "I don't understand all the bad reviews on here because we stayed at this property for over a month due to a job we were working on. The room was always fresh and clean and the staff was very helpful all the time. The managers Dave and Mary went Above and Beyond in my book to accomidate our needs and always had a \"Can Do\" attitude. Even the restaurant next door is awsome. I would highly reccomend this place for anyone visiting the Branson area.", "Date": "November 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "maryville, tennessee", "Title": "“Fun Place to Stay”", "Author": "madison40", "ReviewID": "UR8740089", "Content": "My family and I visited for several days in August and we really enjoyed the motel. The kids enjoyed swimming in the three pools that they have, one indoor and two outdoor. Our room was nice and the housekeepers were friendly and were very nice to our children, which I appreciated. The location is wonderful, right on the strip with-in walking distance to practically everything families want to do. The motel also has a back entrance on to the yellow route, which means you don't have to fight the sometimes congested 76 traffic. The front desk staff went out of there way on several occasions to make our stay enjoyable and we just want to say Thank You. From the Madison family in Maryville, Tennessee", "Date": "September 17, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "okiegirl084", "Title": "“dirty nasty rude”", "Author": "okiegirl084", "ReviewID": "UR8699932", "Content": "We had two rooms, the first rooms were not even clean beer cans everywhere. The next room appeared ok at first. But when we turned down the sheets we found blood stains. then the air conditioners quit in both rooms. No refund as prommised. We paid 60.00 for a room that was hot and nasty. Oh and no infocement of the curfew. Pool and hot tub activity went on until 3:00am and no contintal breakfast had to buy breakfast at starvin marvins it was nasty all the fruit on the bar was hot , the pancakes were tough and suasge burnt. so we paid 5.00 each for our kids to eat lucky charms since the food was nasty. I have stayed in the 20.00 a night hotels that were niceer than this one.", "Date": "September 12, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Texas", "Title": "“Bad Rooms Bad front dest”", "Author": "familyfuntexas", "ReviewID": "UR7655967", "Content": "Stayed there several times around 1998 and it was good, last summer the hotel we stay at was booked, went to the Blue bayou and paid for the room, the first room was terrible and I went and got another key to another room, they said no refund, I called them from the room and told them to come and take a look, the carpet was old, the walls were dirty the tv and nightstand were dusty Ithey could not have paid me to stay, welll they got mad and finally refunded me my money, always stand your ground, I think if I would really had called the police they would had shut them down if they could, the funny think about it was there was a man and his wife and wanted a room with their pet and they told them they did nothave a pet room available, I would hate to see the pet rooms Ike !!!!! Branson is Beautiful just find the right hotel !!!!", "Date": "May 20, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "canada", "Title": "“disgusting”", "Author": "joe055", "ReviewID": "UR7550810", "Content": "Room was filthy, bedding was not changed as advertised. Cigarette butts and dog feces around pool area for three days and no attention was given to this problem. We had stayed for several years previous and where satisfied but were very unhappy this time. Management did not seemed concerned when when we complained and did nothing to correct the problems. Maybe it is time to replace management before a once fairly decent place to stay goes further downhill.", "Date": "May 6, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "arkansas", "Title": "“Dirty”", "Author": "Arkansas-Mom", "ReviewID": "UR5782735", "Content": "We stayed in this motel over Labor Day weekend. Our room was dirty. My kids white socks turned black, they took a bath and got water in the floor, when I cleaned it up the towel was black. The indoor pool was not use able. They have notes on the mirror and door, stating that they will do an inventory of the towels and bill you if they are not there, and they will check the counter for burns. If they spent as much time cleaning the room as they do looking for more things to bill you for, the room would be spotless. We got no sleep the first night because the air conditioner was so loud. When we got up the next day I called the front desk to see if we could get a refund for the second day, ( they bill you when you check in) and they said I could only get a voucher to stay another time. I told him about the air conditioner and the dirty room. All he said is he would get us a new air conditioner, he never apologized for the shape of the room. The price is not bad for a good clean room, but we could of stayed in one that nice for $30, instead of $60, because they will not take a coupon on a holiday weekend.", "Date": "September 8, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“nice place to stay, had a great time”", "Author": "A TripAdvisor Member", "ReviewID": "UR5462590", "Content": "stayed here recently in june 2006 w/ my daughter and parents, had a blast. the room was clean and the carpet did not turn my socks black at all. the bathroom was small but hey did the job. the tub was clean as well. we stayed in room #405 and outside our front door was the spa and pool area. was a nice touch espcially w/a toddler. the location couldn't of been better as well. was close to all shows, nice food locations and across the street from a go-kart track/pizza world that was a nice added touch for the kid. the restaurant on site was called starvin marvins and i only ate there for the breakfast buffet, i can say the food was excellent and the place really stays busy all the time. price right as well. other restaurants in the area that are worth trying are the pizza world at the go-kart track, very afforable and great location. t-bone's steakhouse- was great even w/the kid. had awesome food and a band inside, the toddler just loved the band and the food wasn't so bad either for her. our bill was 70.00 but that included steaks for 3 adults, plus a kids steak as well, and drinks, plus beer......... overall- i would defintely stay at this motel again, had a great time and the rates were really afforable.", "Date": "July 13, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Unknown", "Title": "“Depends on room”", "Author": "A TripAdvisor Member", "ReviewID": "UR5043078", "Content": "I stayed in this hotel over a weekend. It was a large group of folks, so we had several rooms. My room was very clean with new carpeting, Room #503. I will say that I did see about three other rooms in passing and they all had the older carpeting, which makes a big difference in the appearance. I did not hear any complaints from the other 50 people I traveled with though. It was a fantastic location and the Starvin Marvin Restaurant buffett breakfast was very good, hot and fresh. I would stay here again for the price if I could be sure to get a room with newer carpeting again. I did not take a look at the pool or other ammenities. My group had most the hotel this weekend so I can't make comment about drug activity mentioned by another reviewer. I sure can't picture it there though.", "Date": "May 8, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“nice place to stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR4092486", "Content": "This is a nice place to stay at kids loved the indoor pool. Staff is friendly. Location is perfect.", "Date": "November 7, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Nasty Nasty Nasty”", "Author": "A TripAdvisor Member", "ReviewID": "UR3754375", "Content": "This hotel was just plain NASTY! The carpet looked great but turned my socks black. I had to call housekeeping 3 times because I found body hair all over the bath tub and the shower walls. There was dried blood on the sheets and brown marks. One of the maids told me that this hotel used to be a drug hotel, but they are slowly trying to rehab. I will NEVER stay there again. There are so many more hotels on the strip that charge equal or less, that I have heard are so much nicer.", "Date": "August 11, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Unknown", "Title": "“Great for the money”", "Author": "A TripAdvisor Member", "ReviewID": "UR3614684", "Content": "Me & my husband stayed here last year & our experience was just fine! It's actually one of the more affordable motels. We only slept there, we were gone from early AM to the evening. If you get an online coupon you can get an even better deal! lmk", "Date": "June 27, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Alabama", "Title": "“Would not stay there again!!”", "Author": "thetravelinghobos", "ReviewID": "UR3558034", "Content": "I was moved from the original room I had made reservations. Never did see it but it had to be better than the one I stayed in!! (You would hope) The carpet IS FILTHY!!!! Obvious stains and then you saw the bottom of your socks/feet!!! Absolutely black from walking on the nasty carpet!!! It didn't stop there, the bathroom floor was just as bad!!! The tub HAD NOT been cleaned prior to my stay as there was still a pink substance/residue on/in the tub!!!! Using a towel to stand on, the towel moved and you wouldn't believe the black on that towel!!!! I went straight way to WalMart and bought bleach to clean to tub and bathroom floor...Grime was so bad it didn't come off with one cleaning. Mildew all over the tub surround, I soaked it down with bleach also. PLEASE, there is MANY options in Branson, choose another!!!!! I certainly will!!! This time of year, during the week most motels/hotels had vacancy, I should have waited until I arrived to find a place to stay!!! My first time in Branson, oh well, live and learn!!!", "Date": "June 15, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Great place to stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR3012064", "Content": "Clean rooms, great pool, wonderful place to stay. Close to everything and anything. Perfect location for the kids.", "Date": "January 17, 2005"}], "HotelInfo": {"Name": "Blue Bayou Motor Inn", "HotelURL": "/ShowUserReviews-g44160-d226635-Reviews-Blue_Bayou_Motor_Inn-Branson_Missouri.html", "Price": "0", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3400 West Highway 76</span>, <span class=\"locality\"><span property=\"v:municipality\">Branson</span>, <span property=\"v:region\">MO</span> <span property=\"v:postal-code\">65616</span></span> </span></span></address>", "HotelID": "226635", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/c0/35/83/blue-bayou-motor-inn.jpg"}}