{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“Very good location, average hotel”", "Author": "Watermelon25", "ReviewID": "UR127649047", "Content": "Spent 3 nights here with my boyfriend and overall I am satisfied with it. The room was clean, but could have been cleaner... The twin beds are really old... Don't leave the window open for the night, because thousands of mosquitos will attack you! Very good location, and even though the hotel is where the \"dodgy\" area supposedly begins, we have never experienced anything dangerous or scary... Underground station is 3 minutes walk, and most attractions can be reached by walking. Breakfast was included in the price, and it wasn't decent, but good and just filling enough.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Male'", "Title": "“A Great Stay in Barcelona...Great Price too”", "Author": "Riffmontero", "ReviewID": "UR126662952", "Content": "When we first arrived to the hotel, there was a power failure and they could not check us in to our rooms, but the staffs were really polite, helpful and trying their best to entertain the guests while technicians arrive..we'll as a compensation they gave free room upgrades and we were transferred to the Penthouse suites. Great interior,..really modern. Great location too.. Walking distance to Metro, La Ramblas, The beach,.. Overall we had an amazing time in Barcelona, after a long day tour around the city, it was comforting to know that we can have a good night sleep in a cozy room. I highly recommend this place if your on a fixed budget and want your money worth.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New Delhi, India", "Title": "“Great location, shoddy service”", "Author": "MasJay", "ReviewID": "UR121300257", "Content": "This hotel is located right next to one end of La Ramblas in Barcelona. It's under a minute walking from Drassanes Metro Station. What this means is that you're conveniently placed in the touristic area of Barcelona. That said, the hotel was rather expensive for the quality of service we had. We made our reservation through booking.com and when we arrived the concierge looked at us quizzically and said \"Do you have a reservation ?\" and we said \"Yes of-course, we booked 2 days ago\", he looked through his list and eventually realized that we did indeed have a reservation (this took about 10 minutes..). Then he said that they would give us a superior room. This sounded like great news so we were pretty excited. Once we took the lift up to the 6th floor and got into room 610, the room was just average. In fact, I don't believe anyone should call this room superior -- though I understand that 'superior' is a relative term. The radiator in the bathroom was extremely noisy so we decided to shut the bathroom door. To our surprise the DOOR GOT LOCKED! We called the reception and the guy appeared with a straightened out paper clip and got the door open \"It's best that you don't close the bathroom door\" ..... \"Uhhh.. okay!\" Breakfast was decent. It included: 2 types of cereals, some cured meats, orange juice, baguettes, Spanish tortillas, Coffee, butter, jam, etc. We had made tea in our room the previous night and had left out the cups. The room was tidied up but the cups were not washed! They just turned over the cups and put them back to where they came from!! Would've preferred that they left them out.. Towels were clean but my towel had a hole in it. Bedsheets were clean but one of the beds didn't have a quilt cover and the quilt had some weird stain on it. WiFi was good and fast. We had a signal in our room but apparently they only guarantee it in the common areas. So officially there is no in-room WiFi. Didn't use the TV. There was a lamp in the room but it didn't have a power switch and didn't work when plugged in. During checkout the reception desk did not ask us if we liked our stay or had any comments/suggestions.", "Date": "December 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bethesda MD USA", "Title": "“not bad”", "Author": "sasiki1", "ReviewID": "UR121282122", "Content": "great place to be if you are on a tight budget, since alot of things in barcelona are expensive this is a great buy...Really close to hostels so you can expect alot of outside travelers who are really nice to meet and chat with.", "Date": "December 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montgomery, Alabama", "Title": "“Convenient to Las Ramblas”", "Author": "STraveler_11", "ReviewID": "UR119353665", "Content": "One block away from Las Ramblas. Room was very clean, light and airy and twin bed added for third person still left plenty of room. Balcony was larger than expected with table/chairs and lounge chairs. Good sized bathroom with excellent water pressure and very hot water in the walk-in shower. Breakfast buffet had good selection of fresh breads and fruit. Front desk staff was very friendly and helpful.", "Date": "October 16, 2011"}], "HotelInfo": {"Name": "Aparthotel Gutenberg Passatge", "HotelURL": "/ShowUserReviews-g187497-d2284734-Reviews-Aparthotel_Gutenberg_Passatge-Barcelona_Catalonia.html", "Price": "0", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Gutenberg, 7</span> | <span class=\"extended-address\">Ciutat Vella</span>, <span class=\"locality\"><span property=\"v:postal-code\">08001</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "2284734", "ImgURL": ""}}