{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Pleine-Fougeres, France", "Title": "“Treat Yourself”", "Author": "Jon B", "ReviewID": "UR127452047", "Content": "Having heard about Hilton Hotel's special weekend discounts, we made reservations to stay in the Hilton Barcelona in the heart of Barcelona's financial district, to go and see the 2011 Barcelona F1 Grand Prix. On our arrival at the hotel, much to our delight, we were informed that we had been given a free upgrade to a suite. The suite was on the 9th floor which gave us fantastic views over the city. The suite was large, well appointed and very comfortable, with a large bathroom, sitting/tv room, and a bed the size of a small country! The décor in the suite was perhaps a little old fashioned, but in good shape, and the colours used, created a very calm and relaxing environment. The public areas had been thoughtfully designed. The lobby for example was huge with very high ceilings and marble floors, however, it felt cosy, and welcoming, rather than feeling as impersonal as a railway station platform! The staff were fantastic, all very friendly, efficient and highly professional, with excellent linguistic skills. The hotel seemed to be extremely busy, with several large groups of oriental and American tourists, plus countless European tourists, but the staff handled everything in a calm and unflustered manner. Breakfast was included in the in the price, and was a self service, buffet style arrangement. There was an enormous variety of food and beverages, cereals, bread and rolls of all types, as well as a bain marie full of cooked items, plus a chiller with fresh fruit, fruit salads, yoghurt's, fruit juices etc etc etc. In the area surrounding the hotel, we found a variety of shops, restaurants and cafes. There was some building development on the go nearby, and gave the area, a rather dusty, unkempt feel, however, the further we ventured the more charming little squares and and walkways we discovered. In my view Barcelona is best visited without a vehicle, as it is one of the most frustrating places in which I have ever driven. The public transport system is fantastic, with an underground train system, buses and trams, all very reasonably priced, plus taxis by the score. Barcelona also seems to be a a good place for walking, with many quiet back streets, wide boulevards, parks and pedestrianised areas near the port. I have had a small taste of Barcelona during our three day visit, and am keen to go back and see more, and I would have no hesitation at all in going back to the Hilton Hotel!!", "Date": "April 8, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“NOT a 5 star hotel.”", "Author": "Selltell", "ReviewID": "UR126891615", "Content": "Altough i booked trough priceline.com, i expected a nice hotel. It bares the Hilton name, and it had a ***** rating. The room is old, small en brown and worn down. The bathrooms are old with dirty seems. The are probably well cleaned, but have a dirty feel to it. The manager was not willing to give us a better room after a normal conversation about the room status. He was getting annoyed by a complaining customer (me). The message to me was ; \"you have booked via Priceline so I can't do anything for you. Call Priceline. But the only refund in case of a earthquake or other disaster happens.\" Thank you kind man (not). Not willing to let this ruin my small vacation I contacted Priceline.com. I never had a better costumer service. After a small conversation they refunded my money(!) and I booked another hotel, Ayre hotel Rosellon. A four star hotel next to the \"la sagrada familia\". Much much better, new, clean, fresh, even bigger then the Hilton, and cheaper too. So no thanks to the Hilton. But thanks to priceline.com our little holiday was a succes!!!", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Ras Al Khaimah, United Arab Emirates", "Title": "“Great staff!”", "Author": "Lacuacera_cct", "ReviewID": "UR126534946", "Content": "The staff of Hilton Barcelona are all helpful and all smiles to us. Reception helped us when my brother's 50 euro paper was torn into two. We were able to use it to pay for a bus ride to airport. It was a 4 am flight, the housekeeper was kind enough to send our postcards. The restraurant were they serve the breakfast was a bit small but it has a comfortable feeling. Houskeeper and Room service were quick. The hotel is 10 minute walk to the nearest metro station however you wouldn't feel board because of the many shops available especially the starbucks!", "Date": "March 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Tbilisi, Georgia", "Title": "“Barcelona Spain”", "Author": "Christine-tb", "ReviewID": "UR126319213", "Content": "The hotel a little bit old and need an update but was good service and not bed location next to hotels is Starbucks and there you can use free WI-FI, netx to hotels is Trade Center", "Date": "March 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Room was average but breakfast very nice!”", "Author": "PragueFoxy", "ReviewID": "UR125118700", "Content": "I expected something more unique from a room in Hilton Barcelona but I guess it was just standard Hilton. Stuff was nice and friendly helped us with the map. Breakfast had loads of choices and everything was very tasty! Location is good there was a bus stop very close to the hotel and public transport was easy.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "london", "Title": "“Typical Hilton !”", "Author": "ARK2003", "ReviewID": "UR124147348", "Content": "I stayed at this hilton in barcelona back in june. It is easily accessible from the airport. It is situated on a very busy road. Bus stop is within 2 min walking distance. The only complain i have about this particular Hilton is what they charge for internet connection. I have been to many Hiltons in different countries and never encountered this issue, when asked staff about this, they were adamant that this is the case in all Hiltons...!!!", "Date": "February 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Banff, Canada", "Title": "“Great property, excellent service!”", "Author": "Gazpacho16", "ReviewID": "UR124044351", "Content": "I stayed at Hilton Barcelona when in Spain in 2008. The hotel offered great value and even though a little farther away from most of the tourist attractions in town, everything is still easily accessible by the Metro. Room service was quick and efficient and I really enjoyed the meal. The breakfast buffet was very good and the concierge and reception staff was professional and friendly. If I return to Barcelona again in the future, I will definitely return to this hotel.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "mrcheekys", "Title": "“Really nice”", "Author": "mrCheekys", "ReviewID": "UR123892093", "Content": "Had our wedding anniversary and spent 3 nights and the next day the manager sent a bottle of champagne and chocolate cake to our room.the hotel had the best breakfast. Also the beach was really close by and we spent most afternoon there and had dinner in the mall most nights.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lincoln, United Kingdom", "Title": "“Glorified travel lodge”", "Author": "anonanon17", "ReviewID": "UR119799722", "Content": "stayed here for 3 nights, location is brilliant, the metro is only 5 minutes down the road and is very cheap to travel on! Get a train from the airport and again is less than E5. The staff are not what I would expect from a supposed 5* hotel, they would respond to questions or queries but at their leisure. The bar is very expensive - E6 for a small lager, didnt eat in the restaurant but it looked nice! The room was clean and spcacious but so was the Days inn we had stayed in on the way to the airport - other than the marbel in the bathroom (very 70's) I honestly cannot tell the difference. Luckily this is being closed for refurbishment, id love to see it when its been done, in the mean time, dont fall for the lastminute.com secret 5* hotel because you will be disappointed.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“overpriced but well located for business”", "Author": "TrottingDr", "ReviewID": "UR119683996", "Content": "in room decor is basic, staff not very friendly but hotel is well located. average value for money. described to have offsite pool access and free internet on popular discount site but staff had no interest in honoring such advertisement.", "Date": "October 24, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Amsterdam", "Title": "“Good quality and accessibility for a reaonable price”", "Author": "Cristiano_9", "ReviewID": "UR119438333", "Content": "This hotel is located far from the city center, but all points of interest in Barcelona are easily accessible by metro which is conveniently linked by rail with the airport. Service and accommodation are decent.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Good hotel”", "Author": "DCoady", "ReviewID": "UR119272313", "Content": "The hotel was very clean, and although it was a distance from the city centre it was close to the Metro, and the Metro in Barcelona is very good and easy fo use. I was a little disappointed that the minibar was virtually unusable for personal things. The rooms on the front of the hotel were a little loud due to the outside restaurant but they do close it down at a reasonable time so it do not affect sleeping.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Camberley, United Kingdom", "Title": "“Good hotel - some areas look like they need an update”", "Author": "K15hy", "ReviewID": "UR119031233", "Content": "I stayed in this hotel for business 1 night in October- on arrival the staff were very friendly and efficient. I was given a nice, clean, spacious room with all the convieniences you would expect. The room did though like many other parts of the hotel looked dated- I'm sure I read somewhere that this hotel was being refurbished later this year- assuming they do a good job then I think this has the potential to be a very nice hotel. I will certainly be happy to give it another try once they have finished the work. One tip- there are 2 Hilton hotels on the Avda Diagonal- make sure you note the numbers (589-591) before getting in a taxi- whilst \"same road\" doesn't sound to problematic, this road for those of you not familiar with Barcelona is many miles long!", "Date": "October 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "cork", "Title": "“Hilton that tried to up my rate during my stay”", "Author": "bren53Cork", "ReviewID": "UR118690180", "Content": "Booked this hotel on there own site and took advantage of a Visit Barcelona deal which gave me 2 nights b&b barcelona card and a bottle of Cava for €171 which is a good deal for this hotel. When i arrived at reception i was dealt by a trainee who had to seek assistance with my check-in they asked me for my credit card or would they use the credit card that i had used to pay the advance payment i said i would prefer to leave cash for any extras so i left €100 in cash she had to get assistance in how to input same. Than i asked for the Barcelona card and the bottle of Cava she said they had no details on the system but i said it was on the voucher so she went to the back office and got me the Barcelona card and said i can collect the Cava from reception when i needed it. Went to the room as other reviews have said the rooms are starting to be a bit dated but they are clean and spacious the previous week i stayed the Hilton Gateshead, U.K. which was more modern. Everything was going fine until i tried to enter my room on Saturday night and my key would not work i went down to reception aand was told they had a problem with my credit card i said i had left cash for extra so she said my key would work so i though that was end of the matter but in the morning i had a note pushed under my door to contact reception i was told that the cash plus my advance payment was not enough to cover my stay they had trebled my room rate and were looking for a further amount of nearly €200. I explained the deal but she said she had no details of same but she corrected same i asked to see a manager i said i would go for breakfast and would he be available when i had finished my breakfast but he was not available or could he be located before i left the hotel", "Date": "September 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Hilton Barcelona - Sep. 2011”", "Author": "jack_ronnel", "ReviewID": "UR118563914", "Content": "Stayed there 1 night in September 2011 The Hotel is situated relatively far from City Center The rooms look outdated and in urgent need of renovation. Not the last word in comfort Nice Tapas restaurant next to the Hotel", "Date": "September 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“Very helpful doorman and great breakfast!”", "Author": "naturelover1234", "ReviewID": "UR118521420", "Content": "This hotel was to soon be closing for renovations but the room was clean and comfortable albeit a bit small. I was with my 12 year old daughter and we were there for 3 nights to get over jet lag and see a bit of Barcelona prior to embarking upon our Disney Cruise. All employees we encountered were kind and helpful but particularly the gentleman who assisted us with our bags at check in. He guided us to shopping, which was great and very close by and he also went out of his way to ensure that we had a taxi at check out to get to the cruise. The breakfast buffet was wonderful with a wonderful variety of delicious food and again, the service was great. Although this may be considered a business hotel, we found it to be very enjoyable and situated in safe and convenient location.", "Date": "September 24, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Cairo, Egypt", "Title": "“Good hotel, with nice location”", "Author": "ZIZO_Elegant_Travel", "ReviewID": "UR118185732", "Content": "Central location, with very good quality of service. Rooms are clean & well maintained. Staff are helpful, and food is great. I enjoyed my stay their so much.", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Jose, California", "Title": "“A GREAT PLACE TO STAY!”", "Author": "boomerdog2", "ReviewID": "UR117905917", "Content": "We spent two nights here and enjoyed it very much. The hotel is located near the Metro and is in a great neighborhood for walking and shopping. Accommodations are excellent and amenities are excellent, especially for Hhonors gold members.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "So. Cal", "Title": "“Convenient and comfortable”", "Author": "calitravelerSo_Cal", "ReviewID": "UR117545840", "Content": "Very nice, comfortable hotel with corteous staff. My daughter and I were going on a cruise departing from Barcelona. Since my husband is a Hilton Honors member and we know and trust the brand we decided to book the Hilton, even if there were hotels a little closer to the center. In my experience, when traveling overseas some of the things that we take for granted in an american style hotel become very obvious when you wind up overseas. Although the room was on a small side, it had all the necessary amenities. We were on a concierge level, which was nice and my daughter enjoyed the little snacks and drinks. The hotel is walking distance to the Metro stop Maria Christina and very close to Espana (the dancing fountains). It's also walking distance from a great department store El Corte Ingles. The Metro (subway) system in Barcelona is excellent, it's safe, clean and will get you anywhere you need to go. It has very clear map indications of stops, connecting lines and other connecting forms of transport. You can buy a ticket and take unlimited rides all day or for several days. The hotel is located on a Diagonal, a major thoroughfare. It's easy to walk down a few blocks and catch one of the \"Hop on Hop off \"double decker buses going all around major points of interest in Barcelona. This is a great inexpensive way to see the city and you can get off at any stop walk around and catch another bus at a designated stop. Maps and headphones (several different languages are spoken) are available. We would gladly come back to Barcelona and stay at Hilton Barcelona again.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London", "Title": "“Lovely hotel, bit of a walk from Ramblas”", "Author": "Millsy1978", "ReviewID": "UR117172305", "Content": "This is a lovely hotel in the business district and not too far from the Neu Camp on the main road in to Barcelona. The accomodation was very pleasant and the breakfast was very nice. This is one of our favourite cities and the hotel didn't let us down. The only slight downside is a long walk in to the centre, but there are cabs and trams right outside.", "Date": "August 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Cumbria, England", "Title": "“Decent breakfast and clean rooms but that's about it”", "Author": "Poddypea", "ReviewID": "UR116385238", "Content": "We chose this hotel for my friend's hen do because there was a very good offer with travelzoo at the time of booking. As a base for the weekend it was entirely adequate and the breakfast was a definite highlight. Taxis into town tended to cost around 10-15 euro and about 30 euro to the airport so after being initially concerned that we might be too far out, the location didn't prove a problem. The issue with this hotel is the service from the majority of the staff, especially those on the front desk and those in the restaurant. It was probably some of the worst service any of us had experienced in any star hotel, let alone one proporting to be 5 star. We were in no way a roudy group and were always polite with the staff and fortunately had a few Spanish speakers for those times speaking English with the reception staff got absolutely nowhere. Some highlights included: Some bedrooms not being cleaned by the time we came back early evening from a day out. In fairness to housekeeping they came straight away when rung, but you can't help thinking that this a 5 star hotel... My friend ordered a bottle of water from downstairs to be delivered to the room. After a series of cock-ups, including a rude phone call from reception telling her she was in the wrong room (she wasn't-they'd provided her with that key when checking in) about 45 minutes after ordering the water, someone just walked into the room without knocking whilst she was in the shower. On their website and in-room literature they advertise that they have the use of a nearby pool. When we asked we were told \"no\" there was no pool nearby. Only when one of our group who speaks fluent Spanish asked did they finally tell us where it was. Both mornings at breakfast it was lucky dip whether they asked if you wanted tea or coffee, or whether you just searched for it yourself and although most items were restocked, there was often a wait. They let us store our luggage in a room altogether on the last day, only to return to the hotel to find there had been a staff change and the new member of staff knew nothing about it. Que yet another protracted conversation with reception. To top it off my friend who booked all the rooms is embroiled in an ongoing saga of being refunded for a room she never booked, but that's for another day! In all, we summed it up as probably just a bit better than a Travelodge, which probably isn't a ringing endorsement for a 5 star Hilton hotel!", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Brisbane, Australia", "Title": "“ok, not upto hilton hotels standard”", "Author": "travelsmiles2011", "ReviewID": "UR116265589", "Content": "very average, wont stay there again. but they are going to do some renovations on the hotel.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Westport, Connecticut", "Title": "“Good hotel, but not up to Hilton Standards.”", "Author": "Jpepperman95", "ReviewID": "UR116220104", "Content": "Location: Far from major sites, but a short walk to the metro station. Located in the Eixample district, known more for its high-end shopping, and for business. The hotel blends in well with buildings around it, making it a little hard to find from the road. Service was on par with other Hilton hotels, although parking was quite expensive, over 30 euros per day. Wi-fi was an exorbitant 22 euros per day per device! Bring an ethernet cable if you need internet. The front desk staff seemed a little confused, although their English was very good. No pool :( The rooms needed updating. Our room felt very cold and industrial. The bathrooms were nice though. All in all, the Hilton Barcelona is a very nice hotel, but other Hiltons I have stayed at are much more accommodating.", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "2.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Hampshire, England", "Title": "“Disappointing - Not Up to Usual Hilton Standards”", "Author": "IanDT", "ReviewID": "UR116021751", "Content": "The room was acceptable, but nothing special, even though I got upgraded to an Executive room. The Executive Lounge was by far the worst I have ever used. Two rows of closely spaced 2 person tables in an internal open plan area. The refreshment drinks were very limited compared to lounges in other Hiltons, and, to make it worse, not replaced for hours after they ran out. Tables were left uncleared for hours - on one occasion when I went in the lounge 13 of the 15 tables had used glasses, bottles and crockery on them with no-one sitting at any of the tables. The lounge was supposed to be open until 23:00 hrs, but, on two of the three occasions that I got back to the hotel before then it was not. The first time I got back at 22:40 hrs to find the lights off, all refreshments cleared away and the tables set for breakfast. The second time I got back at 22:30 hrs to find all refreshments cleared away and the tables set for breakfast. There was, however, still a staff member there. She was rather rude, but did agree to turn the coffee machine back on. After I, and a couple of other guests, had got a coffee, she switched it off and left, well before 23:00 hrs. Breakfast in the restaurant also suffered from poor service. I usually went for breakfast 30 minutes before it closed. I don't think there was a single day when something hadn't already run out. On one occasion there was no dishes for cereals, no glasses, no orange juice and no bread for toast (all eventually replenished). On another occasion half of the cold meats, cheeses, etc, and half of the hot dishes had run out. Most were not replenished The food itself was acceptable, if you could get what you wanted.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Manchester", "Title": "“We would stay here again”", "Author": "LynneManchester", "ReviewID": "UR115518657", "Content": "Having read some previous reviews we were nervous about staying here as we were booked with another couple prior to our anniversary cruise. I needn't have worried, the staff were very good, took our luggage immediately the taxi arrived at the hotel. Check in was speedy and as a diamond member they upgraded our room to an executive room on the 6th floor, our friends were also upgraded and thoughtfully given a room next to ours. The room was spacious, clean and comfortable, all the usual extras, bathrobes, slippers, botles water. The decor reflects the hotel being in a non tourist area of a Spanish city so the executive lounge was rather dark but clean and we had no complaints. Had a good nights sleep, no noise heard, not sure if that was because we were near the far end of a corridor. I recommend the tapas restaurant opposite, very good and reasonable price. Its well placed for shooping. The breakfast was excellent, much better than the Del Mar where we stayed on our return. We wouldn't hesitate to stay here again, it was good value for money and a taxi into the city was only 10 euros.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Falls Church, Virginia", "Title": "“Nice Hotel”", "Author": "newtrackduq", "ReviewID": "UR115306505", "Content": "A friend and I stayed here for one night before a cruise. We chose this hotel so we could use my friend's Hilton Honors points. The hotel is not very impressive or attractive on the outside or in the lobby but the the hotel room was very clean and they beds were relatively comfortable. The front desk staff was very friendly and helpful with suggestions for dining and shopping. The hotel was conveniently located near the metro and was also close to shopping and dining. It was also a short cab ride to the metro and to popular attractions that the city has to offer. Overall the hotel suited our needs and we had no complaints.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bucharest", "Title": "“Cosmopolite hotel and location”", "Author": "Veve_33", "ReviewID": "UR115286472", "Content": "I have never stayed to a Hilton hotel before so of course I had no idea what to expected mainly because people tend either to love Hilton or to hate it. But not me … I like it because is a clean and nice hotel, calm and with a very nice personnel. Yeah, yeah, was a business trip but I would still like to see a different “picture” out of my hotel room and not the busy street or some old apartment’ buildings. Though it is the best location if you will not have any free time and just go to Barcelona for business reasons. :)", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Glad it is scheduled to be refurbished”", "Author": "Bobmeyer", "ReviewID": "UR115275694", "Content": "Staff very friendly and helpful. Out of the way from touristy attractions, but Metro close by. Took about 20 minutes to get downtown. The best and least expensive tapas we found in Barcelona was right next door at the restaurant adjacent to the Starbucks. Inside the hotel seemed old and out of date and the mattress was too soft. This should be corrected since I see it will be closed for about 6 months,starting in December, in order to be refurbished. There was a strong oder in the hall on our floor of ethnic food being cooked, but it did not get into the room.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Potomac, Maryland", "Title": "“Exceeded Expectations”", "Author": "danielbeez", "ReviewID": "UR114629045", "Content": "After reading the reviews here, we had very low expectations, but we had a fantastic rate and Hilton Gold status, so went anyway. We stayed on the executive floor, which provided us with a very nice breakfast, decent appetizers at night, and snacks/drinks for our kids all day. The room, a bit larger than the standard, was small but adequate. Unlike other reviewers, we heard little noise from other rooms, and we stayed here both pre- and post-cruise. The hotel is well-located, walk to two malls, the metro, and hop on, hop off bus. Tip: the Illa mall has a place that will do you laundry same day for MUCH less than the hotel charges (8 Euro for a shirt? geez!) What really made the hotel for us was the staff, especially a woman named Marycal in the lounge, who really went above and beyond. The only disappointment was that we called the night before departure to make sure there would be an SUV/minivan style cab available for our large party and luggage. We were told it was reserved. The next morning, no one knew anything about it. Fortunately, there happened to be such a cab in the line, otherwise we would have had to pay for 2, an extra $35 or so. Don't rely on Guest Services, especially if you are on the executive floor, use the concierge well in advance. Three more tips: (1) be very careful with your cabs. even though I showed the driver at the airport the address, he heard \"Hilton\" and took us to the OTHER Hilton. Another cab managed to squeeze an extra 5 Euro or so from us by taking us on a roundabout route. The trains are great and come very frequently, so it's easy to avoid taxis. (2) The hotel has a Hilton Honors checkin, but the line there was almost always longer than the regular line, just go there. If you are on the exec club floor, I think you can go right there to check in; (3) If you're a Gold member, don't forget to ask for access codes to the Internet.", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "charlotte, nc", "Title": "“Not great, but not bad either.”", "Author": "inhiding", "ReviewID": "UR114613854", "Content": "We spent four nights in a room on one of the HH executive floors. The rooms are nice, not huge but not small by European standards. Still, it was a little cramped for a four day stay and there was almost no room for our suitcases. The lighting in the room was a little odd. Bright lamps on movable \"arms\" were on either sides of the bed, but they were so bright it made reading a little difficult. Some softer lighting would be an improvement. The same is true in the executive lounge. The lobby was nice as you'd expect from a hilton. We didn't try the restaurant but the heavy hors d'oeuvres in the lounge were pretty good. The staff were all very nice, helpful and professional. This property is located in a business district and not really close to most of the attractions that Barcelona is famous for. There's a Metro station a few blocks away so you can take public transit to easily get around. There is shopping within a short walking distance too, and a few restaurants but not much going on around this property. If I wasn't using points, I probably would have stayed somewhere closer to the city center.", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Rockville, Maryland", "Title": "“Good Hotel”", "Author": "Yunitech", "ReviewID": "UR114335117", "Content": "Booked it after reading quite a few bad reviews. It's in a good location to visit Barcelona. The staff is top notch. Room is comfortable. The executive lounge is one the best we've been to. One nice thing is the location is close to the \"Hop On Hop Off Tourist Bus\". If you only have two days, you can use the bus to see a lot of sites, including those of Gaudi's.", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Atlanta", "Title": "“Post-cruise stay”", "Author": "sk84fungirl", "ReviewID": "UR110834508", "Content": "We stayed at this hotel after a 12-day Med cruise. The taxi cost was about 10 Euros from the port. The hotel is located in a business district with an upscale mall about a block away. It is also easily accesible to all forms of public transportation. Upon arrival, we immediately received assistance with our luggage. Upon early check-in, we learned our room was not ready. However, we were given a key and told to check back about noon which was a couple of hours later. No problem. We decided to walk to the Mall. We spend some time there, did a little shopping, and had lunch. Returned to the hotel well after the time provided and was still not able to check-in. We decided to sit in the lobby and wait. After about an hour, we noticed others checking-in. At this point I became frustrated and went back to the desk. S/W someone different and was told our room was ready and was when we received the key. Needless to say, it was best for me to go to my room at that time. The room was clean and a nice size. Bathroom was also clean. The walls in the hotel are EXTREMELY thin. We could hear ALL of a casual conversation from the room next door and they were not talking loud. Other than that, the room was fine. There was a 2-computer business center. There was a cost to use the equipment. We printed our boarding passes and did not use further as we thought it a little expensive. The breakfast was included in our stay and was Awesome. I do not think this is the Worst Hilton ever, or the worst hotel ever. It is an average hotel in a very nice area. I would recommend staying here if you get a good deal.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "4", "Rooms": "2", "Location": "2"}, "AuthorLocation": "GENEVA", "Title": "“Poor Hilton - Poor Services - Keep away from this Hilton !”", "Author": "WayanCompany", "ReviewID": "UR108333666", "Content": "Very Very Very Long story about our reservation : This hotel was totally UNABLE to link our reservations (booking and extension booking). 6 hours lost for no result. First time that we have a 5* \"Ikea style\" room hotel. bathroom was dirty and too small : totally unacceptable for a Hilton. Error of 152 € on the balance of the bill ! one hour lost at check out to make them recognized their error ! Least but not last, the concierge tried to transfer us to the airport into a limousine (75 €) to the airport instead of booking us a taxi with a baby seat. He said that no taxi have baby seat as if we used them during our stay : very curious !", "Date": "May 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Aachen, Germany", "Title": "“expect the usual hilton standard”", "Author": "PushingTheSenses", "ReviewID": "UR107005179", "Content": "stayed here for one night in november before attending a conference. although it is not in the centre or close to any of the attractions, there is a bus stop right in front of the door from where you can get downtown in less than 10 minutes. check-in was swift and due to my hhonors gold status i was upgraded to the executive floor. liked: sleek and modern design of room and bathroom (this applies to executive room) nice and airy lounge with excellent happy hour and breakfast friendly and helpful staff at reception/ concierge team", "Date": "May 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“The Worst Hilton”", "Author": "marian0286", "ReviewID": "UR105182675", "Content": "I've stayed in Hilton hotels from Beijing to Paris and this hotel is a disgrace to the Hilton name. Our twin-bedded room had less ambiance than a college dorm room with the only mirror in the dark entry hall. The bathroom was a lot nicer than the room, but the shower knobs were hard to use. There were times when the reception desk wasn't staffed and this was a problem when we came in around midnight and found our room cards didn't work. We couldn't find any staff in the lobby. I finally found a person in the restaurant who located a reception person to rekey our cards. The Executive Lounge provided a Continental breakfast that was adequate, and wine and unappetizing canapes in the afternoon. There was a concierge desk that was rarely staffed. The staff needs more training and knowledge of restaurants when asked for recommendations. They were not helpful. The hotel is a little far from the tourist areas but a few blocks from the Metro and it's easy to get around the city. I would definitely give this hotel a double thumbs down.", "Date": "April 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Airco not functioning - in 2010 and 2011”", "Author": "Meyersson", "ReviewID": "UR103055276", "Content": "We stayed at the HILTON Diagonal the second time an noticed that in July 2010 and in April 2011 the airconditioning was not properly working. The very small rooms are overheated and feel like a sauna. In general, the entire hotel would need a complete facelift and renovation in many parts. It is sub-HILTON standard. Next we will try the HILTION Diagonal Mar, the second option in Barcelona which seems to get much better ratings.", "Date": "April 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London, England.", "Title": "“Not one of the best”", "Author": "tint7003", "ReviewID": "UR100632621", "Content": "We stayed for two nights in March. This hotel is located in a nice district a little out of the Centre but close by the metro and other transport options at Maria Christina. There's a department store down the road and a Starbucks next door. As others have said the major drawback here is the very poor soundproofing between the rooms. Our neighbouring guest had a hacking cough and all night it sounded like she was in the same room as us - not conducive to a good night's sleep. Rooms are small but quite well furnished. The bed was poor and we both woke up with backache. The rate seemed high compared to other properties we looked at in the City and we left unclear what this hotel offers that justifies that. Staff were mixed - the main reception team were quite helpful but seemingly stretched - in the Exec Lounge they were aloof and disinterested. The exec lounge was a stark and very dark place with just two rows of cramped dining tables and chairs. Food and drink offerings there were ok. We got an upgrade to the exec level but certainly wouldn't have wanted to pay for it based on this experience.", "Date": "March 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Avoid at all costs”", "Author": "dei4", "ReviewID": "UR97036501", "Content": "Due to a mobile phone convention we had few options and thought \"it's a Hilton, how bad can it be\"? Worse than you could even imagine! Lobby seems ok but rooms are dirty and like prison cells - bed is hard as a rock. We paid over 500 euro for the night, checked out after that and had to pay the second night but it was still worth it not to spend a second night there. Moved to W Hotel - cheaper and fabulous", "Date": "February 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ashland,Ohio", "Title": "“Great service very convenient.”", "Author": "BobAshland_Ohio", "ReviewID": "UR97013239", "Content": "The trolly stand is right out front, making it very easy to get to the Metro and then about anywhere in the city you want to go. Staff was courtious and helpful. The lounge is very convenient but also very pricy. 9. 5 Euro for a draft is a pretty high. Breakfast was very good with any type of fare you might want. The 170 Euro for the room I felt was very high but since we had never been to Barcelona before we wanted a name we felt we could trust. Located in a very busy and upscale area so I assume the price was to be expected. WiFi was available for a price as was the computer usage in the business center. I'm satisfied with the hotel but now that I have been to Barcelona I'd probably find somewhere else to stay.", "Date": "February 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bournemouth, United Kingdom", "Title": "“It does the job”", "Author": "deniseacole", "ReviewID": "UR96306964", "Content": "The Hilton Av. Diagonal is a modern, stylishy decorated hotel with a great location. Room service was great: plenty of choices and reasonably priced. The room itself was okay. The only problem was the fact that it was BOILING hot in my room and I wasn't able to change this regardless of the countless times I adjusted the thermostat.", "Date": "February 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Southport, United Kingdom", "Title": "“Very Disappointing. Definately no way near 5* accommodation”", "Author": "frootie", "ReviewID": "UR94519876", "Content": "Location - 20 mins from the centre, but 5 mins walk to the Metro, so not too bad i suppose. Room - our 'executive' room was v small, air con didn't work properly, v basic and v v tired. I've stayed in travel lodges that could have wiped the floor with what we were presented with. V disappointed. Wifi - paid 170Euro for the room per night, and had to pay 17Euro on top for wifi! Not impressed that this was not listed as an extra cost at booking. service/staff - fairly helpful. Gave us a map to get around with basic advice, but didn't go much out of their way to any more than they had to. Queries to ask answered quickly before staff immediately moved onto other 'pressing' matters. I stayed here with my husband who was on a conference. He travels internationally on a frequent basis, and was shocked this hotel got anymore than 3*. I only tagged along on his trip to do some sightseeing, and have a much needed mini break, but needless to say, we were both very disappointed.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Good Value!! Close to Camp Nou.”", "Author": "LondonParisPeckham", "ReviewID": "UR94357773", "Content": "Its a mystery to me how star ratings are compiled. This has been given 5 stars but is not as good or as expensive as the Hilton Diagonal Mar just down the road, but the Diagonal Mar is a 4 star! Anyway, back to the review. This hotel should not be rated 5 star, 4 would be about right but it is quite cheap and it is good value. It has one exceptional feature which is - its within walking distance to the Nou Camp!! This is only going to be useful to you if you're in town to watch FC Barcelona play - but they have the best football team in the world so that is precisely what a lot of people are in town for! If you've ever tried getting back to the centre of Barcelona after a match (the stadium capacity is 98 000) you won't get a taxi and you will wait at a subway station for hours so a hotel that you can walk back to is a great advantage - its about a 15 minute walk. If you're in town for anything other than the football you will get a lot better location and service in the city centre ( this hotel is on the main Diagonal and a good way from the centre although there is a subway nearby). So I really only recommend it for its proximity to Camp Nou. Bedrooms are quite small and a bit tired looking and the view out of the window is nothing to write home about, but the rooms are clean and you get decent maid service. The bar is ok, again nothing special, the breakfast room which doubles as the restaurant is quite nice, service is good and they do a nice Sunday buffet. In conclusion - this is the place to stay if you're watching FC Barcelona.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“A subpar member of the Hilton chain”", "Author": "UrquhartHK", "ReviewID": "UR94052127", "Content": "Hilton pretty much defines international consistency. Admittedly I am pushed to think of any I would boast about staying at but generally they are 'okay'. There are some that are better than average (Hilton Frankfurt) and those a bit subpar. Barcelona is one of the latter. Rooms are on small side, curiously bare and lacking usual facilities, hotel not particularly well sited for the city and was 'dead' last two times I have stayed here; perhaps it is the recession. Staff service good though. Not a disaster but will seek to try somewhere else next time.", "Date": "January 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Healdsburg, California", "Title": "“Underwhelming Hilton”", "Author": "Angus_Inca", "ReviewID": "UR94043053", "Content": "this hotel is like a really cheap motel dressed up as a Hilton. we were staying there because we had hilton miles otherwise i think that we would have been extremely annoyed. the room was very small and the walls were paper thin...we could hear the next room's tv, coughing everything. the pain in the hallways was very dinged-up. all in all, it was really motel-quality. it is on the main artery through barcelona. there is good shopping nearby but it is a subway ride away from all the tourist areas of the city.", "Date": "January 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Lisle, Illinois", "Title": "“Both Good and Bad”", "Author": "aca828", "ReviewID": "UR92795373", "Content": "Service was excellent and staff was helpful and freindly. Room was a bit small but I am used to US accomodations. Upgraded to exec floor and food/drink was free - appetizers were better than typically see in the US Hiltons. Location is far from most tourist areas and my business office but Renfe stop is only 5 minute walk so the site worked out just fine. Will look to book here when I return to Barcelona.", "Date": "January 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Lodz, Poland", "Title": "“Very love standart for hilton”", "Author": "robikkrobikk", "ReviewID": "UR92258271", "Content": "This hilton is the lover service on world i thing. Rooms are dirty. Room service this is very love service, for repeor my shower i wait 2 hours i thing is very long for this standart hotel, one good thing in this hotel is food fresh and very exsotic for dinner shrims and sea food very fresh and good. I will never back to this hotel one more time.", "Date": "January 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Finland", "Title": "“Below Hilton standard”", "Author": "MustaPekka", "ReviewID": "UR91910004", "Content": "Checkin was fast and friendly. Got upgraded to Executive floor and free WIFI being a HH Gold VIP member. When trying to enter my room the key did not work. Went to reception in Executive lounge and asked for help. Lady told that I was never checked in !!! Room was rather small with a not too comfortable bed. Had requested a quite room which I also was given. Noticed that rooms closer to the main room must be quite noisy as traffic is heavy. Location is in financial district of Barcelona. For me that was fine as I had a meeting not far from the hotel. If you want to go to downtown, you would need to take a taxi or the metro. WIFI worked well being stable and having acceptable speed. Breakfast was standard Hilton being quite good. However, on the second day of my stay I wanted to have breakfast at opening hour being 07.00, but restaurant was not open. Staff were apperantly late still bringing out food so they opened 07.10 !", "Date": "January 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Pleasant stay - wouldn't expect less from the Hilton brand.”", "Author": "lettybug74", "ReviewID": "UR88455739", "Content": "The goal of this trip was to see as much of Barcelona as we could possibly see. The Metro stop was literally 2 1/2 blocks from the hotel so that made getting around Barcelona very easy (which was ideal since none of the main points of interest are nearby/walking distance). Jessica at the front desk was a dream! She worked very hard at getting our reservation taken care of despite my forgetfulness in printing out the details of the reservation to present upon arrival. The rooms were nicely updated and kept clean. We didn't take advantage of the in room services but really enjoyed the restaurant next door also! My only gripe is that computer access was a \"pay for usage\" there - no free wifi or free business center. The Starbucks next door was the fix to getting internet access. All in all, a nice hotel w/ good service.", "Date": "November 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "nsw", "Title": "“Not a 5 star hotel”", "Author": "Jaybeen", "ReviewID": "UR88295413", "Content": "I was disappointed with this hotel and felt the 4 star hotel rooms we had stayed in were better quality. Small basic room. All the singles in the group received queen and king beds and the couples recieved seperate single beds. Staff treated us (because we were part of a tour group) poorly and herded us into breakfast with 2nd class service", "Date": "November 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Not a 5 Star Hotel”", "Author": "paulos666666", "ReviewID": "UR86484377", "Content": "We stayed here for a weekend and booked last minute on lastminute.com secret hotels, so we got a good rate for the room. I have to say if we paid full price we would have been dissapointed. Heres a run down: Hotel Lobby - Very average, certainly doesnt have the wow factor when you walk in Hotel Staff - Spoke little English and never answered the phone, was friendly enough when you spoke with them face to face Room - Like an Ikea showroom as mentioned by someone else, very fake and not cozy Location - 15 min taxi from the airport and a 5 minute walk to the tube followed by 10-15 minutes to La Rablas, the main area. There is shopping centres both sides of the hotel. I liked the location, but some might find it to be a bit far out of the centre. Complaints... - When we checked in there was an open can of coke in the minibar. We asked room service to change it and went out for the day. When we got back it was still there. We asked again and this time they changed it and then had the cheek on check out to try charging me for it. Like I say the English level was very poor. Complaints.... In a 5 star hotel someone is on the door to help open it. This was a revolving door which required a push, noone was ever there to push it open. A small thing but just gives you an idea of the standard. Complaints....Internet is 22 Euro a day! Lucky theres a starbucks next door. To Summarize... Good enough hotel if your not looking for anything special. OK location if you like shopping and dont mind a bit of a trip to the centre. Dont expect 5 stars!!! I hope this has been helpful, it is a very honest review and I wish I had it before checking in Thanks", "Date": "November 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Good Value but not a palace”", "Author": "johnnywhite32", "ReviewID": "UR86230330", "Content": "The staff here are excellent. Very friendly and courteous. The breakfast is very good with a wide variety to choose from and plenty of choice. Location wise it is a quick 5 minute walk to a metro (Marie Christine) serving all main stops within a few minutes so it is very handy but set far enough away from the hustle and bustle to be a little quieter. It is also about 5 muntes walk the other way to a main stop for the 'Bus Turistic' open top bus tour with that stop covbering both city routes (blue and red). The rooms are what lets the hotel down. They are clean and tidy but no way are they 5 star. The decor in the corridoors of the accomodation is also jaded. The rooms themselves are functional allthough they are on the spartan side of sumptuous and feel a little bit like they are furnsihed with products from IKEA . The air con was almost non existent in the bedrooms which may be problematioc in a mid summer stay. In summary this is a very good 3 star hotel and comes nowhere near any other 5 star Ive experienced before. If you are not worried about sleeping in luxury then this is still good value for money (depending on the price you get it for I suppose) and the staff are better than many places.", "Date": "November 7, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "San Diego, California", "Title": "“It's like sleeping in an IKEA showroom”", "Author": "travelhappie", "ReviewID": "UR85918575", "Content": "I stayed at this hotel for a week for business. The hotel is not walking distance to any of the main tourist areas, but the metro is a straight ride to La Ramblas. And there are malls within walking distance which provide much more reasonably priced meals. The room itself is nothing special. I almost expected more out a Hilton, but it seems like they bought an old hotel and tried to convert it. And used furniture by IKEA to do it. The pics from other travelers pretty much say it all. The bed was not that comfortable for me, but the blankets were nice and fluffy. TV was nice newer flat screen and Wifi worked pretty reliably. The most annoying thing was that the shower curtain wouldn't close all the way and water would leak out. Inevitably there was mold in that area. Overall, it wasn't bad, but it seemed terribly overpriced at 150 Euro. The bar was incredibly overpriced also. I probaly wouldn't stay here if I was to return to Barcelona. And on a side note, there is square nearby and on the weekend we were there, there was some kind of concert and you could totally hear it from the hotel rooms on that side of the building and the music went until 3am. I'm not sure if it's every weekend or it was some sort of special event.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Reasonable hotel, rooms nothing special, service slooooow”", "Author": "Gobbledyspook", "ReviewID": "UR83582234", "Content": "I read the reviews about this hotel which described the beds as like something in a hostel. I think they are supposed to be trendy and modern, but they are really narrow. Rooms and bathrooms are really average, and the hotel is very expensive for what you get. Location is OK, on a nice avenue with some shops etc, but not really central. Service in the restaurants is veeery slow, even when there's virtually no-one there. Food itself is pretty good, but in a city like Barcelona the choice of restaurants means you don't really need to eat in the hotel. Bar staff are very nice, but staff at breakfast just tend to ignore guests most of the time. And my usual constant gripe in nearly all my hotel reviews: paying for internet access; how come hotels charge us for this essentially fixed-cost item? Answer: because they can. Why don't they charge extra for running water and lighting? One day this will seem as unacceptable as smoking on planes.", "Date": "October 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fayetteville, Georgia", "Title": "“Great location, friendly staff”", "Author": "GLM76", "ReviewID": "UR81869815", "Content": "We stayed here before and after a Med. cruise for our anniversary. The staff welcomed me as a Hilton Honors member (Diamond). We were able to check in early (which was nice after a 10 hour flight), and we were upgraded to the executive floor. The room was clean and neat, and the executive lounge was very good. The snacks were good, and the breakfast selection was above average. We had mentioned to the staff that it was our anniversary, and after walking around town there was a bottle of sparkling wine with a note from the staff when we returned. A very nice surprise. When we return to Barcelona, I would not hesitate to stay there again", "Date": "October 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Beaconsfield, United Kingdom", "Title": "“Lovely Peace & Quite!”", "Author": "redscrees", "ReviewID": "UR81710863", "Content": "Having just spent 5 days at the Eurostar Grand Marina, this was a welcome change. Fantastic tapas bar next door, good transport links, great shopping, peaceful bedrooms & scrupulously clean. Add to that really friendly & helpful staff and it was almost perfect! For a leisure stay (ours was half/half) a pool would be nice........& maybe free computer/internet access in the bar?", "Date": "October 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Below Hilton international standards”", "Author": "UkWorldtravellerplus", "ReviewID": "UR75810183", "Content": "I stayed here two nights because of its location, which is quite central. I am a HH Diamond member and although I was upgraded to an executive room, I found the room below the usual (high) Hilton international standards. The room was too small, the bed wasn't very comfortable and the furnishings and furniture looked tired. Moreover, there was a minor flood every time I used the shower. Wireless internet is very fast but the charges are outrageously expensive. Breakfast in the main restaurant was good but the service can be very slow. The executive lounge, however, is one of the worst I have ever encountered with no windows, dark and grim. The snacks were pretty ordinary and the drinks selection very limited. A big fly on the sandwiches was the 'icing on the cake' - you are much better off at the tapas bar next door, which offers excellent snacks at reasonable prices. In fact, it is the only reason I would consider staying at this hotel again.", "Date": "August 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "San Diego", "Title": "“O.k. hotel but does not deserve a category 7 Hilton designation”", "Author": "SanDiegoTravelGirl", "ReviewID": "UR72789783", "Content": "The lobby of this hotel is decent but the rooms are a bit shabby. The furniture has a modern look but the beds are cheap and uncomfortable. The bathrooms are o.k. but a bit small. The location is decent because you are near a metro station (need to take it to get to the city center). The metro system in Barcelona is pretty efficient. We are diamond members so we did have free access to the executive room (drinks in the evening, breakfast, snacks), however, I would not pay the 60 euros that they charge. Also, the internet is a rip off (17 euro per day). Go to the Starbucks nearby to use their Wifi. The staff were nice but not great. Overall, I would stay here again only if I was using free points or received an extremely good deal (the hotels in Barcelona can be a bit pricey). Also, Hilton should not be calling this a category 7 hotel (their highest)....more like a 4.", "Date": "July 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“A welcome return to the Hilton Barcelona”", "Author": "nigeltbd", "ReviewID": "UR72104000", "Content": "I have stayed here whenever I'm in Barcelona, and have always enjoyed it. The team are friendly, particularly in the executive lounge, and the location is good. The concierge are knowledgeable, and the choice of drinks and nibbles in the exec lounge is good. The lounge supervisor also wanted to check my flight time in case I wanted a late check out, which was a nice touch.", "Date": "July 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Go tell the spartans!”", "Author": "masspecguy", "ReviewID": "UR70601503", "Content": "Being a Diamond Member, I’d say in the grand scheme of things this was probably the worst room I’ve stayed in at any Hilton. Billed as a five star hotel ,my room of two single beds resembled more a Spartan Travelodge lodge. Than one of Barcelona’s best I’ve included two photos to give you an impression , The hotel definitely has a business outlook and if you are here for a day or two then you don’t mind too much .There’s also no swimming pool here, but there is a fitness area that I didn’t get to see. I was staying on the exec floor which gave me access to the lounge which is perfectly acceptable And they do a good job there. Having said that during my stay the toast machine broke, followed by the coffee machine . That still wasn’t fixed by the time I left the room. Rung reception for a late check out – nobody answered.Add to this the thin walls and you get to join in your neighbours conversations as well As a Hilton I would expect to give least 4 stars to this report but alas can only muster two Convenient location is the best I can credit it with.", "Date": "July 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "City of Joy", "Title": "“convenient”", "Author": "OrganicEarthling", "ReviewID": "UR67499980", "Content": "This hotel is conveniently located on one of the main arterial roads of Barcelona (Av. Diagonal). Its close to the main business district as well as the shopping and nightlife areas. Its a trendy hotel with an atrium lobby bar which highlights its young and cheerful feel. Rooms are spacious, comfortable and well laid-out with most amenities you would expect at a Hilton. The staff is very friendly and helpful in guiding you about the city. Mediterranean food is quite good at the hotel. The breakfast is very good and is the right mix of great taste and fancy presentation.", "Date": "June 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "United States", "Title": "“My favorite hotel in Barcelona”", "Author": "frequentflyer0610", "ReviewID": "UR66461228", "Content": "In many ways,this is a typical European Hilton. The restaurant is nice, but not spectacular, and the internet is expensive. The rooms are small, but perfectly nice - clean and pleasant. The bathrooms are spotless. The hotel location isn't right in the middle of town, but it is within five minutes walk of a metro stop, and only a few stations from Sagrada Familia and downtown. There are several restaurants in the area, and a Starbucks next door if you don't want the hotel breakfast. The executive lounge is one of my favorites at any Hilton. The breakfast is excellent, with meats, cheeses, breads, yogurt, fruit, and coffee/espresso/tea. There are snacks and juices available all day, and the bar in the evening is great. They have a full bar available, and a good variety of food, including some tapas in addition to the usual crackers and cheese. The thing that keeps me coming back here every time is the staff. The staff at this hotel are beyond wonderful. They are friendly, accomodating, knowlegable, and everything else you expect from a hotel of this quality. During my most recent stay, the airline had lost my luggage, and the hotel staff called the airline several times a day to track its progress (and keep me up to date) until it was delivered. I can't say enough good things about them.", "Date": "June 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Austin, MN", "Title": "“Disgrace to Hilton Brand”", "Author": "A3_Travel", "ReviewID": "UR64541333", "Content": "Walked into a room that was a mess (oops, staff did not clean it yet) - got moved to another room. In room # 2 TV set did not work (half of the screen is blacked out), after 1hour of waiting for hotel technician to show up to fix it - we got moved to yet another room. After talking to a manager about this experience, manager says : \"Sorry- this is all I can do.\" I would look into this particular operation if I was HILTON exec. Lots of visitors are not happy with service there.", "Date": "May 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hawthorne, New York", "Title": "“Great Place to Stay in Barcelona if you want a bit of quiet”", "Author": "AlpineOrchid", "ReviewID": "UR63449891", "Content": "This is the third time I stayed in this hotel. It's neat and clean. Extraordinary great Breakfast buffet. There is a Starbucks and some other business close by and you can take the tram into the Center of Barcelona. I found it very convenient for business purposes and great for sight seeing where you can flee the busy old town for a night of relaxation. About the only negative - it does not have a swimming pool.", "Date": "May 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cocoa Beach, Florida", "Title": "“THE BEST OF BARCELONA”", "Author": "gamboa109", "ReviewID": "UR63384105", "Content": "My husband and I spent 3 nights at the Barcelona Hilton. We found the staff to be very helpful and friendly, even though they all spoke excellent English, they tried to understand our not so excellent Spanish. The room was clean and bright, the beds comfortable and the public areas were attractively decorated, bright and airy. We would definitely recommend the Barcelona Hilton and would stay there again.", "Date": "May 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "CT", "Title": "“Overall excellence and service at Hilton Barcelona”", "Author": "CEOtraveling", "ReviewID": "UR61749460", "Content": "Highest level of service excellence. Staff is amazingly helpful and supportive paying attention to every detail and genuinely helpful. This supplements the oveall ambiance of sophistication, comfort and great location in Barcelona. The service at this Hotel is at the very top of any I have experienced at any five star hotel and has atypically outstanding service and excellent treatment of guests. This added to our overall experience and enjoyment of our visit to Barcelona. My second time in Barcelona and I will definitely stay at the Hilton Barcelona next time as well!", "Date": "April 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Decent hotel”", "Author": "global5000pilot", "ReviewID": "UR60462485", "Content": "Good for flight crews- 20 minutes from airport, 15 minutes to Ramblas and Olympic port. Some rooms are small, some very big (paid the same for both). Excellent concierge lounge! Decent workout room. A mall with plenty of restaurants only 2 blocks away. Hotel bar/restaurant were nice, food was good and service was excellent. The people at the front desk have always been very friendly and helpful. I like the Princess Sophia a little better, but the Hilton is fine.", "Date": "April 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Very average hotel. Will not stay again”", "Author": "nleow", "ReviewID": "UR59704221", "Content": "We stayed here in a recent trip because it was close to a business congress. By Hilton hotel standards, in fact, by any hotel standards, we were very disappointed. The front desk was very helpful on arrival, and the breakfasts were good. The foyer had a constant foul smell, and typically we had to wait about 5 minutes for the elevator. We were on the 5th floor and the window to our room overlooked the Avignuda Diagonal. The window was extremely dirty. The room was large, however the furnishings were sparse and old. Generally the rooms were clean. I am hoping this is a one off incident, however, on our stay, the \"do not disturb\" sign was on our door, however, a staff member apparently \"needed\" to deliver a package to our room and knocked, walked straight in (without waiting), and dropped the package in front of the entrance mirror. This is unacceptable. The room was overpriced and disappointing. I will not stay here again.", "Date": "March 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Austin, TX", "Title": "“Very good hotel”", "Author": "Austin_TXTexex", "ReviewID": "UR57544652", "Content": "The Hilton is a very good hotel. Close to metro, great breakfast, excellent staff. Assisted in retrieving clothing articles accidentally left in room. Expensive but nice.", "Date": "March 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“I liked the Hotel the staff were really friendly breakfast superb”", "Author": "MissJasmine", "ReviewID": "UR53519117", "Content": "Hilton Barcelona - 22nd December 2009 We stayed at the Hilton Barcelona for one night prior to a Christmas and New Year cruise. We booked through the Hilton website and paid 95 Euro for a standard room. As we are Hilton Honors Diamond members, we were upgraded to the executive floor. When we arrived at the hotel, a porter greeted our taxi and took our luggage in. Check in was smooth and we were on our way to our room in moments. The lift doors opened on the 4th floor and bam - we were in the executive lounge which had been designed to fill the space that would have been outside the lifts, several corridors ran off the lounge and some rooms opened directly onto the lounge. The design was to say the least, a little strange, but more of the lounge later. Our room was a couple of doors up one of the corridors. What can I say about this room? Was it a Hilton room? I'm not sure. It was very 'boutique' with white opaque glass wardrobe doors, lit from behind, a very low bed on wheels, beech wood low level shelves and the TV was on a shelf around 4ft off the floor. I'm sure it works for some people but we really did not appreciate the design. We then went into the lounge, which in the afternoon served snacks, nuts etc as well as tea, coffee, soft drinks, beer and wine. Hard liquor came out after 5pm. Again, as with the bedroom, I did not get the design of the executive lounge, it was rather impersonal and did not really seem to fit in where it was. That said, it had among the best spreads of drinks and snacks of any lounge we had been in, just a shame it wasn't very comfortable. At 3pm, afternoon tea was brought in, which comrised of sandwiches and cakes, very nice. We decided to take a nap, we did not sleep very well as the bed was not that comfortable. That evening we had a quick drink in the lounge before heading out to explore. To be honest, there's not that much to see close to the hotel and after walking around for about an hour, we went back to the lounge. When we had checked in, earlier that day, we were given a letter with the 'Rules' for the executive lounge, something we'd never had before, however, the rules stated that we could order room service and eat it at a table in the lounge. So I ordered a Pizza and my wife ordered a soup. WIth the tray charge, this came to 33 Euro. The order was placed for us by the exec lounge host. To be honest, the food was not that good, but we were hungry and there were not many choices available outside and in any event, we would be going on a cruise for 2 weeks, so I didn't expect to be hungry for long. After a couple more drinks, we retired for the evening. The a/c in the room would not blow cold, just luke warm, but that was ok as we found the room quite stuffy, we could not open a window and there was no extraction fan in the bathroom. Then at sometime after midnight, the electricity in the hotel went off, so did the a/c. over the next 3 hours or so, we tossed and turned, trying to sleep as the temperature in the room started to build. It was quite unbareable and we had no sleep whatsoever. A little after 4am the electricity came back on and only then we managed to drop off to sleep. In the morning, we went down for breakast, we did have the choice of either eating in the exceutive lounge or the main restaurant at no extra charge, so we chose the main restaurant. The breakfast was excelent with many choices and even sparkling wine to mix with your freshly squeezed orange juice. Once we were ready to check out, I spoke with the exec lounge host about the problems with the a/c and the overnight powercut. She said she did not have authority to deal with the situation and that I should speak with reception. I went down to reception . I explained our overnight isses and the receptionist explained that there had been work carried out at the hotel overnight and that the wrong section of the hotel had been turned off. She seemed to think that the explanation was enough in itself. I suggested that I had paid for a good nights sleep and had not gotten what I paid for. She said she would make a note and that someone from guest services would contact me at some time in the future. I explained that I was not happy with that and I asked to see someone from guest services now. She said I may have to wait. I said I was not in a hurry and that I would wait. After about 15 minutes a lady from guest services appeared and she again appologised and sorted things out for us I liked the Hotel the staff were really friendly", "Date": "January 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Nice hotel in a good location”", "Author": "Sidhuri", "ReviewID": "UR48439304", "Content": "We spent two nights at the Hilton Barcelona following a seven day cruise. We booked through Priceline and got a great deal. The rooms were very comfortable and larger than what we've come to expect in Europe. The hotel staff could not have been nicer and the restaurant had excellent food. The hotel was within walking distance of both the Metro and a stop for the tourist bus. Cabs were always available, as well. We originally wanted to stay on La Rambla but it was just a short ride away and we were pleased with the savings and the amenitites at the Hilton. We would not hesitate to stay here again.", "Date": "November 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Malmö, Sweden", "Title": "“Suberb service”", "Author": "Uffeben", "ReviewID": "UR47472000", "Content": "The kindness from all in the staff at Hilton Barcelone was fantastic. When I arrived at the hotel I just had been robbed. The personal helped me with everything direct. After that our vaccation continued. Thank´s for great value and service.", "Date": "October 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Chicago", "Title": "“Great Service! Friendly, Welcoming, Professional, but Fun!”", "Author": "GermanAmiGirl", "ReviewID": "UR46736223", "Content": "The staff was absolutely wonderful! They knew where to go to get the best food, the best entertainment, and how to cater to our needs! I went on a trip to Barcelona with a couple of girlfriends, and we loved the city, but absolutely adored the hotel and its staff! The girls at the front desk were so warm and welcoming, but also very polite, professional, and courteous. The hotel experience was so wonderful that I had to leave a note with the manager. The hotel is in the \"financial district\" but this only means that the hotel is near the metro, and is in a beautiful, very safe part of the city. I'm returning to this hotel with my mom towards the end of November, and feel the Hilton will allow us to enjoy a great weekend together! I'll write another review after our trip :)", "Date": "October 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "New York, NY", "Title": "“Proably great for a business trip”", "Author": "WanderSteve", "ReviewID": "UR46223086", "Content": "but a little too far from the attractions to be considered a first choice for a vacation.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "south carolina", "Title": "“Hilton Barcelona”", "Author": "frippsaltydog", "ReviewID": "UR43657269", "Content": "Our party of 10, with 5 rooms, had a great time at this Hilton property. The staff was very friendly, the location was perfect and we would definitely would stay there again. Thanks!!", "Date": "September 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Wiesbaden, Germany", "Title": "“ok”", "Author": "jo1970Singapore", "ReviewID": "UR39740089", "Content": "Stayed 4 nights on a business trip. Not much to say other than just ok. OK bed, OK linen, OK choice of TV channels in English, OK room service and reasonably friednly staff. Hotel was within 10 minutes cab ride of the Conference centre and within 30 minutes from the airport. Overall, would stay again on business but not likely my first choice for a getaway...", "Date": "September 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "saudi arabia", "Title": "“very friendly staff”", "Author": "mabulola", "ReviewID": "UR35512329", "Content": "My wife, 4 years old daughter and I, stayed at Hilton Barcelona for 10 nights. I was amaized by how friendly and helpful the staff were. Calling you by your name everytime, and very fast and swift services just to mention some examples... I really liked the location on the Diagonal and between 2 beautiful malls. It takes 5 to 10 minutes by taxi or tram to Plca Catalunya... Definitly gonna stay there again, and recommend it to all my friends.", "Date": "July 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Zagreb", "Title": "“Refurbish till it's too late”", "Author": "mash11", "ReviewID": "UR32564943", "Content": "Located a bit off the city center, this 5-star hotel has everything it should have, but somehow you don't really feel like it's a top hotel. Desperately needs refurbishing. It's been a long time (if ever) I've been to a 5-star hotel with an old worn down TV. Two single beds in the room had a military feel and look to it.. Service was overall good though", "Date": "June 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Excellent service hotel”", "Author": "fin_swe", "ReviewID": "UR31025508", "Content": "Slightly dated hotel. Very simple rooms for a Hilton. Excellent service. Location is still ok, although far from where the happenings are. Next to tram stop and close to metro. Close to department stores and former royal palace with gardens.", "Date": "May 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "2", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great hotel in business part of the city”", "Author": "brian796", "ReviewID": "UR29593739", "Content": "Clean hotel. Modern bathrooms. The HHonors lounge was great and the staff was very helpful in arranging some travel. If you are looking for a location close to tourism and nightlife, consider another hotel. If you are looking for a location near a lot of the businesses and offices along Avida Diagonal, this would be a great location.", "Date": "May 8, 2009"}, {"Ratings": {"Overall": "5.0", "Service": "5"}, "AuthorLocation": "Rockwall, TX", "Title": "“Excellent customer service”", "Author": "SteveRockwall", "ReviewID": "UR29014928", "Content": "This review is about the customer service of the Hilton Barcelona and some advice on the prepaid/pay-in-advance rates Hilton offers that you might be tempted to take. I bought a weekend trip to the Hilton Barcelona as my wife's Christmas gift, using the lower prepaid/pay-in-advance hotel rate. Unfortunately, my wife had to have emergency surgery right before our trip, so we were not able to make our Barcelona trip. Even as a Diamond Hilton HHonors member with Doctor's notes galore, getting a refund on the prepaid room amount turned out to be very challenging, and the Hilton Barcelona's excellent customer service were the heroes in this situation. To get the refund, I first called the US Hilton HHonors desk, who forwarded me to the US Diamond desk, who forwarded me to the US Prepaid help desk, they mentioned I'd have to call the hotel directly. I called the Barcelona hotel reservations, but it was after hours, so the call was routed to a European call center, who told me to call the hotel when the front desk was open. A day later and over an hour already wasted on the phone, I called the Hilton Barcelona hotel directly during their reservation desk's business hours and the attendant was very curtious and understanding of our situation and inability to travel, and they refunded the prepaid amount back onto my credit card. Some advice: buy the prepaid rates with caution as non-prepaid-reservations are very easy to cancel, and if you must cancel the prepaid hotel stay for a legitimate reason, call the hotel directly to request a refund and don't waste your time talking to someone in the Hilton call centers, it is up to the individual Hilton hotel to evaluate your situation and grant refunds.", "Date": "April 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "USA", "Title": "“Everything a Hilton should be”", "Author": "TravellerforBusiness", "ReviewID": "UR23064290", "Content": "Spent 3 nights in Hilton Barco in Nov 08. Hotel is 10 Metro train stops to the city or 15 min cab ride. Diagonal Mar Shopping Mall opposite Hotel is large with great shops. Open very late. Sea View Exec Room was fantastic. Modern, spacious, lovely. Bathroom massive and beautiful. Hairdryer rubbish. Staff service was the best (Russell from London awesome). Local staff were helpful, knowledgeable and upbeat. Gave excellent tips regarding football, local eateries and beverages. Exec Lounge was superb. Nice lay-out.", "Date": "December 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "US", "Title": "“Good base hotel”", "Author": "BigTrip20", "ReviewID": "UR22428110", "Content": "Probably a hotel used more often by business travelers than tourists. Very helpful staff, simple yet comfortable rooms and good location. We booked the hotel with points and were concerned about the location. There is a metro stop just one block away from the hotel, its surrounded by shopping and restaurant opportunities.", "Date": "December 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Wokingham, United Kingdom", "Title": "“A workhorse hotel”", "Author": "Berkshire_UK", "ReviewID": "UR21137154", "Content": "Last stayed at this hotel in 2002 and it appears as if nothing has changed. I mean nothing. It is a typical well worn business hotel that is used by business people and tourists alike. It is now starting to look a bit old and worn. The rooms are quite small with basic \"Ikea\" style furniture and fittings. Everything worked ok and it was clean (not spotless). The bath had a curtain that didn't quite fit, so the carpet into the bedroom and the door frame were starting to rot away. Nothing serious but why has nobody from maintenance noticed? Stayed for 4 nights and one day the room wasn't cleaned. Not a big deal, but had to wait a further hour before someone from housekeeping came. Breakfasts were very good. Hot and cold to suit most tastes. Staff throughout the hotel were very good, polite, attentive, although I did come across a couple of waiters in the bar area that spoke NO English. Very unusual in a European business hotel, but it was fun to point and smile to ask for what you wanted. Location is good from airport. 20 mins and 20 Euros by taxi. Metro is right down the road and is very cheap. 5.50 Euro for a one day \"all you can eat\" ticket. You can walk to the Ramblas tourist area in about 30 mins, but it is worth getting the metro back. Watch out for pickpockets.....they are everywhere in Barcelona. No problem in the hotel though with security.", "Date": "October 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cleveland", "Title": "“Great location for tourists & business alike”", "Author": "OhioVoyagerCleveland", "ReviewID": "UR21102516", "Content": "The Hilton Barcelona in the heart of the financial & high-end shopping district is a great place to stay for both biz & vacation purposes. The \"tram stop\" is 50 meters away & the Metro (subway station) is 100 meters away. Staff all speak excellent English, are very accomodating & respond favorably to upgrade requests if the rooms are available. Many Airline Crews stay here & the morning brunch is incredible (more extensive than what's offered at many Ritz Carltons). Inquire about their \"Packages\", they're definitely the deal of the trip. Easy access to la Ramblas & only 20 minutes to the airport (20 Euros + luggage charge). I'll definitely stay here on my next trip to Barcelona.", "Date": "October 22, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New York", "Title": "“disappointed loyal hilton member”", "Author": "prysoni", "ReviewID": "UR20309702", "Content": "1. Room maintenance defective-we have photos 2. Room cleaning done after protest at 14.20 hours 3. So-called gold priviledges have been changed one month ago with forewarning... 4. Net price preposterous in the current market and competition... This is a sure way to lose brand clientele--and to fill the hotel with airline crews--the only visible other clients", "Date": "September 23, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "N Ireland", "Title": "“Average Hilton with above average staff”", "Author": "Elizabeth7", "ReviewID": "UR20255444", "Content": "We stayed in this hotel for 2 nights (1 before and 1 after our cruise from Barcelona). As Hilton Diamond members we were upgraded to an executive room which was clean and modern. The executive lounge was good and the staff were incredibly helpful - nothing was too much trouble. We were checked in by a girl called Patricia who was exceptional, her English was excellent and she was extremely helpful. All the staff seemed good but she certainly stood out. We had booked 3 rooms as we were travelling with family but used points for one room. As identified by other reviewers this was an expensive hotel and certainly was amongst the most expensive Hilton hotels. Based on location and facilities I would say it was costly. This is probably a good business hotel and is accessible via good transport links to centre of Barcelona. Overall it is an average Hilton in terms of standard and value for money with well above average staff.", "Date": "September 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cincinnati, OH", "Title": "“I love Barcelona”", "Author": "platinummedallion801", "ReviewID": "UR20158569", "Content": "Stayed for a few days during a euro vacation--had a GREAT experience. Staff was extremely helpful, executive lounge had great food, and loved the location--very close to shopping and subway. Property isn't quite as modern as other Hiltons in Europe, but it wasn't dated and was very clean.", "Date": "September 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Nice hotel, nice location”", "Author": "jerseyflygirl", "ReviewID": "UR19666266", "Content": "A classy, simple, nice hotel in a good location. Comfortable, clean and close to buses, subway, shopping, etc. I'm an International Flight Attendant and love visiting beautiful Barcelona.", "Date": "September 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Great service a bit remote from the action”", "Author": "Watthree", "ReviewID": "UR17992803", "Content": "We recently stayed two nights at the Barcelona Hilton prior to a cruise and definitely enjoyed the experience. Here’s a recap of what was great and some things that could have been a bit better. Staff: All the staff members we interacted with were pleasant, professional and helpful. We arrived early in the morning but as luck would have it, the staff juggled some things around and was able to provide us with a room. Facilities: The outside of the hotel has clean lines, with lots of steel and glass, but it is not particularly distinctive. The lobby décor is very modern and tasteful. All of the common areas looked recently updated, with nothing that was worn, dirty or tattered. The room was small, like many European hotel rooms, but nicely decorated and in good condition. Everything was clean and comfortable. We stayed on the concierge floor so we had the added benefit of a daily breakfast as well as an evening cocktail/hors d’oeuvres buffet. Highlights: I was able to use my Hilton Honors points to get the room for free, so that was very nice. The concierge was helpful and courteous. The hotel itself is lovely and the neighborhood is nice too, very clean with lots of beautiful trees and flowers. Areas for improvement:  Identify the hotel a little bit better on street level; the trees can block the name if you’re in a cab.  Extra-padding for the beds: they were a little bit hard and somewhat low to the ground.  Re-think internet access prices- 22 euros per day is a ridiculous amount of money to have to pay at a nice hotel when cheaper hotels offer it at low-cost or for free. Also, the location is a bit removed from most of the popular tourist areas and there were not a lot of restaurants to choose from nearby, but the hotel is very close to the subway, so it was easy enough to use that to get around and the heart of Barcelona is no more than 10 minutes away by cab. Overall impression: A very nice hotel, well-managed, friendly and professional. Would definitely stay here again and recommend to a friend. Nearby transportation: Subway: Line L3-Maria Cristina Station (5 minute walk) Airport: 20-25 minutes by taxi Cruise Terminal: 15-20 minutes by taxi", "Date": "July 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Good location, helpful staff”", "Author": "manchester_freak", "ReviewID": "UR17076498", "Content": "My husband stayed at this hotel for a business trip, and our infant daughter and I joined him halfway through the week. We were given a very nice crib and infant bathtub to use for our daughter. We stayed on the executive floor, which had a staffed desk and a lounge with complimentary food and drinks throughout most of the day. The breakfast was excellent, there were sweets in the afternoon and savory treats in the evening. Water, soda, wine, and spirits were frequently available; and it was a relaxing environment. The staff at that desk and at the main front desk of the hotel were all incredibly helpful and friendly. Everyone spoke excellent English, which helped us a lot. I had a broken leg, so was using a wheeled thing to get around. It was very easy, with the entrance on ground level and no stairs, and elevators to access all floors. Definitely an accessible place. The location was very good. The Diagonal tram stopped in front of the hotel, and a few of buses stopped nearby and ran to Plaça de Catalunya, so it was easy to travel. The FC Barcelona stadium and museum and the university are only a short tram ride and walk away. The hotel charges a lot for wi-fi, but there is a copy shop/internet place a few blocks down Diagnonal that offers computers and internet for 2.95 Euros per half hour. Would stay there again if we could afford it. Perfect for business travel!", "Date": "June 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Painswick, United Kingdom", "Title": "“Exceptional service, very friendly”", "Author": "Polyphemus", "ReviewID": "UR14884430", "Content": "Stayed in this hotel 10 days on a business trip so got to know the place really quite well. The hotel is located about 10/15 minutes by taxi from the city centre and the \"Ramblas\" - the main street off which there are numerous side streets and alleys to explore in the Gothic part of Barcelona. The metro and buses are also located fairly close to the hotel. A few hundred yards along the main road is El Corte Ingles - department store open until about 22.00 selling everything from food to furniture, as well as several really quite good restaurants - try La Bo Tiga, excellent tapas served in a chic environment or my favourite (because it's authentic traditional Spanish) the restaurant L'Antull tucked away in a back street just behind the hotel (go down the ramp, turn right, immediately left down narrow alley, then right after 100 yards and you will see it on the corner) - doesn't look like much, basic decor, great fish, and if you get on with the waiter, as much agua diente you can handle! Don't bother with restaurant Si Senor right by the hotel - more like No Senor, bad food, service etc. Hotel rooms however are not great - clean certainly, but lacking charm, and not great prices either. However, on the 4th floor there is the executive lounge which serves free food and drink all day (no one seems to bother checking if you have an exec room!). Public areas are modern and reasonably comfortable with good bar service. Meeting rooms are very good but pricey - get your own lunch sent in or go out. Service at this hotel is excellent, any problems quickly resolved; all staff are cheerful and friendly. I would give the hotel 5 stars overal if it were not for the rooms as mentioned already.", "Date": "April 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "South Carolina", "Title": "“Hilton Prices minus the Hilton Quality”", "Author": "Loader2001", "ReviewID": "UR12469457", "Content": "If you need to stay in the downtown area, great location. Short walk to shopping center and university. Staff is very friendly and helpful, however, for 225.00 Euro, I say it is not worth the price. The bed was the only thing that was not run down. Rooms are small and unimpressive (It actually reminded me of a dorm I lived in while in the military). I stayed in other cities in Spain at nicer \"resort\" hotels for 1/2 the price with more to offer.", "Date": "January 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Wales", "Title": "“Great time!”", "Author": "ADavies", "ReviewID": "UR10449644", "Content": "Just returned from an excellent stay in the Hilton Barcelona! Went to watch the football so hotel is an ideal place as the Nou Camp is only 10mins walk around the corner. The hotel has a few restaurants close by and it is on Avenue Diagonal which has loads of high class shops. The Hilton is a 10 euros taxi ride from La Ramblas so is not too far from the main centre of town. The hotel itself was excellent, all the staff spoke good English and they could not have been more helpful. We had breakfast each morning and there was plenty of choice and the standard of food was excellent. The bar was excellent as well, especially the friendly bar man Phillipe who spent a great deal of time talking about football and Barcelona with us. Very impressed with the hotel and when we return to Barcelona (which will be soon as we loved it!) we will come back here.", "Date": "October 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Durham, North Carolina", "Title": "“Not worth it!”", "Author": "mdp_az", "ReviewID": "UR10033045", "Content": "This Hilton is not worth its rating or high rates. Thankfully we stayed here only 2 nights for my wife's business meeting, so it cost us nothing. Our first floor room was at the back of the hotel overlooking the nicely manicured park with palm trees, so it was quiet, but I would imagine the rooms up front on Av. Diagonal would be rather noisy. The decor of the lobby seemed mismatched and cheap. The decor in the room was downright budget. It reminded me of a modern youth hostel and had a very institutional feel. The carpet in the room had an odd texture and was not very clean. There was not quite enough storage in the room, and the lighting was a bit poor. The bed was comfortable, and the bathroom was very nice, aside from the ugly brown marble tiles. The location of the hotel was convenient to a metro station and shopping mall, but little more. The breakfast was decent, but the coffee of rather poor quality. The staff was very accommodating and helpful and spoke great English. One staff member in particular, a gentleman named Yves, was extremely polite and helpful. The staff indicated to me that this is a well run hotel, but one that is in dire need of a remodel, a price adjustment, or both. Do yourself a favor and do not stay here if travelling to Barcelona as there are many nicer hotels in better locations with lower rates.", "Date": "October 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Montreal, Canada", "Title": "“not worth five stars”", "Author": "wilson17", "ReviewID": "UR10003344", "Content": "I spent two nights at this rather unimpressive Hilton. The location is not near the interesting tourist areas nor any of several international conference centers, but does have a convenient Metro nearby. The staff was uniformly nice, helpful and able to communicate in English-this was really the best feature of the hotel. The lobby was very nice, but elevators small and not always working. The room was small but ok size for European standards, but in need of renovation, or at least painting. No iron or other useful amenities in room, very expensive internet access (23 Euro daily for mediocre connection). The bathroom was clean and everything worked well. The bed wasn't bad, but not one of the best, although several nice pillows helped. No pool and tiny ill-equipped gym. The breakfast was included in my package but was more appropriate for a 2-3 star hotel-bad weak coffee and limited, below average quality buffet. Pricy, uninteresting lunch and dinner menus, which I didn't try, but meals at meeting not high quality. Overall, not so bad for the brief meeting I attended, but I would choose somewhere else.", "Date": "September 25, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Chattanooga, Tennessee", "Title": "“Yuk!”", "Author": "vouviajar", "ReviewID": "UR8739251", "Content": "Dried poop on the brown marble floor and it had been there for a while. Because of the lines in the marble it was hard to detect . I was shocked to find out that it had hardened and blended into the floor. Housekeeping was alerted and we were moved into another room, but only after I insisted. Boring & outdated lobby and rooms. Windows would not open. Worse Hilton I have ever stayed in, they should remove it from the chain. Watch the floors!", "Date": "September 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Philadelphia, PA", "Title": "“Great location and service. Decor needs some touching up”", "Author": "globeseekerpa", "ReviewID": "UR8399555", "Content": "It's rare that you can be in an urban setting and see palm trees swaying from your hotel window. The Barcelona Hilton pulls it off with a great location on the tree-lined Avinguda Diagonal. It's walking distance to restaurants, a shopping center, and a Metro station. The staff is multi-lingual and friendly, I heard them assisting guests in English, Spanish, German, Portuguese, and French. The rooms are comfortable if cold and sterile. They were redone in a modern IKEA-type style with silver metallic fictures and really lack any type of warmth or personality. However the beds were comfortable, the air conditioning was blowing cool air, and there was a good variety of TV channels. The lobby also is looking a bit dated, it definitely does not match the decor of the rooms and has an awkward combination of low ceilings and a slightly tired \"atrium.\" But overall the great location,comfortable rooms, and good service make the Hilton a fairly good choice for a Barcelona stay.", "Date": "August 12, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Northants UK", "Title": "“This hotel is some kind of joke? Maybe not”", "Author": "Earby", "ReviewID": "UR8004189", "Content": "A 5 star? certainly 5 star price even with a discount but for this kind of money I want more than this, and know I can, and have got more from 3 stars. The gym is dire, decrepit, and moribund! No pool, no sauna, no anything. Not very likely to return.", "Date": "June 27, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Nice Hotel, Good Location”", "Author": "CNPH", "ReviewID": "UR8002110", "Content": "Stayed there due to a conference nearby. The hotel is on Avenue Diagonal, a few blocks to the subway, close to a shoping mall that looks like an office building, (because it is combined). Not a huge convention-type Hilton. Rooms were very clean, modern/sparely furnished but adequate. Speakers for tv in bathroom were a nice touch. If you like long walks it's easy to get to La Ramblas, Plaza de Catalunya, Calle Gracia, and the wonderful Gaudi buildings. May not be the greatest price, didn't compare because was there for business. Always felt safe.", "Date": "June 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Fantastic”", "Author": "brooke16", "ReviewID": "UR7956507", "Content": "I went to Barcelona with my mom stepdad and sister and a few friends 2 summers ago and I loved this hotel. I tend to be very picky about where I sleep especially when it comes to hotels and I still to this day believe that I have never slept better in a hotel. I had a room on the executive floor that I shared with my sister. The room was beautiful, very modern with a nice sized dark marble bathroom. I read a previous review from a traveller staying on the executive floor and was shocked.. I find it surprising that they found anything negative about these rooms. The temperature was also wonderful for me as well. The rooms very smoking rooms I believe, and I am not a smoker but there was not even a lingering stench of ciggerette in there. The area was nice, more in the financial district then the main las ramblas area but a short cab ride away. They have a huge delish breakfast buffet but the price is steep at 20 Euros a person.. I loved this modern beautiful hotel. Would recommend this hotel to anyone!!", "Date": "June 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "St Albans", "Title": "“Fantastic Hotel - ideal for the Nou Camp”", "Author": "Rmorrison", "ReviewID": "UR7485379", "Content": "We where upgraded to a club level room on arrival , the room was clean and comfortable. The club level ameneties where fantatsic, food and drink served in the club lounge , all complimentary and plentiful. The hotel is perfectly located to the Nou camp ( the reason for our visit). We would love to go back , and would choose the hotel again without question.", "Date": "April 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kuala Lumpur", "Title": "“Great Hotel with Great Location”", "Author": "Naora", "ReviewID": "UR6433559", "Content": "I arrived at 10.00am and had a complimentary early check-in. Stayed in a Deluxe Room. The room is simple, comfortable bed and clean. The taxi fares from the Airport to the Hotel is around €20. Breakfast cost €22. Had a full selection of cheese, yogurts, pastries, good selection of hot items and fruits. Good service. You can get cheaper for your meals outside of the hotel. At the nearby restaurants. There is Si Senor (Mexican Restaurant), Starbucks next to Si Senor and shopping centres, El Corte Ingles within walking distance (5 minutes). The staff of the hotel was helpful and friendly. The location was great and located at Av. Diagonal! 7 minutes walk to the train station (M). Shopping centres and shops within walking distance. Turn left to El Corte Ingles (Big departmental store) and right to other shops. It is not in the city centre, 15 minutes to La Ramblas by car. Shops close at 8pm. Good value for money and Yes! I will definitely come back to this hotel with my family!", "Date": "December 12, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "", "Title": "“Great - save the austere rooms”", "Author": "MrSoft", "ReviewID": "UR6030743", "Content": "Getting straight to the point - the rooms really are just as depressing as the hotel photos suggest. Probably it all looked great on the designer's sketches. But the reality is, teenage bedsit by IKEA. One has to question the wisdom of using aluminium sheeting on working surfaces. The desk has no drawers and quickly becomes a total mess. The lighting is cold and bright, like a fridge. After 3 nights it was seriously having a bleak effect on me. I did not enjoy returning to my room at all. Lights out . . . to be disturbed by the smoke alarm, whose green light flashed all night long, right above my head. Everything else was first class. Staff throughout the hotel excellent, the best I encountered in Europe for a long time. The Business Centre staff downstairs were particularly good. Lobby and bar/cafe both very nice, breakfast terrific. A bit pricey but there's a nice little regular cafe just across the entrance if you want to save your money. Wireless ludicrous at 27 euro per day, and connection very slow. All is undermined by the rooms. Time to refurb the refurb.", "Date": "October 30, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Wilmington, North Carolina", "Title": "“Great Staff!!”", "Author": "Fe3O4", "ReviewID": "UR6001932", "Content": "My wife & I stayed at this hotel on Friday Sept. 29 thru Monday Oct 2, 2006. We used Hilton points for this room and received Executive level room & concierge service. Our room was 508. The room is pretty much as other reviews have stated. Pictures are attached. It's not the best hotel room in the world but it was fine. It certainly is far from the worst room. I would not consider this as a resort hotel. It's pretty much all business. If you are traveling to Barcelona for business for a couple or three days, this place gets the job done. All of the staff we encountered were great. The front desk and concierge were very cordial and helpful. English was spoken so no language problems for us at all. The concierge level had food & drink available from 7AM - 11PM. This was really nice. Food was spotty at times. Breakfast was OK. We primarily used this as a break from touring Barcelona by stopping in to have a few snacks and drinks. It worked great for that. The Freixenet Cava sparkling wine was fantastic. We buy that at home now. As for the restaurant on site, don't know. We never utilized it. Hotel location is on Av Diagonal. According to the tour bus, this is the most expensive shopping district in Barcelona. It was also stated that this is the longest shopping street in Europe. A Metro stop is about a 5-minute walk to the left as you come out of the hotel. Tram stop is practically across the street. To get to the nearest Hop-On Hop-Off tourist bus is a good 20-minute walk down Diagonal. Come out of the hotel turn right and when you come to Starbucks on the corner that is the bus stop for both the red & blue lines. The red line is for the north city tour and the blue line is the south city tour. Two day bus pass was 24E. Bottom line - would I stay at this hotel again? Yes, but I would look for another location first.", "Date": "October 23, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "East Yorkshire", "Title": "“A Great Place to Stay”", "Author": "Pedro56", "ReviewID": "UR5968151", "Content": "We only stayed for three nights but it was magnificant. The staff were friendly and very helpful. They could not do enough! The breakfast has the biggest choice we have ever seen. There was nothing missing that we could see and if there was I am sure it would have been provided. Available from 7am to 11am every day is also very good. No rushing down before it closes. Bedroom was good. Bed very comfortable. Excellent power shower. Loads of TV channels and some Radio stations. Quite a lot of in-house movies though we didn't bother with them. Only short corridors from lifts makes a real pleasant change. No long treks to room - fantastic. The lifts are amazing. They are so silent. You press the button and it arrives before you know it. Silently!! The design and decor is very modern. We loved it. Nowhere seems to mention this but the Metro station is Maria Christina about 300 metres away. From the airport take R1 train to Sants Estacio (2.60 Euros) and change to L3 to Maria Christina (1.20 Euros). Total 3.80 Euros. Much cheaper than a taxi and dead easy. Get a ten trip Metro ticket for 6.85 Euros - excellent value. We didn't use them but there are loads of buses right outside the hotel as is the tram. Taxis are everywhere. Coming out of the Metro station turn right towards the Hilton. You cross over a very busy underpass and a busy junction. There on the corner is El Corte Ingles - a fantastic department store. Everything you will ever need is there. In the basement is a large supermarket - again with everything. Excellent prices too. On a par with the larger Carrefour supermarkets elsewhere in Spain. Buy drinks here and put them in your mini-bar to keep cold. Save yourself a fortune. Next to El Corte Ingles is another shopping centre with lots of VERY nice shops. Also quite a few VERY nice food places downstairs - good for lunch and quick snacks. For a reasonable price meal turn right out of Hilton and walk about 1Km to GINOS. Very friendly, good food, good prices. Around the corner to the right from GINOS is La Bo Tiga - a new contemporary eatery. Great staff, great ambiance, great food and stunning prices. It is bright and new. It is also a great place to eat. The city is well documented elsewhere but in just 3 days we had an excellent time. Lots and lots of walking - the best way to see a city. We never got to La Rambla though. Go there .... and don't forget the cable car over the harbour - take your camera!! PW & GS", "Date": "October 18, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London", "Title": "“Ok hotel but nothing great”", "Author": "Alex0021", "ReviewID": "UR5967219", "Content": "This is my second stay in this hotel, I think the room are ok, but found them very unwelcoming, and try to have a modern side which is not working at all. Bathroom was nice. The staff were very nice and friendly. Just thought a deluxe room lacked a lot of charm and character. Parking is way too expansive, for what it is.", "Date": "October 18, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Milan, Italy", "Title": "“Nice hotel, location is a bit outside but not bad”", "Author": "cla114", "ReviewID": "UR5912155", "Content": "The hotel is a bit better than your average Hilton, rooms are a bit newer, however given that in Spain you can go to very nice stilish 4 star hotels, this one is not the best of all. I was on the executive floor and so rooms were supposedly a bit better than the rest, however the bathroom was old and, most important, THEY DID NOT HAVE NON SMOKING ROOMS ON THE EXECUTIVE FLOOR!! So the floor and the rooms smelled of cigar.... Apart from this the location is not so central but not in the outskirts either, it's a residential area, so for businesspeople it's ok, for tourists maybe less. Overall a good hotel but not the best in Barcelona.", "Date": "October 5, 2006"}], "HotelInfo": {"Name": "Hilton Barcelona", "HotelURL": "/ShowUserReviews-g187497-d228419-Reviews-Hilton_Barcelona-Barcelona_Catalonia.html", "Price": "$179 - $450*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Avda Diagonal 589-591</span>, <span class=\"locality\"><span property=\"v:postal-code\">08014</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "228419", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/6f/84/6f843dcfcb0e335def1e2d0ea02687977large.jpg"}}