{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "LONDON", "Title": "“My comment”", "Author": "Man Wai A Posted by an Easytobook.com traveler", "ReviewID": "UR128125506", "Content": "This hotel was quite good for me, just the location was not really near central Barcelona. However, the hotel was not far from the underground station and the local area was very safe and calm. The hotel's staffs provided good service and the room was very comfortable.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Madrid", "Title": "“Great stay, great crew on board”", "Author": "Ovidio M Posted by an Easytobook.com traveler", "ReviewID": "UR127655870", "Content": "I stayed at this hotel for 3 days. What I would really like to highlight is the great attention received by all the staff... specially the receptionists were really helpful at any question made, they answered with professionalism and enthusiasm... will repeat when I come back to Barcelona.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Valinhos, SP", "Title": "“Perfect!”", "Author": "Flávio B", "ReviewID": "UR122828864", "Content": "Great hotel! Really clean and organized, has a simple but tasty breakfast, always served by smilly and really nice people. The room has nothing fancy but it's functional, clean and comfortable. Good working and easy free Wi Fi internet. Sounds like 'yeah, it's the minimum a hotel should have' but we all know it's not like this and it's really good in this hotel. All the receptionists I met there were extremely polite, always ready to help with any kind of information or service. The hotel is located in a very calm and friendly neighborhood with fast access to bus or metro that will take you anywhere you need really easy. Besides you can go walking to Camp Nou watch a Barcelona football match!! Well, i really liked the hotel, and if one day i'm back to Barcelona, I'm sure I'd be back to this hotel, and i advise people to stay there.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Zürich, Zurich, Switzerland", "Title": "“very nice hotel and just 8 minuts from the center...”", "Author": "Junior Q", "ReviewID": "UR120081637", "Content": "was 4 days and on Hotel Castellnou, the Metro station is just 3 minuts from the hotel and around 8 minuts from the center, anyway most of the time i drive by taxi and it coust cheap between 6 and 8 EURO, the staff are very friendly and allways available to give tips and information about the City. Thanks Mr Jesu Rios for the help and all staff team.", "Date": "November 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "2"}, "AuthorLocation": "Buenos Aires", "Title": "“A little strange but nothing wrong with it”", "Author": "Grande_m", "ReviewID": "UR117916322", "Content": "Hotel seems like its in a bizzare location far from the centre and the life in the city. But in hot weather and when you dont want to be amongst the huge numbers of Tourists the location is pretty cool. Some nice places to eat nearby and pretty chilled. It takes about 10mins to get to Plaza Catalunya. Room was small and ok for the price. Service in the hotel slightly unfriendly and basically a bit unreliable. They dont do things when they say they will do them. Nothing is included in the price I paid and getting a shirt Ironed costs 6euros which is laughable really. Breakfast 7euro which by hotel standards is ok. My advice is to plan properly, take the room and expect nothing.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“Great city break”", "Author": "Kym J", "ReviewID": "UR116671371", "Content": "We stayed here as a couple for 4 nights, we chose the hotel as the rate was good and it seemed a comfortable place to stay. After searching online for directions we were expecting a 30 minute commute into Barcelona centre. However we were pleasantly suprised to find the hotel just a few minutes walk away from tres torres underground which takes you straight to the top of the Rambla in ten minutes. The rooms themself were nothing fantastic but pleasant enough for a good stay. Bathrooms fully equiped with the basics including a hairdryer. The view however was not great, a small balcony overlooking privately owned apartment blocks. The beds were singles and needed to be pushed together several times during the night and the hotel guests were not the quietest with some noise during the night. We felt slightly lost the first night of our stay as we felt we were miles away from food/shops however turning right out of the hotel will soon lead to the centre of the area including lots of shops/cafes and more residential areas including a cinema and burger king. We would recommend getting a T10 card for use on the underground, they cost around 8 euros and will allow you to take 10 journeys without having to mess around getting tickets everytime. One confusion we found when purchasing the tickets was the zone information. Zone 1 is all you will need if you are going from the centre of Barcelona to the hotel. All in all we would consider this an excellent base for a Barcelona city break, it was far enough from the centre to be quite yet not too far away and was comfortable enough for our needs on a budget holiday.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Thessaloniki", "Title": "“OK hotel”", "Author": "DespoinaThessaloniki", "ReviewID": "UR116061582", "Content": "We booked this hotel one day before we go to Barcelona so we were waiting for everything. The room was ok but the view was awful (like an inside yard of other houses) and it wasn't bright. The bathroom needs more attention, maybe a renovation too. The neighborhood was nice. Generally our stay was pleasant, but most of the days we stayed in the room just for sleep. The big + of the hotel is the free wi-fi in the rooms.", "Date": "July 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baku, Azerbaijan", "Title": "“this hotel is really cozy,luxurious !”", "Author": "NikolBaku", "ReviewID": "UR109225796", "Content": "Hello.Dear Catalonia Castellnou. I was really pleased to have stayed in your hotel. My first hotel was not cosy as yours.It was close to everywhere where we want to see. Thanks you in advance for your service and for everything. im planing my second visit to your hotel , Gracias =)", "Date": "May 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "5", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Oslo, Norway", "Title": "“Nice location, but ....”", "Author": "Jaromaxxxxxxx", "ReviewID": "UR102083664", "Content": "Room at 3rd floor, facing the main street. This was our second stay. Must admit that the first stay was more enjoyable. This time we were given a rather shabby room. The walls were dirty, broken tiles in the bathroom, etc, as some other reviews mention. Generally the whole apartment was in desperate need for a repair. The worst problem was noise - not from the outside, but from other guests on our floor. In our room we could hear everything our neighbours were speaking about. The most positive about this hotel is its location, near Tres Torres metro, which provides quick access to the center. Staff was friendly and spoke english quite well. If they choose to repair this hotel we are likely to return. Otherwise there are better options at this price.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Canton", "Title": "“Noisy room, not very friendly staff”", "Author": "GraceCanton", "ReviewID": "UR85319584", "Content": "We stayed in this hotel for the last night after we came back to Barcelona. The price is OK, but the hotel offer the room on the groundfloor to us next to restaurant. We were woke up at 3:30am and 6:00am by the staff working in the restaurant. Very noisy... and not very friendly staff..we phone the hotel how to get there, and they just told us the metro stop and didn't tell us how to get there after the metro.", "Date": "October 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Milan, Italy", "Title": "“Cheap, very basic, quite noisy”", "Author": "Pietro1970", "ReviewID": "UR82234195", "Content": "Room at 1st floor on the main street was very noisy. Single bed room very small. Fridge-Minibar was broken and beverages were warm inside. Many tiles in the bathroom were broken, generally the bathroom needed a restructuring. Nice staff, fiendly (but with a quite basic English). Excellent price.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Single rooms are like prison cells”", "Author": "Traveller201084", "ReviewID": "UR78302664", "Content": "I made a big mistake to come to this hotel after having stayed at another -- Gran Hotel Catalonia. I thought I would save a few euros trading it off with a few more stops on the metro away from the center, but I was bitterly disappointed when I came. The single room had a single twin bed and the room itself was not much bigger than the bed, topped with a small window facing an internal shaft whose curtain is permanently on, it feels like a prison cell, really claustrofobic. The room was on the 4th floor and I could hear very loudly when other doors open and close (with a bang) and when there is any movement in the corridors and perhaps also other floors. The metro is also not very convenient as the line which serves this stop comes only once every 15 min so although in theory you can reach Plaza Catalunia in 10 min, in practice it can take over 30 min. It's a residential zone, supposedly the expensive one in town, so there is nothing to do around and it really feels very out of the way. The hotel staff were friendly but unfortunately they can't make up for the poor rating I give this place.", "Date": "September 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barcelona", "Title": "“A very good place to stay!”", "Author": "CarolinemBarcelona", "ReviewID": "UR62188995", "Content": "It was the first time we went to Barcelona and I found this hotel a very pleasant surprise. Everyone was very nice, the rooms were very tidy and clean, breakfast was great. They gave us very good tips of places to go... seemed like a very well managed place. We seriously recommend this hotel.", "Date": "April 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "edinburgh", "Title": "“Pretty nice and cosy barcelona´s hotel”", "Author": "carolaEdinburgh", "ReviewID": "UR47802970", "Content": "My girlfriend and I have just stayed at Castell nou (Barcelona). Quiet a big surprise to be honest as we received a very familiar treatment (difficult to find in these days). Staff was always there for us in a spanish friendly way which made us feel almost like home. Location is great too, not in the actual city centre but just 12 min by tram which for quietness enjoyment people like us seemed perfect as we could perceive the relaxing spanish lifestyle plus the beautifulness of barcelona´s city centre. Clean, tidy and organised. Definetively going back!", "Date": "October 26, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "budapest", "Title": "“Lovely time in Barcelona”", "Author": "adrika75", "ReviewID": "UR40023660", "Content": "Last weekend was a very pleasant holiday in Barcelona.Short period of time,but relaxing.On the 5th and 6th of September i stayed in this little lovely hotel,Castellnou when i went to the concert of Coldplay.I`m a hungarian girl,and my friends recommended to stay in this cousy place,well connected but far from the crowded areas. I will definitely come back here on my next trip to Spain.", "Date": "September 7, 2009"}, {"Ratings": {"Overall": "4.0", "Value": "2", "Service": "1", "Location": "1"}, "AuthorLocation": "UK", "Title": "“Excellent”", "Author": "stenneti", "ReviewID": "UR15752970", "Content": "This was an excellent small hotel, especially when I was traveling on a set allowance for work. The hotel is in a quiet residential street with good bus and metro links within 3 minutes walk, and the central Avinguda Diagonal within 15 minutes stroll, and the Nou Camp walkable in 30 mins. It was a pleasant bonus to have a small private balcony, the breakfasts were good, and the staff helpful. I got a taxi from the airport, which was convenient as the hotel is on the right side of town. Being in a residential area was nice, the local amenities weren't touristy or tacky, just pleasant. This hotel is a short walk to Sarria and the Pedralbes, both worth a look.", "Date": "May 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Excellent Well Connected Basic Hotel...with Balconies!”", "Author": "acronymphomaniac", "ReviewID": "UR8838536", "Content": "This was an excellent small hotel, especially when I was traveling on a set allowance for work. The hotel is in a quiet residential street with good bus and metro links within 3 minutes walk, and the central Avinguda Diagonal within 15 minutes stroll, and the Nou Camp walkable in 30 mins. It was a pleasant bonus to have a small private balcony, the breakfasts were good, and the staff helpful. I got a taxi from the airport, which was convenient as the hotel is on the right side of town. Being in a residential area was nice, the local amenities weren't touristy or tacky, just pleasant. This hotel is a short walk to Sarria and the Pedralbes, both worth a look.", "Date": "September 21, 2007"}], "HotelInfo": {"Name": "Hotel Catalonia Castellnou", "HotelURL": "/ShowUserReviews-g187497-d228546-Reviews-Hotel_Catalonia_Castellnou-Barcelona_Catalonia.html", "Price": "$98 - $189*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">C/ Castellnou 61</span>, <span class=\"locality\"><span property=\"v:postal-code\">08017</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "228546", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/cf/e2/c1/exterior-catalonia-castellnou.jpg"}}