{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Perfect Location”", "Author": "Manchesterl0ver", "ReviewID": "UR127688660", "Content": "A really good hotel with friendly staff and a great buffet breakfast, A great location to visit this vibrant city. The room was nice and because of the double glazing and shutters on the windows we had a undisturbed sleep, leaving us refreshed.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Northamptonshire, England", "Title": "“Location perfect, good value!”", "Author": "Time Travellers' Wife", "ReviewID": "UR127506830", "Content": "3 night stay city break perfectly located hotel for whole city as near to the transport hub Plaza Catalunya and top of the Ramblas. As previous postings, within walking distance to most city sights even Segrada Fam. Very near to all restaurants and bars and some of the shops. Room 305 comfortable, double glazed (on front) so minimises traffic noise. Well equipped with safe, hair dryer, tv., toiletries although a bit cheap, would be ok in emergency. Clean. Comfortable beds extra pillows. Although it rained every day and was pretty chilly, the hotel was warm. Staff friendly and polite. Breakfast was very good, having read previous reports was a bit wary - however, plenty of fresh pastries, bread, and continental style, plus fresh fruit. Tinned fruit, even hot sausage, bacon, mushrooms etc., help yourself - we were very satisfied with the breakfasts!! We were able to leave our luggage until leaving the city mid afternoon after checking out at 12 noon. I would recommend this hotel for a city break, I am sure we could have found cheaper for what we had, but think the location spared us a lot of £ in taxis, bus fares etc. We even managed to get back to the hotel to freshen up between walkabouts!", "Date": "April 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Swindon, England, United Kingdom", "Title": "“atlantis hotel”", "Author": "halford17", "ReviewID": "UR127121606", "Content": "This hotel is in a great location easily accessessed to all local sights,it is quiet and clean.There are lots of decent restaurants nearby.We walked every where from this hotel,even Segrada famillia.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "cheshire", "Title": "“Great location and good value for money”", "Author": "kathyandian", "ReviewID": "UR127009631", "Content": "Stayed for one night in March. Hotel was in a great location, near the top end of Las Ramblas and Cataluna Square. Really good for transport links and shopping areas. We travelled as two couples and tried to see as many sights as we could on foot. Las Ramblas is a really busy place with the bottom end near the port being rather seedy.Would not have liked to experience this at night.however it was okay in the daytime. Port well worth a walk around and so was the Cathederal. Taxi to Segrada Familia from the old town was about 6 euros, worth it as it would have been a rather long walk. La Boqueria Market on Las Ramblas is fantastic and gets very busy. Eating out is not a problem, plenty of tapas bars to choose from. Hotel was comfortable and excellent value for money. we paid £75 for a twin room with breakfast. The room was basic but cleanand comfortable with toiletries in the bathroom. The breakfast was continental and was very enjoyable. However for us it was all about location being just a couple of minutes walk to the top end of Las Ramblas and Cataluna square.. Would definately recommend this hotel. Barcelona is a very busy city and we had been warned beforehand that pickpockets are rife. We were sensible and kept our wits about us and therefore had no experience of this but feel it is something that travellers should take very seriously. Would return as it was a great city break.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "bristol", "Title": "“good location”", "Author": "anne00Bristol", "ReviewID": "UR125717408", "Content": "hotel very clean and friendly,nice breakfast plenty of choice, within walking distance of the ramblas and cataluna sqr,where buses take you to and from the airport,plenty to do in the area,but please be warned pick pockets are rife,split your money up into small amounts,leave rest in the safe do not get into any conversation as you may be targeted,we are seasoned travelers and thought we had done well, nothing lifted in the five days there,on our last day waiting for our payed transfers to the airport at the hotel, we got caught out with a local barcelona taxi driver,who said he had come to take us to the airport, he lied.. took us for 35 euro locked our luggage up till we payed. barcelona is a lovely city spoiled.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pune, India", "Title": "“Central place , Near for Business traveller”", "Author": "maneeshved", "ReviewID": "UR123103208", "Content": "I stayed here in July & Oct-2011 . This hotel is very centrally located . For Airport or train station . Near by lots of attraction . Las Ramblas is walking distance from this place. Staff is good. Breakfast is fantastic", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kerkrade, The Netherlands", "Title": "“Excellent location!”", "Author": "Ozzie1703", "ReviewID": "UR122564120", "Content": "Goed ingerichte en schone kamer, losse bedden, royale badkamer. En niet te vergeten een riant ontbijtbuffet!! Heerlijk: de centrale ligging van het hotel.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sanford, North Carolina", "Title": "“Great Location and Ammenities”", "Author": "nccruisin", "ReviewID": "UR121200861", "Content": "We stayed here for 3 nights prior to our Carnival Transatlantic Cruise 10/25-10/28. This hotel is perfectly located between 2 Metro stations (Universitat and Placa Catalunya). It was an easy walk to Las Ramblas (there was also a short cut down a side street on the right about a block toward Placa Catalunya). Local food was awesome. Hotel had a great breakfast that included hot and cold items, great coffee, and cava (a morning Mimosa was nice). Rooms were clean and adequate in size. We were on the street side with a small balcony. I had read reviews about the street noise, but we did not experience any of that and slept well each night in their comfortable beds. They also had a computer at the bottom of the stairs which was complimentary and was nice to be able to make a couple contacts back home without a fee. Guest services were friendly enough. I had made several computer inquiries prior to the trip and my questions were always answered promptly. We paid $450 for these 3 nights which for Barcelona is pretty good. I would definitely stay here again!", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Great value”", "Author": "SueNY60", "ReviewID": "UR120931741", "Content": "Stayed here for three nights. It's a three star hotel, but in my opinion , the only difference between this one and a four star hotel is the smaller reception area. The room was small by American standards , but of adequate size and modernized----hardwood floors and a beautiful, large bathroom. A good breakfast is included and the location is excellent---one can walk almost anywhere. The staff was friendly and extremely helpful in giving directions. Nothing could be better for such a reasonablr price.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Gem near Las Ramblas”", "Author": "Missdanyell", "ReviewID": "UR120233524", "Content": "We had three rooms for before and after a family cruise. Each room was different but very clean and modern. The beds were comfortable, linens good, bathrooms large. The location is very convenient to the Ramblas and Placa del Catalunya, as well as neighbourhood shopping and restaurants. Breakfast offers a good selection, and when we had an early flight, they offered to make up a \"breakfast-to-go\". Staff was friendly and helpful. The only negative we noticed was some lack of soundproofing, although not so much that it kept us awake, even facing the front street. I would definitely stay there again.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Huntsville, Alabama", "Title": "“Nothing fancy, but reasonable value for price paid”", "Author": "SunDiego123", "ReviewID": "UR120114793", "Content": "Stayed one night pre-cruise and three nights post-cruise. On the plus side, as other reviewers have mentioned the location is very convenient to Placa Catalunya, The Ramblas, and the Universitat Metro Stn. Wifi is free, the breakfast was very good. Room \"amenities\" included small packets of shampoo and body wash and a hair dryer that was weak but usable. There was an in-room safe and a 'mini-bar'. The negatives ~ front desk staff was inconsistent. Some were very helpful with restaurant suggestions and transportation tips. Others did just the minimum. Our room faced the main street (Pelai) and was very very noisy. People hollering at all hours, trash trucks and delivery trucks early in the morning. The room was small and dark, but clean. Overall, a good value for 85 Euros especially with the free breakfast. If we find ourselves in Barcelona again however, I think we might try someplace different.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Vienna, Austria", "Title": "“Keep away from that place !”", "Author": "Timur S", "ReviewID": "UR119967009", "Content": "Be aware ! Keep distance ! Small smelly rooms, very noisy - you hear everything what happens in the street, in the corridor and any room around. There's no sound isolation at all. We could not sleep all night. The whole hotel is damp, old and smells bad.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Delray Beach, Florida", "Title": "“Location saves this hotel ...”", "Author": "Lea B", "ReviewID": "UR119709954", "Content": "If it wasn't located at walking distance from Plaza Catalunya, Rambla and Plaza Universitat, I wouldn't reccomend it..The building is old and it hasn't been properly renovated, everything is dated, the beds, the bathroom. Breakfast was good, it even had champagne.Very easy to get to the hotel from the airport..Just take the Eurobus to Plaza Universitat (3rd stop) and walk a couple of blocks..very convenient..", "Date": "October 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Columbia MD", "Title": "“Great Location”", "Author": "Debbie S", "ReviewID": "UR119268847", "Content": "Hotel Atlantis is located within easy walking or metro distance to all of Barcelona's tourist destinations. The hotel rooms/bathrooms/public spaces are all spotless. Our room had twin beds, a nice size bathroom with tub and shower, air conditioning, flat screen TV, hardwood floors and a pleasant decor. The room was very quiet - no street noises or noises from other rooms. The hotel's breakfast buffet is well stocked with a wide variety of breakfast/brunch choices... meats, cheeses, yogurt variety, cereals, eggs, toast, rolls, croissants, jams, jellies, juices, coffee, fruits etc. There is a lift and a locked room if you need to store your luggage after check-out. The front desk staff was helpful with directions and restaurant suggestions. We felt it was a very good value for the money.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "ohio", "Title": "“Don't ask questions, otherwise ok”", "Author": "lubelle4", "ReviewID": "UR118513284", "Content": "This hotel is in a good location at the top of the Ramblas, a short walk of about 8 minutes. The room was clean, good breakfast, but the desk staff left much to be desired. They were pretty much trained to check you in and out, but don't expect too much more. They could not tell me how much it would cost to make a local call using the room phone. We got two different answers, neither was correct. We ended up going into other hotels to have our questions answered. The day person was better than the other two. It was a good value, but don't ask too many questions because you may not get an accurate answer!", "Date": "September 23, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Modiin", "Title": "“Fantastic location - good value hotel”", "Author": "vl59", "ReviewID": "UR118062838", "Content": "Extremely good location - next to Plaza Catalunia, Gracia, Rambla. Good size of room. Comfortable bed. Clean. Extremelly quit - windows to internal courtyard. Good breakfast. Conclusion - excellent value hotel to explore Bacelona.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Very well located, good breakfast!”", "Author": "Brookycookie", "ReviewID": "UR117938634", "Content": "We stayed for 5 nights on Easter, we arrived early so we had to come back at check in time to have a room ready, we got a room on the first floor, a nice, clean room with lovely a balcony that overlooks into the main street. Breakfast was very very good, good variety and very kind personal. The only things that I didn't like about the room was the bed, It's a big bed made by the union of 2 beds, for a couple is very unpleasant to sleep like that I would better ask for a twin room, I asked the receptionist if we could move to a room that has a double bed not 2 beds together and she said that all rooms have 2 beds together. Very good price and very well located, you are basically 1 block away from the start of the Ramblas. I definitely would come back to stay in this hotel.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "krbristol", "Title": "“Excellent Location. Clean room. Good breakfast”", "Author": "krbristol", "ReviewID": "UR116321233", "Content": "We stayed here for three nights and found it extremely convenient as a centre for exploring the city of Barcelona. We took advice and asked for an inside room which, although it has no view, it was quiet and peaceful. The breakfast was good but the silly chairs in the breakfast room won't go under the tables and make it difficult to move around. However I would recommend the hotel for short stays.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Lancaster", "Title": "“Ideal location”", "Author": "mickjulieandlucy", "ReviewID": "UR116075372", "Content": "The Atlantis is situated 5 minutes walk from both the Ramblas and the Placa de Catalunya. If you get the Aerobus from the airport get off at Placa Universtat as this is closer to the hotel than the bus stop in Placa de Catalunya. There are also a couple of bars in Placa Universitat that are less busy and cheaper than the bars on the Ramblas. The buffet breakfast at the hotel was excellent and the staff helpful and friendly", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Decent hotel”", "Author": "Nols76", "ReviewID": "UR115797970", "Content": "Hotel is decent, clean nothing wonderful i.e. 5*service. Location is perfect, just off Las Ramblas next to Placa de Cataluna. Lots of clothing shops & restuarants around the hotel. The room is cleaned everyday and towels were changed daily. The Aerobus from the airport stops withing 5min walking distance to the hotel. Free internet, although there is one PC and there is no chair infront of it so you stand while using it;-( Breakfast is ok, nothing wonderful.", "Date": "July 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "larnaka", "Title": "“Great location in a great city”", "Author": "giannismaria", "ReviewID": "UR115705466", "Content": "Hotel Atlantis is a 3 star hotel located in the heart of the city of BCN. For RYANAIR travellers from Girona there is a RYANAIR shuttle bus directly from costa brava to BCN. Otherwise take the train from girona to BCN for €6.75 and then from BCN to Costa brava take the direct bus from Estasion de Nords. As for the hotel we booked it from booking.com and the room was in the inner side of Pelai street away from the noise! Sleeping quality was ok and there was an air con in the room. Staff was very helpful but talk to them in very simple english so they could understand better! As for the breakfast It was very simple. It is a mixture of an angloeurospain flavors. For short  staying the bf is ok but for travellers staying more is getting boring and the staff could add something to it after 3 days to make it better!  Location: almost close to everything just using your feet!! For the price we paid including breakfast the hotel was just fine!", "Date": "July 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Excellent location”", "Author": "springerronald", "ReviewID": "UR115539702", "Content": "Loved this hotel. It's in a perfect location for the Ramblas and the get around town. Very clean, great staff and would most certainly go back..", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Seattle", "Title": "“Nice Place for Touring Barcelona”", "Author": "EasyWalker", "ReviewID": "UR115029165", "Content": "Stayed here in June and found it extremely handy for walking all over Barcelona, a very good location. Room was clean and fine, and buffet breakfast was good. Room was small, but this is not a destination resort. Service was excellent. Definitely would stay here again.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Fantastic value”", "Author": "Rosallind", "ReviewID": "UR112565875", "Content": "We got a great deal on a double room through Booking.com. On arrival the room was spotless and was thoroughly cleaned each day. It also had very effective and quiet aircon, a safe and a competitively priced mini bar. Be aware that the hair dryer is one of those boxes attached to wall like you get in the local leisure centre and fairly useless if you want to actually style your hair. Breakfast was included in the room rate and provided we got up in reasonable time, there was plenty of choice available. Free wi-fi was a huge bonus. Only real minus point was that there was a very limited selection of foreign language TV channels i.e. just BBC World in English (time to brush up your Spanish then??). You simply cannot beat this hotel's location at this price level. Just a minute or two from Placa Catalunya and Las Ramblas on foot. One word of advice, be very careful on (or better still, avoid) the metro. My mother had her new mobile stolen from her bag on a two minute journey. During our time at the police station, which marred an otherwise perfect trip, we saw numerous people who had been the victims of pickpockets. When out and about keep a close eye on your valuables and leave anything non-essential in the hotel safe.", "Date": "June 10, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "miami", "Title": "“location, location!”", "Author": "ajie", "ReviewID": "UR110366352", "Content": "This hotel's location can't be beat, it's right around the corner from the top of Las Ramblas and Playa Catalunya. the rooms are updated and comfortable. The breakfast is excellent and offers great variety. The staff is very helpful and accommodating. Highly recommend this hotel.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Eindhoven", "Title": "“Perfectly located for City visit”", "Author": "AlexvdV", "ReviewID": "UR110130389", "Content": "I have been here with my wife for a full week. We had a room at the front (street side). Because of the double glazing/doors only minimal road-noise. The location is TOP. Just 400 steps from P.Catalunya and 200 steps from P.Universitat. Good size rooms, firm and stable beds, standard bathroom, safe included, breakfast included. Friendly people, always able to give good advise on local issues. ATM nextdoor. Several Lunchrooms on 100steps. For Diner don't go to the Ramblas if you want a good food/prince value, just go in one of the many restaurents in the small streets, still on walking distance. On C.Pelai / C.Pelayo are many hotels some 3 and 4 stars. All comparable. This location in the city of Barcelona is perfect for people who want to experience all of Barcelona and use this hotel/street as basis.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Peterborough, United Kingdom", "Title": "“Perfect location. Fabulous price and room!”", "Author": "HRHLizzi", "ReviewID": "UR108287768", "Content": "My husband, 2.5 year old son and I stayed in this hotel for 2 nights prior to a cruise out of Barcelona Port. We took the aerobus from the airport to the Plaza Catalunya, and walked the 3-5 minute walk down the road to the hotel, which was very easy to do, even with luggage and a pushchair. Barcelona streets are well equipped to deal with wheel as the curbs are sloped at all road crossings. We were greeted by a friendly receptionist, who checked us in. We had a fabulous hotel room on the fifth floor (reached by 2 lifts), with a super-kingsize bed and a reasonably comfortable double sofa bed for our son to sleep in. There was more than enough space in the room. The bathroom was INCREDIBLE! Double sink, loo, bidet and an enormous sunken jacuzzi-style bath. There was a power-shower over the bath, with over-head, horizontal spray, a hand-held extendable shower head and foot washing options. Breakfast was good. It was a buffet-style, with a selection of cold meat/cheese, fresh bread or toast, various pastries and croissants, Barcelona's 'traditional' churros, cereals and a good range of juice and coffee. For us, it was included in the price of our stay. My only minor gripe was that the price quoted to us by expedia when we booked did not include taxes, which at almost 20% was quite a shock at check-out. Even with that extra though, it was easily worth the price for the location. Location for this hotel is just perfect. We were less than five minutes from plaza catalunya, which is the main square, and the place all the tour buses leave from. It is also the best place to get the metro from. Las Ramblas is also less than five minutes walk away. There is mcdonalds, burger king, hard rock cafe, subway, starbucks all within a few moments of the hotel; or if (like us) you prefer a more authentic spanish menu, try exploring the small side streets between the hotel and Las Ramblas, as there are a multitude of cafes and restaurants there for a reasonable price.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Athy, Ireland", "Title": "“Amazing location”", "Author": "purple_swb", "ReviewID": "UR100381159", "Content": "Don't let google street maps put you off staying here! I looked at the map & thought the area was a bit run down. Not at all its right beside Plaza Catalunya. There is quite a small reception area but the bar & restaurant are on the 1st floor. There is free internet access for guests in reception which is a great help for double checking your flights. The staff are very friendly & speak great english, we arrived early but there was no problems leaving our luggage there & coming back later. The rooms are quite big & have a flat screen tv. We also had a little balcony in our room (403). There is a mini bar but it only has soft drinks. Breakfast is served till 10am Mon-Sat & 10.30am on a Sunday. There is quite a good selection including some hot items. Its all self service, including the tea & toast. Overall a great hotel for a city break. It's a fantastic location & the sightseeing tour busses leave from just down the road. To get to the hotel from the Airport get the blue Aerobus and get off at Universitat stop. Then counting the road you are on the hotel (Pelai street) is located three roads to your right. The hotel is only about 10 buildings up on your right, you'll see the white canopy. Getting back to the airport you can get the same bus but you'll have to get it from Plaza Catalunya (turn right outside the hotel door) Bus is €5.30 one way & €9.15 return.", "Date": "March 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“It's all about location, ambiance and staff”", "Author": "T-2SanDiego", "ReviewID": "UR97136468", "Content": "We were lucky enough to have read quite a few reviews for this hotel and booked it. Not only is the location perfect, it's ideal for those comfortable exploring on their own. We took the airport bus out and the 5th (and final stop) is Catalunya Sq. You can't miss it because everyone gets off here. We asked the driver which direction our street was as there are quite a few converging at this Square- if you cut through the square the street you want is just about exactly diagonal to the bus stop. The hotel was only a short walk down. We didn't need a taxi. Right near Rambles and between 2 metro stops. We felt very safe and there were a couple small grocery stores nearby along with no end of eateries. An excellent value and would be my First choice the next time we're in Barcelona.", "Date": "February 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Varese, Italy", "Title": "“Highly recommended”", "Author": "Tualie", "ReviewID": "UR96691662", "Content": "The location is fantastic: close to Plaza Cataluna behind the mall El Triangle... there are many many hotels let's say even located in Plaza Cataluna (and closer) but this came up with a very very good rate (comparing with others in the area)..... The room they gave us was spaciously big, nice king size bed (perfect for a couple and a small child), if wanted can turn the sofa as third bed.... large bathroom too, with 2 sinks and large bathtub with jacuzzi... breakfast services are excellent, they have hot choices (scrambled eggs, sausages, bacon, croquettes or empanaditas, toasts) or cold choices (ham, cheese) plus cereals, breads, croissants (with and without marmalade filling) cakes etc. really really complete with lots of choices of everything (tea, juices)..... a perfect breakfast that suites almost everybody. Besides of the breakfast services there is nothing else to do in the hotel (just to have a room and breakfast) but fit perfectly to our needs. I would say a perfect 3 stars superior hotel (have been in other 3 stars hotels when they are supposed to be 2 stars), if back to Barcelona I would stay there again! Tip: ask a room located in higher floors, the street noise will be lesser.", "Date": "February 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Best money can buy in Barcelona”", "Author": "Mustaine2011", "ReviewID": "UR93855247", "Content": "I just want to say this hotel was a huge surprise for me. I think is the best value for the money you can get in Barcelona. Position is the best, just 2 min walking of Plaza Catalunya and La Rambla, very nice and clean room with a huge and modern bathroom, very nice and kind receptionists, super ok breakfast, very nice everything. I have stayed in the past in better rated hotels, but under services of this one Fully recommended", "Date": "January 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "nothern ireland", "Title": "“GREAT LOCATION, GREAT VALUE, DECENT ACCOMMODATION”", "Author": "gemandali", "ReviewID": "UR85739722", "Content": "Just returned from a long weekend with 6 girlfriends. We stayed at this hotel as I had stayed here 2 years ago and knew the location and quality was good. We had a triple / family room which was 2 single beds and a sofa bed - it was a bit uncomfortable but did the job! ( It is worth noting this if 3 adults are sharing the room though. Other double rooms were fine but had limited natural daylight due to the location within the hotel. Rooms cleaned and fresh towels daily. breakfast had a great selection of warm and cold food, cereals and fruit. Unfortunately the bar doesn't seem to open at weekends. Location is great - 3 mins from Placa Catalunia and 5 mins from La Rambla. GOOD VALUE FOR MONEY AND A GOOD BASE FOR A WEEKEND CITY BREAK.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Great location, nice breakfast, reasonable price”", "Author": "larou25", "ReviewID": "UR84119305", "Content": "My husband and I travelled to Barcelona for 4 days in October! The hotel is in the best part of the town!Next to the Placa Catalunya, where the metro station is and the bus from the airport stops!!Nice street, wide and safe. It is one ofe the few hotels that offer breakfast in Barcelona.Breakfast was more than enough, fresh and delicious.The staff of the hotel was friendly and helpful. The rooms were spacious and clean, but the rooms at the middle and the back of the hotel had only a window opening to a dead air-space.There was no ventilation which made us a bit uncomfortable!! I had to go downstairs to check the weather everyday!! We are overall saisfied with the hotel and would stay there again, but in a room with a balcony facing the street!!", "Date": "October 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brighton", "Title": "“Superb location. Friendly and helpful staff”", "Author": "timmy9765", "ReviewID": "UR72391829", "Content": "Great location and easy to find. Reception staff helpful and speak good English. Rooms are of reasonable size and are kept clean by friendly staff who actually speak and smile to you when you pass them in the corridor! wi-Fi is free but doesn't work throughout the building - you have to go to the dedicated zone on the first floor. Breakfast is great if you get there early - but the quality/quantity of the food seems to be a case of \"when it's gone, it's gone\" so advisable not leave it too long before getting it!", "Date": "July 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "BatleyWest Yorkshire", "Title": "“For a short city break, it fits the bill”", "Author": "MichaelGreen", "ReviewID": "UR68815797", "Content": "The position of the Atlantis Hotel cannot be faulted, about 200 metres or five minutes from Placa Catalunya. We had a fourth floor room overlooking the street, which was surprisingly quiet. The room was perfectly adequate - room enough, and very clean with nice bathroom. Reception not the greatest English speakers ( but I'm not the greatest at Spanish !!) but very friendly and helpful. Although breakfast room and lounge do not have external windows, they are functional, clean and tidy. I would recommend 1. the bus from the airport into Placa Catalunya for 5 euros, and return 2. tour of Barcelona FC - a good deal for 17 euros, even for those only remotely interested in football 3. visit Parc Guell (for free), from Lesseps on the Metro - interesting Gaudi designs 4. visit Sagrada Familia 5. spend an hour or so at the Magic Fountains in front of Palau Nacional (for free), listening of course to Freddy Mercury's 'Barcelona', best at night of course for best effect. Very romantic All in all, had a great 3 days in Barcelona. If you are expecting the Ritz - don't go to the Atlantis Hotel. If you want a great location, and a good clean hotel - then book this one. It's good value.", "Date": "June 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "West Yorkshire", "Title": "“Everything you would expect from a 3* hotel in a great location”", "Author": "JJS2010", "ReviewID": "UR61004186", "Content": "Many of the issues raised by fellow reviewers on this hotel are in the least harsh and in most circumstances completely unjustified. The rooms were clean, tidy, spacious and modern. The service was knowledgeable and polite. The breakfast catered for all tastes and the location is superb. The slight street noise experienced is small price to pay for being right in the heart of Barcelona. Those looking for 5* opulence are never going to find it within a hotel which never boasts to offer more than a 3* rating would suggest. I would recommend this hotel to anyone looking for a short and comfortable but affordable break in this wonderful city.", "Date": "April 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "NZ", "Title": "“Great location, excellent value for money”", "Author": "kay01nz", "ReviewID": "UR53568838", "Content": "The other reviews say it all, except that at Christmas time its wonderful to look out the window onto the lights of the street, and be only a 5 minute walk from all the action. For those who suffer badly with the currency exchange problems with the Euro this is an excellent choice for a very acceptable hotel at a reasonable rate. The other advantage is that there is a huge range of food outlets in the area ranging from cheap and cheerful to expensive. The hop on hop off bus stops within 1 minutes walk,", "Date": "January 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Arizona City, Arizona", "Title": "“Very Good 3 Star hotel/ Great location”", "Author": "BillPaul", "ReviewID": "UR50450187", "Content": "Located a short walk to the Ramblas and Placa Cataluna. We stayed three nights prior to a cruise. Hotel has a small lobby and no bellman to take care of your luggage. elevators to all floos handle luggage well. Room was neat, bed comfortable, bathroom was more than adequite. The morning breakfast was the same each morning but had a wide variety of items - juices, coffee, tea, pastries, rolls, cold cuts, hard boiled eggs, fruits and so on. We booked through a hotel service and our price was 98.00 dollars (US) per night If we go to barcelona again we would use the hotel. th staff was very good, with the exception of the night clerk who was a little rude at times but all other staff were helpful and friendly.", "Date": "December 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Canterbury, United Kingdom", "Title": "“Decent, convenient, uninspiring”", "Author": "Northernblonde", "ReviewID": "UR48755147", "Content": "I’d agree with pretty much all the recent reviews. We spent 2 nights at the Atlantis in early November on a business trip, but had also stayed a few years previously for the same reason. The positives; Location – a few minutes from Placa Catalunya with all its transport connections including hassle-free bus trips to and from the airport for 4.5 euros each way. Price – hard to find anything decent in central Barcelona at this price. We go there often on business and this is probably the best option if you want a convenient position. Cleanliness – not 100% but more than ok. Air con – necessary as the room was stifling even in November. Beds – we found them really comfortable, maybe a bit soft for some people, but great for us. The negatives: Rooms – mostly a choice of noisy room with window & view or quiet room with claustrophobia due to its 1 window opening onto a “courtyard” i.e. a 3m square shaft running from the ground floor up to the 5th where it’s sealed so no fresh air can get in. Also acts as a loudspeaker if you are unlucky enough to get a noisy couple below whose waking hours are out of sync with yours and who like to have their window open. To increase my feeling of wanting to get out of the room, a portrait of a decapitated nude woman surrounded by splashes of red (blood?), the odd rabbit and other supposedly symbolic objects had been placed opposite the bed. Surrealism or a campaign against the testing of cosmetics on animals? After 2 nights contemplation the jury’s still out... But not really what I wanted to wake up to. Breakfast – a windowless area with mediocre and unchanging food but pretty well looked after by the staff. My husband’s American breakfast was fine, he assured me. But does it really cost much more to supply real orange juice (in a country renowned for growing citrus fruits) and drinkable coffee? I noticed several savvy couples with Starbucks takeaway cups on their tables from the branch a few minutes’ walk away. But having said this, we’ve had much worse in Barcelona in hotels of around the same price. In one not too far from the Atlantis we found the tables awash with spilt coffee and milk between piles of dirty crockery (they were never cleared until the end of the breakfast period) and nothing edible. To rub salt into the wound of early morning starvation we had to watch a group of Russian tourists being served boiled eggs but no-one else was allowed one, however hard we all grovelled! All in all the Atlantis gives decent value for a great position and we’ll probably use it again..", "Date": "November 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Texas, United States", "Title": "“Adequate bang for your buck, but lacking in charm and comfort.”", "Author": "niconekoko", "ReviewID": "UR47898052", "Content": "We stayed here for four nights during our honeymoon, before heading off to Sitges for one evening, with plans to return to Barcelona for two more nights to be spent in a 'splurge' hotel. We went with Hotel Atlantis due to its more affordable price and recommendation in various travel guides. While we found it an adequate hotel, especially for tourists and travelers looking for decent accommodations in an accessible area of town, we were disappointed in it, but not enough to make us find a new hotel. We asked for a quiet room, not on the main street, based on the reviews about how noisy it can be at Hotel Atlantis. And we did get a quiet room. But it felt more like a cave. Here's why... Sure, there was a window in our room... that looked out onto a tiny enclosed indoor faux atrium that barely had any sunlight filter through. That's it. And that's the only window we saw in the entire hotel during our stay there. No windows in the cafe/breakfast area, no windows at the 'internet cafe.' This made the hotel feel dark and depressing to us. Also, it smelled of overly perfumed cleaning products in the common areas, but with no windows available to open, it became a stifling scent. I felt like I was not allowed to look outside, or like I was in a very unpleasant retirement home. I wish we had changed to a room on the street, as earplugs can help block out sound if needed, and it would've been nice to have a look at the outside world from our room. Anyway, enough about the lack of windows. The room was comfortable enough, a bit outdated and dark, and not quite as clean as our other rooms during our stay, but adequate. The room had a laminate 'wood' floor that felt uneven and not well swept, so I kept a towel on the floor by the bed to wipe debris off my feet before getting into bed. There seems to be flood problems with the shower, as the wall along the bathroom shows obvious water damage on the bedroom side, but we experienced no problems with flooding or the like. A mini-fridge, laser combination safe, and free wi-fi helped us feel more comfortable in our room. Breakfast offered cereals, fruits, pastries, cheeses, and the like, however, it was no where near as nice, as fresh, or as large a spread as we found in our other hotels. We both found the breakfast to be a bit sad, and only ate there once, opting to eat breakfast out and about despite it being included with our room at the hotel. In all, if you just needed a safe, decent place to rest your head in Barcelona and you're not looking for any frills or thrills, you'd be fine here. I would not recommend it for a honeymoon or romantic holiday, however. And I would definitely not recommend it if you're an environmentally sensitive type like myself who needs sunshine and fresh air to be available to stave off feeling ill. At least it was close enough to plenty of transportation that enabled us to spend our days away from 'the cave.' : )", "Date": "October 27, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Great Location - City Hotel”", "Author": "BakuBabs", "ReviewID": "UR47811412", "Content": "I liked this hotel because of its location. Room was good size and decent breakfast.", "Date": "October 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Israel", "Title": "“Great location, nice rooms, good staff”", "Author": "kobibn", "ReviewID": "UR46165813", "Content": "The hotel is located 3 minutes walking from La-Rambla so its near by and quiet. 2 metro stations that gets you everywhere. 5 minute walk to plaza Catalunya which many tours departure from it (and all metro lines). you can ask the staff everything and they will always assist. Nice breakfast. In one word, recommended.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Big Canoe", "Title": "“Great Choice and value in the center of the city”", "Author": "Vansland", "ReviewID": "UR40625409", "Content": "What a great choice for a hotel close to everything and under $130 per night. The rooms were large, clean well decorated with a modern bathroom. Great hot breakfast with lots of choices was included. The staff spoke English and were very helpful. For example, one of their suggestions was the Hop -on hop- off bus which left from the main square just two blocks away. Great choice, since we only had one day to see the city before our cruise left. We would stay there again, for sure.", "Date": "September 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Norway", "Title": "“Great location and middelclass priced hotel”", "Author": "DSK4", "ReviewID": "UR33479775", "Content": "This hotel is located 5minutes from Plaza De Catalunya, and is easy accessed with bus and train from the airport. The hotel is located in a street above Rambla street- and it makes a perfect- close to all the action but still quiet. The buffet breakfast is not very impresseiv, but in the surronding area you will find small shops with bocadillos (sandwiches) tog go + several restaurants with a lot of choices. The touristbus also depatures from Plaza De Catalunya.", "Date": "June 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Puerto Rico", "Title": "“Great location”", "Author": "Power222", "ReviewID": "UR32147518", "Content": "Great location very close to Plaza Catalunya and Ramblas.", "Date": "June 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great Hotel Convenient Location”", "Author": "supermonchi", "ReviewID": "UR30639305", "Content": "Location: Centrally located between Catalunya and Universitat train stations, and only a short walk to La Ramblas, we thought location was the best selling point of this hotel. We had somewhat a tight holiday schedule and thanks to this prime location, we were able to sneak back to the hotel for a quick shower and to rest in the afternoon before continuing on in the evening. Room: Unlike the experience of other reviewers with rooms facing the streets which were reportedly noisy, we had a room facing the courtyard and it was really nice and quiet. We had 2 single beds pushed next to each other and we found it was very comfortable, we slept very very well. The air conditioner works fine. There is a tiny bar fridge but no kettle or tea/coffee facilities. The shower was fine. The bathroom was cleaned and had the bath/toilet amenities restocked everyday. There is also a password-protected safety deposit box in our room which was great. Breakfast: Breakfast goes from 7.30-10am. The breakfast buffet is small and has the same food every morning, but adequate enough for us to carry us through to lunch. It has a range of cold cuts (salami, ham, etc), hot food (scrambled egg, mushroom, sausages, bacon, potato balls), toast, cereal, fruits and sweets. Other: Staff was professional, well presented, friendly and spoke very good English. There is an internet station which worked fine for us. There is also a WiFi area but we didn't use it. There are also a good range of brochures, maps, etc at the reception. We really enjoyed our stay here and would not hesitate to recommend this hotel to fellow travelers.", "Date": "May 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Great Location”", "Author": "Symmy44", "ReviewID": "UR24168965", "Content": "The best thing about this hotel is it's location closely followed by it's cleanliness and polite and helpful staff. It has easy access to the Metro system and is in walking distance of most city centre sights as well as being only about 200metres from Las Ramblas and, therefore, close to restaurants and bars. Ideal for a city break and a decent breakfast to boot. We found a lot of the restaurants quite expensive especially if you had a bottle of wine but we were lucky enough to stumble on one called L'Oliva where the food was superb despite being slightly cheaper than the others and the wine was only about two-thirds of other restaurants. Eg we paid Eur 9.95 for a bottle of the same wine we had had in other restaurants at 16.95. To find this turn right out of the hotel and then right down the first side street you come to. L'Oliva is on the left at the bottom of this short street. Incidentally there are two good local cafe/bars neary as long as you don't mind being surrounded by students.", "Date": "February 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pasadena, Calfornia", "Title": "“Great location - Clean and comfortable room”", "Author": "Sally137", "ReviewID": "UR21715792", "Content": "Spent 3 nights at the Atlantis. We were very happy with our room. It was clean and the beds were very comfortable. The location was wonderful. We were close to Las Ramblas and to public transportation. The On/Off bus was a few blocks away and it was an easy walk to the Sagrada Familia and the Picasso Museum. With most of the hotels so very expensive, we were delighted to discover the Atlantis for 107 E per night with breakfast and taxes included. *Best dining experience was at Botafumeira. Excellent food, beautiful presentation, and attentive service *Best tapa experience was at La Boqueria. What a fun, fun place that is!", "Date": "November 10, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "sebastopol, ca", "Title": "“A Very Pleasant Surprise!”", "Author": "kawh", "ReviewID": "UR18147682", "Content": "We got a great rate for this hotel-- and it was in the perfect location, just at the top of Ramblas-- so we didn't expect it to be great. We were pleasantly surprised. No Noise at all. We were in a room that had a window facing into a center solarium-ish opening. You could see other people's windows across the opening... but not a problem, as we kept our curtains shut. It was not far from the elevator... but was completely quiet. No noise at all. Very clean. Smallish bathroom. Good shower. Front desk was helpful when we needed it. Free wifi and also use of 1 computer near the front desk. (must stand to use the computer-- but this tends to limit people's time, so didn't usually have to wait.) Breakfast was slightly above average. fresh fruit. several choices of protein (soft and sliced cheese, ham, boiled eggs) several breads & cereals, fruit juice, toaster... it was quite a good selection. This is a short block off of Ramblas, at the top. Easy to walk down Ramblas or Passeig Gracia. Very near our favorite ice cream at Panelles Donat on the cute Portal de l'Angel. We liked this hotel for its location, cleanliness, and very quiet room. If noise is an issue, ask for a room around the solarium (i don't know what to call it... a space where 4 rooms face inward toward an empty space....??) -kawh", "Date": "July 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "nothern ireland", "Title": "“Great city hotel in a perfect location!”", "Author": "gemandali", "ReviewID": "UR17227106", "Content": "Just returned from 2 night stay in Hotel atlantis following a 5 night med cruise. Was a little nervous as we had read some rv's that weren't too good. However, we found that the hotel was ideally located at the top of Las Ramblas. The rooms were clean, spacious, fresh towels daily and great facilities. The bar was closed ( don't know why) but we were made very welcome in the neighbouring hotel Lleo. We had our 3 year old son with us and found the Hotel perfect. We were overlooking the courtyard and there was no noise or disturbance. Highly recommend this hotel or if it is booked - try the lovely Hotel Lleo next door.", "Date": "June 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Great Hotel...but a bit noisy!”", "Author": "Chrystie22", "ReviewID": "UR16787850", "Content": "My sister and I stayed at the Atlantis from 3 to 6 June 2008 and had a great time. The hotel is ideally situated, 5mn from Placa de Catalunya where you can catch the Aerobus to the airport and Las Ramblas, a long street with many shops and restaurants. It is also close to all other attractions. Our room was nicely decorated and rather spacious, the only downside was that it was overlooking Carrer de Pelai, a very busy street, and the volume of noise was terrible! Moreover the windows were old and not closing properly so it was difficult to sleep but we somehow managed as we were tired after walking around town all day! The breakfast was quite good with a wide selection of food. All in all, a good experience and I would recommend it but I advise you to request a room overlooking the courtyard when you book if you want to have a good night sleep....", "Date": "June 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sunderland, England", "Title": "“Great hotel but noisy.”", "Author": "SAFC08", "ReviewID": "UR14387217", "Content": "We stayed 3 nights at the Atlantis in February and overall everything was great. Our junior suite on floor 3, was very spacious, clean and modern with a great bathroom and very comfortable beds. There was a great choice at breakfast ,staff were friendly and helpful and the breakfast room was clean and bright. The hotel's location is perfect, only 3 minutes walk to the top of Las Ramblas and there is a good range of shops, bars and restaurants nearby. There was however some problems with noise. A very noisy, foulmouthed American occupied the room next door on our 2nd night and woke us all at 6.00am when he returned drunk and started screaming and shouting. During our 3rd night, someone held a rave party in a nearby apartment and we were kept awake for 2 hours. The hotel concierge was apologetic and investigated but could not help. If you visit this hotel it might be worth checking if this problem is a regular occurence. Earplugs are recommended.", "Date": "March 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Belfast", "Title": "“Great Central Location”", "Author": "NornIronMan", "ReviewID": "UR10078403", "Content": "Having stayed in Barcelona before we knew the location. I read the reviews on here and went ahead and booked. Turned out to be a great move! The hotel is just off Cataluna Square at the top of Las Ramblas and convenient to all local sites/shopping etc. We were only there one night (Fri 5 Oct) as a pre cruise stay. Check-in was a breeze and the room (508) was small but adequate for 2 people. It looked like it had been recently renovated as the bathroom and fittings all looked new. Overall we would go back to it again.", "Date": "October 14, 2007"}], "HotelInfo": {"Name": "Hotel Atlantis", "HotelURL": "/ShowUserReviews-g187497-d228579-Reviews-Hotel_Atlantis-Barcelona_Catalonia.html", "Price": "$113 - $166*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Carrer de Pelai 20</span>, <span class=\"locality\"><span property=\"v:postal-code\">08001</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "228579", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/44/bf/44bf57a535d2db16a3902b8cb384e1c68large.jpg"}}