{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "", "Title": "“great location terrible hotel”", "Author": "sk321", "ReviewID": "UR139939061", "Content": "What a great location, right in the center on a bustling shopping plaza. What a disappointing experience, unhappy, rude, unhelpful attendant and very small rooms with 4 bunk bed. Good if you need to house a gaggle of teenagers, but that is about it. My wife and i would never stay here again, and would not recommend it to anyone.", "Date": "September 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great location, tiny rooms.”", "Author": "pamiela2009", "ReviewID": "UR139445369", "Content": "What a perfect location near Plaza Sol. The staff on the whole were a bit hit and miss. Some were great, others disinterested. Every night a different busker was performing in the street under our balcony which was great -except the one pretending to be a bad baby. The computer in the room is very convenient and a big help to us because I was robbed and had to rearrange my finances via home. But when they say small rooms, they mean it. Really, really small. In fact you can't fit two suitcases in the double room. We had to store one under the bed and keep the other closed and standing upright. Bit of a nuisance. The other problem was the smell from the bathroom. We complained and they fixed it for a day - but it came back. It may be just that the plumbing can't cope. I noticed a reviewer complained about the taxis - but the hotel called them for us when needed and they came right to the door. No problem. But I would probably investigate alternatives if I went back.", "Date": "September 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“great location, not so great hotel”", "Author": "amoorhead", "ReviewID": "UR137997427", "Content": "We stayed here in October 2011. The location was awesome and we loved having a tiny little balcony to step out onto. The room was extremely small - would have to step over our suitcases everytime we walked around the bed. Overall, it was fine for us, only staying in Madrid for 2 nights, but I would definitely not recommend it for a long stay.", "Date": "August 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Central and quiet”", "Author": "Patrick O", "ReviewID": "UR135677213", "Content": "The best thing about this hotel is that it is at the centre of Madrid but also not noisy at night. Very friendly staff and lovely roomy room. The metro station is just outside as are the shops, cafes and restaurants.", "Date": "July 29, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Great location, tiny quarters”", "Author": "sheila f", "ReviewID": "UR131089837", "Content": "I had stayed at the Petit Hotel Londres in 2001, and booked again in 2012 knowing that it is within walking distance of all of the best food, nightlife, and sites in Madrid. My experience in 2012 was much different than mt stay in 2001. I had booked the same type of room, but was given a very small room in the corner of the hotel. The quarters were extremely tight for my husband and I. Other family members that we were traveling with had booked the 4-person room. The quarters were also a bit tight but had a balcony with a great view. Our bed had the side of it up against a wall, so you could only get into the bed from one side. There was less than 3 feet of walking space in the room. Even the shower was tiny. You have to squeeze your knees into the shelf under the sink in order to sit on the toilet. We visited Madrid in May 2012 and it was 90 degrees all week during our stay. The hotel did not have any air conditioning on and it was EXTREMELY HOT in the room. We called the front desk and asked them to turn on the air conditioning and they advised that they \"were not aware that the weather would be so hot and would be turning on the air conditioning the next day\". It was very difficult to sleep because the window opened inward toward the room and the corner of the window was 3 inches from my head when I was laying in the bed. I was scared that I would hit my head on the corner of the window if we kept it open. We asked to change rooms and they advised us that it was not possible. One of the windows in my room opened into a cement wall! The air conditioning was finally turned on. Now, there are also good points to this hotel. The main positive attribute is the location. This hotel is one block from SOL, the center for all of Madrid's biggest parties, festivals, parades, pep rallys, and demonstrations. We saw a number of amazing sites in sol just by chance while walking to & from our hotel. We walked right into the Team Atletico pep rally, the San Isidro parade, & the \"Occupy Madrid\" demonstrations. These are all sites that we would have missed had we not stayed in this location.", "Date": "June 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "england", "Title": "“A good city hotel”", "Author": "asty", "ReviewID": "UR130479061", "Content": "We stayed here for 5 nights whilst in MAdrid on business. Although I would not chose to stay there if I was on a romantic stay, with colleagues it was perfect. The room was clean and tidy and yes it is in a fantastic position for the city, literally minutes walk from Sol. The bed was comfy enough and breakfast was excellent!", "Date": "May 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Great location, great price, great hotel!”", "Author": "Swaley", "ReviewID": "UR128968617", "Content": "Firstly, I have no idea why people are complaining about the noise here. If you book a hotel right in the centre of a capital city then it's hardly going to be a haven of tranquility! Here's a tip - close the window if you dont like the hustle and bustle of city life! This is a reasonably priced, perfectly located hotel with modern, clean rooms and great character! The staff were helpful and friendly, even though I dont speak a word of Spanish, the beds were incredibly comfortable and the rooms a reasonable size, modern and well maintained. The shower was fantastic and the free laptop in each room was a godsend. Who needs guidebooks when you have a world of information right there in your hotel room? Breakfast is served on the hotel roof which is a great touch, there's a little courtyard you can sit out if the weather is nice and enjoy some fresh air, the selection is great and it's well priced. Our room overlooked Calle de Galdo, and yes the streets are busy but close the window and the sound is blocked. To the point where I didnt even notice the Madrid Marathon was going on right under our window!! Overall, this is a fantastic hotel if youre looking for somewhere well priced for a city break.", "Date": "April 28, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“3 star and lacking”", "Author": "TracyAP", "ReviewID": "UR128117724", "Content": "Based on a Kirker package, this 'centrally located' hotel was advised to us and our family of 4. Yes, it was a good location - city center, shops, metro - but the size of the room, the poor quality of the mattresses, broken shower and the overall bad smell quickly showed us why never to book a family room in a 3 star property. No cushy moments, here, after walking the Madrid streets. Shame on Kirker!", "Date": "April 18, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good location but...”", "Author": "Ramjam275", "ReviewID": "UR127530632", "Content": "We booked a family room for a 3 night stay in Madrid. The hotel is right in the heart of a pedestrian area, so it took the taxi a while to work out how to drop us off at the door. We had booked a taxi service through AeroCity, which was fortunate as they offer a door-to-door service from Madrid airport. I suspect a normal taxi would have dropped us off somewhere near Sol metro station and expected us to find the hotel ourselves. The room was small to say the least. The bunk bed was against the wall and there was no safety bar for the top bunk. The twin beds weren't particularly comfortable. The shower attachment in the bathroom was hanging off the wall and didn't really inspire any confidence at all. Our room had a balcony that looked out onto the Hotel Liabeny. I wish I'd booked that now rather that the Petit Palace Londres. Given the location, it was very noisy at night, which made getting a good night's sleep difficult. The air con wasn't that good, so we were forced to keep the balcony door ajar to get some air into the room. The room did have a laptop, which entertained one of my kids however if you were hoping to use the laptop to check-in for your flight, forget it, as there's no printer available and the front desk weren't particular helpful or forthcoming in offering the services of their printer. Overall, the location is great but the stay was terrible.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“great location, helpful staff”", "Author": "anonymoose", "ReviewID": "UR127039021", "Content": "Excellent location. Noisy if your room has a window facing the street. Rooms are ok but I wouldn't recommend using the top of the bunk bed as we found that the safety bar easily popped out and the whole thing didn't seem very sturdy. Free internet and laptop use was very nice. Rooms are tiny but so were all the other places I stayed in during my visit to Spain. Elevator was big enough to fit 2 people plus giant backpacks. Front desk staff helped us book bus tickets to Barcelona and were extremely helpful with other questions. Felt very safe the whole time. It was a little pricer than I would have liked, but the location was so good that I was ok with it.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Would not stay here again!”", "Author": "Aimen", "ReviewID": "UR125775624", "Content": "All in all a 2 star stay. Location is unbeatable 2 mins from the sol, which is a plus as well as a minus. We basically could not sleep the 5 nights we stayed here. Small elevator we could not fit our luggage in it and had to walk it up to the room luckily we were only on the second floor. It was a safe hotel which is needed considering all the craziness that goes on in sol. It was always noisy with performers, drunks and teenagers partying wee hours of the night. Once my husband had to beg a street performer singing at 2 AM right below our bedroom window. The room was small with hardly 1 foot space between the bed and the walls. The bed was the most uncomfortable one we ever slept on lumpy and hard with two thin lumpy pillows and no sheet or comforter. Bathroom was dirty. The 5 days we stayed there the sheets were not changed even though we requested them. There was no iron in the room and when I called the front desk I was told that there is only one iron that is going around the hotel and may not make it to us in the next hour or so. We paid $160 a night for it and it was definitely not worth it. I understand that the area is expensive and you get what you pay for but in retrospect I would have rather have paid twice as much for a better experience. The pictures are deceiving so do not be fooled stay somewhere else.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "widnes", "Title": "“Great location right in the heart of the city”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR125301952", "Content": "We stayed here fpr 4 nights perfectlocation hotel was good value for money spacious room only problem was we were on the first floor did get noisy at night i suggest you ask got a room higher up apart from that we could fault the hotel was easy walking distince for all main attractions.", "Date": "February 27, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Reggio Emilia, Italy", "Title": "“okay”", "Author": "ITA_And_RE_a", "ReviewID": "UR124628587", "Content": "Easy walking distance to key tourist areas. Triple was large, double was tiny, but adequate. Shower in triple overflowed and flooded room due to clogged drain. Staff very responsive If you are after luxury forget it, if you want a comfortable and convenient room then I recommend this.", "Date": "February 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Leiden", "Title": "“Free use of a laptop with internet in room”", "Author": "davidoffski", "ReviewID": "UR123543975", "Content": "We arrived in Madrid in the middle of the night, with four hours of delay. Taxis are not allowed to stop in the area of the hotel since it is a pedestrian area, and we had some trouble finding it. The entrance is in a small side street of a major shopping area near Madrids Sol square. The neighborhood isn't very quiet, and we heard some noise from other rooms now and then, but apart from this, Londres is a fine hotel. We enjoyed the location: right in the center of town and just a minute walking from a subway station. We had a room with a small balcony overlooking a shopping street, and to our surprise we found a laptop in the room with free use of internet - never seen that in any other hotel. Breakfast is on the top floor of the hotel in a nice, calm and light place. A nice and simple hotel for a good price!", "Date": "January 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Aspen, Colorado", "Title": "“Comfort stay”", "Author": "Sizko", "ReviewID": "UR123327035", "Content": "I stayed at this property for three nights after a week long Spanish immersion getaway. The location is excellent, albeit a bit tucked away if unfamiliar with Madrid. The room had plenty of amenities (i.e. internet, a laptop, TV, balcony, AC). If you have never been to Madrid, especially in the heart of the city, be advised that Spaniards are very serious about their night life activities and you will be well aware of it on any given night. I have stayed at other Hotels in the City and have concluded that if you have a street facing room, you will hear Spaniards singing, screaming, etc...till the sun climbs into the sky. Madrid makes NYC look like it is only open for breakfast and lunch! Madrid is a 24hr/day city like no other. You will need a vacation from your vacation to Madrid.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Michigan", "Title": "“Wonderful stay”", "Author": "dhs56", "ReviewID": "UR122762251", "Content": "Our family of 5 stayed in one room in July. We had a very comfortable stay in a large room with 3 great balconies. It is on a fun, active street, but not too much noise after midnight. A/C was great and much needed in July. The beds were comfortable and we had plenty of room for our luggage. There was a laptop and free wifi. We did not get the breakfast because it was too pricey for 5 people! The staff was nice, our daughter speaks Spanish, so that was very helpful. The room was clean, the bathroom large. There are restaurants very close by. Excellent location! Would stay again!", "Date": "January 8, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“Poor Quality Hotel in an excellent location”", "Author": "stephen_brown", "ReviewID": "UR121709593", "Content": "I had the misfortune of staying in this hotel for two nights earlier this year with a friend. I made my booking through E-Bookers for a twin/double room but when i arrived there was only a double available and the hotel insisted there was no other rooms to move into or even a foldaway bed, therefore I had no option but to sleep on the floor for two nights. Don't be fooled by the courtyard room on offer, a tiny room, which basically looks onto a dingy square reminiscent of something from an eastern block country in the old communist era. The hotel is situated in one of the best locations in Madrid and this made the stay slightly better than being a total disaster. However, I would not recommend this hotel.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "San Francisco, California", "Title": "“Awful cabbage smell and a sleepless night.”", "Author": "Momomoriarty", "ReviewID": "UR120544978", "Content": "Really surprised to find only one other review here that reflects our experience... Boyfriend and I booked a \"standard room\" through Orbitz the night before arriving in Madrid. Our cab had to drop us a few blocks from the hotel because there were too many people (common) for front door service. We waded through the massive crowd to get buzzed into the hotel. The front desk service was really great but that's my only good comment. We carried our bags up to our room because the elevator didn't seem to work and there was no porter to help. The room looked pretty shabby and I've stayed in some bad places. We decided to give it a chance because we were excited to get out and explore Madrid night life. The shabbiness included cigarette burns, wardrobe ready to fall apart, tiles/laminate peeling/separating, wallpaper coming off, floor boards sagged under foot (I weigh 115), the two twin beds were more like poking spring torture devices and last but not least the walls/door were so thin that it sounded like people were in your room. Including a puking neighbor and some persistent visitor who felt like knocking continually for five minutes would yield results. The dude may have been puking because of the persistent awful cabbage stench but I'll never know for sure. We got zero sleep but did discover some great late night Spanish soap operas. Once the sun came up I made a few phone calls and booked a much nicer place near the Museo de Prado for less than the cost of this one. Its a short walk to get back to Puerta del Sol and Plaza Mayor with better food and less crazy crowds and beggars.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Nice Basic Hotel and its in the heart of madrid..”", "Author": "Krockz77", "ReviewID": "UR120321929", "Content": "had a night stay here in madrid (week 4 october 2011) before travelling to malaga Opted for a place for 4 adults. exactly the same view as the pictures posted by our reviewer. a double decker bed and a queen size bed. its good for a comfy short stay, clean toilet and room, room is quite small. Other than that, its strategic as its in the hub for shopping. lotsa shops on walking distance. even the Sol Metro is nearby. Not a good spot if u rent a car. the best is walking on foot around the puerta del sol area .. i like the customer service too.. and there is laptop available in my room or usage, wired connection. As for wifi, its at the lobby.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“EXCELLENT LOCATION”", "Author": "Louise186525", "ReviewID": "UR120293045", "Content": "Perfect location in the heart of madrid. The rooms were spotlessly clean and comfortable. We had a corner room on the upper floor which was a very good size , as according to other reviews rooms are small.Everyone was pleasant and helpful. I would stay here again.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Delft, The Netherlands", "Title": "“Perfect location, basic though”", "Author": "anneroth", "ReviewID": "UR119281587", "Content": "Location is perfect; close to placa Mayor, in between shopping streets and also close to several subways. It's not a design hotel though, what the hotel would like to believe us. It's basic, normal. Rooms are standard size, bathroom is OK. I would not advise to rent bikes of the hotel; they are really not safe. Better rent a bike at Baja Bikes for example, and be sure to have a nice bike.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "ireland", "Title": "“good location, great staff”", "Author": "k1k", "ReviewID": "UR118927629", "Content": "Perfect location for sightseeing..... Madrid tourbus stops in Puerto del Sol just 5mins away. Rooms are small and clean those facing the street can be noisy if window is left open. Easy walk to good restaurants, we tried those recommended by reception staff...all good.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Misleading”", "Author": "Isis918", "ReviewID": "UR118440126", "Content": "This hotel advertised a Romantic Getaway. After 5 weeks travelling through Europe this was to be our last 3 nights in Spain. Definitely not a Romantic Getaway and definitely not value for money. The room was so incredibly small we think they took one of their single town rooms and put 2 beds in it and pushed them together. There was nowhere to put our luggage. So one suitcase went on the desk and the other in front of the balcony doors. Only one person could walk around the room at a time. The bathroom was very very tiny as well, with the shower the same tiny size. We suggested that maybe we had an incorrect room but we were assured that this was a much nicer, quieter room than others available. Definitely not quite either. Other room noises were clearly audible as were the outside crowds and street performers. One of who performed every night under our balcony from 11:30pm to 1am in the morning. The Package was to have been a Romantic Getaway with a late checkout (which we finally got), champagne and sweets on arrival, free desserts in near restaurants (which we were never told where, even if we did want them) The thankyou card offered 2 bottles of champagne. We received one half bottle (hot) and two small tumblers. We did however see other rooms which appeared rather nice and double the size of ours. We also saw other rooms being made up with 2 bottles of Champagne and 2 Champagne glasses. Our lesson learnt - Beware misleading advertising.", "Date": "September 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Jose", "Title": "“Great little hotel, great value for money”", "Author": "Ciberteco", "ReviewID": "UR116173110", "Content": "One of the best locations in Madrid. Refurbished Old Colonial Building. Small rooms but very nice and clean. Friendly staff, free internet. Even a courtesy laptop in my room.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London", "Title": "“What a Find”", "Author": "jamesohLondon", "ReviewID": "UR115536656", "Content": "This was the first time my partner and I had used this hotel and I hope it will not be the last. It was accessible from the airport by metro and local train and was five minutes walk - if that from SOL Station. It was quaint - a cute little elevator, a small reception with very welcoming staff. The room (ours was on the 3rd Floor) overlooked a Church and offered a great spectacle on the Saturday evening, witha procession and a band carrying a statue inside. This room had not only good double glazing, but arguably the quietest and most efficient air conditioning we have experienced. Free internet, with a laptop in the room. A mini-bar was also in the room. Breakfast on the roof terrace. Easy reach by foot for Plaza Mayor and so much else. We were there for a long weekend and bought a 3-day travel card. Great value for money. We were in Madrid to celebrate my partner's birthday and the hotel played a great part in making it a very successful and enjoyable weekend. The restaurant was only open for breakfast, BUT there are lots of good eateries within walking distance.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Braggtown, NC", "Title": "“Great Place & Location”", "Author": "Maar", "ReviewID": "UR115389893", "Content": "We booked this hotel through Expedia as part of our Spain travel package.The location is a very short, fast walk from the Puerta del Sol metro stop and we had no problem lugging our bags to the hotel. Check-in was simple and the lift, while small, does the job. We did not try any of the breakfast offerings as the price is just too high for family travel. Besides, the location is steps away from any kind of food...from American fast food chains to classic Spanish places, in addition to a coffee shop/bakery/ready-to-go food/cafe and supermarket at the El Corte Ingles as well as the amazing market next to Plaza Mayor. There's simply no need to eat-in the hotel when such a dizzying array of choices for all budgets awaits. I'd previously communicated with the hotel desk manager and, following her advice, requested a family room facing the inner courtyard, we instead got a corner room right on all the action. In fact, I'm glad of it, because the inner courtyard seemed to be little more than a vertical alley lacking in any charm or ambiance. Our room, however, featured 4 balconies (which thrilled our 6-year-old to no end)--including one in the bathroom (useful, given Spaniards lack of exhaust fans in bathrooms). The windows seemed insulated and with the air conditioning on, the lively street noise was not excessively irritating. Our visit coincided with Madrid Orgullo Gay 2011 (gay pride) and there was quite the party happening late into the night of 2 July. The other two nights of our stay were quite quiet by comparison. The room itself, while compact, was well laid out and contemporary in design and furnishings. As I've found to be the rule rather than the exception in Spanish lodgings of all star-levels, the room was clean and cleaned well. There was a large king sized (two singles) bed and a pull out couch. As one who slept on the couch, it was perfectly adequate for my size, although I expect a person 200-pounds plus might find it uncomfortable. The in-bathroom exercise bike seems really unnecessary, given the lack of space, and that the left pedal was missing. Speaking of unnecessary, I realize that's a European thing, but as traveling usually requires some sacrifice of the conveniences of home, must every hotel room bathroom include a bidet? They take up a good amount of space and the South American native with whom we traveled didn't care for the idea of using a bidet used previously be strangers (they were not emblazoned with a sanitized banner as were many of our toilets). Amenities in the bathroom were adequate and, again, the El Corte Ingles is across the street (in 3-4 separate buildings, as well) for any needs. We also did not inquire about using the hotel's free bicycles, as we were content with walking and riding the Metro for our area travel needs. We would be glad to stay here again.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“book in advance, excellent location, extremely slow wireless internet”", "Author": "Varinia", "ReviewID": "UR114452837", "Content": "-as usual, a room for 4 people booked in advance ended up costing me the same as a room for 1 person a week in advance - be aware of this. Prices do not include breakfast -location is superb - in the middle of everything. Noise is till late on weekends in some rooms of course -wireless internet is free but painfully slow. I would say this is by far the worst part of the 3-star hotel. There is a laptop on every room though with faster wired internet - not bad -other good things: the room for 4 is big, there is a fridge, there is a big desk, room is big, one king size bed and one queen size bed, service is generally good (e.g. people bright additional cups of coffee to the room when asked, they say \"hola\" when you arrive, etc.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Healdsburg, ca", "Title": "“Well located and reasonable”", "Author": "Squeaky11", "ReviewID": "UR113524261", "Content": "The small double is indeed very small,with double bed pushed against the wall, and on an interior airshaft, but adequate for a one night stay. Excellent location near Puerta del Sol within walking distance of many attractions, free wifi and computer. Spacious bath.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Bristol", "Title": "“Good hotel, excellent location”", "Author": "hs_prd", "ReviewID": "UR112842734", "Content": "Right next to Puerta del Sol so ideal spot for being in the middle of Madrid and about 2 minutes walk to Sol Metro & Cercanias. Good room, decent size for the location. Also had a balcony which is great for being able to take in the Madrid mayhem going on in the street below. Decent size bathroom (shower only, no bath). Not only free internet, they threw in a laptop in the room as well. Good quality breakfast - taller people need to be careful as the breakfast room is on the top floor and the ceilings are a bit low in places. Take a crash helmet. Overall a good hotel for a short stay. May not offer enough for a longer break but recommended nevertheless.", "Date": "June 12, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Good location and suited only for rest purposes”", "Author": "AussieGreggie", "ReviewID": "UR111799860", "Content": "Hotel was central to everything. Standard rooms are small and suit only to get some rest / sleep after touring and partying. Breakfast on the rooftop was average but did the job. There is no restuarant to eat or lobby bar etc to have a night cap so do that in town before heading back to the hotel. Being non Spanish speaking I found the staff made an effort to communicate in English and make the guest feel comfortable. Secure premises. If you are after luxury forget it, if you want a comfortable and convenient room then I recommend this.", "Date": "June 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Colombo", "Title": "“The Location”", "Author": "Shardha", "ReviewID": "UR110047164", "Content": "The hotel is located in the middle of the old Madrid. The metro is right in front. The gran via is only a 2 minute walk and the shops are just all round the hotel. Itś so much that you forget the sight seeing if you walk in to the shops. The triple room can accomedate 4 and large for an Europen city hotel. The free lap top and internet is a bonus. The hydrotheraphy shower units advertised by the hotel are dated and not much of use but the normal head shower is good. No english on the cable TV. The breakfast is not the best but not too bad either. Check out time is very strict so if you have a late train to catch a park would be the best option. They do have a luggage depositery. ABOUT MADRID RAILWAY STATION: BEWARE OF YOUR BAGS.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "York, United Kingdom", "Title": "“A nice little hotel with a great location”", "Author": "nerv0usflyer", "ReviewID": "UR103930516", "Content": "This is a nice little hotel with a great location right in the middle of all the action. The nearest metro stop is Sol which is a minute or so away. There are shops aplenty all around if you like that sort of thing. This is not a quiet area. Having said that, the double glazing is pretty effective for shutting all the outside noise out. If, like me, you love the hustle and bustle, you can enjoy some great busking from your own balcony! Now onto the room: our room was small but adequate. The shower was powerful and gloriously hot. There was free wifi and even a laptop to use if you don't bring your own! There was a mini-fridge which was brilliantly cold. Oh and I loved my little balcony! Two quick recommendations: Visit Chocolat for churros and chocolate. We tried several places and this was the best one. Have lunch in the Mercado San Miguel. Delicious. Watch the crowds and watch your bag though.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cheltenham, United Kingdom", "Title": "“Central, clean, friendly affordable - what else would you want?”", "Author": "pikerloo", "ReviewID": "UR94384163", "Content": "I have just returned from a long weekend in Madrid with friends, and would definitely recommend Petit Palace Hotel. 4 of us shared a family room, which could have been slightly bigger, but perfect for a base due to it's central location. It's set 30 seconds from the centre of the city, in a pedestrian zone meaning it was fantastically quiet at night. Shops and restaurants are only a few steps away, with various Metro stations equally as close (I recommend Callao - it's just as close as Sol but on a better line). The staff are friendly and provided us with a map which was the key to our weekend navigation - I even saw a member of the front desk helping other guests book Real Madrid tickets. The added bonus of a decent laptop, free safe and WiFi made us even more we had made the right choice for a hotel in Madrid. I don't doubt that some people have bad experiences with hotels - but when looking I found that this had the most positive reviews across several sites, and I'm pleased to add to that.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rio de Janeiro, Brazil", "Title": "“Excellent Stay!”", "Author": "Wazari09", "ReviewID": "UR93397886", "Content": "Excellent stay!!! The location is superb, beside the Sol metro station and square and in the middle of all the action, with a lot of stores near by. The rooms are very nice and clean and exactly as shown on the internet pictures and the price is very good. The staff is always happy to attend you also. Besides all this excellent points, they even provide a laptop inside your room with free fast internet access! The only downside is that buffet breakfast is a little expensive (9 euros), but is good. We loved our stay and would definitely stay here again.", "Date": "January 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Depends on what room you get!”", "Author": "acbuc", "ReviewID": "UR89089830", "Content": "We are a family of 4 and stayed here for 3 nights before we flew to Granada. We came back after 2 days, and stayed for 4 more nights. The first room they gave us was extremely small for a family of 4. It really should be a double. It was difficult opening the closet because the bed was there. In addition, the desk chair was missing, as well as the enter key on the computer. You can imagine how difficult it was to use the computer without the chair and the enter key! We told the front desk about it, and unfortunately, the computer was not repaired and the chair was provided the afternoon before we left. We also needed luggage to be stored since we were flying out to Granada and coming back to the hotel after 2 days. This is one of the reasons I chose this hotel, and specifically stated that in my reservation. When I told them about it, one of the women at the front desk, the bolnde one, told me that they could not keep the luggage and we would have to store it in the train station! I was getting ready to have a long argument when Sandra, the other lady, said that this would not be a problem. Question is, why is this other front desk person spouting things which she is not sure of? All the front desk people were so helpful and accommodating, except for this woman. Definitely needs a reprimand or should be fired. When we came back, they gave us one of their nicer rooms, the one with 3 balconies. This was very spacious, in contrast to the previous one. Apparently, they give returning guests the better rooms. The only thing is that they have no hooks to hang coats and they do not provide tissues!. Overall, this hotel is quite good - superb location, helpful front desk people (except for that woman), clean, good breakfast (although repetitive), etc.", "Date": "December 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baku", "Title": "“Great, clean, super located!!!”", "Author": "faridsafarli", "ReviewID": "UR86976002", "Content": "Stayed in this hotel with my wife. Rooms are good, clean, friendly staff. Location is amazing in the heart of city. You can only walk to all the centered places. Breakfast was great. You will feel comfortable. Notebooks in every rooms with free high speed internet makes journey greater. Thanks to hotel director for this management, and keeping this hotel lile that.", "Date": "November 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Boston", "Title": "“No frills hotel in pedestrian area”", "Author": "ABBoston99", "ReviewID": "UR84202109", "Content": "This is no frills hotel within the Plaza De Sol pedestrian area – this is NOT a romantic “petit palace” so if that’s what you’re looking for, look elsewhere. Thank goodness for the security locked front door.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mumbai", "Title": "“Fabulous Location - Good VFM”", "Author": "dee_swam", "ReviewID": "UR82803813", "Content": "Madrid was our first stop on our 17 day trip to France and Spain. We are three couples in our 20s from Bombay. We had booked Petit Palace Londres after reading reviews here. For around 75 Euros a night, this place is great value for money. From the airport, it is about a 25 min metro ride to the Sol station... with one change. It is about a minute walk from the station exit. We arrived around 11.30 am, and the 3 rooms were ready - a welcome surprise. The check in was quick and the rooms were all on the same floor - another pleasant surprise. There is a small lift (for 2 people and 2 suitcases at a time). We had street facing rooms (I think all rooms face the street). It was a comfortable stay for the 3 days. Clean sheets, hot shower, minibar, balcony... Highpoints: The laptop in the room, with free internet The special offer on the buffet breakfast (juices, amazing offee, baked beans, toast, cold cuts, eggs, cereal and danish selections) - we had this once - for 7€ per head. The location. Sol is a young place, awake till very late at night. The hotel is also walking distance or a short metro ride from all major attractions... The Royal Palace, Grand Via, Prado... There are also nice eateries nearby, open till late at night. And shopping places too. Would definitely recommend.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Grand”", "Author": "Whereareyoujoeybear", "ReviewID": "UR82300495", "Content": "A perfect hotel for a perfect trip. The hotel couldn't be better placed in walking distance to everywhere and at night I felt I was in a safe secure area of madrid. The staff were so friendly and helpful, the night time security man made the trip so happy in his job and full of advice and tips re Madrid. I would reccomend it to anyone, great value for money. We had a lovely room with plenty of space for 3 people and a gorgeous spanish style balcony in which we could see a lovely church and watch the shoppers go past.", "Date": "October 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "MUC", "Title": "“Very central location”", "Author": "statetrooper61", "ReviewID": "UR81187975", "Content": "The Petit Palace Londres in Madrid is located right in the city center near Plaza del Sol. Although located on a busy street the rooms are very calm and have soundproof windows. Each room is equipped with a notebook computer with free internet access. Service is average for a three-start, the rooms good need some refurbishment. All in all a very good hotel due to its location.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great location but be careful with room selected”", "Author": "drummersontour", "ReviewID": "UR80746236", "Content": "Overall great experience. Arrived for a three day stay and discovered that the room booked was not available but the manager moved us the following morning to an excellent room. When things go wrong, it is only then good customer service can be seen. This hotel could not have reacted any better. The location was excellent. It cost only €2 on the train from the airport and we did not need to use a taxi to get to any sites. Hard to find a better hotel and location for the price.", "Date": "September 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Long Beach, California", "Title": "“Great location with super helpful front desk staff”", "Author": "gotitlikethat", "ReviewID": "UR77919059", "Content": "I stayed in a triple room at the Petit Palace with two girlfriends in early August. The location was perfect, the rooms and bathroom were really clean, and having a laptop in the room was a great bonus. We stayed on the second floor right above the entrance to the hotel and didn't have any trouble with noise. The guys at the front desk were super helpful and friendly and even gave us tips on getting free drinks at the bars all night! Thanks guys! Only down side is those hard beds, but we found this to be normal for places that we stayed in Spain.", "Date": "September 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lake Worth, FL", "Title": "“Great Room, great location”", "Author": "aztec273", "ReviewID": "UR72315707", "Content": "Stayed @ the Petit Palace Londres for 4 nights at the beginning of July. Nice sized quad room right on the street with three balconies, but that also was the worst feature. Alot of drunk people from midnight till 7 AM out on the street and you could hear every thing they said & did, so light sleepers beware. Cannot beat the location with shopping, sights and restaurants all near by. Staff were nice and helpful when needed and overall - a nice hotel centrally located, however if I went back to Madrid I would stay near the Retiro park or by the Prado. Much quieter and still only a short ride to all the sights.", "Date": "July 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Tampa, Florida", "Title": "“Nice place, except for the noise”", "Author": "bluefin33", "ReviewID": "UR71629056", "Content": "Everything was fine about this place - staff especially good - except its location. Despite being 2 blocks off the Puerta del Sol we heard street noise pretty much all the time. From early night time to the early morning hours there was sporadic street noise from young people drinking, celebrating or just carousing. I'd find a quieter location next time.", "Date": "July 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great for shopping and short stay!”", "Author": "explorergirl79", "ReviewID": "UR68733703", "Content": "My sister, cousin and I stayed here for 1 night in June 2010. Location: It is located at Sol metro station in the middle of all the shopping. It is across the street from Blanco and on top of Stradivarius clothing store. Service: we arrived from an overnight train from Barcelona around 9am. They said the room was not ready so we left our luggage and went exploring. We encountered 3 frontdesk people and all spoke english and were polite and helpful. Room: we paid 109Euro for the room and it was clean and comfortable. Free WIFI and computer in the room was nice to have. Extra toilet paper, lots of towels in the washroom. The showerhead system was great but sorta small in the bathroom. We were happy with the room. Seemed like the walls were paper thin but werent really bothered by other guest noise. I would come back here for the location.", "Date": "June 26, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Midlands", "Title": "“We were moved from this hotel to sister hotel!”", "Author": "Dotty8", "ReviewID": "UR67451568", "Content": "From the outside and from the internet this hotel looks good, is in a lovely location with balconies looking out onto nice streets. This was as far as we got! Unfortunately the air con had broken on one floor and we were moved to a sister hotel (High Tech Cliper) about 5 minutes away. This was on a graffiti strewn alley off the Gran Via with horrible views onto the alley. We had requested non smoking rooms but two of the rooms were smoking. In my opinion, this sister hotel is not of the same standard and we did not enjoy our stay. I tried speaking to the manager several times at the High Tech Cliper but was told she was not available, only managing to speak to her upon checking out. She did offer a 10% discount on our bill which we accepted but would much rather have been in the hotel we had booked.", "Date": "June 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Chile, Santiago", "Title": "“Never Again”", "Author": "JoanneChile_Santiago", "ReviewID": "UR66549517", "Content": "The walls are paper thin, we were woken up at 4.30am by a couple above our room, they also woke up the people staying next door to us. There seemed to be young people staying here who had been out partying, But during the day I also saw some middle aged people staying here. Were in our early thirtys, but I found this hotel really noisy!! The rooms were small, and our room had 2 single beds pushed together to make a double, there were also bunk beds in a room. I wanted to complain but seeing as we were staying there for 1 night, my boyfriend said just leave it. Downstairs I heard another couple complaning that they also had twin beds in their room instead of a double. The hotel was fully booked so nothing could be done, Personally I think they should inform you before you arrive if you can t have a double bed, for 114 euros per night, thats a rip off. The staff was so so friendly, not overally. We didnt have breakfast, again a rip 12 euros per person. This place was not value for money, if this other place was not full I would have stayed there, it looked perfect for us, cheap and centrally located. The only postive thing I can say is the location. http://www.abracadabrabandb.com/location?l=en", "Date": "June 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Denver, CO", "Title": "“Nice hotel in a perfect location”", "Author": "ColoTravDenver_CO", "ReviewID": "UR61210355", "Content": "This hotel has a great location and a friendly staff. Our room was clean and the bathroom was quite large. However, our “high-tech” shower didn’t function correctly (but was still operable). If you are a group of four; the “family room” is the way to go. We requested a corner room on the 2nd floor and it had 4 balconies! All had great views. The computer in the room with Internet was a nice touch too. It was amazing how quiet the room would get when you closed the balcony doors, I couldn't hear any street noise at all! I would recommend this hotel.", "Date": "April 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Central Location”", "Author": "mashag82", "ReviewID": "UR57547151", "Content": "I stayed at this hotel for 2 nights and had a great experience. The room was very spacious and clean, with very comfortable beds! The bathroom (which included a high tech shower as well as a whirlpool tub) was also quite spacious and modern, and the room also came equipped with a laptop for our use. The hotel is very centrally located and we were able to walk absolutely everywhere! The only things I would say is that the service desk was not overly helpful in recommending restaurants (as in, they did not recommend anything in particular, just an area), but other than this, the hotel was good! The breakfast is a little bit pricey (9+ euros / person) so we opted out and ate at cafes not too far away.", "Date": "March 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Great place for a family”", "Author": "water_lili_88", "ReviewID": "UR56794759", "Content": "The family rooms (especially the corner ones) are generously sized. We stayed in one with a large king sized bed, a single bed and a double sofa bed. There were large wardrobe and bathroom facilities. It is right above the street leading to Puerto del Sol, it may be loud but it is possible to ignore the noise. Fabulous location. The taxi driver dropped us off at Puerto del Sol (a pedestrian only square) so we had to physically wheel our luggage across the square to the hotel. That was a little inconvenient but it only took 2 minutes. When we left the hotel, a taxi was able to pick up us from right outside the hotel. Within walking distance to Palacio Real, Plaza Mayor and Museo del Prado. No kettle or tea or coffee but a nice TV and laptop with free internet. Also free bikes can be organised for rent. There was an exercise bike and sound system in our room. Staff were nice and helpful.", "Date": "February 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "miami", "Title": "“Great Location!!”", "Author": "rebeccasosa", "ReviewID": "UR54048412", "Content": "Hotel Londres is right smack in the center of everything! Steps from the Metro and tons of shops, restaurants, bars, cafes. This hotel is right in the Puerto Del Sol area on a little street that feeds in this touristy area. You can walk virtually everywhere. This hotel is just a 5-8 minute walk to the Plaza Mayor. The Breakfast room is on the rooftop. We ate there once. We preferred to eat for a few less euros outside of the hotel. My husband and I stayed with our 2 children. The room had two single beds pushed together and two bunk beds. The hotel is nice. Not luxurious or a 4 star. But it was very clean, safe and comfortable. We had a small balcony that face the plaza downstairs. Not terribly big, but what you would expect for European standards.", "Date": "January 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "scotland", "Title": "“A Well located value for money comfortable hotel”", "Author": "citydetective", "ReviewID": "UR49421671", "Content": "Stayed here for three nights with 6 friends. The rooms were clean, comfortable with large bathrooms and all had air conditioning. The hotel is very centrally located and there is obvioulsy a great deal of street noise but iwth the windows closd and air con switched on we had no trouble sleeping. The hotels location is ideal for sightseeing and is right in the hub of things although you have to walk approximately 150 yards through the pedestrain precinct which is no hardship. The foyer of the hotel does not do the hotel justice and is a bit small however that aside the building has been modernised whilst still remaining many original features. All of our party liked this hotel.", "Date": "November 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "hertfordshire, England", "Title": "“Nice hotel, great location”", "Author": "hertsreview", "ReviewID": "UR43849606", "Content": "I would recommend this hotel, partitularly for it's great location. It's right near all the shops & walking distance to all the attractions. I went with 5 other girls age range 26-34 & we had a great time. We has 3 triple rooms, which contained 3 single beds. We didn't eat in the hotel, so I've no idea what the food was like. Had a laptop & free internet in our room. Not many TV channels, I think perhaps 1 english speaking & 1 music channel were the only ones I could understand. The hotel is a 3 star, but it seemed nearer to a 4 star to me, so I thought it was great value for money. The bathroom was nice & the room was clean. Only downsides were the room was a bit cold at times (I was still a bit chilly when I was covered with a sheet & a blanket) & the bed wasn't the most comfortable hotel bed I've slept on, but I would still stay there again. If you like clubbing, I would recommend Joy Madrid, which is walking distance & a great club. Every now & again, the music stopped & flamenco dancers came ourt & danced on the stage to flamenco music & when they finished their routines, it would go back to the club music again. The only down side is the prices 8 Euros for a beer & 11 Euros for spirit & mixer! It's 18 Euros to get in, which include 1 free drink. All clubs in Madrid are expensive, so if you want to drink, I would suggest having a drink in the bars first, then go to the club. Drinks in bars range between 2.50 Euros (beer & sangria) & 6 Euros (spirits & mixers).", "Date": "September 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Merimbula, Australia", "Title": "“Petit in name , petit in nature.”", "Author": "Gemfish", "ReviewID": "UR42882518", "Content": "The very central location of this hotel near the Sol metro station in the centre of Madrid makes it a good spot for exploring Madrid’s attractions including The Royal Palace, shops and restaurants. A couple of stops on the metro and you are at The Prado Museum. Despite being in the throng of the city, with the double glazed windows closed very little noise from outside came into the room. Even late night revellers could just be heard above the hum of the air-conditioning. A lap top computer with wireless internet connection is provided for use of the guests in each room. There was also a safe and a fridge with mini-bar but no tea or coffee making facilities. The negative of our stay here was the small size of the both the bedroom and bathroom. There was not a place two people could comfortably leave their cases without having to step over them to move around the room. A glimpse into one of the corner rooms on passing showed that some of their rooms are actually a decent size. You gets what you pays for I guess. There was also a very small shower cubicle with a multi-function shower contraption that occupied a third of the limited space. Finding the place could also prove difficult for some travellers with an inauspicious entrance in a side street. For its location and the quietness of the room however I will forgive the Petit Palace Londres for its very petit rooms and oddball shower and would stay here again. As a foot note please read my review of a very good modern tapas restaurant , The Taberna del Marciano near to the hotel which I would highly recommend.", "Date": "September 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "California", "Title": "“Good Hotel centrally located”", "Author": "Counting_by_5", "ReviewID": "UR38716014", "Content": "My wife and I stayed at the hotel for 2 nights, had room with balcony overlooking the action below. Large, clean, comfortable room, especially liked the in room laptop with free internet. Front desk people were very professional. Centrally located and close to everything. We thought the singing partygoers were hillarious down below on the streets, even if it was 6 am. We would stay here again.", "Date": "August 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "USA/Singapore", "Title": "“Great corner room!”", "Author": "gogyrl", "ReviewID": "UR36766685", "Content": "Perfect size and great view of the piazza from our 3 balconies! Reviews had stated the noise factor, so we expected it. Stayed over a weekend and heard some late night singing, etc. but overall enjoyed where we stayed...the feel of the area, large bathroom, large bedroom, free use of internet AND computer, great shower, and wonderful location! No restaurant but close to many choices -- no parking.", "Date": "August 5, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "london", "Title": "“Very disappointing experience given the reviews already logged.”", "Author": "frederickaFredericka", "ReviewID": "UR34542033", "Content": "Our double room was very small and bathroom not up to the standard we had been enjoying for far less money. Fridge broken, two lights not working, cabinet door hanging off and seemed like there was no interest in tackling this. To add to this, the corridor on the first floor and our room smelled less than fresh.", "Date": "July 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Dallas, TX", "Title": "“Nice Hotel in a Great Location”", "Author": "AAS", "ReviewID": "UR33086486", "Content": "We stayed at the Petit Palace Londres June 11 - 16. Over all it was a really nice stay. The room was large by European standards and the bathroom was completely modern. We were in room 209 and overlooked the side street which was not heavily trafficed so noise was not a problem. We had a balcony from the bedroom and a balcony off the bathroom. The laptop was great, made it super easy to check in at home via email. I was not able to get the wireless to work but I did not try very hard. We did not realize you had to insert your key into the door to get the power to work - a quick trip downstairs cleared that up and the AC was great - even got chilly one night and had to turn it up. The location was very central to walking to Madrid's historic sites and just 2 blocks from the subway for longer distances. Unfortunately Plaza del Sol is all torn up with construction for a new railway station. I think this would have been an even better location if the Plaza had been opened and there were more resturants and patios in the area. Every one we met at the front desk spoke very good English. I had to leave a day before my husband for a business trip and they arranged a cab for me the night before. The cab picked me up right outside the front door - I saw some reviews that said cabs could not drop them off out front but this was not the case. We took the subway in from the airport so not sure if the drop off is different - maybe if the driver does not know the area? A few negatives - the lock to the bathroom broke one evening and I got locked inside with out my clothes. Luckily my husband was able to toss me some clothes over the balcony before he ran downstairs for help - I was out in less than 5 minutes. There is a fancy shower system but we could not figure out how to use anything but the hand held - not that big of a deal we never asked about it. If we go back to Madrid we would definitely stay here again.", "Date": "June 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Bemused by some of the negative reviews - great hotel”", "Author": "libero7", "ReviewID": "UR31556416", "Content": "I must say I wasn't expecting much from the Petit Palace Londres given some of the reviews. 3 friends and I stayed in 2 twin rooms over a weekend and really just wanted somewhere reasonably priced and in a great location. Well the hotel certainly scored on those fronts but what really impressed me was the rooms. Considering it's a city centre hotel our twin rooms were very spacious and had nice little balconies overlooking the street. They were totally soundproofed, had a great bathroom with a nice shower, LCD TV and a laptop with free internet! I've been lucky enough to stay at some of the best hotels in the world and even many of them don't have a laptop in every room with free internet! One thing that was also important to us was air conditioning as it was baking when we were in Madrid in May. The air conditioning worked perfectly, was very strong, and meant our room was a beautifully cool refuge from the outside heat. I am totally bemused by those who claim that air conditioning isn't turned on until July - was our air conditioning on 22 May not real?! Overall an excellent, modern hotel in an amazing location. I was away with male friends but it was so good I might even stay here again with my wife!", "Date": "June 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Nice modern amenities in a building with lots of character”", "Author": "oliviajeff", "ReviewID": "UR29925576", "Content": "After our long trip from Australia we were very grateful that they allowed us to check in early (11am). The room was very clean, with a very spacious bathroom. ! Bathroom and furniture was quite new. We had 4 little balconies to enjoy the fresh air and a lovely view of spanish buildings. With the windows open it is very noisy as the hotel is located near a shopping precint. We enjoyed the music from the buskers and with the windows closed we could not hear any noise. We especially appreciated the use of a laptop and fast internet in the room. The location of the hotel is excellent, 200m from Puerta del Sol. The staff were very helpful and provided a separate beds for our girls as we requested in our booking. I would definitely stay here again.", "Date": "May 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Surrey", "Title": "“Nice Clean Hotel”", "Author": "TAWandRAC", "ReviewID": "UR26890770", "Content": "My husband and I have just returned from our stay at this hotel (21 Mar - 24 Mar) We were a little dissapointed as chose to pay extra for the advertised \"Romantic Dbl Room\" as the reason we were going was to celebrate our 1st wedding anniversary... To be honest there was nothing romantic about our room... not a flower, or even a chocolate on the pillow... we did get a dbl mattress though - which was not very comfortable... and breakfast was included in our rate The room (No. 307) however was very clean, decorated in nice neutral colours and had 3 balcony's (2 leading off the room and 1 off the bathroom) There was a laptop with internet which could be used free of charge! Two English TV channels - CNN and Euro Sport... Mini Bar which was pretty expensive though so we did not make use of it other than to keep our bottled water cold. The bathroom was a real treat - extremely spacious and had lots of natural light! No bath though... There was also an excercise bicycle in the bathroom. The location is great - if you can cope with the noise at night... on Saturday the night life carried on until about 6am in the morning and you get to hear it all. Sunday and Monday were better! It is an excellent base to explore from though... we literally walked everywhere [except for the plaza del toros when we caught the metro] Plenty of Restaurants, Bars & shops on your \"doorstep\"... Getting to the hotel was easy enough... we took the metro from the aiport and had to make 2 changes. Bear in mind that heavy bags might be tough to carry up the stairs. Breakfast (€12+tax) was decent with a choice of breads, pastry's, cold meats, cheeses, fresh fruit & Juices, yogurts, scrambled eggs, bacon etc. and was open from 7.30-10.30. We also found the hotel staff to be friendly and majority spoke some english. Despite our dissapointment for our own personal reasons we would however recommend this hotel... and definately recommend a trip to Madrid - What a lovely City!!", "Date": "March 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Bolton, United Kingdom", "Title": "“Fantastic Location!!”", "Author": "boltonlad", "ReviewID": "UR26460263", "Content": "Stayed at this hotel this month with friends and had a fantastic stay, the hotel is nice and in a good location. Particularly liked the laptop with free internet in the room very handy. The hotel is looked literally just off the main square close to were its all happening (plaza del sol). Only bad point i can think of is the plug in the shower not working very well other than that had a really good stay!!", "Date": "March 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“Bright, clean rooms, and good location”", "Author": "A TripAdvisor Member", "ReviewID": "UR25016070", "Content": "I booked this room based on other traveler's good reviews and was not disappointed. We were first given a very small, dark room in the back of the hotel and requested a new one from the front desk. The new room was bright, airy, and cheerful with two large windows. It was extremely clean and very modern. We did not eat the hotel's breakfast, as it seemed expensive at 8 euros per person. Breakfast is not included in the price. I would highly recommend this hotel to anyone who does not know Madrid that well.", "Date": "February 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "SingaporeTraveller", "Title": "“Good location. Good Breakfast. Clean Rooms.”", "Author": "TurkLoves2Travel", "ReviewID": "UR24550074", "Content": "I stayed here for 2 days at the end of January 2009. Location is good. Very good. Rooms are clean. Bathroom is new/clean. The breakfast has a good selection of fruits/cereal/eggs. And there is fresh orange juice too. Perfecto. However, the room gets warm as the aircondition doesnt work during winter (just hot air) so if you have to open the window, be prepared for the noise from the streets - lots of screaming and shouting from party goers and drunkards until 6.30am! I would definately stay here again, nevertheless.", "Date": "February 14, 2009"}, {"Ratings": {"Cleanliness": "3", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Southern California", "Title": "“Great Location and a nice room”", "Author": "LovesToTravelCA", "ReviewID": "UR22683290", "Content": "The location of this hotel is PERFECT. It is right by Puerta Del Sol, yet on a quiet street. When we first checked into the hotel (which we reserved from home), we were a little apprehensive. The lobby is pretty shabby, and the elevator is REALLY old. So, we did not know what to expect. We were pleasantly surprised when we got into the room! Although not very large it is very comfortable, with a nice bathroom. The biggest surprise was to find a laptop with free internet access IN the room! We enjoyed this hotel!", "Date": "December 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Unites States of Awesom!", "Title": "“Petit Palace Londres....worth it.”", "Author": "UncleGroovy", "ReviewID": "UR21548912", "Content": "Location - 8...Sure you can book hotels closer to the museums but in doing so you´ll miss the many wonderful shops along the way, which by the way is only several minutes walking. The immediate area has plenty of shops located on cobblestone streetways and after a day, you will find your way around easily. My room was small but clean and the front desk were easy to befriend as they were the only people I ran into that spoke English. This laptop that i am writing from is in the room and it is my only source of communication with the western world, thus proving to be an invaluable amenity. As far as the ´red light district´, who cares. Every city has one whether you know it or not and i didn´t see anything wierd or offensive. It is a pleasant area and at night, when i did most of my trapesing around, i felt perfectly safe. My advice to anyone is know where you´re going or at least fake it. Finding the hotel at night was easy as Puerta del Sol is an easy marking point to remember if you need to ask anyone direction´s should they not know where Galdo 2 is. If youŕe from the U.S.A. please remember that this country is as isolated from the english language as it is from the media. What you may find as small is really average in the eyes of traveling europeans. Even the InterContinental has small rooms in the eyes of the westerner, thus, unless you are booking a ´suite´, be happy with what you have and enjoy a roof over your head in one of the most beautiful CAPITALS in Europe. Enjoy your stay and represent your country well! ps. If youŕe stuck between a rock and a hard place.....go to the Hard Rock Cafe. English speaking staff, western menu, familiar enviornment. Peace.", "Date": "November 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brazil", "Title": "“Perfect for family”", "Author": "PortoAlegre", "ReviewID": "UR18687425", "Content": "Excellent place, big room, just in the hottest place of Madrid: Puerta del Sol. A brand new notebook on your room with free wi-fi access. Perfect choice.", "Date": "August 6, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Leicestershire", "Title": "“Disappointing”", "Author": "MumpsofClo", "ReviewID": "UR18212703", "Content": "When we arrived we were greeted with the builders doing major improvements within the hotel which we were not pre-warned about, we had numerous builders with a universal room key letting themselves into our room at all hours when they should have been going next door. We had to change rooms twice due to air-con not working properly, no hot water in the afternoons for a shower, safe's in the rooms didn't work and ours had to be completely disabled as the alarm was going off, restaurant staff saying we needed to pay for breakfast when we had already paid, extremely rude attitude from them as well, cigarette ends on the balcony from previous occupiers of the room, dead insects in the drawers,....need I go on. Do yourselves a favour and book another hotel. Ideal location for the city but so are plenty of other places to stay.", "Date": "July 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "dublin.ireland", "Title": "“in the center”", "Author": "mamodDublin_ireland", "ReviewID": "UR14220774", "Content": "madrid spain.petit palace londres.11th march 08. myself and 10 friends just arrived home from a wonderfull city break,we stayed at the petit palace londers,we had 3 rooms booked 3 in 2 rooms and 4 in 1 room.the only down fall was the room with 4 people was way to small,it says on the web site its a family room but to try and put a 50 year old woman on a top bunk bed is a bit scarey as there was no safe bars,you could easy roll off. the rooms in my opion should be for 3 people.we ended up putting the matrest on the floor.which left very little room to move around even if its a family a child would not be safe on the top bunkbed.other wise all was great the reception staff were lovely,Elina,and paula,thank you,you were a great help on our departure getting two shuttel buses for us.all in all we had a lovely time.", "Date": "March 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bedfordshire, England", "Title": "“Decent Enough, well worth the money”", "Author": "erictcow", "ReviewID": "UR13931228", "Content": "I onlys stayed in the hotel for 1 night with a couple of friends. 3 of us stayed in a room designed for 4 (2 x single beds, 1 x bunk bed) We were only there for one night to watch the football. The location was great, in the middle of city, with Plaza Mayor only a 5~10 minute walk away. Lots of nice tapas bars around. I would recommend this place for a short stay, maybe not for more than a week or so though", "Date": "February 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hertford", "Title": "“Great central location for family room for 4”", "Author": "family_hertford", "ReviewID": "UR13615635", "Content": "This is a good low cost (not cheap) hotel. We booked through bookings.com and requested a street facing room with balcony after reading reports on this site. The hotel is right in the centre of things but in a quieter side street just round the corner from the Sol metro and el corte ingles.( where there is a supermarket in the basement for ham cheese, bread and drinks for picnics) two singles and bunk beds made it perfect for the four of us. The room while not lavish was well furnished. We would have liked english tv channel but had taken the laptop and so could use their free wireless internet. Cost about 600 euros for three nights which for 4 of us in central Madrid I didn't think too bad. Buffet breakfast was excellent- fresh fruit, cereals, breads, croissants and a hot plate with eggs and spanish omelette and streaky bacon. There is a starbucks just round the corner if you prefer to take your chances. We got breakfast for for 25 euros so didn't think that it was too bad. You can easily take the metro from the airport although there ar a few changes. It really isn't far up the side street so don't be put off by people moaning about walking the last 100m. The hotels I saw on the main drag must have been very noisy. Up to about 11.30 the stree below is busy at weekend with people out shopping and walking but during the night its fairlyquiet. We did have the windows shut. Go to the Zoo f you have children and they also liked the templo de debod. There is an Irish pub just off the Plaza Major where you can watch uk football matches that allows kids in. I'd like to go back to Madrid without the kids or when they are a bit older and do the museums.", "Date": "February 17, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Oslo", "Title": "“This is NOT worth the money”", "Author": "AHL", "ReviewID": "UR7569440", "Content": "Please chose another hotel! Madrid deserves so much better that this place! It is located smack in the middle of Madrid, but not in the best location.. the red light district is just around the corner, so during the night time it's not the best place to walk. It says somewhere that the beds are \"supercomfortable\"..??! I belive that if you enjoy sleeping on wood...they were so hard I woke up in the middle of the night and my body was hurting! And the high-tech theme, there was absolutely no hight tech feel to this hotel, it's old and dirty! SO PLEASE find another hotel! You will be so much happier for that!", "Date": "May 9, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Vancouver", "Title": "“a Petit Palace it was not”", "Author": "gsjrs", "ReviewID": "UR6569796", "Content": "The only good thing to say about this hotel is the location. It was very central, however it is also in an incredibly busy location, which was slightly stressful when we first arrived. The girl at the front desk nearly strained a muscle trying to be friendly, and by my definition she didn't succeed. We had a lot of simple questions about Madrid and she wasn't particularly forthcoming with information. We were also shocked at the size of the rooms... the only thing petit about this hotel. We couldn't wait to leave and move on to our next destination. I wouldn't recommend this hotel to a friend.", "Date": "January 9, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Atlanta, GA", "Title": "“Perfect Location!”", "Author": "Duda123", "ReviewID": "UR6496059", "Content": "Thanks to the folks at EnGrande who were wonderful and very helpful when making the right recommendation. The Hotel Petit Palace was exactly what we were looking for. The location was unbeatable. Walking distance to most attractions, nightlife and great restaurants. The front desk was very friendly and helpful. I strongly recommend the Hotel and EnGrande.", "Date": "December 25, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Krakow", "Title": "“not a bad place Except for toilet sewer Smell”", "Author": "Zypcio", "ReviewID": "UR6230949", "Content": "Located in a major tourist walking area, it is nonetheless a quiet street w/ a \"small town\" feel. Petit Palace Londres is actually a nice place to stay at except for the MAJOR problem in our room, which was the smell of the toilet sewer. Location is superb, off near the heavy ped zone of stores, cafes & shops, you see people everywhere. Safe area. Metro nearby, grocery = \"El Corte Ingles\" Staff is often annoyed, tired or just plain in some other world, at least they weren't snobs or they don't bug you when you walk in. Rooms are very nice & dark, window faced street, had a small balcony which was a nice touch. The \"low lights\" of halls had me concerned, as there were dark areas that didn't look inviting but sensors turn on when you near your room. Top floor internet computers also in \"dark zone\" w/ minimal lighting. Room maids threw away some of my things w/out asking (my bags for creams, toiletries, etc & also my \"old\" newspapers). I mention the problem of the disgusting smell of the toilet sewer in our bathroom, after the 3rd day it started up & was in the room until we checked out. I had a cold & I am not fussy so I didn't complain (what could they do?) or didn't let it bug me but it was pretty awful at times. Other than this it is a nice location, & great place to stay at, but it isn't worth some of the prices I have heard. Hopefully they'll fix the toilet sewer smell. Other than that, not a bad place to live in for a couple of weeks.", "Date": "November 28, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "liverpool", "Title": "“wat a surprise”", "Author": "A7S", "ReviewID": "UR5967272", "Content": "booked few days for my sons 15 birthday as a surprise. my family enjoyed everything it had to offer us. hotel room was great to accom for teenager children. we sat on balcony till late watchin madrid come to life. pot of 12 places to see we done 10 of them by foot and taxi. we shopped, ate and drank for four days. EXCELLENT...... one bad thing was with aerocity buses, waited 30 mins at airport to find driver. after numerous phonecalls we were found. on depture our confirmation was 12 noon pick up instead of 14.oo hours. after numerous phone calls again we thought it was sorted. to our horror on return to hotel for meet at 13.30 to leave at 14.00 reception told us bus came at 12.30 to take us to airport. reception made phone calls and bus came at 13.50 complete with 2 car seats for my teenagers and receipt for 40 euros. it was sorted at airport. total lack of comunication and disorganisation nxt time we get a taxi...", "Date": "October 18, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Unknown", "Title": "“Economical”", "Author": "A TripAdvisor Member", "ReviewID": "UR5456228", "Content": "Two stays during our trip -- 8-10 June and 17-20 June 2006. We reserved the \"family room\" for both stays. There was a double bed in one and two twins together in the second and were comfortable. Both rooms had bunk beds. The first room was quite small - not much walking room and luggage for four was cramped. The bathroom was large and exactly what the photos indicated on hotels.com. The view from this second floor room was of a wall BUT it was so incredibly quiet. A/C worked fine -- it was 97 degrees in Madrid when we arrived. When we checked out from this stay, we requested a room with a \"view\" for the following stay. Our second stay was in a much larger family room on the fourth floor -- very comfortable. The bathroom was smaller in this one, but still updated and clean. We had a balcony with a view of the street but were still able to sleep well despite the foot traffic into the AM hours. The beds were like any other 3-star hotel and they had plenty of extra pillows and blankets in the closet. Our daughters slept well on the bunk beds in both rooms. The hotel staff was always helpful - including the very courteous maids. Every front desk clerk we encountered was friendly and assisted us - despite their level of English. There are two computers with internet access on the 5th floor that are available to use 24 hours a day and for no fee. The breakfast is 11 euros per person, I believe. The rooms we stayed in had stocked mini-refrigerators but we used them for our own items. The bar/sitting area on the 5th floor had a small selection of Spanish and English books to exchange. On our trip from the airport, our driver had difficulty finding the hotel. You may want to have the hotel direct line on hand. We were dropped and picked up directly in front of our hotel, as many guests were. There is also a parking garage one block away. This is an economical hotel for a family of four or less and if you want to be in one room. The location is great and it's very clean. We were very pleased with our stays.", "Date": "July 11, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Sarasota, FL", "Title": "“Suited Our Needs”", "Author": "acarano", "ReviewID": "UR5354603", "Content": "Thanks to all the TripAdvisor reviews this hotel was pretty much what we expected. We had reserved a standard double room online and were given a room with a double bed and a balcony overlooking one of the main pedestrian walkways, which was nice since we like to see what's going on. The room was not one of the smallest you might read about in other reviews. There was enough space to walk around and the Internet access was great (you pay a deposit for the cord), but we did have a little trouble finding enough space for our clothes, etc. The bathroom was small, but nice and the room was clean and nicely decorated. The bed was firmer than we're used to, but we slept well and comfortably. One night we woke up very hot and realized the A/C wasn't working. I went down to the front desk to let them know. No one came right away, but it started working again around 10am (even though no one had come to work on it). Much later in the day when we returned they said it had been fixed and we didn't have a problem again. Several have mentioned that the front desk staff do not speak much English. In our case we found that one did not, but two others did. One important piece of information about getting to the hotel. It is in a pedestrian only area and another review says that taxis can drive in, but as hard as I tried, ours wouldn't. He took us to Puerto del Sol to the end of Calle de Preciados, then he showed us on a map that Calle de Galdo (the street of the hotel) was the second street up on the right. He was right. It was extremely close and not a problem if you know where you're going. We were never completely sure that taxis were allowed to drive in either. We saw many people walking in with luggage to other hotels and then the day we were leaving a taxi driver appeared to be getting a ticket for something right outside the hotel.", "Date": "June 16, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Unknown", "Title": "“Great location; watch your room assignment”", "Author": "A TripAdvisor Member", "ReviewID": "UR5184974", "Content": "Great location, clean rooms. When my wife and I checked in, the two other guests in line at the front desk BOTH complained that their rooms were not what they reserved. Sure enough, when we got to our room, it was a smaller room than we reserved. We convinced the staff of the error (thanks only to the printed Expedia confirmation), and they asked that we spend one night in the smaller room and to leave our luggage packed the following morning. The next morning, staff dutifully moved our luggage for us while we were out. The bigger room was an exterior room with an excellent view down Calle de Preciados towards Puerta de Sol. Otherwise, the hotel was in a great location and was clean and comfortable. The bathrooms are smaller and the beds are harder than most from “new world” are used to, but the rooms are quite hospitable. The staff was polite and helpful. I would likely stay in this hotel again on my next vacation to Madrid.", "Date": "May 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“good location”", "Author": "A TripAdvisor Member", "ReviewID": "UR4826000", "Content": "We stayed here 3/27-31/2006. Great location, 1 minute from Placa del Sol & metro stop...had to sleep w/windows open due to no a/c in March (although weather was upper 60's); not on a street w/cars but still very noisy. Nice bathroom upgrades but small. Would recommend for budget traveler, our room slept 4 (2 beds folded down from the wall like bunks) & was only 95 Euros per night! Location & cost outweighed noise in the wee hours. Free internet access...we didn't do breakfast here as it was over $10 per person. Major chain store (El Corte Ingles) was directly across from hotel and has a supermarket where we bought donuts and juice and kept it in the minifridge. We also bought bread and lunchmeat for picnics. WE fed 5 people (including 2 grown men & 1 teenage boy) for about $15 total each day for breakfast and lunch COMBINED. Eating at Burger King/McDonald's, etc was about 25-30 euros for 5 people PER meal. We did not find Spanish natives to be overly friendly and helpful, however, hotel was clean and maids were helpful.", "Date": "April 1, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "London, UK", "Title": "“What a room! High tech room!”", "Author": "TATIENNE", "ReviewID": "UR4389766", "Content": "This little hotel is a GREAT place to stay, is located in the CENTER of Madrid, IT IS FANTASTIC just a block from Puerta del Sol, walking distance from shopping areas, underground, cinemas, restaurants etc. It is simply great, well I must say we stayed in one of the HIGH TECH ROOMS, it wasn't expensive at all, just make sure you get the best deal, but really you have to stay in one of the high T rooms, they are hugeee, the bed is enormous, free internet connection etc. I recommend this hotel BIG TIMEEEE!!! Breakfast is not included in the price but not a problem being so close to everything.", "Date": "January 26, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Boise, Idaho", "Title": "“Good room”", "Author": "CindyGross", "ReviewID": "UR4355552", "Content": "I stayed in a room with one double bed, it was small but very functional. There was just enough room to walk between the bed and the wardrobe and desk. If you pulled out the desk chair far enough to sit it would hit the bed. The bathroom was at least as big as any other hotel I've stayed in and was quite nice. I stayed four nights and never encountered any front desk staff who spoke any english. The free in-room internet access was great, I was able to find a translation site and write notes to the staff. The breakfast buffet was good with scrambled eggs, various meats, and fruit (some fresh, some canned) each morning. I did have some problems with things breaking. The shower broke twice and the back came off my desk chair. They didn't fix it the first day but after I typed up a note they did fix it. My room did not have a balcony. The windows did open, but onto an internal courtyard that was very dark and had nothing but concrete and construction materials at the bottom. With the windows shut no light at all came into the room, it was impossible to tell if it was day or night unless you opened a window. The only english speaking channel on the TV was CNN.", "Date": "January 16, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“Nice hotel with a great location”", "Author": "A TripAdvisor Member", "ReviewID": "UR3797329", "Content": "We stayed in the Petit Palace Londres two times during our three weeks in Spain. The first stay was for three days and the second for one night. The hotel is very nice in a great location for shopping and access to transportation. Being just off the Puerta del Sol we were able to catch the bus or grab a taxi quickly. The front desk staff were very helpful and pleasant to work with. My only complaint is that they were not able to get us our rooms quickly after we arrived. The first time it took nearly two hours to get our room even though the guy told us 30 minutes (we waited in the lobby). The second time was about one hour. Both times we arrived well after normal check-in time. Although the lobby is very smokey the rooms we had were very nice and not smokey at all. Not real large for a triple room (double with an extra bed) but still managable. Our first room had enough space for the third bed to be set apart from the other two but the second room was much smaller with all three beds pushed together. Smaller bathroom in the first room with a bathroom nearly the size of the bedroom in the second. Still both were fine. The balconies in the rooms were very nice with a view of the street below (shopping area, pedestrian only). It was a bit noisy until approx. midnight which was a bit frustrating but still not enough to keep you awake. The rooms were very clean and the marble bathrooms made the room look much more expensive than what it was. One word of advice if you are having a taxi deliver you to the hotel... although it is located on a 'pedestrian only' street, taxis are able to drive in and drop you at the door of the hotel. Our first taxi driver did this but the second would not since it was pedestrian only. Just tell them they are able to drive in and drop you at the door. Also, if they are not able to find it just go to the Puerta del Sol and it is just behind the bus stop and beside El Corte Ingles. The breakfast buffet was included and was nicely stocked with traditional breakfast foods, fruits and plenty of bread. A very nice beginning to the morning. There was also free internet access in the 5th floor lounge which was a plus as my daughter was feeling very homesick. Overall a nice place to stay for the money. I would definitely stay there again.", "Date": "August 22, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Front desk staff were efficient and helpful to us.”", "Author": "Gerry70_11", "ReviewID": "UR3354945", "Content": "I felt that the front desk staff were helpful and efficient but not warm and fuzzy. We needed to leave bags as we were taking a train to Seville for a few days and they were accomodating about this. Also, they made arrangements for tours with no problems. The free Internet accessibilty in the hotel was very nice; after all, this is an inexpensive hotel by European standards. Room was small but we had two adults and two teenagers and so we had the normal twin beds pushed together and then a bunk bed--not the best thing but it worked for us. My main objection was that they air conditioning wasn't on because it would be later in April before they could turn it on! Also, doors slamming during the night interrupted my sleep several times during the stay. Location is super as stated in other reviews.", "Date": "April 13, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Unknown", "Title": "“great little hotel, bad front desk staff”", "Author": "A TripAdvisor Member", "ReviewID": "UR3172962", "Content": "OUr original reservation was for a single room but when my husban saw that the door hit the bed when you opened it and that he couldn't even fit in the shower, we requested a suite... not much more expensive but an amasing difference, the room came with FREE internet access, much larger room and bathroom with jacuzzi and more natural light. I loved the contemporary look of the hotel. The negative part was that the front desk hardly spoke English, something that the employees in tourism are expected in Spain and that they were not service oriented at all, even rude at times. Our 1st night there, when we tried to use the jacuzzi, it didn't work. I called the front desk, and told them about it. They said that they would send somebody in the morning to fix it. Next night, we tried the same... the button didn't work. I called again and the \"gentelman\" at the front desk almost yelled at me and said that they did send somebody and \"Maybe I didn't know how to use it\" (How rude!) My husband opened the button and re-wired it and the jacuzzi worked... They never sent somebody to fix it. Apart from the rude staff (which I have been finding very cummon in Spian latelly) the hotel was great... I loved the lounge area on the top floor!", "Date": "February 8, 2005"}], "HotelInfo": {"Name": "Petit Palace Londres", "HotelURL": "/ShowUserReviews-g187514-d228615-Reviews-Petit_Palace_Londres-Madrid.html", "Price": "$98 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Galdo 2</span>, <span class=\"locality\"><span property=\"v:postal-code\">28013</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "228615", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/6f/f7/a4/exterior-view.jpg"}}