{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent Hotel - cannot recommend enough”", "Author": "Sarah K", "ReviewID": "UR128035076", "Content": "A friend and I stayed there for a long weekend in April 2012 and I cannot recommend the hotel enough. The staff were fantastic, the rooms had all the amenities necessary and were very clean and even though we had a room which overlooked the road, there was minimal noise because the hotel is not on a busy street. Its about 5 blocks to Las Ramblas and a 5 min walk from Casa Batlló.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Nice hotel but website misleading & rooms very hot!!”", "Author": "Rebecca173", "ReviewID": "UR127870618", "Content": "Hotel Balmes is a nice, clean, modern and comfortable hotel. It is situated in a nice area of Barcelona and away from the crowds. It was about 10-15 walk to la ramblas which we loved as it was quieter and the food and drink was a lot more reasonably priced. The only downside is there isn't a metro station right next to the hotel - it is about a 5-10 min walk away. The breakfast is expensive - there are some lovely little cafes very near to the hotel which are a lot cheaper and easy to find. The website is misleading. We booked a standard room, expecting a room like the photos & as per the description on the booking form. The room was a bit shabby, extremely small and had no view (a wall with a tiny bit of a tree). I complained, and the receptionist got very rude and angry towards me which I found very upsetting. After this, he decided to give us an upgrade to a room with a sofa, table & chairs and a view of the garden. This room was lovely, and as described in the website. The only downside was how hot the room was! The aircon wasn't switched on which may be due to the time of year, but we needed it as the room was stuffy and very hot. If we turned it on it blew out warm air! Overall, the hotel was nice, but I wouldn't book a standard room as it is not how described or worth the amount they ask. The rest of the staff were very polite so I may have just caught one on a bad day!!", "Date": "April 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brighton", "Title": "“good location”", "Author": "Tony S Posted by an Easytobook.com traveler", "ReviewID": "UR127346563", "Content": "I have stay here many times ,the staff aways very friendly and helpful .the hotel is in a good area to visit most sites of the city plus havinfg a pool is great to relax by after a day sight seeing .", "Date": "April 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Tramore Ireland", "Title": "“Good Value Hotel”", "Author": "AnnerTramoreIreland", "ReviewID": "UR126461517", "Content": "Myself and my husband stayed here for three nights on 4th March. Having read a very good review about the hotel we chose it for its closeness to the centre. It worked out very reasonable in price and we upgraded to a Garden room which I think was the best room 220. The room we found a little small but the terrace was a nice outside space. We did not avail of the breakfast as I would consider it a little expensive as you can get a nice light breakfast down the street for a few euro. It was a 10 minute walk to La Rambla and the centre so we had to get taxi`s a bit.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Stockholm", "Title": "“Good location and good value for money”", "Author": "frankofan", "ReviewID": "UR126262016", "Content": "Good location, clean, not too noisy and staff is very accomodating. If you go for the offer of buying breakfast for several days, it's a bargain.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Frederiksberg, Denmark", "Title": "“4 words”", "Author": "Mathilde2000", "ReviewID": "UR125799586", "Content": "Just dont do it! Bad service - terrible rooms. Were there for business and we shuffeled around to find a clean room. We didnt have any success but just agreed on the last one. Cant wait to leave!", "Date": "March 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cairo, Egypt", "Title": "“Awesome Hotel for a great time in Barcelona”", "Author": "NomadLovelorn", "ReviewID": "UR125750987", "Content": "The room was outstanding for my friend and I, enough space for luggage and ability to move, I especially loved the shower :), the beds were comfy but the walls were a bit thin we could hear everything happening outside the room. Breakfast seemed ok but not worthy of 14 euros! There was a lovely terrace with a jacuzzi and swimming pool. The hotel staff were so friendly and helpful with any query we had. The hotel was very close to all the important attractions (Ramblas, Passeig de Gracia, and 2 or 3 metro stations to Camp Nou to which we had to go to watch FC Barcelona game :D) The metro station itself was 8 minute walk (in Passeig de Gracia), and went on foot to Sagrada Familia which was down the avenue (Mallorca). All in all, I would definitely recommend this hotel to anyone going to Barcelona, and I, for myself, wouldn't mind staying there again", "Date": "March 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Malmo, Sweden", "Title": "“Hit and miss in Barcelona”", "Author": "mrmarklar", "ReviewID": "UR125512240", "Content": "Spent three nights in February at Balmes. My room was very small but enough for one person. The cleaner probably had a bad day with some of the previous guests stuff still left behind, empty toiletry, a used towel and an opened bottle of water. Not a big deal but a dent in the impression of this place. The breakfast is in the basement and is far from impressive but ok. The hotel is placed 10 minutes walk from the nearest Metro and a few minutes from La Rambla. I know from friends that also stayed at this hotel that there are doubles at this hotel that are good but also some single rooms worse than what I had.", "Date": "March 2, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "NI", "Title": "“Central location and helpful staff”", "Author": "AMD3523", "ReviewID": "UR125421308", "Content": "Hotel Balmes is located in the Eixample area of Barcelona. I got a taxi from the airport because I was travelling alone and not familiar with the area. It was very convenient for many of the attractions and about 10 min walk to La Ramblas. There was a taxi rank just on the corner but as the hotel was so conveniently located taxis were not required. Room clean and comfortable with TV etc and a small bureau. I needed to make sure the bathroom door was closed because, if shower was being used, bath emptied or toilet flushing, in the room directly above it was a bit noisy. The ceiling in the bathroom seemed to be made of a tin like material. If the door was kept closed it was less of a problem. I had some issues setting up wifi and the reception staff were very helpful in helping me sort it out. Breakfast was fine but not anything out of the ordinary. If you don't have breakfast included I would probably try somewhere else. There are lots of options in the surrounding streets. Would I stay here again? Possibly but I would check out other options as well.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Doncaster", "Title": "“A weekend break”", "Author": "mark2183", "ReviewID": "UR124856075", "Content": "A twin room for 2lads on a football weekend away. Located close enough to La Rambla and other local attraction. The rooms were very clean and serviced break the staff were helpful too and free wi-fi £163 for 3 nights I don't think you can go far wrong", "Date": "February 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Ephrata, Pennsylvania", "Title": "“Close to everything, but...”", "Author": "Peter H", "ReviewID": "UR124364638", "Content": "Check in was a breeze even though I arrived before noon. I had booked a single room. And that's what I got. No question it's the smallest hotel room I've ever been in. That said, it was, contrary to several reviews I had read, clean and order free. The furnishings all appeared to be relatively new, including a flat screen TV. There was a limited number of channels with only one or two in English and they were sports. Located within a 15-20 minute easy walk to the center of town, the location was fine. It's also only a block from the Metro, which turned out to be a great way to get around. And if a cab is required, you had about a 10 second wait. The only downside I encountered was the location of the room. I was facing the street which was at times rather loud. Would I stay there again? Yes. But I'd request a courtyard facing room and book for two people in hopes of getting a larger room.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“A great place to relax after a hectic day's sightseeing!”", "Author": "Dannyk86", "ReviewID": "UR124059650", "Content": "Spent 2 nights here whilst sightseeing in Barcelona. The weather was incredibly hot, so we were thankful for the superb air conditioning! The room was very nicely decorated and comfortable, if slightly small. The location wasn't too bad - around a 5-10min walk to the nearest Metro station and a 25 min walk to the top of Las Ramblas. Probably one of the main highlights of the hotel was its secluded garden area, complete with pool and jaccuzzi - perfect to unwind in after a long day walking around the streets!", "Date": "February 3, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Great location, some down sides”", "Author": "joy r", "ReviewID": "UR123698165", "Content": "We stayed here for 4 nights from Thursday to Sunday night in mid January. Pros: -Great location in between two metros with good restaurants around it. -Friendly staff, including the housekeepers who always knocked, were courteous, and helped us out when we asked -Not a large room, but a comfortable size, especially for the price. Great value -Staff offered to change rooms for us since we were near the lobby, and suggested another room which could be quieter. Really appreciated this since we didn't even ask. Cons: -We changed rooms 3 times (1st time was not the hotel's mistake). The 2nd room smelled like a sewer and we asked to change rooms. -The water in our last room took a very long time to turn hot. We always had to wait at least a few minutes. It didn't cause any problems after it did turn warm, but it took a while to get there. Overall, would recommend with some precautions. But great value for its price and no complaints there.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Jackson, Mississippi, United States", "Title": "“Great location... Average Hotel”", "Author": "Allen T", "ReviewID": "UR123627891", "Content": "This hotel was average at best. We stayed here in May for 3 nights. The hotel has older rooms, but we were not in the hotel much at all. Very close to all the shopping districts and about a 6 minute walk to the subway. Hotel staff was average as was the hotel. I would recomend this hotel only on location and and price.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Warrington", "Title": "“City Break”", "Author": "Scotsman2110", "ReviewID": "UR123240316", "Content": "We stayed at the Balmes Hotel for 4 days in January. Great location, less than 10 mins from main street and Metro. Only two stops on tram to Las Ramblas. Hotel very comfortable, adequate continental breakfast. Reception staff very helpful. Given a complimentary bottle of wine on New Years Day, a nice gesture. Would certainly return and recommend to friends.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“It's ok considering to be in city of barcelona”", "Author": "bubblyfenn", "ReviewID": "UR123025119", "Content": "the hotel in actual fact is pretty run down with the wooden flooring slightly pop up, ceiling shipped, haridryer cant use at all as it is all smelly, dressing table and tv with glasses super dusty with layers of dust. the only thing i like about this room is the balcony. there is a bellman who is super friendly and helpful. the rest of the front desk staff are not very friendly, at times i can even felt the arrogance in them. if you are a light sleeper, better find a new building hotel as this place is in one of the olden buildings where there is no sound proof for the wall and glass. hotels in barcelona is pretty expensive. if you are on a budget and looking for an acceptable place in city to stay, you can try this but do not expect this to be luxury. if you are fine with the noise from the road, asked for the balcony room :)", "Date": "January 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“Nice central hotel”", "Author": "snownoo", "ReviewID": "UR122989003", "Content": "Stayed here for a 3 night city break - it was in the mid ranger to cheaper end of the price spectrum and that is what Balmes is. Great location in the Eixample area of Barcelona, surrounded by nice restaurants. It is two blocks to the Rambla de Catalunya or three to the Passeig de Gracia both of which are main shopping streets which will take you down to Place de Catalunya and La Rambla. It is a 10 minute brisk walk or 20 minute gentle stroll to the main tourist area. It is well worth exploring some of the smaller roads around the hotel if you are looking for restaurants or cafes. The hotel itself is generally good - we had a courtyard room on the second floor which was ok, nice courtyard and bathroom. The hotel is generally very tranquil and you wouldn't know that you were staying in a city. Unfortunately the internal sound proofing isn't so great and loud guests talking into the wee hours wasn't appreciated! There is one computer in the lobby area with free intenet access which was useful. Generally a nice hotel and brilliantly positioned for exploring Barcelona.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Ljubljana, Slovenia", "Title": "“Could be better”", "Author": "chunle", "ReviewID": "UR122712559", "Content": "When you make a reservation for 4 adults, you would expect them to sleep in separate rooms - but not in this hotel! Since my husband and I didn't want to sleep in the same room with children (cause we can't sleep at 9 pm), second day we changed the room, which was ok (we \"only\" had to pay for extra room) and we were lucky that hotel was not full. In the first suite it was impossible to sit on the bench in the kitchen, and you can' t really cook in their kitchens, since on the counter there is not even a place for a plate. I'm an interior designer and I would say that hotel is nice, but not quite functionaliy equipped. I suppose there is a metro under the hotel which is the reason for terrible noise and shaking - people with a sleeping problem should avoid this hotel. Our second suite was really smelly - in the bathroom was the smell like in an uncleaned cat-toilet, so if you left the bathroom door open, the whole suite smelled. The staff wasn't kind at all, especially the guy in the breakfast room. When I look back, I don't think I saw a smile on any staff member. On booking.com is written that the WI-FI is in the entire hotel and is free of charge, which isn't really true. You get an hour of very slow internet connection per room a day, the rest you should pay. Only free internet is in the hotel lobby. Since we didn't agree with their internet policy, they gave us few hours for free. Hotel parking is quite expensive - and there isn't really any need for a car on this location and Barcelona public transport is very well organized. Breakfasts were really good. We also thought that this hotel had a restaurant (because is written so) but the guy on the reception said, there isn't any. In general: for the money we paid, we could get much better and kinder accommodation. With just a bit more effort, this hotel would be much better and then it would be worth staying there.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta", "Title": "“Fine location and accommodations”", "Author": "IntrepidAtlanta", "ReviewID": "UR120758548", "Content": "The Hotel Balmes is a very good choice for visitors to Barcelona. It is well located in the Eixample district, quite close to shopping areas (Passeig de Gràcia) and many of the best known tourist attractions, but free of the crowds and noise that travelers encounter when they stay at properties near the Ramblas in the heart of the old city. The modern lobby makes a good first impression and, like other Derby properties, emphasizes art: there is a display of African artifacts downstairs and guest rooms had framed prints, presumably by contemporary artists. Breakfast was served in a large, comfortable space and hotel staff made sure to replenish the buffet as needed. My standard room was on the small size, which is entirely characteristic of all the various Barcelona hotels I've stayed at. That said, the space was certainly adequate. Since I had work to do in the evenings, I appreciated the ample desk and very good desk lamp. Hotel lighting is often inadequate so the Balmes is to be commended for excellent illumination. I could read, write and edit in comfort. Furniture in the room was beginning to show its age (scuffs and dents) but the bedroom and bathroom were immaculately clean. Toiletries were provided (shampoo, lotion, bath gel) and a chocolate was placed on the night table each evening. There was a full size shower/bathtub with a rain shower head. The bed was perfectly comfortable and I was pleased to see that the air conditioning system was still running in early November, when the city ran into a spell of unusually warm, humid weather. Apparently the hotel has a pool and garden area but I never found time to check out this feature of the property. One odd feature: both rooms I occupied had a floor-to-ceiling column (in one instance, very inconveniently located right next to the door). I assume this must be a structural feature of the building. Satellite TV offers stations in Castilian, Catalan, English, German, Italian and French. Front desk staff were very helpful. The first room I was assigned was on the first floor, overlooking the lobby area and elevator. When the noise proved problematic, it was no problem for them to switch me to a room on a higher floor, far from the elevator. I spent the rest of my stay in blissful quiet. There is a single computer located near the lobby that is available for use by guests. If there is one recommendation I would make, it would be to add an additional computer to avoid long waits like I experienced. If you have considerable business to transact or need regular e-mail access you may wish to bring your laptop (the hotel has wi-fi). That's a better alternative than doing your e-mail at 1:30 AM--which I ended up doing--when no one else is around. The breakfast buffet was more than adequate: pastries, breads, cheeses, several varieties of fresh fruit, tortilla, juices. As is so often the case, coffee was dispensed from a machine. The added charge for breakfast is not inexpensive; however, if you can find a deal that includes it as part of your room rate it's a good option and certainly very convenient, especially if you're in Barcelona for business. A nice plus: a variety of newspapers are available at breakfast. In sum, this is very comfortable 3-star hotel with good amenities, a central location, and efficient staff. Definitely recommended.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kirkwall, Scotland, United Kingdom", "Title": "“Balmes - great value hotel.”", "Author": "Rachel C", "ReviewID": "UR119782590", "Content": "My husband and I have just returned from a week long holiday in Barcelona. We stayed at Balmes and it was briliant, we were in room 202 which had a large terrace, we sat out in the mornings for breakfast as there is a 24 hour supermarket just a few doors down. The supermarket has a good selection of wines, salami, ham, bread and cheese etc at very reasonable prices. We had lovely cava sitting out on the terrace each evening also bought from the supermarket! The room was lovely, the staff were excellent especially the lovely lady who cleaned our room - she was so friendly and very good. I would recommend this hotel as it was a great central location and was very good value for money. I cant wait to head back out to barcelona!", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aberdeen", "Title": "“Great central base”", "Author": "Macscotty", "ReviewID": "UR119628800", "Content": "This is a really friendly efficient hotel with the bonus of a nice pool area and no traffic noise. Its in the centre of the city so within easy walking distance of the main Gaudi sites and the old town. We could'nt have picked a better base for our 4 day city break. If you get to the Gaudi sites at their opening times the crowds are slight. Book the Sagrada in advance and always take the audio equipment at all sites. Leave a day for Montserrat ....brilliant.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Art Hotel”", "Author": "glamontheroad", "ReviewID": "UR119335224", "Content": "The lobby is magnificent, which you can see from the photos, provided by the hotel/ There is back yard with the pool and the bar. The rooms are very small but have lots of very creative design about them. The bathroom is full marble, very stylish. The noise at night can be an issue, if your neighbors are having parties in their room. But overall - it is good honest place , centrally located, which was pleasant to come back every night after the day on the town. The internet WIFI works only in the lobby and on the 1st floor. There is a computer downstairs. The art in the lobby is very high class.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newcastle upon Tyne", "Title": "“BARCELONA HOTEL.”", "Author": "Blagdon28", "ReviewID": "UR119169384", "Content": "First Class Hotel, modern clean and comfortable. Brilliant location, staff could not have been more helpful, go for a room with a terrace if possible. Cannot understand complaints of thin walls, our room was perfect, we stayed in executive room well worth the extra. Highly recommend this hotel.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location, helpful staff, great value buffet breakfast”", "Author": "John W", "ReviewID": "UR118753217", "Content": "Stayed for 4 nights. Location is a short stroll to Las Ramblas and close to metro. Great buffet breakfast for EUR 7. I would recommend for a short stay in Bacelona. Staff were very helpful and knowledgable. Only complaint was the elevator was very small. Not good if you are claustrophobic.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Balmes Hotel”", "Author": "SearchingTraveler", "ReviewID": "UR118676292", "Content": "Excellent, professional service. The staff was very gracious in addressing all of our needs and were a great help in answering questions and offering advice. A lovely hotel, very clean and well run. It is in a great location, the metro is only one block away in Provenca Station and a five minute ride to Plaza Catalunya and Las Ramblas. The hotel is in a safe, lovely neighborhood with many wonderful Tapas eateries and restaurants. The room was maintained daily and was quiet and a good place to rest after a day of sight seeing. Nice garden area with pool in the back of the hotel. The Senior Manager, Pepe Campos was very gracious, kind and even assisted us with attaining a taxi to the train station on our last day in Barcelona. I wil absolutely stay at this hotel again when I return to BCN.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Island of Malta, Malta", "Title": "“Good hotel and helpful staff”", "Author": "Idanwcd", "ReviewID": "UR118458490", "Content": "I enjoyed very much my stay in this hotel. I stayed in an executive room which was large and clean. The furniture and bathroom were very nice too. The reception was very helpful and assisted us to all our needs. The price was also a good one. The location was very central but the closest metro is about 10 minutes walk which is not that bad either.", "Date": "September 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Taunton", "Title": "“Great location. Average hotel. Noisy plumbing.”", "Author": "DaveSTaunton", "ReviewID": "UR118407620", "Content": "On first impressions, the Balmes is a little off the beaten track but it turned out to be a great location for a week in Barcelona. Main transport routes are nearby but the hotel's away from the main roads through the city, which was ideal for us. There are some great tapas bars and cafes within a short stroll, too. Our first impressions of the hotel itself were pretty good. The staff weren't especially friendly, which was a shame, but the reception area is nicely designed, with modern decor and ethnic art on display. When we got to our room (116), we were disappointed by how dark it was. Natural light was blocked by foliage covering the window and the electric lighting was poor. The major problem, however, turned out to be noise. The information we were given about the Balmes said the hotel rooms were soundproofed, which sounded perfect for a city location where traffic noise etc... can be a problem. Unfortunately, while there was no noise from outside the hotel, the sporadic sound of rushing water from the hotel's plumbing was unbearable. It was almost like the waste from every other part of the hotel was flowing through a big pipe in the wall of our bedroom. It kept us awake most of our first night. When we complained in the early hours, the hotel's reception staff were efficient (again not particularly friendly) and we moved to another room, this time on the fourth floor, the following day. The replacement room was much better but there was still plenty of plumbing noise from other rooms in the bathroom. That was controllable as long as we kept the door closed but there was also a great deal of noise from neighbouring rooms and the corridor outside. Very disappointing. On the plus side, the place was nice and clean. Also, breakfast was included in our package and it was good, with a nice selection of foods designed to appeal to all international tastes. Overall the Balmes was ok - a three star hotel that initially looked far nicer than it turned out to be. Sadly, the problems we experienced with noise mean that we can't recommend it.", "Date": "September 21, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "San Carlos, California", "Title": "“Great hotel, try to stay in a suite!”", "Author": "M E", "ReviewID": "UR118024371", "Content": "I stayed here for work & stayed a few extra days to enjoy Barcelona. I stayed in both an \"Executive Standard Room\" & one of the suites (my work only paid for the standard room and I moved to a suite for my extra days stay in Barcelona). I've included pictures of both to give you comparison. The standard rooms are just that...standard (I stayed in the executive room which was a bit bigger than a standard room and it was well worth the extra few Euros a night). The rooms were very clean and surprisingly roomy. The decor is a bit dated but it was perfect for a visiting professional plus I got very good wifi access. After a few days I moved to one of the suite. WOW...the suite was amazing! I saw some people complain about the rumbling of the underground rail, but to be honest we only felt/heard it when we were in the bathroom so it was no big deal. The suite was HUGE and had a walk in closet, separate kitchen area and a lovely bathroom. Plus the room was very spacious with high ceilings. It was like we were in an old apartment...totally made a different in our stay. Only problem was that the suites (a different part of the hotel) did NOT have Wifi in the room. I had to either go to lobby area or outside by the pool. We ordered room service a couple times and the food was decent (not great, but not bad either). Also hung out in the pool a bit which was nice. The hot tub was more of a \"warm tub\" ...but to be honest with such an amazing city at Barcelona, we didn't want to spend that much time hanging out at the pool. A great place to stay. In one of the best parts of Barcelona and walking distance to anywhere you want to go!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Monza, Italy", "Title": "“Very nice and well positioned”", "Author": "Torino74", "ReviewID": "UR117939791", "Content": "I really enjoyed the hotel and the quality of the room is suberb. The room had includes a large space and separate wardrobe. The general manager was very kind in offering a solution to a problem we had. Thanks to the quality of the hotel and the positive attidtude of the management, I will come back again !", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Good hotel - Enjoyed our stay”", "Author": "Lyn515", "ReviewID": "UR117865700", "Content": "We stayed here for 2 nights towards the end of August before we departed for a Mediterranean cruise. The hotel staff were friendly upon arrival and gave us a map of the city that came in very handy while we were sightseeing. The double room we booked was small but had enough space to maneuver around the room. The bathroom was clean. The only complaint I would have was we could hear any noise that came from the hallway, but luckily we did not hear too much noise during the night...nothing ever woke us up so it really wasn't a big deal. The hotel is in a really nice area, very close to some good restaurants and cafes as well as a couple supermarkets including a 24 hour one. If you stay here please visit \"The Times\" cafe right down the street. The owner was very nice to us and we enjoyed eating there. It took us about 10-15 minutes to walk to Placa Catalunya/Las Ramblas. Very close to many major attractions. We walked to Casa Batllo, Sagrada Familia and Park Guell. I would stay at this hotel again during my next visit.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“VERY BAD HOTEL,,,,they smashed our car”", "Author": "Maz516", "ReviewID": "UR117543135", "Content": "I stayed at this hotel for 5 days whilst the staff did not go out of their way to advise us on what to do, how to use public transport they were ok. Pool is very small and there is no bathing area as the whole area is covered with trees. The worst part about our stay is they parked our car, and when we retrieved it it was quite obvious they could not drive and smashed it on the passenger side....very serious damage costing quite a bit of money and they denied having done this.....Hotel staff did not care.... We have tried to contact management of the hotel and are yet to hear a response....would not recommend this hotel....", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Quebec City, Canada", "Title": "“Perfect for us”", "Author": "carnelia", "ReviewID": "UR117321099", "Content": "We stayed there twice at the end of July and beginning of August. 1st room was in the garden. It was absolutely perfect, recently refurbished, nice furniture and very quiet. Second was on 1st floor. Room was a lot more roomy but very very noisy especially in the morning as the maid room was right opposite so impossible to sleep after 8 o'clock. Staff were very helpful. When I got there, my wallet was stolen on my way to the hotel (in the train) and they were very useful in helping me fix it (credit card phone local numbers, embassy number, etc.) Garden, pool and spa are very clean and we really enjoyed it (spa could have been a bit warmer). Wifi: You have 1 hour free per day, and for this you have to ask daily for the code (which is a pain because tou always feel like disturbing people at front desk, even if there helpful). I think this could be a lot more user friendly. If you don't have a computer, there is one you can use in the lobby. Only thing, they should limit the use of this computer at 30 minutes or so per person cause people go there to chat or shop and could stay there for hours. Location was perfect for us. Clause to Rambla. We walked everywhere (but we love walking). It's a bit far from port and Barri Gotic but close to Exiample and the area is filled we very good places to eat and have a drink at night. Overall, our stay was excellent at Balmes and we would definitely recommand it. Littl trick: We had a very big discount for booking early, through the web and for more than 3 nights.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“Charming Little Secret”", "Author": "PMTorres", "ReviewID": "UR117177791", "Content": "This past July, we stayed at Balmes during our 3 day visit to Barcelona. It is a beautiful setup \"boutique hotel,\" with a great location. Balmes is walking distance to many sightseeing and good restaurants. It is my 2nd time stay, I will certainly come back.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Ellicott City, Maryland", "Title": "“This hotel met all of our expectations”", "Author": "trishhemler", "ReviewID": "UR117099812", "Content": "We had only two nights in Barcelona after returning from a trip to Southern France and then to fly back to the US. The rooms were clean modern and well appointed. We got a room in the back overlooking the pool and it was very quiet at night during one of the busiest tourist weeks of the year. The staff was helpful and very nice. We parked the rental car in the hotel parking and were able to walk to many of the main attractions which we enjoyed. It was nice to sit in the hot tub and pool after a long day of sightseeing. I would definitely recommend this hotel to anyone traveling to Barcelona.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great location, great price, okay service. Will be back.”", "Author": "yayitsme", "ReviewID": "UR116487536", "Content": "Just got back from a 3 night stay at Hotel Balmes. If locations is important to you, then this is a great place to stay. It's one block off Playa Catalunya and two blocks off Passig De Gracia. It's about a 15 minute walk to Sagrada Familia and 5 minute walk to Casa Batillo and Casa Milo. Not to mention it's about jam smack between the Gracia District area and the La Rambla (about 15 minute walk). We visited all the above mentioned areas and happily walked to each. The hotel itself is simple and quaint. No real frills, which wasn't too important because we didn't spend too much time in the hotel. Read about the noise issues for rooms located on next to the street, and requested a room in the back which they happy obliged. As a result, slept like a baby. Tried the pool in the evening, but it started to rain on us. We then hopped into the jacuzzi, but it wasn't warm enough so we just went home. I'm sure after a long day of walking the pool would be a nice place to settle, but we never go the opportunity. The staff isn't TOO friendly, but friendly enough to assist us when I needed help with the a/c (something was clanking in there) and mailed our postcards for us. Again, for the price we paid, we knew weren't getting 5 star service. For a good deal, clean hotel, and great location...this was the place for us. Would happily return again.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "essex", "Title": "“very good location”", "Author": "jofrank8", "ReviewID": "UR115512858", "Content": "Stayed for a few days in May, excellent location and with added bonus of pool and jacuzzi, just what you need after a hot days sight seeing. Lovely breakfast with loads of choice . Reception staff friendly. Clean bright rooms.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "2.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Don't think i would stay here again”", "Author": "drd576", "ReviewID": "UR115447567", "Content": "My friend recommended this place and with so many hotels on offer in Barcelona I thought I would go with his reccommendation. The price was OK and they claim to have wifi available throughout the hotel. On arrival we were greeted by a rather unfriendly older man on reception who barely spoke to us as we checked in. The rooms are probably above average however the beds are very uncomfortable, they are purched on 6 stilts and feel like they could break at any time. The noise from outside the hotel was terrible as the hotel is on a main thoroughfare through Barcelona, constant traffic and horns beeping etc. The worst thing about this hotel is the wifi. It is only available in the reception area and NOT in the rooms. This was very misleading on the website. They do offer it in your room free for 1 hour but you have to pay after that. Also the \"swimming pool\" is hidden in at the back of the hotel and is tiny, more of a jacuzzi really. All in all spend a few extra quid and stay somewhere else.", "Date": "July 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Sydney", "Title": "“Great location, helpful staff, dated noisy rooms with poor beds”", "Author": "jmccaff", "ReviewID": "UR115446798", "Content": "Have stayed here several times but recent stay has made me decide not to go back. Great location but found that it was offset by uncomfortable beds and noisy rooms. Wifi while available and free was sporadic and slow", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“good service, nice breakfast, excellent location”", "Author": "pimsen", "ReviewID": "UR114881859", "Content": "i recommend this hotel because: good service, nice staff:) it is clean if you need something just ask, and the staff fix it in no time:) i felt very velcome , not like **just another quest'' the location is perfect, 4 min walk to passeig de gracia, 5 min walk to the 2 best tapas retaurants i know.. Taller de Tapas and one just 2 min from hotel on carrer mallorca , but i dont remember the name of it. nice rooms, whit a little minus if you travel solo as i did, you can get a room that is very small, and you can see absolutely nothing from the window...just straight into a wall.... as travelling a lot in Norway in my job, i always get a dobbelroom for the same price. this could be because the hotels here actually dont have small singel rooms.. anyway, i would still recommend this hotel, also because of the garden. nice pool, relaxing place...nice place to spend time. P", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Edinburgh", "Title": "“Great hotel - stylish, clean, good location”", "Author": "Edinburghgirl_10", "ReviewID": "UR114785931", "Content": "Stayed here for three nights over a conference weekend in Barcelona. I was added to a room that two friends had already booked as the trip was last minute. I was worried that I was going to be on a tiny camp bed but the hotel must have upgraded us to an apartment room which had a kitchen and plenty space for all of us. The rooms were very clean and neat. The air conditioning was very good. The bathroom and shower were very nice too. The pool area and jacuzzi were lovely, although the temperature of the jacuzzi was a little cool. Very easy walking distance from Las Ramblas. The staff were nice and helpful. I would definitely stay at this hotel again when I am back in Barcelona.", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Wooster, Ohio", "Title": "“Ideal location for seeing the best of Barcelona!”", "Author": "StephaDaniel", "ReviewID": "UR114722695", "Content": "The rooms are clean, modern and comfortable, and the hotel plaza is beautiful! It is the perfect place to stay for relaxing, shopping, eating, and seeing all the sights. It is close enough to walk to the famous La Rambla-if you like to walk-and far enough away from the craziness and noise of the massive crowds of people to make it enjoyable. It is also close to several Metro stops. I am picky about where I stay, and I loved it. I would definitely recommend Balmes!", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Quite Central”", "Author": "budhablown", "ReviewID": "UR114634942", "Content": "The hotel is quite central and is within walking distance to city centre(La Rambla and Place de Gracia) and a metro stop in 3 mins walking distance. Lots of restaurants and coffee shops around and the hotel has a pool as well in the courtyard. Wifi internet is not reliable at all but they do have a computer in the lobby which can be used free of charge. Another concern we had is that there weren't any international TV channels(Except for CNN), so if you would like a bit of bedtime TV, I would suggest to pack up your DVDs. Staff were helpful enough, all in all we are satisfied and would say good value for money.", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great value & location”", "Author": "Cruizergrl", "ReviewID": "UR112892109", "Content": "Hotel has great central location & is in walking distance to city centre including La Rambla etc. Rooms are small and lighting is not great and bathrooms are a bit outdated. Other family member's room was very noisy. Breakfast is great with lots of selection and staff is very helpful and friendly. Picked this hotel for it's proximity and value and they deliver on both accounts.", "Date": "June 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Top marks for this hotel”", "Author": "Elli0ttB", "ReviewID": "UR109621262", "Content": "Just got back home from Barcelona, so thought I would write something while it was still fresh... We booked this hotel based on reviews on here and the cost verses some of the other hotels in the area. We were pleased with our choice. A few pointers: If you are travelling from the airport, I suggest that you use the Autobus. At the time of writing, its 6 Euros into Barcelona city. Get a map from the airport info office. Once in the city, then the Metro is just 1.45 Euros. Its very reliable and fast - really easy and the nearest stop to this hotel is para-lel - about 1/4 mile away. Suggest you ask them how the Metro and maps work, once you have mastered, its easier than the London tube! We asked the reception to recommend somewhere local to eat and the said the Catalana 1.5 blocks away. They say its the best Tapas and I totally agree. Be warned, it gets VERY busy. If you are a non-smoker, then be mindful that in Spain people will smoke at their table (outside). Dont bother paying 14 Euros for breakfast. Go round the corner from the hotel and there are many cafe's that will do breakfast for 8 Euros. I have one small comment on the hotel rooms. They have used domestic fittings ie plastic, so seem a bit cheep compared to most other hotels. Hope you find this usefull.... PS - take a trip on the cable car - its very worth the 10 Euros", "Date": "May 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Good location”", "Author": "collinpalmer", "ReviewID": "UR108379598", "Content": "comfortable room helpful reception good value for money in a good position would use again", "Date": "May 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Great, great location and great price/value hotel”", "Author": "Chloe55", "ReviewID": "UR108177721", "Content": "We spent 3 days at the Hotel Balmes and thought it was perfect and just loved its location. Close to major spots like La Rambla , Placa de Catalunya, Paseo de Gracia but this hotel is hidden away oasis on a more relaxed Calle Mallorca. Great access to all the sights. The staff was friendly and efficient, the room on the small size but clean, all the amenities, enough closet space, great bathroom and comfortable bed and sheets. We were not in the room that much so it filled our needs. The lobby was filled with beautiful African art and there was a lovely pool surrounded by gardens in the back of the hotel if you want to spend some time relaxing in the sun. We were not bothered by noise and found it a peaceful respite at the beginning and end of the day. There were lots of restaurants and local cafes right near the hotel. An especially good one very close was Cerveceria Catalana that serves Catalana cuisine. Very happening place. To explore the neighborhood, I recommend making a left vs. a right and go down some of the side streets to get a more local feeling of the area. Would come back to Hotel Balmes in a heartbeat.", "Date": "May 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“Great location! Great Value!”", "Author": "dejesus22", "ReviewID": "UR107000772", "Content": "Great location! Close to metro, Rambla de Catalunya and Paseo de Gracia.", "Date": "May 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boulder, Colorado", "Title": "“Comfortable, Low-Key, Well-located Hotel”", "Author": "judyisreadytogo", "ReviewID": "UR103051773", "Content": "Hotel was comfortable, clean, and safe. Staff was helpful. Room was about average size -- nice big windows that opened, looking out onto a quiet courtyard. Nice new- looking wood floors. Bed was comfortable, nice closet. Great powerful shower, although the shower space felt narrow to me. Nice flatscreen TV -- one english channel, CNN, so able to keep up on the news. Wi-fi access included; works best if connect in the lobby -- then connection carries over to room. Sometimes had difficulty connecting. Also, a computer in the lobby with free access. Location was very good -- bus stop around the corner to go in any direction -- all the way to Barceloneta if you wish. take bus to Metro at Catalunya or Universitat to reduce walking time. Buy a 10 ride ticket, called a T-10; it's amazing how long it lasted. Closest stop for direct metro/tram is at Provenza, about 3 blocks -- connects easily to other metros. Easy to walk to sites from here, too. Many shops and restraurants and cafes close by. Try Catalunya on Mallorca -- very good, and very popular. Reasonably priced. won't disappoint. Don't miss Guell Parc on a nice day -- lots of nice paths for meandering.", "Date": "April 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Apeldoorn, The Netherlands", "Title": "“Friendly”", "Author": "lisabeau", "ReviewID": "UR102657890", "Content": "We stayed only one day in the Balmes Hotel. The room was verry nice, specialy the bathroom. everything was there. Our chamber had also airconditioning The staff at the hotel were verry friendly. We had some drinks at the bar of the hotel and there we have a chat with some of the employes. We could have breakfast from 7.00 until 11.00 o'clock. Breackfast included, fruit, bread, sweet-bread, salades, and several drinks like coffe, thee and milk.", "Date": "April 3, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Great location.”", "Author": "JessyO", "ReviewID": "UR101905361", "Content": "The hotel is situated in an excellent position to explore Barca, 10 minutes walk and you arrive at the main square. Had 3 nights in room 317 and it was very clean. Negatives are lack of tea/coffee making facilities and little light as there was only a small window overlooking internal walls.The air conditioning is controlled centrally so it may not suite your preference. We did not spend much time in the hotel as we were busy exploring the sights and for this reason we would recommend the hotel as a base due to its cleanliness and location.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Letterkenny, Ireland", "Title": "“Good hotel if a little noisy in th emorning.”", "Author": "donegaljam", "ReviewID": "UR101614358", "Content": "Stayed at this hotel for a week. I had requested a quiet location and was offered a room with a patio area for an extra €10 per night., overlooking the garden at the rear of the hotel. The room 218, itself was small but that was fine and quiet at night. The staff cleaning equipment was stored directly opposite, so every morning at 8am the cleaning staff arrived and the shuffleing started which as very annoying. So the peace we acquired at night was lost first thing in the morning. Otherwise the hotel itself and location was good. Great tapas bars close by and nice area in general.", "Date": "March 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Livingston, United Kingdom", "Title": "“A great hotel.......”", "Author": "Mark1875", "ReviewID": "UR99863958", "Content": "My wife and I stayed at the Balmes from March 4 to 7 2011. I had followed the reviews on here with interest and I have to say we had a great stay. We arrived after 10 on a Friday night, reception were friendly and most helpful at all times ( Bon Dia, Buanas Noches or hola helps a lot). We were not offered either an upgrade or the cheap/ expensive breakfasts which suited us as teh choices near the hotel for a couple of euros are vast). We were given room 319 on the third floor. It looked onto the peaceful garden area. The room was comfortable with two twins (we had asked for a double). I am six foot tall, and I fitted the bed, so not sure about the previous review about wee beds? The room had a 21'' LCD TV with spanish, english, french, catalan and german channels, a mini bar, a good bathroom with great shower, wc, bidet and fresh towels and toiletries daily. The room also had a two seat leather sofa and small table and chairs at the window with electric sunblinds and good black out curtains. We heard little or no noise from other rooms or corridiors. At 63 euros a night it is an absolute Barcelona Bargain. Location wise, its a 15 minute stroll to Plaza Cataluna/ Las Ramblas, 5 minutes from Caller Rambla De Catalunya wiith great shopping and 10 minutes from Passieg De Gracia and Diagonal Metro stops, less to Provencal station. There is a mini bar for the lazy and rich :o), however there is also a reasonably priced 24/7 small supermarket 2 minutes walk from the hotel with water, cold beer, wine, snacks and all your daily needs. It is also surrounded by great local bars and eateries, the best for us being the excellent 'Cerveceria Gastronomia', ( turn left out of hotel, walk 100 or so metres and its facing you on the opp side of road from hotel next door to a bingo hall!). Great catalan/spanish and columbian food and drinks at very cheap prices. The menu changes daily. Try the Cava Sangria and for me the cold poured Estrella beer. The owner Ricardo speak great English and is a gentlemen. A great bar and restaurant. 200 metres on from the bar is the Argentinian Free Buffet (Buffet Libre), ''Freeway'' serving as much spanish starters (there must be 30 choices of starter alone), argentinian grilled meats, fantastic seafood and fish (cooked as you require), deserts to die for and really cheap drinks. You will need to have a basic command of Spanish to get the best from this place but at €10 - €15 per person for all you can eat it is far superior to the other buffet chains in Barcelona such as Fresca and Vaca Paca. A bottle of admittedly edgy house white is €7 euros!! Go there hungry, if you love platefuls for good hearty food and brilliantly simple fish and seafood you will love it. For brekky there are lots of cafes and bars that will sell you a coffee and cake (cafe y pasta) from around €2 or Coffee and small salami or cheese baguette for €3? Even the legendary Cerveceria Catalana, 400 metres to the right of the hotel do great sit at the bar breakfast deals. For more classic spanish and catalan food in a slightly nicer surroundings (ie a nice dinner), try 'Balmes/ Rossello Restaurant' on the corner of (Caller) Balmes/ Rossello Street - Good food in nice surroundings, around €40 a couple for two courses including a bottle of decent house Cava. Hotel Balmes - A great hotel, worth every penny and we will stay again, taking our children next time. The area - Its a great location for Barcelona, but please think about where you want to be, if you want the bustle and edginess of the Ramblas, look elsewhere, if you want to class of the Eixample area, and easy access to good food, safe streets, public transport and to be near the Gaudi/ FC Barcelona tourist places, go for it, I dont think you will be disappointed?", "Date": "March 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Excellent Location”", "Author": "gusanovich", "ReviewID": "UR99135246", "Content": "Good in every aspect. Service, room, location, very clean; we got an instant upgrade just for 10 EUR to a room with a patio. Recommended!!!!!!!!!!!!", "Date": "March 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Small room,but very clean and friendly service”", "Author": "thurstan", "ReviewID": "UR95452520", "Content": "Good location, reasonably priced and friendly staff. Only complaints I have is that the bed is too short I am 5\" 10 (fairly average) and my feet stuck out the end of the bed! Also it is very very noisy. You can hear every single person walking past your room, the corridors are very echoey, carpeted floor would help deaden the noise. Also you can hear every room around you, toilets flushing, showers running, people talking, doors slamming. There is minimal information on facilities when you get in the room. It's fine for a short overnight stay or two,but not for any length of time.", "Date": "February 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Des Moines, Iowa", "Title": "“Hotel Balmes-A Treasure in Barcelona”", "Author": "James2011_11", "ReviewID": "UR94985750", "Content": "My wife and I planned a 3 month visit to Spain, and we originally planned to stay at the Hotel Balmes en Barcelona for 4 days. The people at the hotel made us not only comfortable, but after a couple days they felt like family.Manuel in the coffee shop of the hotel was especially helpful and has a great sense of humor. Amadeo at the front desk gave us a tour of the hotel, with the art exhibits, rooms and apartments. Josep Camps (Pepe) the general manager, visited with us several times.To make a long story short, we extended our stay to 12 days, saw much of Barcelona, had a fantastic time, and came back to Hotel Balmes for 4 days at the end of our trip. Spain is a beautiful country with wonderful people and excellent food. We had a wonderful 3 months, start to finish, and plan to return in the future.", "Date": "January 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bordeaux, France", "Title": "“Excellent stay!”", "Author": "fabroche", "ReviewID": "UR89161086", "Content": "Excellent stay! The staff was very helpful and courteous. The hotel was very clean and agreable. Everything about our stay was great!", "Date": "December 6, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Harleysville, PA", "Title": "“An Adequate Hotel...”", "Author": "jruth", "ReviewID": "UR84250181", "Content": "Although very strange noises happened in the middle of the night, (what are those sounds?) this was an decent place for the money. My friend and I had a room with a small terrace, just outside the pool area (room #120)? It had twin beds on the second floor above a small living room, and a decent bathroom (the shower was great) off the living area. The location was nice, just a couple blocks from the Ramblas, but tucked out of the way of the hubbub. An excellent Tapas restaurant was two blocks away, on your walk towards Las Ramblas. There were other good restaurants within walking distance in the other direction too, like La Taverna Catalana on Valencia Street. There was also a small place for good coffee, breakfast items and croissants just next door to The Balmes Hotel.The front desk is cordial and willing to offer information. Negatives: The strange, loud noises through the night! If you are a sound sleeper---go for it!", "Date": "October 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "England", "Title": "“Great value, just outside the hubbub”", "Author": "misstyg", "ReviewID": "UR83913823", "Content": "A good walk to the Ramblas but you can get the Metro, rooms are well presented, clean and fashionable, though have no windows. The hotel has a cute courtyard with pool, sunbeds and steam room.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "San Francisco, California", "Title": "“Cheap is all this hotel has going for it”", "Author": "jkr123", "ReviewID": "UR83663542", "Content": "I have never written a review on a site before, but after this last trip, I feel compelled to. I usually rely on trip advisor for to provide helpful reviews for hotels in cities I have never been. Unfortunately with this trip I feel completely led astray by trip advisor. I stayed at this hotel with a girlfriend during our recent visit to Barcelona. The air conditioning didn't work in the first room they gave us so they switched us to a first floor room. Forget trying to sleep after late Barcelona night -- It was so loud! The beds were rock hard. The decor was uninviting to say the least. There was a disgusting shower curtain in the bath. The gentlemen at the front desk were not friendly or helpful. Also, this area of town doesn't have a lot of character. I'd definitely recommend something closer to the gothic district or El Born. I really can see no reason anyone would want to stay here. A hostel would be better.", "Date": "October 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good hotel”", "Author": "JDuffs", "ReviewID": "UR81302518", "Content": "Stayed 2 nights and found hotel to be very clean, staff friendly and the noise that other reviewers have commented on to be non existent. Pool was cute (small) and cold but was a welcome dip at the end of a hot day. We didn't eat breakfast at hotel as plenty of places for breakfast close by. Good location for linking up with metro/tourist bus etc. Rooms were ready when we arrived (before 11am) and hotel stored bags all day after we checked out as we were flying out late in the evening. All in all, a very good experience.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sheffield", "Title": "“Nice hotel but avoid room 10!”", "Author": "SaskiaSheffield", "ReviewID": "UR80343123", "Content": "I have recently returned from a trip to Barcelona and a stop in the Balmes Hotel. The hotel itself is exactly what I would expect for a city hotel. Having the swimming pool was a nice bonus after spending several hours viewing Barcelona. However, be wary what room you get on check in! On check in we were asked if we wanted to upgrade to a double room, over looking the gardens for an add on price (a coincidence being as that is what I'd requested when I made the booking!). Having thought I'd spent enough we declined the offer, only to be took to room 10 which is virtually opposite reception and next to the guest seating area. After a sleepless night from the constant stream of guests coming through reception and the constant dragging of furniture (literally all night!) I complained to reception. I only got as far as saying I'd spent a night in room 10 when the receptionist was already arranging to change our room. It seems they knew exactly what I was going to say before I said it!! They changed our room without a fuss though to what was probably the room the first receptionist had tried to sell us! It was much bigger too. Once we'd moved the rest of our trip went according to plan and the reception staff were very helpful to other queries/questions we had. I would recommend this hotel but be wary of the 'upgrades' they offer you on check in and don't accept room 10 unless you're a very sound sleeper!", "Date": "September 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London", "Title": "“Hotel of noise”", "Author": "TravellerW1", "ReviewID": "UR80208549", "Content": "We stayed in Balmes having found it on-line. The staff were friendly and helpful. The breakfasts were good with a good selection of food. The room was small for two people. The major drawback was the transmission of noise up and down the hotel from room-to-room. We were woken up frequently during the night with other guests returning to their rooms. The noise from the corridors richoceted in to the rooms. Cannot sacrifice a night's sleep and pay for it too.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Loved it!!! Clean, friendly and GREAT location”", "Author": "snowball2010spain", "ReviewID": "UR79830031", "Content": "My mother and I stayed at this hotel for an entire week!!! We had a GREAT time. The rooms were EXTREMELY clean and the service was GREAT. The location was in walking distance to everything. We would like to tell the people that thought the staff was not friendly, to maybe engage them!!! My mother and I cannot say enough about the front of the house staff and the bartender. The manager was great also!!!!! We will miss Juanma, Amadeo and Manuel!! Thanks for making our stay fun, fun and more fun!!!", "Date": "September 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Belfast", "Title": "“Good value for money, excellent standards of cleanliness”", "Author": "JoshuaBelfast", "ReviewID": "UR77504316", "Content": "My partner and I have just returned from five days in Barcelona, staying at the Balmes. We were offered a room upgrade on arrival, at an extra cost of 10 euros per night, and were told that the room we had booked was small and could be noisy as it was on the ground level, near the pool. We never saw the room, so cannot comment, but were delighted with the upgraded room, which was spacious and overlooked the pool area from the 6th floor. There was daily room service and changes of towels etc, and the room and bathroom were spotless and welcoming. We took the offer of half price breakfast, at a cost of 7 euros each per day. We thought this was good value at that price, but would have been expensive at 14 euros. Breakfast comprised of a variety of fresh fruit, breads/pastries, cold meats, yoghurts, a variety of teas, juice and coffee, all very good and fresh. We really liked the jacuzzi, and used this on a number of occasions. It is about a 20 minute walk to Place de Catalunya, and there is also a bus stop a few yards from the hotel with an excellent frequent service. Overall, very good value for money, very clean, and would use it again.", "Date": "August 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great Location”", "Author": "LondonLambie", "ReviewID": "UR76989998", "Content": "I booked this hotel through a travel agent and wasnt too sure about it! But my thoughts were put to rest as soon as we got there. The hotel staff were always friendly as we were greated upon arrival and felt at ease as soon as we arrived. The breakfast is really good considering you have a wide variety and if you require any specialities the staff are more than happy to help. The swimming pool is a really good area which can get rather busy but there are more than enough loungers and seats for everyone. The Ramblas is only a 10 minute walk away which is worth the walk, diagonal street is at the end of the street and all the hop on hop off busses stop here. Overall the hotel is clean and vibrant. I would definately go again!!!", "Date": "August 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Beverley, United Kingdom", "Title": "“Great value for money”", "Author": "leap1982", "ReviewID": "UR75319702", "Content": "A friend and I have just returned from staying at this hotel. We had read reviews before going and picked this hotel because of them. We were welcomed nicely when we arrived, they aren't a chatty bunch but perfectly polite. We were shown to our room and had our cases carried for us which was great after lugging them around all day! Every day we were welcomed with 'Ola!' whether leaving or entering the hotel. The room itself was great, if a little unconventional. We had a room very close to reception but we never noticed any noise. The room was split level with a bedroom, wardrobe, dressing table and TV upstairs and two sofas, a table, the mini bar, another TV and our bathroom downstairs. The room was always immaculate, and the poor maid did a sterling job getting rid bits of sand we had brought back in our beach bags! The bathroom was all marble and with a healthy supply of towels, toiletries and with an AMAZING shower! If I'm being pushed to find a faults I would say that the air con was good, it kept our room cool enough but could have done to have a bit more power. As for luxuries, there was a computer in reception available for guests to use free of charge. At times of the day this was very popular and there was a wait. The pool/outdoor area was fantastic for an inner city hotel. There was a lovely indoor jacuzzi and sauna, whilst outside there was a good sized pool, some sun loungers (although these were in demand) and some general seating. Location wise, the hotel was great. It was a 5 minute brisk walk, or a 10 minute stroll from Diagonal Tube Station and 3 minutes to La Rambla De Catalunya which has vast amounts of restaurants to choose from for meals. This leads straight down to all the action near La Ramblas. We bought a T-10 card which has 10 journeys on for 7.95 euros which was ideal to use for pottering about the city. We stayed for 7 nights and would certainly come back again. Don't hesitate in booking!", "Date": "August 15, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Little Rock AR", "Title": "“Nice hotel - Indifferent staff”", "Author": "WUD", "ReviewID": "UR73587794", "Content": "This hotel is well located and is an attractive facility but the front desk staff is rude, unresponsive and indifferent. I would not recommend this hotel.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Pretty average and further away from centre than it seems”", "Author": "sarahfoxysweet", "ReviewID": "UR72462671", "Content": "We stayed here for a friends birthday, there were 4 girls so we had 2 twin rooms. Our greeting on arrival was pretty unwelcoming. No friendly smiles, just a grumpy guy shouting \"Passport!\" and \"Credit Card!\" at us. Just a smile wold have gone a long way. We did have our luggage taken to our room for us though. The rooms were ok, split onto different levels. Ours was lounge and bathroom downstairs, 2 single beds upstairs. The other 2 had a very strange room, the door opened literally onto stairs directly down which we all thought was a bit hazardous, especially as our birthday girl was in this room and we intended to get her a bit tiddled during our stay. As it turns out we were all fine, although I did whack my head under the stairs a couple of times. The room was clean, bed was ok, the air conditioning could have been a bit stronger given how hot it was. We were on the ground floor so we couldn't leave our window open. Swimming pool was nice, but pretty small and not many seats around. We didn't have any meals in the hotel so can't comment on this. The location was ok, but a good half hour walk to the Ramblas and I think if I went again, I'd stay nearer to the beach end. Overall it was ok, pretty cheap so can't complain, but really nothing special.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Near to Las Ramblas, ideal weekend hotel”", "Author": "DuckeyLondon", "ReviewID": "UR68856634", "Content": "We went here for a weekend. It's located about 5 mins walk from the nearest Metro station, which takes you around the city. The hotel has a small pool and spa, but that's not what you're in the city for! It's a good base for a few days sightseeing, the staff are friendly enough but don't expect 5 star. We went for an upgrade to an executive suite for 10 euro, as some of the rooms looked a bit small. Worth the money if you get offered. We ate out so didn't use the restaurant of an evening. Mind you, the breakfast was very nice, huge choice.", "Date": "June 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“good location but nothing special”", "Author": "LillC", "ReviewID": "UR65697569", "Content": "Stayed here for 3 nights. Good location in the L'exiample district, 5 minute walk from the diagonal metro station and 10 minutes from Passieg de Gracia station (for the airport train) and also Casa mila and Casa Battlo. Good choice of restaurants nearby. Although the room was small, it was very clean. Other reviewers have commented on the noise - I agree the rooms are not well soundproofed and we could hear other people coming and going, and also whenever the people upstairs had a bath or shower! Our room overlooked an internal light well (no view) which meant we were lucky not to have any street noise. One of our group initially had a room on the 1st floor which had a lot of noise from people talking loudly in the reception area all night. She was subsequently moved to a room on the 2nd floor but then as this overlooked the street there was noisy traffic all night. The people staffing the reception are not the most welcoming. They never smiled and continued chatting on the phone even when booking us in. Don't bother with the breakfast (14 euros) - there are plenty of cafes nearby where you can grab a coffee and a bite to eat. There is a court yard area with sun loungers and the tiniest hotel swimming pool I've seen - for dipping/cooling off only. There was free wifi and a computer in the lobby. i would probably stay here again but only for the location and would make sure i had room which was not overlooking the street", "Date": "May 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Newcastle, England", "Title": "“Nothing fancy!”", "Author": "Samaldo007", "ReviewID": "UR62293444", "Content": "Stayed here for 4 nights prior to the Volcano erupting and when I asked if more rooms were available I was told it was full. As it turned out I ended up staying in a nicer hotel in my opinion. I had booked a double room and was given a twin. The only window in the room faced out onto a tiny courtyard and other rooms. The window itself opened inwards and as a result if you had open fully you had to be careful sitting on the bed incase it hit you in the head. It is a good 20/25 minute walk to reach Placa Catalunya and La Ramblas. It is also a 5 minute walk to the nearest metro station. The TV in the room had plenty of channels but only 1 in English which was Eurosport. Now I know this wont bother many people since you dont go on holiday to watch TV but when you are wanting to know if flights are cancelled etc etc then an English news channel is useful which is customary in every other hotel I've stayed in across the globe. Didn't have breakfast so cant comment on the facilities.", "Date": "April 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dorridge,Solihull", "Title": "“Good value hotel in a quiet area but close to the top end of the Ramblas and Passage de Gracia.”", "Author": "AlanJM", "ReviewID": "UR60929112", "Content": "Had a great 4 night break here. Staffon reception were polite and helpful although they did talk me into upgrading our room for an extra 10 Euros per night. Did not book breakfast but we were offered it for hal price at 7 Euros. At 14 Euros it would be expensive, but the quality was pretty good and it saved time in going out for something. The hotel is just off Carre de balmes on Carre de Mallorca, but it is only one block across to the upper end of the Ramblas (the quiet part north of Plaza de Catalunya). There is a really excellent Tapas restaurant on Carre De Mallorca called Catalunya (?) just before you reach the Ramblas.", "Date": "April 10, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London", "Title": "“nice hotel, poor service and on top of the Metro!”", "Author": "Worldtraveller77040", "ReviewID": "UR58373532", "Content": "The room was nice but right on top of the Metro line. This meant we got little sleep. Also, when I tried to contact them to complain they did not want to hear. The manager of the hotel ignores e-mails and phone calls. All in all rather rude and arrogant. I won't be recommending it to anyone.", "Date": "March 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Great location! but a little noisy”", "Author": "Palny", "ReviewID": "UR58328436", "Content": "We went for 4 nights to Barcelona first week in Marcjh. The location of the hotel is wonderful. We didn't need to take any bus or metro to the tourist attractions. (Yes, we enjoy to walk). The room is small but comfortable. The bathroom is a nice size . The room and lobby were very clean. The only complain is that the bathroom door make a strong sound when they are closed so even-though we had a \"quiet room: we could hear every time doors closing and also people talking in the hallways. (I think were the maids talking ...not sure) We never have breakfast in the hotel , 14 euros is very expensive . Have a breakfast in any of the nice cafes near the hotel for a fraction of that money, Barcelona is beautiful ! What a lovely and happy city!!", "Date": "March 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stourbridge, West Midlands", "Title": "“Excellent hotel and location in Barcelona”", "Author": "ethereal73", "ReviewID": "UR58315776", "Content": "I have been to Barcelona three times now and stayed in different hotels each time. This was the nicest hotel I have stayed in within my two previous visits. Very clean and lovely large modern rooms with excellent bathroom facilities. The hotel is in the Eixample (left) area of the city which in my opinion is the nicest area. You are close to the metro stations of Diagonal and Gracia. There are a number of restaurants and bars very close to the hotel and they are all very busy with local's so they must be good! I recommend Catalana which is on Calle del Mallorca the same street as the hotel. But book if a weekend as they queue to get in this place. Moon Bar on the corner of the next block up is a little more rustic but very enjoyable in there. If you just want a drink then visit Teo's next door but one. This is very local and is cheap for drinks therefore but you need how to order a drink in Spanish and ask for the bill as they do not speak any English. You are also a short walk away from La Pedrera and Casa Batlo two of Gaudi's buildings and all the desinger shops on Passieg del Gracia. If you are going on a city break get a metro pass and use this to get about this city and visit the sights. Born is good for shopping on a lower budget than Passieg del Gracia. Las Ramblas is worth a look but that's about all really. And if you do use the metro, visit Segrada Familia or Las Ramblas then I would suggest you are careful. Conceal your money/valuables. If you wear a bag put this within your clothing if you can or put a ruck sack on your front not your back. I always use a hidden money belt under my clothes. If something spills on you by Segrada Familiar do not accept help to wipe this off. It's a well rehearsed ploy. Barcelona is safe though - you get opportunists anywhere.", "Date": "March 11, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Yorkshire", "Title": "“Lovely Hotel”", "Author": "sunbeech", "ReviewID": "UR57901482", "Content": "This hotel was really lovely, the staff very friendly our room was spotless and very comfortable, plenty of selection for breakfast, didn't really get chance to use the facilities e.g. pool,sauna,jaccuzi as not there long enough but would certainly recommend this hotel.", "Date": "March 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brazil", "Title": "“well located, decent prices and very nice stay”", "Author": "LucyBrazil", "ReviewID": "UR57898952", "Content": "I was on vacations, but it was an expensive time for the hotel (because of the mobile fair, which was not really interested in). Other than that, nice hotel, very well located, nice staff (they received a pack for me a few days prior to my arrival, and even paid in advance for that). Just did not like a charge on a phone call, which I really did not make.", "Date": "March 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "delhi", "Title": "“Good, cosy hotel with interesting rooms”", "Author": "abhi2point0", "ReviewID": "UR56869731", "Content": "Some of the rooms, such as the one I got had a slightly strange duplex setup. The bathroom was at the floor/door level and there were steps to go upstairs to the bed and downstairs to the living room with a study table, sofa and a lovely balcony. A bit weird getting used to initially but quickly grows on you. Some complimentary cured ham with spanish wine in the evenings was a great touch. Hotel reception agreed to accept my Amex card while I was out and left it in my room, which was nice of them", "Date": "February 23, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Price and quality in balance”", "Author": "JTGnyc", "ReviewID": "UR55770756", "Content": "I stayed three nights at the Balmes in January 2010 in one of the newly constructed \"apartments.\" Roomy, well designed space with modern comfortable furniture. However, some basic amenities were lacking: no towels or soap in the kitchen. The front desk staff is efficient but hardly friendly. I was offered a discount on breakfast (from Euro 14 to 7) if I agreed to all three days. It was a good deal, but would have been expensive at E 14. I would return and recommend this property to friends.", "Date": "February 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Milan", "Title": "“Basic service reasonably priced - Good location”", "Author": "AndreaAround", "ReviewID": "UR51347927", "Content": "Balmes is a 3*** hotel in the heart of Barcelona, basic service for affordable prices. This is their mission and they do it in an acceptable way - but don't expect more than this! LOCATION - The true reason for choosing Balmes Hotel. It's located on Calle Mallorca 216, a few blocks from Passeig De Gracia. Underground station is 5-10min walk and there's also the urban train station going directly to the airport in 30min - a real plus! Key Gaudi buildings are walking distance (casa Milà and Battlò), placa de Catalunya and the Ramblas 15min walking. HOTEL - We were given a very quiet room on the 6th floor overlooking internal courtyard and swimming pool, we slept without any problem. Double bed was a bit hard but OK. Tiny bathroom but well working, they even change towels every day, together with courtesy set (!!) Quite oddly, the room was incredibly hot despite we were in December... we switched off the heating system, still it was too hot. We had to sleep 2 nights in December with fully open window and 5°C outside in order to chill the room... SERVICE - Staff spoke basic English without problems, they even tried some Italian when they understood we're Italians. Very efficient cleaners. BREAKFAST - I can't rate that as we bought only night without breakfast (to avoid 14€/person surcharge, much better options out in town). PRICES - Good value for money, a double room costed us 60€ per night without breakfast (over the weekend, Fri and Sat nights).", "Date": "December 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Great location, good hotel”", "Author": "DeshiMusafeer", "ReviewID": "UR51077752", "Content": "My wife and I stayed at this place for six nights recently. It is a decent hotel with great location. Staff is helpful but not very friendly. Breakfast is not included so be careful because it can be quite expensive.", "Date": "December 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Beautiful suite with Sauna”", "Author": "bjohnson68", "ReviewID": "UR49065451", "Content": "Really loved this hotel starting with the African artwork in the lobby, the pool area and jacuzzi, the suite with kitchen, Nespresso machine, separate sitting room and bedroom, full bathroom with shower, jacuzzi tub and bidet (when in Europe!), as well as an in-room sauna! Very nice as the weather gets colder. It was a nice surprise and I suspect we were upgraded to this nicer room since November is starting to be off season.", "Date": "November 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Good value, close to metro, minutes away from Casa Milla and Casa Batllo.”", "Author": "MartaDabr", "ReviewID": "UR48871799", "Content": "If you get a good proce for the room, get it, but ask for a room on a higher floor. We stayed below street level for 7 nights, we couldn't open the windows because you could see people passing by, glass was frosted so light was only artificial, hard to wake up in the morning! You can also feel vibrations from the metro system. Except of that - awsome, big modern room, and since we used it only for sleeping, we didn't care too much. Breakfast was expensive 12 euro per person, and if you opt for a coffee and crossaint do not take it, unless it is included, 3 min away is a charming bakery/caffe, that is quite cheap. Hotel is close to the metro, 10 min. walk to La Rambla, safe to walk in the night. Hotel staff could be a little bit more welcoming.", "Date": "November 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Montreux", "Title": "“Good place to walk around the city”", "Author": "coringax", "ReviewID": "UR47162566", "Content": "Best thing of the hotel is the location. You can walk around he city centre at all times. Staff was really nice and with comprehensive english. Wifi available and included on room price (this should be the standard everywhere now) Room is not big, but sufficient and with air conditioning. If I think of going back to Barcelona, would probably consider this hotel again.", "Date": "October 18, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ballarat, Australia", "Title": "“great hotel...”", "Author": "deanie73", "ReviewID": "UR46998258", "Content": "we loved this hotel - we were a 10 min walk from La Rambla, 5 mins from the Gaudi apartment (which is also a location for the hop-on/hop-off bus) & 2 minutes from great paella & tapas !! The staff were friendly, although sometimes a little stand-offish, they spoke English well.. they always answered our questions & were very obliging when i needed to print out our boarding passes. Hotel was very clean, they had nice breakfast, spa, sauna & pool. Pool was quite small but if you were hot, you wouldnt care - we werent there to spend our time at the hotel !! The hotel has parking but it costs $21e per day... I would definitely stay there again.", "Date": "October 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Auckland", "Title": "“Great value comfortable oasis in a good location”", "Author": "stealpotato", "ReviewID": "UR46503899", "Content": "Got a good value deal in this hotel a little bit away from Las Ramblas and the Barri Gothic, and is a wonderfully quiet escape yet only a short walk to the action and to the Metro. We were an adult sharing with a teenager. The rooms, while not large, are air-condtioned and well appointed, with a bonus of free wireless (though it overloads at times). Lovely atmosphere and a quiet courtyard with pool out the back. Would happily stay again.", "Date": "October 11, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Austin, TX", "Title": "“Comfortable Hotel in Convenient Location”", "Author": "Richard-TX", "ReviewID": "UR46468076", "Content": "Our room was larger than most European hotels in this price range with a small table and chairs and loveseat. The pool was lovely, the breakfast very plentiful, with fresh fruit and cooked to order eggs as well as the usual meat and cheeses. The location, near the paseo de gracia metro, restaurants and shopping was convenient. The hotel also had a small cafe, which had a good wine list.", "Date": "October 10, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Almada", "Title": "“Very well located!”", "Author": "RBenavente", "ReviewID": "UR46100393", "Content": "Balmes hotel is located near La Pedrera in the centre of Barcelona. The staff was very friendly. I truly recommend it.", "Date": "October 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Stockport in Cheshire UK", "Title": "“Reviews on Tripadvisor never disappoint! Balmes Hotel was super!”", "Author": "TurnipTownsend", "ReviewID": "UR44183756", "Content": "Balmes Hotel in Barcelona was very well positioned & excellent value for money. Everything was very clean in the room; the bed was comfortable;room quiet & bathroom modern & clean.The receptionist was very polite & helpful.Breakfast 14 euros-lots of places locally to choose.eg Cerveceria Catalana 2 minutes away.) Avoid the taxi from & to the airport! 35-37 euros each way. Excellent & cheap bus service from airport to the centre.Entrances into museums/churches etc are expensive.Tourist Bus tickets provide you not only with all day \"stop & look\" but also give you a book of discounts for entries to museums. (A 2 day pass was 26 euros-a bit pricey but we made good use of it! Cheaper for 2 days than 1) BMI airlines did not say that they depart for Manchester from T2!!!(Check your terminal! Free shuttle bus between 1&2 if needed.) Thanks to members!", "Date": "September 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Helpful Staff, Good Location, Small Rooms”", "Author": "NickyZoe", "ReviewID": "UR41848896", "Content": "This hotel is very clean and the staff is very helpful. It is located in the Eixample neighborhood 1 block off Rambla de Catalunya--- not Las Ramblas! Great location. Quiet, but just 1 block from Rmb de Catalunya with some great terrace resturants. Also, Passeig de Gracia is only 2 blocks for high end shopping. We didn't make it but the hotel is very close to the Diagonal, which the staff told us was great place for nightlife. All in a great base for a trip to Barcelona. It is basically a 20 minutes walk from everything touristy and very close to some the best resturants in town.", "Date": "September 15, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Newry, Ireland", "Title": "“OK Hotel - VERY rude staff”", "Author": "Ire32", "ReviewID": "UR38235836", "Content": "Location: Not as close to the Ramblas as it seems but all in all a good location. Excellent Tapas Bar near by - so good the crowds start forming at around 8pm! Hotel Reception Area etc: Very nice with lots of artwork and sculptures Bedroom: Nice room, Bed a bit short (Im 6'1 and my feet were sticking out over the end!) but comfortable, Bathroom OK, Air Conditioning TERRIBLE - kept the room at a bearable temperatiure but not cool enough. A very dated air con system. Stayed in the \"executive\" room - the main difference between it and a standard room being the view over the pool - DO NOT bother with it as you will have the blinds pulled all the time to keep the room cool. NO balcony etc. Staff: The main guy on reception (a middle aged man) is easily the most ignorant man I have ever encountered on a hotel reception. He grunted his way through our check in withour so much as an \"enjoy your stay\". Any time we walked past to exit thehotel he didnt so much as acknowledge us. On checking out again he grunted his way through it - unbelievable that this man works on a hotel front desk. The younger guys were quite helpful and pleasant but thsi guy really set the tone - in a bad way. The housekeeping staff DID NOT once wash any glasses we used from the bathroom or bed area - this was totally unacceptable. They also did not top up the shower gel, shampoo etc in the bathroom. Very poor service. Swimming Pool: TINY! Not that we minded but for those who like a swimming pool this would be a let down - about the size of a very large hot tub!", "Date": "August 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Stockholm", "Title": "“Good location, reasonable rate”", "Author": "S_Pi_09", "ReviewID": "UR36458718", "Content": "Hotel is in a good location (Walking distance to Passeig De Gracia, Ramblas and Placa Catalunya). Rate was good - used Expedia to book. Bathroom was a bit dark, the shower/bathtub did not have a lights close to it. Even though we asked for a double bed, we were given 2 single beds.", "Date": "August 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "england", "Title": "“excellent, clean & value for money”", "Author": "ark20", "ReviewID": "UR36403794", "Content": "When we got to the hotel we were overwhelmed, it was really clean & lovely furnishings. We got to our room & it was spacious enough, clean & modern. The outside garden & swimming pool are perfect for a little break from a busy day of sightseeing (you dont feel like your in a city!) The breakfast was great, plenty of choice - we ate lots, so we didnt need lunch! Also the bar is handy in case you need a drink. In a good position on the same road as the \"sagrada familia\" & close to good restaurants & the haagen-dazs shop! The only downside is that the staff aren't very friendly & didnt even say \"bye, safe journey etc....\"! I'd definatly recomend it!", "Date": "August 1, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "UK", "Title": "“Hotel Balmes,Mallorca Street,Barcelona”", "Author": "UkAntonio", "ReviewID": "UR36393933", "Content": "Recently stayed for a three night break in this hotel. Staff generally helpful and friendly,however upon arrival met by a stern and abrupt chap who did not really greet us in a friendly manner ,he didn't really do much for the PR of the hotel,having said that he was efficient and we booked in . Very clean although when you start looking you start seeing the odd broken tile and plastic ceiling fashia in bathroom cracked.Room an ok size,clean towels every day and beds made up.Lovely deep bath.Lollipops left for children,which was a nice touch. REALLY could done with tea/coffee facilities in room, that would have been good.There was a mini bar though. Air conditioning.Beds comfy and plenty of bedlinen if needed. One night arrived in bar and no one was serving.I approached reception after about 15 mins.A Spanish family then arrived and still no one serving,so I went again to reception and they called someone. I was waiting at bar and the bar attendant served the Spanish family first! That was the only negative item about our stay. Ate breakfast at a number of nearby cafes as some people said hotel was expensive. The cafes were really good and coffee excellent. Several people have said that the hotel is an ok distance to walk places.We walked many times to the central square to catch bus turistic at Placa Cataluyna.It was ok but after doing it a couple of times in the heat I would stay nearer to Las Ramblas next time. Swimming pool small but nice sitting areas around flanked by trees .Great to cool off in after a hot day in City.Outdoor bar by pool. Nice area.Barcelona lovely as had things for every age and interests. Magic Fountain was amazing and so was Sagrada Famillia,well worth a visit. Nothing awful really about hotel,it was a good and clean place to stay.", "Date": "August 1, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "ankara", "Title": "“full price charged for sleeping on broken bed for 2 days”", "Author": "SinemMertEge", "ReviewID": "UR35832478", "Content": "We spend 4 days in this hotel, the first day was in an suite which was not very bad, the only complain was, it was not cleaned well, bathroom floor was full of hair. For the other 3 days we stayed in standart room. In the first night we could not sleep because of broken bed, in every move bed was shaking like an earthquake, in the morning we told the reception about the bed and they checked the room and agreed on the broken bed. The problem was there was not an available room for the second night so we had to sleep on the broken bed for the second time. Although I told them that I was pregnant and this bed hurt my back a lot, their approach was not friendly. When we were leaving the hotel, they fully charged the whole stay, I asked them if it is ethic to charge it fully, they said, the previous quest didnt compain about the bed. I felt like they were implying that it was our fault. That was really rude. We spent 10days in spain and already ready for hotel charges but it they would say, we can only make a %10 discount, we would think at least they showed an effort to fix our unsatisfaction. But they did not even care.", "Date": "July 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“good location, great for short stay”", "Author": "agataa", "ReviewID": "UR34329243", "Content": "Stayed in Balmes Hotel for 3 nights in Feb 2008. Easy access by metro from the airport and then just a few minutes walk to the hotel via main street La Rambla full of all designed shops. Modern hotel, small rooms and very thin walls. Don't take room by the lift. Clean and simple. Nothing else needed if you planning to explore city during the day and sleep at night. Nice neighbourhood, plenty of small restaurants, tapas, coffee shops. Recommend to take a bus tour as you can go to many places. Very positive.", "Date": "July 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "New York, NY", "Title": "“Good location with a pool and friendly service”", "Author": "elanamig", "ReviewID": "UR34023565", "Content": "We stayed in this hotel for 4 nights, from June 23-June 27. We stayed in room 518. It is a corner room facing the internal courtyard. The room itself is on the smaller side, but definitely adequate. The bathroom was a nice size. PRO: - One double bed. It is common in Europe to get two single beds pushed together, and this hotel probably has rooms like this. But our particular room (518) had one double bed with a nice mattress. It was very comfortable. - Quiet. We paid 20EURO more per night to get a room facing the internal courtyard with a pool to guarantee peace and quiet during our stay, and it was more than delivered. The room was absolutely silent. We did not hear any sounds from our adjacent room, although we know that someone actually stayed there. - Pool. We have used the pool twice during our stay, and truly enjoyed it. It is not heated, but in June in Barcelona it does not need to be. We also enjoyed their two-level deck and the loungers. - Location. The hotel is located 2-4 blocks from the metro, depending on which line you need. The blocks are quite long, though. so the average (leisurely) walk to the metro was about 15 minutes. It was a little tiring in the evening, when our feet hurt after the day's sightseeing, but overall, it's not that big of a deal. The weather was nice, the area is nice, and we enjoyed the stroll, despite our aching feet. - English-speaking staff. We did not have any issues with the staff. They spoke reasonable English, answered our questions, and did not give us any trouble at all. CONS: - Construction in the area... That is our one and only complaint. We did not hear the noise because our room faced the courtyard, but for those whose room is facing the street - that might be an issue. Other than that, we had no problems. - We specifically requested (and paid about 20EURO per night more) for a room facing the courtyard with the pool to ensure peace and quiet during our stay, and", "Date": "July 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "san antonio", "Title": "“A very stylish hotel”", "Author": "semsat", "ReviewID": "UR33932733", "Content": "The photos of this hotel are misleading - it looks stark and plain. We found it very artsy and stylish. The rooms are small but arranged very well. The staff was extremely friendly and helpful. The garden/pool area also do not show well in the photos but it is a lovely space. It is not right in the heart of the \"action\" but close enough and in a lovely neighborhood. We thought it was a great place to stay and very well-priced. Bonus: free wireless internet.", "Date": "July 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Arizona", "Title": "“Nice rooms, good location, but the service needs improvement”", "Author": "acctg", "ReviewID": "UR33393858", "Content": "I was pleased with the room as it was clean and modern - though plain and a bit sparse. The location was good to excellent and the little pool and hot tub were added bonuses. However, the front desk staff were disinterested, unhelpful and one could even be described as surly. We felt we were interupting them - even to pay our bill for our five nights stay (and they never even said \"thank you\"). Adding more frustration was that the internet (including free wi-fi in rooms) was down 3 out of 5 days we were there. Not surprisingly, the staff didn't seem to care one way or the other which only increased out annoyance with the place. Additional positives: We receieved an excellent rate by going to their website and clicking on the down button to see \"other rates\" - which normally would show higher rates, but at The Derby Hotels often show lower rates. and the rooms were air conditioned which turned out to be a blessing. So, the mixed reviews that show up at TA are, IMO, very accurate. I'd probably book elsewhere if I returned to BCN. Best thing about this hotel? Cerveceria Catalana is less than one block away.", "Date": "June 28, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Montgomery Village, Maryland", "Title": "“Lovely hotel with nice rooms”", "Author": "Lovetravel70", "ReviewID": "UR32031079", "Content": "My friend and I found this hotel as an emergency replacement for one we'd reserved prior to going to Europe. The first hotel had roaches and mold, so we were eager to find something clean and affordable. We took a cab from the roach motel up to Balmes and spoke to the front desk manager. He was very accommodating and even let us see a room. We came back the next morning and checked in for two nights. The room was two levels...you walk in and the bathroom is on your immediate left. A split staircase takes you up to the bedroom or down to the living room. It was odd that the bedroom was so small we could not keep our luggae in it. There was a queen-size bed and small night stand on either side. A wardrobe holding a TV was at the foot of the bed, with no room for suitcases. The living room was nice sized with another TV, desk, coffee table, chair and sofa. We could hear the TV of another room and people talking, but it wasn't terrible. The room was very clean. There are two computers in the lobby for all guests to share. It would have been nice to have had a fridge in the room. Overall, I would probably stay here again just to know it was clean. There is a fabulous tapas place just down the street, I think De Tapa Madre. The front desk guys were so nice, even xeroxing our travel guide pages for us so we didn't have to haul the whole book around.", "Date": "June 10, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Nothing special - at all”", "Author": "mkabell", "ReviewID": "UR30962078", "Content": "Sometimes it is hard to really get your emotions going about a hotel. This one is like that. There's nothing special to report. Rooms are small, the aircon is noisy, and so is the street outside, but the location is fine and therefore comes the street noise. Breakfast is expensive (14€) - don't! In stead take a walk along C/ Mallorca to Cerveceria Catalana where you can get fresh orange juice, baguettes with ham, cheese or chorizo along with your coffee and authentic barcelonians on their way to work or just passing by. And it all for a fraction of the price of the hotel breakfast. Service is unattentive and seems like they don't really care - but they are friendly enough and answers any question you may have... just with that kind of ignorant look in their eyes. In general: this hotel just doesn't get under my skin. They didn't really care about us staying there, and I will probably have forgotten all about it soon... Zzzzzz ;-)", "Date": "May 27, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Brilliant Location in a beautiful city”", "Author": "travellingkiwiLondon", "ReviewID": "UR30840886", "Content": "Hotel Balmes was perfect for our 3 night stay in Barcelona. It's location was great - a short walk to Placa de Catalunya and then a stroll down La Rambla - so close to shops and restaurants and transport. Our taxi driver assured us it was a safe location as well - he said you could safely walk around there in the early hours. Our room was a good size double and was impeccably clean. There was no street noise as our room faced the courtyard but there was some internal hotel noise with doors shutting etc but no worse than many other places I've stayed in. The concierge staff all spoke English and were helpful when we asked any questions. We didn't spend much time in the hotel but it was just what we needed for our tourist weekend. If we'd wanted more time at the hotel and relaxing, probably would suggest an alternative.", "Date": "May 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Norfolk", "Title": "“Pool/Jacuzzi/Breakfast/Cleanliness/Staff - great, Air-con was a bit noisy, The Rambla - 25 mins walk away”", "Author": "HarryHillNorfolk", "ReviewID": "UR26746940", "Content": "Just returned from a 7 night stay at the Balmes. We paid around £35 pppn B&B and the breakfast was rather nice, although make sure to ask for eggs and bacon as it`s not on offer unless you request it each morning when you arrive in the restaurant, there`s no extra charge. The rooms are very clean and the beds were confortable, although the airconditioning was quite noisy...............not good for a light sleeper. I was quite warm at night and I received quite a few moscitoe bites. The pool was not warm enough to swim in but the sun loungers and the Jacuzzi was a real bonus.......................it must be great in the Summer. The internet in reception is also free of charge..................this is a decent place for the price and it`s 3* rating.", "Date": "March 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Great Location”", "Author": "Keels71", "ReviewID": "UR23941862", "Content": "We spent 3 nights @ The Balmes in December for my husbands 40th Birthday. I also had booked the hotel a few months earlier, but nearer the time time checked the price and it had gone down,so I phoned the hotel who said that they would honour the cheaper price. The rooms are small but fine, the bathroom is compact and clean, but have to say the bath is tiny. I thought Barcelona was the most wonderful place I have ever been to, the building's, the food, the wine. We found Barcelona very reasonable for food and drinks, although the Ramblas is a rip off!!!!... Planning on going again probably March or April.", "Date": "January 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Location,location, location”", "Author": "TTK", "ReviewID": "UR23455731", "Content": "I would like to have given this hotel 3.5 as we did have some problems (heating) but seeing that I can't I decided to give 4! The hotel is very well located - 5 mins walk to the Passeig de Gracia and about a 10 minute walk to Placa de Catalunya. There are several excellent, reasonably priced restaurants and bars within close proximity to the hotel and the shopping is great. We booked a standard room a few months ago via the hotel's website. However, just before we left the UK I checked the website and noted that the price of the room was now e70 instead of the e80 we had been quoted. I contacted the hotel and who advised me that we would be charged the new rate. On arrival the guy on reception advised us that we were being upgraded as the hotel was not full. We were also offered 2 for 1 on the breakfast - usually e14 each. We decided to accept this offer given that it would probably have cost us nearly that for coffee and croissants in a local cafe. The breakfast, which was very good, consisted of a cold buffet - fresh fruit, cheese, meats, cereals, yoghurts, bread and cakes. In addition you could have eggs and bacon. Whilst good value for e7 each I would not have paid e14 each. Our room, which was simply but tastefully decorated, faced onto the back and we did not, therefore, get any road noise. However, as meantioned by other reviewers, you do get noise. Whilst the rooms are supposedly soundproofed you can hear the plumbing, doors closing etc from other rooms. Despite being a light sleeper it didn't really affect me to much - I guess it may have been that the hotel was not busy. On our first night the heating did not work (and the room was freezing) but it was sorted straight away once we reported it. Another night we came back to find the electrics in the room had gone - again sorted quickly. We found the reception staff to be very friendly and helpful with reasonable English. Whilst being January and unexceptionally cold for Barcelona we did not use the pool. However I think that it woud be a bonus in the summer plus having space to lie in the sun after a hard days sightseeing/shopping. Whilst I would stay in this hotel again I have stayed in others in the same location which were equally as good and similarly priced so would depend on what offer I could get. We stayed in the Barcelona Center last year (opposite the Balmes) which I think spoiled us. I would like to recommend the Dry Martini Bar (recommended in several guide books) for an experience - worth going but the martinis start at e9!", "Date": "January 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Not the best ;0(”", "Author": "rollerchick", "ReviewID": "UR19906709", "Content": "Stayed here on business as the rate seemed quite good. Not sure if I was unlucky with my room (as it was an internal room), but I found it quite dingy, musty and a little pokey. The bathroom was fully equipped but left a little to be desired - the daily fight with the shower curtain for one! It is also quite noisy as the corridors seem to echo when people move about. (Recommend ear plugs!). Pool looked nice, but I arrived too late in the eve to use it. Free entrance to the Egyptian museum for guests too, which I used. (Not much there, but something to do if you have an hour to kill!) . Overall, not my first choice of hotel, but If you can get a good price though, I would consider it again overall.", "Date": "September 9, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“great hotel, perfect location”", "Author": "helbag", "ReviewID": "UR18748577", "Content": "most importantly, the location is spot on- around 15 minutes walk down to Placa de Catalunya. if you enjoy shopping, you are only five minutes away from the main shopping street Passeig de Gracia. Everything was easy to get to- especially Gaudi buildings (la Pedrera) pool was great for a dip after a long day of sightseeing- rooms were very very clean- we even had a small terrace with chairs and a table my friend and i don't speak spanish- the hotel staff that we dealt with spoke good enough english for this not to be a problem- however some of the staff could have been more friendly- e.g. saying hola when we went out or returned in the evening. overall, i would recommend this hotel to anyone who wants to make the most out of their trip to barcelona", "Date": "August 8, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "East Coast, USA", "Title": "“Nice hotel - grumpy staff”", "Author": "Family2YoungAdulKids", "ReviewID": "UR17650039", "Content": "I will start by saying the hotel is fine. We took advice from this site and booked rooms facing the courtyard (paid 20 Euros extra per night per room) and it was incredibly quiet. We liked the hotel's location and access to dining spots. The small pool was very pleasant. The staff was very grumpy and did nothing to make us feel welcomed. Personally, I think all but one of the staff we met should be fired. There should be a reason that hotels are considered to be part of the hospitality industry. I think if I checked in again I would immediately make it known that I was not going to tolerate the unpleasantness of the staff. Additionally we wanted to change something on our reservation. This was impossible to do via email or phone calls we made before we left the United Sates. We wound up keeping the reservation as we originally booked but we did feel scammed. All this being said, I still would stay there again. We found the rooms to be perfectly cleaned and maintained. One final tip, we wandered over to the \"Passeig Gràcia\" a beautiful boulevard about three blocks from the hotel. We had a quick breakfast of coffee and pastries at a cafe .... it turned out to be a $75 breakfast for four of us. My guess is this is just emblematic of the priciness of this particularly elegant thoroughfare - cafes off on side streets charged a fraction of this cost.", "Date": "July 8, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "1", "Overall": "2.0", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London", "Title": "“No double rooms on standard rates”", "Author": "Annabel53", "ReviewID": "UR17366697", "Content": "Having booked a double room through expedia we were then told on arrival that in order to get a double we needed to pay a supplement but that it would be very quiet, until they knocked down a wall outside our window at 8am. Following my complaint about that the staff were grumpy and rude. I would not recomend this hotel.", "Date": "June 30, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Seattle WA", "Title": "“Stained sheets, rude manager”", "Author": "Wanderlust219", "ReviewID": "UR17167921", "Content": "The hotel was in a good location, but there were several issues that ruined the experience for me. First of all, if you are not fluent in Spanish, this is NOT the hotel for you. The staff seemed very annoyed to have to speak English with us. I understand that we're in their country, so why should they have to speak our language? But it is a hotel, it happens. Every hotel guest we encountered was British (and spoke English with the staff), so this isn't an uncommon occurence for them. Secondly, my bedsheets and pillowcases were covered in brown stains. It was quite gross. And last but not least...the airline lost our luggage, and our cell phones did not work overseas. The manager seemed very annoyed that we gave the airlines the hotel's phone number as our contact number. When we asked simple questions about the airport, we were given short, gruff answers that were far from helpful. Where is the service here? it wasn't a cheap hotel, they could at least pretend to be understanding of our situation. Needless to say, I will never stay at this hotel again.", "Date": "June 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "2.0", "Value": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Palo Alto, Ca", "Title": "“Very Reasonable”", "Author": "Phaed0", "ReviewID": "UR14589049", "Content": "Hotel Balmes was one of four places we stayed during our recent visit to Spain and it was also one of the best values. The downtown location is near Casa Mila, Casa Batllo and the Gracia Metro station. We very much appreciated the free WiFi. But there were some issues: 1. The heat/AC seemed to furnish only heat, with no thermostat, and when we threw open the window to relieve the stuffiness, there was a constantly noisy street scene outside. 2. There was a loud dripping noise at times on the ceiling of the bathroom, 3. The bath/shower is designed in such a way that the bath spout protrudes into the center of the tub, making it an easy target for your knee when showering, 4. The room was a bit on the shabby side and in need of some minimal decoration, such as pictures on the walls, 5. Some of the desk staff seemed a bit arrogant and unaccommodating. My wife stayed at the Balmes three years ago and had a better experience. We might stay here again if subsequent reviews on TripAdvisor indicate that the problems have been resolved.", "Date": "March 27, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Well Located- Staff Indifferent”", "Author": "RonniD", "ReviewID": "UR8062386", "Content": "We selected the hotel based on location- and in that sense it was perfect. The rooms were clean, comfortable and the breakfast was excellent. The hotel front desk staff however were totally rude and unhelpful. My friend lost his luggage and they were not even willing to make the call to the airport to help him find out the status. It was easy enough to find wonderful things to see and do in the area- but no thanks to the hotel staff. I would recommend it as a excellent place if you have a short time to see Barcelona and want to be in the center.", "Date": "July 5, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“Very pleasant stay”", "Author": "GrannyFloe", "ReviewID": "UR7329437", "Content": "We stayed here for a week this Easter and found the hotel staff to be pleasant and helpful. We would not recommend the inside rooms as they are overheated and small. After our first night we transferred to a room at the back which was more spacious and had a lovely view of the garden. The bathroom was well-appointed and a pleasure to use. We enjoyed the breakfast, but it is rather pricey. A better bet is the nearby Cervesseria Catalana. Just as good and a quarter the price. We would definitely use this hotel again.", "Date": "April 11, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Recommended - what is there to criticise?”", "Author": "SuzyandMicky", "ReviewID": "UR6137045", "Content": "I don't know how anyone can knock this hotel. The public areas are smart and stylish, the rooms well equipped, very clean, nicely decorated (we had a lovely bathroom) and a comfortable size. There was also free internet access in the swish foyer! The staff pleasant, efficient and professional- all one should expect really: they are not there to be your friend! In terms of noise, we had had a room on a lower floor above the entrance and yes we could hear traffic when we had the window open but when it was shut, it was barely audible apart from the odd siren (quieter than my London flat anyway!). We were disturbed by another guest outside our room on her mobile but a hotel is not accountable for its guests and it is a hotel not a library after all. I would not describe it as noisy. The best bit though was definitely the breakfast - fantastic choice of food from the buffet such as cold meats, pastries, cereals etc (none of it rationed) as well as freshly cooked dishes (first time I have seen real bacon served by a continental hotel!). It is also served in a very nice conservatory style room. This hotel seems to have its detractors - I can only think they want a 5* hotel at 3* prices. This is definitely the best 3* hotel I have stayed in that I can think of. You can certainly do a lot worse for your money. Recommended!!", "Date": "November 16, 2006"}], "HotelInfo": {"Name": "Balmes Hotel", "HotelURL": "/ShowUserReviews-g187497-d228610-Reviews-Balmes_Hotel-Barcelona_Catalonia.html", "Price": "$109 - $226*", "Address": "<div class=\"blBox\">", "HotelID": "228610", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/91/83/9183ea986adc795c8edf298234fa86a03large.jpg"}}