{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Awful hotel, terrible service”", "Author": "Romeriz", "ReviewID": "UR131440984", "Content": "Business trip. Arrived just after midnight. First room I was offered had not been cleaned after the previous guests. Bed still had the dirty sheets on it. When I complained they suggested I open the window to air it. Hotel does not provide room service after midnight. The suggest you go to the local petrol station and get a sandwich. No tea or coffee in any of the rooms.", "Date": "June 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dubai", "Title": "“Good hotel for business travellers”", "Author": "eagertraveller h", "ReviewID": "UR131256470", "Content": "Very spacious rooms going by European standards and are well furnished. A business traveller couldn't ask for more - free wifi in the rooms, friendly staff and easily accessible. The breakfast was good and included in the room tariff - which was about €70. Overall good value for money.", "Date": "June 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Puerto del Carmen", "Title": "“Quick stop in Madrid”", "Author": "Jack M", "ReviewID": "UR129178741", "Content": "Arrived today after booking a secret hotel 40% discount and was expecting less to be honest. Pleasntly surprised though. Paid €80 for a four star in north Madrid and since arriving am glad with my decision. Wooden floors, large rooms, free water in room, free computer in lobby, wi_fi free in room and comfortable beds. Really good value, would recomend", "Date": "May 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Great hotel”", "Author": "JoaoTRM", "ReviewID": "UR127721822", "Content": "This hotel is very very good, a true 4 stars. The rooms are big and well furnished, the beds are huge and very comfortable, the room temperature is very warm (it was 2º outside and I wore a tshirt inside room), overall very very good. Wifi also available everywhere for free (ask for pin at the reception). In terms of location, it is 5min away from a good subway station, we took 30min to get anywhere in central Madrid.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Frederick, Maryland", "Title": "“the perfect hotel!!!”", "Author": "Pattiavit", "ReviewID": "UR122047533", "Content": "it exceeded our expectation. the room was clean spacious. the breakfast was really good. we had free internet,breakfast and parking !!! All the employee were very helpful and courteous we were at 13 min from city center, we had a rental car so it was just perfect", "Date": "December 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Budapest, Hungary", "Title": "“Good hotel”", "Author": "MiklosM", "ReviewID": "UR121113679", "Content": "It was a very nice place, with good foods, and the service is good well.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tenerife, Spain", "Title": "“Nice hotel for a reasonable price near Chamartin”", "Author": "Cevedale", "ReviewID": "UR121021544", "Content": "The reason why I chose this hotel was its proximity to the Chamartin train station, a 15 minute walk away, and my starting point for exploring the area around Madrid (Segovia, a pleasant two-hour train ride from Madrid, is not to be missed). I paid about 60E/night for a single room. I was given a room on the 4th floor, facing the elevator hall, so I thought I would hear people going in and coming out of the elevators; it turned out the room noise insulation was quite good, also traffic noise from the adjacent road was barely audible. The room itself was spacious, comfortable and well kept, with a nice and clean bathroom. The free WiFi (call reception to get the password) worked just fine. A thing I really appreciated was the free water bottles in the fridge, replenished daily, which I found very handy to bring along with me for the day. If you are looking for a hotel in the Chamartin district, this would be an excellent choice.", "Date": "November 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Alicante, Spain", "Title": "“Easy and convenient”", "Author": "sandarab", "ReviewID": "UR117575696", "Content": "I wanted a hotel close to Chamartine station but not too close! The confortel is only a 10 minute walk (downhill) and is easily located. It is clean, friendly and comfortable. The rooms are spacious and bright. The concierge arrangd for my suit to be pressed at short notice which was very helpful. Restaurant is basic and closed in August! Overall a very good overnight stay.", "Date": "September 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Liverpool", "Title": "“Not a bad hotel but quite far from the city centre”", "Author": "helzbelz89", "ReviewID": "UR104404388", "Content": "My boyfriend and I booked 2 nights at this hotel through a bargain hotel website, so we got a good deal and were pleased to be staying in a 4* hotel. As 4* hotels go, it was fine. The room was nice, comfortable and a decent size. There was free internet in the lobby. The problem we had was that our room was absolutely boiling hot and there seemed to be no way for us to control the heating ourselves. As a result, we were forced to have our windows wide open at all times, which was very noisy as the hotel is situated on a busy road. In terms of location, I wouldn't recommend this hotel for tourists. Although it is only a 5-10 minute walk from a metro station, it is in the north of Madrid and the metro ride to get into the centre is fairly long. The area is quite characterless and there's not much around so you wouldn't want to spend much time there. Overall, we think there are better options, closer to the city centre, within the same price range, and we would recommend these before recommending this hotel. However, it was fine and we weren't dissatisfied with the hotel.", "Date": "April 17, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New York", "Title": "“Stayed here during FITUR, travel convention. Front desk staff was clueless save for one man. AGH”", "Author": "Fattycrab", "ReviewID": "UR96771546", "Content": "Haved stayed at another Confortel nearby and frankly the Confortel Alcala Norte is better except for its location. The basic building is the same- big concrete building with some attempted design elements. The rooms were smaller but they had a great, no phenomenal view of a downtown area. Nearby metro is Pio XII and it is a little walk. The bathroom was decent though smaller than the Alcala Norte but it too has its own remote feeling. What was disappointing was the front desk staff. Here they seemed clueless and not trained in how to work in the service industry. I asked a young lady if she knew where an address was on the same street. She just old me to go outside and keep walking to the right. Dismissive and rude, but worse, she was wrong. The address was actually in the other direction and RIGHT IN FRONT of the hotel. I brought this to her attention and she was not apologetic, she did not even care. This was not the only snafu- I asked for a taxi once and it never came and when I brought it to their attention, they again said, \"well walk and find one\". I stayed here for four days and do not recommend this hotel. Only one tall man works here and he is always taking care of everything. Sadly the female staff is useless and not trained to work in hotels. If you even consider this hotel for business ( service at restaurant is spotty) , well walk and find another hotel.", "Date": "February 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "uk", "Title": "“NICE HOTEL A BIT OUT IN THE STICKS”", "Author": "drhawk100", "ReviewID": "UR86382351", "Content": "This hotel is for business people and caters for the weekender vacationer,and it does this very well,room is about 60 euro and 8 euros each for an excellent breakfast. The room contained 2 single beds a large flat screen tv,minibar air-conditioning and an ethernet port for the internet.it was a large room and fairly well decor wise. The hotel contains a cafeteria, with a bar and a full service restaurant {which was closed} the cafeteria food was sampled and was good. the only problem with this hotel is its location,its about 2 and a half blocks or a 10 minute walk from the metro {PIO X11} if you walk a little further you will find an array of eating options we tried the Thai restaurant and it was ace. The hotel does securely look after you baggage in case you have a late flight home again you can get to the airport direct from the nearest metro about 6 stops or a direct taxi to the hotel about 25-30 euro. all in all a good base for a quick break in Madrid but would probably find a closer downtown hotel next time", "Date": "November 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel with value for money, convenient for Chamartin station”", "Author": "KathleenFrances", "ReviewID": "UR78925640", "Content": "The hotel was easy to walk to from the metro station (Duque de Pastrana) which was only ~20 minutes on the metro from Barajas airport. The surrounding area was not that scenic and was not touristy, but this was not an issue as getting the metro into central Madrid to see the sights was easy. The perk of the location for us, was that Chamartin station was very close 10 minute walk and we had a catch a very early train. The reception staff were very friendly, efficient and spoke very good English. There was free Wi-Fi in the hotel and also two computers available in reception to use the internet for free. The decor and furniture in the room was modern and in good condition, and also very clean. There was a little fridge in the room with free bottles of water and was big enough for us to keep our picnic food in. The room was a good size and the bathroom larger than expected. When checking out, we were running very late and the reception staff were again very helpful in calling us a taxi and were in general very friendly and kind. I was very impressed with all of them! I highly recommend this hotel, with the only negative point being the long-ish distance from the centre (but still only 20 minutes on the metro). I would definitely use this hotel again!", "Date": "September 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "", "Title": "“This is a great value for a comfortable hotel”", "Author": "Very5", "ReviewID": "UR70197022", "Content": "This hotel was very comfortable and attractive. The only drawback is that it is a little far from downtown, but only about three or four blocks from the nearest Metro station (use Pio XII station, though the map on the hotel website suggests that Parque des Duques is closer, it is harder to orient yourself from there to find the hotel). The breakfast (additional charge and optional) was very good for about 8 or 9 Euro. And fee wifi!!! The neighborhood is a mini-embassy row, so it isn't very busy after business hours, but it felt very safe even when coming back late at night. Lots of ATMs between the hotel and the Metro, too, and a convenient Al Campo (think WalMart) at the Metro station. No swimming pool was a drawback.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "rome", "Title": "“My impression on the hotel is very good”", "Author": "far0ut", "ReviewID": "UR52149552", "Content": "I was invited to a 3 days conference which took place in Confortel Pio XII hotel so I've decided to stay there at least for these 3 nights. My impression on the hotel is very good. First of all I must say I was very lucky to find a room on these days (well I guess I organized it quite a while before) but the price was very attractive (I booked it on Easy Click web site) and I actually spend much less than I thought I'd spend. Considering the hotel's amenities, indeed it was surprising. I can say only good things about the hotel: It is nicely designed, the rooms are clean and comfortable and the service is satisfying. Though It is not situated in the center of town I see it as an advantage.", "Date": "December 30, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London, England", "Title": "“Madrid - a gem of a city”", "Author": "naturalbeauty", "ReviewID": "UR40684549", "Content": "Stayed in this beautiful city for only 4 days at the Confortel Pio XII Hotel. The hotel was very comfortable, clean and accessible being only 15 minutes from the airport and having excellent transportation links to get you to and from the sights. There is a bus stop located outside the hotel and the Metro station (the Tube) is about an 8 minute walk. There is also a supermarket located near the Metro Station (Pio XII) which sells just about everything at a reasonable price. Really enjoyed my stay, the shopping down Sol and Arenal is excellent (stocked up on some winter boots at Esteve) which worked at cheaper than buying them in London. The only thing that put a dampener on things was that I fell victim to a pick pocketer (make sure you wear your rucksack on your chest rather than your back as that is a dead give away that you are a tourist). The police were excellent in furnishing me with the telephone numbers for my credit cards (apparently this is a common occurance in this part of the city). Don't let this put you off ... go visit Madrid as you will have a wonderful time. Will definitely re-visit this city in the near future.", "Date": "September 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "2", "Rooms": "5"}, "AuthorLocation": "Romania", "Title": "“even far from centre..its ok”", "Author": "viocor", "ReviewID": "UR28072546", "Content": "1.Stuff ok, when u need some help they are there to provide it. 2. Room was large enough, very very clean, bathroom as well very clean... 3. Breakfast was a typicall spanish one(I guess) and was more than enough for anyone. 4. In front of the hotel runs 2 buses : 16 and 150. The last one takes u in abt 30-40 mins right in Puerta del Sol (between buses u have to wait abt 10- 20 mins). 5. Abt 5 mins walking from the hotel there's a metro station called PIO XII (which is nearer) ; abt 8 mins from hotel there's Duque de Pastrana metro station. U are on metro line 9, and u have to change the line if u want to go in the city centre. BUT...the metro organization is so so so good and the maps u can take from any metro office so clear...u cant lose urself. But u will have to reserve abt 30 mins to arrive in Sol as well. 6. Abt 10-15 mins walking distance from the hotel there a supermarket called AlCampo(I believe it belongs to Auchan hipermarket) and the prices are decent in there. 7.Go visit Madrid...its such a beautiful city....", "Date": "April 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Marietta, GA", "Title": "“Excellent Hotel”", "Author": "andrewinsane", "ReviewID": "UR24088531", "Content": "Stayed there last month upon booking based on trip advisor reviews....and was extremely satisfied!. The staff was extremely friendly, helpful, courteous and well-mannered. The hotel has a good restaurant and late room service, free wireless internet and rooms very clean/modern. Would, without a doubt, stay here again. Location may be a bit off from tourist main areas.... so you can count on a good night's sleep.", "Date": "February 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tyne & Wear", "Title": "“Fab Hotel”", "Author": "BrendaTyne_Wear", "ReviewID": "UR16568208", "Content": "Stayed at this hotel in May 2008 with my sister we had a great time. The Hotel staff were really helpfull the reception, bar staff they were very pleasant. The rooms were very comfortable, clean linen and towels every day complimentry mini bar .internet free. The bus stop outside the hotel took you to the centre of Madrid for 1euro every 10 min number 150 it took about 30 mins Metro further along the street to the centre and the airport 1euro. Supermarket about 200 mtrs sell everything you need. My sister and I wanted to prebook our flights home with British airways we asked the girl at reception if we would beable to print our boarding passes of and she took us into her back office and let us use her computer and printer which was very kind of her. Nothing seemed to be a bother to any of the staff. My sister and I will go back to Madrid and stay at that hotel and I have recomended it to friends and family. Madrid is a very beautiful city lots to see and do. Brenda Tyne & Wear", "Date": "June 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Amsterdam", "Title": "“Great hotel”", "Author": "WeiAmsterdam", "ReviewID": "UR15008159", "Content": "It's a great hotel , very new , clean and modern. Although not so close to the city center but transportation is conveninet enough. It's about 7-8 min walk to the metro and about 15 mins by Metro to city center. The area is very quiet at night . The breakfast is also great. By the way, mini bar and internet is free, it's a wonderful stay for us!", "Date": "April 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Urbana, IL", "Title": "“Great conference hotel”", "Author": "mollyolaf", "ReviewID": "UR13961862", "Content": "This hotel would have received an excellent rating if not for the location - too far from city center at 20 to 30 minutes by metro. Negatives aside, this place was really great. The hotel was spotlessly clean (hardwood floors and nice, modern paint in the rooms) and the service was excellent. The Pio XII hosted our business meeting and gracefully accomodated 90 of us for 5 days. During our day long meetings, a hotel representative checked on us several times, always ready to meet our needs. The conference rooms were comfortable and well appointed. The free breakfast was expansive and very tasty - there was even sushi.", "Date": "March 1, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "montreal", "Title": "“away from downton Madrid but great place”", "Author": "mag007", "ReviewID": "UR8655905", "Content": "I went on internet and had a good feeling about the place and it turn out to be better. Perfect for allergy, no carpet in the room. Furniture brand new and wood floor. Modern building and very quiet. Travelling in downtown Madrid by metro from the hotel is a 20 minutes ride only.", "Date": "September 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "australia", "Title": "“Great hospitaliy”", "Author": "2264", "ReviewID": "UR5527287", "Content": "We arrived late by train and therefore had little option but to catch a taxi to this hotel. It is a long way out of town and fare cost about $45 Australian. Rooms were beautiful and far exceeded our expectations. Clean, spacious, new, views etc. Unfortunately the very next morning hopping off the tourist bus in the city , we were robbed, our accounts accessed and massive amounts run up on credit. We spent the whole day at the police station and therefore missed all the sights. Back at our hotel the manager was totally sympathetic and supportive, allowing us to use reception phones etc. He shouted us dinner, drinks and breaky next day. Food was magnificent. staff friendly and helpful. I would stay here again as it was good value for money and we felt safe and secure.", "Date": "July 30, 2006"}], "HotelInfo": {"Name": "Confortel Pio XII", "HotelURL": "/ShowUserReviews-g187514-d228660-Reviews-Confortel_Pio_XII-Madrid.html", "Price": "$54 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Avenida de Pio XII 77</span>, <span class=\"locality\"><span property=\"v:postal-code\">28016</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "228660", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/84/a0/e4/front-view-confortel.jpg"}}