{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“barely a 3 star”", "Author": "barry c", "ReviewID": "UR139638321", "Content": "Its always best to try and start on a positive a believe. The hotel is very well positioned and it has a pool that does help at the hottest part of the day.The hotel itself is in desperate need of a referbishment and modernisation. In the UK it would struggle to achieve a 3 star status the rooms are so shoddy. If you decide to book beware of booking bed and breakfast because if you require something unuual such as EGGS! you need to pay extra! In short the hotel is tired far from luxurious and the breakfast is an exercise in hidden costs.I am sure the fine city of Madris can offer better than this.", "Date": "September 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Darlington, UK", "Title": "“Brill stay - we loved it!”", "Author": "Greendoor09", "ReviewID": "UR139614298", "Content": "Really enjoyed our stay at this hotel - spacious room, comfortable beds and luxurious bed linen. Very clean and price good if you can get a deal . Great location. Roof top garden and pool excellent -makes a city break into a more relaxing holiday. We found staff quite friendly. Only negative was cost of wifi - I think it was 12 euro a day! In such a quality hotel this is an old fashioned approach and it should be free. Think about it Emporador management! For this reason I would rate 4.5 rather than 5.", "Date": "September 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location but trying to get more money out of you leaves a bad taste.”", "Author": "Sianarealla", "ReviewID": "UR139569890", "Content": "We booked two rooms both with three beds, with five girls travelling its nice to have the extra space. When we got to the hotel they told us we could have a three bed and a two bed room, we asked for a refund towards on one of the rooms as we had paid for a three bed. All of a sudden a room with the three beds became available. The rooms ‘view’ was spoilt by scaffolding, and we had to have the curtains closed the whole trip as there were male builders on the scaffolding. All was fine until we checked out. They handed us a bill and said we needed to pay an extra 100 Euros for the extra bed. We explained we had already paid for the bed and the man at the desk (who claimed he booked us in – he hadn’t a women had) said we hadn’t paid for the extra bed at all, we asked why the rooms were the same price and we refused to pay the extra charge. They kept shouting at us in Spanish. It too half an hour to sort out – the only reason they agreed to take the money off is because they didn’t want us to talk to the manager. They also tried to charge us for room and pool service that we didn’t order. The hotel is in a great location, great transport links and having a pool in the city centre is a lovely bonus. But them trying to over charge us and get more money out of us for something we had already paid for! And while a pool is lovely, one full for bird feathers and bugs isn't!", "Date": "September 6, 2012"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Location": "5"}, "AuthorLocation": "Macclesfield, United Kingdom", "Title": "“Would go back again”", "Author": "Colleen767", "ReviewID": "UR139541867", "Content": "We picked this hotel because of the outdoor pool and central location both of which are fantastic. It is right in the heart of Madrid and within walking distance of most things to see. But also has Bus, Metro, Taxis and shops right outside the door. The hotel common areas, like lobby, bar etc. are very nice and you feel you are in a 4/5 star hotel. Staff are pleasant and helpful. However our actual room no. 314 (standard double) was a bit dark (window looking at concrete walls of the hotel itself - no sunlight) and compact. Basic bed with basic bedding. The ensuite bathroom was good though - nice towels and toiletries supplied and the house-keeping was excellent. According to reports, this hotel was refurbished in 2006 but our room was more 1980!. We were fine with it because we got a very good rate from Roomex. However, if we had paid full price we would have been disappointed and would have asked for a change of room. Our rate included cold buffet breakfast and this was ample. For extra supplement there was hot breakfast which we tried and this was eggs cooked to your liking/omelette, rubbery sausage, leathery bacon, mixed veg broccoli, green beans etc. and savoury rice not great. We enjoyed our stay here mainly due to the rooftop pool facility, central city location and its overall ambience....... and would go back!", "Date": "September 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "preston", "Title": "“Still as good!”", "Author": "welltravelled800", "ReviewID": "UR139237368", "Content": "Went on a 'girlie' weekend away and stayed at this hotel. It was wonderful. Had booked club rooms and this entitled us to free drinks in the club lounge. Although the drinks choice available was very limited (no wine), we coped! Hotel is very central. On main road near to all shops and restaurants. Taxis outside door. Tour bus across road. It has a roof top swimming pool and sun loungers. The bar area is lovely. The reception staff are very helpful. Couldn't've wished for a nicer place to stay!", "Date": "September 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "kent", "Title": "“Roof Top Pool is Brilliant”", "Author": "lbrin", "ReviewID": "UR139232486", "Content": "We were first put in a terrible room and i went to reception and this was changed to a 1st floor room - there was no natural sunlight in the room however we didnt mind as we was only in the room to sleep! we loved the rooftop pool and the food up there was amazing as well - the service was good - overall am pleased we stayed there", "Date": "September 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“5* Service”", "Author": "dieselbloke", "ReviewID": "UR139191192", "Content": "I stayed here for 5 days from 27- 31st August - it is without a doubt one of the best hotels in Madrid. For a number of reasons; 1. The reception staff: a very slick and efficient customer facing team - personable, friendly and helpful, in particular the female with the curly hair and older gentleman with spectacles. They helped me without any hesitation on a number of occasions. 2. The rooms: i got exactly what i requested - a street facing room with a balcony (If you don’t ask you don't get). The room was perfect, large double with double glazed doors to keep out the street noise. This is not a modern styled hotel and the furnishings/decoration are classic (chandleries & teak furniture) - which adds to an atmosphere of old fashioned grandeur! & spotlessly clean! 3. The pool: must be the biggest hotel sundeck in Madrid – the pool is clean and large, the whole rooftop area is again well managed – the staff all very welcoming and helpful and the restaurant service fast. And what a view! 4. Location: Gran Via runs through the heart of Madrid, where else could be more accessible. Metro and buses on your doorstep and everything worth seeing within a 15/20 min walk! I’ve stayed in quite a few 5 star hotels in Madrid – they don’t compare. The Emperador knocks spots off them on every count in my opinion. Thank you for a very enjoyable stay!", "Date": "September 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Awful room, nice pool”", "Author": "run_ski_alski", "ReviewID": "UR139017563", "Content": "The location was very central.The hotel was clean and basic, but my room was tiny - barely space to walk either side of the bed - with a view of a service yard and wall. Very disappointing as I had paid for a 'double' room. I was told as I had a double bed, this constituted a double. The rooftop pool is the only reason to stay here, and even that is a little shabby.", "Date": "August 31, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“pool made the difference”", "Author": "seeworld200", "ReviewID": "UR138455824", "Content": "hotel very central, rooms average nothing special pool great but closed quite early didnt eat at the hotel but lots of bars and eating places very close would recommend and would probably use if staying in madrid again and would consider to upgrade to a superior room next time", "Date": "August 26, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Newbridge , Co.Kildare", "Title": "“Nice hotel good central location”", "Author": "Tommy R", "ReviewID": "UR137983150", "Content": "Stayed here last september 2011 with my wife. Madrid is a great city and this hotel is in a great location close to most of the sights with a number of underground stations very close to this hotel,you can travel all over the city very easily on the undergroud.Hotel is very clean,rooms are a good size kept very clean,our room was out back of hotel so was very dark overlooking a garden and other rooms. Better to ask for room out front with a view of city.We booked this hotel mainly cause of the rooftop pool and bar which was great , it was nice to be able to have a swim in the pool on those warm days.We didn't really eat or drink in the hotel as taught it was a bit expensive ( just the odd snack and drink at the pool bar ) So really can't comment on the bar or restaurant.But plenty of bars and restaurants within walking distance from hotel to suit everyone's liking.Would probably stay here again mainly cause of location and rooftop pool and bar.", "Date": "August 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Jersey, United Kingdom", "Title": "“Clean hotel in a good location”", "Author": "Eggo1", "ReviewID": "UR137665336", "Content": "Location is good for walking to the Palace and the areas with many bars and restaurants. Upon booking we were advised a room with a view was available upon request. Although we emailed the hotel we received not reply and no view :( The room we was very dark even during the day as we looked out onto another building that was quite close. Pool terrace is good, especially when hot in the city, but watch out the pool itself is freezing even when it has been 40degrees all day ! We had an adjoining room and the neighbours were in bed early, they often banged on the door if we watched the television when relaxing upon return to our room after a busy day ! A bit annoying ! I would say overall more a 3 star hotel, I guess they get the 4 stars due to the outdoor pool and terrace! Overall a good hotel, clean and in the heart of the city, the staff on reception could give a warmer welcome upon arrival and when approaching them for information.", "Date": "August 19, 2012"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Mostly Good”", "Author": "nicola m", "ReviewID": "UR137660617", "Content": "Arrived at this Hotel for a few days with Family. It was actually really hot weather-so the rooftop pool was ideal! So glad we booked a hotel with a pool- which is a must with a young child. The rooms had a little balcony- which I enjoyed-could sit out at night and watch the world go by! The Madrilenos are pretty much Night Owls! we found that they would come out of the cinema about 10.30-11pm and sit with their family and have a meal- which we loved- as they obviously feel safe. We encountered friendly people in this city. The hotel was spotlessly clean- the rooms cleaned well each day, there is a hairdryer and toiletries and fresh towels each day. Could not fault the cleanliness.The lift is really small-and always have to wait ages so use the stairs if you can!The buffet breakfast is great- lots of choice but we think you have to pay extra for cooked omelettes or bacon. Something to do with a voucher- not sure as we never wanted cooked food- there is fruit,yoghurts, meats, cheeses, toast, muffins and cereals - we found a deal with breakfast included in the price- otherwise at 19 euros- quite expensive I think! Also not sure what was going on with the cava - we had some bucks fizz type drink one morning then it was never opened after that! Not sure whether they also charged extra for this! At the pool there is hot food and the food was lovely- really recommend. Except for the fact we found a small orange \"top\" in the salad- not sure what it was off- but we did complain and the staff apologised. However when reported to management no response! That is not good- luckily no one choked on it! But apart from that excellent food if a bit pricey! The drinks at the pool are also expensive- and although no-one is supposed to take food or drinks up there- we found loads of people were taking bottles of water- just be discreet. We think there should have been free water and also waiter service around the pool- but they seem understaffed at times- so maybe that its the reason- but it would have been so much better !! There are showers and a dressing room as well- and also supply towels. A definite plus to choosing the hotel! The Hotel is very central for everywhere as well- and lots of restaurants nearby. Also noticed some of the reviews were moaning about the noise- we found it fine- and we were on the first floor- it is a little noisy if you leave doors of balcony open but there is air con which is great and so you can shut out the noise. After all it is in a busy street. But we had no problems.", "Date": "August 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great hotel in a great city!”", "Author": "InBigSmoke", "ReviewID": "UR137436017", "Content": "Went to The Emperador Hotel on a Groupon deal with Easyjet; our 2nd trip as a couple to Madrid and it won't be our last, we love it! The Emperador is a lovely hotel, a little way out from the main tourist hussle and bussle - we were still able to walk in to the main squares and restaurants, but if that's too far it's only 2 mins from the nearest 2 Metro's. It is on a main road which I can imagine if you are in a room front facing on a lower floor it would be a little noisy from commuter traffic; but why would you still be in bed at that time? The rooms are good, the breakfast is lovely, pricey if not included though. But the best bit is the roof top pool, with lovely views and perfect for cooling off after a long day sight seeing and tapas! Drinks service on the roof a little slow, but when in Spain.....", "Date": "August 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A least 5 stars”", "Author": "theadviso", "ReviewID": "UR137388143", "Content": "I've been traveling for almost a month now. I've been to portugal, morroco, france and spain. I've been in about 10 hotels and this is one of the best. I'm not talking only about his rooms and lobby, pool and cleanliness which are great by the way but about his staff and their great attitude because while I was walking in madrid's street I've been robbed, they took my wallet with my credit card and room key (card)and instead of complaining and making me pay for the key the helped me deactivate my credit card and kindly offered me two new keys and insisted on not charging me so I personally suggest it to every traveler to Madrid...", "Date": "August 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Excellent service”", "Author": "BridFirtear", "ReviewID": "UR137201146", "Content": "We stayed in the Emperador hotel for four nights at the end of July. The staff were amazing , very helpful and informative. The receptionist was welcoming and helped us, as we had been traveling for over 20 hours. The rooms were very spacious and comfortable. We chose the hotel due to its central location and rof top pool, would highly recommend this hotel!", "Date": "August 14, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“The pool is amazing”", "Author": "Sarah H", "ReviewID": "UR137172799", "Content": "The best selling point of this hotel is the pool, it has great views of madrid and a great place to relax with a drink at the end of the day. However the downside is that it opens at 10 and closes at 9, so i could not go for a swim before work and sometimes after when i was working late.", "Date": "August 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Amazing hotel in Madrid, stay here.”", "Author": "allaboutcricket", "ReviewID": "UR136992455", "Content": "We stayed in this hotel for 2 nights and it was excellent. The staff were very friendly and helpful. Our room (no. 528 I think adjacent to lifts) was brilliant. Very spacious with a small balcony which was nice. No noise from the lifts despite our closeness because our room had a hallway and then a bedroom with a separate door although we never closed ours as we didnt need to. The bathroom was a very good size and well laid out. Nice big comfy bed, massive actually. The best thing about this hotel is the pool on the roof. There is a bar/cafe up there with lots of tables and the food is yummy but the sangria is the BEST in madrid and I'm telling you I tried lots and lots of it. The views of the city are very good and the staff up there very nice with waiter service. Plenty of sun loungers too. The water was freezing though so I wasnt tempted but it was nice to chill out and relax in the middle of a city. Towels are provided when you give your room number. We even went to the cafe when we were staying in a different hotel because it was so nice. Location is excellent, five mins from a metro station and five mins from the shopping centre which leads you to the very centre of Madrid which is then another five mins walk to Plaza Mayor.. If I went to Madrid again I would stay in this hotel without question. and they have amaretto di saronno in the piano bar which is always a plus factor for me.", "Date": "August 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wayland, Massachusetts", "Title": "“Family of 15 at the Emperador”", "Author": "Connie L", "ReviewID": "UR136395880", "Content": "I chose this hotel because of the location, rates and swimming pool on the roof and we were not disappointed. We are a family of 15. Reception was great and gave us rooms as soon as possible. We got one when our first group arrived around 8am. the rooms were small but comfortable and the staff was pleasant. The location was phenomenal for walking around Madrid. The pool was a blessing for weary kids (6-16). Breakfast was good but we wish there were a restaurant in the hotel to have to go out to dinner. We definitely recommend it.", "Date": "August 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oxfordshire", "Title": "“Perfect for seeing Madrid”", "Author": "waybackOxfordshire", "ReviewID": "UR136359337", "Content": "As a base for seeing the sights of Madrid the Emperador is hard to beat. It is 50 metres from the Santo Domingo Metro Station and has numerous cafes, restaurants and tapas bars within half a mile. Our room was sufficiently spacious and had a bathroom that was utterly practical and functional. The pool is more than a pool, the hotel promotes it as a \"Beach Club\" and although the prices for food, drinks and cocktails are steeper than on the Gran Via it is a very pleasant place to spend an evening looking out over the sights of Madrid. The Emperador doesn't provide 5 star luxury but it certainly provides everything you need for a great trip to Madrid.It is worth taking a travel kettle, mugs, tea and coffeee etc and squeezing a pint of milk into the minibar. The TV only offers CNN News and Sky News in English but Madrid offers plenty of entertainment. We asked for a quiet room, and although we did not have a view at all, we did not hear a single sound in our 5 nights at the Emperador.", "Date": "August 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Philadelphia", "Title": "“great rooftop pool!”", "Author": "azzzure", "ReviewID": "UR136064258", "Content": "The reason I chose this hotel was the rooftop pool. I got exactly what I was looking for. It was perfect for July in Madrid. The room was newer looking, clean and nice. It was on the small side but being one person it did not matter. I did utilize the fitness center as well which was good enough. The location was between two Metro stops that made it easy for travelling around the city. There is plenty of shopping to do nearby which is always a plus for me. A good location. I am not sure if I would reserve this hotel for any other time except in the heat of the summer specifically for the pool. The price otherwise is high when compared to other hotels in the area. The biggest downfall to this hotel is the surgcharge for wifi. It adds almost $20 extra per day if you decide to purchase it and it is very weak.", "Date": "August 2, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Dubai", "Title": "“Terrible”", "Author": "James H", "ReviewID": "UR135966697", "Content": "What can I say, 3 hours into my sleep after a 20 hour day, the workmen doing the construction work on this old building removed my window with hammer and chisel. I video'd the whole event and showed reception who just shrugged their shoulders and ignored me. Ok so construction work was going on but why put guests in a room that is still under construction and then not even offer a refund of the very expensive charge. It may be an average hotel once complete, the rooms are small and the bathrooms smaller but I would not return.", "Date": "August 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Nice location hotel”", "Author": "123eki", "ReviewID": "UR135909104", "Content": "Hotel location on Gran Via 53 is absolutely great, location in center Madrid is nice. My room Club- Room was quite large and there was balcony also.. The view was great. Breakfast morning time was excellent. Room was very clean. Very easy to get Taxi from Hotel. Service was just great and security also. executive lounge was nice. When i am visiting in Madrid next time i will visit this hotel again", "Date": "July 31, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oldham, United Kingdom", "Title": "“Great central location for all ages”", "Author": "AmieOldham", "ReviewID": "UR135761857", "Content": "Me and my partner stayed in this hotel as a base for sightseeing in Madrid. The location was just perfect right on Gran Via and with walking distance to most of the top sights and attractions. We chose the romantic offer and had a very large room with a bottle of champagne on arrival, only downfall was the view of a brick wall but being on the 9th floor we saw a bit of light. This was a slight downfall as on one of the nights an event was being held on the roof top pool which was extremly noisy and went on till about 1/2 in the morning. We had booked a tour early the next morning so this was a slight disappointment. The pool is the best asset of this hotel, it is extremly clean and beautifully decorated, up there you can forget the hustle and bustle of the busy streets below. Will definately choose this hotel again if travelling to Madrid.", "Date": "July 30, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chorley, United Kingdom", "Title": "“Good Hotel - Great Location”", "Author": "Schnauzer15", "ReviewID": "UR135640441", "Content": "Good Hotel with good facilities, very close to all the sights of Madrid and therefore ideal for a city break. The swimming pool on the roof of the hotel is superb, the view from the roof are fantastic. This hotel is well worth a visit.", "Date": "July 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ventura, California", "Title": "“Good Hotel Value”", "Author": "DinoraInVentura", "ReviewID": "UR135571624", "Content": "This hotel is on Gran Via, the major thoroughfare in the center of Madrid. Rooms are small but comfortable and impeccably clean. I find that, if I want to stay in a historical area, most European hotel rooms are smaller than what we expect in the US. One can walk to Prado, Reina Sofia, Thyssen-Bornemissa, Palacio Real, Plaza Mayor, and other attractions from here. The staff here was efficient and friendly. As a matter of fact, the European Cup Finals were taking place while I was here, and the bar staff actually started to ask me if I was planning to return for the next game. They made room for my friends and me each time. Same treatment when the wining team was received with a parade that passed by the hotel on Grand Via. If anyone is interested, I paid anywhere from 15 to 22 euros for breakfasts at 5 different hotels during this trip. The staff at the breakfast was also extremely helpful: asked for and received hot chocolate each day even though it was not offered as part of the regular fare.", "Date": "July 27, 2012"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Wrexham, United Kingdom", "Title": "“Worst honeymoon ever!!!1”", "Author": "Serena J", "ReviewID": "UR135537230", "Content": "The worst hotel I have ever stayed in! In April, after a lovely wedding in a lovely hotel, we were looking forward to our honeymoon in Madrid! What a let down! We thought the taxi had brought us to the wrong hotel as the building was so shrouded in scaffolding we could not recognise it as the one advertised! When we got to our room, it was very disappointing. It was very small and very musty. We went down to complain to a very disinterested manager who told us that there were no other rooms for us to move to. His attitude was \"take it or leave it\"! As there were workmen outside our windows creating dust and noise, we could not leave them open for ventilation, and with the air-conditioner blowing out hot, not cool air, sleeping was made very uncomfortable. When we got home we complained to the tour company as there were no reps on site. The tour company did not want to know! For every complaint we made, they had an excuse. We demanded a refund as we felt our honeymoon was ruined and the hotel was not fit for purpose! They told us that they did not feel there was a problem as the outside of the hotel was only receiving a light cleaning! What do they think we are stupid? You dont need drills and heavy machinery for light cleaning!!! One of the previous reviewers says that they took out one of his windows while he was in the room. Light cleaning indeed!!! Would never recomend this hotel to anyone else!!!!", "Date": "July 27, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New York", "Title": "“Enjoyable stay in the heart of Madrid”", "Author": "MJMNewYork", "ReviewID": "UR135497452", "Content": "I recently stayed at the Emperador with my husband and 7 year-old son. We were in a corner Junior Suite, and it was huge! My son loved it because there was so much room for him to play. The rooftop pool is a major perk of this hotel. It is like an oasis after a day of sightseeing in hot, dry Madrid. Two negatives about the pool area for young children: there is no shallow end, it's all deep water. Also, the pool water is very cold! If you are only with adults or older children, it wouldn't be an issue. It really is very pleasant up there. The staff at the front desk were friendly and helpful. My son really liked Alfonso, he was always very friendly to us. I speak Spanish, so I had an easier time communicating than someone who doesn't . The breakfast buffet was good with plenty of options. We had this included with our room. You needed a ticket, though, to go to the omelette station. The first day, the guy at the entrance gave me a ticket without me even asking. The next day, he didn't hand me one. I asked for it, and he said he had to check to see if that was on my plan. I told him that he had given me one the day before, and so he gave me one,no problem. We really liked the atmosphere of this hotel. It is very centrally located. You are within easy walking distance of the Puerta del Sol and Plaza Mayor. The \"Santo Domingo\" Metro station is right across the street. You couldn't ask for a better location. I would definitely recommend this hotel to anyone visiting Madrid.", "Date": "July 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Very glad we chose this hotel”", "Author": "HL2115", "ReviewID": "UR135075359", "Content": "Having previously spent quite a bit of time in Madrid I have a fairly good idea of where/where not to stay, and chose here for when visiting with family. I'm very glad we did - it was an excellent stay. It is definitely not cheap, but you get everything you'd expect in a 4-star hotel. The room was lovely - very spacious, good facilities and we got a Gran Vía view, despite not having selected this more expensive option, which I was very pleased with. The rooftop is definitely the highlight - the pool was a little cold, but the view definitely made up for this and the pool-side service was also excellent. The staff were also very friendly and helpful, and needless to say the location is about as good as you can get - it's right next to Santo Domingo metro station, and about 2 minutes walk from both Plaza de Espana and Callao. Overall a brilliant stay and I would definitely recommend this hotel.", "Date": "July 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Good Hotel, Fantastic Location”", "Author": "Jaheto", "ReviewID": "UR134636978", "Content": "Just meters from the San Domingo metro station the hotel is on the main shopping street of Madrid within easy walking distance of the other main pedestrian shopping areas, theatres, cinemas, museums and tourist attractions including the Royal Palace which we could see from the window of our room. The rooms are small but well equipped and comfortable with everything you need though a few extra TV channels would have been appreciated. Did not use the internet or breakfast offered due to the exhorbitant prices. The foyer of the hotel is very much 4 star, likewise the reception staff who proved very informative with information regarding transport and restaurants. Had the best Paella and a great Tapas through their recommendations. Best of all, during the summer months, is the roof top pool with large sun-bathing area, plenty of free sunbeds. Amazing place to cool down and relax after a day shopping and sightseeing in very hot weather. The cocktails, other drinks are well priced and they have a very good selection of food and snacks. I would not hesitate in booking this hotel again if I was to return to Madrid during the summer months.", "Date": "July 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Southern Spain", "Title": "“Two reasons for staying here”", "Author": "ExpatSouthernSpain", "ReviewID": "UR134402025", "Content": "The two reasons are: the location (on the Gran Via); and the roof-top pool. The pool alone (as far as I know, the only one of its kind in Central Madrid) would clinch it for me! Unfortunately, there are downsides. The breakfast is a ludicrous 19 euros, the internet is 13 euros a day, and a small black coffee will set you back 4.50 euros. These are 'four-star' prices, and (although the public areas are fairly smart) this is where the 'four stars' end: the standard rooms are on the small side, and unimaginatively furnished - you're also quite likely to get a view of nothing more scenic than a brick wall. However, at the end of a sweltering day in Madrid, all you think about is that pool.", "Date": "July 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "london", "Title": "“man soup on roof terrace”", "Author": "Robert-Chiswick", "ReviewID": "UR134087847", "Content": "Have Stayed here for Madrid pride many times. positive points: superb roof terrace and pool cleanliness of rooms and common areas location- walking distance to most things and tube Most staff helpful apart from the odd one spanish style decor with even chandeliers in room negative points: Even though we booked a business classic room, no tea or coffee facilities were available even though previously having this. I asked as reception and was told it is not available lacked attention to detail to maintenance issues The Club room has changed location from previous years and although it was handy to watch the pride parade outside ( although they closed the room promptly on time at 11pm even though parade still in full swing- no flexibility) lacked soul or anything luxurious. Looked more like an old people's home lounge tips get tube from airport - easy for breakfast or just for a snack- walk across the road and down the street to a \"museum of jamon\" ( not a museum) You can get a delicious cheese and ham sandwiches for 1.5 euros and coffee and ham sandwiches for 1 euro each mixed views- may be worth paying for access for the club room especially if you are visiting with friends. I hope management improves the environment however similar to the previous club room with carpets and a bar with beer on tap with the suggestion of added local wine Ask for larger room. Double glazing in all rooms so noise not an issue with traffic Take swimming costumes/trunks goggles-towels provided", "Date": "July 11, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Charleston, South Carolina", "Title": "“Horrible hotel, great locale”", "Author": "FlyerCG", "ReviewID": "UR134050936", "Content": "The staff is friendly, if not helpful. The rooms are small, well worn and INCREDIBLY NOISY. I have spent a lifetime in hotel rooms, and I regularly sleep with earplugs, but this place is awful. There is a sizable gap under every doo, and I can assure you, you will hear every conversation (and more) in the hallways and rooms surrounding your own. Plus, there is tons of construction going on in the hotel right now. I was asleep (8 a.m.) and heard someone outside my window (5th floor). A workman was tearing my window out to replace it! I complained to the front desk, and they assured me that the work would be done in the next few hours! \"You should be up anyway.\" Noted. At least it was expensive.", "Date": "July 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London england", "Title": "“Great location”", "Author": "silverwedding", "ReviewID": "UR133961240", "Content": "We stayed here for a weekend break in June. We booked a Club room, but not sure if that is what we got! The first room we were given had doors to the balcony that didn't close properly and we were moved to the 8th floor, which was a much nicer room. The location is excellent - within walking distance of all the major sights. We didn't have breakfast here as they wanted 19 euros per person, but there are lots of places to have a quick breakfast a few minutes walk away. The pool is a great asset - just a shame they can't do something about the pigeons! Would definitely recommend the hotel.", "Date": "July 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Greve, Denmark", "Title": "“Fantastic location and splendid hotel”", "Author": "Linda R", "ReviewID": "UR133865108", "Content": "Superb hotel in the middel of Madrid. Close to shopping, restaurants, sights and best of all, the swimmingpool on the rooftop, after an long day wandering around the city. Drinks are a bit expensive.", "Date": "July 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Madrid", "Title": "“City Break”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR133854903", "Content": "We had a lovely time at the Emperador Hotel Madrid and would stay again. The service was great at all times and the only slight negative comments would be that the club room facilities were not always topped up,", "Date": "July 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Nottingham, England", "Title": "“Could be so much better”", "Author": "betterthanwork", "ReviewID": "UR133609747", "Content": "Stayed 4 nights in a Club room first week of July. Grand reception area, no issues checking in. Club room acceptable, but smaller than expected. Good view over Gran Via from 6th floor. Double glazing keeps out most street noise, other than the numerous emergency vehicle sirens - take ear plugs! Breakfast not included with my booking, so chose to eat out and also did not buy any food or drink due to the high prices (€11 for a cocktail). Did make use of the Emperador Club, which was nice and cool after a day's walking, but as every one else has mentioned, a poor selection and limited supply of drinks available. Only used the rooftop pool for short bursts. Busy on the Sunday, but quieter in the week (approx 100 sun loungers). Limited natural shade available as no umbrellas.", "Date": "July 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "San Pedro, CA", "Title": "“Needs some maintenance”", "Author": "Coach-on-the-go", "ReviewID": "UR133426817", "Content": "I stayed a weekend here. The price was 4 star, but the room just missed the mark. We thought the room was pretty nice and spacious, except it had water damaged and mildewed wall paper below the AC vents. Housekeeping didn't replenish our toilet paper. The 1970's toilet had to be fixed while we were there. There were a few things included with our price. The pool area was very nice with chairs and a bar, and the gym built for 2 people was adequate...for two people at a time. Everything else had a steep fee (breakfast, WiFi). The staff up front were very nice and helpful. I just wish our room was a little better maintained.", "Date": "July 4, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Zürich", "Title": "“Worst hotel i've ever been”", "Author": "Oudebrunink", "ReviewID": "UR133421443", "Content": "The Emperador hotel in Madrid is one of the worst when not the worst hotel I’ve ever seen. The rooms are very small fort he price you have to pay and also dirty. The rooms are far overpriced and don’t have the quality you expect and they promise you. The rooms are small and you have hardly space to put your suitcase. I stayed in this hotel 5 nights and non of these days the room has been cleaned. The staff doesn’t know how to serve people and how to deal with complains. The first thing they say it is he fault of the customer it self. The Emperador hotel uses a card system as a key to open your room. In the 5 days I stayed there three times I as no able to open the door and had to go down to get a new card. Even when I came home late I was not able to get in the room and had to wait long before I was able to open the door and go to bed. Of course they claimed it was my fault. I would have kept my card to near my cell phone. I can tell you this wasn’t the case. Also three friends of mine, who stayed in this hotel, had two times he same problem. The management of this hotel is incompetent too. I tried to have a normal conversation with the manager but this as impossible. The first thing she does is to blame the customer he/she made a mistake. Never did the hotel. I WOULD ADVICE EVERY ONE NOT TO BOOK A ROOM IN THIS HOTEL. YOU CAN EASILY FIND A FAR BETTER HOTEL FOR A LOWER PRICE IN THIS WONDERFUL CITY.", "Date": "July 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Nyon, Switzerland", "Title": "“Perfect location”", "Author": "Toffeeman1878", "ReviewID": "UR133329776", "Content": "This hotel is great. Managed to get a cheap deal through a website which made a big difference - the walk-up rates are very expensive. Everything other reviews say about the roof-top pool is correct - it's beautiful and clean with plenty of sun loungers and a bar with excellent food and service. The room was ok. It was a little on the small side but was clean and had mini-bar, tv, air-con, safe, nice large wardrobe and plenty of storage. The bathroom was a decent size with a good power shower. The location makes this hotel perfect though. It's right next to Santo Domingo metro and 2 minutes from Plaza d'Espana metro. It's perfect fr walking around central Madrid and seeing all the attractions of this beautiful city. Overall, providing you can secure a decent rate it's a great hotel...", "Date": "July 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Roof Top Pool and Lovely Staff”", "Author": "felicity M", "ReviewID": "UR133221363", "Content": "My partner and i were staying for a long weekend with another couple in the middle of summer. We spent most of our time beside the pool over looking Madrid. Sipping cocktails. Fantastic Location. Minets away from a gorgeous city park, trendy bars, City center shopping. You could really ask for anything more.", "Date": "July 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Barrow-in-Furness, United Kingdom", "Title": "“god send roof pool in the city”", "Author": "becky292210", "ReviewID": "UR132730045", "Content": "we have just stayed at the emperador hotel for a weekend city break , party of 3 couples, this hotel is right in the centre and you can walk from here to most of the great sites in the city, or just get the metro which is just outside the hotel, the rooms where of average size, clean and decor was ok, the building is a old one, but looks great, our room had a showe and a seperate bath which was a bones, but the main selling point to me is the roof pool, this was great to relax before and after sight seeing , it was great on the last day as we had a late flight, we just put our bags behind reception and doshed at the pool for the afternoon, if your traveling from the airport by metro get of two blocks down the grand via at stop plaza de espana and walk up this way you just get two metro lines , line 8 then line 10 from the airport, as no point getting the third line line 2, for one stop to demingo as , its only two blocks up the grand via from espana, if i go to madrid again i would use this hotel", "Date": "June 25, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Lancashire", "Title": "“Great location, the rooftop pool makes it!!”", "Author": "Ker085", "ReviewID": "UR132599958", "Content": "Have just returned from 4 nights in the Emperador and had a brilliant time! Would definitely recommend this hotel! It is very easy to get to Plaza de espana (1 metro change and only a few minutes walk from hotel) for 4.5euros per person, taking around 30minutes. The staff were very helpful and friendly throughout our stay. After asking to change rooms, due to a dull wall view room, we were told we could do the following day which we were happy with and glad we did as we got a city view room on the 7th floor which was lovely and more modern. The room was clean, bed was comfy and it was very quiet. We were slightly disappointed with breakfast, not realising that it was continental and would cost more for the hot buffet and the staff were not very attentive, but the coffee was good and we made up for eating in lovely places throughout our stay. The rooftop pool is lovely and it made our stay as it turned a city break into a relaxing summer holiday at the same time. There are plenty of sun loungers and towels. The pool is cold but very refreshing on a hot day and the views are amazing!! The hotel is located on the busy Gran Via with plenty of places to eat and drink and feels safe even at night. Head to El Corte Ingles (supermarket) for bottled water, only 32cent for 2litres. Turn left out of hotel and cross the street to find La Surena, sit outside and enjoy a bucket of beer and tapas for only 9euros. Go on a thu for Doble mania(2 tapas for 1). They have another in Cava Baja and just outside Plaza Mayor. TGI Fridays (close to La Surena) have happy hour Mon-Fri 5-8pm so a good starting point close to the hotel for a night out. We ate at many different places and think the best way is not to plan in advance and just see what you think looks good. We loved Cava Baja (a MUST at night,15min walk from hotel in Latin quarter). A street full of tiny little tapas bars where you can have a drink and a tapas then move on. We did the Madrid City Bus Tour which cost 20euros per person and we bought our tickets from the hotel reception. You can catch the bus across the road from the hotel, outside KFC, and can get on and off as you please. There are 2 routes and the ticket lets you do both. We chose to use this to get to Bernabeu Stadium which was a must see and enjoyable tour. Madrid is beautiful and there is lots to see including the Ratiro Park where you can hire a rowing boat for under 5euros for 45minutes which was lovely. We were a little concerned about pick pocketing but had no problems. My boyfriend carried is wallet in his front shorts pocket and I had a shoulder bag which I kept my hand on at all times, maybe sounds a little over the top but it was safe. Best to be aware of your surroundings at all times and during busy areas or sitting down outside keep hold of your belongings and you should be fine. We really enjoyed our stay and would definitely recommend Madrid and the Emperador!", "Date": "June 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Disappointing!”", "Author": "Lezmark13", "ReviewID": "UR132579226", "Content": "This was the second time we'd stayed at the Emperador. It's well-situated and we like the fact that it has a rooftop pool. The hotel isn't the most funkily-furnished property in the world, but it's got a certain taste of grandeur and history that we liked on our previous visit. Check in was quick, and even though we arrived late morning and weren't expecting to be able to access the room till later, it was ready for us. We'd booked a Club Room as the holiday was to celebrate an anniversary, and the room itself was large with a view of the Gran Via. What was disappointing was the Club Lounge - to quote the website, \"the exclusive private VIP room Club Emperador, offering an inviting ambiance, a magnificent view of the Gran Via, high-tech facilities and a variety of beverages.\" It was tired, small and the variety of beverages extremely poor - soft drinks, beer, vodka, two different types of peach liqueur, and another couple of random spirits. There were wine glasses and no wine...We stayed an hour and a half, with a group of around 5 English businessmen at close quarters talking loudly about their work (not their fault, but the room was so small that it wasn't really condusive to an \"inviting ambiance\"). No staff appeared during the time we were there, to replenish anything or tidy up. To cap it all, they were setting up a function room next door, so we were treated to furniture getting hauled about and loud bursts of music as they did the sound checks. Don't waste your money by upgrading to the Club Rooms at this hotel if your reason is to enjoy the Club Lounge - you'd be better off heading for a Madrid bar with the moneyyou save, as you'd have more drinks choices and a far better atmosphere. The Emperador could learn an awful lot from Marriott and Hilton as to how an executive lounge should be run. Check out was a long process as there are only 3 checkout desks, so took around 15 minutes. All in all, not the best hotel experience we've ever had.", "Date": "June 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great central location, rooftop pool overlooking the city”", "Author": "Anne W", "ReviewID": "UR132558861", "Content": "Stayed here for 3 nights when visiting Madrid to see Bruce Springsteen. Hotel easy to reach from the airport on the metro. Room & bathroom was v spacious, with a great shower. Room v quiet despite overlooking the main street. Central location with easy access to more than 1 metro station. Highlight was the rooftop pool with great views over Madrid, tasty food and refreshing cocktails to be enjoyed by the pool. Staff v friendly. would definitely stay at this hotel next time I visit Madrid.", "Date": "June 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kilkenny, Kilkenny, Ireland", "Title": "“Great Loacation”", "Author": "Sinead B", "ReviewID": "UR132450257", "Content": "Spent 3 nights here. 3 of us shared the room and found it very spacious. Staff were very friendly and helpful. There's a choice of 3 or 4 different Metro lines within walking distance from Hotel. Less than 20mins Metro ride has you at the airport. Did not have breakfast in the hotel but found a restaurant (VIPS) within walking distance which offered a good choice including vegatarian and cost less than €7 each incl tip. Rooftop pool was excellent", "Date": "June 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leicester", "Title": "“Great Hotel”", "Author": "GlenParvaRich", "ReviewID": "UR132329128", "Content": "Spent 3 nights here. Ideal central location on the Gran Via, easy to get to on the Metro from the airport. Room was clean,staff were friendly. Rooftop pool was excellent - great to spend an hour or 2 there after a days sightseeing.", "Date": "June 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Great location”", "Author": "anonymousbrighton", "ReviewID": "UR132264266", "Content": "We had 3 nights in a standard double room. The room was a bit basic & while the decor was tired, the room was, as requested , in a very quiet part of the hotel. The bed was a bit hard ( we did ask if we could change rooms or upgrade but the hotel was full). The staff were really helpful, giving directions, recommending restaurants & making telephone bookings for us. We took our own travel kettle as there weren't tea of coffee making facilities in the room. The rooftop terrace and pool was a godsend ( even if the pool was freezing!) in the hot weather and while busy, we always managed to find beds and some shade. Access to the metro is excellent. Taxis to and from the airport only took 15 mins approx ( around 25 - 30 euros). We didn't eat in the hotel: lots of restaurants and cafes close by. If you're used to boutique hotels then this is quite basic but the location makes up for it.", "Date": "June 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "essex", "Title": "“Great location but choose your room”", "Author": "thingx", "ReviewID": "UR132258609", "Content": "You need to ask for a room with a street view here. Our room looked directly onto a service courtyard and we didn't see daylight all the time we were there. Our friends had rooms overlooking the street and they were larger and lighter. There are also rooms with small balconies, which are even better and were the same price. The rooms were clean. The beds comfortable and we found the staff very friendly and helpful, apart from the waiting staff in the breakfast room who seemed to be totally indifferent unless the supervisor gave them a bit of a kick. The pool was a great bonus here but unfortunately, if there is a wedding or other function, it closes early and hotel guests are booted out. Check before you book! I would book here again but would be a bit specific about my room requirements.", "Date": "June 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“In the action”", "Author": "aussiesinspain", "ReviewID": "UR132076393", "Content": "We had a great 3 night stay in a Junior Suite overlooking the Gran Via. We booked the suite because we were 3 adults and a child, and it was large and beautifully appointed. like others, we arrived from the airport by metro and couldn't believe it when we popped up almost at the front door! The metro is not seamless, by the way. Two line changes are required so it is not easy with luggage -- but quite do- able. There was some street noise but this can be negated at night by closing the windows. The street noise and scenes actually add to the excitement of being in Madrid. We found the staff pleasant and the breakfast very good. The rooftop pool is large and deep and there are plenty of sun chairs. It is as freezing as the ocean! I have no idea why but it makes for fairly short dips! I imagine it would be fantastic in July and august. I think there are probably good and bad rooms in this hotel. The website is clear about room features and prices so you can book with your eyes wide open.", "Date": "June 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "United Kingdom", "Title": "“Well worth staying here”", "Author": "Janey1UnitedKingdom", "ReviewID": "UR131954513", "Content": "We visited for 4 nights in June and found the hotel to be very good. Not sure why others have made such negative comments as we we had no major to complain about. As others have stated it's about 50 mins on the metro (4.50 euros inclusive of airport supplement) to either Plaza De Espana (uphill walk) or Callao (downhill walk) both about 5 mins. Directly outside the hotel is Santo Domingo station but you will have more underground changes to get to this station. The hotel is in an old building and the interior decor befits this and is located centrally to get you anywhwere within Madrid, either on foot or by public transport. They are putting in new double glazing on one side of the hotel so scaffolding is evident. The reception is bright and clean and the reception staff were lovely. Our room was on the 3rd floor and faced the main street but due to the double glazing we could not hear any traffic noise. There was a flat screen tv, kettle and bathrobes in the room. The bed was a little on the small side. The bathroom had a hairdryer, bath over shower and toilletries that were replenished daily - even conditioner! Clean and modern. Of course the roof top pool is an added bonus, with lovely views and plenty of loungers. There is a bar there also. The pool is open until 9pm. We did not eat in the hotel, but the price of drinks were those of any city hotel. There are plenty of places to have breakfast nearby at cheaper prices than the hotel. It is easy to walk around Madrid but the metro is great too. It costs 1.5 euros per single journey, these can mount up so the tourist travel card for 13 euros for 2 days is good value. I wish we had bought it. A great restaurant we found was Casa Mona near the cable car. Just walk right from entrance and it's up a few streets along. It was trendy, quirky, full of locals and the cheapest and best food we had. I have no problem in recommending this hotel and would stay again.", "Date": "June 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Killarney, Ireland", "Title": "“Highly reccommended”", "Author": "Ritaod", "ReviewID": "UR131844173", "Content": "Two of us stayed here in June and found the hotel to be very good. It's easy to get to from the airport, 4.50 euros fare on the metro, took about 50 mins, (metro Plaza de Espana). Very well located, walking distance to everything. Rooftop terrace a definite bonus to relax after a busy day sightseeing. Room was great- a good size and nice bathroom . There was work being done on the outside so you couldn't open the window because of scaffolding. Expensive to eat there though, 2 ice creams cost 9 euros!! We also hired bikes from Bravo bikes.We took a city tour with them for 3 hours for 25 euros. It was excellent, very entertaining and informative. Overall a great experience.", "Date": "June 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“central location perfect for short break”", "Author": "icklebeck", "ReviewID": "UR131765764", "Content": "this hotel offers a perfect location for a short stay in the city. Main metro lines within few minute walk. don't bother with breakfast as plenty options around the hotel for far less than in hotel. pool and terrace is amazing offering fab views and place to chill. would stay here again!", "Date": "June 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "newcastle upon tyne", "Title": "“What are people complaining about?!!!”", "Author": "andrewlodge77", "ReviewID": "UR131653035", "Content": "I really don't understand the negative comments this hotel has had. It is a beautiful old building on a fantastic street in an amazing location, and the inside fits perfectly with this. Our room was a good size with a decent clean bathroom- cleaned and refilled with toiletries every day. The staff were always helpful with us when we asked advice. Can't comment on the food as we didn't eat there- why would you when madrids restaurants are all around you. Rooftop pool was a great way to end a day of sightseeing- drinks expensive but to be expected. Great trip, great city, great hotel!", "Date": "June 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Haywards Heath, United Kingdom", "Title": "“Under refurbishment”", "Author": "up2eleven", "ReviewID": "UR131609037", "Content": "We booked this hotel for 5 nights but had to check out after the first night. There was a whole series of problems but the biggest ones were as follows: They have scaffolding up outside the building and the construction work starts at 8AM (very noisy). Parking costs €30 per night and there is very little alternative. Wifi is slow and expensive. Rooms are very dated. What they call a triple room is more like a double with a camp bed crammed into a corner. They cannot do interconnecting rooms for families with 4 kids (they told us on the phone we could but then when we arrived they said they had no such rooms). The lifts take ages (I don't just mean a couple of minutes) to arrive. There is a window in the bathroom which a toddler can easily open by standing on the toilet. The window opens onto a sheer 10 floor drop in some sort of internal space. We had to block the bathroom door just in case. In fairness to the staff, though, they were not surprised we wanted to check out and whilst they were indifferent they were not rude.", "Date": "June 9, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Nice hotel...shame about the staff”", "Author": "amazingmuppet", "ReviewID": "UR131535006", "Content": "The hotel is easy to find and in a perfect location. The hotel looks as if it has been recently refurbished but on closer inspection, it is clear that corners have been cut. The hotel pool is definitely the selling point with this hotel, there are plenty of sun loungers but unfortunately there are plenty of hotel guests so finding a spare lounger is difficult but not impossible. The staff in reception are the rudest people I have had the misfortune to come across. They can't understand the simplest requests when checking in and prefer to argue with customers when we discovered charges on our bills that weren't ours. The manager was just as bad as the staff.", "Date": "June 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ochiltree, United Kingdom", "Title": "“Centrally located posh hotel”", "Author": "mkkk64", "ReviewID": "UR131494351", "Content": "We only stayed one night but were very lucky with the weather and managed to make use of the roof top pool. They provide a towel for the pool and there were plenty of sunloungers. The pool was a welcome relaxation after a days walk around Madrid. Breakfast was expensive so we skipped it and being central there was loads of choice to eat out!!! The room and ensuite was spotless.", "Date": "June 7, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Great Stay”", "Author": "joannegromito", "ReviewID": "UR131421807", "Content": "My friend and I have just returned from a long weekend in Madrid. Read all the reviews before we went and decided to stay here as the location was good. We were expecting an awful room, rude staff, hard beds but didn't experience any of the them. We couldn't understand why everyone was complaining. We had a good sized twin room, lovely bathroom, okay the view was of the back of the hotel but we didn't spend any time looking out of the window! The breakfasts were fine and the staff efficient and helpful. The reception staff were very helpful and polite. We enjoyed the roof top swimming pool, sunbathing area, which was great to relax in after a hot day in the city. It's a shame the hotel is having poor reviews,our advice would be, try it and see.", "Date": "June 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Emperor of the Grand Via”", "Author": "MarkPLondon_UK", "ReviewID": "UR131393814", "Content": "Had a 3 night family break in Madrid at Emperador over the Jubilee weekend. We had two connecting rooms with a discount rate with Hotel Direct. Breakfast not included but overall good value. Rooms were OK. Good beds, hot water and TVs but a bit dated and no view. Lifts were slow. We had breakfast one morning; food and selection good but very expensive (EUR 20 each). Better to use nearby cafes for coffee & pastries or chocolate & churros. The location is excellent - 5 mins walk to Sol, 10 mins to Plaza Mayor and tapas in Plaza Santa Ana. We walked to Prado, Royal Palace etc and easy access to airport via Plaza de Espana metro. There is an outstanding rooftop pool and terrace which makes this an excellent place to stay when it is open from June to October. Probably needs a refurbishment but we would return given pool and location.", "Date": "June 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Good central location”", "Author": "Sue H", "ReviewID": "UR131343492", "Content": "Found location convenient to whichever direction you were headed, close to Metra stops and tour bus stops. Room was fine. Roof top pool and bar great place to relax in the afternoon. Staff not overly helpful, but not outright rude, either.", "Date": "June 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Austin, Texas, United States", "Title": "“Good location, not so nice rooms”", "Author": "Sarah M", "ReviewID": "UR131161541", "Content": "This hotel is in a good location, but the room was pretty bad and the lobby reeks of smoke all the time. The room was tiny, the bed hard as a rock, it smelled like sewer in our room. There was a\"mini bar\" in the room which consisted of a tiny refrigerator which didn't work. Wifi was available but cost $5.00 for 30 minutes!!!! The only decent thing about the room was the bathroom. The pool area on the rooftop is nice but isn't enough to makeup for te rest of the shortcomings.", "Date": "June 2, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Ireland", "Title": "“Rudest and most unmannerly staff I have ever encountered in all my travels.”", "Author": "Ann B", "ReviewID": "UR130284814", "Content": "My daughter and I stayed at the Emperador Hotel the first week in May. It was our first mother and daughter trip away and we were looking forward to it with great anticipation. The hotel was recomended by two sets of friends who we knew are very fussy where they stay and even though it was a few years ago when they stayed there, they were both very happy with the product. On their advice I also upgraded to the Emperador Club status which gives you an upgraded room plus complimentary drinks plus snacks & newspapers while you are staying there. The hotel itself is in a very convenient location - reception was decorated very nice and everything was very shiney and clean. However that is where I have to finish with the compliments as it the first time I have had to write a bad review like this - but I'm afraid someone at this hotel needs to hear. In all my travels around the world and in all the hotel's from 1 to 5 star grades that I have stayed in I have never ever come across a ruder and less helpfull set of staff in all my life. From the time we booked in to the time we left, it was like as if it was a burden or beneath them to answer simple mannerly questions not only to us but to several other guests we met while having our 4 days stay at the hotel The morning we arrived I asked for a recomendation for a nice restaurant for lunch as I wanted to treat my daughter to somewhere special on our first day in Madrid. The gentleman ( I use that term loosley) who was checking us in waved one hand in the air, and said \" Out the door, turn right and there's lots of nice restaurants up there on the plaza. When I asked him very quitely and mannerly could he recomend one that did good food with good service - his reply was \" They're all good \" . At this point let me reliably inform that same gentleman that they are NOT all good. However in a lovely art gallery just down from the Grand Via a very nice lady was more than helpfull, directed us to exactly what we were looking for. I would also like to point out that we were'nt even asked would we like help with our bags upstairs when we were booking in, which for a 4 come 5 star hotel is most unusual. That evening when we came back we went down for what we thought were our complimentary drinks before bed, only to be asked to pay. I informed the waiter that we had upgraded to the Emperador club and thought our drinks were complimentary - to which he replied - \" NO, your in the wrong place\". I asked where we were supposed to be and he said \" Ask at the reception\". So back up again I went to another Mr. Happy at reception who told me that I should have been told all this when I checked in. I told him that it was our first time both in Madrid and at the hotel and that we were told nothing but our room number when we had checked in that morning. He then tried to pass it off with another sweep of his hand saying that all the information was in the room. I told him the only information in our room was a book on the phone desk about the sights to see around Madrid. He then very abruptly then said \" Well it does'nt matter the Emperador Club is now closed for the night. So I paid for our drinks and went to bed. We eventually did find the Emperador Club the next evening after we came back from sightseeing - but - if your expecting the full selection of drinks they advertise on their website then you will again be very disapointed. If you dont drink Gin, Scotch, Beer or some very sweet Peach Liquer then you are out of luck, because those plus some soft drinks and water is all they have available. I did ask a lady who was there servicing the Club was this the full selection and she said yes. So if you, like my daughter and I, happen to drink wine then take my advice and dont bother upgrading to Club because it's a waste of money. However the last straw came the morning we were checking out and I was paying the bill. I, as I always do asked for a print out to keep for my records. I would like to say that the receptionist handed it to me - but unfortunately she did'nt. Instead she plonked it down very roughly in front of me with a pen alongside it. I presumed she wanted me to sign it and asked her where she wanted me to do so. Abruptly she said she did'nt need a signature, just my credit card which I had in my hand. I was just leaning forward to hand it to her when she abruptly snapped it out of my hand - and I do mean snapped. To say that I was left speechless is an understatement and my daughter who was standing behind me came forward and asked \" Did I just see what I saw her do\". I said yes and my daughter immediately asked for a comment card. At this stage the receptionist got very flustered and said at first that they were in the rooms. When my daughter told her that there was no information what so ever in our room she miraculousley found one which we filled up and posted at the desk. I really dont know if it was any use filling that card in because I doubt if it was ever even read as neither I or my daughter has heard anything back from the hotel as of yet. Please dont get me wrong Madrid is a beautiful city with very fine architecture, art galleries, bus tours and shopping and we did have a lovely time there - it's only a pity we stayed at the Emperador Hotel. I dont really dont know why they were so rude, whether it was the construction that was going on outside or whethere it was just that they were having a few bad days. What ever it was actually does'nt matter really because neither I or my daughter or any of my family or the friends that recomended it will EVER be staying at the Emperador Hotel again. I would also NOT under any circumstances what so ever recomend it to anyone else to stay there. Apologies again for the poor review but like I said before, this is the first time in my life that I felt I had to write such a bad review about such poor service. Unfortunately, with the exception of the housekeeping ladies ( who were lovely) I have never had such bad service in a hotel in all my travels in all my life.", "Date": "May 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Waterlooville, England, United Kingdom", "Title": "“Great central hotel”", "Author": "Sarah B", "ReviewID": "UR130262584", "Content": "We had a large triple room which was very nice, with traditional decor. The pool area is great but the pool is freezing and drinks expensive. The food at the pool area is nice and reasonably priced, we did not eat in the restaurant, why would you when you have the whole of Madrid on your doorstep.", "Date": "May 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Jordan", "Title": "“4 stars??”", "Author": "munir123", "ReviewID": "UR130256821", "Content": "I stayed there in 2009 while on a business trip, I have to say the location of the hotel is amazing, the hotel is nice, clean, especially the bathrooms, which are very very clean. But I don't consider it as a 4 star hotel due to 1 reason, the rooms are soooooo tiny, I was shocked when I entered the room, I've never seen such a tiny hotel room in my life.", "Date": "May 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Use as a base to explore the city.”", "Author": "Raymond S", "ReviewID": "UR130158358", "Content": "A bit showy (plush lobby, gun-toting guard) but underneath the glitz a standard hotel that is useful as a base to explore the city. Rooms are reasonably appointed - mine was a bit cramped for a double - and comfortable. Other than a noisy guest next door at 2.30am, I have no complaints. We got a good weekend rate that included a complementary bottle of (cheap but not nasty) bubbly on the first night – we had several parties in the three rooms we used. Breakfast looked expensive, so we used the very nice Pain Quotidien just up the road. The rooftop pool - the hotel's only USP - opened the weekend we were there. It was still too cold to use though. It looks lovely - very deep - but is, I would imagine, only usable in high summer when the roof will be mobbed with guests. Fine as a place to lay your head after a hard day's sight-seeing and evening's eating and drinking, but not really an event in itself.", "Date": "May 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“A fine, centrally-located, weekend break hotel with a couple of positives and negatives”", "Author": "FoodWineHols", "ReviewID": "UR129649244", "Content": "I'd actually rate this hotel 'good' but it errs more towards very good than average. Our room was very spacious, with a large entry corridor, big bay window and high ceilings which had a lovely old chandelier that added some vintage glamour. It was certainly bigger than your average hotel room. It had begun to look a bit tired - old curtains and carpet etc, but not desperately in need of a refurb..yet. The two let-downs were, firstly, the bathroom had a bad smell of drains. We considered moving but we were only there for two nights and figured we could stick it out. Secondly, we had a nice view of the street below, but that meant it was quite noisy - general traffic and horns beeping etc. Again, not a dealbreaker and we stuck it out. Upsides are the location - if you don't fancy the short walk to most sights, the metro stop is right outside. Anywhere that still has coffee/tea facilities in the room also gets a bonus point in my book - too many places these days don't! We went on the romantic deal, which includes a bottle of cava, which was very nice and pretty good quality. I would probably stay again, but might look at other deals elsewhere first. We originally booked here as it's one of the few hotels in Madrid with an outdoor pool, but in the event it rained anyway! In short, you can't go too far wrong if you're looking for a city-centre base when exploring is more of a focus than where you're staying! I'd say it's got one or two more years before it needs an extensive refurb.", "Date": "May 9, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“My first visit will be my last”", "Author": "xon", "ReviewID": "UR129533039", "Content": "The room on the eight floor was noisy- it was possible to hear clearly what was going on next door. Worse, the staff were inattentive and, on one occasion, downright rude. Breakfast was quite good.", "Date": "May 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Crawley, United Kingdom", "Title": "“Great location, but rooms a bit tired”", "Author": "AirlineFreak", "ReviewID": "UR128316329", "Content": "We booked this hotel for our Easter break in Madrid, since it was the best value among central hotels, but we only realised quite how central the location was once we got there. Right on the Gran Via, which I would say is on the nothern edge of the core of the city centre, within walking distance of everywhere. In our booking, we had requested a double bed, but we were shown to a room with two single beds. When enquiring about whether we could change rooms, it was possible, but we were told that we had been upgraded to a junior suite and another room would be a standard room facing the interior (the suite was facing the Gran Via). We therefore decided to stay, thinking we could push the beds together, but it later turned out that the beds were screwed into the wall (!) and immovable. At that point, we had used the room and it felt too late to change our minds and move anyway, so we ended up sharing a single bed the first night and sleeping in separate beds the second. Not ideal. The room was large, although it was of course a suite, and the bathroom was very nice. Good shower. The room decor was a bit dated and tired, though. If I had booked and paid for a suite in a 4-star hotel in a prime location, I probably would have expected more. Even at the rate we paid, one might have expected a more modern finish, but I appreciate that we booked during the expensive Easter period and that rates might be lower at other times. Staff were very nice, courteous and helpful at all times. My girlfriend speaks Spanish (and I kept quiet), so I don't know how it would have been if speaking English. The place has great potential. I would say it is currently a hotel with a four-star location, four-star service, but three-star rooms. However, I wouldn't be surprised if the hotel will be refurbished soon.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Windsor, UK", "Title": "“Solid choice and superb location”", "Author": "GBR007", "ReviewID": "UR128292766", "Content": "I stayed here for two nights as a base whilst on business - arriving Thursday night at 10pm - quick front of house service and installed into my room and then downstairs for a late evening drink all within 5 minutes. My room 703 was fine - a bit small - internal views! But the bathroom was fine, the room spotlessly clean. We booked through Trail Finders and our rate included breakfast. This was fine, a good range of hot and cold foods, ideal for loading up on fruits ahead of a busy day, the coffee was good too, service friendly, brisk and unobtrusive. Emperador has a superb location - perfect for theatres, museums, shopping - Madrid is a immensely walkable city and this hotel has an enviable position. Just 300 meters from metro stations - Euro 2.50 to the airport - leaving the hotel, you will be in the main terminal building within 35-40 minutes, incredibly easy. I have stayed here and also at the Radisson Blu (just a short walk from the Prada) - Emperador beats the Radisson for location, the latter is a better choice for chic rooms - make sure you get a breakfast deal for both! Final point - excellent concierge service both on arrival and also in holding baggage on the Saturday whilst we visited Real Madrid stadium.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Jundiai, SP", "Title": "“Luxury hotel, great location, but noise and service expensive a lot.”", "Author": "Jundiai", "ReviewID": "UR128049366", "Content": "The hotel features a luxurious lobby, however, is impossible to sleep between 0 and 7 hrs, because any noise is heard in the room, very small and acoustic walls unprotected. The hotel is extremely clean, large bathroom. The positive point is the location, but everything is paid and very expensive, Internet costs 7 euros an hour, parking 30 euros a day. I could not sleep well before the noise in the room. I suggest that before analyzing the Mercure, Atlantico and Senator, who have even better location, The employees are friendly, but do not recommend the high price of the hotel with no benefit. There is also a rate of + / - 20% charged on the total stay at time of check out.", "Date": "April 17, 2012"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Leamington Spa, United Kingdom", "Title": "“Refused to take a phone booking”", "Author": "CustomerConsultant", "ReviewID": "UR127447444", "Content": "I tried to book this hotel by phone. The first time I phoned they said reservations were closed as it was a holiday. A day later I phoned the number on the website, followed the menu for reservations, spoke to reservations and was told that I could only book online! It appears I need a credit card to book and they cannot take numbers on the phone .. only over the web. I've never come across a hotel that refuses to take a booking by phone and wonder what else they don't do in this hotel .. supply sheets on the beds maybe .. who knows. So I phoned another Madrid hotel and was able to book over the phone!", "Date": "April 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Not far off perfect!”", "Author": "Hazman91", "ReviewID": "UR127362743", "Content": "The hotel was amazing, dead centre of Madrid, you couldn't get any closer to everything if you tried! Stayed in July 2011 and the rooftop swimming pool area was perfect for a mid-city quick getaway from the hustle and bustle of the busy city. The room we stayed in was a bit on the small side, and also faced the inside walls where the air conditioning extractors were located so instead of fresh air, all we could smell was other people showering. We also hardly got any natural light but we only spent nights in the room so it didn't bother us at all. I didn't see a difference between the 4* of this hotel and other 3*s i have visited in Spain. The breakfast was very good, with a very wide selection of choices and very filling until the afternoon. Overall the hotel was good, location was better than convenient and the staff were helpful when questioned.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "York", "Title": "“Excellent Hotel with helpfull receptionist”", "Author": "NorbertYork", "ReviewID": "UR126962767", "Content": "Having arrived late from London, check in was very fast with a warm welome. Altough room are of an average size, bathroom is very comfortable. Lifts, corridors and bedroom very clean. Breakfast service efficient food offer good. Breakfast coffee was disapointing as it was brewed too far in advance and tasted stewed.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good position, average hotel”", "Author": "Adrian K", "ReviewID": "UR126029203", "Content": "Position is excellent - 5 min walk from all the action. Rooms however are very dated and in need of an upgrade. Our air conditioning didn't work which made it even more uncomfortable. Definately not what I would expect of a 4 star hotel.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Average”", "Author": "maureen029", "ReviewID": "UR125761621", "Content": "Stayed for 2 nights. On the plus side the location is great and the staff were very helpful regarding directions etc. The hotel was very clean and tidy and our room was nice. Unfortunately the swimming pool was closed until May but this also meant the roof terrace wasnt accessible which was a disappointment given the views from the top were one of the reasons I booked this hotel. Beware of the scaffolding on the side of the hotel overlooking San Bernado. We didnt have any view! Also the taps needed running for several minutes as the water was brown. Loved Madrid and would probably return to this hotel but only in the summer months when the pool is open!", "Date": "March 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "burnley u.k.", "Title": "“no problems”", "Author": "davidcarol", "ReviewID": "UR125602458", "Content": "good hotel,size of room large and comfortable on 6th floor.Location good,nearest metro station 3 mins. walk away is Calleo! The bar-lounge is excellent if a little pricey but after walking Madrid all day was a beautiful relaxing place to unwind! Would use this hotel again!", "Date": "March 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Southampton, Hampshire", "Title": "“Location, Location, Location”", "Author": "christinejersey", "ReviewID": "UR125458163", "Content": "Just back from 2 nights in Madrid staying at this hotel. Pleased with our choice, fab location on Grand Via , one of the main streets in the city and within walking distance of all sites. Elegant, clean and with attentive staff. Room on small side and at back of hotel so no view but nice and quiet. Rooms at front apparantly are noisy from the street below. Breakfast was good, buffet, fresh and appealing and more than ample. Shame the roof terrace was closed, sign on reception states open May - Aug. Would have been lovely to sit up there at the end of the day with a drink and watch the sun go down - we had fab weather whilst we were there. There is this Emperador Club which no one tried to up grade or sell us. They have they own lounge area and an upgraded breakfast selection. No one seemed to take notice of the sign by the hot food at breakfast saying for Club guests only and people just helped them selves, even to the Champagne on offer! Great Taps bar , out of the hotel turn left and across the road. La Mario (or similar), 2 drinks, tapas and ice cream for 9.50 euros each. Would recommend the walking and Tapas tour we found on Trip Advisor, with Get your Guide. 3 hours, with food and drink for under 12.00 Euros and was a fun way to spend an evening and trying venues and food we would never had ventured into. Would recommend this hotel without hesitation, we got a good deal via Travel Zoo and the comp bottle of Cava went down well after a long day walking our socks off!", "Date": "March 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Stockton-on-Tees", "Title": "“good location”", "Author": "Chris L L", "ReviewID": "UR124140262", "Content": "Room was ok, but no kettle we needed to buy one. They said WiFi was 13 euro per day but we connected onto it without restrictions. Alternatively there is a Starbucks over the road. Breakfast, good service. We asked for some scrambled egg but that was 3.50 euro extra. Cleaner was keen to get us out the room at 11am. She had to come back but she left her what we suspect is her access all rooms key in our room!", "Date": "February 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "bellboycary", "Title": "“Great location, Small room, Poor breakfast selection, Spotty Internet”", "Author": "bellboycary", "ReviewID": "UR123976609", "Content": "PROs: Great location, walkable to most tourist spots CONs: Small room, spotty internet, poor breakfast selection The Emperador (Madrid) is in a great location. Very close to shops and a short walk to Puerta del Sol and Plaza Mayor (although this is a very walkable city regardless of hotel location). Good value for the price; however, there are trade-offs (see food comment). Lobby Small-ish lobby; the staff were generally friendly and helpful. Very small gift shop and a bar. Conference rooms on the 2 second and 'basement' floors (although the conference rooms on the bottom are windowless). The conference room was fairly poor as they had large posts in the middle room. Room Room was small but average per European standards. Bathroom was average size. Internet was spotty (24-hour purchase) and somewhat unreliable. I had a room facing the Royal Palace (away from street) so the street-noise was minimal. The Royal Palace lights can be bright but they turn off at around midnight. Furniture is modern. Food The breakfast buffet was very disappointing. They had a limited selection of cold/hot food and baked goods. There was an omlet stand; however, it appeared that you needed a special ticket for this (which was not obvious). In addition, the omlet chef was not always present to cook the omlet. Breakfast is definitely not this hotel's strong suit. Nevertheless, there are plenty of shops near the hotel. Surroundings Plenty of food and shopping are nearby. Very close to Sol, Mayor, and Plaza. A bit of a wak if you are going to Prado or the Park.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "liverpool", "Title": "“Good value, on balance..but not fantastic”", "Author": "jetflex", "ReviewID": "UR122790270", "Content": "Room was quite adequate, enough space etc..not luxury but just fine for me. The gym ? ... rubbish. Highlights: Staff..very very good! Location: Excelllent: Roof top pool, again not luxury but a very nice feature with cool views and comfortable loungers. This is not a luxury hotel, but staff and pool make it above average. I will stay here again if less than 80 euro a night! BoyI am getting mean.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "oklahoma", "Title": "“Good location for madrid tours.”", "Author": "Linworldtraveler", "ReviewID": "UR121989633", "Content": "Spent 3 days in Madrid. Wanted a location that we could walk or take public transportation from. This fits the bill. Found it difficult in Madrid to find that many people that wanted to talk to English speakers. Hotel inclueded. Breakfast was ample, room was of standard size with all the ammenities. All and all it was a pleasant stay.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bulgaria", "Title": "“Very pleasant stay! The roofpool is top of the pops!”", "Author": "duhku4e", "ReviewID": "UR120614317", "Content": "I had the pleasure to check in the Emperador last August, for four nights. Although it does not respond to the criteria for a Palace, this hotel certainly delivers high-level amenities and services. On the pros, I would rank the rooftop pool & garden & bar as THE plus to have. It was defining in my choice for booking at the Emperador at the first place. Imagine how comfortable it is to refresh yourself in the pool during the hot Spanish summer afternoons, and to enjoy a glass of sangria (a pure delight) in your chaise longue, while contemplating the outstanding landscape of Madrid from the 10-th floor terrace. The location and architecture of the building are also great: located downtown, (Gran Via avenue), it is at walking distance from every tourist attraction in the city. The subway station is located just in front of the hotel. The building itself is a mix of Imperial and art-deco styling, that brings an unquestionable charm to the spot. Rooms are spacious and comfortable, although with outdated furniture (especially for the bathroom). Ask for a terrace, you will definitely enjoy it. Staff is very helpful, polite and service-oriented. I got a late check-out upon simple request at the front desk. Finally, I could not enumerate many cons, except perhaps the outdated bathroom and the excessive price of Internet and drinks (Roof- and Lobby bar). Globally, it was a very pleasant stay. Fours stars +.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Great hotel, great location in Madrid”", "Author": "Lady_Worsley", "ReviewID": "UR120450563", "Content": "Hotel Emperador is easily accessable by the metro from the airport and only having to change once - well worth checking to arrive by the metro as the hotel is then a 2 min walk from the metro! €2 compared to €36 in a taxi! The hotel is well maintained, the staff were very helpful and happy to recommend places and restaurants, the staff spoke very good english. The Room I stayed in was huge is was a club room and to be honest I couldnt fault it, with the club room came the use of the club bar which is located on the 1st floor, smallish room but offered self service drinks and bar snacks. The Pool on the roof terrace is lovely with ample sunbeds and a great roof top view of Madrid. The hotel itself is greatly located on the Grand Via close to all the shops, plaza Mayor, the Palace is only a 10min walk from the hotel. Highly recommend the hotel.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great location, great hotel”", "Author": "boadiceactrice", "ReviewID": "UR120383820", "Content": "This is NOT a luxury hotel, it just offers some luxuries which you wouldn't expect. The rooms are a bit basic, but big enough, especially the bathroom it was lovely and big. The two amazing selling points about this hotel are the location (on the gran via, close to everything), and secondly the upstairs area with pool and sun lounges. The pool water is freezing, so being a wimp about the cold I didn't go in, but the terrace up there is so nice to sit on out there in the sun and have a glass or two of champers, so relaxing. I would come back to Emperador for sure! without a second thought", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Grenoble, France", "Title": "“Good Hotel, well located”", "Author": "Jose_Ruela", "ReviewID": "UR120145053", "Content": "Hotel Emperador is in Gran Via, walking distance to Plaza Mayor and other good places to eat and have drinks. Good bar services and very good restaurant. Their meeting facilities are very helpful for conferences and business. I have just one observation: they dont have standard rooms, i.e. if your got a bad room, ask them for a better one! Bad point: you have to pay extra for the internet.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“Excellent”", "Author": "loveholidays52", "ReviewID": "UR119430584", "Content": "We stayed at Hotel Emperador for our wedding anniversary and very much enjoyed our stay. The room was clean and the reception staff very attentive. We were given a free upgrade and a bottle of bubbly to celebrate our special day. Our room had a small balcony so we could watch the world go by and the room was air conditioned so we could shut the windows at night to escape the noise but still be comfortable. The location is very central - right next to a metro station and within an easy walk of the shops on Gran Via, and the old town and main tourist sights. Madrid is a wonderful city to visit, easy to get round, exciting and vibrant with an amazing array of restaurants and bars to choose from. I would highly recommend the Mercado de San Miguel for tapas and a glass of rioja. The Emperador has a gorgeous (if a bit cold!) roof top pool - great for sunbathing and cooling off after a morning's sightseeing. The only gripe I have is that the waiting staff at breakfast were a bit slow to serve us and the bar prices are somewhat inflated - soft drinks actually cost more than a beer.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Worthing", "Title": "“Excellent weekend break”", "Author": "WestSussexCaroline", "ReviewID": "UR119172824", "Content": "We had a very comfortable weekend break staying at the Emperador Hotel. It is very central and in walking distance of most attractions, restaurants and shops. The hotel staff are very friendly and polite. The roof top swimming pool really made it for me. After a morning walking round the Prado there was nothing nicer than a cool swim and sun bathe in the afternoon. The breakfast is good but there is no proper restaurant apart from the pool bar that had a small menu. This was good for us because we prefer to eat outside the hotel in one of the many excellent restaurants in the area. Beware that the tiny bottles of water in the mini fridge in the rooms is very expensive. It is best to buy your own bottled water from outside.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Crewe, United Kingdom", "Title": "“City break in early September 11...”", "Author": "julie g", "ReviewID": "UR119105801", "Content": "Madrid is fantasitc city and the old part of madrid is very beautiful, lots to see and lovely sights to take in. We stayed at the Emperador on the Gran Via expecting the traffic noise to an issue but it was fine. After all the walking no trouble sleeping. The hotel's location is probably its best asset. Drinks in the hotel bar were expensive. Continental breakfast ok but not really good. The availability of a sun terrace and small pool on the roof was nice however and we were able to catch a few hours in the sun after all the sightseeing. Fantastic cake shop on the corner of puerto del sol square. City tour bus really easy way to get off and see things, we enjoyed a trip around the Bernabau stadium that way. Stop across the road from the hotel, really easy. Very busy in the evenings, although thePlaza Mayor was lovely to visit and sit in at night. Food prices versus quality you find not great in the square itself. Down the side streets at the back resturants much more welcoming and spanish feeling. The supermacado of St stephens behind Plaza Mayor is a great busy and lively place to eat , drink or just people watch....", "Date": "October 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Haslemere", "Title": "“Dated hotel but central location”", "Author": "Pete_Gill_Haslemere", "ReviewID": "UR118523441", "Content": "Perfectly adequate. Room small, quite dark and unspectacular, but saved by good location and the pool and sun deck.", "Date": "September 24, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Don't bet you can make use of the pool!”", "Author": "Rene F", "ReviewID": "UR118350888", "Content": "Stayed over for three nights and for two days the pool was closed as of 17.00 hours for weddings . And the worst thing is that we were not informed about this by the hotel when booking for this hotel. Also on the 1st day itself we were not informed, so when we came back after sightseing Madrid and wanted to make use of the pool, this was not possible. After a lot of guest complaint about this, they told us that tomorrow there would be another wedding!!; such a nice surprice (not...). The management told us that they couldn't do anything about this inconvenience and I was expecting a bit more customer service/client relation from a 4* hotel what they pretend to be. I must say the location is great, but the hotel has lot a bit of its glance....", "Date": "September 20, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Inner city efficiency”", "Author": "Nick D", "ReviewID": "UR118158903", "Content": "The hotel is right in the middle of everything in Madrid. Easy walking to most areas, although the excact location is a little down-market. Not at all dangerous or difficult to get around. The hotel will give you upgrades to very large Jr. Suites for not a lot of money, well worth it. Very clean and well maintained. Room service was efficient and good. The rooftop pool is nice for the warm weather, adn not over crowded. A good bargain, but I'd rate it at the lower end of teh 4 stars in Madrid primarily due to the location and limited front office services.", "Date": "September 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cumbria UK", "Title": "“Great location, roof top pool”", "Author": "StevelCumbriaUK", "ReviewID": "UR118009982", "Content": "Stayed over a weekend and this hotel was very good. It's location is spot on for shopping, only a short walk to the Plaza de Oriente and bus stops outside (make use of the tourist bus) and the metro across the street. The rooms are clean and ours was quite. There are some great bars and restaurants in Madrid so you won't need to eat here, however the breakfast is good. The real surprise is a roof top terrace and pool. We'll stay again the next time we are in Madrid.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great pool and roof terrace. Ideal Location.”", "Author": "hbsource", "ReviewID": "UR117980948", "Content": "I stayed here after my girlfriend and I got a Groupon voucher. It was extremely cheap and we were slightly concerned about what the hotel would be like. We were pleasantly surprised. We were anticipating a small (Groupon appropriate) room and that's what we got. It had a view of an adjoining building but it was clean and the bathroom was OK and the bed was comfy. So can't complain there. The location was brilliant. Near enough to all the action. A short walk to most of the centre and close to a metro line. Easily the best bit of the hotel is the big roof terrace and pool. The views are brilliant and the pool is a decent size and the drinks are (fairly) reasonable. It really makes a difference being able to see out the heat of the day sunbathing in a nice spot next to a pool. It really added to our city-break.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "2.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Munich, Germany", "Title": "“Service Level Zero”", "Author": "UncleSamDavid", "ReviewID": "UR117703487", "Content": "We arrived from the airport by taxi. There is no porter at the Emperador and no-one helped us with our luggage. At Check-In, the receptionist greeted us with: \"Passport, Credit Card!\", wow, what a warm welcome! We made a few requests when booking on the Emperador website, simply none of them were recognized. We booked a junior suite, the room was spacious, well maintained and spotless clean. The room rate included access to what the hotel calls the \"Club Emperador\" with an alleged \"open bar\". In fact, it is a dark, provisional seperated area of what appeared to be an unused meeting room with a self-service minibar fridge and a very limited choice of no-name liquors. It doesn't even come close to the club levels of other hotels and it is not at all worth paying a higher rate. The rooftop pool was the main reason for booking this hotel, and we were not dissapointed. The service up here is very good, contrary to what we experienced in the other areas of the hotel. We travel a lot and we do understand that not everybody in the world speaks german. Therefore, we do communicate in english and I believe that is common standard pretty much all over the world, especially in the tourism industry. But when I was asking the receptionist a question in english, I got his answer in fluent spanish. Some people would consider this a rude behaviour - for us it is just one more example of the non-existing service level at the Emperador. We cancelled our stay after three nights and moved to a hotel that better fits our requirements. It was no surprise to us that at check-out nobody even bothered to ask why we were leaving early. They just don't care.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Prangins, Switzerland", "Title": "“Great hotel, very fancy and excellent location”", "Author": "Ilovetotravel155", "ReviewID": "UR117677810", "Content": "I stayed in the Emperador hotel for a long weekend. First big advantage is that it is super accessible via metro and bus - the stops are right there. Madrid has a fantastic metro/subway network and traveling around is very easy and cheap. The Emperador is a few metres away from Gran Via, next to all the shopping. It is really in the very heart of Madrid. The staff was very service orientated and kind - we came back one night at 5:30 in the morning and our key did not work and they solved it right away. They held our luggage after checkout with no extra charge and simplified our problem with that, with a big smile. The rooms are very correct and good value for money. We had a mini bar, a tv, closets. Rooms very clean and cleaning lady very assiduous. Probably the only bad aspect about this hotel is that the breakfast is way too expensive (19 euro) . so don't take your breakfast here (we didn't) - the city is full of options so don't waste your money. I highly recommend this hotel and will be definitely returning !", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Excellent, would definitely return.”", "Author": "foxylady065", "ReviewID": "UR117675281", "Content": "Arrived at the Hotel and had a swift check in by a friendly receptionist. Impressive spacious room on 6th floor. Fantastic roof top pool, excellent to have as we were there late August. Hotel is in an excellent location, we could walk to the majority of the main sights, also extremely easy to access the hotel by metro from the airport. Madrid as well was fabulous and the hotel made it an extra special trip.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Could do better”", "Author": "djanni11", "ReviewID": "UR117604761", "Content": "We chose this hotel because of the location and the roof top swimming pool. Only used the swimming pool once and for about 10 seconds as the water was freezing! It was June but what a disappointment ! The location is good but the atmosphere of the hotel radiates a kind of faded grandeur. We paid extra for a club room and expected a better standard accommodation, the really decor need up grading. The room was small overlooking Grand Via through a small window. In the club room you get nuts, crisps and ritz crackers. Soft drinks , beer on tap but no wine plus international papers Its not really worth the extra cost", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great Location & Pool”", "Author": "danspetson", "ReviewID": "UR117404008", "Content": "We stayed for 4 nights. The first room offered was a small, dark double room ( 415 ), we had actually requested twin beds, due to a back complaint, so I asked to be moved, which was done quickly. We ended up in 709, much lighter room and more spacious. The pool is definately the best thing about the hotel. The staff round the pool and at the bar are very friendly & helpful, shame the same can not be said about the staff at reception ~ though that may be somewhat unfair, as it seemed to be only a couple of the reception staff that were distinctly aloof & unfriendly. The beds are nice and firm, though the pillows leave a little to be desired ~ no spares in the room, but rang down & requested some addtional cushions. The in room FREE safe was a bonus. Flat screen TV in room, with CNN & sky news. Can't comment on hotel food, we ate breakfast a couple of doors down at El Jamon, their spanish omelette & coffee breakfast was only €3 ~ bargain. ( though price went up on Sunday to €3.50?!) The tour bus is definately worth doing, though 2 days are probably not needed, we did both routes in 1 day. Plaza Mayor is a great area. Was very surprised about the area off Gran Via near Mcdonalds where there were lots of sex workers!! Though feels very safe & not particuarly seedy, great place to just sit watching the antics. The hotel is easy to find, we took the metro from the Airport, which is huge, clean & quiet ( similar size to Heathrow ), take train to Nuevos Ministerios, then change onto line 10 and get off and Plaza de Espana, a couple of minutes walk up the road to Hotel, don't bother trying to change for station at Santa Domingo, just not worth it, you can see hotel from Plaza De Espana ~ aim for Lion King theatre. Fare from Airport just €2.50 and less than 30 mins. The pool does get very busy in the afternoon, there are a few really comfortable rattan pieces of furniture - which are very sought after!! Wifi not free - approx €13 per day!! This is a business centre with 2 desktop PC's, but you have to pay to use these too!! However if you have your laptop, there is a starbucks nearby & Mcdonalds, which have FREE access. Basement Gym on site, has all the basics. Be warned - anyone wanting to park here, expect to pay nearly €30 per day.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Chicago, IL", "Title": "“Great find in Madrid”", "Author": "teeby", "ReviewID": "UR117234760", "Content": "If you are looking for a good hotel for families in a convenient location in Madrid, check out the Emperador Hotel. We are a family of 5 with two teenagers and a pre-teen. We were vacationing throughout Spain and stayed in Madrid at the Emperador in July 2011 for 5 nights. We had an nice stay. The Hotel Emperador is well located right on the Gran Via next to the Santo Domingo metro stop and near the Plaza de España. It is within walking distance or a short metro ride to many tourist attractions, shops, markets, theaters and restaurants. We walked or took the metro everywhere it was very easy to get around. There is a Starbucks right across the street and a VIPS convenience store about 2 blocks heading south east on the Gran Via. Some nearby attractions include the Plaza Mayor, Monasterio Descalzas Real and Palacio Real. Check out the Mercado San Miguel near the Plaza Mayor for a good eclectic local dining experience. The hotel is classical style. If you are looking for a modern hotel, this is not it. The rooms were clean and well furnished. We stayed in 2 club level rooms it was a little more per night, but we received access to the lounge which contains drinks and snacks and complimentary breakfast. The rooms were spacious, quiet, clean, well furnished, have nice bathrooms and AC. The breakfast was very good with a variety of items for all tastes and a chef for cook to order omelet’s or eggs. A great feature of the Hotel is the roof top pool and lounge! This is a great place to relax in the summer especially after long days of sightseeing with the kids. The hotel staff was very friendly and helpful. The lobby bar was nice as well. Wireless internet is available for a fee. If we return to Madrid we will definitely stay at the Emperador again.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "3.0", "Value": "3"}, "AuthorLocation": "Solihull", "Title": "“Quite nice, good location”", "Author": "GadaboutSolihull", "ReviewID": "UR117210936", "Content": "I stayed 3 nights at this hotel in August 2011. The room (404) was small but clean. The (decent) bathroom was almost bigger than the room. There was no hot water on one day, due to a breakdown but this was fixed by the next day. The room's only 'view' was of a huge blank wall, but at least this meant that it was probably quieter than looking out onto the street. There are NO tea/coffee-making facilities, so take your travel kettle! There is a fridge, but ours wasn't working, although they replaced it very quickly. The very worst thing for me about this hotel was the pillows. They were as wide as the (twin) bed; about 10cm deep and about as comfortable as your average doorstep, which they closely resembled. The (unheated) roof top pool and sunbathing area are very pleasant. The location is as central as you could possibly get. Very busy shopping area, with lots of traffic.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Baltimore, MD", "Title": "“Lovely hotel, improvements in service needed”", "Author": "theatremom", "ReviewID": "UR117010976", "Content": "This property is centrally located, and there are many places within easy walking distance-Puerta del Sol, Palacio Real, Plaza Mayor. If you plan to focus your time at the three major museums (Prado, Thyssen, and Reina Sofia) you should consider another hotel closer to the museums. When we arrived, jet lagged and tired, the reception desk manager did not greet us. He was abrupt, and he did not even offer us a map. He did not give us a feeling of hospitality at all. The room however made up for his gruff manner. I am very glad we paid extra for the upgrade to a club room. The internet is NOT free; it costs an extra 13 euros per day. Breakfast is also not included. The upgrade to the club level will allow you to stop by the club lounge in the hotel for soft drinks, gin, draft beer, bottled water, peanuts, potato chips, and small crackers. The lounge does not offer wine. Drinks may not be taken out of the lounge. The hotel roof pool was popular. The hotel offers excellent and fast laundry service. The housekeeper picked up some items we needed washed and ironed, and everyhing was finished by the end of the day. Be aware that Grand Via is noisy, crowded, and there are homeless people who sleep on the street at night. The area is safe, just be aware that there are hotels on much quieter side streets and in plazas in Madrid. Some of them offer free amenities that the Emperador charges for.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "New York City, New York", "Title": "“OK Hotel - Pool is the only reason to stay here....”", "Author": "gerryjets11", "ReviewID": "UR116345511", "Content": "We chose this hotel strictly for the pool , as we were on a family vacation in Madrid. We thought that due to the hot weather that it would be worth it. The pool was ok - unheated - and not child friendly. Definately not a 4 star hotel as it markets itself as. There was no conciege - just the front desk. And the beds were very uncomfortable. I was never greeted at the front desk upon check in and never asked how the stay was at checkout. The staff did not seem to care. I would not stay there again. Lastly, the ice cream bars for the kids were 4.5 e for one - which is about $7 - which is an outrage for a $2 bar - at most. Lastly, the wi-fi is NOT free - they charged 13 e per day. Lots of nice hotels - I would look elsewhere.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "", "Title": "“Great location, plus a rooftop pool”", "Author": "AliRuth", "ReviewID": "UR116098719", "Content": "Our choice of the Emperador for a four-night stay in Madrid was dictated by the roof top pool, which made our stay in this sunny city even better. The Emperador is in a fantastic central location on the Gran Via which gave us an easy walking distance to all the main attractions like the Prado and Thyssen-Bornemisza museums (about a 10-15 minute stroll) plus tapas bars and restaurants in the Centro and Chueca districts. The lobby is very grand and impressive, and the buffet breakfast provided was fine - basic continental breakfast of cereals, fruit juices, yogurts, breads, toaster, plus cold meats, fruit, tortilla, tomatoes and cheeses. The choice was OK, not outstanding but enough to fill you up for the day ahead. There was a cooked breakfast bar area, but you had to pay extra or be eligible for the Emperador Breakfast Bar ticket. Having that obviously gave you more, and a better choice, but the standard buffet is fine really, Our room was clean, serviceable, and OK, but it was on the shady side of the hotel, and without a balcony so I have to say it was a little gloomy at times. In fact the blackout curtains meant we overslept on a couple of occasions and only just made it down to breakfast before everything ran out. Ours was just a standard room, and this is a city centre hotel, so we didn't really expect too much in the way of views or terrace, and for all the time we spent in the room it was fine really, although the pillows were a funny long thin shape which meant a couple of restless nights. The staff were friendly and helpful, and services like air conditioning standard. The city bus tours stopped virtually opposite the hotel on the other side of Gran Via, so really easy to buy tickets for and board. What really sold it to us was the rooftop pool and bar area. It was lovely up there, with a large pool for proper lengths, and proper sun loungers plus towels provided. It was great to have the option to soak up some sun in between hitting the streets for some sightseeing. The pool area got busier as the day went on, so it's worth getting up there early, but thankfully there was no need for any towel bagging sun loungers, there were enough for everyone. My one criticism was that there was limited shade available, and no umbrellas provided, so you have to be a real sun worshipper to brave it! But worth the trip up even just for lunch at the shady bar and the fabulous views over Madrid's city rooftops. For what it was (ie a city centre hotel, with no pretensions) the Emperador was fine, but the pool made it a great choice for us, as well as the central location. For restaurants we would recommend La Chata in Casa Baia (Centro) as authentically Spanish with great local food, and Barraca in Chueco for plentiful paella.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Great staff, clean and quiet.”", "Author": "nadso68", "ReviewID": "UR116096370", "Content": "Stayed for three nights in July 11. Hotel foyer very marble and polished brass , cool clean and opulent. All communal areas clean and well cared for, carpets fresh and vacuumed thoroughly. Our standard room was lovely- granted the view wasn't much, overlooking the buildings to the rear of the hotel but the room was large with a little entrance hall and a quite lovely ensuite, again sparkling. Air con worked well but even in July didn't need it as room was cool. Mini bar reasonable.Beds quite hard though and only one pillow- not the most comfortable, but got used to it by third night. Rooftop pool stunning and gorgeous in the hairdryer heat of madrid in high summer. Plenty of sunbeds, decent sized deep pool, attentive waiters. Big, big big and only complaint about the hotel is about the excessive charges for drinks at the poolsode bar. A gin and tonic appeared to be 11 Euros- I say appeared because we couldn't afford to drink any. Had a couple of small beers and did the rest of our drinking in downtown Madrid. The poolside bar was popular abd had a lovely country club vibe about it and maybe this can only be sustained by the high drinks prices which prevents the riff raff like us from overdoing it, but noticed fellow Brits abstaining from the drinks. The poor exchange for the pound may have accounted for this.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Welwyn Garden City, United Kingdom", "Title": "“Spot on again”", "Author": "cal204", "ReviewID": "UR115964268", "Content": "Stayed at this Hotel and enjoyed it, so we went back. We stay in a Club Room and have never had any problems, view over the gran Via, loads of wardrobe space, Twin/King bed, shower pressure not great but this is not unusual. If I had a fault it would be that the Club room bar is not serviced enough, it is often messy and the fridge is often empty of drinks, also the draught beer was off for more than 24 hours. However, when you asked for a refil it is done, but should you have to ask? Pool is now open at 10am instead of 11 and it is wonderful up there, no complaints.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "new york", "Title": "“Great location, fabulous pool”", "Author": "raydk", "ReviewID": "UR115823021", "Content": "My family and I stayed here for 3 nights in mid july. Although the rooms were small, they were very clean, quiet, and the bathrooms were very good. The beds were a little too firm for me. The breakfast was a standard continental (fruit/pastries etc...) you had to pay extra for hot items (eggs/bacon etc). What made this hotel a great choice was its location (within walking distance of most tourist attractions in madrid) and the fabulous rooftop pool/bar. The pool was huge and there were many lounge chairs, with bar service at your chairs.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Pleasantly surprised!”", "Author": "The Usual Suspect", "ReviewID": "UR115798565", "Content": "After reading some reviews, I wasn't expecting a great deal from this hotel, but our purpose to visit was for Madrid, not the hotel! It is in an ideal location on Gran Via. Come out of the Metro station (Santa Domingo) look over your shoulder & there it is! We received a pleasant welcome (which is unusual according to recent reviews) & we were given all the info we needed on what our room basis covered. We upgraded to a Club room for 32 Euros per night (highly advisable as you get a quiet room which overlooks Gran Via, plus you get access to the hotel's Club Room which includes free local drinks). The breakfast is ok - if you eat a lot then you will be happy as the is a huge selection! I don't quite understand why boiled carrots were available though!!!! The roof top pool is delightful, can't say the same for the cafe or the service. I ordered Nachos for 6 Euros and received a plate of crisps with a cheese (I think it was cheese) sauce. I have to say, this hotel was perfect for what we wanted & if I returned to Madrid I would stay here again without hesitation. TOP TIP - if you have to get back to Madrid Airport for an early flight, the Metro doesn't start until 6am (& it took us about 40 mins to get from the airport to the hotel). Use a company called Aerocity - they charged us 27 Euros in total & got us to the airport in 20 mins. Excellent service & cheaper than the 70 Euros quoted for a taxis!!!", "Date": "July 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Outstanding service!”", "Author": "Madrid622", "ReviewID": "UR115670979", "Content": "Hotel Emperador is an excellent hotel with exceptional service. It is conveniently located a few minutes walk from Plaza de Sol. Rooms are clean, nicely decorated and spacious. We accidentally left a fairly expensive item in the room when we checked out. It was found by the staff and returned to us. It was very easy to communicate with the hotel by email. I appreciated that hotel Emperador sent a confirmation email to me a few days before our trip. It seemed to be very well run.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Basingstoke, United Kingdom", "Title": "“Nice hotel....fantastic rooftop pool!”", "Author": "Little_Travel_Bug_11", "ReviewID": "UR115616719", "Content": "I stayed at this hotel for 3 nights with my partner and his mother. We were visiting family who lived nearby in another part of the city. We opted for this hotel as we couldn't find any others within the same area with a swimming pool, so it stood out for us. We also liked the central location of the hotel. We booked two rooms, one for myself and my partner and the other for his mother. The lobby of the hotel is impressive and very clean and the reception staff were very welcoming. The two rooms were booked on the same floor which I was pleased with. Our first impression of the room was that it did lack space and was a little 'dated' but at least it was clean and comfortable. The bed could have also done with a couple of extra pillows as we only had one smallish pillow each. Initially I was very disappointed with the view as our room was at the back of the hotel and facing other rooms, however it actually became an advantage to us as the room was cooler, plus you didn't have the noise of people and traffic outside (every cloud and that). The food and drinks within the hotel were very pricey so we never ordered anything there. I'm not tight but do know the true price of things and it makes no sense to me to pay way over the odds for something that you could get the fraction of the price elsewhere. Thankfully, there was a Starbucks just across the road from the hotel which came in handy in the mornings and that was a lot cheaper, which I think is really telling you the expense of eating and drinking at the hotel. Although it is not unusual for hotels to have extortionate prices where their food and drink is concerned. The rooftop garden and pool was absolutely amazing and I think really makes this hotel. The swimming pool is huge and always kept clean and there are plenty of sunbeds to go around. Overall a pleasant stay for all of us concerned and I would certainly stay again, mainly due to the rooftop pool though :o)", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "london", "Title": "“It had it's good points and it's bad”", "Author": "190671", "ReviewID": "UR115301418", "Content": "We have just stayed at the Emperador and had a lovely weekend, although this was due to the company more that the hotel. We arrived to be greeted by two surly men on reception, that were like the two moany guys on the balcony in the muppets! They finished what the were doing, before the even acknowledged we were standing there. When we asked about the advert on the reception desk for a club upgrade, it was like getting blood out of a stone, finding out what it included, so we decided to pass on this. We were not offered a porter to take the luggage (something that we are not too bothered about but you would normally expect in a 4 star), We walked into a dark shoebox of a room (bathroom was nice) and our friends room was even smaller. We decided to go back and view the club upgrade room which was far nicer and overlooking the Gran Via (with good soundproofing), we asked again what else it included and received a very grumpy response. The porter showed us to the room and was a breath of fresh air, he showed us the club area, where you can get soft drinks, beer and a rather odd choice of spirits, as well as nibbles, between 12 and 11pm. I would recommend upgrading because you will spend way more that 35 euros if you order drinks in the hotel. A litre of water being 9 Euros and a vodka (no mixer) 13 Euros. They say that you are not allowed to take your drinks out of the club room but we took them discreetly up to the pool and were never challenged. Top tip....take a bottle opener! Do not bother eating in the hotel, whilst it is not too expensive, it's not great and as soon as you have a drink with it, the price soars. Soft drinks were nearly 5 Euros. I ordered pizza with proscutto, it came out as margarita. When I pointed this out, they took it back and within minutes I had the pizza with processed cold ham thrown on top. Decided to put that down to experience and just not go back. Friend ordered nachos and for nearly 7 Euros, she was lucky enough to get a plate of doritos and some runny cheese. No salsa, guacamole, or any other garnish. Just squeezy cheese and chips. Service is not great, whilst they serve drinks by the pool, it takes some time to attract attention and then for them to arrive. The staff were very nice up there but just not very effective. On a positive note, the pool was lovely and so were the views from the 10th floor and the hotel is perfectly situated in the middle of most things, with the tour bus stopping just across the street. We grabbed coffee and breakfast from Starbucks each morning, which is right across the road and a damn sight cheaper! You will also need to be up on the roof terrace to bag your lounger with a towel before midday or risk not getting one, particularly at the weekend. This is because the hotel allow non residents to use the facilities for 44 Euro. Not a problem if you're successful with getting a sunbed but something I would have been annoyed about had I not, which did happen to those wanting to sunbathe in the afternoon on Saturday and Sunday. If you want internet access, pop across the road for free wifi in McDonalds as you will pay 13.95 euros for a day in the hotel. We had a lovely weekend and the rooms were clean with a nice bathroom but I would not rush back to this particular hotel.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Tampa, Florida", "Title": "“Loved the rooms”", "Author": "Jeffrey W", "ReviewID": "UR115197681", "Content": "We had a junior suite which was perfect with a balcony. The location was perfect.. Their breakfast was was very good. Their club or VIP suite was poorly staffed and we had to request 2 times to stock . The swimming pool was a beautiful setting but 90% of the people there were males of an alternative sexual preference. This made it too uncomfortable to use the pool.", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“Well....it's an OK hotel, but....”", "Author": "ZAIDYY", "ReviewID": "UR114594149", "Content": "First things first...location is great!....Hop off the plane, hop in the metro, change line, hop off metro, get out and turn back, there is the Emperador! The hotel is right in the heart of the shopping district, lots and lots of shops restaurants, theaters, etc... Palacio Real is 10 minutes walk (make sure you visit this on Wednesday when they change the royal guards). The hotel itself is fine. However, I could not help but feel that staff were snobby. in addition; when you book a room with breakfast you get the intercontinental breakfast (no ham, bacon, eggs,etc...). You must pay extra for the EMPERADOR BREAKFAST, this is a rip-off in my book. Our room was clean and the mini bar was full of goodies. but like every other hotel I stayed in while in Spain, the only English channels were CNN (which kept going off despite the fact that I complained about this), and Sky News (only useful if you're English/British or into UK news). To sum up: I loved the location but I don't think I will go back there.", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Great location and what a surprise on the roof!\"”", "Author": "Jude96", "ReviewID": "UR113169513", "Content": "Great location for walking from the metro station after taking the train from the airport. No need for taxis! Three of us in a room and the one who had the sofa bed was happy with his lot. Room was spot on although it was better to keep the blinds shut as the view was only other peoples rooms. However, as the only time spent in the room was mostly taken up by snoring the view wasnt a problem. Breakfast was good,everything available in big room and the big round tables in the far corner are a great location if there is a group of more than 4. Grab one! Location for Madrid centre is excellent. Tour bus stops outside altough difficult to get on as very few get off at this stop! We only found out on the last morning about what was up on the roof. Superb swimming pool, stunning views across the city, sun loungers, drinks bar, food availalable. Great hotel. Recommend.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Wirral", "Title": "“We loved Madrid and the Emperador Hotel”", "Author": "Posted by an OctopusTravel traveler", "ReviewID": "UR112682434", "Content": "We were 5 ladies on a weekend trip. We loved the Emperador Hotel, rooms had connecting door, which meant we were together for whole weekend. Staff were very helpful, breakfast great and rooms very clean. The roof top terrace and pool was great for cocktails and nibbles. We asked for some recommendations for dinner. Midnight Rose was one of them and I cant recommend them highly enough. Food, service, ambience fantastic. We were also recomended Ginger, all I can say is DONT GO THERE!! staff were arrogant, and from the minute you walk in they are rushing you to get out, give this a miss!! Madrid is a lovely city and I would recommend the tour bus for getting your bearings. Fab Holiday.", "Date": "June 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Wonderful”", "Author": "KnoxE", "ReviewID": "UR111847745", "Content": "We travelled to Madrid to celebrate our friend's birthday. We had a wonderful stay at the hotel. So much so we have booked to return in August 2011. The hotel is very comfortable and we especially enjoyed the roof top garden and the swimmong pool just what we needed in the warm weather, Can't wait to be there again.", "Date": "June 6, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "deharts", "Title": "“Great Location, Horrible room (pictures)”", "Author": "deharts", "ReviewID": "UR111127364", "Content": "We booked a year in advance for May 2010. Booked through American express, using points. We talked to Hotel Emperador directly several times months in advance. We arrived the hotel looked slightly dated compared to U.S. Hotels but lobby was very nice. Arrive at the room/box #804 it was horrible I thought they gave us the janitors closet or the staffs break room, rest area. The room was very smelly that old musty smell. We went back down to the front desk and ask for a better room and was told that was all they had. Later that evening a tour bus checked in. The room was very small and had two small beds that were the size of cots, that came up to my knee in height, both headboards old and very scratched. The room had to be 9x12, there was a bed against the left wall then a night stand and the second bed against the right hand wall (wide as a jail cell) If you wanted to open the window (inward) you would have to move the chair, and then you could not see the TV from the bed because the curtain would block the view. The closets were small musty, and the false floor and ceiling of the closet were tweaked enough that you could see below and above. We did not unpack our clothes. The 19in. TV was propped on top of mini fridge at the foot of the bed which blocked you from fully opening the closets thank goodness we did not used them. The one sitting chair was stained and broken. The desk was also beat up and scratched, the carpet soiled. I have pictures of all these claims. The bathroom was clean but very dated as well, dark brown tile and fixtures and florescent lighting. I can go on and on, but its best to end here. I did see better rooms in the hotel, but supposedly we could not get.", "Date": "June 2, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "New Jersey", "Title": "“great location”", "Author": "boxochocolate", "ReviewID": "UR110966193", "Content": "we stayed one night. the location was perfect for going to the palacio and wandering around the puerta del sol area. we didn't do the hotel breakfast but there were great breakfast spots nearby. the room was SMALL. but we were prepared for that. it was comfortable though, and the bathroom was fine with good amenities. they gave us a bottle of champagne for free which was nice. the rooftop pool and bar area are really nice, great views. a good place to stay for a short sightseeing trip.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Cork", "Title": "“Location Great, hotel is ok”", "Author": "scottyccfc", "ReviewID": "UR109441534", "Content": "Right the location is brilliant, when you first walk in the hotel does look top notch! Once you make it to the rooms though it is very basic, it reminds me of a hotel room youd see on TV shows back in the 80s. Its basic, the view is shocking (Depending on what side of the hotel you are on) 8 of us went over and we were put on different floors (Obviously thinking we were a stag or someting) The pool was closed when we were there but Madrid itself is a great City so the room didnt really matter. Basically if you are a youg couple/group of friends under 30 this wont matter, its a hotel room with a great location. if you want luxury stay well away. Would I stay again? Yeah sure, it was cheap and no frills.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "erinm51", "Title": "“SoSo hotel”", "Author": "erinm51", "ReviewID": "UR108406524", "Content": "This was a middle of the road hotel. The hotel is an older hotel wich is fine and can be charming, but our room was tiny and no frills at all, The bathroom was the nicest part of the room. The staff was o.k and the location was nice. The hotel was not great and was not bad it was just an average hotel.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Farmingdale, New York", "Title": "“Stay elsewhere!!!!!”", "Author": "Nyudad", "ReviewID": "UR106420868", "Content": "we just finished our tour of Spain which included Madrid. This hotel was a disappointment aft our stay in a Hilton in Barcelona. The staff was not very friendly. The room was old but decent size. However there was no clock in the room or an iron or coffee maker . The other hotels during our stay were able to provide us with converters for U.S. Plugs.The staff here basically shrugged and said had none and we could buy some from the store next door. the beds were very uncomfortable. the only plus I will give this hotel is it's location. It really is near most major attractions and you can walk to almost everything.However while walking we spotted many other hotels that were also nearbythat you can stay in.", "Date": "May 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edinburgh", "Title": "“Great location with lovely rooftop pool”", "Author": "CSHH", "ReviewID": "UR106142526", "Content": "We spent three nights at the Emperador in July 2010 and would definitely return. We booked a club room as there were three of us and it was very comfortable with plenty of room- no balcony though as others have mentioned. There were tea & coffee making facilities in the room. It is worth paying a little extra for a club room as access to the club lounge was a real bonus. We were disappointed, however, by the noise level on the night of a wedding party taking place in the hotel. The noise in our room stopped us from sleeping & when we called reception at 2am we were advised that the wedding party would go on until 3am. The problem seemed to be that our room was directly above the function room. They did offer to move us to a different room for the night but at 2am we didn't fancy the upheaval! Other than this we were happy with our stay at the Emperador. The larfge rooftop pool was lovely- especially after a day of very hot sightseeing. A highlight has to have been watching the world cup final in the clubroom with other guests then heading out to to soak up the atmosphere after Spain had won- fantastic! We would definitely return to the Emperador but would check whether there were any functions planned!", "Date": "April 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great hotel right in the heart of the tourist area”", "Author": "Gokulram_Arunasalam", "ReviewID": "UR103785219", "Content": "Gokulram Arunasalam The hotel is in the central part of the city on the Gran Via and right by all the shopping.and tourist attractions. The rooms are really nice with all amneties. The hotel also has a spa and pool, so it truly deserves its star rating.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“good solid hotel, rough around the edges”", "Author": "teritravels2010", "ReviewID": "UR100064684", "Content": "The lobby is lovely, the staff helpful. The room was a decent size, but the third bed was a pullout coach, which they did add an extra mattress to - which made a huge difference. Madrid has very few \"triples\" - and expedia advertised it as such, but it was really a double with an extra bed. They upgraded us (I think?) to a junior suite, which made the room a fine size. The windows were pretty good, but even with that, we were awakened by sirens and singing in the street -which is not the hotel's fault, of course. The bathroom was quite nice and well appointed. Nice big towels and robes. No complaints, at all...just needs upgrading, but for the price of $233 for the three of us, I suppose, a decent deal. I personally don't love the Gran Via area as it's so busy.", "Date": "March 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“An expensive and not so-modern hotel with a perfect location”", "Author": "Doursou", "ReviewID": "UR96513692", "Content": "Hotel Emperador is a \"grand hôtel\": its location is perfect, and it has an elegant hall. However, the hotel is definitely expensive. At least 80 euros per room, and Internet is not free (you have to pay 5 or 6 euros for 30 minutes!). Also, the breakfast is not always included, and it costs 15 euros per person: 15 euros for having bad coffee, some scambled eggs and low-quality cheese and tasteless pastry and fruits... Moreover, the hotel staff does not speak English neither French, which is a real problem if you are not Spanish-speaker. Furthermore, in the rooms, you don't have a lot of choice of TV programs; almost all the channels are in Spanish... Nevertheless, this hotel has an excellent location, on Gran Via, Madrid's Champs Elysées/ 5th Avenue! Five minutes from the hotel by walk, you have the \"Puerta del Sol\", the center of Madrid. If you don't want to walk, you have always a lot of taxis near the hotel. But you also need only five minutes to go by walk from the hotel to the \"Chueca\", the very trendy district of Madrid where everybody is going out at night (in fact, it is the gay district, and all the bars and nightclubs - for gay and straight people - are there). By the way, if you are a clubber or nightlife-fan, the best club of Madrid, the Club Cool, is just behind the hotel... Finally, if you consider the location as an important thing during your trip, Hotel Emperador remains a pretty good deal, because everything is close when you are there. Avoid the breakfast at the hotel: there is a Starbucks just in front of Emperador, or you can try the place \"Paradiso Jamon\", which is a restaurant and a ham store but also a typical coffee shop.", "Date": "February 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aberlour, United Kingdom", "Title": "“Great hotel in a fantastic location”", "Author": "George B", "ReviewID": "UR95756255", "Content": "The rooftop pool is terrific. We had a room with a balcony looking on the Gran Via that we found was a bonus in a city hotel", "Date": "February 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Excellent hotel in great location.”", "Author": "johnsty", "ReviewID": "UR93900899", "Content": "Arrived in Madrid on December 30th to spend 4 days over the New Year with my wife. The hotel is located right on the Gran Via and is easily accessable from the Airport using the Metro system which involved one change and cost the princely sum of 2 Euros, as there some steps to negoiate at the Metro stations it is probably not advisable if you are carrying large cases. The reception staff at the hotel were excellent and although I speak a little Spanish it was not necessary as all the staff are fluent in English and are very helpful. We had booked a Junior Suite and we were not disapointed, the room was a corner suite overlooking the Gran Via and it was huge, very clean and exceptionally well appointed with all the amenities you would expect at a top class hotel. We had breakfast a couple of mornings at the hotel as this was part of our package and found the food to be adequate, although I do not think I would pay the 18 Euros asked as there are numerous places on Gran Via which offer breakfast at half the price. Having booked a suite we had access to the Emperador lounge which proved to be a bonus as it was usually very quiet and one could just sit quietly and read the daily papers,only moan about the lounge was that they did not serve wine!!! only exec lounge I have been in any where in the free world which did not offer this facility, drinks on offer were whisky, gin a couple of liquers and plenty of soft drinks and water so if you are looking for some free vino you are out of luck at this hotel. Getting around about Madrid is very simple due to the ecellent Metro system which is very easy to understand. All in all the hotel provided an excellent retreat from the madness that is Madrid over the new year period and I would recommend the Emperador to anyone intending to visit this beautiful city.", "Date": "January 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Basingstoke, United Kingdom", "Title": "“Excellent service, location and breakfast, but it is pricey :)”", "Author": "busytraveller2008", "ReviewID": "UR92056050", "Content": "Service from all the staff was fantastic, lovely breakfast for room service but it wasn't cheap. Great location and good sized room. Shame the room terrace and pool was closed (although it was December) would have made it even more excellent.", "Date": "January 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Drafty rooms! Don't stay here in Winter”", "Author": "Mouglie", "ReviewID": "UR88679339", "Content": "The hotel has great location (near the theater) district, and is close to the Metro stop. Also the hotel folks are nice. That's about the best I can say about the hotel. The rooms however clean were very drafty. They have central air but no humidifier. So during the night the rooms were cold on one side, warm on the other and very very dry. Not a good combination for winter. Also the rooms filled up with cigarette smoke during the mornings and eve, we requested for a non smoking room and were told that there aren't any. Also with the rooms near the street were noisy though out the night and we never got good sleep.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Smells like sewer”", "Author": "clam1230", "ReviewID": "UR84859787", "Content": "This was one hotel that I feel my fellow TripAdvisors failed me. I booked this hotel based on the others' great reviews, and was definitely disappointed! I had wanted a nice, clean, 4 star hotel to end the last 3 days of our trip, but... When we checked in, we were asked if we wanted to upgrade our room for another 20 EUR. We declined, and I feel like we were given the worst room available. The room was so small that when you open the door, the bed is right there. There was barely any room to place our luggage. What's worst though is the sewage smell that was so foul and instantly noticeable upon opening the door! It felt so disgusting, but it was late afternoon and we were anxious to take advantage of the last few daylight hours on the rooftop pool. So we turned on the AC in the room and went up to the pool. Luckily, upon returning, the AC helped clear the smell. We suspect that the room hasn't been occupied in a long time (hence, again, the suspicion that our decline to the upgrade led us to this unused closet of a room). This room also didn't feel very clean. The carpet feels very dirty, and the bathroom is very old. There's a loose tile on the floor that creaks everything you walk on it. The only positive amenity to this hotel is the rooftop pool, although I wish they'd add a hot tub since there is such a large space available. Service is also poor. I found the staff to be very snobby. Also, during our check-out, we asked the front desk to check which terminal our airline flies out of, as they're pretty far stops on the subway. He told us the wrong one, so we arrived 1/2 hour later. Luckily, we're the types that like to arrive 3 hrs early to the airport! Plus, they charge additional for internet which should be standard by my book for a \"4-star\" hotel. Overall, I would definitely not recommend this place. Go to the Best Western (3-star) instead!", "Date": "October 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great location, dingy Rooms, but all forgiven as Roof Terrace was superb”", "Author": "adventurecalls", "ReviewID": "UR82557243", "Content": "Stayed 3 nights & spent most of our time on the roof terrace - really lovely spot to lounge in the sun by the pool. A real treat as the hotel is centrally located, on a busy main road. Rooms had very little natural daylight - so were uninspiring, but comfortable. Drinks on the Roof Terrace horrendously expensive - 12 euros for 2 small bottles of Sprite - beware!", "Date": "October 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Volders, Austria", "Title": "“Excellent location - amazing roof”", "Author": "Archie2004", "ReviewID": "UR80473040", "Content": "Can absolutely recommend this hotel. The location is excellent and the swimming pool on the roof is amazing. Good atmosphere in overall. Buffet breakfast was ideal for the start of the day. Enjoy a cocktail and the view on the roof terrace - don´t miss it! Good drinks, good service - a perfect place for hanging around.", "Date": "September 21, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“In the heart of the city, on Gran via”", "Author": "martandrews", "ReviewID": "UR77984843", "Content": "Centrally located and not too bad in quality, the Emperador Hotel is a good and relatively cheap choice for your stay in Madrid. The rooms are not that spacious, but nicely decorated and clean. We just had the problem, that one night after returning from dinner, the electronic door lock did not work anymore, so we had to be relocated. Big plus: The large rooftop Pool!", "Date": "September 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chester, UK", "Title": "“FANTASTIC HOTEL, GREAT POOL, EASILY DESERVE'S 5*”", "Author": "GlowballChester_UK", "ReviewID": "UR77975666", "Content": "Traveled with my partner and 5 year son (wheelchair user) in July. We can not fault this hotel on anything at all. Our room was always spotlessly clean after returning room breakfast, clean bedding, towels, toiletries etc. The staff were friendly and always willing to help with directions, ordering taxi's, language difficulties and supplying fresh milk 4 my little boy. The pool was much needed in the 40degree heat and always clean with fresh towels supplied and life guard on duty at all times. We will be returning to this hotel again on our next trip 2 madrid. More than deserves 4* rating!!!!", "Date": "September 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Arbroath, United Kingdom", "Title": "“Nice clean hotel with decent location”", "Author": "Vinegarhill", "ReviewID": "UR74935860", "Content": "Not a great deal to say other than it being in a decent location, nice clean and large room. I was pleasantly surprised by Madrid and enjoyed a great weekend with friends.I enjoyed the more traditional taps type bars.", "Date": "August 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Auckland Region, New Zealand", "Title": "“Wouldn't hesitate to book a room at the Emperador next time we're in Madrid”", "Author": "Michael969", "ReviewID": "UR74535748", "Content": "We found the staff to be very friendly and helpful (especially the bottle of Cava on ice that came to our room, compliments of the hotel). The location is excellent - only a few steps from the Santo Domingo metro station entrance on the Gran Via and within easy walking distance to the Plaza Puerta del Sol and Plaza Mayor. Plenty of good places to eat nearby (we kept getting drawn back to Chocolatería Valor for the fruit and chocolate fondue ... Also had a great meal and listened to live Cuban music at a place called Cuando Salí de Cuba just a few blocks away). Lots of interesting shopping on nearby pedestrian-only streets with shade covers overhead. As some have noted, the rooms are not huge, but I wouldn't deem the Club rooms we had small (We stayed twice, once at the beginning of our trip and once at the end). We were quite comfortable, the rooms were very clean both visits and neither had any odor of smoke at all. We also enjoyed the view from our window over the Gran Via. Room service menu was a bit pricey. We also liked the fact that we could get information about things to do before we arrived by becoming fans of the Emperador's Facebook page. One other tip, the taxi ride to and from the airport should cost 25 to 30 euros. Any more and you've been scammed. Ask the fare before you get in the cab.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Welwyn Garden City, United Kingdom", "Title": "“Didnt want to come home :(”", "Author": "cal204", "ReviewID": "UR73237125", "Content": "We arrived 2 hours late after delays at the London airport and were glad to arrive, we got off at Plaza de Espana Metro which is a 3 minute walk to the hotel and cuts out an extra train change and escalators are great when you have luggage, there are no escalators at Santo Domingo.... We were welcomed in a very friendly way by the reception and shown directly to our Club Room on the 4th floor, wonderful views over the Gran Via from out balcony, we were given a double room and we found the bed to be very small, we do have a kingsize bed at home though, the next day I asked to switch rooms with a bigger bed and this was done without hassle. The Club room was great has a place to escape from the hussle and bussle and the free bar was a godsend with the euro being so low... We had a huge flatscreen TV with Skynews but no other channels but lucky for us we dont go on holiday to watch TV. Tea and Coffeee was available in our room and was replenished everyday. We didnt have breakfast included but I went for Breakfast one morning and enjoyed what I had, however my hubby who enjoys a cooked breakfast would have been dissapointed so we didnt go to breakfast again, I used to nip across the road for a Starbucks and a pain au chocolat..... When you come out of the Hotel and turn right and cross the first crossing, do not use the first cashpoint you come to, we did on the last night of out holiday and the machine swallowed my card and didnot dispence my 100euro, lucky enough I bank with FD in the UK and they made sure I was returned my money, I went into the \"Bank\" the next morning and it didnt even look like a bank inside and they showed no interest in my problem. Make use of the Rooftop pool it is fab and only gets busy on the weekends, the food up there is not cheap but it is not overpriced and it is really good, Overall a fab holiday all round.....", "Date": "August 1, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London", "Title": "“Location, Location, Location”", "Author": "cocotwice", "ReviewID": "UR72606842", "Content": "This hotel is all about Location, Location, Location and a rooftop pool. We got a great rate including breakfast and wanted to be in the city centre with access to a pool so it was perfect for us. However if either of those things are not important to you there are much better hotels to stay in. The location is superb - you are right on Gran Via the main thoroughfair in the city - think Picadilly Circus if you are staying in London. So you are walking distance of EVERYTHING you need to see. Tourist bus stops opposite and you are directly next to a choice of metro stations too. Literally LOADS of restaurants in walking distance, gorgeous Tapas places on pedestrianised streets, walking to Plaza Mayor or steps from the hotel to the Spanish offshoot of 'Pizza Express' (come out turn left) or opposite that is TGI Fridays if you are unadventerous. There is no tea and coffee making in the room so you'll appreciate the Starbucks that is opposite! I found the check-in staff really rude and obnoxious - no eye contact, no conversation, didnt even give the key to me or speak to me - gave the key to the bell boy and walked off! Very rude! The breakfast staff were good and the breakfast buffet was excellent - the addition of a chilled bottle of Cava (not champagne as others have said) was a lovely way to start the day. Mixed with peach juice for a Bellini or OJ for a Bucks Fizz was a lovely way to start the day every day. The room is definately 3 star, very basic with small windows and low ceilings nothing special at all but the food and choice was excellent every morning. The pool was fantastic, it is so high up that you look out over the other buildings and statues - it is one of the most lovely pools we've been in - it was such a welcome relief after a hard day of sight seeing to jump in the pool. Towels provided and lots of loungers available. Do check it is open when you are going though as you will be disappointed if it is shut when you go. If you want to hire a car the hotel is directly opposite an AVIS shop which was very handy for us, we had hired a car for the next leg of our journey but decided to pick it up a few days later from the office opposite the hotel rather than paying the extortiante amount to park the car in the hotel. You really do NOT need a car when you stay here as you can get public transport everywhere. Even getting a cab from the airport in rush-hour worked out cheaper than paying parking! The rooms are ok, nothing special, comfortable rooms with nice comfy beds, TVs (nothing english), safe, big bathroom etc. But be warne, the most important thing to say when you check in is \"Last time I stayed the room had a terrible smell, please make sure I do not have a smelly room\". The woman checking in next to me said this and I'm sure she was fine - our room had a weird mixture of bad drains and air freshner trying to disguise it! I had read on Trip Advisor about the smelly rooms but didnt think it woudl be a problem - but it's not great, We were on level 5 in a room looking into a dark atrium in the middle of the hotel and the room had an odd drain smell - worse in the afternoon. We were only spending 3 nights and were out most of the time so it didnt really bother us but if you were staying any longer or had a sensitive nose do ask for a non smelly room. I think it's just poor drainage - it's not really awful but not too pleasant. If you want to be in the middle of everything and you want to be able to swim then this should be your first choice if you can get a good rate, if you dont need to swim there are better hotels on Gran Via and further out of the area for cheaper.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Great pool - great location - pay extra for clubroom”", "Author": "piboBelgium", "ReviewID": "UR70789872", "Content": "As other reviewers have said, the location of this hotel can't be better (central on the gran via) and the pool rooftop is really great. It's really worth to pay a bith extra for a club room, which gives access to a free bar and which all have balconies and views over the gran via. Only negative point was that I was not impressed about the quatilty of the beds. I really liked this hotel, which has a nice old fashion feel, and will stay here again", "Date": "July 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Faultless service and perfect location”", "Author": "fjvdberg", "ReviewID": "UR70129668", "Content": "We stayed at Hotel Emperador over Gay Pride weekend - a very busy time for any hotel in Madrid! On check-in (14:30) we were greeted by very friendly reception staff. We were told to wait a bit as a double, non-smoking room was not available at the moment. After we had waited about 10 min, one of the reception staff came over and told us we had been upgraded to a junior suite with a view over Gran Via! Our weekend could not have started any better. The room was very spacious and clean. The bathroom was huge and had all the amenities one could ask for. The double window system worked extremely well in keeping outside noise to a minimum. The room's airconditioning system worked really well - a necessity in Madrid during summer! The selling point for this hotel is the amazing rooftop pool and bar - we spent a lot of time sunning ourselves on the loungers. The pool bar staff were incredibly friendly despite being very busy and hot. Location wise, this hotel cannot be beaten. It's right on the Grand Via with all it's shops and restaurants, moments away from a few Metro stops and within a 10 min walk of Chueca district. We had a wonderful stay at the Emperador and would certainly stay there again if we go to Madrid.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brighton", "Title": "“Great Choice”", "Author": "seavue", "ReviewID": "UR69649570", "Content": "I spent far too long agonising over which hotel to go to for our three night city break. Thank goodness I chose Hotel Emperador! Seconds away from metro (Santo Domingo on red line) Across the road from stop no 19 for the Madrid Vision bus. Easy walking distance to the Royal Palace (go on Wednesday with EU ID and get in free) Museo del Prado, Thyssen and Reina Sofia and all the Plazas and restaurants. We didn't get the travel pass advised by many as it was so easy to walk everywhere. Nor did we get taxi from airport as even with a metro strike apparently going on we still found it so straightforward to get to and from the hotel (1 euro each plus 1 euro airport tax). Probably proper luggage would make it trickier. Hotel Emperador has a stylish lobby, deliciously cool, with very helpful staff who all seem to speak good English. Our room (on seventh floor) was perfect - marble bathroom - TV (could only get Sky news but too much to see outside). Very efficient but quiet air con. Our room had balcony overlooking side road but with two layers of double glazing doors could not hear anything. I booked through hotel as prices on other sites seemed same and so felt better actually speaking to the hotel and asking that, as well as non-smoking, we would appreciate a room with a view. They can't promise but try asking as we later noticed some of rooms seem to look onto a brick wall which might not be so nice. Breakfast was good - plenty of choice. Room was always immaculate when we returned from our museum trail. Probably all this applies to any one of other 4* hotels in the area BUT - no other hotel has a swimming pool (and I do mean swimming not splash) on its top floor! This made all the difference to our trip. Spend the day seeing remarkable paintings and palaces and walking round Madrid In 33+degrees and then scoot up to the roof - pick up your burgundy beach towel and dive into that lovely, clean, swimming pool and then chill on a lounger and read or people watch! Perfect combination. I would absolutely recommend this hotel - such a relief that I made the right choice!", "Date": "July 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "scotland", "Title": "“Perfect location”", "Author": "smokietown", "ReviewID": "UR67831807", "Content": "For our Girls weekend - perfect. We enjoyed our 4 night stay at this hotel. The staff were very friendly & helpful, the hotel was clean & comfortable. The pool on the roof was an added bonus especially as the weather was really good. The location was perfect and once you familiarise yourself with the area, there are an abundance of local cafes & restaurants. The Metro is easily accessible as is the Madrid tour bus that stops directly across from the hotel. A great city to walk around. Fantastic sightseeing & great shopping. Can't wait to go back another time.", "Date": "June 17, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Frankfurt", "Title": "“Cool rooftop pool”", "Author": "Tsimmi-O", "ReviewID": "UR67561410", "Content": "The Hotel is a classy city hotel, interiors are a bit aged and retro romantic but ok. The best is the roof top pool in the middle of the city! Very high up! 10th floor. Water was very chilly but clean and actually quite refreshing on a hot day in May! Food and drinks are available from the pool bar, lounge music coming from the speakers. The pool area is spacious with many sunbeds, the pool is quite big. It is not very stylish though, green plastic grass floor, green plastic chairs and the view from the rooftop is not very spectacular, metal fences all arround and the surrounding buildings are also very high, blocking the view. Drinks & Food quite expensive too. Rooms are classic/retro and quite clean.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Finland", "Title": "“Hotel Emperador - beach on the top of Madrid”", "Author": "Loslapillos", "ReviewID": "UR66221339", "Content": "I was searching a good hotel in Madrid for city weekend with my wife in Madrid. I accidentally hit a hotel in Barcelona by the beach and it looked so great I almost reserved it. Wait a minute, there is no see in Madrid. I got an idea. Maybe there is a hotel that has a pool in the downtown Madrid. I found few hotels with pool but the only one has the pool on the 10th floor and top - Hotel Emperador. We had a fantastic weekend in Madrid: great food and wine, art museums and shopping without kids. Metro is very useful and cheap but we walked our feet off. The best part of our short vacation was Hotel Emperador. My idea was great. After lunch we came back to hotel and changed to swimsuits. Up tp the 10th floor and we were in different place - at the beach. Of course it was perfect to have beach weather but we had city and beach weekend in Madrid. I was not expecting that when my wife took me to Madrid so spend time together before her conference on Monday. Hotel is a little old but very clean well kept. Staff is friendly. Room was nice but we did not like the carpet because it makes us sneeze. It was worth the money anyway, but the pool area made it superb .", "Date": "June 2, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Hobro, Denmark", "Title": "“Top hotel”", "Author": "Rullestenen", "ReviewID": "UR64767236", "Content": "Great rooms and pleasant service. What more can you ask for.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Dark, old rooms and some smelled...”", "Author": "t0309999", "ReviewID": "UR63608904", "Content": "The rooms were too dark and old. needs remodelling. Breakfast was great. Great location and walking distance to everything, one of the rooms we had smelled but the hotel is old.", "Date": "May 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Seattle, WA", "Title": "“If you like smelly hotels this is your place”", "Author": "Seattle_Sadie", "ReviewID": "UR60589264", "Content": "Oh TripAdvisor, you let us down. This hotel was the worst place we stayed in during our honeymoon to Madrid, Sevilla, Ronda, Nerja and Granada. This is NOT a 4 star hotel. The floor we were on smelled horribly and the linens are so shabby. I would not recommend this hotel to anyone. The lobby was always filled with smokers and the hotel staff never greeted us. We even arrived home one evening to find our room door open/unlocked....it hadn't been secured by the housekeeping staff. My husband called downstairs to inform them about it and they apologized but that was about it. Luckily all of our stuff was still intact. The neighborhood it is in is quite questionable...the store a couple of doors down was robbed one morning while we were heading out. We were trying to save a couple of dollars and wished we hadn't. The pros about the place: in-room safe, close to a couple of metro stations, the pool if you are visiting in the summer is apparently nice. Cons: service, linens, room size was the smallest we stayed in while in Spain, the smell, shabby condition of the decor and rooms, internet access was about 4 euros for 30 minutes.", "Date": "April 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "winchester uk", "Title": "“Great Place”", "Author": "scrapycow", "ReviewID": "UR58914946", "Content": "Was slightly concerned about staying here as I had read mixed reviews. When we arrived the entrance hall was very nice, and the room was great. Although the hotel is slightly dated, it is still luxurious and a fantastic place to stay. The service was second to none, and the room we were in was lovely, with a balcony over the grand via and a great club room with free drinks and snacks. Upon arrival there was a bad smell in the room, but as soon as i mentioned it to reception they moved us into a different room up one floor. It was fantastic and i can highly recommend a stay here. the breakfast was great too with free champagne.", "Date": "March 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Better than expected”", "Author": "MartaL", "ReviewID": "UR55314663", "Content": "I had booked this hotel through a high quality Spanish travel agency (Viajes El Corte Ingles) and though they don't work with hotels not reaching a particular standard I was a bit scared after reading some of the reviews here. We intend to visit Madrid next July with some friends so I was looking for a hotel with exterior swimming pool as Madrid in summer is hot as hell. We decided to spend a long weekend in Madrid to visit some friends and booked the Emperador to check if it would be ok for our summer trip. On my arriving someone helped me at the main door with my luggage and waited nearby while I checked in and helped again to the room. The room was perfectly ok (I've added some photographs), with a double bed, a sofa, a smal armchair, minibar, tv and desk. In the corridor (with a door to separate from bedroom) there's a wardrobe with a safe and a rack for suitcase. The bathroom was big enough, clean and not cold. I didn't actually touch the radiator but temperature in the bathroom was ok. It wasn't a bedroom with a view as it was an interior one but I prefer to be away from the noisy Gran Via anyway. There're no ironboard or coffe/tea facilities as it's not usual in Spain (same as very rarely hotels in UK have a minibar). We didn't tried the bar but it looked a quiet and nice area to have a drink and a chat. The swimming pool was obviously closed at this time of the year but we were given all kind of explanations to our enquiries for our future staying. We didn't have breakfast at the hotel and we used to have it at VIPS nearby. I like this hotel and we definitely will be back in July. The only negative remark is that it's not soundproofing at all (the door between the actual bedroom area and the door to the main corridor helps but we had a couple of German guys next door and they arrived late at night (3ish), quite drunk and noisy so it was quite annoying).", "Date": "February 6, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Munich", "Title": "“Good place to stay.”", "Author": "DMadB", "ReviewID": "UR50986516", "Content": "Has been a real good time. Nice Bar with free drinks, Sauna and a swiming pool on top of the building. Located at Gran Via. Good to reach all famous places by foot or METRO", "Date": "December 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Bad Krozingen, Germany", "Title": "“very mixed feelings”", "Author": "JoCoiner", "ReviewID": "UR49908402", "Content": "I'm astonished at the hotel manager's response to the Florida couple's complaint about the non-existing heating in the bathroom, since we experienced exactly the same. There is a small radiator under the sink which didn't work. The room is heated by the air-condition system but not very effectively either. There was one exceptionally polite and helpful older receptionist after my terrible state of having been robbed on the tube while traveling from the airport to the hotel. He called the police and the credit card agents. The other personnel was rather impolite and hardly noticed one. The breakfast quality was pretty plain and below a four-star hotel standard in my opinion. I think there are better places to stay when in Madrid. Even the situation of central in the sense of being right in the bustling Gran Via doesn't compensate for the coldness of this place.", "Date": "November 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Orlando, FL", "Title": "“How can this hotel be a 4 star???”", "Author": "Buitre03", "ReviewID": "UR48143507", "Content": "My wife and I stayed here for 2 nights from 10/20 through 10/22. I was very disappointed at the service. This is considered a 4 star hotel but the service was absent. We walked through the lobby multiple times and nobody said hi to us. The room was too small and the bathroom was very cold. The heat only worked in the bedroom. Only the location was great. When we checked out, I asked the front desk cashier to call us a cab to the airport and she told me to wait for coworker to come back. We had to walk outside in the cold and wait for a taxi to drive by. This is not a 4 star hotel. It should be a 2 star.", "Date": "October 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "San Francisco, CA", "Title": "“Great Location, Big Room, Noisy Street”", "Author": "marcigami", "ReviewID": "UR46580528", "Content": "I traveled with my two friends to Madrid, we are all in past thirty but not close to 50 years of age. We decided to stay at the Emperador Hotel for one very simple reason, we were going to be there during Aug and Sept and needed a pool. This was the only hotel is a great location with a pool. And if you are planning to be in Madrid during the hot summer months than you definitely need to stay here. The pool is amazing. It is located on the roof of the hotel and you can see the whole city 360 degrees. Sure there is a fake green grass look and the chairs are a bit cluttered but all in all the pool area is great. I did not order from the bar but instead brought my own booze in a bag and asked for a glass of ice. Not that I am cheap but lets face it, Madrid is not cheap. So lets start from the beginning. Got off the airplane, took forever to get baggage, followed the signs down to the metro and purchased the 10 ride pass. You so need to do this if you plan to get around Madrid. The metro system is off the hook! We never waited more than a minute for a train. Okay so the metro guy told us to get off at Plaza de Espana, but since I am a librarian and think I know everything I decided to get off at Santo Domingo. NOTE: THERE ARE NO ESCALATORS AT SANTO DOMINGO. YOU WILL NEED TO CARRY ALL YOUR LUGGAGE UP THE STAIRS! AND THERE ARE SO MANY STAIRS. However you end up being right in front of the hotel. If you care to get off at Plaza de Espana, they have escalators and it is a two block walk. The metro starts running at 6 am FYI. Check in: Great, they gave us a room up high and we were on our way. Now we expected it to be an old hotel and were expecting the worst. We had a triple room and were extremely worried that we would be cramped. Not at all! The room had two closets, a safe, a hallway, and the beds were all spaced accordingly. There was a desk, a sitting chair and several furniture pieces for clothing items. The bathroom was large and there were plenty of towels. The room was very clean. We left every morning very early because it was a non stop action and when we returned mid day our room was always clean. I have super bad sinuses and need to sleep with the window open rather than the air on, and if you plan to do this you need EARPLUGS. It is so loud on the street. We would get in around two or three in the morning, and people in Madrid are out until the sun rises. They love to honk their horns, scream, and have a good time. Earplugs are needed. But if you can sleep with the windows shut then you will be fine. The location in on the Gran Via, and about four blocks to the right when you exit the lobby is Corte Ingles. On the very bottom floor, the basement, Corte Ingles has a supermarket, so go there to buy all your snacks and wine and gifts to bring home. I bought tons of sausages home. And of course ham. Follow the metro map and you can get anywhere. The hotel is in a great location and I would definitely stay here again. Starbucks across the street, VIPs nearby, KFC across the street and tons of Spanish eateries.", "Date": "October 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Tripoli, Lebanon", "Title": "“nice hotel and close to shoping street”", "Author": "rene1293", "ReviewID": "UR46490008", "Content": "i stay in this hotel 5 days, very nice hotel . very close to the metro ,close to the shopping street and restaurant . room are nice and clean. staff are good. the breakfast is good. i advice every one who visit madrid , use the metro to \"discover\" Madrid.", "Date": "October 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Essex", "Title": "“Lovely place, highly recommended”", "Author": "3Hunts", "ReviewID": "UR45222000", "Content": "I really loved this 4 star hotel, great location within walking distance to major attractions and great food places. We took a taxi to and from the airport as we didnt want to be traipsing around with a LO of 16 months. The only thing i could complain about is the breakfast for the price was a bit samey and limited each morning, .more variety would have been great - ie they only had 2 types of egg and bacon on offer for warm food. and the fruit was the same every day. The room was a good size for us including a cot bed We stayed in room 138 which gave us a side view with a balcony. The rooftop pool was fabulous and very relaxing, good sunspot and lovely loungers", "Date": "September 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "29 Gruenwald", "Title": "“Beautiful Hotel”", "Author": "Shuch", "ReviewID": "UR43601563", "Content": "Nice and beautiful hotel..Its located right in the center..Shopping street \"sol\" is just a few kms away...The swimming pool was just awsome and the view from the 10th floor looked really nice!! Breakfast was nice as well..", "Date": "September 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Great location, even better pool”", "Author": "anthonyandtania", "ReviewID": "UR42345102", "Content": "We stayed at the Emperador for 3 nights in September '09. It was a great stay in a beatiful hotel, very clean and the rooftop pool is a huge plus, the location could also not have been better bang in the middle of the grand via. One thing I would advise against (unless you have an unlimited budget) is eating or drinking in the hotel which we found very expensive with a small coke at 5.25(Euro) and breakfast at 20(euro) there are plenty of cheaper options a few doors down from the hotel. A great hotel which i'm happy to recommend to anyone visiting Madrid. Anthony and Tania David.", "Date": "September 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Wonderful experience!! Beautiful pool area!”", "Author": "musictravelgirl", "ReviewID": "UR39941755", "Content": "I came here for 3 nights alone in June 2009 and everything was fantastic. The room was spacious with a massive bed and the bathroom was huge! It even had two showers, but i only used the bath one. Everything about it was clean and comfortable. A big tv screen was mounted on the wall in front of the bed but there weren't many english channels worth watching. The rooftop pool area was fabulous and JUST what you need in Madrid. The gym is small but has things you might like to use and is kept well. The Metro is right outside it and it is in the most brilliant location. The opera house/palace are just 5-10mins walk away and everything else isn't far at all. For couples this hotel would be really nice too. The staff were helpful too. The drinks and food are expensive, but so are all hotel menus! I read a couple of bad reviews before coming but the good ones outweighed them and it was worth it! You had to pay for wireless internet. Oh and also I had requested a room with a window out on Via Callas but they didn't give me one.", "Date": "September 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Kettering", "Title": "“Great Location and Rooftop Pool”", "Author": "claydo", "ReviewID": "UR39646627", "Content": "Spent 4 nights here in August. After reading Trip Advisor reviews, I decided to go for this one based on location and rooftop pool. As with other reviews, I agree the rooms are dated, although they were large and comfortable. The bathroom could do with a decent shower, and we had no natural daylight in the room, due to the location. And now the positives, which in my opinion make this a great place to stay. The rooftop area was great. It was hot and sunny, there were plenty of sunbeds, and a great pool. Plenty of towels, and a good eating area, meant we spent some quality chill out time up there. The breakfast room, which looks recently renovated, was very nice, with a good selection of food, from pastries, eggs and bacon, cereals, and sparkling wine should you feel like one. The location of the hotel is great. Situated opposite Plaza De Espana on Line 10, it was very close to both Gran Via and Sol shopping areas. Some great Tapas bars a few minutes walk away. If we went to Madrid again, I would definitely stay here.", "Date": "September 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Long Valley, New Jersey", "Title": "“Great Location for seeing local sites”", "Author": "strengthcoach", "ReviewID": "UR39630818", "Content": "I'm sorry I didn't post this one earlier, because I can't go into as much detail now! My thoughts on the Emperador: We stayed for 7 nights over Thanksgving with my family - wife and two children under 7. We had a nice room, especially considering the discounted rate that we paid. We like to walk, whenever possible to the sites, so a central location is critical for us. As has been mentioned before, this hotel is on the gran via, and it was a great location to walk around Madrid from. I don't remember the food (we ate breakfast there once) being that great. After the first night, we just stocked up from the local conveinence stores to eat the next morning. We had a fridge, and it made the trip much more affordable. I would consider staying there again, if I had to go to Madrid. Some thoughts on Madrid: I was shocked that many of the Churches were simply closed for most of the day. Unlike several other Europea cities I've been to, most of the churches were closed except for Mass and very limited visitation times. Any trip must include the Prado (art museum) - it was one of the best - if not the best - I've ever been to. The Egyptian monument/temple (I forget the name) was free, and worth it as well. It's also worth seeing the royal palace. Very impressive.", "Date": "September 2, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Dublin", "Title": "“In my opinion not a 4 star hotel”", "Author": "DublinChristine", "ReviewID": "UR39086130", "Content": "The redeemng factor of this hotel is the roof pool, great lounge beds and shade if you want it. The staff at the pool restaurant could not have been more accomodating. The reception staff were a different matter. Asking a question seemed to be an irritation to them, not very welcoming. Snacks were available on the roof, but they stopped serving at 5pm, the hotel does not have a restaurant. Also the bar staff were very stiff and not very nice, so we found a nearby bar to have a relaxing drink. The rooms were very basic and the prices were not. The hotel is in a very good location, close to reataurants and shopping. If I was to stay there again I would certainly upgrade to a club room.", "Date": "August 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Toronto, ON", "Title": "“Fantastic location on the Gran Via - close to Puerto del Sol”", "Author": "MMM_Toronto", "ReviewID": "UR38384034", "Content": "When my friend and I arrived for our 2 night stay, we were told our room was upgraded to a junior suite! While it was nice to have a big room, the beds - there were two twin beds. Not what I was expecting in a junior suite. The decor does not to be updated as it has the old-world charm...but needs to be brought into the new century. And unfortunately our toilet was not working when we got to the suite. One quick call to the front desk and they promptly sent maintenance to deal with the issue. The pool on the rooftop was very beautiful! It is a very big pool and the rooftop is quite spacious with great views of the Gran Via. The location can't be beat. Its right in the centre of town and was about an 8 min walk to Puerto del Sol. It was also very close to Plaza Mayor and the Royal Palace.", "Date": "August 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Toronto ON", "Title": "“Perfect!”", "Author": "AmandaBTorontoON", "ReviewID": "UR37499257", "Content": "Hotel was in a great location, right on the gran Via, close to Puerta del Sol. It was elegant and had very spacious rooms. We were bumped up to a Junior Suite at no extra cost. Staff was great and booked seats for Flamenco dancing and bull fight for us at our request. Roof top pool was fantastic, especially in 38 deg weather. Would definitely stay there again.", "Date": "August 12, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "New York", "Title": "“Decent”", "Author": "funnywriter", "ReviewID": "UR36514047", "Content": "I spent five nights in Madrid in the Emperador Hotel. The pluses: *The famous pool is excellent. The roof-top views are spectacular. And it's great to have a place to relax during the heat of the afternoon. *The location is excellent. A lively and gritty street with easy access to the Puerta Del Sol and the Plaza Mayor. The Metro is just across the street and no place in town is more than a short taxi ride away. *The people at the front desk are generally quite friendly and helpful. The minuses: *Some of the rooms are awful. When I arrived they put me in a roof about the size of my tiny kitchen back home. The view was of a wall. *The breakfast buffet is ridiculously expensive. It certainly is an acceptable city hotel and works just fine if you plan on being out and about in Madrid. But the hotel advertises itself as being a far more upscale establishment than it really is.", "Date": "August 2, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "California", "Title": "“Dirty and needs remodeling”", "Author": "spikeandrocky", "ReviewID": "UR35506974", "Content": "Stayed at this hotel for three nights last week. I booked a triple standard room and it was quite large. Standard rooms come with single beds that cannot be pushed together so beware if you want a double bed. The carpet in the room was worn and had several large stains. The window hadn't been cleaned in awhile and had hand and nose prints from previous guests. The hotel bedspread was just plain gross. The bathrobes were worn and had large holes under the armpits. Why not just throw these away? Serious mold in the bathroom shower. The pool is large for a hotel in Spain and there were lots of lounge chairs but the patio is covered in astroturf which is faded and worn in many spots so unappealing. Several times when we were downstairs we heard other guests complaining about various things and the hotel staff seemed to be unresponsive. If I didn't have many activities planned in Madrid and was going to spend anytime in the room, I would have looked for another hotel in the area.", "Date": "July 22, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Boston area", "Title": "“disappointing ,”", "Author": "SamCookie", "ReviewID": "UR35074605", "Content": "I was disappointed with the hotel, the room was dark and just ok. We checked in and I have traveled for many years in the travel industry but the man that checked us in didn't explain anything to us. We had included breakfast with our plan and I had to call down to ask and all he really said was we didn't get it that day { I knew that it was already noon anyway }. Upon checking out the same person over charged us the room rate telling me I had a very good rate, I told him I had an ever better one and to recheck it. I asked about a bike trip and was directed to do a bus trip across the street, I didn't ask about that and we did a wonderful bike trip around town finding the information myself. It was overpriced even the rate I had. I would not stay there again. Location was good but not great.", "Date": "July 18, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Milan", "Title": "“Hotel OK, pool is great, but....”", "Author": "AOBMilan", "ReviewID": "UR32672179", "Content": "it's crazy that it opens from 10am. I was there on business and would have loved to swim before going to the office. In the evening it closes at 9pm which is kind of early too...", "Date": "June 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cardiff, Wales", "Title": "“Amazing pool, great location but 13 Euros for a Gordons Gin!”", "Author": "travelmacca", "ReviewID": "UR31731976", "Content": "Stayed her for 2 nights. Room was good, location was very central, loads of shops and bars etc within mins. The pool was brilliant, very quiet and relaxing, great views over madrid. The concierge was brilliant too. Only complaint is the bar prices, very very high. A shame when relaxing by the pool all day, but would reccomend the club sandwich!", "Date": "June 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "fidget1954", "Title": "“decent hotel”", "Author": "fidget1954", "ReviewID": "UR30802584", "Content": "The location was good. The staff was excellent--very friendly and extremely knowledgable and helpful. Our breakfast was included. Had it not been included, the price would have been too high for the value. The downside was the heat and noise. Our room faced Gran Via, so the noise level was pretty bad. The a/c was working but they just don't allow the rooms to be very cool. Our teenagers had the same problem. The halls and common areas are much cooler. Beware--my husband was also pickpocketed on the subway. A Spanish woman told us this happens all the time.", "Date": "May 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "North Wales", "Title": "“Great location and very good rooms”", "Author": "DRG09", "ReviewID": "UR30708438", "Content": "Located on the Gran Via with metro stations very close by - about 20 minutes and 2 euros from the airport, don't pay 45 euros for a taxi as the metro is very easy to use, clean and quick. We stayed in a standard king double which was spacious enough and newly refurbished with large LCD TV located in the middle of a mirrored wall. The bathroom was also newly refurbished. On a previous stay we had a non-refurbished room which was a lot bigger and of an equal standard. The pool is out of use during winter months so we didn't get to see it. Breakfast was poor but it was in the price we got, so we just had the cereals and coffee/tea - there are plenty of places to buy an inexpensive breakfast if required. We found the staff to be very efficient and helpful including the bar staff . Most things are walkable from this hotel, Sol and it's shops/bars/restaurants is about a 10 minute walk and the same for the Royal Palace. Within the city it's one euro for a single journey metro ticket and, as mentioned, it's very easy to get around on the metro with the ticket machines being in English. Overall, this is a good quality hotel which is reasonably priced for Madrid.", "Date": "May 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Warton, United Kingdom", "Title": "“Cramped, un-inspiring”", "Author": "Pelikan", "ReviewID": "UR26099685", "Content": "1 night stay costing 105 euro for a standard room. Probably the worst hotel experience in the last 5 years or so. I declined the allocated room as it was swelteringly hot and NO a/c, (no matter what the website advertises). The 2nd room was smaller but at least had a/c. positives - central, clean negatives - room mis-described, charmless - view over a back alley - breakfast an extra 18 euros This was a good example of a website that over-promises, and a hotel management that under deliver. The much vaunted pool was closed - says it all. Well-situated in a central location, but there has to better.", "Date": "March 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leigh-on Sea, United Kingdom", "Title": "“Very Good hotel”", "Author": "Pierre48", "ReviewID": "UR22436205", "Content": "Spent 2 nights at the Emperador Hotel with a bunch of six mates. Our standard rooms were very spacious (unlike many other Spanish Hotels) and clean, albeit showing early signs of wear and tear. The staff were all extremely friendly and helpful. A very good hotel in a central location. We travelled in two taxis from the airport. One group of three were charged €25 (but about right with luggage) and the other group were charged €45 (the driver claimed it was due to supplements - a common ploy). For our return, the hotel organised an airport transfer for the six of us for a total of €45. It was prompt and supplement free.", "Date": "December 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“Fantastic Hotel”", "Author": "CultureVulture072", "ReviewID": "UR21046598", "Content": "Spent a fantastic 5 nights at the Emperador Hotel and found the whole experience lived up to the pictures on the website. The room, although a standard room, was spacious and spotlessly clean and ,thanks to the air conditioning very cool. The bathroom was spacious and clean. Only complaint would be to provide an iron in the room as the laundry service is expensive. The rooftop pool and terrace is much bigger than it looks in the website and well maintained. A fantastic place to relax after a day sightseeing with a bottle of wine. The staff were all extremely helpful, recommending bars and places to eat as well as preventing a taxi driver over-charging us (our only bad experience of Madrid). Although the hotel is situated on the busy Gran Via we were not bothered with noise. The location enabled us to walk everywhere and experience Madrid. Excellent hotel for anyone who wants to stay in the centre but enjoy luxurious surroundings.", "Date": "October 20, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Warrington, United Kingdom", "Title": "“Pool is fab, hotel is average.”", "Author": "Clare2007", "ReviewID": "UR20247937", "Content": "This is an average hotel with 2 redeeming factors which are both enough to recommend a stay here. 1 is the location, right on the Gran Via, as central as you can be. 2 is the fab rooftop pool and bar area. Rooms are a decent size and are quite nice. Not the cleanest though and the maid only makes the bed and gives you fresh towels, no cleaning as such and is in the room 15 mins max. Breakfasts are average, the hot food is pretty dire but there are plenty of cold items, bread, pastries, cheeses, ham etc to make for a decent breakfast - and there is sparkling wine too. Overall I would stay here again and recommend it to others.", "Date": "September 21, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "3.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Nice pool but with thieves!”", "Author": "FamilleDiF", "ReviewID": "UR19856460", "Content": "We booked the Emperador because my mom lives a block from there but couldn't accomodate our two families. So we obviously know the area extremely well, and being in August, we thought the kids would enjoy the rooftop pool in 40C weather (good thing we did, because there was a heat wave the day we arrived). The A/C actually works quite well. Reception was incredibly impersonal for a 4* hotel. We had three rooms on the same floor and they apparently upgraded us to club (which we appreciated due to the added security of an extra door, but we didn't used the lounge or anything like that) Breakfast was quite nice, especially for us Spanish born, all of our favourite things were available! Although again, the A/C was extremely strong (OK for American standards) The pool is, on paper and on site, extraordinary in size. Never seen a pool this large on a rooftop (close to 20m in length and almost 3m deep at one end), with a lifeguard (mandatory in Spain). The problem is that the whole deck/terrace surrounding the pool was chock-full, thankfully we only went late afternoon, when all the sun-crazed cancer seeking people started to leave. The bar rates are outrageously expensive (4EUR for a Coke), particularly knowing that most of the customers were residents. There were lockers in the changing rooms but my son and nephew did not think of locking their things. And sure enough, one watch (no huge cash value), and a t-shirt (definitely no cash value), were stolen. In itself, it was obviously our own fault, but I totally hated the pool employees telling me \"oh this is the FIRST time this has ever happened\" Come on!!! (we did see a group of young men who clearly were not staying at the hotel, probably the staff's buddies, who came and went). We were then told the hotel manager would come and talk to us, which he/she never ever did. So, even if legally they are not responsible for this, they obviously don't even care. Also, if you are allergic or have respiratory problems, this is NOT the pool to go to, as there is a very high level of pollution, and mixed with hot air, it can probably get you killed. I have no particular problems and couldn't stay very long because my throat was stinging and I started to have a dry cough. But not surprising as the hotel is on Gran Via (it's like Times Square in NY) and there are only 8 or 9 floors. I will definitely will not stay at this hotel ever again. It was not worth the money.", "Date": "September 7, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Buffalo, NY", "Title": "“Ahh!”", "Author": "hipfan14224", "ReviewID": "UR19804142", "Content": "The pool is huge for a roof top one, the water refreshing, and the complimentary gin & tonics in the Emerador Club room were even more refreshing. Apparently during are stay, the Club rooms location was temporary, but on the day of departure, it was returned to it's usual place, which included a bar with beer tap, as well as the large screen tv and chairs/couches. The hotel room itself was nice sized, bathroom very nice sized. Close the windows, it was quiet, open them, and you could clearly hear the lively Gran Via below. This hotel was definitely one of the best on a 2 week trip.", "Date": "September 5, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "UK", "Title": "“Awful!”", "Author": "Fiona133", "ReviewID": "UR19459376", "Content": "For the price this has to be the worst hotel I've ever stayed in. We booked a club room for a romantic weekend, and were almost reassured by the fact it was so expensive (about €720 including taxes for 3 nights breakfast not included!) as we were after luxury and relaxation. Our room was horrible. It was much much smaller than the internet pictures suggested and it had twin beds even though we’d specifically booked a double. The only sign it was a club room was a large elaborate chandelier which dwarfed the room and looked ridiculous. We called reception, who were very off handed and told us there was nothing they could do as the hotel was fully booked, we weren’t happy so were told they ‘might be able to move us to a double if we rang again the next day’. We were pretty fed up so tried to cheer ourselves by going up to the roof top pool. The pool itself looked fine but it was extremely messy around the pool area, it wasn’t a relaxing space at all. I know it’s not the fault of the staff if customers move sun beds or leave litter, but I think it unacceptable in a hotel of this class that they don’t employ someone to have an occasional tidy up. Next we went to the club lounge. First - it’s not a ‘lounge’ at all, but a curtained off area of a breakfast room. Second – it made the pool area look pristine! The bar was covered with litter, half full glasses and decaying snacks. There’s no way I would have wanted to drink there. We’d seen enough. We went to the Room Mate Laura (where we’ve stayed before); they were fully booked but the friendly receptionist called their sister hotel Room Mate Mario who booked us in for the next two nights so we only had to spend one night at the Emperador. At Mario we were up graded from an executive room to a huge junior suite and our stay cost us less that half what the Emperodor would have cost! I’ve read reviews on here from people who’ve had a good stay at the Emperador so some of their rooms must be nice, but my advice would be not to risk it. At the prices they charge all their rooms should be nice, their public areas better cared for and receptionists more civil. The only plus points were - the location (though the Room Mate Mario was only 5 minutes away on a much quieter street behind the opera house), one out of three receptionists we spoke to was perfectly friendly and efficient (too little too late), our bathroom was perfectly adequate, our room had a tiny balcony with a good view. But these small plus points no way compensated for all the negative aspects of our stay.", "Date": "August 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leeds, England", "Title": "“3 great days in Madrid”", "Author": "WorldWideTours", "ReviewID": "UR19437930", "Content": "This hotel is great. A true 4* with all amenities. We didn't stay in a Club Room as we were weren't planning on being in the hotel that much and wanted to eat / drink in Madrid not in the hotel so didn't think we would get the value. Our rooms (2 doubles) were small but clean and the bathrooms were relatively new with fresh towels daily. The view was non-existent but we didn't mind as we didn't spend any time looking out of the window!!! The rooftop pool was superb, especially after a days sightseeing and the breakfast was also plentiful. The hotel itself is well appointed and we only met helpful staff - they rang restaurants for us and made reservations and also helped with a few directions. The bar is expensive but we only had one drink there. Santo Domingo metro station is right outside and all the main sights, except possibly Retiro Park, are in walking distance. We booked via HotelClub.net and got a double room and breakfast for £126 per night - well worth it if only for its location and the pool. Definitely recommended!!!!!", "Date": "August 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Nyborg, Denmark", "Title": "“Big mistake”", "Author": "harholm", "ReviewID": "UR19407750", "Content": "I booked the room in april / may, cause I like the location and thought the rooms looks okay and it was a plus with the roof garden/pool. Arrived late, the room was ready, but the service at the desk was - sorry my \"french\" so damm snobby, that I was about to turn around and walk out again. But since I was not alone and we where tired after a long day with traveling, we checked in. The room...was a run down room, nothing like the ones the \"claim\" to have on the net (photos). Okay, so I did not book the fancy suite, just a normal twin bed room, but.... it was run down and ready for renovation. The service, did impove on the day shift, the where kind and abel to help. The pool service, was great - nice \"kids\" working there and all in all, a nice place to spend a few hours after a long day of sightseeing. Only minus - the pool is freezing. I'm somewhat close to a polar bear, but I nearly had a heart attack jumping in. You have to swim to keep warm or get out. The location is great. Would I recomend the hotel? No ! I would go for a cheaper one or pay for a better suite - but never that hotel again. We had arranged for a \"limo drive through\" town one night, and the service staff, could hardly keep there noses from the windowns, as the stod there watching and drowing and talking about \"who it might be for\". Diskret? No, never.... Best...was when we went out to the limo - the nose in the sky receptionist (from the night before), almost pushes us away when he was trying to get in the hotel door, after talking with the driver...guess he was about to look \"for the secret famous person\" who lived in the hotel - while it \"just was us\" - the joke was on him.", "Date": "August 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Fantastic Position”", "Author": "cdavies757", "ReviewID": "UR19380540", "Content": "I stayed at the Emperador Hotel for 3 nights on the 22nd August. This was my fifth trip to Madrid in 5 years and the hotel was simply the best I've stayed in based on location and the roof top pool. The bedrooms were simple but perfectly clean and adequate but the most engaging feature of the Emperador is the roof top bar and pool. There are not many City Centre Hotels in Europe that have this facility. In a hot climate like Madrid its perfect to sit by the pool with a cool drink after a day sightseeing. The location is on the Gran Via and a Metro Station is 100 meters away. An excellent choice ............", "Date": "August 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "York", "Title": "“Great location”", "Author": "Jade-Stamford", "ReviewID": "UR19060793", "Content": "We have just returned from a 4 night stay at the Hotel Emperador in Madrid. This is a great hotel if you wish to combine sightseeing with relaxation as the location is great and the rooftop pool and sun terrace provide a welcome treat after busy days visiting nearby attractions and bargain hunting in the surrounding shops. The hotel is ideally located for the main city sites - less than 10 minutes walk to the Royal Palace, the Cathedral and the Plaza Mayor (great for food and drink day and night without traffic!). It is a little further on foot to other attractions such as the Prado Museum of art and the beautiful boating lake in the Parque del Retiro. The hotel is also just a short journey by Metro tube to the Zoo and nearby theme park - Parque de Attractiones. We loved Madrid and will definitely stay at this hotel again because of its location and the rooftop pool. The rooms were clean and comfortable, the breakfast sufficient. Prices of drinks in the bar were high and even more expensive on the rooftop - 42 euros for a bottle of brut Cava (our favourite Spanish tipple) 22 euros for 2 white rum and cokes, €16 for a litre of beer and €4,50 for a small coffee. There is a wide choice of places to eat and drink near the hotel, some charging almost as much so it's preferable to shop around if you're on a modest budget.", "Date": "August 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "england", "Title": "“Great Hotel”", "Author": "cantthink", "ReviewID": "UR18315301", "Content": "We stayed in the emperador for three nights in a triple room and although I would agree the room was not 4 star but it was lovely. It was clean and spacious enough. The linen and towels etc were changed daily it was only the wall paper that was a little worn. The hotel was very quiet even though it was fully booked. The rooftop bar and pool is worth the stay alone. The pool is 10 floors up and offers a magnificent view of Madrid. Also be prepared as the pool is bracing to say the least but welcome as it was 40 degrees plus. There are lots of sunbeds as long as you're there before 2. The bar is however expensive (London prices) The hotel itself is fab, really clean and shared areas very 4 stars. The staff were friendly enough and efficient. I really can't fault the place. We didn't have any meals in the hotel but out of the door and left are Italian restaurants and right there is VIPS which serves a good value breakfast. I would also recomend Vitamins for lunch and fruit drinks. The tour bus stops just over the road and is great, it doesn't start till 9.30 but runs to midnight, good as it takes you to most major places. Overall a great hotel and very central with close amenaties.", "Date": "July 27, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Belfast", "Title": "“Basic room but worth it for the pool”", "Author": "KfromBelfast", "ReviewID": "UR17934139", "Content": "Stayed for 4 nights and had a pleasant experience. The room was clean but small and I wouldn't consider it 4* standard. Had a view of a brick wall and as the room was joined to another we could hear voices/TV through the wooden door. Toiletries provided weren't great (would have liked some conditioner!) there is a hairdryer. There is a safe.The room was cleaned each day. However the location was excellent and the swmming pool area was very nice with good views- towels provided. I found the staff helpful. The breakfast was good with a large selection. It cost 22 euro for taxi ride to airport.", "Date": "July 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mexico City", "Title": "“one of the best hotels in Madrid”", "Author": "cuatemochas", "ReviewID": "UR17920779", "Content": "My wife and I were in this hotel a few weeks ago. We booked the 922 room, a club romm with one queen size bed and a balcony. We went to the club bar to drink some beverages free of charge. The bar tender was a very funny a kind guy. On the roof there is a beautiful swimming pool, not large but very clean. People in the frot desk was very kind and quick.", "Date": "July 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "India", "Title": "“Perfectly located hotel”", "Author": "travelguyandgirl26", "ReviewID": "UR17859108", "Content": "My husband and I stayed at the Emperador hotel for 4 nights in July, and thought it was quite nice. What we liked the most about the hotel was its location.. its great especially for tourists! All the major sightseeing places (the plazas, royal palace, etc) are located within walking distance of the hotel. There is also a tourist information center close by. Metro station right outside the hotel, and since the hotel is located right on Gran Via, there are plenty of shops and restaurants nearby. (we recommend Pizza Marzano right down the road from the hotel) The people at the front desk are not very friendly (except for Aurora.. she is very helpful).. the room was a little small but still clean and comfortable. Bathroom very clean. Noises in the night didn't wake us up, but we weren't facing the main road anyway. Breakfast was included in our package and was ok, no complaints but nothing fantastic either. We were initially a little worried about going out in the night since we heard its not so safe.. but we were out till 1030 without any problem.. beyond that not so sure since we didn't risk it! Overall a nice hotel, clean, centrally located and convenient. Would definitely recommend it.", "Date": "July 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bergen", "Title": "“Lovely stay in Madrid”", "Author": "zzcorber", "ReviewID": "UR17500325", "Content": "My husband and I stayed last week in Madrid, and we chosen Emperador Hotel to stay 3 fab u lous nights! This hotel is located in Madrid Centre, with Metro Santo Domingo just in front of the building. We booked a room in Club Emperador because we had read some post in internet where recommended upgrade to have a better room and views to Gran Via and we thought it was a good decission because our room was big, comfortable, good size and had extra services like coffee & tea maker. The decoration of the hotel and rooms is very very classic, event it is totally refurbished. During our check-in a young man was helpfull and nice, and informed us about Breakfast, Swimmingpool and Club Emperador Lounge. He was very friendly during our stay, and he gave us a Madrid map with usefull information and reccomendations. During every morning, we visited Almudena Cathedral and Royal Palace, Prado Museum, Faunia and the big store \"El Corte Ingles\" in Preciados street for shopping. We lunched in the Restaurants typical of the Plaza Mayor or other nice streets in the centre, with Spanish food. During afternoons, we enjoyed Madrid sun in the swimming-pool of the hotel, absolutely wonderfull but only one dissappointment: the drinks and food in the bar too expensive... But we had drinks and snack included in Club Emperador so when we wished have a drink, we went to Club Emperador Lounge. The breakfast was good, in a nice room with natural daylight and the staff was correct. We recommend this hotel to visit Madrid because is comfortable, good location and have Swimming-pool!!!", "Date": "July 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bolton", "Title": "“Good location but accomodation not worth the rates”", "Author": "jmpadams", "ReviewID": "UR17102906", "Content": "We stayed at this hotel for 3 nights on 17th June and whilst it was a nice looking hotel and a good location the rooms were small and basic. There are other hotels in the area which are much cheaper . A good point about the hotel is its roof top pool which is pretty but be warned it is freezing! Also if you are on a budget dont consider buying drinks or food here as they are very expensive. All in all the hotel staff are friendly however some will go out of their way more than others to make your stay worthwhile. We have been to various places in Spain, including Barcelona however we wouldnt rate Madrid as one our favourite destinations and dont think we will be visiting again. A good point was the metro network and you can get to and from the airport quite quickly There are some nice eating areas around the hotel but watch out for some dodgy areas around the Gran Via with ladies of the night virtually every few yards with pimps near by and rip off bars. Another point to remember is brush up on your Spanish as most bars owners do not go out of the way to understand what you are saying and quite rightly so!. Lucky for us my wife learned some simple Spanish before we left England!", "Date": "June 21, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Kennett Square, Pennsylvania", "Title": "“Hotel Emperador--Madrid's Classic Hotel”", "Author": "MLtravels", "ReviewID": "UR16654498", "Content": "I had the pleasure of staying at Hotel Emperador during my stay in Madrid in May 2008. This classic beauty is in the heart of Madrid located on the Gran Via. Its traditional and elegant decor takes you back to the style of Old Europe. I choose the Club Emperador Room, Jr. Suite. I highly recommend choosing the Club Emperador type of accomodation as it included entrance into a private room that offered a complimentary bar of snacks, beverages and alcohol. Also, breakfast was included which was a large and delicious buffet. There is a beautiful lobby with seating and a bar area. There is a large roof-top pool with a view of the city and especially the Royal Palace. This area is beautifully maintained and a bar is located at poolside as well. It was a treat to take a moment to sit in this area taking in Madrid from high above the city. With ease, I was able to walk the city from the Hotel Emperador. The Madrid Vison Tourist Bus was on the corner right outside the hotel. Many cafe's were near the hotel and a Starbuck's is across the street. I found the front desk personnel to be very friendly, helpful and they spoke english. The room was large with windows that opened onto the Gran Via. The furnishings were new and the room was very clean. The bathroom lovely with a large tub and bathrobes. I was happy to not hear any hall noise or noise from the room next door. A very quiet property. I will surely return to the Hotel Emperador and hightly recommend this property for any traveler who likes their space to be traditional elegance. Once you take in the beauty and cleanliness of Madrid, it will surely be a favorite European destination. The architecture of each building is beautiful...a very artistic city.", "Date": "June 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kiwi in UK", "Title": "“Fantastic!”", "Author": "Kiwi78", "ReviewID": "UR16648671", "Content": "I stayed here with six friends last month for 3 nights to celebrate my birthday. We booked two 'triple' rooms. We booked via the hotel website and chose to go with 'standard' rooms including breakfast. Having read other reviews, I can't say I was expecting our rooms to be up to much, so what a surprise we all had when on our arrival we found we had been put into two of the \"Club Emperador\" suites. One of which was the \"Grand Via\" suite on the 9th floor. Both rooms were lovely. We had use of the \"club\" and enjoyed our free gin and tonics, schnapps and beer! I must say though, that we stumbled across the \"club\" quite by mistake, so if you are staying in the \"Club Emperador\" part of the hotel make sure you locate it early on into your stay. The rooftop pool was gorgeous but unfortunately it was far too cold to go swimming so we just enjoyed the fabulous view of Madrid. All in all, we found this hotel a great place to stay. It was a very central location, close to shops, cafes and restaurants. All six of us would definitely stay here again!", "Date": "June 3, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Frogner", "Title": "“A four stars hotel with zero star service”", "Author": "EspenHilde", "ReviewID": "UR16098965", "Content": "I informed the hotel when I booked and also in a reminder mail before we went, that the stay was as celebrating for my husbands 50th birthday. It’s quite common that hotels do their best to make some surprise like a bottle of wine on the room on such days. On this hotel however, nothing was done for him! They did not treat their customers as guests at all. And everything was done to get paid for. After travelling a lot both in Spain and other countries, I can hardly remember a hotel where you have to pay for using the Internet (the last years). I don’t mean wireless on the room, but at a PC in the common area. In our package entrance to a club with free snacks and drinks was included. We were guided by the staff about where the breakfast was and so on, but not a word about the club. We had to find it ourselves. This was obviously a policy to avoid guests going there. We talked to some other guests and they had the same impression The 8th of May, when I thought they would give some extra service, the club was even closed, for some arrangement. It means we paid for a service that they were not able to give us. And all they did to make up for it was, after we asked for it, one drink in the lobby bar. And they were so afraid of extra costs, that we were not allowed to drink something else than was in the club – What a guest treatment!!! - The day after we went to the club, and then we had to ask for filling up the gin and waiting for that! And after that we had to do the same for the tonic water. We informed the staff during the stay that we were disappointed, but they did not care. Afterwards we wrote them a mail, and they didn’t response to it! A hotel to stay away from!", "Date": "May 16, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "North Wales", "Title": "“Great breakfast!”", "Author": "Superb", "ReviewID": "UR14715649", "Content": "Spent four nights at the Emperador. Very comfortable room. Breakfast was superb - loads of fresh fruit and everything else one could want. Staff very pleasant and helpful. Great location.", "Date": "April 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Huntingdon, United Kingdom", "Title": "“Fab location, tiny room, good bathroom!”", "Author": "buffgirl73", "ReviewID": "UR14560743", "Content": "We've stayed on Gran Via before and I have to say I was expecting a noisy hotel with safety issues after reading some of the reviews here previously. What we found was a clean hotel with surprisingly quiet rooms with friendly staff. Check in was quick and easy, our room was on the 4th floor, kind of in the middle of the building as we faced a wall and it was clean but very compact & bijou! Facing the wall actually worked in our favour to be honest because the \"air conditioning\" seemed to be set to heat no matter how low it was on, so we were forced to have the window open, but because we weren't on the street there was no noise whatsoever! The bathroom was pleasantly surprising in terms of being a reasonable size with what seemed to be fairly new fittings. I wouldn't personally class this hotel as a 4 star, but I know it's based on ameneities, and in theory, the Emperador has a lot. What we were after was a good location and you don't get much better than being towards the top end of Gran Via. As long as you don't plan on spending a lot of time in the room (why would you in Madrid?!), I would recommend this place for all sorts of people as a perfect base with pleasant staff.", "Date": "March 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "DUBLIN", "Title": "“Great Place To Stay”", "Author": "DublinJohn", "ReviewID": "UR14093640", "Content": "I stayed here with a group of my friends.It is in a great and safe location.The hotel staff were very good to us and all that could be done to make our stay more enjoyable was done.I got a club room and it was very big and clean,the other rooms are smaller but cheaper. Overall a fab place to stay....", "Date": "March 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Wherever the cheap fares take me", "Title": "“Noisest hotel stay EVER”", "Author": "antonius66", "ReviewID": "UR13909275", "Content": "I stayed here for 10 days with some friends in Feb 2008. First the positives: 1) The location of this hotel is GREAT. It is right next to a Metro station, right on the Gran Via and easy to get to most anything from the hotel. 2) The price was good for the location and quality of hotel. 3) The room itself is pretty nice...fairly large, nice bathroom, beds etc. Now the negative... The walls in this hotel are like wet toilet paper. We heard EVERYTHING going on on the entire floor. The maids were super loud every morning and I could hear them yelling outside my door every morning starting promptly at 0730 hours. After complaining, I didn't hear them yelling, I just heard them blaring over their walkie talkies. Every time a door slammed (which was often) I could hear it rattle my room. Basically, I was up every morning at 8 am because I didn't have a choice. They apparently were also doing some type of construction, as I heard drilling and hammering in adjacent rooms alllllllll day, every day. There was basically no sleeping in, and no quiet peace in the room during the day. Now, my mother has also stayed in this hotel before and says it was very quiet, so I apparently was very very unlucky. All in all, despite the major sound issues, I would give it one more run, as the price and quality of the room/location were very good.", "Date": "February 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Loved it”", "Author": "Mark B", "ReviewID": "UR12213350", "Content": "This hotel is a mere 10m from the metro station and that's no exaggeration at all. It's also on a very busy, high energy street which is bang in the city centre so it's very convenient. There are a pair of windows to keep the noise down to nothing and the aircon works well so the rooms are comfortable. They're also reasonably sized and well fitted. The bathrooms are exceptional. The staff are very helpful and all have enough enough English to help out. There was a minor problem when we were given the wrong type of room - twins aren't very good for a romantic getaway! - but it was sorted instantly. The pool on the roof is great. It was a little cold when we were there but it was October so that's to be expected. If you want a sun lounger that is sheltered from the wind, you'll have to be up early. We didn't eat there so can't comment on that but overall the hotel is great.", "Date": "January 1, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "World traveller", "Title": "“Great location but ...”", "Author": "RiannaWorldtraveller", "ReviewID": "UR10990038", "Content": "Great location but had the potential to be so much better! A bit shabby chic. Breakfast not included, no kettle in room and internet in room costs 7 euros for an hour! Only English TV channels are CNN and SKY news. Was okay but with a litlle extra could be great.", "Date": "November 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Derry Ireland", "Title": "“had a great time”", "Author": "LiamGeraldine", "ReviewID": "UR10460510", "Content": "had a fantastic time at this hotel, great location right on the Gran Via, surrounded by many bars and restaurants and within walking distance of all the major attractions, hotel staff really helpful recommended places to check out and took care of our luggage as we had a late departure time, loved the buffet breakfast, great choice, fruit ,cold meats,cheeses, eggs,bacon,saugages,pasteries,would definitely go back to this hotel but before end of September as the pool was closed when we were there and it looked absolutely beautiful, only downside was, we were allocated a room that had no view and looked on to the hotel wall which made the room very dark. Madrid is a beautiful vibrant city can't wait to go back again", "Date": "October 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Quarteira, Portugal", "Title": "“Excellent Hotel - I loved”", "Author": "Laurapintas", "ReviewID": "UR10354087", "Content": "Very good hotel.Excellent room with 1 double bed and 1 single bed.Good and big bathroom.The breakfast is great.Metro is in front of the hotel.", "Date": "October 26, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Scotland", "Title": "“Beware the roof !!!”", "Author": "Tattiehowk", "ReviewID": "UR10022395", "Content": "We booked two rooms here and one being a triple beddded room. All were clean and comfortable. The hotel was advertised with a swimming pool but I expected a small tub. It was however a fairly large pool where you could actually do a bit of swimming . Around the pool were sun loungers or you could sit at tables. Then you can go to the bar at the pool entrance and order whatever you require. The sun loungers were being put to good use when I was there. It is certainly a good way to relax after a day of sightseeing.The only trouble is that you may want to lie there and forget the Prado visit. The changing rooms and toilets were immaculate Breakfast was the usual scrambled eggs to cheese and meats. The staff were pleasant and when needed , helpful Situated down the Gran Via , it is in a fine spot for all tourist sights Thanks to a previous reviewer who said the hotel was right o/s Metro Santo Domingo.Otherwise it is a five minute treck from Calleo or 10 minutes from Gran Via", "Date": "September 30, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Disspointed by dishonest service.”", "Author": "addar", "ReviewID": "UR10000416", "Content": "We booked for 3 Club Rooms via our travel agent and paid good money for them. Upon checking-in, they gave us 3 rooms on the same floor as per requested, BUT without informing us, gave us only 1 club room! The non-club rooms were old, dirty, run-down, noisy and lack amenties. I called the reception and ask for a change of rooms and they said impossible as the hotel is fully booked!!! I went to the reception desk to demand for the change, with the reservation slip that stated clearly that the booking was for CLUB rooms. The same staff who checked us in was not apologetic at all, and told me that if we change the rooms, then they wouldn't be on the same floor. I said ok. He upgraded one of the rooms to a junior suite on another floor, but as the hotel is fully booked, he can't change the other room till the next day. What disappointing service was that... despite being in a good location. Well, there are very many other hotels in the vincinty which guests can choose from.", "Date": "September 25, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Grand Hotel”", "Author": "JodyZ", "ReviewID": "UR8715889", "Content": "We stayed in a Junior Suite with an adjacent club room for our two kids. The Junior Suite is incredibly spacious with sweeping views of the Gran Via. Ideally located with a rooftop pool (a must in August) and walking distance to Puerta del Sol, Plaza Mayor, The Palace and a quick taxi ride to the museums. Our rooms were ready at 10 am when we arrived, exhausted from an overnight train from Paris and the staff was incredibly accommodating. The club was a great place to regroup and have a refreshing cold drink after a day of touring. This was a grand hotel in the old tradition, old but well maintained and spacious by any standard.", "Date": "September 14, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "bergen county", "Title": "“Hotel Emperador -- A great choice in Madrid”", "Author": "door60", "ReviewID": "UR8655390", "Content": "We loved this hotel! We stayed in a Club Room, as we read those were slightly better than a regular room. The room was spacious (by European Standards). There were 3 of us -- my husband, my 10 year old son, and myself. The bathroom was beautiful. We were close to everything -- including a metro station. The pool was really beautiful, but we did not take advantage of it. We also did not take advantage of the buffet breakfast, but if we would go back to Madrid again, we would take the buffet breakfast. Eating at the hotel saves a lot of time wandering around deciding where you're going to eat. I definately recommend this place!", "Date": "September 4, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Freehold, New Jersey", "Title": "“Met our needs”", "Author": "Joycee62", "ReviewID": "UR8548190", "Content": "Just spent 5 nights and we were pleased with the hotel. Arrived from US after flying all night and rooms were ready early, as we had requested. Our request for quiet side of hotel and 2 rooms adjacent was honored too. Room was a nice size, clean and had a modern bathroom. There was not much drawer space for unpacking. The front desk staff was helpful, although one receptionist kept giving me incorrect information, so be careful. Rooftop pool was beautiful and a great place to relax after a long day of sightseeing. It stays light out until 9pm so we took our evening \"siesta\" there before dinner. Prices for drinks VERY expensive, a coke was $5Euro. Location was great, walking distance to Puerta del Sol, Plaza Mayor and Plaza Espana. Plaza Domingo Metro Station right outside the door. Gran Via is very touristy and a bit dirty though. Breakfast was suitable, meats, cheeses, eggs and fruit. I would recommend staying here if you want a larger hotel with many ammenities.", "Date": "August 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dunmanway, West Cork, Irealamd", "Title": "“Lovely Hotel.”", "Author": "PatriciaNoreenAnn", "ReviewID": "UR8513275", "Content": "Stayed with my Friend and her 2 Grils. Got two twin rooms, they were spacious, mini-bar, hair dryer in the room,they have a safe but you must get a key off reception to activate the safe, they do not have a tea & coffee in the room at all. Look for a non-smoking room. The roof top pool was lovely, water cold but once you are in the pool it is good and there is plenty of sun seating area for those you wish not to swim. The drink and food is very dear in the pool area alright. Check to see if the pool is opened before you booked has it is closed some of the months. The breakfast is not your Irish Breakfast at all, cold meats, cheese, yougurts, fruit, etc. The staff were friendly and very helpful. I would recommand this hotel to stay in. It is central to the shopping area.", "Date": "August 27, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London", "Title": "“Staff rude”", "Author": "Londontraveller82", "ReviewID": "UR8398891", "Content": "We stayed at the hotel for a week, and was not impressed by the staff at all, which was a shame. The first morning we went for breakfast reaching the door, well before breakfast was meant to finish. They refused to let us in and when we complianed to the manager and he accused us of lying, after refusing to budge he finally went downstairs and asked the staff to let us in. Our room was an interconnecting room, however after two days of being there we noticed someone open the interconnecting door. The staff had not locked this door, prior to us staying there. I noticed my money had been stolen, most likely from someone entering the interconnecting door. I alerted the staff and was again told i was lying and then saying that it was my family who must have stolen the money. They refused to help or even write a letter stating i had informed them so that I could claim on my insurance. The staff were just rude, in particular the manager.", "Date": "August 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Prestwich, United Kingdom", "Title": "“Great hotel, fab location!”", "Author": "HellieCopter", "ReviewID": "UR8234896", "Content": "Our trip was somewhat overshadowed by an extremely difficult journey and lost baggage, but I will try not to let that affect my review of the hotel!! We were a group of 7 girls and stayed at the Emperador this weekend on a hen party (a sophisticated, relaxing one!). We had two twin rooms and a triple. Our 3rd floor rooms were very varied - one large with a lovely view (321), one smaller also with a good view of the gran via (327), and one small with a view of the opposite wall (320) but all rooms were clean, tastefully decorated and even the small room was a comfortable size. Plenty of wardrobe space and general storage, a tv, a radio/cd player, good size bathroom (with good selection of toiletries). The shower is okay. Good water pressure and temperature, but quite a small shower head with thin water jets, which was a bit disappointing. Housekeeping was very good. The air conditioning was excellent. Very efficient - meaning we didn't need to leave it whilst we were out (which is a pet hate of mine - excess energy consumption and all that!) We paid a supplement for the Club Emperador rooms, which got us more spacious rooms (although we didn't see the other rooms) and a seperate lounge/breakfast room. There was a larger selection of breakfast foods (which was excellent in both the standard dining room and the club room). The lounge also provided free drinks during certain hours (alcoholic and soft drinks) and although not a wide selection, was great for the group congregating before going out for dinner. The rooftop pool area is lovely. Great views. The pool is a good size so you can have a proper swim, but be warned, it's very chilly!!! It's breezy up there, but for us that provided a welcome cooling from the hot sun!There are plenty of loungers and towels are provided up there. It was busy on the weekend but much quieter on the Monday. The pool bar is also good and does lounger service at certain times. It's quite pricey, but that's to be expected in a hotel (6 euros for soft drinks). There's a good changing area, which is handy if you want to relax after checkout and shower/change. The pool itself is open to the public at some times. There are 3 lifts...small but relatively quick. Two are facing the main lobby, a 3rd is just round the side to the left, which is less used and arrives much faster! This doesn't go up to the pool though. The staff were attentive and helpful. They helped us a lot by making calls for us in Spanish, to check our lost luggage. Their English was also very good. The concierges were very helpful. We did encounter quite a few problems at check-out, which delayed us by an hour! We were charged different rates from those we'd booked at, had extra breakfasts charged but the person who did the booking had printed all our info out so we were ok eventually! I'd just advise checking your printed invoice carefully before paying. Overall, a very nice hotel and I'd definitely stay there again and recommend it to people. If you hunt around on the internet for good rates, it's pretty reasonably priced too.", "Date": "July 25, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Rayleigh, United Kingdom", "Title": "“Spot on location if a little pricey.”", "Author": "colinrchorley", "ReviewID": "UR7780444", "Content": "3 of us stayed at the Emperador Hotel Madrid for a short 2 night weekend break to watch Real Madrid and found the hotel to be fine for what we needed but maybe just a few niggles to be called exceptional. Getting to the hotel is very simple. From Barajas Terminal 4 you can get the Metro straight into the city for next to nothing and is relatively quick. I went to Madrid last year and had to get a bus to the other terminals but they have now extended the line to Terminal 4 saving lots of time. The Metro station Santo Domingo is more ort less right outside the hotel although we found it easier to use Callao and walk as Line 2 seemed very quiet compared to Line 5. From the outside it looks very impressive looking directly out on to the Grand Via with a large revolving door to enter through. Checking in was quick and simple and cannot fault the service, I requested the football tickets to be delievered to the hotel before my arrival and indeed the hotel had put them aside for me (much to my relief as they had cost a small fortune and the game was only 2 hours away at the time). 2 small lifts in the main lobby were available although believe there were more lifts round the side but can be a problm at check out time when the lift is taken up completely but one family with luggage and is not that quick either. We had booked a triple room and were up on the 6th floor. Initial impressions were good, a small hallway took us into the room, triple was indeed 3 single beds which is what was hoped for although the room was actually a twin room with a temporary bed rolled in (unfortunately for me I got that one), in saying that though the bed was quite comfy and slept soundly on it. The room had plenty of space, somewhere to hang shirts but maybe could have done with a few more hangers (something I'm sure you can request from reception), a safe was available but needed a key to unlock from the inside so not sure if this was a cost option or not so did not use it, the air conditioning was excellent and cooled the room down very quickly, the bathroom had a bath or shower and was perfectly adequate even for 3 needing to share but the toilet was a little awkward to get on properly. We had a view to the side of the hotel so were just slightly off the main road but the noise could still be heard even on the 6th floor (mainly sirens rather than the traffic itself though) but did keep one of us up most of the night. The location though for getting round Madrid is excellent as its right in the middle of the city and pretty much everything is accessible on foot but the Metro is quick and effecient too. Breakfast was included in the price and was a very large selection of cereals, cold meats, pastries, bread rolls, cheese, fruit and hot breakfasts in the form of bacon, sausages and scrambled eggs. It can get quite busy so be prepared to wait in line before someone takes a room number and sits you down, especially if you are a large group. The lobby area is very relaxing for having a quick drink before going out if a tad expensive and we also sampled the rooftop terrace complete with swimming pool but it was a little cold at the time to go in so stuck with a light lunch instead which was very nice but if again a little expensive. All in all I suppose this would be the only real problem wth the hotel, we paid a total of £314 (originally £330 through Airmiles but got the reduction) for the room for 2 nights which is fine when split between 3 but may be a bit slightly overpriced for the room itself. Other than that I enjoyed the stay and would be happy to recommend to anyone else staying in Madrid.", "Date": "June 5, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin, rep of Ireland", "Title": "“really enjoyed our stay here”", "Author": "mcdd", "ReviewID": "UR7683558", "Content": "Just back from a two night weekend break in the emperador hotel. It was a girlie weekend and I must say the hotel lived up to our standards. Its in a good location walking distance really to the puerto del sol and most of the nightlife. The rooftop pool was a big plus with this hotel as the fri we arrived was extremely hot and it was really nice to just lie by the pool and chill out for a couple of hours, however i did find drinks quite expensive here. My only regret was that i did not book another night in this city we had such a great time and hope to go back soon. For any girls looking to do shopping here its fantastic found the best bag shops at unbelievable prices and for nightlife we went to Dubliners which wasnt your typical irish pub plenty of other nationalities drank here also. We just found it had a great atmosphere here. The hotel was comfortable, clean had a lovely bathroom and i would definately return to this hotel.", "Date": "May 23, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Anstruther, United Kingdom", "Title": "“Good Location”", "Author": "Woo4uk", "ReviewID": "UR7630401", "Content": "The hotel is in an excellent location on Gran Via a short walk from Puerto del Sol, Plaza Mayor and the bustling nighttime area La Latina. From that perspective it is an excellent choice for a city break. The public areas are smart and I understand that some of the rooms are very nice. (My travelling companion had stayed at the hotel before). Our room was a very small double even by city hotel standards. Despite a request for a high floor we were on the second floor with a stunning view of a dark alleyway. The aircon was blowing hot air and the shower was either too hot or too cold. The hotel lacked the usual array of toiletries in the bathroom that one would expect. The minibar seemed to be broken and there were no clear instructions for the room safe. A major selling point for this hotel apart from its location is the rooftop pool and bar. This is an excellent spot to wind down after a day's sightseeing and although it was still too cold to swim when we were there, it will come into its own for visitors later in the year. Lastly the breakfast was pathetic. The coffee was rotten coming from a machine. The selection of fruit and cold cuts looked tired and unappealing. At five past the breakfast endtime the staff started clearing up and switching off the machines.", "Date": "May 16, 2007"}, {"Ratings": {"Check in / front desk": "4", "Overall": "4.0", "Rooms": "5", "Value": "5", "Location": "5"}, "AuthorLocation": "dublin", "Title": "“Great Hotel”", "Author": "stannn", "ReviewID": "UR7405807", "Content": "In a great location on the Grand Via this hotel offers a standard of luxury greater than its 4 stars might imply. Look around for a deal when booking, as its possible to get breakfast included in the rates. The executive upgrade is worth paying extra for - providing access to a comfortable and complimentary lounge/ bar. If staying in a room overlooking the street, insist on one with sound-proofing as the street is very noisy all night long. Did not sleep the first night due to the noise, but promptly changed to a higher floor the next morning The hotel provides old-school, if a little dated, glamour - brass rails and chandillers - and the rooms are huge. Bathrooms are full-on marble with flufy bathrobes. I would be more likely to book this for my parents rather than for myself going forward.", "Date": "April 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Budapest", "Title": "“Central location, great 4 star hotel”", "Author": "obi7", "ReviewID": "UR7301777", "Content": "Very good located in central Madrid, nicely furnished rooms, good service. It is worth booking Club Emperador (extra large room, nice view on the city, extended breakfast and longe for Club guests). Be careful by booking, because some of the rooms overlook on a wall and are less friendly. If you ask for a nice room the hotel is recommended to stay there. I will return!", "Date": "April 9, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Rochdale, UK", "Title": "“great location, shame about the cofee”", "Author": "trellis2", "ReviewID": "UR7155696", "Content": "A good but not great 4 night stay. The hotel is on the Gran Via - main road through City Centre, well-located for theatres, old town restaurants and bars, Palazzo Real, etc, with a Metro station right outside front door. Well-furnished room - not huge but perfectly comfortable and quiet. All service efficient if not all that friendly. Ground floor piano bar comfortable for cocktails etc. The only real drawback was breakfast. A rather limited buffet, by major European City standards, with the most disgusting coffee from a machine. This made the Starbucks on the opposite side of the Gran Via popular with us.", "Date": "March 13, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cardiff", "Title": "“Great hotel”", "Author": "Cariadbri", "ReviewID": "UR6803089", "Content": "Stayed in this hotel in January for a shopping weekend. Arrived Saturday evening, Madrid centre closed Sunday but a shopping mall on the outskirts of town open. Booked Club Emperada rooms after seeing notices. Room fine, bed a bit hard. Staff all pleasant and very helpful. Drinks in the bar a bit pricey, but we did get lots of nibbles with the drinks. Found a nice bar around the corner where drinks half the price. Pool closed during winter and it was very cold but enjoyed weekend all the same.", "Date": "February 16, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "England", "Title": "“Let Down”", "Author": "ACat1", "ReviewID": "UR6185988", "Content": "I booked the Emperador for my pre-wedding get away with 5 girlfriends. I was hugely disappointed. The rooms were old, dark drab and very dated (not in a good way) with views of walls and outside pipes. The feeling of disappointment when I walked into the first room/shoebox I was allocated was crushing - this was supposed to be a 4* hotel - and I had chosen it for everyone! I was grudgingly given another room to look at, which although bigger was equally dark and uninspiring and was on another floor away from our other friends. Their rooms were not much better and one had big problems with the shower. Worse than that was the service - extremely slow, un customer friendly and even rude. This especially seemed to appy up in the pool bar where, apart from one young waiter who was new and lovely, we felt completely invisible. The times for serving food seemed to be minimal, even though it was available elsewhere in the hotel and even when we got there specifically before their 'deadline' we were still told we couldn't have anything. The menu was limited and basically prepared. The pool area saved the stay it was the only good thing. I would not stay here again.", "Date": "November 28, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "ENGLAND", "Title": "“Disappointed”", "Author": "HAU635", "ReviewID": "UR5822784", "Content": "Visited this hotel for a shopping weekend with my 8 girl friends. This was on my recommendation having visited the previous year with my partner and enjoyed a very comfortable, large room. We were allocated twin rooms on the third floor. The rooms were in great need of refurbishment (peeling wallpaper), dark, musty and we even had a hole in the ceiling of one room. No mirror in the bedroom and an aged chocolate brown bathroom suite. We did ask if we could be relocated or upgrade but were told the hotel was full, which was clearly untrue. Two of our group had booked directly with the hotel and paid an additional 20 Euros to upgrade to Club Emperador. The standard of their accomodation was far superior and I would recommend visitors explore this option. They had access to a private lounge with complementary bar and breakfasted seperately. The only saving grace is that the hotel is in a superb location and the roof top pool and terrace are brilliant. Generally the staff were not friendly and service at breakfast and in the bar area was poor. Madrid is a lovely city and I will certainly return but not to this hotel.", "Date": "September 21, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Average Emperador”", "Author": "Aussiguys", "ReviewID": "UR5501944", "Content": "We had a three night stay in the Emperador in early June. Our room was large with a moderately comfortable bed (two singles pushed together) Clean and quiet as it faced inward and was thus a little dim. A large bathroom, very clean with a full sized tub and good water pressure, once you were able to get hot water. At any time of day it seemed to take forever to get the water to run hot, though once there it never ran out. A good location, within easy walk of the Palace and its gardens as well as the Prado, 15 min walk up the Gran Via. Friendly and knowledgable staff who spoke English. The breakfast buffet was OK, plentiful with some good Spanish cured Ham and a bizarre coffee machine which gave a reasonable cup of espresso once it was mastered. A warning to those travelling with children, it is easy to stumble on previews of porno movies while channel surfing the TV, you can have this service disabled by calling reception. The pool and rooftop bar are above average.", "Date": "July 23, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Penarth, United Kingdom", "Title": "“Good hotel and pool for hot Madrid”", "Author": "HoulaLoula", "ReviewID": "UR5480562", "Content": "Stayed at the Emperador for 4 nights 6/7 - 10/7 on a hen weekend. Good central hotel with the much needed pool for the Madrid summer heat. Clean pool and sunbathing area as well as the oiutside bar and snack area. Slow service for drinks and lunch and Spanish people tended to get served first but hey this is Spain and what's the rush! Room was fairly small but clean and the air conditioning worked a treat. TIP:- get 2 room keys and leave one in the room so air con is on all day and take the other with you for access. Others in our group had great rooms TIP:- see if you can get a Club Emperador room. Overlooking Gran Via so can be slightly noisier but worth it for the size of the room as well as the tea making facilities etc. You could have got 3 of our room in one Club room! Breakfast was good with OJ, coffee etc as well as pastries, cereals, fruit, meats, Enough for a good breakfast. Whilst you're in Madrid walk to Sol and go to Bar Taurina. Great Tapas.", "Date": "July 18, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Charlottesville, VA", "Title": "“Good Hotel, Good Location”", "Author": "oncdoc", "ReviewID": "UR5472506", "Content": "This is a good (not great) hotel in a very good location. For those who want to explore Madrid without spending a fortune this is a good option. The pool is particularly appealing to those travelling with kids and is nicely situated on the hotel roof. The Club Floor was pleasant -- thought the coffee was...(well nevermind, I'm supossed to keep my language clean). Overall impression of the Service was quite favorable & for a largish hotel I think they've done quite a good job.", "Date": "July 16, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "2", "Service": "3", "Rooms": "3"}, "AuthorLocation": "San Diego, CA", "Title": "“Didn't Love it, Didn't Hate It”", "Author": "JessSanDiego_CA", "ReviewID": "UR5418674", "Content": "My boyfriend and I stayed at the Emperador for 4 days, and we were not impressed. Overall, it is clean and comfortable; however, don't expect anything special. We had requested a single bed when we made the reservation but were given a room with a tiny twin bed. They offered to switch us to a room with a larger bed the next day (which we did). The staff, in general, speak English well and are friendly and helpful. However, don't expect immediate service. I would have to call at least 3 times if I needed something before it would actually happen. Also, I was really disappointed that they did not have irons available (especially when paying $200/night). They encouraged use of their \"pressing service\" which cost about 10 euros per piece of clothing! Ha! My boyfriend and I must have had a 'standard' room (on the 2nd floor) because it sounds nothing like what I have read from other reviewers - also, our mini bar was NOT free! As for breakfast, it was very average. Also, beware: make sure that breakfast is included in your room fee; otherwise, they will charge you 18 euro! It is DEFINITELY not worth 18 euro. I arrived in Madrid one week before my boyfriend and stayed at the Melia Madrid Princesa (right down the street a few blocks) and it was so much better and about the same price. They had a fantastic breakfast (everything you could imagine), great service, better rooms, and an iron available upon request! The hotel is definitely in a prime location and convenient to most tourist attractions. Also, the pool is great.", "Date": "July 2, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great location, great hotel”", "Author": "Jasubar", "ReviewID": "UR5414442", "Content": "This was our second stay at the Emperador, the first having been back in 1994. We liked it then but loved it this time. The Gran Via is a bustling city street, and our room directly overlooked it. Fortunately, the hotel has double windows which were very effective at blocking out any noise. I'm a very light sleeper and never heard a thing. The Emperador is in a perfect location to enjoy the city either on foot or via the cheap (1 Euro), efficient Metro. There's a Metro stop literally right in front of the hotel. The only time we took taxis was to and from the airport, and even that trip could have been done on the subway. The decor of the rooms themselves appears to be dated, but I think this is just the style and not that it's actually old. The mattress is very firm - which is my preference. I think this was the most comfortable bed I've slept on in a long time. Rooms have a mini-bar and a safe (free to use, but you do have to get a key from the front desk). We had upgraded to the \"bed and breakfast\" package. Turned out to be a great bargain. Not only was the breakfast better than what was in the main dining room (and with free cava as well) but we also had access to a \"club room\" that opened at noon each day with unlimited beer on tap, light snacks, soft drinks, bottled water and a handful of flavored liqueurs. We found that between the free breakfast and the snacks, we generally did not need to buy lunch anywhere, making the extra charge for this package well worth it. It was also nice to hit the club room and relax a bit after a day of sightseeing and walking. Another great feature of this hotel is the rooftop pool - but note that the water isn't heated and it was cold!!! On a side note which has nothing to do with the hotel itself, my husband did get his wallet lifted on the Metro. Fortunately nothing of much consequence was lost, but it's something to be aware of - Spain is famous for the talents of their pickpockets.", "Date": "July 1, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Best Hotel Ever!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5375393", "Content": "I was a little worried because of the low cost but as it turned out the Emperador Htoel us a little gem! My wife and teenage daughter were greeted very warmly and found the service to be just wonderful! We were there for two nights and really loved the size of the rooms (I guess the top floor rooms are bigger). Location is perfect too, just a short walk to everything fun! The staff was just terrific and made us feel like were were staying at a good friends home. It is the perfect hotel for a couple traveling with a teenage daughter.", "Date": "June 22, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Unknown", "Title": "“Don't Stay Here!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5373968", "Content": "I'll start with the positive - the only highlight was the pool. Great pool with ice cold water to cool off. The rest of the stay was horrible! Rooms were ok to small in size and the bed was the smallest twin I've ever seen, not even sure it was a mattress under there. The air-conditioning was loud and had trouble working. The staff was rude and not very knowledgeable of anything. Couldn't get them to recommend a restaurant other than their own - I speak Spanish. The night manager said my room was the smallest in the hotel and was very surprised I was given it at my rate. She had no rooms available that night but made a notation to have me move first thing in the morning. The morning staff refused to - citing they know nothing about moving me. When I approached the night manager when she came back on duty - again she made a big sign and a notation in her book for the morning staff - again the morning staff wouldn't do anything. Beware of the shuttle to the airport - the staff told me it was 19 Euros', put it in writing and made the reservation - when the shuttle dropped me off they said 36 Euros. It took 1/2 hour to convince them. Now most IMPORTANT - beware of the neighborhood. Although it is in the heart of it all, walking distance to the Sol and Mayor, crime is everywhere. I was robbed in the first hour I was there. I have been going to Europe for over 25 years including backing around Africa, its bad. When the hotel has an armed guard at the door, it should tell you something. Would recommend staying over in the neighborhood of the Westin or Prado - much safer. Pickpockets are VERY good in Heurta and Sol.", "Date": "June 22, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "2"}, "AuthorLocation": "Cheshire, UK", "Title": "“Perfect once we upgraded!”", "Author": "jackste", "ReviewID": "UR5325531", "Content": "We have just returned from this hotel - On arrival we were impressed - big, grand reception, friendly staff & great location. We were allocated a standard room on the 4th floor. It was a big, spacious, clean room but it was so old fashioned and dark - it had a chocolate brown bathroon suite with a tiny bath and the view was....well, a wall!! We asked to be moved but there was nothing except a Jnr Suite available which we upgraded to at considerable cost. We considered it to be well worth it, the suite was fantastic with great views onto the Gran Via, a huge bed & bath etc,etc!! The breakfast was excellent - absolutely no complaints (something for everyone). The swimming pool and sunbathing terrace are what makes this hotel special and the best place to stay in Madrid, plenty of sunbeds, a snack bar, a big pool with a lifeguard on duty at all times. After a morning sightseeing/shopping its absolutely great to go back and chill out - I felt it provided the best of both worlds! If we were to go back to Madrid I would definately return to this hotel. However, I dont think I'd be enthusing quite so much if I had stayed in the standard room.", "Date": "June 8, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Ignore the negative revies”", "Author": "Suki Pickering", "ReviewID": "UR5324157", "Content": "My best friend and I stayed here for a short weekend break and we were so impressed with the hotel and i can't believe the bad reviews Its lovely - has an atrium running through it and they've really made best use of the space. Reception was very friendly and helpful - some could do with smiling more! the main hotel manager was so sweet. You can even help yourself to a glass of cava and water when you go past! The rooms were just perfect - quite small bed area but you only need to sleep! We had a lovely balcony overlooking Gran Via which was great. Best bits - the free mini bar (all soft drinks and beer) - what a complete result!! never had that before.! AND the reclining beds - could not believe this fab addition - we couldn't stop gloating in our excitement for ages !!! Breakfast was really great- lots of cold meats, cheeses, fruit, pastries galore and you could have eggs if you wished. And even a glass of Cava again! Only small gripe was not having any juicy tomatoes!! re: Madrid -the location is just perfect to walk to the main city areas - and Gran Via is the main shopping area - we were quite disappointed with shopping but still managed to spend!! Go to Cheuca - which is a small walk from hotel - its the gay scene but has the coolest bars and restaurants Madrid great for a weekend break - there's no pressure to sightseeing if you just want to relax and tour buses are best way to get around. Food and drink - you can't fault and really really reasonable prices. Metro is also very cheap - 1 euro to get to airport!!! Go to Retiro Park too - beautiful on a Sunday. Beware that a lot of store shut on Sundays. Also if your spanish is non existence take a translation book - most people don't or chose not to speak English!! Would definitely go back to hotel and Madrid again Suki", "Date": "June 8, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“One of the Worst Hotels in Europe”", "Author": "A TripAdvisor Member", "ReviewID": "UR5313252", "Content": "We stayed at this hotel for four nights. The location is good, right in the middle of the City Center. Our room on the first floor was above the Kitchen. There was constant noise all night long. There was no view except piping and a dirty alley. The staff was pleasant. When we arrived there was no A/C in the room. The staff agreed to move us to the 3rd. Floor, but there was no hot water. We moved back to the 1st Floor and there was no hot water there either. The engineer came to the room and told us that we had to run the water for 10-20 minutes and it would become hot, which it did. There was a sticker on the wall telling us to conserve water. The rooms are spacious but the furniture is old and the wall paper on the walls is peeling off. Frankly, this was probably the worst hotel that we have stayed at in Europe.", "Date": "June 5, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York, NY", "Title": "“Wonderful Experience”", "Author": "kangaroo5050", "ReviewID": "UR5288098", "Content": "I stayed here with two friends last summer and it was a lovely experience. The rooms are lush and spacious, plenty of amenities and the breakfasts are great as well. While at times we had a bit of difficulty communicating in English with some of the staff, still they were always friendly and gracious. Across the board this is a winner in terms of location, comfort and especially price (you definitely get your money's worth). I suggest booking it directly through the hotel, they have a great website and are very helpful.", "Date": "May 31, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Huddersfield, United Kingdom", "Title": "“Excellent Emperador!”", "Author": "anothersunnyday", "ReviewID": "UR4570709", "Content": "My boyfriend & I stayed at the Emperador for 5 days in February to celebrate Valentines day. After reading the reviews on here a few days before, I was slightly worried, I needn't have been though because the hotel was gorgeous! We stayed on the 4th floor facing onto the Gran Via, we'd heard this was extremely noisy but we found it very quiet! (Unless you open the balcony doors, which did make it rather noisy.) Our room was lovely, not the most modern decorating but it was clean & comfortable, the bathroom was really nice too. Breakfast was great, very good selection of cereals, fruit, sliced meats, Spanish omelette, different breads & drinks. (Though the scrambled eggs were 'slightly' runny) The staff at the hotel were so helpful, they hailed taxis for us, gave us advice on where to eat, booked tables for us, generally a great help. It's a shame the pool wasn't open when we stayed but we still had an amazing time. The location of the hotel is great, you can walk to the Puerto Del Sol in 5/10mins, get a metro right outside the hotel or hop on a (red route) tour bus also right outside! We bought a 2 day pass for the tour buses which was great as we got to see alot of the city, we didn't get a metro till the very last day but wish we'd got one sooner as it's only 1euro per journey, the 2 day bus tour was 19euro each but we did get to see alot more. Madrid itself has so much to offer, lovely sights, brilliant places to eat & fantastic people. We could only speak about 3 words in Spanish when we went but everyone was so helpful & nearly all the restaurant have menus in English & if they didn't they tried their best to translate the whole menu for you! A word of advice about the museums, check when they're open before you set off, we went to the Prado, Reina Sofía & the Thyssen-Bornemisza on I think it was Monday, only to realise all the museums are shut on Mondays! Also lots of places are free on certain days, like the Temple De Debod was free on Sundays, very nice to get pictures there but not worth paying unless you can read Spanish. The Atocha train station is worth a visit & the Retiro gardens are beautiful, the Kio towers are really cool too but quite a trek out of the city. Anyway, I’d definitely recommend this hotel & Madrid is fantastic, so get your holiday booked now!", "Date": "March 3, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Manchester", "Title": "“Lovely hotel and great location”", "Author": "Scarlet_Potter", "ReviewID": "UR4566700", "Content": "My Mum and I stayed in this hotel for a long weekend and it was fantastic. The location couldn't be any better, right on the Gran Via which is one of Madrid's main shopping areas. The bedroom was lovely, although think we were in a smoking room even though we requested a non smoking (however we did book very last minute). Marble bathroom with all the little extras and a well stocked mini bar! Breakfast was everything you needed to prepare for a full day of shopping! I would stay here again.", "Date": "March 1, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Beverly Hills, CA", "Title": "“Great pool, but otherwise...”", "Author": "SonOfBruin2", "ReviewID": "UR3809411", "Content": "Just as reviewers have already stated, the pool is the selling point of this hotel, and deservedly so. During our stay it was about 100 degrees in Madrid, so the surprisingly/refreshingly cool pool made the stay worth it. However, if it is not going to be hot during your stay, I would suggest staying somewhere else. My family and I stayed for three nights in two double club-level rooms. The access to the club room was worth it -- we went through about eight free bottles of water daily, and in the evenings the option was there to stop by for a complimentary cocktail or beer. One room had a king bed and the other two twins. All the room problems stemmed from the twin room. For starters, the chandelier in the room (the primary source of light) was broken so the room was darker than the king room, and no attempts were made to fix the problem. More importantly, the a/c was not functioning properly. Someone came to \"fix\" it twice, but there was no major improvement. While the fan appeared to blow a little stronger with every mechanic visit, the unit was not de-humidifying the air, giving the room a somewhat damp feel. Our second day we were offered a different room on the same floor (7), but that room was even hotter than the original. The following day we were offered a room on the eighth floor which was a major improvement. It was slightly bigger with a sitting area, and it had working a/c. To our surprise, that room was stocked with Hermes brand toiletries because it was a club level room, but our rooms on the seventh floor (club level) had standard toiletries. We complained to the front desk and the seventh floor maid begrudgingly handed over the premium stuff (!). In general the rooms and bathrooms were at least clean. The lobby was depressing, though. The floral arrangement was old by the time we arrived, and they let it continue to wilt until our last night. The ceiling desperately needs a coat of paint or two to hide the permanent shadows/burns from the lights. The \"gym\" is a joke. Service was polite but hapless and clueless. We asked if there was a restaurant nearby that served pollo asado, and all they could come up with was KFC. We walked a block from our hotel and found three places that served pollo asado -- sad. If there were no swimming pool/sun deck, this would be an okay hotel at best.", "Date": "August 26, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Treviso, Italy", "Title": "“Great Location and Very good hotel”", "Author": "lorenzo72", "ReviewID": "UR3806669", "Content": "I've stayed with some friends at Emperador Hotel for 4 nights in August 2005. Its location is perfect for visiting all major spots in Madrid. We almost never took metro because the hotel is really close to everything. Rooms are quite small and nothing special, but they are clean and comfortable. The pool on the roof is a great plus: very nice, great views and towels are provided for free to hotel guests. I would surely go back to Emperador if going to Madrid.", "Date": "August 25, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Madrid, Spain", "Title": "“Lovely wall!”", "Author": "Avendanio", "ReviewID": "UR3656231", "Content": "Last weekend to celebrate our anniversary (we live in Madrid and for various reasons couldn't leave the city) so we reserved a room at the Hotel Emperador, which has a lovely rooftop swimming pool. Unfortunately, the only view the room had was of a brick wall about 10 feet away. We asked for a room with a better view, and the concierge was very nice about it, but all he could come up with was one that looked onto an interior patio with hoses and water running down the wall. We thanked him and left. So although no complaints about the hotel service or the room itself, this is just to let you know that despite being a four star hotel, there are rooms that look straight out onto a wall.", "Date": "July 11, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Wales", "Title": "“Excellent Emperador”", "Author": "RhosdduRed", "ReviewID": "UR3604857", "Content": "We stayed at the Emperador for 5 nights in June 2005. As it was my wife's birthday, we made requests via both Expedia and the hotel's own website. Unfortunately, when we arrived they had no record of either. Oh hum. Thankfully, they did change our room fron one on the 3rd floor to one on the 6th which suited us. The hotel is situated right on an intersection on Grand Via and so there was a fair amount of traffic noise in our room. However, it did have secondary double glazing which meant that once the two sets of balcony doors were shut, most of the sounds were blocked out. The only exception was the police / ambulance / fire engine sirens which seemed to go past at regular intervals. I can honestly say that this did not spoil our stay and my wife was really pleased to be able to open the balcony doors and get some fresh air. The room itself was a moderate size but was very confortable. The bathroom was quite big and there was constant hot water. We've stayed in a number of hotels around the world and can honestly say that this was one of the cleanest hotels we have ever stayed in. The maid service was excellent. Location wise, it is less than a 5 minute walk to the main shopping thoroughfare and Plaza Mayor, Plaza Santa Ana and the Royal Palace were within 10 minutes. The main museums were a bit further but they are a comfortable walk on a nice day. There is a tube station right by the hotel if you don't fancy the walk. Watch out for pickpockets though especially by Plaza Mayor as my wife had her purse opened whilst we were walking along. Watch out for pickpockets posing with maps and pretending to be lost. It's quite a common scam apparently. We'd certainly stay at the Emperador again.", "Date": "June 22, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Auckland Region, New Zealand", "Title": "“I just expected more...”", "Author": "merrm", "ReviewID": "UR3588511", "Content": "We have just returned from a long weekend in Madrid staying at the Emperador. It's a lovely hotel but is just slightly let down overall. Our room was a suite but was twin despite booking a double and there was nothing else left, but there was no apology forthcoming. the airconditioning was severely lacking, the safe didn't work, the pay TV didn't work and the staff were distinctly lacking in enthusiasm. The broken curtain rail was however fixed immediately. I am not someone who likes to complain, but while the hotel was nice enough I had expected a higher level of service from a 4*. The pool however is glorious, but as the public can pay to use it, the first day was completely packed which seems very unfair when you are actually staying at the hotel. Our observations of the staff however did extend to most spanish staff we encountered. Having holidayed in Italy, the Spanish are a pale comparison when it comes to tourism. I can't say that I will bother going back to Spain, but that is just my preference, I know most people love Spain!", "Date": "June 21, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“great position, fab pool”", "Author": "jolondon123", "ReviewID": "UR3499592", "Content": "The position of the hotel right on the Gran Via in the heart of central Madrid was its main strength. Also, all the main sites were walkable within half an hour, and the shops and bars were right nearby. The roof pool was a haven in a busy and hectic city, though the downside was it didn't open until 11am and closed at 9pm which was before the sunset so no photo opportunities to be had over the rooftops of Madrid. Though this was rated a 4* hotel I think the rooms and breakfast were really 3* quality, the whole place was a bit \"tired\". The rooms face either a wall or the main street. I swapped from a wall facing room to a street facing room so saw two bathrooms, both of which could have done with updating, and beds in both rooms needed new springs. Though the hotel boasts cable TV they only offer CNN or BBC World in English unless you pay about 10Euros per day for film channels. If you're travelling alone, as I was, this hotel is great for accessibility. Be sure to get a good deal though as in my opinion it's not worth 4* prices as advertisied in the hotel - the internet was a great place to book at cheaper prices.", "Date": "May 25, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“love it!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3090320", "Content": "I've been going to Madrid almost every summer for the past 10 years. I am very familiar with the city and with the hotel standards in Spain and in Europe. I keep on going back to the Emperador because of the fact that it has an EXCEPTIONAL location in the city. You can walk to the Plaza Mayor, to La Plaza de Espana, to La Puerta del Sol, as well as to major shopping / pedestrain areas. In addition to the location the hotel itself is quite nice. The breakfast is of superior quality / selection, the staff is very helpful, the rooms are spacious, etc. Another very important factor is the cost - the Emperador is VERY reasonably priced in relation to its level of luxury and location in the city. I would recommend this hotel with my eyes closed - you will love it! I am going again in February of this year and I was just there this past June!!!", "Date": "January 27, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Unknown", "Title": "“Rooftop pools rule!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2619995", "Content": "This hotel has two selling points that go hand in hand with each other, the rooftop pool and terrace and the unequalled views of the city of Madrid. Our party of 16 people (all work Colleagues!) set about taking over the area for two days, the service was great and the prices were good too. The rooms varied in quality though, some members of the party had very spacious corner rooms, very nicely decorated in pale pastel colours, whilst other rooms were rather small with very old fashioned fixtures and fittings. The staff were really friendly and the hotel itself was really smart. All in all a good time was had by all, great location in a fantastic city.", "Date": "October 5, 2004"}], "HotelInfo": {"Name": "Emperador Hotel Madrid", "HotelURL": "/ShowUserReviews-g187514-d228665-Reviews-Emperador_Hotel_Madrid-Madrid.html", "Price": "$74 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Gran Via 53</span>, <span class=\"locality\"><span property=\"v:postal-code\">28013</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "228665", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/18/8a/188a0d633ccaa7cae2dbe5b4b83eca4d6large.jpg"}}