{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oxford, England", "Title": "“Watch the Metro - and checking out”", "Author": "headingtonroadrunner", "ReviewID": "UR128323389", "Content": "We'd stayed here in 2004 and chose for our stay with friends from the US due to its location; it's a quick taxi ride from the Termini station. (Why not use the Metro? - see below). Staff were friendly in the tradition of Fellini's comment that 'Rome welcomes you when you come and forgets you when you go'. Restaurant felt more crowded than last time but the bar staff and porters were very helpful. Stay was marred by confusion on checkout; I'd reserved two rooms under my credit card and my friend paid on his card for it to appear they were unable to cancel the original reservation so that my friend appeared to have paid under his card while both rooms appeared on my statement; two weeks later we're only just sorting out. If you're booking for someone else then get them to do their reservation. Note this wasn't a problem at the hotel in Florence we'd come from. Later in the morning my friend had his passport stolen at the Termini station one Metro stop north by a gang of young girls; please read all the warnings and use a money belt. The general attitude is that this is part of the Rome 'experience', you will not be coming back so the impetus to do something about the root problem just isn't there. Although the US embassy were efficient, the police take the view of giving you the minimum paperwork and then wanting rid of you. Hotel were helpful in letting us to use their phones to call to cancel cards etc and get a copy of the passport (as hotels take a copy of the photo on arrival); streets around the hotel are fine for evening strolling but just remember you're in a capital city and you're a potential target. La Cicala e La Formica behind the hotel and Gli Angelotti 100 metres away are both good restuarants - with the latter the winner this time. The Ciuri-Ciuri chocolate orange ice cream behind the hotel was the clear winner", "Date": "April 22, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Poor plumbing , Poor service Noisy,”", "Author": "Saddened_12", "ReviewID": "UR128173365", "Content": "Do not stay here !!!, The rooms have noisy toilets than run all night especially when the person above uses theirs. The street side rooms along via Cavour have windows that dont completely close so you hear noise from traffic and people all night long. The front desk staff are very rude. The wifi is at best, sporadic dial up.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Not what I expected”", "Author": "inlovewithd", "ReviewID": "UR128132834", "Content": "I thought that out of all the hotels on my trip, this one would be the best because it is a four star hotel. The hotel is in a great location but it is not what I would expect for a four star. I don't have any major complaints.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Israel", "Title": "“very good”", "Author": "lmw048", "ReviewID": "UR128102545", "Content": "we stayed at the Palatino for two nights. Our standard room (no 303) was facing the back - no particular view but obviously quieter than the front facing rooms. The bed was very wide and comfortable and the bathroom very clean though a bit small - but hey, this is the center of Rome!The hotel is in the middle of Via Cavour, halfway between the Forum and Termini Bus/train station. It is surrounded by cafes and restaurants of course. There is a subway stop very close. A tip: we parked our rented car for free in the next street on Saturday and Sunday and on Monday had to pay only half a Euro per hour and paid in advance for 8 hours!!! 4 Euros a day! The staff were very attentive and kind. When the waitress at breakfast saw that there is no more salad (we Israelis must have our vegetables for breakfast...) she ran off and brought us a plate full of cut up tomatoes! The head waiter was particularly caring about me because he saw I was sick. The lobby is quite nice and there is a big lounge with comfortable sofas to sit on and read. We tried room service - it was quick and promt and brought me my lemon tea very quickly for only 3 Euros! don't know about a/c because the weather didn't call for it.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "North Bethesda", "Title": "“Average Accomodations”", "Author": "Stephanie V", "ReviewID": "UR127955605", "Content": "I thought this hotel was just average. It is very centrally located, but both the rooms/accommodations and the staff left much to be desired. No A/C and our room faced the main street so when we had to sleep with the window open (with no screen) it was really hard to sleep. It's literally a block from the Cavour metro and only a couple of blocks from several of the main ancient Roman ruins. The rooms are pretty spacious (European standards) but the furniture and decor are pretty antiquated (not like the photo in the profile). The staff was borderline rude and not very helpful at all. My guess is they are like this because a lot of tour groups seemed to stay there so they probably don't feel like they have to be overly accommodating. Overall, great location, but don't expect to be taken care of.", "Date": "April 15, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Singapore", "Title": "“Great room, location and service - should be ranked higher”", "Author": "dman383", "ReviewID": "UR127883523", "Content": "15 min walk from train station, 5 min walk to colosseum and forum and right next to Cavour metro. Room is newly renovated, very large and comfortable bed, huge bathroom with rain shower/soaking tub. Manager on site very helpful when recommending sites. For price, should be ranked much higher on tripadvisor.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Berkeley, California", "Title": "“Nice hotel but cold reception”", "Author": "Scousepeasant", "ReviewID": "UR127857545", "Content": "This is a nice hotel, centrally located & very handy for Cavour Metro Station. There are 2 breakfast rooms, one of which is small & quiet which means that it's possible to enjoy breakfast in a quiet space, despite the large tour groups which stay here. Our room faced the front of the hotel & there was some traffic noise, but that's to be expected. Though it might be worth asking for a room at the rear if this is likely to bother you. The rooms are a good size & there is a hairdryer in the bathroom, though no clothes iron. It's a shame, however, that when we arrived the reception staff made no attempt to smile. The man who dealt with us (Gianni) was poring over paperwork & eventually gave us his attention to start the check in process. We paid over 200 Euro a night plus city tax, yet it felt like we were an inconvenience. Later after we'd unpacked, my other half asked about the air conditioning. The man on reception curtly replied that this does not come on until 1st May. That wasn't a problem, but again there was no smile or effort to be courteous. I paid for internet access in the room but could only get access by taking my laptop to the lobby & working there. I didn't complain about this, but just accepted it. But one morning even that wouldn't work so I asked at reception & was told (again curtly) 'there is a problem with the server'. Again - the content of the message was fine, but the attitude was defensive, bordering on surly. Luckily on the day we checked out we were dealt with by a member of staff who had a pleasant attitude so we know that not all the staff are morose &/or defensive. We are not highly demanding or rude so the attitude of staff was a little puzzling. Away from reception the other staff were pleasant. So overall this is a nice hotel. But don't expect a warm welcome on arrival & be prepared for less than friendly service if you do need to contact the reception staff during your stay.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "N.Wales", "Title": "“Best location in Rome”", "Author": "bigtravels", "ReviewID": "UR127490081", "Content": "A perfect location, no better! Got to the airport, got the Terravision bus for 8euros return. Dropped us at the termini rail station, walked down the long street for about 15 mins to out hotel on the main stretch very close to the colluseum. We saw pretty much every attraction BY FOOT from here, the vatican, colluseum, trevi fountain, spanish steps, shops, ruins and your in the middle of a wide choice of restraunts. Would definatley pick this hotel again and would advise friends and family. Be advised that in Rome there is a random charge per person per night at the end of your stay for a 'city tax' (we paid approx £25 for 5 nights) keep this money back! Hotel staff wernt that friendly. We found that accross the board though in Rome, if you want super service and over friendlyness, go to Dubai/ america. Its as good as it gets in Rome.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Clean hotel by the metro”", "Author": "Alexeich007", "ReviewID": "UR127398331", "Content": "There are 2 different room types in the hotel : refurbished and old one. We stayed in the old room with broken shower and street view. It was very noisy, I recommend ask for a room on the other side. Breakfast is very poor for 4* hotel, soluable coffe is ugly.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "HongKong", "Title": "“Disappointed”", "Author": "Tracy_HK", "ReviewID": "UR127307196", "Content": "Stayed there fore three nights. Location is good, walking distance to all major attractions. Staff is not professional. I asked for map twice, first time they said they don't have it anymore. Second time they just refuse to give me even I saw they pass it to someone else. My friend asked for direction and the staff simply said they are busy??!!! Even staff in hostel won't answer like that!! The room is ok but stuffy and no air condition in the whole facility. As my room is facing to the street, it's too noisy to open the window at night. Won't suggest to stay there.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Naples, Florida", "Title": "“Grand Hotel Palatino, Rome”", "Author": "specshoes", "ReviewID": "UR127208764", "Content": "Would definitely stay at this hotel again. Beautiful inside and out. Clean and modern. We had a suite which was beautifully appointed. Bathroom with large tub/shower combo plus and separate stall shower and double sinks. Location just a few minutes walk from the Colliseum, train/bus station, tour buses and literally hundreds of restaurants, snack bars, coffee bars, shops and gelato.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Namur, Belgium", "Title": "“Great value and very good location”", "Author": "Paul_J1960", "ReviewID": "UR126913599", "Content": "Great value for a hotel in Rome. Very comfortable bed and quiet hotel. The rooms on the first floor are of very high quality. The hotel is perfectly situated to visit the centre of Rome. Close to the Coliseo, walking distance from the shopping area. And if you prefer public transportation to go a bit further, it is just near an underground stop or the city shuttle buses.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chelmsford, Massachusetts", "Title": "“Great location”", "Author": "Ying690", "ReviewID": "UR126783807", "Content": "I stayed here with a tour group -- that goes without saying that the hotel is conveniently located and efficient. Breakfast is included, which is necessary if you plan on walking all of Rome and you are on a budget, since food is generally expensive. It is walkable to major sights - the Roman Forum, the Colosseo, the Piazzza Venetia and the Vittorio Emmanuel Monument. It worked well for a big group. It is true, like other reviews that the staff can be abrupt. It can also be noisy, I needed to wear earplugs at night when the windows are open, but I heard that is true for most other hotels located in the city center. And yes, we had to open our windows in March because, all over Rome, AC/Heat cannot be turned on. It is the local law.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Smart hotel, great location”", "Author": "looptail", "ReviewID": "UR126616694", "Content": "We stayed here one night as our original hotel had utility problems; as the room was paid for by the original hotel there is no comment on value/cost. Arrival: helpful reception staff - who spoke good English, which was appreciated - but the reception area was quite chaotic. Rooms: extremely smart - recently decorated to a high standard, very clean and comfortable and with very good facilities. Our room was at the back of the hotel so there was very little outside noise. Breakfast: good buffet with a good range of hot and cold dishes, including bacon, egg and Italian hams. Proper tea & coffee (no vending machines); can't fault it. Internet: not used. Wifi in rooms but requires payment. Area: very close to the Colosseum, very handy for the historic centre and easy to find. Plenty of restaurants close by. Connections: close to the Metro and bus stops - very well-connected. Overall: great stay.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Antonio, Texas", "Title": "“WE THINK THIS IS A GREAT PLACE TO STAY AT IN ROME”", "Author": "advisorview", "ReviewID": "UR126578719", "Content": "I am a return reviewer on this Hotel which just has a great location . The included breakfast has scrambled eggs, omelet squares, sausages, bacon that is in their style of not being cured, many breads, hams, salamis, vegetable table presentation and the condiments with coffee,toasts with jams. It is totally worth it and the same employee that has been there at the breakfast entrance for years. One large block as exiting the hotel to the left is the Coliseum. The high steps right across the street lead to St Peter of the Chains church with a Michaelangelo statue and there is no fee for this. It is all just jaw dropping in its artistic beauty. The a few blocks along the main street as you exit along the main street you can arrive to the roman ruins. If you walk left along this crossing main street you will arrive to an alley where many stores and restaurants along the way lead to the Trevi Fountain. If you go further you arrive at the Spanish Steps. It is all comfortable walking distance from this HOTEL. The tour groups use the Hotel so sometimes it can be crowdy and you may feel the attention is not there but we were helped with our luggage and every question was dealt with by the staff.There is a nice restaurant as you exit the hotel to the left about a block and a half. I loved the mussels and the wine was smooth. The head waiter however chooses who enters at times. The location, the value is great. Now in MARCH there is NO AIR CONDITIONING and the room can be warm. We opened the window to the alleyway and slept okay. There is airconditioning in the lobby area. Due to previous reviews on its bar, we stayed away from that area. However it may have changed due to the reviews.Sales are going on during this time in the stores and really when you have seen 2,000 and 4,000 euro prices in Paris and then come to the great styles here and pricings it is a wonderful treat and to have this Hotel in that experience just makes for a nice trip which is what we all want. You CANNOT beat the location. In case of an overflow there is a Hotel Solis further down the street which seems to not be used much. The bathroom is small and so is the room (we were assigned 806). The room is clean. I always leave a small tip of about $6 american money which they might change at their own desk.", "Date": "March 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Madrid, Spain", "Title": "“Perfect location!”", "Author": "Pablo G", "ReviewID": "UR126337473", "Content": "This hotel is a perfect starting point to visit the centre of this wonderful city. The Palatino Grand Hotel is located almost in front of the Colosseum and close to Venice Square and Rome's major tourist attractions. The hotel was clean and comfortable, recently refurbished. Staff was friendly. I strongly recommend this hotel if you are planning to visit Rome.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "1", "Location": "4"}, "AuthorLocation": "", "Title": "“old style”", "Author": "coxski", "ReviewID": "UR126229405", "Content": "Love the look of the lounge and the \"retro-style\" bar. Once you go upstairs to the rooms you take a step back in time: the bathrooms are small and cramped (my toilet was too close to the sink), my bed was comfortable but the room was small and not very clean. Even though I was on the front (3rd floor), I didn't hear the traffic. The meeting rooms are well equipped (projectors, wifi, etc) and when we needed additional chairs, the personnel was quick to provide them. The breakfast buffet is rich and the service is good.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tallahassee, Florida", "Title": "“Good location, large rooms”", "Author": "12skip", "ReviewID": "UR125963319", "Content": "Palatino Grand Hotel in Rome is in a good location, just blocks from the Colosseum. The rooms were clean, large, and included a tub and shower in the bathroom. The lobby had plenty of seating and included a piano bar at one end. Overall the staff was friendly and helpful. Breakfast buffet area didn't seem quite big enough to accommodate all the guests -- maybe we were all trying to eat at the same time?", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“great location!”", "Author": "Ettacg", "ReviewID": "UR125619536", "Content": "I Just spent 3 nights at the Palatino in Rome with my daughter. The staff was very friendly and also eager to help. Our room was immaculate and we had a beautiful view of the city. We were pleasantly surprise at the breakfast buffet, with choices for organic and non organic, and on request, a celiac kit which made our breakfast very enjoyable. The hotel was busy but we never felt neglected. The location is superb, we walk to the Coliseum and the area offered restaurants, shops etc. We had a great experience and I would strongly recommend this hotel.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bend, Oregon", "Title": "“Book another hotel”", "Author": "andream114", "ReviewID": "UR125213338", "Content": "First room smelled of bug spray, maybe that is why there was an exterminater van parked outside the hotel. The room was also very outdated and dirty for a four star hotel. We upgraded through Gate 1 travel and expected more from a four star hotel. The walls and door were covered with dingy red carpet and twin beds. The second room was renovated but was very stuffy and facing Via Cavour, so when the windows were open it was extremely noisy. Of the three hotels we stayed while in Italy, this was the most expensive and the most disappointing. We would not stay there again. If you already booked make sure you ask for a renovated room away from the street on the 7th or 8th floor. The only positive was breakfast and location. The people that gave good reviews must have stayed on the 7th or 8th floors!", "Date": "February 26, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "wales", "Title": "“OK Hotel - Could do better”", "Author": "dystrad1", "ReviewID": "UR125174446", "Content": "We were moved to this hotel as our original choice had over booked. The hotel is well situated with excellent cafes and bars around in the back streets. The hotel staff are hit or miss. Some are helpful some are downright rude. The room was very small but clean. The beds were not full size singles and were small. The breakfast was awful. scramled eggs, mushy bacon, fruit, bread and cakes. The fruit juice was cheap. The coffee was excellent but that was it. It seems that this is the standard in Rome. An ok hotel On another note do yourself a favour and dont go to Rome. What a rip off full of con artists and beggers. Look at a bokk of Rome and you will see all you need to see. Barcelona had so much more to offer. Would never ever go back.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Leicester", "Title": "“Palatino Grand Hotel Rome”", "Author": "DAVID B Posted by an Easytobook.com traveler", "ReviewID": "UR124903443", "Content": "Booked and paid for an executive suite but was put in a standard double room on arrival which was extremely dirty. Went back to reception and said I didn't think this was an executive suite and they reluctantly agreed to move us to another room which probably just about met the executive status. No apology or reason given. We were ignored by reception staff after this.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Perfect base for a great holiday!”", "Author": "lconroy8", "ReviewID": "UR124853259", "Content": "I have just returned from a family holiday and this hotel was excellent for us. The location was perfect, we walked everywhere from the coliseum to the trevi fountain but there is a metro station just beside the hotel if u want to travel further. I found the front desk staff extremely friendly and willing to help with restaurant recommendations, airport transfers, directions etc. I would definitely recommend this hotel and hope to stay there on returning to Rome soon!", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Great Location & Service”", "Author": "Philip1029", "ReviewID": "UR124210434", "Content": "I've been back to Rome every year since 2006 (my 7th visit will be in March 2012) and I consider the Palatino my home away from home. Besides the great location and service, the value is great. Rooms are fairly large for Europe and the amenities are good. The monti neighborhood has many nice restaurants and shops and is very pleasant for strolling. The hotel is within walking distance of major sites (e.g. Colosseum and Forum) and is down the street from the Cavour Metro station. Would recommend this hotel highly.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Good Location, Acceptable Price, Excellent Hygiene”", "Author": "SariSfere", "ReviewID": "UR124047092", "Content": "Went to Rome with 2 friends, so we share 1 bedroom with 3 beds. The rooms are spacious, the toilets are clean with ample amenities. They also provide bide in the toilets. The location is the killer, as it is really within walking distance from the Colosseum, Domus Aurea and the Roman Forum. We ended up going to the Colosseum just about 3 times a day. The hotel is also quite near from the Central Station (Termini), which can be reached (walking) in about 20 minutes. Just go along Cafour and you'll find plenty of restaurants, gelateria and shops quite conviniently near from the Hotel. The staff are very friendly and helpful too. We then decided to stay at their sister hotel in central Florence and the front desk staff helped booked the room for us. Very recommended if you're traveling in mid-range budget.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "israel", "Title": "“Recommended, excellent value for money”", "Author": "Anatea", "ReviewID": "UR123680479", "Content": "Located in Palatin hill, although not as central as some hotels, this hotel is in a comfortable walking distance of many attractions and very near to an underground station and Termini train station. We walked to every place. The rooms were spacious and nicely decorated, breakfast buffet was good and the staff very helpful and friendly.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jefferson City, MO", "Title": "“My stays at the Palatino”", "Author": "Magister1946", "ReviewID": "UR123578741", "Content": "I have been to Italia 16 times. I have stayed at the Grand Hotel Palatino on the Via Cavour in Rome at least 6 times. I would never stay anywhere else in Rome for the price. It is clean, efficient, and within 3 blocks of the Roman Forum and Colosseum.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "carrollton, georgia", "Title": "“Great Location for Sight-seeing!”", "Author": "wanderccat", "ReviewID": "UR122783101", "Content": "My husband and I stayed in this hotel for 6 nights December 22-28, 2011. When we arrived in Rome around 9:00 AM after our overnight trans-atlantic flight we were exhausted. I realized they did not have to let us check into our room that early - so I was very pleasantly surprised when the man at the desk said he would check and see if our room was ready. He said, \"yes, the room is ready and you are welcome to go on up.\" I thought the room was nice and roomy compared to a lot of rooms in Europe. The beds were very firm - which suited me just fine! Anyway, I collapsed on the bed and slept 4 hours! Later that afternoon, I was very happy to find that our hotel was situated in a very nice location for walks to the ruins, museums, churches, and piazzas (and ATMs). There were several very good restaurants and delis nearby also. Our stay was everthing I hoped it would be. I would recommend this hotel and I would stay here again in the future!", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dedham, Massachusetts", "Title": "“Just what I was looking for...”", "Author": "Maria B", "ReviewID": "UR122415689", "Content": "This hotel is right down the street from the Colosseum and the Roman Forum and across the street from Saint Peter of the Chains where the extra large sculpture of Moses by Michelangelo resides. It is a comfortable room with nothing too special - but the price is right - and the food is great! We had Christmas dinner there, and it was a lovely gourmet meal. Close to Saint John's Laterano (Rome's mother church) and Saint Clemens, an historical wonder with three levels, one of which dates back to the 1st century AD and also includes a Mithraic Temple. Stones throw from Piazza Navona - a cab ride away from the Vatican. Walking distance from the Victor Emanuel Memorial - walk up to the higher level in the rear of the building at sunset and see a beautiful skyline.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maidstone, United Kingdom", "Title": "“Great location, very good hotel”", "Author": "FSR1977", "ReviewID": "UR122279285", "Content": "We stayed at this hotel 4 nights. The location is ideal, being right in the centre of Rome and within walking distance of the Colosseum, the Forum, the Trajan Markets, the Vittoriano and of a Metro station. Quite a few good restaurants around as well, but go a couple of streets away from the Via Cavour and its tourist traps. Lots of good gelaterias on Via Cavour, especially the one towards the end of Via Cavour, near the Largo Corrado Ricci. We were on the fourth floor, facing the back. The bed was comfortable and huuuuuge (super king size). The room was clean, tidy and turned down every night, as you'd expect. The room was functional, with enough space to move around and ample storage space. Full height mirrors as well. The breakfast was good. We booked this hotel through www.lastminute.com and decided it was preferable to pay the extra for a city centre hotel than all the ones further out in the Eur district, among others. What we saved in train and Metro tickets by being in the centre paid for the extra that the hotel cost. Rome is the sort of city that is relatively easy to get around on foot. The rate was perfectly reasonable (although I can't remember it, sorry!) and what you'd expect from a 4-star hotel. The hotel staff were courteous and helpful, helping with a couple of restaurant recommendations and with a plug adapter (mine disintegrated itself in my bag). I don't know how some people posting here had a bad experience in this hotel, but we really liked it and intend to go stay here again next year.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gloucester, United Kingdom", "Title": "“Great value, had a wonderful stay!”", "Author": "aceofspies", "ReviewID": "UR121487208", "Content": "We stayed at the Grand Palatino in the first week of December and had a wonderful time. Ignore the negative comments that people have posted on here as they nearly put us off... they shouldn't have. It was lovely. The room was clean, tidy, refreshed daily. The bed was two twin beds put together, but they were not on rollers as some reviews have stated. Decor was good and had a modern feel to it. We stayed on the 7th floor, with a view to the front of the hotel. Breakfast was very good, lovely eggs and bacon (boiled and scrambled eggs) on the buffet, along with cold meats, cheese, pastries, yoghurts, cereals, toast, smoothies, fruit, and good coffee (espresso) and tea (Twinings). The hotel staff were friendly/helpful, check out time is midday and there is a facility to leave bags after check out. The location of the hotel is perfect for the Colluseum/Forum/Palatine Hill as it's just a 5 minute walk away. Also access to the hotel from the airport is very good as trains/buses stop at the Termini station at the top of the via Cavour. It's a 20 minute walk from the hotel (we did this with our cases... on wheels). As for the rest of the city, well we did it all on foot. Not for everyone, but we managed it. With a bit of planning it can be done (wear comfy shoes!) Eating out is good, we found some great little places to eat close to the hotel, the best advice we received was \"look for the places that are full of Italian people\", we did this and got great food, for great prices. Also, ask about the house red wine, it'll be cheaper and doesn't often feature on the menu! Also, there are a number of gelaterias (ice cream parlours) in the local area, lovely! Would not hesitate in recommending this hotel for value and location.", "Date": "December 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Massachusetts", "Title": "“Great location, around the corner from the Colosseum.”", "Author": "sylviann55", "ReviewID": "UR120675387", "Content": "Very nice hotel, we ate in the dining room every night and the food was good. Rooms and bathrooms were very clean and spacious for Roma. Giancarlo at the front desk was very helpful as was the rest of the staff. The dinning room was a bit rushed at times, but they went out of their way to make sure we were taken care of upon returning from a trip out to our families hometown. We felt very safe in walking around the area and could go out a night looking at sights. This is a hotel that I would highly recommend.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Great Location Great Stay”", "Author": "pupepause", "ReviewID": "UR120388030", "Content": "This hotel was referred by my sister and brother-in-law who stayed there in 2005. We were very pleased with their recommendation. Our stay was for three nights. Our room was on the top floor (8) hardwood floors, nice bathroom and had a lovely balcony. The location is outstanding! We have come to have very low expectations traveling in Europe when it comes to hotels but the Palatino Grand help us higher our expections. The breakfast was excellent. There lots of tour groups staying at the hotel which did not interfere with our stay. We discovered the key to a good hotel room in Europe is to stay at a 4 Star hotel. They run anywhere from $350-400 a night USD but worth it on our book. We booked on- line early and that saved us some money and were able to get free internet service which is not the case in many of the European hotels. We also hired a certified tour guide who was also recommended before we arrived and she was EXCELLENT and well worth it. Easy to understand, full of energy and a wealth of knowledge and ideas while in Rome. Laria.....cspiut@tin.it", "Date": "November 9, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Outdated and over rated!”", "Author": "sandocious", "ReviewID": "UR120261498", "Content": "I don't know how this is a 4 star hotel. The only thing good about this hotel was the location. Walking distance to/from the train station and the coliseum. I would not recommended this hotel to anyone!", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Larchmont, New York", "Title": "“Perfect for our needs”", "Author": "ghhtooth", "ReviewID": "UR119722415", "Content": "We stayed here for 4 nights as part of a tour. Rooms were small but servicable, particularily since we only slept in the room. The location was great. You could walk to the colosseum/forum. Near public transportation and the desk will call a cab for you. Our biggest complaint would be the \"front desk\" workers except Roberto in the evening. Every time we asked a question we were treated as though we were intruding on \"their\" time. It made one feel very uncomfortable to ask anything. There are many restaurants on Via Caavour as well as on the little streets behind the Hotel. The breakfast was the least appealing of all the Hotels we stayed in, but enough choices to please most people. We would stay here again if we were in Rome.", "Date": "October 25, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Orlando, FL", "Title": "“Great Location -- good value”", "Author": "salsasenora", "ReviewID": "UR118088841", "Content": "A nice hotel with fabulous location near Colosseum/forum, and a short stroll from Metro station. Up and down the street are endless restaurants, gelaterias, and shops. Grand Hotel Palatino was included in our tour. There was a heat wave and the A/C in our room didn't work at all; it was unbearable. We got no cooperation from front desk, but they finally gave us a tower fan that they were using for themselves. Next day, Gian Carlo changed our room and our last two nights were wonderful Very comfortable bed (or very tired tourists?), and general amenities. The full breakfast buffet was pretty good, with bacon not raw, scrambled eggs with taste, and variety of meats, cheeses, cereals, yougarts, juices to make most happy. There is a nice side \"lobby\" where you can sit to update your travel journal, catch up with friends, or have a drink. When in Rome, there are so many awesome things to see and do, the hotel is mainly for recharging for the next day's adventures.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Will Stay there when we return to Rome”", "Author": "NottinghamPsb", "ReviewID": "UR117977922", "Content": "This hotel was excellent, good atmosphere, great local and nice breakfast. Bar in the evening was always buzzing. 15 minutes leisurely walk from the best sights and 5 minutes walk from one of the best restaurants I have ever eaten in, Ristorante Argentino, steaks to die for. The nearest metro, Cavour, was 3 minutes walk away, very handy if you have been walking all day! We booked a standard double room but were given a suite on checking in as I had sadly had my purse stolen on the way to the hotel, something to beware of on the Metro. The suite was enormous and had its own balcony looking straight out onto a busy road but we never heard any noise from it at all. Would defiantly recommend the place and will be staying then when we next visit the wonder City of Rome", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "St. Petersburg, Russia", "Title": "“Expencive hotel but not perfect”", "Author": "piton5318", "ReviewID": "UR117951230", "Content": "Stayed in twin room for three nights with my wife. Room was spotless, breakfast was not good considering it is a budget hotel, and a great location(historical center) - short walk along to metro station, nearly Coloseum.", "Date": "September 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New Brunswick", "Title": "“Fantastic location for the colloseum and roman forum”", "Author": "Nav531", "ReviewID": "UR117356182", "Content": "Stayed two nights with a last minute booking on hotels.com and only paid 146 plus taxes for a fourt star. Lobby was beautiful and they efficiently placed in a room on the fourth floor. Breakfast is included, buffet style and very basic bit enough to get you started. Less than 10 mins walking to the colosseum and both red and blue lines. Room was decent nothing special but clean, big safe for your belongings and bed was comfortable. Would Reccomend to stay again (for the price you can't eat this location)", "Date": "August 28, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Essex", "Title": "“Convenient Location for sites and Transport”", "Author": "st8sman", "ReviewID": "UR116824754", "Content": "This conveniently located hotel provided a generally comfortable base although the quality of the air conditioning varied from room to room. Rooms at the front suffered from some street noise and ambulances and their sirens regularly pass the hotel. There was a broad variety of items for breakfast which were spread all around the breakfast room. Staff were helpful and while I hesitate to recommend the hotel to others I will be happy to return there myself.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Boston", "Title": "“Awesome respite in Roma”", "Author": "gottagetawayBoston", "ReviewID": "UR116581133", "Content": "We just returned from a 12 day Virgin Vacation package which included this hotel at the end of a London-Paris-Rome trip, and it was all that we hoped for and more. The staff was friendly, our rooms were ready when we arrived at noon, the rooms were freshly redecorated and new, all 3 of them, and all was quite comfortable and clean. Would recommend if you are interested in being in Rome, a 20 min walk to the train terminal, 10 minutes to the Coliseum and many other ancient ruins.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Service": "3"}, "AuthorLocation": "Virginia", "Title": "“Excellent Location and Very Nice Hotel”", "Author": "Runner1018", "ReviewID": "UR116527274", "Content": "My sisters and I (all in our 40's and 50's) stayed here as part of an escorted tour of Italy. The hotel is in an excellent location! It's about two blocks from the Colossium and across the street (sort of) from St. Peter In Chains Church. The rooms were not big but not tiny either. The beds were comfortable. I have two minor complaints. One is that the vent in the bathroom went directly into the room next to us. I could hear the people talking in their bathroom as clearly as if they were standing next to me - kind of creepy. The other complaint is that they don't provide irons (we asked for one to be taken to our room and were told \"no\" because it would blow a fuse). Okay, I can understand that but they wanted 6 euros for each piece they ironed! We felt that was a rip off so we hung our clothes on hangers in the bathroom when we showered so that the steam would get the wrinkles out - it worked well enough. Would I stay here again? Yes - because of the location.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Loved it and would highly recommend!”", "Author": "runjnee", "ReviewID": "UR116382187", "Content": "A very comfortable hotel, and a wonderful experience. Staff were very friendly and helpful. The breakfast was incredible, and the room was so very lovely. The location is perfect for travelling around - it's right next to the Colosseum and a metro stop - and the staff are very cooperative with directions and advice. It made our experience so very nice, and we would definitely return when travelling to Rome next.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Troy, Michigan", "Title": "“Location, location, location...”", "Author": "sbethb4", "ReviewID": "UR115896480", "Content": "This was our second time staying here. We got a room on the 8th floor with a balcony. It was fantastic! Loved the room, very large for an Italian hotel or American hotel for that matter. The staff was mostly very friendly and helpful. The location can't be beat, its walking distance from everything in the city and is a great hotel for travelers. Couldn't have been happier with this hotel on this years Rome vacation. One suggestion though....bring something for your own wake up or set two calls, ours were late everyday and didn't get one of them at all. Otherwise, a great stay", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Great location!”", "Author": "poohbearRowlett", "ReviewID": "UR115827943", "Content": "Room clean and comfortable; location was great... I get lost easily, but this hotel was just down from the Colosseum, so no problems; the staff was so nice... I had to get up obscenely early for my flight home, and they packed me a box breakfast to take along!", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“A great place to start your visit to Italy”", "Author": "farrawaytravel", "ReviewID": "UR115734478", "Content": "As part of a vacation tour package, we stayed here for 3 nights. Our room was on the 8th floor. It was spacious, modern, and accomodating for three people. We also enjoyed a balcony, which we used every night. The room was clean and met our needs completely. We enjoyed a bountiful breakfast buffet each morning, and never had any problems our entire stay. The hotel is in very close walking range to major sites in Rome, including the Colosseum, St. Peter's in Chains, the Forum and the National Monument of Victor Emmanuel II. You can also easily visit the Jewish Ghetto and walk to the Tiber River. There are also numerous restaurants, grocery and pharmacias in close proximity.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Service": "5"}, "AuthorLocation": "Florida", "Title": "“Fantastic Hotel”", "Author": "AyannaFlorida", "ReviewID": "UR115443525", "Content": "Gate 1 Travel booked this hotel for us when we were in Rome and it was great. Wonderful, central location. Close walking distance to the Colosseum. Has beautiful rooms and lobby. Close to a lot of restaurants.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Dallas, Texas", "Title": "“My last stay here!”", "Author": "Katlowry", "ReviewID": "UR114587006", "Content": "I've stayed at the Palatino many times and when I book online I get a better deal than when I book a group that is planning on dining there as well. I felt the staff was indifferent to our needs if not just downright unpleasant. Seeing as I had 20 people there for 3 nights you'd think we'd get a little preferential treatment. Not even which was such a shame since this hotel has so much potential!! There are a few rooms renovated that are beautiful and the location is terrific. The food beyond the pasta is second rate and the bar overcharges on their drinks so double check your tab! Above all the internet is a major rip off!!!", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Philadelphia", "Title": "“We loved it and we'll be back”", "Author": "FRANKD_11", "ReviewID": "UR114381489", "Content": "Stayed for 4 nites May14 thru May 18 2011..Staffed very professional...Hotel very clean and bright...Room nice size no complaints very clean...Location great access to every part of Rome via metro/bus/walk.....", "Date": "June 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Staff so friendly to non-Italian speaking Americans.”", "Author": "Twithoutm", "ReviewID": "UR110636382", "Content": "Staff was bilingual. Very friendly. Location just steps from colloseum and metro. Will definately recommend.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Location, ...., and Nothing Else”", "Author": "pmohanram", "ReviewID": "UR105983479", "Content": "Only Positive Amazing Location : 5 mins from Coliseum, Forum, 2 minutes from St Peter in Chains Church (with Michelangelo's Moses Statue), 2 mins from Metro, 10 mins from termini, Nice restaurants all around Negatives Not worth 150 Euros a night Dingy appearance Small rooms, smaller bathrooms AC Turned off at nights Sketchy and unfriendly service Breakfast really average and monotonous Ripoff Internet (25 euros a day)", "Date": "April 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great Location - Very Outdated Rooms”", "Author": "rea22", "ReviewID": "UR104799248", "Content": "My husband and I arrived at the Termini Station at nine in the morning for a 3 day stay prior to our cruise and started hoofing it to the hotel with our suitcases. It is a pretty easy walk with no luggage, but I wouldn't recommend it with a heavy suitcase. The taxi ride back to the station only cost 7.50 euros, so well worth the money if you have luggage. The hotel booked us in but would only store our luggage and said we would have to come back at 2:00pm when the room would be ready. So after a long flight from Vancouver and a map in hand, we walked a couple of blocks to the Forum, and explored Rome for a few hours. The location of the hotel is amazing. We checked in at 2:00 and were pretty disappointed with the condition of the room - it was like something from a bad 70's motel. I haven't seen a door carpeted before - maybe it was a cheap way to insulate it from the noise in the hallways. We were on the 5th floor at the front of the hotel. The air conditioning wasn't working and the room was very stuffy, but really noisy if we opened the window. Breakfast was really good and plentiful. Ask for cappuccino or expresso from the server, they are happy to get you one. Having said all this the location of the hotel made up for any flaws. We felt the price was pretty expensive, for what you get. But I guess that's Rome for you, everything is expensive. You may have to pay a bit more and request one of the renovated rooms. It may be worth the extra. I also wish they had free wifi. I can't believe in this day and age you have to pay wifi in some hotels. We thoroughly enjoyed our stay in Rome, I don't think I have ever walked so much in three days. I hope we will return again to explore some more.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Surrey UK", "Title": "“Highly over priced”", "Author": "journiman", "ReviewID": "UR104640831", "Content": "Had a three day stop here with wife and 8 yr old daughter. Lovely area and good location but what a disappointment the hotel was. We paid over £600 for three nights and were given an old room in poor decoration, with wood hanging from the ceiling. The electrical unit made so much noise we had to have it turned off at night to sleep. Not that it helped, as the beds are like concrete. My wife had to revert to cushions on the floor! The room safe was not working so had to keep valuable with us all the time. Not a good idea in a city full of tourists and pickpockets. Breakfast was plentiful, but tables were not and we had to use place settings before they were cleared as not enough staff. This is a 4 star hotel, but sadly not 4 star service. I travel widely and I am not being fussy, this really is a poor standard. Hotel staff told us to complain to booking agent. Not impressed!", "Date": "April 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barnsley, United Kingdom", "Title": "“Great location.”", "Author": "eddiejules", "ReviewID": "UR103992007", "Content": "First class hotel with a great location which is a must for Rome.Metres away from the Metro.Service and facilities cannot be faulted. DO NOT TAKE THE TERRAVISION BUS FROM THE TERMINI TO THE AIRPORT. Our bus was almost 30 mins late departing and crawled to the airport (passed twice by dust carts).Just managed to catch the second plane transfer bus having booked priority booking.Very stressfull !!!", "Date": "April 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Collierville, Tennessee", "Title": "“Try another hotel.”", "Author": "Marieke17", "ReviewID": "UR103246849", "Content": "Very out-dated rooms. Food on breakfast bar was pretty awful and the hotel front desk staff could not have been more rude. Will not stay here again.", "Date": "April 8, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“THIS HOTEL IS A FRAUD and SHADY STAFF AND CHARGES...AND BED BUGS....DO NOT STAY HERE..”", "Author": "justsunn", "ReviewID": "UR101549593", "Content": "Yes this hotel is close to my destinations but BEWARE OF hotel charges and its staff...when I checked in around 5PM, this check-in guy wanted to see my passport...WHO THE HELL CHECKS PASSPORTS? I just have come from PARIS AND and HOTEL their didnt check my passport...I understand, they might want to see an ID but the guy was like passport...I didnt argue I handed over the passport and since you have to pay for the WIFI, I got 24 hours for E25...and when I checked out, the guy was like E35 and when I questioned he was E10 for city taxes...who charges 50% taxes? SInce, I had only 2 1/2 hours to the airport, I didnt argue..PLUS THEY HAD BED BUGS even though, I was in the newer rooms on the 7th floor, and they DO NOT CHANGE THE LINENS unless you request it which I found out on my last stay as I noticed my sheets were not changed....and their breakfast is OK until I saw HAIR in the SALAD...too disgusting and all nearby shops like to RIP off Tourists...they charged me E7 for two bottles of water and 3 bananas.....I went to eat in Paris too and went to mini market but they charged me appropriately....these people are FRAUDS stay away from the HOTEL...AND THEIR WIFI DIDNT EVEN WORK PROPERLY", "Date": "March 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston", "Title": "“Ideal location, clean rooms, nice hotel”", "Author": "fr3houston", "ReviewID": "UR100523763", "Content": "We were not expecting much out of this hotel when we first booked it, and the hotel really exceeded our expectations. The location was incredible - if you walk down the street of Cavour, you reach the Forum. If you look down any of the streets, it's less than a 5 minute walk to the Colliseum. It was also pretty close to the city center. The metro was literally around the corner which made getting to the Vatican much easier. The room was clean and spacious. Comfortable bed, nice bathroom. The only negative (very minor) was that the room only had two small windows near the ceiling, but they had power switches to open the blinds and the windows. Just no view or much ventilation, but this didn't bother us at all. Breakfast was great, lots of options. The service was all right - most of them were friendly enough, but if you're looking to depend on them in terms of concierge service, forget it. The internet was extremely expensive, which surprised us. We ended up paying for 12 hours (not continuous, 12 hours of usage total which helps) for about 20 euros. They do NOT have free internet in their business center, so you'd still have to pay for the service even if you use their computers.", "Date": "March 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Antonio, Texas", "Title": "“GREAT LOCATION AND BREAKFAST TO START YOUR DAY”", "Author": "advisorview", "ReviewID": "UR99786159", "Content": "I did thwe tour through Gate 1 travel and it was our first time in ROME. The first impression of the hotel is good. The staff is helpful and courteous. The rooms are small and the beds are light and can move easily. You might hear the voices in the hallway or next room. BUT THERE IS SUCH A PLUS with this Hotel regarding Location. You walk one large block to the Coliseum and three blocks down to the view the Roman Ruins, The Forum which you can do at your lesiure. The Trevi fountain with the church nearby is just amazing site and the spanish steps with the coture stores are another plus all close to the hotel . The stores that are managed by Orientals are NOT necessarily the best deals anymore. We had an Italian painter signing our purchased photos in sepia and watercolor. Then there are the merchants with knockoff items at good prices and genuine leather. We looked for items actually carrying made in Italy on the item. This hotel has a shower bath with a revolving type of glass curtain which can leak. So does the hotel in Paris. This was not my favorite but the water was hot when needed. We loved the breakfast offered the eggs, bacon which tastes like Canadian bacon, juices, cheeses, meats, and their Italian coffee was plentiful. There is a grocery store on the opposite side to the left when you exit the hotel and also to the left on the side of the hotel is a nice restaurant offering GIANT MUSSLES, Bufalo cheese with tomatoe which you can drizzle with olive oil for appetizer and the smoothest wine. With all the walking, we slept very well on the light matresses.There is a Phillips tv. There is a hair dryer. The staff helped with the internet. They are Italians and offer us their services and help to make our trip more enjoyable. We appreciated that. There is a book store at the end of the block where you may purchase Italian cookbooks in different languages. We both loved our stay here.The staff would call and confirm our transfers .", "Date": "March 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Haven CT", "Title": "“AAA great location good rates”", "Author": "VizziOne", "ReviewID": "UR98685492", "Content": "I agree with the previous reviews.This place has a great breakfast,great location central to all sights and great places to eat. Only drawback is a lot of tours, with a lot of kids.Stayed in Rm 520 at end of hallway (first rm was smoking ask for a new room and the porter called the desk and they changed me right away)this rm was very good.I would stay here again,walk to everything.Ask for a room at the end of the hallway", "Date": "March 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Deal, United Kingdom", "Title": "“Perfect hotel for a weekend break”", "Author": "dealdickie", "ReviewID": "UR96706946", "Content": "Worked out perfectly for a weekend break. Big room comfortable beds - friendly staff - fantastic breakfast buffet. Best thing is location - the streets directly behind the hotel were choc full of great bars, restaurants, ice cream shops ect.", "Date": "February 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Luis Obispo, California", "Title": "“Perfect location to see Rome and connect to the rest of Italy”", "Author": "Marco-Babs", "ReviewID": "UR95230416", "Content": "The hotel is just around the corner from the colluseum and around the corner from the heart of Rome. The farthest we walked was to the Vatican and that took only 30 minutes. Everything else is within that range. Also, the train station is a short walk (10 min.) up on the same street. In the streets behind the hotel there is the subway and you have the local eats including fresh filled cannolis to order!!! Markets nearby for picking up waters, wine, etc. plus an ATM on the corner. The hotel is older but the lobby is impressive and the rooms are good. Staff were very helpful and friendly.", "Date": "February 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Albuquerque, New Mexico", "Title": "“Good Stay!”", "Author": "Globetraveller1905", "ReviewID": "UR93798843", "Content": "I recently returned from a lovely 6 day vacation at Rome with my parents. We stayed at a trip classic room at GHP and it was a pleasant stay. Room was comfortable :clean with good bathrooms, good breakfast and helpful staff! The WiFi was the only issue, we did not get any signal in our room. The location was fantastic , just 10min walk from the colosseum and 20-30 minus to the other spots. We loved our stay and would definitely recommend GHP! Just a small tip: It is better to book your tours online and not go with the green line tours promoted at the hotel.", "Date": "January 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great Hotel - really added to a fantastic holiday”", "Author": "Jennyapple", "ReviewID": "UR91929662", "Content": "We travelled to Rome for New Year and stayed 4 nights in this great hotel with our three children aged 3, 6 and 9. From start to finish there was nothing I could complain about. The lady who booked us in spoke perfect English and offered great advice, the front desk staff were always helpful and attendant and the rooms (we had booked 2 inter-connecting as travelling with young kids) were really lovely. I had heard that hotels in Rome were small and expensive but the rooms in this hotel were very nice, good size, recently done up and I got exactly what I asked for. I did choose the upgraded room at a higher price (again advice of the reservations staff) and it was definetely worth it. The restaurant is fabulous and is really no more expensive than other much lesser restaurants out in the city. Location of this hotel is perfect - around te corner from the Forum and down the street from the Collesseum. Plenty to see and do in walking distance and there is a metro staion closeby although we didnt use it. All round - a good choice. The only problem my kids came up with was that there was no English speaking films for them to watch in the evenings when they just wanted to wind down after a busy day.", "Date": "January 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "North Dakota", "Title": "“Great stay!”", "Author": "buttonsgone", "ReviewID": "UR90891010", "Content": "We traveled with Gate1 Travel on their Romantic Italy Amalfi tour...all the arrangements they made were terrific. The Hotel Palatino in Rome is one example. The location is great - within walking distance to lots of Rome's \"attractions\". We even walked back from Vatican City one evening on our own...took about 45 minutes. It was my husband's birthday while we were there and there is a great bakery 1/2 block away that our tour manager, Nicoletta, recommended. I purchased a delightful cake there, took it back to the hotel and the hotel staff gave us plates, forks, napkins - all we needed to have a celebration in our room. We would definitely recommend this tour, Gate 1 and this hotel to any interested in a terrific trip to Italy!", "Date": "December 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Steamboat Springs, Colorado", "Title": "“Great Location!”", "Author": "seetheworld02", "ReviewID": "UR89019203", "Content": "This hotel was in a great spot! It was within walking distance of the Forum (maybe 10 minutes) and a two minute walk to the subway. There are also two amazing churches within walking distance. The room was nice - no complaints. The breakfast was runny scrambled eggs, bacon, bread, pastries, fruit, cheses and meats. We ate dinner here the first night - we were exhausted when we arrived. This was the best meal that we had! The gnocchi with buffalo mozzarilla and tomato was amazing!!! Ask for a bottle of the house wine. It is wonderful and very inexpensive. The staff were very nice. We arrived before our room was not ready. By the time we had used the restroom and freshened up, our room was ready. We have no complaints regarding our stay.", "Date": "December 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Buenos Aires", "Title": "“Nice view”", "Author": "Chindemi", "ReviewID": "UR88590823", "Content": "Big rooms with nice view of Rome (we stayed on 7th floor). Near the forum and colesseum. Nice restaurant and complete breakfast. A bit expensive.", "Date": "November 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Great location”", "Author": "Ronin28", "ReviewID": "UR87165795", "Content": "Hotel is centrally located, close to major attractions in Rome. Stayed part of a group tour for 2 nights. Rooms are large for European standards. Large reception area. Caters mostly to big tour groups, so might tend to be rather noisy at times. Food in the dinning room o.k. nothing special.", "Date": "November 15, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Hamburg, Germany", "Title": "“NOTHING SPECIAL”", "Author": "Zimmermann068", "ReviewID": "UR86143623", "Content": "I stayed in Rome with some friends of mine. The position of the hotel is great:right in the town center, just a few steps from the Coliseum. Rooms need a refreshing and breakfast has to be improved. Reception should be more friendly and attentive.", "Date": "November 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Banbury, United Kingdom", "Title": "“Loved Rome.. liked the hotel”", "Author": "halwaya", "ReviewID": "UR86025809", "Content": "The Grand Hotel Palatino has a great location, just few minutes away from the Colosseum. By the hotel there is a 'City Sightseeing' bus stop, so a perfect start for your exploring Rome adventure. The hotel staff can arrange the tickets for you, but still you can do it yourself directly from the bus pilot ;) Front desk staff was very helpful and had a sence of humour, We enjoyed the experience of checking-in and checking out. We have booked the old-style double room and I must admit I would recognise why it was called 'old style', but it was clean and the bed was comfortable, so for me that's not a problem.. as I spent most of the time away.. In the night you could hear the traffic.. anyway I was that tired every day that it didn't bother me at all. The bathroom was also old style, but also very clean.. the only thing I didn't like was the sound of the toilet flush.. quite loud, so I hope we didn't irritate our 'neighbours'. The breakfast was a nice experience too. Palatino has two breakfast rooms. One is for the large groups and the other is for the individually booked guests. As we were the individuals we loved it. The waitresses were not always smiling, but again I know how I act sometimes at work when dealing with the customers, so I fully understand :) Outside the hotel there are nice restaurants, pubs, internet cafe, grocery shop, so pretty much everything what you need. Overall I must say I liked the hotel and probably I would choose it again.. because something tells me I will go back to Rome again. I loved the city.", "Date": "November 5, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Location": "4"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“Avoid this hotel, extremely dated rooms, rude staff!”", "Author": "trixie1948", "ReviewID": "UR83499189", "Content": "The rooms in this hotel have not been updated since the 80's. This is not a 4 star - more like a \"barely\" 3 star hotel. The carpet was old and dirty and the beds were hard and uncomfortable. The front desk staff was all extremely rude and very unhelpful. The location is great, but there are many hotels in Rome with great locations. We stayed at another hotel for 2 nights in Rome before moving to the Palatino. It was close to the Vatican and it was wonderful! The cost was about $10 more but worth it. I would not recommend the Palatino Grand Hotel for anyone. Additionally, friends we were traveling with found bed bugs in their room. I know this is a world wide problem, but no one wants to be in a hotel with bed bugs.", "Date": "October 14, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Columbus, Georgia", "Title": "“The Palatino Hotel”", "Author": "charlotte08", "ReviewID": "UR82587220", "Content": "My husband and I have stayed in this hotel several times and each time has been a good experience. It is very clean, close to everything, walking distance to all the wonderful places that we enjoy going to, good restaurants nearby,, good gelato on the corner (best in Rome), good shopping, and an excellent breakfast.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“Perfect location. Our hotel for Roma!”", "Author": "Carroll177", "ReviewID": "UR77140601", "Content": "We searched hotels on the Internet and this one captured us because of the location and the fact that they had a category of rooms, Executive Rooms, top floor with balconies. So, sight unseen, we booked and prepaid for three nights. We arrived in the morning from a cruise ship and our room was ready. We opened the door to our room and were delighted! The room was plenty large with a queen bed, hardwood floors, flatscreen tv, and the bathroom was huge with an emormous tub/shower. But the balcony overlooking the rooftops of Rome was the best with a small round table and two chairs -- plus total privacy. The Forum and Colosseum are just 3-4 blocks away. We walked from our hotel everywhere to see the sights. Breakfast was included and it was average, but very nice with scrambled eggs, bacon, breads, pastries, fruit, cheese, etc., etc. We certainly have no complaints. If, no when we return to Roma, this will be our hotel.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Centrally located near to Forum and better than most”", "Author": "tvjk", "ReviewID": "UR75789130", "Content": "Stayed here for week in August and found the hotel a good choice. Stayed in a modernised room on the 7th floor and found the extra cost worth the money as the standard was higher than the other hotels in Rome I have stayed in. Buffet breakfast was fine with a mixture of hot and cold dishes. Limited drawer space in the room but not a major problem. I found no problems with the desk staff unlike other reviews. The hotel is very close to the Cavour metro station which is very handy and not at all noisy. There are also stops on 117 mini bus just around the corner and the open top tourist buses stop outside the hotel as St Peter in Chains Basilica is up the steps opposite. One thing to note is that the lower part of Via Cavour i.e. Outside the hotel is closed to traffic on Sundays as the Forum is a pedestrian zone so the buses don't run past the hotel -use the metro if travelling from Termini.", "Date": "August 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Illinois", "Title": "“Great location and reasonably priced”", "Author": "Koku", "ReviewID": "UR75255307", "Content": "The location is great - just a few blocks from the Colosseum and Forum. We were able to get a really decent rate after keeping an eye on their summer specials. I've stayed there before as part of a tour group - which this hotel does seem to cater to. Roberto at the desk was very helpful in recommending local restaurants that were excellent. Our favorite was Ceito (I'm probably spelling it wrong). Homemade pasta and excellent waitstaff. Loved it so much we went twice.", "Date": "August 15, 2010"}, {"Ratings": {"Overall": "1.0", "Location": "2", "Service": "1"}, "AuthorLocation": "Newport Beach, California", "Title": "“Rude and unaccomodating for family with kids”", "Author": "kylescott", "ReviewID": "UR72049193", "Content": "We booked a room for July of this year. When we arrived from the airport we were told that our family of four, husband, wife and two kids (12 & 14) could not stay in the triple room that we had booked. We were told that we would have to pay for two rooms, which would not even be adjoining. When we told the hotel staff that we did not want to pay for two rooms and would find another hotel to stay at, they told us that they would still charge us for the triple room that they would not let us stay in. I told them if they did, then I would go on tripadvisor and write a bad review. They did not care and charged my credit card, which I am disputing. So I am keeping my word and letting potential guests know that this is a terrible choice for families traveling in Rome. I would not recommend this hotel EVER!!! Also, Via Cavour is a main street and it is very noisy.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Good choice for tourist travel”", "Author": "TX_Vic", "ReviewID": "UR67537438", "Content": "We stayed in Rome for a week and enjoyed our stay at Grand Hotel Palatino. There were good and not so good things but I'd likely stay there again. At check-in we were shown a 2nd floor room facing the street. I said no way, we need another room. Only room we could get was an upgrade. We paid an extra 30 Euros a nite and were put on 7th floor facing rear of of hotel. OK the air conditioning thing. It was on the warm side in Rome during our stay. I was told by the front desk they do not turn on the AC until June. We got this story everywhere in Italy, except Florence and Cinque Terre. So this was a problem for us. Couldn't keep the windows open at night because the noise coming up from tavern on the street below. It was way to warm. Breakfast was very good. Eggs, sausages, fruit, cereal, breads, meats and cheeses. The room was a decent size by Italian standards but small by USA norms. Bathroom was clean, the bed was firm but comfortable. Housekeeping did an excellent job each day. Absolutely no bug problems as stated in another review. Staff was efficient and helpful but not overly friendly. The location might be it's best feature. For the price I would expect air conditioning next time or I might be tempted to find another place.", "Date": "June 14, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Hays, Kansas", "Title": "“Very nice hotel!”", "Author": "kansastraveler42", "ReviewID": "UR67262980", "Content": "I read a previous review and just had to comment - this hotel DOES have air conditioning! The location is great - a few minutes walk to the Colosseum and other sites. Also close to cute shops and cafes. I was with a high school trip of 27 people and the service and accommodations were quite nice!", "Date": "June 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New Windsor, New York", "Title": "“BED BUGS!!!”", "Author": "andypro", "ReviewID": "UR67108587", "Content": "My wife was covered in bed bugs after staying at this hotel. I only hope that we did not bring them home with us. We were on a great tour with a great guide but this sure will put a cloud over our great memories. She is now on prednisone and we are hoping that we do not have to treat our entire house.", "Date": "June 10, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Diego, California", "Title": "“Roman Holiday”", "Author": "Day12", "ReviewID": "UR66987053", "Content": "Rome was wonderful! The Hotel is located central, a short walk to the Roman Forum, and many attractions in the area. Can't complain the hotel staff was pretty friendly. The Continental Breakfast was good. Although, I think the eggs were a little funny. But overall a nice hotel.", "Date": "June 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Joplin, MO", "Title": "“Good location and helpful staff”", "Author": "PJKJoplin", "ReviewID": "UR64638928", "Content": "We found this hotel to be totally acceptable. I was a little nervous considering some of the reviews. The location is excellent. The rooms were average size for a European hotel in a large city. The breakfast was not outstanding but certainly fine. A huge tour group invaded the hotel our last night, so the breakfast room on the last morning we were there was packed. On our trip to the hotel, I was separated from my spouse and friends at the train station. Long story, but the hotel staff was very kind and helpful as my husband and I tried to find each other. One person actually loaned my husband her own cell so that he could call back in to see if I had made contact.", "Date": "May 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montréal", "Title": "“The bus tours love it”", "Author": "Roger123", "ReviewID": "UR63935852", "Content": "I was here for 10 days during May 2010. I booked it since it was walking distance to my meetings but I was initially a bit worried due to some poor reviews on this site. As far as I can tell, those who complained must not be used to anything other than the Four Seasons since my experience was overall quite pleasant and uneventful, especially given the average price of about 150 Euros a night. Okay maybe the noise from the hallways was a bit much and I think if your room faced the street and not the back, it could be a bit loud but hey, this is Rome. The location and the staff are great and the rooms are huge for Europe but this is not a charming old world hotel. It's a large modern(ish) hotel that big American bus tours seem to love. In fact, it seemed that very few guests were not a part of such a group. The location is brilliant, about a 2 min walk to Cavour metro and about 15 min walk to the main station. In the other direction, the Colosseo is a short walk away. Behind the hotel and down the hill are some great little restos that are not touristic at all and offered good meals. Across the street and to the left is a decent sized supermarket which was a nice convenience. Overall this hotel is just fine but may not be what certain people are expecting in Rome.", "Date": "May 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Athens, Greece", "Title": "“OVERPRICED DEFINETELY NOT A 4STAR HOTEL”", "Author": "mimikapan", "ReviewID": "UR63187505", "Content": "We paid 166 euro per night for this 4 star hotel. We stayed at the new style double bedroom, Room was not very clean (you could see the dust in many corners), the bathroom was nice, the beds were rather stiff and none of us enjoyed sleeping (we were two couples), breakfast was good nothing fancy (typical scrambled/boiled eggs, bacon, marmelades, bread, cheese, salami, canned fruit, cereal). The service was rather good (we were lucky as a greek girl was working at the hotel so we could communicate much better). Overall I would not recommend the hotel due to the price which by no means corresponds to the 4star it says it is. Location is not bad (e.g. about 25 mins quick walk to fontana di trevi, very close to the colosseum) mimika-dimos/elena-giorgos", "Date": "May 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“With everything one needs around...”", "Author": "KristynaK", "ReviewID": "UR63151637", "Content": "This hotel was in the middle of it all. The Colloseum was only 5 minutes walk, so you can have a walk there any time of the day, it looks especially glamorous at night. Metro is literally few metres away, because next to the hotel are stairs leading almost to the actual metro station, the is loads of lovely little ristorantes and trattorias around that area that we didn't even manage to try a quater of them during our stay and for a caffee and a dessert in the afternoon I recommend sweet little caffeteria which is opposite the stairs leading towards metro. Room was good enough, very comfortable and clean, only downsite was the bathroom which wasn't quite as nice (it was definitely clean though), because it was small and the toilet was hiding behind the door and also quite noisy (i.e. when flushing). Internet is paid! Very annoying it's very expensive - 5€ / 30 minutes, 8€ / hour, 25€ / day. I took my laptop with me to check to sights on the internet, but wasn't willing to pay that riddiculous sum, so didn't use it at all. Staff at the reception is very helpfull, they give you a printed map of centre of Rome and you can pretty much get by with it, if wanting to see the main things. They even told us what the main things to see are depending on how long we stay. Breakfast is lovely, wide selection of stuff - you get some fruit, veg, bread, lovely prosciutto ham, eggs, croissants...", "Date": "May 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "los angeles + new york", "Title": "“Customer Service + Central Location + Accommodations = Grand Hotel Palatino!”", "Author": "mrs-metropolitan", "ReviewID": "UR61622735", "Content": "We HIGHLY recommend The Grand Hotel Palatino! We have stayed here twice in the last two years. Here's why.... - Location is very central and within walking distance to many attractions/tourist sites and one block to the metro if necessary. - Accommodations are clean and spacious. (Larger than average European size room.) - Staff is extremely professional, friendly, and helpful. Also, there is always someone who speaks English on duty at the front desk. The hotel has gone through renovations and we have stayed in both their non-renovated and renovated room. Both styles are comfortable and clean. If you are doing price comparison to other hotels in Rome, you may find their rate may be a bit higher than others. However, it’s worth the few extra Euros (trust us)! We have stayed at other hotels in Rome and The Grand Hotel Palatino receives our highest remarks and exceeds all expectations with customer service! We look forward to our next trip to Rome and plan on staying at Grand Hotel Palatino.", "Date": "April 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Great location and friendly staff”", "Author": "MrTin", "ReviewID": "UR59728881", "Content": "The room we stayed in was quite old and the air con was broken. The breakfast was a little bit poor but ok. We stayed here for two nights and the location was perfect for exploring Rome.", "Date": "March 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "California", "Title": "“Mohair Walls !?!”", "Author": "luvswine2", "ReviewID": "UR59514581", "Content": "This hotel was recommended by our travel company. Disgusting ! Room actually had furry walls with 60's style furniture, roll out beds, filthy carpet and walls, could hear everything neighbors said and did as well as noise from the street, awful food, surly rude desk clerk, tiny bathroom ! We didn't have enough room to lay out our luggage in the room because the room was so small. We had 3 pieces of luggage, not a lot. Had the front desk call for a reputable taxi when leaving, taxi driver abused us with a 120 plus miles an hour detour through junk yards and scary roads to the airport. Yes we were three women and I think he did this to intimidate us.Then over charged us when we got to the airport. Thanks for sending us a reputable taxi. Horrible place avoid it !", "Date": "March 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dumfries Scotland", "Title": "“I would definately go back to the Palatino”", "Author": "Toots14", "ReviewID": "UR59011700", "Content": "The room and en suite bathroom was very clean and spacious with bright modern furnishings. It had a comfortable sitting area and there was plenty space for clothes, shoes etc. It was in a really good location close many of the sights. About 10 minutes from the colosseum and very near the Metro. I would stay there again.", "Date": "March 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "amersham", "Title": "“sounds grand but not the case”", "Author": "millieamersham", "ReviewID": "UR57322013", "Content": "As a surprise, i bought a four day trip to rome for my partners 40th birthday. On arrival I found the reception staff to be rude and very unhelpful. The reception arear was very dated but to be fair clean. On arrival to our toom the wall safe had been jemmied open, and again, very basic for an alleged four star hotel. We made the complaint about our safe and we were provided with a key, but it was clearly not secure. In the morning of the next day, proceeded to go and shower, no hot water or cold was available, an immediate complaint was made, to no avail stating building work was in progress, the water remained off for four hours until 1400 hours. This continued for the whole stay. This totally ruined our stay, and despite numerous complaints were sneered at by staff. No iron was provided in the room, stating it was against fire regulations, however for a samll fee of 12 euros they offered to iron a shirt. All in all this hotel would struggle to get 2 stars in the UK. A definite No from us", "Date": "February 28, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Amazing”", "Author": "Emilywhite", "ReviewID": "UR56373431", "Content": "This is a very well kept hotel and the rooms/balconies are astonishing.", "Date": "February 18, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Ok..more of a college aged tour hotel”", "Author": "TechnoPimp", "ReviewID": "UR55989260", "Content": "We stayed at this hotel for a total of 4 nights. The first 3 nights were ok. The rooms are slightly small but ok. The staff was always very nice and helpful and its in a decent location for Coliseum , Train station and Shopping areas. However, this is a 3 star type hotel and we did have issues with loud drunken neighbors on our last night there. Hotel staff was pretty much useless with this issue. All in in all our stay was decent but I would not stay there again. The break fast was passable but just passable. The Hotel is a bit older so it does have a bit of a worn look about it but reasonably clean. Bottom-line its just not a family vacation hotel more of a college-aged tour bus type of place.", "Date": "February 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "NYC", "Title": "“bed bugs!”", "Author": "travellover421", "ReviewID": "UR54640681", "Content": "Please stay away. Between my roommate and I, we got 50 bites!", "Date": "January 29, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Hermosa Beach", "Title": "“Stay away...”", "Author": "HermosaB", "ReviewID": "UR52770945", "Content": "we spent the holidays in this hotel. Location was great, I must say,but the hotel staff was no friendly at all. I broke my leg while in Italy so I was in an wheelchair for most of the time while in Rome. The staff were rude and not helpful. Our room was on the old part of the hotel, was dirty, all the plugs were not working. We woke up every day at 7am because of the remodelations right on the top floor! I don't know how other people in the reviews said got slippers and robes, we verily got clean towels, the bathroom was not very clean. Ladies, take your own hair dryer, the one in the hotel is very old and it took me long time to dry my hair. Breakfast was until 10am, mediocre but ok. Do not drink from the coffee pots provide at the table, its horrible, taste like instant coffee. Order with the waitress, if you are lucky you will be able to drink your cappuccino 1 hour after ordered. We usually got there around 8 or 9am and waited 20 minutes for a table most of the time. We wanted to move from this chaotic hotel, but due to the holidays all the hotels were booked up. Rome during the holidays was pretty busy everywhere, the advantage of being in a wheelchair was most of time we didn't have to wait on line for museums or Sistine Chapel but people were rude and got lots of discriminatory looks on the streets.( My cast was not visible, because the cold was wearing a black sock.) Overall, Rome is a beautiful city, stay away from Palatine Hotel, don't get fool for the 4 stars.", "Date": "January 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Louisiana", "Title": "“The quality of the room was a suprise”", "Author": "LouisianaTravelor", "ReviewID": "UR49067928", "Content": "This hotel is located just 1/2 block from the subway. My room on the top floor was very nice, recently updated with the now common flat screen tv, very nice bath, small frig. and nice bedding. Just across the street is \"ELITE\" a nice size grocery store with excellent prepared food. Just behind the hotel and down a set of stairs is a street with several small nice restaurants, a lively bar and a pizza restaurant cooking with a wood fire.", "Date": "November 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Prescott AZ", "Title": "“Fantastic”", "Author": "Suzy7837", "ReviewID": "UR47609674", "Content": "Great hotel in a perfect location in a pleasant neighborhood with nice restaurants near the Colisseum, Forum and other monuments. Convenient to local transportation. Staff was very pleasant and helpful. Lovely ambiance and even received a complimentary upgrade from standard double room to 2 room suite, as it was our honeymoon. We will never stay anywhere else in Rome on future trips!", "Date": "October 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Charleston, SC", "Title": "“Clean and good location”", "Author": "ABGSC", "ReviewID": "UR47429992", "Content": "We got one of the executive rooms with a balcony overlooking Via Cavour with a view of some of the Forum in the distance. With the exchange rate being as it is, this hotel was expensive, especially compared to what you get in the states for a similar price, however I can't say it was out of line with prices for comparable hotels nearby. The breakfast was very good, just make sure they seat you in the smaller dining room as there was more to offer in there. The location was definitely central to all of Rome's most popular attractions. Also, just as a note, internet was five euro for thrity minutes.", "Date": "October 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Nice place, good location, if you get one of the new rooms”", "Author": "Cueball123", "ReviewID": "UR42923214", "Content": "We had a great stay for 3 nights at the Palatino. The staff was great. Breakfast was good enough. Location was super (2 blocks from Coliseum.) Our friends had some of the older rooms and were quite dissapointed. We had some of newer suites which were huge, brand new and stylish! Overall it's a good value and good choice.", "Date": "September 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Perfect!”", "Author": "scubalaura05", "ReviewID": "UR40105673", "Content": "We booked the Grand Palatino Hotel after a great recommendation from a family friend. The hotel lived up to all of the wonderful things we had heard. The location is great- literally 3 minutes from the Colosseum and 10-15 minutes walk from Trevi Fountain or Termini Station. It is also just down the street from the Cavour metro stop. Our room was right in front of the elevator which always makes me nervous and we were on the front street-side, but I never once woke up from either noise. The hotel has double-pain windows which kept our room quiet and cool with the powerful AC. Breakfast was good, but be sure to beat the tour groups. One morning we slept in (around 9am) and the smaller dining room was full so we ate in the tour group room. There was less to choose from, it was very picked over and the service was sparse. We learned our lesson and never had that problem again. We had a great stay and would definitely recommend this hotel.", "Date": "September 8, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Charlotte, NC", "Title": "“Falcaldo in July”", "Author": "borge", "ReviewID": "UR39401194", "Content": "Rome in the summer is hotter than Hades, but nonetheless the swamp a$$ is worth it. My wife and I traveled via back pack from Finland to Itlay, hiking through the Swiss Alps and into France before we finally settled in the beautiful, but dirty city of Rome. The Palatino Grand Hotel was situated near the Colloseum and overall was a well positioned hotel in the city. Easily within walking distances to every major sight (except the Vatican) 5 minutes! As most Italians told us the time it took to get anywhere. Good luck finding the Trevi Fountain and the stupid Spanish Steps, we walked around the same spot several times, before we stumbled upon the beautiful, yet jam packed fountain. The Italian people in Rome were pretty rude to say the least, but that's because they mistook me for an Italian and thought of me as a \"sell out\" because I am not fluent in Italian, to their and my mother's dismay I am not Italian, just darker than your average Norweigan. Be prepared to bump into people often, because Rome is packed with people, learn the word \"scuzi\" and the hand gesture that resembles a \"fyou\" in America, you will need both Italian staplemates. The hotel was standard at best, it had air conditioning, the rooms were clean and the bathroom had a very sensual toy for couples only, it was amazing, cold water flowing in your nether regions, sensational idea those Italians have. The breakfast was offered as a buffet, my god was it not an American style breakfast, I ate popovers with jam and canned peaches everyday, I didn't want to touch the eggs, or the sausage that looked as if they were still clucking and snorting around on plates, at least it had bottle water. Speaking of water, the public water in Rome is actually good to drink, I drank from the Spanish Steps and at the Roman Forum, the Roman Forum was very refreshing, especially the one at the top of the hill overlooking the entire city, make sure you push your way through to the water to get a sip, because Europeans have never heard of waiting in a line like normal, civilized people, which is hard for me to say since I am European at heart. You must find IL Maggio Ristorante near the Trevi Fountain, it serves up the greatest Pollo Romano that I have ever had! We spent some serious Euro here, but well worth it, ask for Gino and you'll get free bread. A few helpful hints while traveling in Rome: do as Romans do and walk out in front of traffic at anytime, but be leary of mopeds and motorcycles. Don't take pictures with guys dressed in gladiator suits, they will charge you 5 euro per picture, or smack you around a little if you don't pay. Refuse the bread at dinner, because they will make you pay for it even if you don't ask for it. Ask the restaurant if they take credit card first before you start ordering, sometimes they don't take credit card unless it's over 40 Euro, and last but certainly not least, don't exchange your cash and use your debit card at the ATM, or credit card as much as possible, you will get a much better rate. Overall the hotel wasn't very nice looking, it didn't have any real character and was not what I would have expected in Rome, however it was safe and clean and was in a decent area for sightseeing.", "Date": "August 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "teaneck nj", "Title": "“fantastic location and great breakfast!!”", "Author": "smile220", "ReviewID": "UR39270907", "Content": "The hotel location was fantastic. 3 minutes from the Colosseum and 10 to the Trevi Fountain. You couldn't ask for a better spot. The staff was helpful and the service great. The breakfast was wonderful as was the capuccinos. We had the new modern rooms and they were beautiful. The rooms were soundproof and you could not hear any outside noise even on this busy street. I would definetly stay here again.", "Date": "August 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bergen, Norway", "Title": "“Great location!”", "Author": "Fabrizio80", "ReviewID": "UR38461585", "Content": "I loved the location of this hotel, it's a five minute walk to the coloseum and very close to good restaurants. Breakfast was good, they had a lot of things to choose from, the only bad thing is that they had stuff all over the place during breakfast so it was a little confusing. Staff could be a little friendlier, but they provided accurate answers to our questions. The room was really nice and we had a very nice wiew. I would reccomend this place", "Date": "August 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "maryland", "Title": "“LOCATION, LOCATION, LOCATION”", "Author": "pimptown", "ReviewID": "UR37999319", "Content": "This was a very nice hotel maybe because we had a room with a view of the city and the room was equiped with a terrace. The terrace was well lit at night ...bring bug spray....and provided a table and chairs. The bathroom and the actual room was new with mosaic tiles, marble and art work were a blessing. Robert, at the front desk was so so very helpful on things to do and places to go in the area. In fact, he went way out of his way to accomadate our ventures. Please remember it is a lot easier to exchange your money at the hotels...and this hotel was no exception. On the 8th floor we experienced turndown service every night with a well equipped coffie maker, robe and slippers...you can keep the slippers too!!!! The location was near the train station, fourm, colosseum, internet cafe and resturants. Additionally, all of the hop on hop off buses that gave a great tour of the city could be found right around the corner from the hotel. Additionally, the hotel provides a private shuttle service to the airport which was great for 50 E. Two blocks away are roman remains of the eternal city to explore and enjoy.", "Date": "August 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“You must get an executive room on the 8th floor!”", "Author": "mymywhatadump", "ReviewID": "UR37995056", "Content": "This hotel has a lot of tours staying with them. They are on the lower floors. I didn't see those rooms, but I saw the hallways. If you want really nice rooms you must make a reservation for an executive room. These rooms are on the 8th floor. We had the simplest (no lounge and not a suite) room. Our room had a small private terrace. The beds are hard, but it seems Italy is filled with hard beds. I loved the bathroom. They had the best shower in Italy. We had controls for the airconditioning and our rooms were cool. The breakfast was okay, you just had to search a little bit. They need to cook their eggs longer. They cook the bacon so one side is crispy and the other side isn't. Just eat the top half. Loved the hams, fruit and bread. The subway is very close. Make a left and walk about thirty seconds. There are a lot of really good restaurants that are cheap. To get to the best gelato place: Make a right out of the building and walk to the corner of the block. Make a right and walk up the street. The place is on the left side of the street. If you need to buy water (it was very hot) the best place is to the right of the hotel. It is one of the tacky little stores before the corner. A bottle of water was 80 cents instead of the 2 to 3 Euros at other places. Very close to several ruins and walking distant other sites.", "Date": "August 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Luxembourg", "Title": "“Very Pleasant Stay”", "Author": "WangwangLuxembourg", "ReviewID": "UR37572210", "Content": "Great location, clean rooms, and thoughtful staff. I would stay here again.", "Date": "August 13, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Bavaria, Germany", "Title": "“Big disappointment”", "Author": "jla1113", "ReviewID": "UR36563252", "Content": "After looking on line at MANY hotels in Rome, I decided on the Palatino. It looked lovely and the location was perfect. Unfortunately, as I have learned on other occasions, sometimes photos don't tell the whole story, or a business can be very selective with what they photograph. Our room looked like it had not been updated in atleast 40 years. The AC did not work, so we slept with the door propped open because the one in the hallway was right by our room...it was cranking out the cool air. The bathroom had mildew in the tile of the shower/tub area and around the window...it was also dirty along the window. The vanity area was very small and the hairdryer was ancient. Not to mention there were no plugs where I could use my own hairdryer. I found our extra clean towels laying on the bidet. We requested a cot when reserving online. When we arrived in our room there was no cot and we ask 3 more times, once just after check in, once at 11 pm and again the next morning...we never got the extra cot. Luckily our child was under 6 and we weren't charged for it. However, it was a bit cramped having a 6 year old and almost 4 year old share a twin bed. The breakfast that was included in the cost was not bad. Living in Europe, I have had way better and I've had some that were worse. However, the service was not the best. Once day the waitress was very attentive with our young boys and the next day we could hardly get a cup of coffee. Also, the front desk service was not exceptional. Seemed like we were interupting them when we ask a question. There was one gentlman, unfortunately I did not get his name who was VERY nice and gave us some excellent tips and directions for getting to the Vatican. The redeeming quality for this hotel was it's proximity to the Colosseum and other sites. With young children we were able to walk to many sites and had little complaint from them.", "Date": "August 3, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Boston", "Title": "“Nice location, poor service, dishonest”", "Author": "haplo888", "ReviewID": "UR36019601", "Content": "When we arrived for our 8 night honeymoon stay, their garage was flooded and they offered to leave our car in a reserved area in front of the hotel. We left our keys with them in case they needed to move it. At 8am I went down to move the car to the garage and found that they had illegally parked the car down the street and I had a huge ticket. After much agruement they finally agreed to pay the fine, but a few months later my rental company had charged my credit card for the unpaid fine. Worse, we had called in advance to check out parking arrangements and were quoted a price for parking. We confirmed this price when we parked the car. However, upon checking out they demanded some 150 euros more than the quoted price. The demanded price was much more than the rates the garage had posted on their wall. The hotel refused to help now saying that the attached Palatino garage had nothing to do with the Palatino hotel. Luckily, the car was blocking all their incoming and outgoing traffic, and I had already gotten the keys. We negotiated an agreement about in the middle of the promised and the demanded prices. Ridiculous.", "Date": "July 28, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Alberta", "Title": "“Great Location to Metro & Collisum”", "Author": "AlbertaMickey", "ReviewID": "UR35410000", "Content": "We were with a tour company at this hotel, and understand why. The rooms are a standard size for Europe, were clean, and the shower actually worked well. The area felt safe, the front desk was most helpful, and english is universal. Beside the hotel are stairs that take you to a narrow road behind the hotel with a fabulous restaurant called the Cricket and the Ant - english version, and next door a most delicious ice cream store. Half a block away is the metro to anywhere in Rome.", "Date": "July 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Charlotte NC", "Title": "“Great Hotel Choice in Rome”", "Author": "swisschar", "ReviewID": "UR35242042", "Content": "We spent one night at the Palatino Grand Hotel before boarding a cruise ship the following day. The staff was very friendly and upon arrival the front desk advised us that they had upgraded us to an executive suite (we booked a superior room). The suite was very spacious with a beautiful bathroom and a private balcony. A piano bar was next to the lobby where we enjoyed an evening drink and some great music. A very nice breakfast was included. This hotel was a great find for us.", "Date": "July 20, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "3"}, "AuthorLocation": "georgia", "Title": "“Great location...that's it. Bad value i think”", "Author": "pathkid", "ReviewID": "UR34329560", "Content": "Pros: location great!, clean rooms, large hotel with all amenities, speak english Cons: pricey, broken AC, wont help you out, bad breakfast (for USA folk) This was the 3rd and final hotel on our Gate 1 Affordable Italy Tour. It was basically the worst one. The location is great! about 200 ft to the Cavour Subway line from which it's like 5 to 10 minutes to Spanish steps etc. The coloseum is like one street away 500ft. So, what was bad about it? Again, it's personal i suppose, but here it goes. Our AC was broken, and they wouldnt move us to another room..\"excuse is no space\" ALot of our tour group folks had broken AC, so I think it's a common complaint, but they dont seem to care, maybe cuz we already paid as part of tour package. Breakfast was again bad, cold stale bread, bad runny eggs, cheese/cold cuts ok, ok yogurt, and ok coffee/espresso (from a serve urself machine). I realized why European bbacon is so bad. It's unsmoked and super thick. It's like eating pan fried hand sliced fatback, which I think Europeans like. I like USA style that is smoked and crispy thin. Hotel was basically packed with tour groups. They do speak english and seem a little helpful with tour questions, but they won't cater to your complaints at all, cuz they got 100's more coming after you who already paid as well. So, no I wouldnt come back to this hotel.", "Date": "July 9, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "South Jersey", "Title": "“Mediocre Hotel in a Great Location”", "Author": "NormSouthJersey", "ReviewID": "UR32920594", "Content": "After staying in very nice hotels in both Venice & Florence we were disappointed in the Palatino. Dirty carpets, room needed painting, very poor TV reception and very mixed service. Comfortable beds and a clean bath. We found one concierege who was great but others who literally could not be bothered. Breakfast was included every day but was poor. The location, however, was excellent. A block from the colossium, a block from a subway stop, maybe 3 blocks to the Forum, accross the street from St. Peter in Chains, etc. Included as a part of our tour, I would NEVER pay full freight for this place.", "Date": "June 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“great location - average hotel”", "Author": "dotress", "ReviewID": "UR32022401", "Content": "This hotel is adequate for travellers. In no universe should it ever be classed as 4 star though. At the recommendation of others we requested a top floor room as I understand these have been rennovated. Instead we got a 5th floor room. Room was standard and clean. No tea and coffee facilities. What was ridiculous was no iron in the room, no ironing room and no facility to bring you an iron as 'the wiring in the room is too old and it will blow up if you plug in' (reassuring as there is a TV plugged in...). What they will do is iron your clothes for you at a cost of 9 euro an item. Front desk ok - not great service on the evenings, better in the mornings The location is great though - really close to the Colloseum (5 min walk) which meant we could get there before the crowds. Beware of taxis ordered here though as one clearly had his meter tampered with and charged us a fortune - the meter ticked over at 3 times the normal speed", "Date": "June 10, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "New Jersey", "Title": "“poor service and dirty carpets”", "Author": "JG-10", "ReviewID": "UR32020312", "Content": "The best thing to be said about this hotel is its location, literally around the corner from the Colosseum, and one block to the train station, also plenty of bus stops nearby. However, the concierge staff was completely indifferent to us, not sure if it was because we are Americans, but most of the staff seemed bothered by us, no matter what our question was - and I even speak some Italian! When we arrived, they didn't offer to take our bags up to our room for us, we did it ourselves in the small elevator. The only two staff members that were friendly and helpful were Ornella and Roberto, everyone else was useless. We asked one guy to recommend a nearby restaurant for us, and he just shrugged and pretty much told us to walk around and find one on our own. NICE SERVICE, PALATINO!! YOU CAN'T THRIVE ON LOCATION ALONE! The carpet in our room was stained and dirty, and remained that way our entire stay. The breakfast staff (what there was of it) seemed grumpy and bothered, not one smiling face in the whole bunch. I would NOT recommend this hotel to anyone, there are other hotels in the vicinity, I will research those next time we go to Rome, we will NOT be returning to this hotel.", "Date": "June 10, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "encinitas, CA", "Title": "“Customer service is non-existent, rooms vary depending upon type”", "Author": "RideStrong", "ReviewID": "UR31405226", "Content": "I had the occassion to stay at the Grand Palatino on 2 different occassions in May. I spend 6 months out of the year staying in hotels so I have a good base to judge. The customer service at the front desk was non-existent. There is no warm italian hospitality but rather a front desk staff with a serious attitude problem. They appeared very bothered if you asked them a question and even fought with me about several small items. I booked 2 different room types and they are vastly different. The executive rooms are on the top floor and they are very nice with turn down service, bathrobes and chocolates on your pillow. There is still car noise from the street but not too bad given the quality of the room. The standard rooms don't look so good and the new style rooms are nice but some are on the first floor literally on the street (no turn down service, no bathrobes) but the double paned windows are nice. As much as I liked the executive level rooms I don't think it's worth it given how unaccomodating the staff are. OH, beware, 8 euro for wireless internet access! Yikes.", "Date": "June 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Sebastopol, California", "Title": "“Near the Coloseum”", "Author": "5Kimba5", "ReviewID": "UR31226342", "Content": "Stayed at this hotel for 3 nights in April, 2009. Within walking distance to St. Peters in Chains church, Coloseum, Forum & Capital building. Had dinner one night at the hotel - very good pork roast. Had a room on the street side of the hotel. Since it was only April, the air conditioning was not yet turned on and it was quite warm, so we opened our windows to cool the room off. The street below was VERY noisy with the window open. Small refrigerator in the room. Comfortable beds, plenty of pillows & towels. No ice machine, so you had to get a small bucket of ice from the bar below. Be sure to insert your room key into the small box on the wall when you walk in - this ensures that the electricity will operate in the room. Would recommend da Robertino's restaurant within walking distance to the hotel - they did not have an English menu at the time, but the waitress spoke English and was very helpful with our selections - try the Roman artichokes! We sat outside in a semi enclosed area which was very pleasant and all of the ladies receive a rose at the end of dinner. Be sure to go up on the roof at sunset, you can get a nice view of the capitol building.", "Date": "May 31, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "manassas, va", "Title": "“great location”", "Author": "hedgehog831", "ReviewID": "UR29264050", "Content": "Nice hotel with a great location in Rome---walking distance to metro, Colosseum and Forum. Breakfast nothing special but had lots of options. Do not eat at the restaurant next door; overpriced with mediocre food. There was an excellent family run restaurant on the street behind the hotel, just adjacent to the metro entrance with reasonable prices. The house wine was delicious and only 1 euro! I would definately stay here again if I return to Rome.", "Date": "May 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "South Carolina", "Title": "“Location, Location, Location - and a very nice hotel too!”", "Author": "Missionlady03", "ReviewID": "UR29167245", "Content": "My husband and I decided to plan a trip to Rome and do it \"on our on\". We didn't want to be locked into a tour group so I researched hotels on Trip Advisor and in the Frommer Day by Day books. I discovered this hotel on the trip advisor website. I knew I wanted something that was close to the Colosseum because that was one of the main attractions that I wanted to see. This hotel is a five minute walk to the Colosseum and is in a great overall location. We walked to pretty much everything from here except the Vatican but we did end up walking back From the Vatican. Believe me we walked the entire city except the area near the Spanish Steps as the last 2 days of our trip were to be spent there at a different hotel. The hotel itself was quite nice. I had booked a stand room with a double bed on the hotel website but I had put in a special request for a complimentary upgrade if possible because we were celebrating our 20 year anniversary. The hotel arranged our transport from the airport to the hotel. When we arrived our room was not ready but after waiting maybe 15 minutes the desk clerk said he was upgrading us to a Junior Suite. This was really nice. It had an amazing bathroom and the room itself was quite large with a king size bed, table and chairs, lounging sofa, tv, safe. Our room came with a breakfast daily. They had two breakfast areas. One was for tour bus patons and the other was for people who had booked on their own. The food was actually quite good and there were many selections. There were the typical deli type meats and cheeses, scrambled eggs, bacon (that was a little too limp for my taste) numerous pastries, yogurt, juices, coffee. The staff in the breakfast area were a little snobby some days but we just overlooked that and didn't have a problem. They always supplied you with whatever you requested. We are a very good breakfast and then either no lunch or split a small sandwich for lunch and would have a nice supper. I would definitely recommend this hotel and would stay here again if I came back to the area.", "Date": "May 2, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Illinois", "Title": "“Great Location...Not So Great Staff”", "Author": "budesela", "ReviewID": "UR28579397", "Content": "BEWARE!!! This hotel looks AMAZING on its website-Beautiful pictures with updated rooms. This is what you see on the first floor! When you stay on the 3rd/4th/5th floor, like we did, what you get is a room that is a small, old, and in desperate need of a good cleaning and some paint. I was willing at first to overlook the “no frills” accommodations when I saw how close we were to all the sights. Yes, it’s very close to the metro. And yes, it’s very close to the forums and the Colosseum. But the room was a DUMP! Our room was missing necessities on a daily basis and when requested we had to wait hours to get them. Overall, the staff was rude and not very accommodating. They often seemed as if they didn’t want to be bothered. Feel free to stay at this hotel as it is close to the major sights, but be warned, this hotel is not as it appears!", "Date": "April 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Kent", "Title": "“Great Hotel & Great Location”", "Author": "lee1966", "ReviewID": "UR28345283", "Content": "We have just returned from a lovely 4 day stay at the Hotel and would definitely recommend it for anyone wishing to have a romantic stay in central Rome. It is only 5 minutes walk from the Central train Station. It is so close to the key places of interest, we only used a taxi once when visiting Vatican. Our room was obviously newly refurbished, spotlessly clean, with a large comfortable bed, crisp white linen sheets, flat screen TV mini bar & safe. The bathroom had double sinks and was finished in stone and marble, there were even large white fluffy bath robes and slippers. (Note like many Italian hotels there is an ironing service as there are no irons in the room) The Hotel has a real Cocktail/Piano Bar and a top class restaurant. The wine list is good and has a great selection of Italian Wines at very reasonable prices. Eating in the restaurant was a delight! The staff were always smiling and very attentive. The breakfast is served from 06:30 to 10:00 includes fruit, pastries, continental, cereal and eggs and bacon. The Hotel Staff were extremely professional, all Italians and all speaking a variety of languages including excellent English. There had great local knowledge and nothing seemed too much trouble to sort out. Hotel guests were a mix of Italians, Business Travellers and a few English Tourists. All in all this is very professionally run 4 Star Hotel with great staff, a wonderful restaurant and bar. We are going to return with friends next time. So pick this Hotel for being in central Rome. Spend your days wondering around the sights until your feet hurt. Then return to the hotel relax in with a Cocktail and eat in the resteraunt for a prefect trip.", "Date": "April 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "cheshire", "Title": "“great value - would stay again”", "Author": "tescoqueen", "ReviewID": "UR28078983", "Content": "stayed with my sister for 2 nights in Jan 2009. The price we paid was very good and I thought this hotel was great value. It is a good 4 star in a great location. The staff are good, breakfast was nice, room was small but very comfortable. great stay.", "Date": "April 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "wisconsin", "Title": "“Good find”", "Author": "pgbWisconsin", "ReviewID": "UR27775764", "Content": "Perfect location central location. Check in was easy--staff spoke English well. Rooms were clean and very roomy. Great firm beds. Breakfast was very good. Staff very helpful. Location was about 8-10 blocks from train station but we jumped the Metro to get to the hotel. Metro station close and a good way to get around Rome.", "Date": "April 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Great Sight-Seeing Base near the Ancient Ruins”", "Author": "jackosan", "ReviewID": "UR25298754", "Content": "We just spent 4 nights at the Grand Palatino over Valentine's Day weekend and were very impressed with the location and the quality of the lodging for the money we spent (around $150 USD per night for a top-floor executive room with a king bed and full buffet breakfast, including taxes and fees). As for the room, I'll mostly leave you to the attached pictures to judge for yourself, but it was well-maintained with some upgrades like a plasma-screen TV with satellite reception, a balcony (with a view of the Roman Forum in the distance), in-room safe (large enough to hold my laptop), bathrobes, and a nice assortment of toiletries. Housekeeping was meticulous. It would be considered a solid 3-3.5-star hotel in the US. Breakfast was a fairly extensive hot/cold buffet breakfast spread: Bacon, eggs, yogurt, fruit, a variety of baked goods, Italian hams, sausages and cheeses, and more. Cappucino and espresso are available upon request, quite enough to carry you through to dinner with a mid-afternoon snack. The hotel makes a terrific sightseeing base. The main Roman ruins are just minutes away by foot and most of historic Rome is within 20-30 minutes' walk. The hotel is right next to the Cavour Metro stop. This facilitates train travel to/from the airports, as well as many areas within and outside the city that can be reached on the Metro lines. The hotel, however, is a little far afield from some of the historical center where the Metro does not run (but its certainly still walkable). The restaurant choices nearby, while competent, are limited. On the whole, the desk staff speaks passable hotel English, but don’t expect an extended conversation. If you want to know how to get to specific places, they’ll try to sell you a tour. Overall, a smile, and an attempt to use whatever Italian (or other Romance language) you can muster, will be warmly received and reciprocated with a patient effort to help you. (Remember, Americans, you are the foreigner here!) The hotel is popular with tour groups (and for good reason). Elevators/common areas can be crowded around group arrival/departure times. Groups eat in a separate room that we ate in one morning because the other room was full. Both had the same food selection, although the service was generally better in the smaller room. A few practical suggestions – If you don’t have a lot of luggage, take the local train from the airport to Rome’s Ostiense train station (only 5.5 EUR.) Transfer there, via moving walkways to the Piramide Metro station. Take the Blue Line three stops toward Termini to Cavour (1 EUR). Walk up the steps to the main street above, turn right and walk about 100 meters. You’ll get there just as fast as the express train (perhaps faster since the local train tends to run more frequently), and save 5.5 EUR. Buy a day pass for 4 EUR, good for all-day riding on all public transportation. Take a Metro to a good starting point (perhaps the Spanish Steps) and then wander around, hopping on and off the Metro/Buses as you and your feet please. Be aware that there are separate entrances on o the Cavour station, depending on which direction you are traveling. Taxis become very expensive, very quickly, but they do know where they are going. You might not, even with a map. At the wine/cheese/pizza store down the street by the bank machine, tell the guy what you want to spend on a bottle of wine and trust his selection. Some real winners in the under 15 EUR category!", "Date": "February 27, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Provence", "Title": "“Noisy and too far from any good restaurants”", "Author": "Adam B", "ReviewID": "UR25175741", "Content": "I did not get a good feeling about this hotel from the moment we arrived. On an extremely busy street and very noisy. The staff always seemed to know best and tended to be either pushy or not there. We waited for nearly 30 minutes for a barperson to appear to serve us drinks on lunch time. Our room was quite large though could not be described as luxurious. The bathroom was directly connected to the one next door via the extractor so ABSOLUTELY every sound could be heard. The room was airless but because it overlooked the busy street there was no chance of an open window. I bought earplugs after the first night. Breakfast was a complete mad-house with various items scattered around the room cold meats at one end hot dishes somewhere else. The juices were very poor quality and the rolls were not fresh every morning. A dinner served to the group was just awful. Rissoto and pasta dumped on the same plate and then a piece of very tough veal large enough to feed a family of 8 serevd with massively greasy potatoes. We were only offered the house wine and when we insisted on the wine list discovered that the same wine by the bottle was 10 euros cheaper. The most unfortunate incident occurred when we asked reseption to recommend a good restaurant and book us a taxi. They gave us the name of the restaurant but not the address. They failed to provide the taxi driver with this so we ended up being dumped in the right general area of Rome but Many many metres away from the address. After a further 10euro taxi ride we eventually arrived at what we thought was going to be a good establishment serving Roman food. It was small scruffy and Sardinian. When we returned to the hotel we were met with insincere apologies. There were no decent eating places near the hotel and after a futile search the next night we returned to the hotels much advertised restaurant. It was completely lacking customers, atmosphere or correct service. Great flourishing of silver domed plates did nothing to hide the inferior cooking and presentation. Slimy described both food and service", "Date": "February 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Utica NY", "Title": "“Excellent location! Beautiful inside.”", "Author": "RubinandOskar", "ReviewID": "UR25139010", "Content": "I loved this hotel, it was very spacious and clean. The location was perfect with many places to eat, shop and sighsee just steps away. I would reccomend this hotel to anyone traveling to Rome we had a great stay!", "Date": "February 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Washington DC", "Title": "“Perfect Location, Nice Breakfst, Helpful Staff”", "Author": "ChattiPatti", "ReviewID": "UR24348094", "Content": "I spent six nights at the Hotel Palatino and loved the hotel. My room was spacious and comfortable with a cozy chair. The breakfast each morning was lovely-polenta with sausage, eggs, bacon, hard rolls, cornettas, juice, fruit and freshly sliced salami and proscutti. Coffee and hot milk on the table.Cappacinos on request. Location was perfect- about a block or two from the Colessum. Internet cafe across the street with Bruno playing 70's music! But skip his gelato and head behind the hotel to Ciuri Ciuri. 2 Euro for Doppa Blu!!! And the cannoli are freshly stuffed. Wander the alleyways and find La Taverna dei Fori Imperiali for the chef's special. Gnocchi in gorgonzola -yum. Also Wanted down the block for pasta bags of pear/walnut or great fettucine. Front desk is patient and helpful. I tried my guidebook Italian and they unfailingly helped me first improve my pronunication and then answered any question. St. Peter's in Chains is across the street and up a steep stair-check hours before you climb!", "Date": "February 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gravelines, France", "Title": "“Great location”", "Author": "GodisGoood", "ReviewID": "UR23030606", "Content": "For Rome this hotel was excellent for the price. we booked a triple room and it was great. the beds were comfy after a long days walk in rome. there is a bus stop just out of the hotel. there is a supermarket across the stree. there is a metro stop 2min away. 5min walk to the colosseum. if your in rome to see sights all day then i would book this hotel. we were on the top floor on the side where we faced the busy street. with the windows closed it did not bother us. however in the summer when you would want the windows open i would request a room in advance on the other side of the hotel as i could see it might be pretty noisy. the breakfast was great. there are plently of places to eat near by. there is a internet/ice cream shop across from the hotel as well. the staff was excellent. this hotel is really underpriced for rome. i wish it was higher in the rankings for people to pick this hotel. we looked hours before we booked and we so happy with this hotel. we used hotels.com and paid 91-119euros per night.", "Date": "December 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Buffalo, New York", "Title": "“Great Location”", "Author": "LE3693", "ReviewID": "UR20204742", "Content": "Very happy with our stay. Fantastic location. It's the first train stop from Termini station. Hotel was one block from metro stop. Hotel was above average; not sure I would give it four stars, but we were very comfortable in our room. $198 usd per night included taxes and full (and decent) breakfast. My two teenage kids and and I stayed in a tripple (three twin beds). Air conditioning worked great - very hot in Italy in August. When we left the hotel and walked two blocks, we could see the Coliseum to our left (a few blocks away). The hotel's streeet (Via Cavour) ends at the foot of all of Ancient Rome (probably three or four blocks from the hotel). Walked everywhere . . . to St. Peter's Square (probably 1 mile) to Trevi Fountain to Spanish Steps (probably 1 mile as well). If you want to stay in the heart of Italy at a fabulously located and comfortable hotel, stay at the Grand Hotel Palatino.", "Date": "September 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Northamptonshire, England", "Title": "“Wonderful hotel and fab location”", "Author": "YummyTwinMummy", "ReviewID": "UR19718492", "Content": "My 10 year old daughter and I took my mother to Rome for her 65th birthday and stayed for 4 days. We booked a city break through Travelocity and chose the Grand Hotel Palatino after reading the reviews on here. We were not disappointed in the slightest and had a fabulous hotel stay. We checked in around 11.30am and were immediately shown to our room. We had booked a triple Classic room and were very impressed. The room was of above average size for European hotels and the bathroom was very clean but just a bit rough around the edges. The air conditioning in the room worked extremely well and helped cope to with horrid temperatures outside. The room was tidied daily and even had our beds turned down in the evenings. The hotel staff were wonderful in helping find places to dine as well as the easiest routes to the sights of Rome. We had a buffet breakfast included in our package and the food was plentiful and quite yummy. It was replenished often and something for everyone. The apricot filled croissants were to die for. It was an amazing trip and I would definitely stay there again. There was outside scaffolding on the building when we arrived and I was rather worried but we never heard a sound in our room (Room 212).", "Date": "September 3, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Check in / front desk": "1", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Great location, pity about the hotel staff ......”", "Author": "TajjUK", "ReviewID": "UR19395116", "Content": "This hotel is on Via Cavour in central Rome. Its location is just so ideal. Just 5 minutes walk away is the Colosseum, Roman Forum, Palatino, Termini station (Rome's main train station), and the Via Imperioli which has numerous sites to see. The Church of San Giovanni is not so far away either. You can also walk to Piazza Navona, Trevi Fountain and the Spanish Steps, which are about 25 mins away, and on the way there, you get to see other sites and the life in the city. The hotel is clean. The breakfast is fine. Scrambled eggs, croissants, buns, tea, coffee, slices of bread, cornflakes, fruits and juices. But the staff and concierge are unhelpful and unco-operative. They dont seem too pleased to help when you ask them a question. I asked about the tourbus which stops outside the hotel. The staff member looked down at his desk as I asked him and he just brushed me off by saying \"I dont know\" with an unpleasant look on his face ! I asked another staff member about local restaurants and he also shrugged his shoulders without saying a word ! The breakfast area is split in two - I dont know why this was. On our first day there, I went into one room to get some bread. On the next day, a member of staff created a bit of a scene by speaking loudly that I should not be in the other breakfast area, even though others were. Embarassing. Ive stayed at many hotels around the world and Ive been treated with courtesy and the staff there were always keen to help. But the people running the Grand Palatino were absolutely useless.", "Date": "August 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Whistler, Canada", "Title": "“Good value for location and quality”", "Author": "mojohomer", "ReviewID": "UR19326403", "Content": "I stay at this hotel when I have to make quick stopovers in Rome and don't want to spend too much, Florence Hotel Group hotels offer good value but lacks in quality. Front desk service and friendliness is average, I booked a Deluxe room on the top floor, it came with a nice balcony and a nice view (depend on which side of the top floor you stay you may not get a balcony with a view). The location is just minutes away from Roman Forum, Palantine Hill, Coloseo and the train station, but it's far from the main shopping area.", "Date": "August 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Athens", "Title": "“Beautiful Junior Suite”", "Author": "ChloeAthens", "ReviewID": "UR19071147", "Content": "The Palatino Grand Hotel, is situated about 500 metres from the Colosseum. The junior suite we stayed in, looked like it belonged to a different hotel. It was very big and beautifully decorated. It had 2 flat screen TVs, a large marble bathroom, a walk in closet and was spotlessly clean. (Maybe they have only renovated the junior suites and are in the process of renovating the rest, as it looked nothing like the traveller photos on trip advisor). The staff was indifferent, and you were pretty much on your own. Breakfast was bellow average, and they served instant coffee, which they poured for you from fancy coffee pots.", "Date": "August 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "dxb", "Title": "“Great location”", "Author": "visitorDxb", "ReviewID": "UR18982769", "Content": "I stayed there for 2 days along with my family. Excellent check in staff, very helpful. adequate breakfast. located very close to the colleseum and the ruins. You can take the guided tour from the Hotel to Vatican and St Peters Basillica. across the street , the indian restaurant is an excellent choice for vegeterian food", "Date": "August 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "london", "Title": "“Okay for a few days”", "Author": "londoner888", "ReviewID": "UR18730070", "Content": "The hotel is close to the colloseum, the trains and metro stations are within walking distance. However, I would not give this hotel a 4 star rating. The staff are friendly and polite but their eagerness to not knock on doors to get in and clean our room is too much. I was woken up everyday by a cleaner marching in my room despite showing a 'do not disturb' sign. The breakfast definately was a major let down, same old food such as hard bread rolls, tinned fruit, ham and cheese. The hotel room does not have a kettle- so anyone wishing to boil water bring your own travel kettle. Complimentary water is not available either- despite the hot weather and supposedly a 4 star status. Make sure you buy water/drinks in the supermarkets whenever you get a chance its 80% cheaper! However, anyone wanting to buy souvenirs, its so much cheaper to buy it at the shops next to the hotel, everywhere else will charge you ridiculous prices. Also anyone wanting to visit the major sites- buy a Roma pass from the information point near the colloseum, its £20 Euro's and you can enter 2 major sites and discounts off others, plus 3 days travel card- best bargain throughout the whole trip- we skipped the 2 hour long queue going into the colloseum with this pass. Overall, Rome was lovely but expensive and the hotel is in an excellent location for a few nights only!", "Date": "August 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Really Liked the Palatino”", "Author": "gir7375", "ReviewID": "UR17815874", "Content": "We stayed here for 4 nights and found the location to be ideal. Very close to the Coloseum and the Palatine Hill ruins. Also, we like the proximity of the Metro station which, we used frequently during our stay. The rooms were large and clean, good air conditioning. They seem to need a bit of an update but I liked the style overall. Breakfast was fine but not a great selection compared to some of the other hotels on our trip but still better than the standard Continental European style. Reception was very nice and we found the area to have some really nice restaurants. I would recomend this hotel for those traveling by rail and who like to focus on Ancient Rome since there are so many ruins in the area within walking distance", "Date": "July 12, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "2", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Guernsey, United Kingdom", "Title": "“When in Rome...”", "Author": "clairelybelgian", "ReviewID": "UR17278691", "Content": "We chose this hotel for it's location- it is situated on a main road that connects Termini Station with the Colloseum. It is probably a 5-10 min walk from the hotel to the Colloseum and the Roman Forum, which is a plus with all the walking that you do in Rome! It is about 15 mins from Termini, where the train from the airport comes in, so it's an easy transfer. If you're not a keen walker, which given the way that the Romans drive is understandable, the hop on/off sightseeing bus stops directly oustide the hotel, every hour or so I think. It is a great way to see the architectural features of the buildings and take good pictures of the ruins, it stops at all the useful tourist spots you could want. On to the rooms, they are fairly standard and non descript in that general hotel way, but are very clean, as are the bathrooms. We had a room overlooking the Via Cavour, which is noisy if you open the window as you would expect from a main street in Rome, they won't drive quietly! The room had adequate air conditioning, which I thought would be a good feature for Rome in late summer. The staff on the front desk were a little grumpy, but I had the impression that most people in Rome were feeling a little grumpy that week, perhaps because it was at the end of summer and they were getting sick of tourists or something. Food- We did not eat in the hotel restaurant and chose to eat down the Via Cavour towards the coloseum, the restaurants are very good, though not all staff speak english so have that phrasebook handy! They are a little touristy but the quality is still very good. Do not eat in the restaurant right next door to the hotel, it is terrible!! I am sure that they microwaved my lasagne, which in Italy should be a crime. There is a fab pizza place on a little back street near the basilica Santa Maria Maggiore that our guidebook, one of the eyewitness jobbies, recommended, it actually had some very good restaurants in. I would also recommend the smaller restaurant in the Exedra hotel on the Piazza della Republica, the food was superb and the manager was only too happy to give us a crash course on Italian wines and recommended a wonderful barolo to compliment our brilliant food. It is a tad pricey there though.", "Date": "June 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“An above average hotel with ideal location”", "Author": "Montreal_Canadiens", "ReviewID": "UR17158792", "Content": "We stayed at this hotel in early June 2008. It is an above average hotel. Our room was clean and quiet (on the roof) but small by american standards (but fine by European standards). Our room had a LCD TV with access to english channels. Staff was friendly, courteous and helpful. We were given an upgrade on arrival to an executive room on the 8th floor. The greatest asset of this hotel is its location and comfort. In my opinion, you can't find a better location to visit Rome's attractions minus the Vatican which is a little far. The coliseum and the Forum are 5 minutes walk. Pantheon, most fountains and Plazas are accessible by walk. Beds are comfortable and air conditioning is working fine. We have not been bother by any noises from the streets below nor from neighboring rooms. You also have access to a safe. There are many restaurants near the hotel. You may also find useful to know that the subway station Cavour is 4 minutes walk from the hotel (on the little street behind the hotel). From this station you have access to all of major attractions in the city. This being said, walking is the best way to get acquainted with the city's attractions if physical conditions permit to walk few hours, of course. My assessment of this hotel would have been higher with a better breakfast and free internet. You get eggs, bacon, bread cereals, yogurt and croissant, fruit salad and juices. Not extensive choice but ok to give a good start to your day. Also, I find the prices overrated compare to other hotels I have stayed on other trips (in other countries). However, for Rome, this hotel is fairly priced. I would stay there again without hesitation.", "Date": "June 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Jose, California", "Title": "“Loved the location”", "Author": "bnzlvr", "ReviewID": "UR16954832", "Content": "We had a very nice time at the Palatino in Rome. Because there was a mix up with our room the first night, they arranged alternate accommodations for us that night, upgraded us for the remainder of our stay, and treated us to a free dinner in their restaurant. Our upgraded room was on the top floor of the hotel, and featured french doors leading to a small balcony. We were delighted with it, though we found the mattress and pillows hard and the sheets a bit rough. The room was impeccably clean and the bathroom was large (by European standards) and elegant, with both a rainfall and a hand-held shower, marble tile, dual sinks, lighted makeup mirror, terry robes and slippers, etc.. There are two dining rooms: one for tour groups and the other for individuals. The breakfast buffet served to individual travelers was excellent. There was a large variety of food - something for every taste. The location of the hotel is fantastic. It was amazing to be able to saunter two blocks to the ruins of the coliseum and Constantine's arch anytime we had a few free minutes, and to see the ruins of a Roman forum every day! The hotel seems to cater to large tour groups, so be prepared for crowds in the lobby at times. It would be nice if they had somebody available 24/7 to help with wifi problems; I prepaid 10 euros/hour and was unable to access the internet..", "Date": "June 16, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "charleston sc", "Title": "“Great experience”", "Author": "chasnative", "ReviewID": "UR15394519", "Content": "We stayed at the Palatino for three nights in mid-April. It was a wonderful experience. Upon check, they immediately upgraded us to a full suite. It was enormous. Large sitting area with desk, loveseat, chair, ottoman and flat screen TV. Bedroom was also huge with King sized bed, 3 chairs, a little table and another flat screened TV. Bathroom was gorgeous. Dual sinks, huge tub, and a nice separate shower (one of the few problems we had was that the showr soaked the floor no matter which direction we tried to direct the shower head) The breakfast was nice. Eggs, bacon, 2 types of cereal, several breads and jams, a selection of meats and chesses, and several juices or coffees to choose from. Although we tried to ask very little of the staff, any requests were dealt with quickly and politely. The location is excellent. It is an easy walk to ancient Rome and the train station. The Trevi Fountain is a bit further, but a very pleasant walk. For us, the Vatican was an easy (and cheap) Metro ride but then we wandered back to the hotel on foot. There are several bars and restaurants nearby. We enjoyed Cavour 313. The wine shop down the street is close and quite good. The post office is right there as is an ATM machine. We had no real complaints and would certainly stay here again. The only slight negatives we found were that the pillows were a bit hard and the breakfst room got very busy sometimes.", "Date": "April 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington State", "Title": "“Awesome”", "Author": "fish2008", "ReviewID": "UR15086740", "Content": "The hotel was beautiful, the location perfect, and the staff friendly. My husband and I had a great experience. The neighborhood also felt safe at night and we had no problem using the metro system right next to the hotel. We were walking distance from ancient Rome and absolutely loved it!!", "Date": "April 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Studio City, Ca", "Title": "“Loved the Palatino”", "Author": "mrsgeorgie", "ReviewID": "UR14897633", "Content": "Palatino Grand Hotel is lovely. Service was fabulous.. breakfast was very good the rooms was quite large (we stayed here two times in a three week period). The first time we were in a basic room on the 6th floor..it was nice.. good size bed, bathroom etc.. the second time we stayed in room 160 (a corner junior suite) 2 showers..and one tub..two sinks..very large room. My husband and I loved it. The location is fabulous..and if you get sick of Italian food (hahah) try the Indian place across the street..it is very good.", "Date": "April 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wheaton, MD", "Title": "“Loved this Hotel”", "Author": "melson3", "ReviewID": "UR14819742", "Content": "We stayed 4 nights at Grand Palatino in late March 2008 and loved it. We were very lucky--we were given 2 rooms on the top (8th floor). Each room had its own balcony; each faced the back of the hotel, with views of the rest of the city, including St. Peter's dome and the Victor Emmanuel monument in the distance. They had just finished the renovations, so perhaps that is how we had the good luck to get these rooms. We were in room 802, which is actually a suite, and has 2 balconies. Each room (our kids were at the opposite end of the floor in room 812) was reasonably large; ours had 2 flat screen tvs; both had minibars and safes (use them!!!!!--I had my wallet stolen on a bus). The beds were incredibly comfortable, and each room comes with slippers and bathrobes. Tons of towels; 2 showers in our room (one as part of a giant bathtub); turn-down service at night (one night they seemed to forget; maybe because it was Sunday and they have fewer staff.) The hotel location is very convenient--it is about a 10-12 minute (not 5!) walk from the Colosseum, but easy. It's barely 75 yards from the nearest metro stop, which itself is only 1 stop from the Stazioni Termini. It's also barely 2 minutes up steps across the street from the church San Pietro in Vincoli--which has the Michelangelo statue of Moses inside it (no charge to enter). This is one of the most impressive statues you will ever see, in my opinion. Metro: We reached the Vatican stop (which requires transferring) in less than 20 minutes by metro from the stop near the hotel. It's an easy c. 15 minute walk to the Piazza Venezia and c. 20-25 minutes to the Trevi Fountain (go at night!). The hotel breakfast buffet was quite large and satsifying; service was a bit indifferent; you can order any version of coffee you wish (also, tea, etc.). Staff at the front desk were generally helpful to very helpful; certainly did not encounter anyone who was rude or unhelpful. They were very good about letting us leave our luggage in a secure room after arriving at c. 11 am. All in all, this one of the best hotels we have ever stayed at; if you can get a room with a view (rear, not street), it's hard to believe you will regret staying here. We got our rooms as part of a travel package, so I don't know what they cost if purchased a la carte.", "Date": "April 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "N.Ireland", "Title": "“Surpassed our expectations!”", "Author": "Lor45", "ReviewID": "UR13354587", "Content": "I had arranged this trip to Rome to celebrate my best friends 50th birthday. On the 1st February we said goodbye to kids, husbands, housework and cooking and set of for an adventure in Rome. I saw reviews for this hotel on Tripadvisor and most seemed very positive, so I booked it. On arriving at the hotel we found we had been allocated a really spacious room with twin beds and a separate sofa. The decor was fine and everything was very clean. Beds were comfortable and next morning we went down for breakfast and where very impressed with the variety on offer. Breakfast sustained us right through the day and we only had coffee and a pastry in the afternoon. Via Cavour is so central with metro stations on the corner and Colosseum and Forum at the bottom of the road!! The sightseeing tour bus stopped right outside the hotel and we did this on Saturday morning and it was brilliant! There are lots of restaurants in and around the hotel. We enjoyed meals in a Chinese, Indian, Italian, and Argentinian restaurant all on or just of the Via Cavour. The quality and price was excellent and we really enjoyed all our meals ( The most we paid was 50 Euros and that was for starters, main courses a bottle of wine and a bottle of water!) We found the hotel staff very helpful and polite. When I visit Rome again (I will definitely go back) I won't be searching around for a different hotel, I will be booking the hotel Palatino. If you are looking for a clean, comfortable and central hotel in Rome, book this one! Lorraine and Val. Ballyclare. Northern Ireland.", "Date": "February 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Great Location”", "Author": "oilfriedghost", "ReviewID": "UR13181970", "Content": "The location is fantastic. A few minutes from the Via Cavour metro station and you're off to anywhere in Rome. Literally a stone throw away from the Colosseum, and a few minutes walk to the Roman Forum. We had the complimentary breakfast every morning which was buffet style; scrambled eggs, croissants, juice, bacon, sausage, etc... The staff was friendly and always pleasant. Will stay there again.", "Date": "February 1, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rochester, NY", "Title": "“Close to main sights”", "Author": "Utahparkslover", "ReviewID": "UR12157978", "Content": "I stayed at the Grand Hotel Palatino as part of a tour group. The room was clean and comfortable and the breakfast buffet was more than plentiful. It is only a 5 minute walk to the Colosseum and a few minutes farther to the other main sights (Roman Forum, Trajan's Markets, Campidoglio, Monument to Victor Emmanuel, etc.) and the steps leading to the Basilica of St. Peter in Chains are right across the street. I will definitely stay here again.", "Date": "December 31, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Rubbish”", "Author": "manxboy", "ReviewID": "UR11896093", "Content": "Well - the 8th floor is being renovated, so be expected to be woken up at 0730 by the sound of power tools and general hammering. Upon checking out the staff on duty were rude, surly and generally apathetic. Pretty much as they were upon checking in. They couldn't care less. Breakfast - Adequate, staff very nice. Room - Okay. Avoid and be treated sympathetically and respectfully elsehwere.", "Date": "December 22, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great location”", "Author": "Venturer88", "ReviewID": "UR11049703", "Content": "Just spent the Thanksgiving week in Rome and my wife and I stayed at the Hotel Palatino. Located along Via Cavour, the Palatino has a great location, within walking distance of the Colosseum; the Forum, Palatine Hill, 2 of the 4 major Roman Catholic basilicas, trattorias, bars and alumentaris (grocery stores). They have a great breakfast buffet, which is a perfect way to start our daily walking ventures in the city. The only thing that marred our stay was the seeming indifference of the hotel staff when they are asked to address simple, valid requests. Like when we asked that our room thermostat be fixed (the room was unbearably hot and the request was ignored) or the time when we asked for change for a 10 Euro bill (the request was ignored because they claimed they had no loose change, although it was clear in full view that they had a lot available). Also, they do not want to be inconvenienced by guests in any way- so be mindful if the staff is on the phone making personal calls, they do not want to be interrupted.", "Date": "November 25, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Good Location, good breakfast”", "Author": "tn1933", "ReviewID": "UR10650419", "Content": "HI, Searched high and low for a good hotel in Rome. we paid abot $1000 for 4 nights a Thursday - Monday. Hotel was good, clean, excellent breakfast, far enough from train station, close to colleseum. Hotel staff's english was not so good, and when we asked for some basic tourist questions they were not so helpful but overal experience was good. Rooms are standard size for european hotels.", "Date": "November 6, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cambridge, England", "Title": "“Lived up to its reviews”", "Author": "FenTraveller68", "ReviewID": "UR10064803", "Content": "This hotel is in a great location just up the street from the Forum and Colosseum. The hotel lived up to its very good reviews and I would thoroughly recommend it. There are a number of good reasonably priced restaurants to the rear, we particularly liked 'Wanted', and there are a some good shops on Via Cavour that sell portions of pizza for lunch. Top tip - visit the Palatine before the colosseum - the ticket covers entry to both attractions and the queues at the former are a fraction of those at the latter. Just make sure you join the entry queue at the colosseum (keep to the left) and not the ticket queue (on the right side)!", "Date": "October 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Devizes, United Kingdom", "Title": "“Highly recommended”", "Author": "Su-Mart", "ReviewID": "UR8851347", "Content": "This hotel exceeded my expectations. Booked on line a few days before we went. Good porterage, pleasant & helpful reception staff on reception who offered immediate advise on what to do that evening (unknown to us we'd arrived on 'white night'), public areas clean & very attractive. Had a superior room on back of hotel which was so spacious (advise you book a standard double & upgrade on arrival if not happy with that). King bed very, very comfortable, room clean, fridge cold, tea & coffee in room. Bathroom was the surprise as I'd read so many poor reviews & my partner is a big guy so I was worried that it would be small but it was huge with proper shower in large cubicle with bath on the other side within an inset - with another two (yes two) showers over it! Hotel was right in the heart of it all within Roma - did the hop on hop off bus tour thing which we booked at the Termini. Shops are very nearby so you can buy drinks to chill in your fridge for when you get back after a busy day out & about. Our room was on the back but I reckon that the insulation is such that a front facing room would not suffer noise or light intrusion. Air con. very effective & controllable. Negatives: Breakfast wasn't great by UK/US standards but acceptable & varied", "Date": "September 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Wouldn't stay anywhere else in Rome!”", "Author": "travel255", "ReviewID": "UR8521186", "Content": "My wife and I initially stayed at this hotel in 2005, and were very pleased with the accommodation, cleanliness, service and location. This year, celebrating our 10th wedding anniversary, we decided to visit Paris and then Rome, staying at the Palatino. We booked directly with the hotel and the staff were very helpful. As to the hotel itself, our experience was even better this time. In particular, the hotel has greatly improved its buffet breakfast and provides a very large, good quality selection. The Palatino is also ideally located, being really within walking distance of all of the main sites. This is great in the evening, as 5 minutes takes you to the Forum, Coliseum and Capatolino, while a little further and you at the Trevi, Pantheon and Spanish Steps. The area around the hotel also seems very safe at night, unlike some of the streets nearer to Termini. There are also a large number of cheap but very good eateries all around the hotel. In short, we love Rome and we'll definitely go back soon. We would never stay anywhere else but this hotel. Great hotel - great staff - great location!", "Date": "August 28, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bay Area, CA", "Title": "“Good hotel!”", "Author": "cb333", "ReviewID": "UR8517886", "Content": "We stayed here in Aug for 4 days. rooms were newly renovated. We had a junior suite (room 158) and it was a perfect stay. Rooms are spanking new, bright, roomy, cool A/C, awesome showers. breakfast included in the stays too! Staffs are ok, not the most friendly person but they get the job done. location is prime, 10 min walk to colosuem, 3 min walk to metro (via cavour). we would 100% certain we'll stay here again the next time we visit room.", "Date": "August 27, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Great hotel & location with just a couple gotchas to watch for”", "Author": "hatlad", "ReviewID": "UR8372179", "Content": "OK... first the goods: Location is wonderful for walking to most anything - especially the Coliseum and Forum which are a mere block away or so. Michelangelo's \"Moses\" is just a stair climb across the street in the Basillica of St Peter in Chains. If mass transit is your thing, the Metro station is just up the street half a block & down 1 flight of stairs. A block or 2 up the way is the train station too. If cabbing is in your budget, you can zip anywhere in central Rome in minutes (we did taxi to Hard Rock Cafe & was 8 Euro for 2 passengers & there in mere minutes). Also, the neighborhood around the hotel is safe and there's a great local Roman place just behind the hotel & up from the Metro station (Suburra's) which is great food, plentiful and quite affordable and quaint. And almost right next door towards the Forum is another great little place that's only slightly more expensive. (I can't comment about the hotel restaurant as unfortunately we never had time or convenience to use it.) There's also in-lobby internet available with a credit card at 3 Euro/hour. If that doesn't work for you there are several internet cafe's scattered just around the hotel. Room was clean, comfortable & as quiet as being on a major street in a big city would allow, so no problems there. Maid service was excellent, minibar was well-stocked and there were in-room safes for valuables while you're away. Now the bads: No hot water seemed to be the rule almost the entire 4 night stay (think we had hot water once (at 4 AM our last morning). However, others on our tour did not experience this problem so could've just been a thing with our room. In-room internet was worthless & THE most complicated procedure involving the TV remote, a remote keyboard and menus on the TV. We tried first night & after started accruing charges, couldn't make the keyboard work. The front desk said they would send someone up to look at it and after an hour of waiting we gave up & asked they canceled the charges. They didn't immediately do so & it took some negotiating, but they eventually did cancel the charges. Also, watch out for using the in-room phone for phone card calls; you'll still get a hotel line charge for your \"free\" phone card call. But, other than those 2 things, this hotel was just fine. Their free breakfast \"buffet\" was probably THE best such we experienced between 3 major cities in Italy. We would stay here again, quite likely.", "Date": "August 8, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Northampton", "Title": "“Decent hotel but on the expensive side”", "Author": "helenc4410", "ReviewID": "UR8363474", "Content": "The Hotel was very pleasant, with nice rooms (if a bit on the small side). The location is wonderful, and within a few minutes walking distance of some of the most famous attractions in the world (probably explains the expense). Staff were friendly and courteous.", "Date": "August 6, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "leeds", "Title": "“Lovley Central Hotel”", "Author": "vez_7", "ReviewID": "UR8081478", "Content": "Lovely hotel within 10mins walk of romestermini(station) and within easy walking distance of romes colusseum and other attractions.fabulous self service breakfast.rooms all aircon,and beauifully furnished. the staff were very friendly and helpful,and the rooms mini bar wasnt too exspensive. We booked the hotel 4days before we travelled and therefore got it at a dicounted rate which made it even better. My only concern was the Baileys! It might have come out of a baileys bottle but it was definatley not the real thing.That said would i recommend this hotel and go back again?definatley.", "Date": "July 9, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Ontario, Canada", "Title": "“Good location, fluffly towels”", "Author": "Peggysuz", "ReviewID": "UR7711766", "Content": "Just a few blocks from the Coliseum, this hotel's location would be the major attraction. When I checked in I had to firmly insist that the room I was assigned be non-smoking as requested. A bit of trouble with a sticky shower control level was remedied quickly when I phoned the desk for assistance. Unfortunately, on each of the 3 days I spent at the hotel, my room key needed to be reset upon returning after my day's activities. As a guest staying on her own, I was offered cappuccino with my breakfast. The buffet was quite adequate. Once my status changed to being a member of a tour group this disappeared. Another tour couple that ate in the hotel dining room exclaimed that it was the finest dinners they had eaten in a hotel restaurant.", "Date": "May 29, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Surrey UK", "Title": "“Near the Colliseum but that's as good as it gets.”", "Author": "Maxine37", "ReviewID": "UR7683800", "Content": "I am unsure how to start this review as I do not wish to appear too negative, however.... Firstly - we drove into Rome city centre after hiring a car from Ciampino airport ( wow, big mistake, the Italian drivers show little courtesy to other road users be they motorists or pedestrians and to be truthful, they show little road sense at all.) Of course, we thought we knew how bad the driving would be but we were wrong, it was far worse, common courtesy and etiquette appear to an unknown quantity to the commonal Italian driver! So, by the time we found the Hotel Palatino (thank goodness for GPS) we pulled up reassured that we would at least be able to park the car, they advertise garage space after all. But no, we were wrong, in fact the garage was full that day and they gave instructions for a garage elsewhere (again, thank goodness for GPS) that might have spaces. After much hooting and swearing, we found the garage which did have a space but for the cost of 25 euro for 24 hours - we were desperate by this time and grabbed the space. Armed with suitcases and hand luggage we trekked the 10 minutes to the hotel a little flustered but it was ok, we were on holiday after all. The reception staff seemed reasonably friendly although I got the distinct impression they were not actually that happy to see us. Our room reminded me very much of a UK Traveldoge room - certainly clean and sparse but without the luxury of tea/coffee making facilities which would be expected as standard in Travelodge. The Colliseum is certainly nearby and yes, we enjoyed our evening sightseeing - Rome was not the focal point for this trip but a starting point for my 40th birthday trip to climb Mount Vesuvius. Friday morning we awoke for breakfast and were ready to further explore Rome before leaving that afternoon. Off we headed to the breakfast room only to be met by a waiter who made us feel distinctly uncomfortable ( after thanking him for bringing a pot of tea to the table he said \"don't thank me, I am only able to feed myself and my family because of visitors to the hotel - I should thank you\".) Within seconds of this statement, as I went to collect a bread roll and jam for breakfast, he further accosted me to tell me that although he wasnt the 'big boss' only the 'little boss' would I please mind not wearing my Birkenstocks into breakfast the next day but more appropriate footwear? I was seething (did he not know how much Birkenstocks cost) and this pretentiousness and idiocy made me snarl at him that there would be no way I would be at breakfast the next morning. An Italian sitting alongside me smiled at me sympathetically as if to say he didn't mind at all if I wore my Birkenstocks to breakfast but the damage was done, we got up and packed pretty quick smart - of course, the waiter had no idea we'd left as he'd already accosted a group of French tourists by then! We headed to Sorrento which was much improved and our hotel was lovely. Neither myself nor my husband are the 'city type' and we are not pretentious at all, we are perfectly happy to accept absolutely any footwear to breakfast at 8.30am, so perhaps we were wrong to book this hotel. Regardless, I would not recommend it as we did not have a happy stay here.", "Date": "May 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Perfect hotel for a long weekend”", "Author": "LillieUk", "ReviewID": "UR7231665", "Content": "We booked this hotel based on reviews on tripadvisor and were not disappointed so wanted to write the reivew so others can benefit from this great find! The Palatino Grand Hotel is in the perfect loction, very safe, a 2 minute walk from the tube which is a one stop connection to the Termini Station, or a ten minute walk direct to the main Termini Station where you can get the tube to any of the attractions. It's also a couple of blocks away from the Colosseum - a very central hotel. You can pretty much walk to all the popular attractions and we only travelled by tube twice in our 4 day stay - we definately burnt off the calories consumed eating all the fabulous food Rome has to offer (the Pizza's are to die for!) The Hotel itself is a very nice 4star, the rooms are clean and well equipped, the hotel staff are very friendly and willing to help. The breakfast is fairly standard, fruit, pastries, cereal, tea, coffee, juice etc. If you get the chance try one of the coffees in the hotel bar... we finished off every day of walking and sightseeing with an Irish Coffee in the bar! If we went back to Rome I would definately stay at this hotel and would recommend it. Overall we had a brilliant 4 day break however a few tips that may make your trip easier: If flying with Alitalia make sure you eat before you travel... their plane food is the most disgsting I have ever had (and I've travelled with a lot of different airlines). I thought as Alitalia was the National Airline of Italy, I was expecting more, it's fine, and functional but nothing more than a budget airline. The second tip is be prepared to queue and do some research on what days you want to visit different attractions. The queue for the Vatican Museum on a Monday (it's worse at the weekends) was over two hours long. If your budget can stretch to it, go with a tour as you can queue jump and on the two tours that we did (Colosseum and Vatican Museum) the tour guides really knew their stuff and made the experience much more enjoyable. The third tip is try and book a taxi direct with your travel booker from the Airport to your hotel in Rome. We paid when we booked the trip and after hearing all the stories about being ripped off by the taxi drivers at the airport it was nice to have someone collect you (plus it worked out much cheaper). We also got the train back to the airport from the Termini station, it goes every half hour is very safe and clean and only costs 11 euro per person, it takes 30 minutes door to door! The last tip is for the ladies... 95% of the streets in Rome are cobbled so don't even bother taking your heels! Despite all the reviews saying that the Romas dress up to the nines, we only saw a handful of glamorous looking women and that was in the shopping district. All the tourist attractions are populated by tourists - jeans, jumpers and backpacks were the norm. Lastly, have a fab trip, Rome is amazing!", "Date": "March 27, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New Jersey", "Title": "“Comfortable stay...”", "Author": "NickNewJersey", "ReviewID": "UR6840946", "Content": "Hotel lived up to its expectation. Not 5-star but nevertheless, very comfortable stay and close (by Metro or bus) to all sites. Good and inexpensive restaurant (La Vecchia) behind hotel. Ask front desk to make a reservation. They were turning people away at 8:30pm on a Wed night. Typical Roman fare. Travel by bus around city is very easy - just pick up a map from a tabacco store. Definately visit Trastevere for dinner. Plenty of restaurants with locals. Overall, hotel stay was very confortable. Do ask for a room on the high floors. New Jersey, USA", "Date": "February 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Great location”", "Author": "Whystlar", "ReviewID": "UR6813109", "Content": "Just back from 3 lovely days at this hotel. Rooms are pleasant and comfortable, we had an executive double with a balcony and views in the distance of the Forum. Close to the Metro which takes you throughout the city and only a couple of hundred yards from the Colosseum and walking distance to many other famous sites. Good food at the restaurant and pleasing atmosphere, staff polite and pleasant at all times. For a short break to the ''Eternal City'' this is a fine choice", "Date": "February 19, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "uk", "Title": "“excellent location”", "Author": "jack63", "ReviewID": "UR6785557", "Content": "just came back last week from 4 fabulous days in rome! the hotel is within walking distance of the colisseum in fact if you go out the hotel turn right go to the first set of lights and look across to your left the collisseum is there infront of you.WOW the room in the hotel was nice nothing very fancy but ample for a few days massive bed, bathroom was fine,shower a bit small but its only for a few days so it does'nt matter, the sheets were changed daily and everything was SPOTLESS . the breakfast wasnt up to much the usual continental stuff cold meats etc- went to the VATICAN and that was the icing on the cake,saw the Pope on sunday went back monday and would've gone back tuesday except we were going home and had to visit the colosseum before we went back! took a tour well worth it --you get to know so much more from the guides WELL WORTH the money the weather was unbelievable for february warm sunshine in the shade still cold. WHAT TO WEAR just make sure you have comfy walking shoes we walked everywhere even to the vatican once we found our feet it was lovely just stop every now and then for a coffee or a beer beware of the prices very expensive! I think if you're going to rome in the winter months all you need is a couple ofpairs of jeans and polonecks a nice coat ,hat,gloves and dont forget the essentialSUNGLASSES. i like to dress up at night bit it just was'nt that kind of place maybe in the summer but not in the winter months we really enjoyed our stay would definatly recommend the hotel as everything is so near -all the main sights AIRPORT TRANSFERS we got the terrorvision bus direct from the airport to the termini station it was only about £10 each return . the bus runs in connection with easyjet so if the flight is delayed the bus will wait for you and they tell you what time to get picked up for your flight home-- i found this an excellent service as we were prepared to get a private transfer for about £60 return. the hotel is about a 10-15 minute walk from the station, its a straight road all the way down just keep walking its on the right hand side of VIA CAVOUR anyone will tell you. you think the hotel is far from the station but thats ok cos you dont need to be near the station everything is down the bottom end of the hotel so its a great base for exploring HOPE THIS HELPED YOU CIAO", "Date": "February 13, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Chicago, IL", "Title": "“What you see is not what you get”", "Author": "Chicago7", "ReviewID": "UR6642928", "Content": "We booked this hotel based on other reviews from the trip advisor and the photos posted by the hotel. Well, the looks can be deceiving. The lobby area is very nice, tasteful decor. However, once you pass the lobby and go up to your room, the décor deteriorates drastically. The rooms have post war shabbiness about them. The carpet in the rooms and the hallways is stained and peeling. The hallway walls are scratched up. The bathroom is so tiny that when you seat on a toilet you touch BD with your legs. Needless to say those bathrooms two are in a dire need of upgrade. Everything smells unsanitary. The room furniture was in a very poor condition, with cracks and breaks in a wood. If you have every been unfortunate to stay in a Motel 6, then you will experience an unpleasant Deja-Vu. In other words, steer away. They lure you in with pretty website pictures and nice lobby and you end up in a very dirty, shabby room.", "Date": "January 22, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "London", "Title": "“Hotel OK, location not great”", "Author": "LondonLondoner", "ReviewID": "UR6611537", "Content": "First the good news: the location is handy for the Colosseum and the metro. But sadly the two things you *don't* need in Rome are to be close to the Colosseum or close to the metro: for a start you'll probably only visit the Colosseum once, and the metro doesn't go anywhere visitors want to go (it's not easy to dig tunnels under the Roman city). And the location downside is that half the rooms look out over one of Rome's busiest roads. If you like sleeping either keep the windows shut and sweat (no aircon in January) or try to sleep through the sound of a thousand Vespas. The bedrooms are clean but they don't look to have been refurbished in recent years. Hair dryer fell apart. Downstairs the foyer and bar are usually empty, except when occupied by swarms of bewildered tour-bus victims. Breakfast is OK but not in the league of the international chains. This place describes itself as a business hotel so if you can get a good price it's a reliable choice. No local character though, and not a particularly pleasant part of town, unless you're interested in traffic.", "Date": "January 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "istanbul", "Title": "“Nice Hotel”", "Author": "xoTR", "ReviewID": "UR6597485", "Content": "İts in the center of the city 2 minutes walk to metro 5 mınutes walk to Colosseum İts clean İts a little noisy after 9 A.M ( its under contraction but not at night ) very nice crew excellent breakfast couldnt connect wifi hehe (my problem) WC is not small as others say its secure and really enjoyed to be next to Colosseum For Türkish people I say \" Süper \"", "Date": "January 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "lancashire", "Title": "“Great Hotel very near Coliseum”", "Author": "blueken", "ReviewID": "UR6572619", "Content": "We have just returned from this hotel and it was great. very central and they upgraded our room foc to the 8th floor (809), very quiet lovely balcony and kingsize bed and enormous modern bathroom. the food was lovely and the staff where very helpful, especially Nino, very honest too, my husband left his (very expensive) chain and medals in the room after we checked out and the maid rang down to catch us before we left.Would highly recommend the hotel.", "Date": "January 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great Location, Friendly staff, Brilliant Breakfast”", "Author": "lyana", "ReviewID": "UR6564157", "Content": "We stayed here from 18 Dec - 21 Dec 2006 for a family trip. Based on this website, I think this hotel is great in location and give good value. So, decided to try it although it is slightly underrated. We were absolutely right & happy with our decision LOCATION The location is the main feature to this hotel It is just 5 mins walk to Rome Forum, Rome Palatino and Viazza Venezia. 10 mins walk to Colloseum, Via Del Corso (shopping district) 20 mins walk to Trevi Fountain, Piazza Navonna and The Pantheon The only 2 place that need to take the buses or Metro is the Vatican City and the Spanish Step! We really enjoy walking in Rome as everything is very near and very easy to get to There are lots of restaurants and cafes in surrounding area, we tried 2 of the italian restaurants and it was good. The indian restaurant right in front of the hotel is fantastic as well! served fantastic Beriani. Lots of groceries shop and souvenir shop. No need to buy souvenir elsewhere - its cheaper in this area!!! ROOM Book 3 standard classic room and we were given 3 neighbouring room with 2 connecting room which is just fantastic. We booked through the hotel website which offers fantastic price - £98 per nite per room which is very good value. The room is quite big in size and there is even a round coffee table with 2 chairs for sitting and relaxing. The tv has lots of channels in italian and 3 english channels which is BBC, CNN & MTV and I think there's 1 english movie channel (haven't had time to watched it!) BREAKFAST The breakfast was included in the package and it is fantastic! There are scramble eggs, poached eggs, smoked salmon, brilliant choice of pastries, breads, cereals, fruits, juices, cheeses and the choice of any hot drinks that you want - either its cappucino or Latte! STAFF The staff there were brilliant! Very friendly, always there to help you and there is 1 staff that worth the mention - his name is Roberto. He is great! Very very nice, warmth, he's like a friend -help us around in getting to the attraction places and in letting us know which bus to take and everything. So next time you were in the hotel - find Roberto! DISLIKE The only thing that we didn't like about the hotel is the old, plain design of the classic bathroom. I think this need to change - although they have another room called 'designer room' which is very immaculate in design but I think for classic room - the bathroom need to be at least modern & new. Another thing is the noise, room facing the main road will hear some noise from the traffic outside although it will reduce towards the end of the nite. But if your room facing the back road, then noises will not be a problem We think this hotel has been underrated and based on our research on all the hotels in Rome - I think this hotel should be ranked AT LEAST at the 20th place!!!", "Date": "January 8, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "new york", "Title": "“Great Location”", "Author": "shal227", "ReviewID": "UR6491186", "Content": "Spent 5 nights here and found it to be very comfortable and location is great. We walked all over Rome from here. Restaurants on street behind hotel are plain but good. Elite grocery is across the street and to the right. Much cheaper for water, soda and snacks than mini bar. Cafe on corner to the right has gelato and big cappacinos. Would return anytime.", "Date": "December 24, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "East Sussex", "Title": "“Great Location”", "Author": "Hollette", "ReviewID": "UR6453310", "Content": "This hotel is a good 3*, very clean, nice decor, nice breakfast, fantastic location very close to the Termini (15mins walk) and Colleseum (5mins walk). Also close to several nice tavernas and cafe bars - in which to soak up the Roman atmosphere. I would have no qualms returning or recommending the hotel. Only down point is very minor - only english channels available were CNN & MTV - but who goes to Rome to watch TV?! December was a great time to visit - the weather is much milder than the UK, it actually hit 20 degrees celecius when we were there. The crowds are far less than at more popular times - but it is still wise to get to attractions on the early side as there are still queues. Also be wary of Dec 8th which is a bank holiday for them and the Vatican closes all day. However everything else appeared to be open. In my mind we could not have chosen a better hotel for our 3 nights.", "Date": "December 17, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC", "Title": "“Great place for tourists to stay”", "Author": "Scodlin", "ReviewID": "UR6309910", "Content": "We arrived at the Hotel palatino and were pleasantly surprised. LOCATION The best aspect of the hotel is its location. It is in the heart of anciet Rome just a few blocks from the Roman Forum and the Colossium. Less than a block away is a metro station and Rome's (grand central) Termini is less than a mile away. CCOMFORTABLE The hotel lobby, room and bathroom were quite comfortable. The standard of hotel is comparable to Hyatt in the USA with nicely appointed rooms. The bath was adequate with a full tub, large granite sink countertop and a bidet in addition to the toilet. Housekeeping was well done. Large, decent, fresh smelling, clean towels being provided daily. The sheets were crisp and clean and pleasant smelling. The maids were kind and accommadating. Toiletries were replenished daily. BREAKFAST Breakfast was laid out buffet style from 6:30 am to 10:00am. It was expanded contentental fare. On the menu were fruits such as canned peached, pears, prunes and fresh apple, grapes and like fare. There were a variety of baked goods including croissants, muffins, breads and an array of condiments. As for meats, there was smoked salmon, ham, bacon and the Italian style pork and beef. Fresh juices, coffee and tea rounded out the lot. The breakfast was surely adequate to get any vacationer up and running for the day. it was pleatiful in variety and volume of items. SERVICE I found the hotel staff to be pleasant. The front desk attendants were all fluent in English and were helpful to us in giving directions, making restaurant selections and reservations. AVOID Try to arrange transportation to and from the airport at reduced rates in the USA. We needed to be at the airport at 6:00am for our return flight to the USA. The hotel's \"car service\" turned out to be limousine service for which we spent 65 Euros with tip. We paid 12 Euros transportation from the Airport to the hotel so this was alot to spend on airport transportation.", "Date": "November 30, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "NJ", "Title": "“Great Location in Rome”", "Author": "ChuckB~NJ", "ReviewID": "UR6171425", "Content": "Just got back from a week in Rome. Grand Hotel Palatino was very nice. Front Desk staff was helpful and friendly. They offered restuarants that were nice and reasonably priced and assisted with getting around the city. Rooms were nice but not overly decorated. Hotel safe was free but small. When you sleep with the window open you did hear street noise but that is to be expected. Closed the noise was better. Beware of the Metro.. Had wallet stolen from my front pocket. People push uncontrollably on the subway and low and behold, your wallet will be gone. Reported it to the police and others were there with the same problem. Tour guide said it happens to her about three times a year. It usually is the Gypsies or South Americans that take your wallet. In Rome there are a lot of beggers. These are not Italians they are the Eastern Europeans and usually Gypsies. They are really annoying. Overall we had a great time. If you have any questions, please let me know..", "Date": "November 24, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yorkshire, UK", "Title": "“Great base for a city break”", "Author": "grey.dave", "ReviewID": "UR6081023", "Content": "We walked in off the street to check this place as an alternative to the unsatisfactory apartment we had intended to stay in. We were agreeably surprised by the rate (Euro 150 per room incl breakfast), delighted by the rooms, and moved straight in. We had one of the upgraded rooms, almost a mini-suite, and it was superb. Beautifully cleaned, very quiet, all the amenities. Breakfast was fine and varied. The hotel had put independent travellers in a separate room from the tour groups, which was a blessing. Location is superb. Colosseum, Forum, St Pietri in Vincoli all in easy walk. Metro station very close by, buses galore, and the main Termini rail station only 15 minutes away. Overall this was a great base for a week in Rome, and would be very hard to beat at the rate we paid.", "Date": "November 7, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Morehead City, North Carolina", "Title": "“Great Location!”", "Author": "mkennedy38", "ReviewID": "UR5799717", "Content": "We stayed 3 nights in Mar. Our stay was completed without incident. The front desk is VERY busy but the staff was polite once you got your turn. The lobby was small and congested. The restaurant was delicious, classy and the buffet breakfast was good also. The rooms are tidy, clean, and well supplied. However the hotel in general was hot. The AC in the room needed some attention. We had to sleep with the window open. Which was a minus because Via Cavour is a very busy street. The location was great. It was in easy walking distance to many of the piazzas, the Forum, Colosseum, and Metro.", "Date": "September 14, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "nj", "Title": "“A week at the Palatino”", "Author": "paddyr", "ReviewID": "UR5515196", "Content": "My family and i spent a week at this hotel. We found the staff to be be helpful, the breakfasts palatable, anf the rooms adequate. The location is excellant for walking to the Coliseum and the Forum. We walked to the Pantheon, Trevi fountain, and Spanish Steps and took the metro back to Cavour. The Vatican is a bit of a hike..2 miles. The Elite supermarket is up the street...good for wine, beer , cheese, delicatessen etc. Irish pub literally behind the hotel..good for local info....bar staff from Northern Ireland. Decent restaurants in area...best one we found was La Mella D'Ora ( the Golden Apple) about a 10 minute walk left out of the hotel. If you want to focus on Ancient Rome, then this is a very good location. The local area has a pharmacy, post office, internet cafe, numerous restaurants, dollar(Euro) store. We found the Hotel to be better than what many of the previous posters/reviewers had led me to believe.", "Date": "July 26, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Naperville, Illinois", "Title": "“Huge disappointment”", "Author": "shakergrandma", "ReviewID": "UR5513190", "Content": "Hotel Palentino was an outdated hotel and a huge disappointment. It was near the Coliseum, which is not a very good neighborhood. The rooms were very dirty, and had big stains on the carpeting and chairs. I am convinced that one in the corner was a urine stain. The bed was 2 junior beds pushed together and called a king. I am only 5’4” and my feet touched the end of the bed! My husband is 6’3” so you can imagine how difficult it was for him to sleep. When we asked for another room, we were told that there was nothing available. We were spending a week at this hotel (because a of a business convention) so my husband was pretty demanding, we were finally given a better room with a regular sized bed and no stains! We will never, ever stay at this hotel again, we feel that we were mistreated and found other much nicer hotels near the Spanish Steps. Beware!!!!.", "Date": "July 26, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Big, bold and brassy”", "Author": "globalnomad79", "ReviewID": "UR5419016", "Content": "This was a typical large-scale hotel catering to hordes of tourist groups (you will surely meet them during breakfast). We got a pretty decent deal (paying 150 Euros for a triple room). The room was very spacious (compared to say, a room in Paris) and the bathroom was huge. It was very clean as well. Breakfast was decent. The location was excellent as it's situated in the heart of the ancient center of Rome, just a short walk away from the Coliseum (Colosseo) and the Imperial Forums. It's also not too far from Termini Train Station. If you manage to get a good deal, do stay here otherwise if you're gonna pay a bomb, you're better off staying in other fancier places with much more character and class.", "Date": "July 3, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "2", "Service": "2", "Rooms": "3"}, "AuthorLocation": "avon, ct", "Title": "“Good location but”", "Author": "leop", "ReviewID": "UR5374657", "Content": "My wife and I stayed at this hotel in may as part of a Colette Vacation tour....so we did not have any choice about the hotel since it was selected as part of the tour....as everyone else has stated, the location is very good, about two blocks for the colosseum, and two blocks from the forum...it is on a main street but our room was in the back and quiet...the rooms are very ordinary, apparently they have not updated them for at least 20 years. but the room was very clean....the bath was adequate but on the second day there was no water from 5:00 PM until midnight...now, maybe that was because everyone on our tour, all 50 of us, decided to take showers before supper...but this is a tourist hotel and they should be set up to accommodate this kind of thing...we were not the only tour group there at the time, there was at least one other group.....the staff is not very friendly or helpful so don't expect much there....the breakfast was very typical, and located in a fairly large room that is set up for tour groups....there is a fairly nice bar at the hotel and nicely appointed lounge chairs in the lobby area..... In looking at earlier reviews, a restaurant behind the hotel, Roma, was mentioned as a good place to go, so we went there but we were disappointed, I would not go back there...down the street towards the forum, there were a few restaurants that looked like they might have been a better choice..overall, I would not spend serious money to stay here but if you can get a deal, it is in a very good location if you want to see some of the old rome attractions.", "Date": "June 22, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Dallas, Texas", "Title": "“Great Location, but Not Worth 4 Stars”", "Author": "hemingfan", "ReviewID": "UR5368831", "Content": "What makes this hotel \"grand\"? The location. It's two and a half blocks from the Colosseum and the Roman Forum. There are a number of nice little cafes within 5 minutes' walking distance, a coffee shop a few doors down, and a market 50 yards away. St. Peter in Chains is right across the street. The breakfast buffet was extensive and tasty. On the other hand, the dinners at the hotel were mediocre, the staff was not overly friendly, and the fuse in our bedroom kept blowing. I wish I had a dollar for each time I had to reset the breaker. Would I stay there again? Probably, but only because of the location.", "Date": "June 20, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "San Francisco, CA", "Title": "“Close to Coloseum, Roman Forum and metro”", "Author": "sophiehew", "ReviewID": "UR5076378", "Content": "Hotel room and toilet is quite roomy considerating you are in Rome. Breakfast was slightly dissappointed since you have to pay extra 15 Euro to get hot breakfast (egg, meat, etc). Location is excellent. Walking distance to Coloseum, Roman Forum, shops, internet and metro station. Be sure to check out Coloseum at night. It just beautiful. There is a chuch across the hotel where Michelangelo's Moses sculpture and the chain of St. Peter is located. For food, check out the chinese restaurant. There are couple in the area. They usually have good selection of food and reasonably price if you tired of pasta, pizza and sandwiches. Prawn and fried rice are usually pretty good. Also try the gelato down the street where they sell Illy coffee. That's one of the best gelato we have in Rome. If you going to see the Pope on Sunday noon, do hold on to your wallet. The place is packed and its full of gypsie kids who will try to get your $$. One guy in our trip caught the kid where 1 in front try to distract him and the other tried to pickpocket from behind. Another man wasn't so lucky, he got pickpocket on the bus. If you like cats, be sure to check out the Cats Santuary in Torre Argentina ruins. The cats there are just so friendly and relax. Most of them love to napped under the tree, others were sun bathing. Its amazing to see so many cats in the same place. The santuary also takes in handicapped cats, its something I've never seen. I heard there is another cat colony in Coloseum.", "Date": "May 15, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "New York, NY", "Title": "“An Average Hotel”", "Author": "nycurbangirl", "ReviewID": "UR5033862", "Content": "This hotel was an average experience overall. The hotel overall - was OK- the rooms were comfortable and the location was good. However, for the price I paid (about $350 per night) I found this hotel to be extremely overrated and not worth the money. There was nothing special about the rooms, they are average. The location is pretty good - 10 minute walk to the forum and colosseum; other sights are a 15 minute walk away. The subway station is close by as well. The major problem we had was that the AC did not work in our room, and the hotel preferred to \"fix rather than give us a new room.\" It was only after we insisted on a new room that it was given to us. The hotel staff was not helpful through this process and one person at the desk rudely asked us \"why are you here?\". The staff was also not very knowledgeable about sights and information and we were given incorrect information a few times. I would not stay here again.", "Date": "May 4, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "NYC, New Yrok", "Title": "“The Grand Palatino Hotel - Good Choice”", "Author": "A TripAdvisor Member", "ReviewID": "UR5025999", "Content": "I just returned from a week-long trip to Rome and stayed at the Grand Palatino Hotel. It is at a great location, located down the block from the Metro station (via Cavour) and one stop away from the main Termini station, which is walkable, but not suggested with luggage. The Colosseum, Forum and Palatine Hill is only about 10 minutes away. There is also a bus stop a few steps away, but not sure what bus # stops there. The rooms are kept clean with hairdryer, safe, refrigerator and usual amenities of shampoos, soaps, shoe polisher, etc, which are re-stocked daily. We had a triple bed room which was very comfortable. The hotel is however on a very busy street, so do expect traffic noise when the windows are open, especially if your room is facing the front and if you are there over a weekend. Lots of restaurants closeby (behind on the small streets). They do serve a good daily breakfast spread (scrambled eggs, bacon, sliced coldcuts, smoked salmon, croissants, danishs, bread, cereals, fruit, etc). The front desk is cordial, but I did not find them especially friendly or helpful when we inquired about specific tourist sites and asked for help in making reservations to museums. There is a grocery store (Elite) across the street and another smaller convenience store down the block where we bought water and soda for reasonable prices. However, I do suggest that you make sure what they charge you at the cash register is correct against the shelf prices. We did almost get charged double when we bought only 2 items! There is internet service available in the individual rooms, but I believe usage needs to be set-up with the front desk so that the charges can be recorded. There are also 2 computers in the lounge on the lobby level, and you can access the internet using a credit card. In summary, all-in-all, I would definitely recommend this hotel.", "Date": "May 1, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Edmonton, Alberta", "Title": "“Great Hotel!”", "Author": "travellingwithtwo", "ReviewID": "UR4972675", "Content": "My husband and I stayed at the Grand Palatino for our belated honeymoon at the end of March. Our room number was 813, the 8th and top floor. We had the executive suite which was only 10 euros extra per night. Our King sized bed had comfortable, firm mattresses. We had a beautiful balcony with automatic shutters that faced via de Cavour. The shutters greatly reduced the sound from the streets. Our room and bathroom didn't feel cramped at all and was very clean. They supplied us with lots of toiletries, slippers and robes. The room also had a closet, safe, chairs and table, bathtub, and bidet. A large breakfast buffet was included every morning. The dining room was bright, clean and well decorated. Breakfast included bacon, eggs, breads, cereals, yoghurt, cold cuts, cheese, and drinks. Of course, the food is best and freshest if you don't wait until the end. Also, this menu was served everyday, so we were quite tired of it by Day 4. The staff in the dining room did not speak English, nor the maids, but anyone behind the concierge and check-in counter spoke very well. The downfalls: 1) We were fortunate that the weather was very beautiful when we were there at the end of March. It was quite warm which also made the room a little too hot for sleeping at night. I had no problems sleeping, but my husband requires cooler temperatures. With the terrace doors open to the balcony, a nice flow of air cooled down the room, BUT via de Cavour is a very, very busy and noisy street at any hour. It was impossible to sleep with the constant honking and roaring of cars, motorcycles and scooters. Plus our air conditioning unit did not work. We complained on the 2nd to last day, which was probably too late. They claimed to have looked at it while we were out, but it was not fixed. 2) A very minor thing: the shower is only meant for short people! The shower hose is attached to the bathtub nozzle. If fully extended to accommodate people over 6 feet tall (like my husband) or even 5'5 (like myself) then the hose bends and the water cannot go through. Either take a bath, or hold on to the shower head, using it like a spray. Otherwise, we were very happy with this hotel. As other people have mentioned, the location is excellent! It's about two blocks away from the Colosseum, Palantine Hill and Forums and the subway is just around the corner. We tried the subway once at 8am to get to the Vatican. It was so packed, everyone was pushing their way onto the train. I don't recommend it, at least not at that hour. Plus, by the time we got to the Vatican, it was already a 45min line-up waiting for us. We managed to walk everywhere, although tiring, well-worth it.", "Date": "April 14, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Stony Brook, New York", "Title": "“Location, Location, LOCATION!!!!”", "Author": "dolphin80", "ReviewID": "UR4964340", "Content": "Three words to describe this hotel: LOCATION, LOCATION, LOCATION! We stayed here for a week from 29 March to 05 April 2006. It could not have been more perfect. You’re within a stone’s throw of the Coliseum, the Forum, and Palatine Hill. You’re on Cavour Street, which has every amenity you would ever need. Cavour Street is a very busy street, but the Grand Hotel Palatino offers refuge from the hustle & bustle of Rome. There is a very clean lobby and attentive staff. My wife and I arrived at 12pm expecting to be told our room wouldn’t be ready (based on prior reviews). To our surprise, our room was ready and located on the 7th floor facing the rear of the hotel. (Much quieter than facing Cavour St. – make this request if possible) The room was smallish compared to U.S. standards, but who cares? All we were looking for was a comfortable room in which to sleep, shower, & change. We had comfortable beds with extra blankets if needed. The bathroom, although a bit on the small side, was just fine. We had decent water pressure with hot water all the time. As for TV, it is free, but your channel choices are limited, with the only english channel being CNN International. You’re not in Rome to watch TV though!! There’s a myriad of establishments on the small side streets around and especially behind the hotel. Immediately in the hotel’s vicinity, you have Café Borghia, which is immediately to the right as you exit the hotel. They have an extremely friendly staff and delicious food & desserts. If you exit the hotel, turn right, and then turn right again down the steps, you’ll find an Irish pub on the left and the Ragna’ De Oro restaurant directly in front. At the bottom of the steps, if you head left, you’ll eventually come to a great restaurant called “La Vecchia Roma.” (Old Rome). It’s filled with locals and nobody speaks english. However, I’ve never had a better plate of carbonara in my life. If you’re looking for some awesome Gelato, exit the hotel, turn right and head down to via Serpenti. Make a right on Via Serpenti, cross the street and pass the church on your left. About 50 yards on your right, you’ll find the cheapest Gelato place in town. Cheap does not mean tasteless either. This was by far the best Gelato we had, and we tried them all, believe me! They will give you an excellent map of Rome when you check into the hotel. This map is about as accurate as they come. It covers every street in Rome where many of the book maps do not. Fold this map up and keep it in your pocket. You can find anything with this map. Even though the hotel is a stone’s throw from the Cavour Metro stop, we never used the metro, took a bus, or used a taxi. If you’re able bodied, you should be walking to all the MUST SEE spots. Via Veneto (Harry’s Bar, Hard Rock, U.S. Embassy) is a 20 minute walk. Trevi Fountain is a 15 minute walk. The Pantheon is a 20 minute walk. Spanish Steps are a 25 minute walk. Castel St. Angelo is 30 minutes. Vatican is 35-40 minutes. Piazza de Popolo & Piazza Navona are all within walking distance. Campo de Fiori is the outdoor market and should not be missed. You’ll be amazed how much ground you can cover. Crossing the street can be a challenge, but if you use a crosswalk, keep your wits about you & take control, you can cross without being challenged. We booked this hotel through Gate One travel. We also booked a few excursions through Gate One that were booked through Carrani locally. The pick ups from the hotel were always 10-15 minutes earlier than scheduled. What they do is pick you up in a small bus, take you to the travel agency which is like the rally point and there you board a larger bus with everybody else. Recommended tours include the Illuminated Rome by Night tour (this helped us catch our bearings immediately), the Vatican Museum tour (does NOT include St. Peters, but you can use the afternoon to explore it), and the day trip to Florence (BEAUTIFUL drive and wonderful city). We also went on the Naples / Pompeii day trip with the main purpose of seeing Pompeii. This was great, but we could have done without the drive through downtown Naples. There really wasn’t much to see and the traffic was horrendous. Would much rather have spent those extra two hours at Pompeii. They also stop at a Cameo factory, which didn’t appeal to us at all. More wasted time at a tourist trap. If you don’t book your tours ahead of time, the hotel can do it for you with a company called Green Line. If you choose to visit a site such as the Coliseum, the Forum, Palatine Hill, the Sistine Chapel, St. Peter’s, or the Vatican Museums WITHOUT a guide, I highly recommend that you purchase a book by Fodor’s, Frommel, or Rome’s 10 Best to guide you. Otherwise, you won’t have a clue what you’re looking at. Believe me, there is a LOT to take absorb when you’re in Rome. You cannot walk 25 feet without stumbling over something of tremendous historical significance. We never asked the hotel personnel for suggestions for anything; for fear that they would just lead us to the tourist traps. You really cannot go wrong by just venturing out on your own. Using the map that the hotel provided, along with some restaurants recommended in the “Rome’s 10 Best” book, we were able to find some delicious spots. The Imperiale restaurant at the intersection of Cavour and Imperiale (go right out of the hotel) had delicious pizza. We never had a problem feeling threatened or having that uneasy, unsafe feeling. Walk like you know where you’re going, and don’t look lost & confused in crowded places. You’ll be fine. Suggest using a money belt or something hidden if you’re going to carry lots of cash. We walked around with 100 Euros on a daily basis and a credit card. Most places accept the plastic and you get the best conversion rate by using it. Tips are included, but we always kicked in a few Euros extra and it’s expected if you’re American. Breakfast at the hotel was very edible. Same setup every single day: Scrambled eggs, undercooked bacon, ham, cheese, croissants, yogurts, coffee, & juice. If you ask nicely, they will make you a cappuccino. Breakfast starts at 6:30am, and unless you want slim pickings later, you should be there between 6:30-7am. The food was good enough to give you and excellent start to your day. Feel free to email me with question. Rome was fantastic!", "Date": "April 11, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Southwick, MA", "Title": "“Location is a real plus!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4315493", "Content": "I have just returned from spending Christmas week at the Grand Palatino with my husband, sister and three adult children. We found the staff very helpful, especially when my husband had a medical emergency and needed an extra mattress on his bed. The breakfast buffet was a great way to start the day. A wonderful selection of breads, yogurts, meat, cheese, fresh fruit and smoked salmon. We never found the dining room too crowded unlike a previous reviewer who said they had to share a table some mornings. We enjoyed eating next door at the Caffe Borghia. The food was good, but we went back because of the friendliness of the waiter, Marco. The rooms were adequate and clean, although the bathroom was a little small. TV service was not free, but as we don't speak Italian, it didn't really matter. There is Internet, but a little expensive, especially as there are about 5 Internet cafes in two blocks near the hotel. The Metro was very convenient, but walking to many prominent sights was very easy, too. I would definitely return to the Grand Palatino", "Date": "January 1, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "2", "Rooms": "5"}, "AuthorLocation": "Scotland", "Title": "“Good but some gripes”", "Author": "Bigendian", "ReviewID": "UR4052118", "Content": "We booked through Expedia for two rooms adjoining for a family of 4 (two teenagers). The negative bit here was that the rooms were on the east side (151&2) first floor and we did suffer from noise due the restaurants located just below us. Perhaps higher up is less noisy but be aware of that problem. Having said that, we did pay the extra for deluxe rooms and boy were we not disappointed. The room for the kids was nice enough (great bathroom), but then we moved to our room and you got to our bedroom via the sitting room! Combine that with the kids adjoining room and you get two bedrooms and a sitting room with couch and two chairs….luxury indeed. I’d agree with the last review about the staff, or rather the reception. Yes they were very efficient but they weren’t out to win the employee of the year contest. I’m not sure whether it was because they didn’t feel they needed to make the effort or if they just liked being downright rude. Anyway, no harm done as we didn’t need to speak to them very often. Breakfast at the GHP was like all the other hotels we stayed at in Italy although I thought this was the worse with sloppy service and cold coffee, sitting at tables set for an army rather than 4 people. Location was good and some nice restaurants at the bottom of the main road. I wouldn’t bother with the ones close to the hotel as they were too expensive. If you like Chinese though, or just want a cheap meal with cheap but top brand wine, try the restaurant near to the hotel; it’s just down the street on the same side as the hotel. It was not the best Chinese I’ve had but we finished every dish and were still alive the next day! We never asked the hotel staff to recommend places to eat because individual opinions differ so much and you’re never sure if they have some deal with the local restaurants. In terms of tours, it’s pretty obvious that you’re paying top prices for things you can, in the main, do yourself. Having said that, we did succumb to a tout at the Coliseum but boy did that work out. For 8 EUR per adult (you had to pay 10 EUR per adult to get in anyway, but EC kids under 14 were free), we were literally pushed past the queues and were inside listening to the tour guide within 10 minutes. The tour was poor but at least we were inside! The only comment I’d make about the Vatican is get there early, queue up and do it yourself. There are hand held commentary devices to be hired at 6 EUR (remember to take either a passport or driving license) which do the trick and most kids/teenagers will wilt after 30 minutes! As for the hotel, we would stay there again but would ask for rooms on one of the higher floors. Price was reasonable but go that bit further and get the superior rooms", "Date": "October 25, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Devon", "Title": "“A brilliant stay”", "Author": "Nogre", "ReviewID": "UR4051186", "Content": "We had pre-booked a car from the hotel to meet us on arrival at Ciampino Airport as our arrival was late evening. It was the start of a brilliant holiday. The driver en route to the hotel took us around some major sites to see them lit up at night giving us a foretaste of our stay. A great hotel situated within easy walking distance of many sites of interest. A very helpful reception and friendly staff. A nice room, but the bathroom although small was adequate. The T.V. had only CNN news, BBC news 24 and internet facilities and films by extra payment. The film start we chose was late and we had a refund. Breakfast buffet in the Dining Room was excellent and satisfied our appetites for the rest of the day. We had dinner one night in the hotel which was great and we received first class service. The hotel was situated within walking distance of many places of interest. You need comfortable shoes however as we did not know where to put our legs and feet after a day of sightseeing. At the Colosseum we were approached by a guide company - Roman Promenades, who were very much cheaper with their tours than those offered at the hotel. These were on foot however except for the Catacombs. The guides were entertaining and very informative. By taking three of their tours to the Vatican (an early start by Metro adjoining the hotel to Ottiavano), Catacombs, Circus Maximus, Marcello Theatre, etc., and night tour to Trevi Fountain, Spanish Steps and Pantheon, there was a 10 euro reduction. Also included was a free 1 hour tour (plus) of the Palatine. If you want to see Galleria Borghese, you have to book in advance - we missed it. Also visit the Church of Saint Clemente, which is three churches in one, built one on top of the other over the centuries. It's near the Colosseum. Oppposite the hotel, up a flight of steps and round the corner is the Church which houses the Chains of St. Peter. At the rear of the hotel to the right up a hundred yards or so is another beauiful church.The National Museum of Rome is also worth a visit, free for children and pensioners. (Warning Museums are closed on Mondays).Also at the rear of the hotel down the steps and adjacent to the Cavour Metro entrance is a great Trattoria, 'Osteria della Suburra'. This will be a holiday to remember.", "Date": "October 25, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "4", "Service": "2", "Rooms": "5"}, "AuthorLocation": "Lexington, KY", "Title": "“Grand Hotel Palatino: Nice Stay - but there were some issues”", "Author": "JRS67", "ReviewID": "UR3997699", "Content": "My husband and I spend 3 nights at the Grand Hotel Palatino at the very begining of October 2005. It cost us 260 Euro per night, breakfast included. The hotel was in a pretty good location. Literally one block from the Colliseum, and 50 yards from the Metro (which can get you pretty much any where you need to go). There are other areas of Rome which are a bit nicer and have better restaurants within walking distance (try anywhere near Plaza Navona or the Trevi Fountain). But for the money, this was a very good, safe, and convenient location (also, one block from the Peter in Chains Church). The room: GREAT, if not fabulous. My husband is 6'3,\" and he found the room and the bathroom to be plenty big enough for all of his needs. We were on the 8th floor and enjoyed our very own balcony (which was also spacious) which offered breathtaking views of the city - it was magical. Also, absolutely no noise. None. Finally, we had a king - yes, king sized bed. It was heaven. I did notice that this Hotel services a TON of tour groups. They were everywhere. If you get a floor with noisy partygoers, I can see this being a problem. As it was, we did not and thus, we had no issues with the big groups. The staff: not so great. Here are my beefs - the front desk people - not friendly. Helpful, yes, when asked. But not overly friendly. They did arrange a shuttle to the Rome airport for 45 Euro - which I hear is pretty good. However, I also asked at one point for a reasonably priced restauarant suggestion. The concierge happily recommended a restaurant right behind the hotel. We went. It was atrocious. It catered to stupid Americans and overcharged us for really bad food (seriously, this place would not survive in even the most deprived areas of the US). I was pretty fuming that the hotel sent us to such an obviously bad place. He told us to tell them that Nino sent us - we should have been tipped off right there that we were being hoodwinked! Next, we asked for a tour of the vatican (as I had read in various tour books that this was the only way to avoid the maddeningly long lines - NOT SO!!). They happily obliged. The tour was operated by Green Line Tours and cost us 92 Euro. It too was atrocious. The bus arrived one hour late, we did not avoid the 90 minute line (or quere). Because they were late, the tour guide rushed us through, giving us absolutely no value for our money. We were very disappointed. The lesson that we learned from all this - do not trust any suggestions or recommendations from the front desk. It is all bad and is purely designed to take advantage of stupid naive first time overseas travelers like my husband and I. Finally, the breakfast was acceptable. Unlike our hotels in Milan and Florence, we were not offered fresh coffee or cappuccinos. However, they delivered the expected spread - meat, cheeses, cereal, yogurt, pastries, eggs and bacon. The coffee on the table was acceptable - gourmet compared to American standards! So, bottom line - we might stay at Hotel Palatino again because the room was so fabulous and the location was pretty darn convenient. However, we would avoid the staff's recommendations at all costs! We felt ripped off and taken advantage of both of the times we asked the staff for recommendations. Hope this helps. We adored Italy and know you will too!", "Date": "October 6, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Stafford, Virginia", "Title": "“Great hotel”", "Author": "stewartsgirl", "ReviewID": "UR3892888", "Content": "Just returned from Hotel Palatino and would recommend it highly. The location is excellent and we barely scratched the surface of the area surrounding the hotel. So much to see and do in just that area! I cannot say enough about Roberto. Our luggage did not arrive in Rome and Roberto called the airport twice to check for us. He always had a smile and greeting for us and ready to help us with any questions. Our room was lovely and spotless with a beautiful view. We were on the back side of the hotel and never once heard any noise. We couldn't ask for more!", "Date": "September 10, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Gloucestershire, UK", "Title": "“Excellent hotel, great location ... what else can I say?”", "Author": "RetiredFolk", "ReviewID": "UR3840338", "Content": "We have just returned from 5 days at the Grand Hotel Palatino and just have to give it 5*. The bedroom was great but the bathroom was very small for a 4* hotel and I just do not know how most Americans get to use the toilet! The location is just about perfect for access by train (Metro stop about 2 minutes, Terminii station about 12 minutes walk) and for all the sights of Rome - but then you'll know that from your research on this hotel. Reception staff were completely customer focused with nothing being too much trouble. Checkin was a breeze despite the tailend of a travel group. A couple of problems with the room (the hairdryer hose was split and a light bulb was broken) were repaired as soon as we notified reception. The rooms were very clean, the white fluffy towels were changed every day, as was all the bed linen, and the toiletries were replenished every day as well. The full breakfast was superb - including the fresh fruit and the smoked salmon - and there was always more choice than we could work our way through. Using separate dining rooms for the 'tour group scrum' (round 8 seat tables and entry level buffet food) and individually booked residents changed breakfast into an enjoyable and relaxing start to the day. The car service to the airport (€45 for 2) is much more expensive than the train (€19 for 2) but was a luxury to enjoy on our return in very hot and humid weather, even more so after all the walking we had done to see the sights! We found 3 restaurants near to the hotel which were so good (for different reasons) that we did not need to venture further despite there being many restaurants in the narrow streets behind the hotel. L'Archetto - a wine bar on Via Cavour just around the lefthand bend back towards Terminii station - served absolutely excellent food (try the traditional Italian starter...wow!) but the addition of a 15% service charge on top of the per person cover charge was a step too far which sent the bill into the (entry level) expensive class. La Vecchia Roma - classic Italian trattoria/pizzeria on Via Leonina behind the hotel and left down the street - served very good food (try the gnocci with moules and the homemade pasta ...) with very drinkable table wine (both red and white) at very reasonable prices that we can only dream about in the UK! This restaurant is very popular (no surprise) and by 20-20:30 it is full with a good chance of being turned away. The rule of the 'house' seems to be that you either do it their way or they are not interested in your custom! Go with the flow and enjoy it!! Il Ragno d'Oro - trattoria/pizzeria immediately behind the hotel on Via Leonina - good food, ok table wine and cheap! But on balance, not as good as La Vecchia Roma. Would I stay here again if I returned to Rome ..... absolutely yes.", "Date": "September 3, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Excellent hotel in an excellent location”", "Author": "joemo", "ReviewID": "UR3799642", "Content": "A much belated review of the Hotel Palatino, where I stayed with my wife and daughter for a week in July 2004. The location is ideal - short walk to the Forum and Coliseum, 50m from a metro station, and with a warren of atmospheric back streets behind it. The staff were friendly, efficient and helpful (apart from one waiter in the breakfast room whose grumpiness bordered on being comical). The room, although not large, was very clean, comfortable and well-equipped. Firm beds, decent A/C and no noise problems made for an excellent night's sleep for all of us. Breakfast was quite adequate, and served up to 10.00 a.m. At €108/night B&B for the 3 of us, it was excellent value for money, and I would not hesitate to go back again.", "Date": "August 23, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Leeds, UK", "Title": "“Remarkable Location, Good Hotel”", "Author": "PJ195714", "ReviewID": "UR3793546", "Content": "When they say its 3 minutes from the Coliseum, it is! Excellent position for all of the old town. Traditional Italian hotel, nice rooms, no problems with service, helpful staff, good breakfasts - what else do you need to know?", "Date": "August 21, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Aberdeen, Scotland", "Title": "“Perfectly Adequate”", "Author": "TwinsAunt", "ReviewID": "UR3745384", "Content": "Stayed at Grand Hotel for 4 nights with husband and 10 year old daughter. The Grand Hotel is on a fairly busy street with a few restaurants and shops -mostly souvenir type shops. There is a metro stop within 50 yards and it is about 10 minute walk to main Termini station. The hotel is extremely convenient for the Colliseum and Forum - within 2 mins of leaving hotel, you can see the Colliseum. To get to Pantheon, Piazza Navona etc probably a 20 min walk (round the pedestrian death trap that is the Piazza Venezia!). While we were there the main entrance was being refurbished. The lobby area is fine with a large bar (largely unused as far as we could see). The hotel seemed to be popular with touring parties (American mostly) and they seemed to fill the restaurant at night. Luggage from buses also filled the lobby frequently. The hotel is traditional with no great architectural features. Our room was on the 5th floor with none of the promised panoramic views over the city as promoted in the hotel literature. The room was spacious with an average sized bathroom. Bath with shower fitting over the top. Nice soft towels. Minimal drawer space for clothes. Our safe in the wardrobe was broken. Everything was very clean. Breakfast was included in our rate. It was buffet style but you had to be out of your bed on time to ensure there was anything left! Bread rolls, croissants, juice, yoghurts, fruit, bacon, scrambled eggs were available. The dining room often got busy and tables could be at a premium. You often had to share with other people as tables sat 8. Front desk staff were helpful with directions etc. The waiting staff at breakast seemed to be non-Italians and you often had to seek out cutlery, request juice machines to be topped up. All in all, a very acceptable 4 star hotel in a good location.", "Date": "August 8, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Good location, poor service”", "Author": "Markmywords", "ReviewID": "UR3742635", "Content": "The Good Location: Near to the Colosseum, Forum and the Metro. Plenty of restaurants in the back streets although none we found were particularly good. The Ok The room was of adequate size and clean. The Bad Our bathroom was small, and the bath miniscule as this doubled as a shower it was quite precarious. The reception staff were all unfriendly and did things grudgingly. Breakfast was very poor. Overall Seems to focus on the package market, personally not somewhere I would return to.", "Date": "August 7, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "5.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "New York City", "Title": "“Great Place to Stay Close to Many attactions”", "Author": "eadvisor", "ReviewID": "UR3711525", "Content": "We stayed for two nights in July. The staff is great. They speak english and are helpful. We arrived by airport and took the train to the city. We then walked about 15 mins to the Hotel. If you get there before 8:00 PM walk, otherwise spend the 7 euro for a cab. The Hotel is close to the Roman Forum (4 Blocks) and the Colosseum (8 Blocks). The breakfast is OK. There is a chinese resturant two blocks down which was good. There is also a post office one block down. I would go back to this Hotel. Have fun.", "Date": "July 28, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Fantastic hotel and excellent staff”", "Author": "A TripAdvisor Member", "ReviewID": "UR3693230", "Content": "We have just come back from a five night stay at the Grand Palatino, and I cannot find any faults with this well run and well situated hotel. We were given a family room on the 8th. floor which had the added benefit of having a small balcony with which to enjoy the warm evenings. Our bathroom was well equipped with hairdryer, marble sink and big fluffy bath robes which added a taste of luxury. The bedroom was a good size and featured T.V. internet and mini bar. On leaving the hotel the first morning we turned right then left at the first junction and were greeted with a great view of the Coleseum in the distance (approx.10min walk) Across from the hotel was a great little shop which sold cold drinks, snacks, wine and beer at competive prices. There are many restaurants within easy walking distance of the hotel and include Pizzerias. Indian, Chinese and a superb Argentinian steak house. We booked a cab via the hotel from the airport in advance at a cost of 52 euros but it was money well spent because our driver was waiting patiently outside arrivals for us while other passengers were at long queues at taxi ranks when we left.", "Date": "July 22, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Coventry U.K", "Title": "“You will not be disappointed - Above expectation - Wonderful!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3528334", "Content": "This is a wonderful, excellent hotel. I have very high standards and cannot be easily pleased. Very clean, food outstanding, staff the most helpful and polite. Location brilliant for all things and great for the evening strolls. Many lovely shops and restaurants well hidden behind the hotel. Walk to locations or a cheap taxi ride away, which is just what you want when on holiday. All staff more than happy to give help or advice on places to visit or restaurant. Our first day, when you’re unsure how to plan route and location. The excellent staff gave us a map and out line the Vatican route to take. He also mapped out for on the way back sites/shops we should take in. The whole day was outstanding and memorable. We would not have known down the side streets are the most wonderful antique and other shops. Great other attractions such as Trevi Fountain the Pantheon also taken in. Covered a lot of ground in our checklist of sites to see. Breakfast was always outstanding. Fresh fruit Salad, Fresh Salmon amongst the selection. All outstanding. You will be hard pushed to find a better place to stay. I booked last minute the night before travel as I read such poor reviews on another hotel-Pinetta Palace Hotel I had booked and cancelled . My 15 year son saved us when he found this wonderful web site providing all travellers with such valuable info. It certainly helped us and I am sure all travellers will be grateful. Thanks to all who made my holiday out of this world. Arrivederci!", "Date": "June 4, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Gloucester MA", "Title": "“Excellent time”", "Author": "RBB-7", "ReviewID": "UR3419288", "Content": "This is written from the perspective of two couples in their sixties. We just got back from a great stay at the Palatino. Some of the things that were important to us probably wouldnt occur to a couple in their twenties or thirties. For instance -good fast elevators and cabs within 5 minutes. This is a must when you have arthritic knees (there are three steps up from street to lobby). Nino and Roberto behind the desk speak the best english but everyone is helpful and nice. We booked through a Gate 1 travel deal- super cheap- and got the smallest least luxurious rooms. Even so they were plenty large with couch, chair, and king bed. The long narrow bathtub had loads of pressure and hot water and that wierd Roman rounded tub bottom that means hold on for dear life when showering. The important thing is that everything was spotlessly clean all the time! Great free breakfast selections too. Cabs are reasonable but there is also a metro station behind the hotel. The area is great and all the other reviews talk about the big attractions. There are also some local attractions that should be mentioned. If you can walk a half mile, turn left out of the front door and stroll up the Via Cavor to one of the great Roman churches- Santa Maria Magiore. Enjoy the mosiacs and have a cappucino in the square and people watch. There is a taxi stand if you don't want to walk home. As you are walking, about 200ft. from the hotel Via Cavor hooks a left . Right at the hook it says Bar . Go in for great sandwiches and Gelato. 50ft. further is L'Archetto- a really nice cramped wine bar. Great food too! Try the grilled veggie antipasto. We had a teriffic dinner there. Behind the hotel to the right down a long flight of outdoor steps try Ragna D'oro. Great pizza, pasta and local wine. If you really want local turn left at the bottom of the steps and try to find La Vecchia Roma- unbelievable local color . All Romans. Point at the menu. They dont speak a word of english- great fun. Prices? Unbelievable - Antipasto Misto 4e-Bruschetta 1e-Pizza 5e-Osso bucco 10e- lamb-7e. They open at 7:30 and are turning people away by 8:00. The only other thing that we did that I would recommend for two couples is ask Roberto to book a private car for a day for 10 hours . We went to Orvietto and Assissi and got to see some unbelievable sights. 350 euros - pricey but well worth it! Palatino Hotel? We'd go back in a heartbeat. PS Don't forget to walk up the 85 steps to see St. Peter in chains across the street. It has a nice Michelangelo Moses in it. Me? Next time I'm taking a cab!", "Date": "April 27, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "USA", "Title": "“Hotel Palatino lives up to its Grand name!”", "Author": "eternalroma", "ReviewID": "UR3376060", "Content": "I just returned from four nights at the Grand Palatino and it is an excellent hotel. The staff were all very friendly and helpful. After a taxi ride from hell we were upgraded by Giovanni to a deluxe room. The hotel is in a nice location for exploring ancient Roma and across the street from the St Peter in Chains Church which has a lovely mural by none other than Michelangelo on the ceiling . If you stay here definitely walk over to the church to see the mural. The Hotel is located on Via Cavour which runs right into Fori Imperiali which will take you right past the Colosseum, the Roman Forum and up to Piazza Venezia and on to the other famous monuments. All of the major tourist sites are easily walkable from the hotel. There are several cafes near the hotel and also a neighborhood market with very reasonable wine prices up about 1/2 block. There is also a bank and ATM on the same block as the hotel and a currency changer within a light stroll of the hotel. I wholeheartedly recommend this hotel and will definitely stay here again on my next trip to the eternal city.", "Date": "April 19, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Rocky Mount, NC", "Title": "“Great Hotel!!!”", "Author": "Mike625", "ReviewID": "UR3335734", "Content": "My wife and I spent five nights at this Hotel in late March and were very impressed overall. The location is top-notch, close to most of the major historical sights in Rome. The room was spacious but not very quiet, as we were facing the Via Cavour. It could get pretty noisy at times. The hotel staff was excellent, going out of their way to help with any request. There are a number of good restaurants close to the hotel, one being the Cafe Borgia, which is right next door to the hotel. Overall we felt the hotel was a good value for the money spent.", "Date": "April 5, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Scunthorpe, North Lincolnshire", "Title": "“Lived up to every expectation”", "Author": "SMG52", "ReviewID": "UR3325414", "Content": "We stayed at the Grand Hotel Palatino for a week at Easter 2005 & were very impressed with all aspects - the location was perfect, a couple of minutes from the metro and within walking distance of nearly all the major attractions. The hotel staff were very friendly, helpful and courteous. The room was great, on the 7th flloor, overlooking the Via Cavour, clean, soundproof, ample space, excellent breakfast with plenty of choice. We will definitely return to this hotel when we visit Rome again.", "Date": "April 3, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Boston, MA", "Title": "“Grand Hotel Palatino is Grand”", "Author": "A TripAdvisor Member", "ReviewID": "UR3296697", "Content": "Our family spent 10 days traveling in Europe, visiting Rome, Venice, and Paris. Without a doubt, Grand Hotel Palatino in Rome was our favorite hotel. We had two rooms for only 2 nights, but wished we had stayed longer. The hotel is in a great location with the Metro a few steps away and Rome's main train station, Termini, just one Metro stop away. The rooms were clean, nicely decorated, and with a good view of Rome. The staff was extremely helpful and polite making our stay very pleasant. But the real highlight of our stay, and our trip, was dining at the Grand Hotel Palatino. Mr. Sandro Medardi, the restaurant manager, and his staff have created a superb dining experience with painstaking attention to detail and service. Mr. Medardi often went from table to table ensuring his patrons were satisfied, and more than once offered ordering suggestions. His suggestions resulted in superb pasta, eggplant, veal and fish dishes. It is not often you find a hotel restaurant and hotel restaurant host of this caliber.", "Date": "March 23, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Poquoson, Virginia", "Title": "“Highly Recommend Grand Hotel Palatino!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3274965", "Content": "My husband, sister-in-law, and myself just returned from Rome and our wonderful 8 day stay at the Palatino Hotel on Friday, March 11, 2005. What a wonderful choice for a hotel! The location was excellent, excellent, excellent! The Collisseum is only 2 blocks away, as well as the Forum, and they are presently excavating the Roman Market across the road from the Forum. Roberto at the front desk was very friendly and helpful. The breakfast was GREAT! Having traveled to Europe every year for the past 13 years, we found the breakfast that was included to be one of the best we have had. Eggs, bacon, cheese, ham, fresh fruits, as well as a great assortment of breads and sweet breads awaited us every morning. They also had cereals and juices as well as great cappuccino. We looked forward to breakfast each morning. The hotel is so centrally located that we found that taking a taxi wasn't that expensive (the Vantican cost around 6 euro each way). Surely was worth the few extra euro not having to deal with the crowded buses and undergrounds. I can't say enough about how much we enjoyed our stay at this hotel. The bathroom was very nice and the shampoo, bath gel, etc. was replenished each day. If we vacation in Rome again, Palatino Hotel will be the place that we will stay.", "Date": "March 15, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Raleigh, NC", "Title": "“Good Hotel”", "Author": "munchkins7", "ReviewID": "UR3257651", "Content": "Thanks for all the information. Glad I made the right decision. I agree with what has posted previously. The hotel is centrally located, between the Colosseum and the Roman Forum. Approximately a 20 minute walk, to the Trevi Fountain, a 25 minute walk to the Spanish Steps and a 35 minute walk to Piazza Del Poplo. My husband I even walked to St. Peter's in about 45 minutes. The breakfast which is filling wanes after a couple of days, but at least it is included in the price of the room. Granted a lot of tours stay there, so it can get a little noisy in the middle of the night, with kids going from room to room. The front desk was very helpful, especially Alessandro, who was very accomodating. Also Luigi, the driver, who picked us up and took us back to the the airport. Prices comparable to taxis. It was a very good feeling seeing someone holding my name, after travelling for 20 hours. Can highly recommend 3 places to eat. One is Angelos, located at 75 Via Gioberti. Food very good and reasonably priced. Daniel, the waiter, is very fun and made the 2 evenings we ate there fun and memorable. Dinner each time we ate there was never more than 35 Euros, including a wine from the wine list, the first night. The second place is, Pizzeria DaBaffeto, located at 114 Governo Veccho, off Piazza Navona. Arguably, the best pizza I have ever eaten. Dinner for two, included, one salad, one order of bruschetta, one large pizza, one medium pizza,(we thought a large would be enough, silly us) one litre of house wine, and the meal came to 21Euros. The third place we went to, for our wdding anniversary, L'Eau Vive, a french restaurant, located at 85 Via Monterone, off Via Corso Emmanuel II, at Largo Aregentina, is a bit pricey, has to be the best french food, I have eaten outside of Paris. The restaurant is run by an order of nuns, and at about 9:30pm, they nuns handed out cards to the dinners and everyone sang \"Ava Maria\". Truly beautiful moment. Dinner came to 73Euros. It included, one bottle of water, a bottle of wine, a salad, soup, an order of escagot, 2 entrees, espresso and 2 dessets. Rome is wonderful. You easily burn off all the food and wine from all the walking. Enjoy!", "Date": "March 7, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Jose, CA", "Title": "“Great hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3087760", "Content": "Just returned from Rome on Sunday. We selected this hotel on the strength of the reviews from this website and were more than pleased by it. It was only two blocks from the Forum & the Colosseum, the staff was excellent, and the breakfast beat any free hotel breakfast I've ever had. Moreover, the room was plenty warm for January, we had extra blankets in our closet, the shower was actually tall enough for my 6'2 husband (very unusual in Europe), and the safe in our room worked. Both the room and the bathroom were quite large, too. My only one small complaint is that the bed was a bit hard. It didn't prevent us from sleeping--the 9 hour time difference saw to that--but for someone not suffering from severe jet lag it might be a tad uncomfortable. We would definitely stay here again, though. Lively but safe neighborhood with some excellent restaurants nearby.", "Date": "January 26, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Great Hotel, Great Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR3001400", "Content": "My five friends and I just returned from our week stay at the Palatino Hotel in Rome. What a great Hotel. The staff was very friendly and helpful. Nino at the front desk was great. He recommended restuarants and even provided us with a car and driver for a day trip that ended up being cheaper than taking a train. We visited Pompeii and the Amalfi Coast. The Hotel is right next to the Cavour Metro station, so getting around was easy with our weekly pass. The rooms were typical for a European hotel room, small but nice. Also very quiet. The Breakfast was not great, but good. It was just what I expected. Good bread. I would highly recommend this hotel for anyone going to Rome. Location is great and the Staff was excellent.", "Date": "January 11, 2005"}], "HotelInfo": {"Name": "Palatino Grand Hotel Rome", "HotelURL": "/ShowUserReviews-g187791-d228970-Reviews-Palatino_Grand_Hotel_Rome-Rome_Lazio.html", "Price": "$152 - $322*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Cavour 213-M</span>, <span class=\"locality\"><span property=\"v:postal-code\">00184</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "228970", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/20/76/07/executive-room.jpg"}}