{"Reviews": [{"Content": "Fanatstic views - but a little pricey! We stayed 4 nights at this hotel as part of a two week tour around Italy. The hotel was easy to find and about a 10min walk from the railway station.The room was spacious with an entrance hall and a very large double bed. The bathroom was also big and very well kitted out.The views from the roof terrace were amazing (looking over Florence and the Doma).The room rate I felt was reasonable, but the prices for drinks at the bar were horrendous - 4euros for a can of coke!We ate at the restaurant one evening and I was dissappointed. I ordered a scampi risotto, the risotto was cooked well, but there were only 3 scampi! The bar food was nicer, but the menu very limited.The hotel staff were welcoming and the bar staff very good.", "Date": "Oct 1, 2008", "ReviewID": "UR231990783", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "3", "Rooms": "5", "Location": "5"}, "Author": "CarmenH1"}, {"Content": "Nice place Staying at Kraft Hotel for 4 nights was a good experience - keeping in mind some other bad experiences I unfortunately had before with other hotels in Italy. We booked a double superior room which had a balcony facing the street. The room and the bathroom were spacious enough. The furniture was a little tired but it was alright, nothing major to complain about. A great thing was that the air-conditioning worked perfectly well, keeping the room cool while outside were 35 C degrees. The staff was very nice and professional. Breakfast was OK. A very good experience overall.", "Date": "Aug 12, 2008", "ReviewID": "UR675769845", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "3"}, "Author": "I0na"}, {"Content": "What a view!       View from Kraft", "Date": "Jul 24, 2008", "ReviewID": "UR129382607", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "js_in_boston"}, {"Content": "Loved the Pool Initially hard to find due to road work, but a charming hotel that is nicely situated for sight seeing. We parked our rental car and were on foot for three days. Due to the heat wave, the rooftop pool was a welcome respite during the long hot afternoons. The room was adequate. The breakfast buffet was fairly generous as well. The staff were very helpful with tours and directions.", "Date": "Jul 9, 2008", "ReviewID": "UR838123508", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "ValCarlsbad_CA"}, {"Content": "Beautiful room in a beautiful city Found the Kraft while in Italy, through Trip Advisor.Loved everything about the hotel - the room, the staff, the amenities. There is a roof top pool that looked appealing, though I never used it.The shower was very nice, and the room itself had a very romantic quality. Air conditioning was strong and fast, and there was even adequate WiFi.Convenient to the train station, but a bit of a haul to anywhere else. If you don't mind a vigorous walk, or a cab, it's a great place to stay.", "Date": "Jun 23, 2008", "ReviewID": "UR532164054", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "3"}, "Author": "mondojoe"}, {"Content": "Long walk downtown We really liked the Hotel Kraft. Nice clean large room with modern bath. Plenty of hot water. Friendly and helpful staff. The only drawback is it is long (15 min) walk to the historic area (Ponte Vecchio). Nice views from the roof top garden.", "Date": "May 26, 2008", "ReviewID": "UR668652058", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "3"}, "Author": "auric08"}, {"Content": "Excellent Location Great location, just outside the inner core of Florence. Great Breakfast", "Date": "Apr 21, 2008", "ReviewID": "UR932456231", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "bosox1010"}, {"Content": "Enjoyable stay Good hotel. Good location: 15 minutes from main location. Nice walk along the Arno.Quiet neighbourhood. Breakfast was only ok. To be recommended overall.", "Date": "Apr 1, 2008", "ReviewID": "UR362113416", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "4"}, "Author": "IrelandKiki1"}, {"Content": "We loved our room in The Kraft! We got a great room - number 406 - it was very big, clean, huge comfortable bed, nice view from the balcony, and a big bathroom. I liked the decor too, quite old fashioned with a lovely parquet floor and painted ceiling, so very pretty. Getting this room alone means that we would both stay again and also recommend to a friend. The walk into town along the river is really lovely, whereas I would not have been happy to walk in the vicinity of the train station after dark. The reception staff and the porter weren't the warmest or the most efficient, but don't let this put you off, it's good value, only 10 minutes walk along the river from The Ponte Vecchio, and we would certainly stay again.", "Date": "Feb 18, 2008", "ReviewID": "UR624349535", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "4"}, "Author": "JVMCork"}, {"Content": "Great Bfast and Rooftop       Bedroom, City View", "Date": "Feb 14, 2008", "ReviewID": "UR659971735", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "3"}, "Author": "jennibeans"}, {"Content": "Nice Hotel but don't go in September My boyfriend and I visited Italy in September 2007 which I would not recommend as it is the most expensive month of the year in Florence. We stayed in Hotel Kraft for three nights and on arrival we were given a room upgrade which was nice. The hotel lobby and common area were very nice, clean and modern as were the lifts and the corridors, the rooms however, were a more old fashioned victorian design which didn't quite fit with the overall scheme of the hotel. A major problem was the smell, the odour didn't hit us until we opened our room door and we later figured out that it was coming from the roof top swimming pool (very small and needed a good clean) because our room was on the top floor. Another problem was the lack of guests staying in the hotel and the roof top bar (very nice) closed early, so I would recommend anyone planning on going to Florence to go a little earlier in the summer. However, all in all the staff were extremely accomodating and the food was very good.", "Date": "Jan 15, 2008", "ReviewID": "UR736346688", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "LeitrimLizzy2"}, {"Content": "Too expensive for what you pay Not the best hotel I have visited. The breakfast was affordable, the building was old enough, the location was far away from the center (about 30 min), the staff wasn't spoking English at all, and finally the room was too tiny for two persons.", "Date": "Dec 9, 2007", "ReviewID": "UR498451826", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Cacofonix"}, {"Content": "Hotel Kraft LOW Point of an Otherwise Perfect Trip The website of the Hotel Kraft is beautiful. It shows beautifully appointed rooms and contains language that describes a luxury property. The truth: the rooms have not been updated for many years. The furnishings are outdated and in some rooms just a collection of mismatched furniture. The wallpaper is old and yellowed. The linens are old. Trouble with the Kraft is that it isn't vintage old...it looks like garage sale old.Also: Very important: We were offered a 1 $ for 1 Euro on par rate. We have used this as a benefit while traveling in other countries. However, the Hotel Kraft converted $$$$ to Euros and then offered it on par, which is no different than just paying more dollars!Rudest staff in Italy by far...most unattractive rooms...seedy part of town...topped by what we viewed as very dishonest advertising.", "Date": "Oct 20, 2007", "ReviewID": "UR678496191", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "Atlantatraveler57"}, {"Content": "Excellent Stayed in this hotel in Sept 06 and still remember the good experience. The hotel is easy to reach from train station or town and a quick walk to the Arno river. Had dinner on the rooftop and it was delicious and a beautiful view of Florence. Highly recommend it and hope to return. Room was clean and staff spoke english.", "Date": "Oct 4, 2007", "ReviewID": "UR639494018", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "MuppetExpat"}, {"Content": "Geat Hotel It is a really nice hotel. The pool on the roof is great after a long days sightseeing.", "Date": "Sep 10, 2007", "ReviewID": "UR814689093", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "4"}, "Author": "KevIreland"}, {"Content": "We liked this hotel Good hotel that was so convenient for walking into city centre. Close to American Consulate so 24 hour police precence on corner (good or bad?!). Very quiet nearby with no noise coming up from streets. Staff were very helpful with travel arrangements and making bookings. All spoke very good English and even understood by terrible Italian!. Room was clean although maybe a bit small but hey, you're only sleeping there. We had a balcony which compensatedRooftop pool was a bonus and offers great views over the city. Breakfast was OK. Didnt dine in restaurant at all simply because we explored and eat out each night. Stayed 5 nights and would have no reservation in going back and staying there again when next in Florence.", "Date": "Sep 6, 2007", "ReviewID": "UR948277084", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "FDC55"}, {"Content": "Great hotel, pool excellent Spent 2 nights at hotel kraft. Yes the room was a bit small but perfectly fine for what you want. Clean bedding, towels etc. Staff very friendly and helpful. Rooftop pool is excellent with fab views of florence. Just what you need when you come back from a days walking. The bar and rooftop Restaurant get the thumbs up. Had dinner on one evening and it was lovely. Drinks can be expensive though. Buffet breakfast was lovely, pastries, ham, cheese, cakes, yogarts, cereals and fruit. everything you wanted. The hotel is about 8 - 10 minutes walk from the main area in florence but it is an easy stroll along the riverfront. I was completelly pleased with my stay at this hotel.", "Date": "Sep 5, 2007", "ReviewID": "UR328909289", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "EireGlitter!"}, {"Content": "Stay Away! On a tour of Italy that took us to Venice, Tuscany, Florence, Rome and Positano, THIS was the ONLY hotel out of the 5 we booked that we did not like and wouldn't return to.Pros: Ummmmmmm......Cons: Upon arriving at our room, it smelled like smoke. The front desk's solution to this? They sprayed some air freshener. So our room stunk. And it was incredibly small. When we tried to eat out on the rooftop, the place was deserted and we couldn't find a soul to serve us, so we left. I am not a lazy person, but the location was really a little too far to walk from the Duomo and center of town. When you headed out for the day on foot, you knew you weren't making the trip back until you're ready for bed. Our room was facing a street where the garbage trucks would rummble, clank and bang down the street and jar us awake in the morning - that is, if the noise from the other guests coming through the paper thin walls didn't do it first. Even more annoying, when the bathroom pipes would run, it was so loud that is was alarming. On our first night, I woke up my husband, scared that the bathroom was flooding. And the funny thing is that I can usually sleep through anything and I think this may be the first hotel I stayed in where I was being woken up all the time.Advice: Find a nicer hotel closer to the Ponte Vecchio.Bottom Line: Don't. Just don't.", "Date": "Aug 30, 2007", "ReviewID": "UR490092552", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "2"}, "Author": "ERigby"}, {"Content": "Not too bad as far as European hotels go Stayed here Aug 13-17 and had a double superior room - I had requested one with a balcony if possible and that's what we got. This size room was very pleasant and easy to move around in, balcony was moderate size, no real view except the street below, but nice breezes with two chairs and a small table to use. Place was simple, clean, nothing extravagant. Staff was polite. Air conditioning was a bit noisy, but was definitely enough in August weather to keep us cool. Breakfast wasn't anything great (all cold, juice was watered down), you would do better to stop and get something on your walk into the city. Which, by the way, is easily 15-20 minutes to get to the heart of sights, so wear good walking shoes. Hint - if you want to avoid some of the walking crowds - cross the first brigde you come to on the river and walk on the other side, then re-cross at the Ponte Vecchio if you like.The rooftop terrace had *great* views, especially at night. The pool was pleasantly cool for being on the roof in 90 degree weather. No towels up top, so bring one from your room. The terrace bar has quite the specatular cocktail menu on line - but I would stick to straightforward drinks... My husband ordered a Manhatten that tasted like something from Canada. And their house red/white wines were less than ok. But the house Proseco was nice. All in all, a decent stay, but I would be inclined to check out somewhere else on a return trip.", "Date": "Aug 22, 2007", "ReviewID": "UR373535622", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "3"}, "Author": "Barbwire13"}, {"Content": "Good Location and great view from the roof Stayed at Kraft in July 07 and found it to be a great hotel, easy to walk to from the train station and a nice distance from all the major sites.We got a 3 for 2 nights offer so upgraded to a superior room which was nice and big with a balcony.Road outside can be a bit noisy around 5pm but i think that was because the next road along was closed so people had to divert down it to get home, other than then it is nice and quiet.Great view from the roof, id recommend taking up a few drinks and watching the sunset.Only faults would be that the pool was freezing cold despite the weather being boiling hot, and food and drinks from the hotel are very expensive. If you want a nice meal head to the rotunda restaurant in the square down the road (via il Prato) and if you want cheap drinks to drink on your balcony head to Happy Wines, a little shop on Via Palazzuolo, a bargain!", "Date": "Jul 11, 2007", "ReviewID": "UR915196284", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "petit_chou-fleur"}, {"Content": "No service and flooding at the Kraft Date: June 6, 2007Reviewer: TripAdvisor user from CaliforniaIndifferecne reigns supreme at the Kraft Hotel! We traveled with a small group to Florence in June and experienced a few days of rain. One afternoon the rain was heavy for an hour or so and several people in our group found their rooms flooded (at no fault of their own)! The management did nothing to help these people, let alone move them or offer to compensate them for ruined items--they couldn't care less--after all, Florence is a city filled with tourists who have to stay somewhere so there is no incentive to provide good service in the hopes of gaining customer loyalty or positive word of mouth. Front desk people also failed to pass on phone messages or provide us help with our luggage.The rooms are just average--some quite small and strange, and the public spaces provide potential but never seem to be used (i.e., a bar in the lobby area and a rooftop bar). The breakfast was horrible--mostly canned, boxed and wrapped items. In a country like Italy, why do so many hotels provide canned fruit and juice concentrates? The location, while quiet, is far from the action. Because Florence is a tourist town, prices are high and service is often spotty, but I'm sure one could find a better hotel than the Kraft.", "Date": "Jul 4, 2007", "ReviewID": "UR122807473", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "2"}, "Author": "CaliforniaTillie"}, {"Content": "Fantastic Hotel Just back from a lovely one night stay, which I booked on laterooms.comEverything and everybody were top rate at this hotel.The position is very convenient and the roof top pool is the icing on the cake.The air conditioning was the best ever in the blistering heat.Cheapest and nicest ice-cream shop across the river 2nd bridges on from the hotel.We will be definately be staying there again.", "Date": "Jul 2, 2007", "ReviewID": "UR541326343", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "SusanTear"}, {"Content": "Nice hotel My husband and I stayed here for 3 nights for our wedding anniversary. The room (Superior) was very big but could have done with a little updating. The bathroom was huge and modern with lots of nice potions and lotions. There was also a tiny sun-facing balcony which was lovely to sit out on with a glass of wine after a day's sightseeing. The bed was large and comfortable although we could hear the noise from the street below and also our neighbours, therefore we didn't sleep very well.The pool area had a lovely view over florence but was quite busy as it's quite a small area. There were about 8 sunloungers but there was really no more room for any more to be added.The hotel was about a 20 minute walk from the main sights but although we usually enjoy staying outside of the city on previous city trips, this time I would have preferred to be nearer the city as the area around the hotel was not very interesting. Personally, I think the area around Santa Croce would have been the best area to stay.Breakfast was pleasant as were the staff. All in all I don't think I would choose to stay here again, mainly because of the location although I would definitely book a hotel with a pool or an area to sit out in after a morning's sightseeing in the Summer heat.", "Date": "Jun 30, 2007", "ReviewID": "UR373514010", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "2"}, "Author": "scampyYorkshire"}, {"Content": "Nice hotel This hotel was very clean, good breakfast. The rooms was good sizes. Like my Rome hotel, the bed and pillows were hard. The location is in a residential area with a ten minute walk to the center. Nice walk along the Arno River.The side streets had good restaurants that were not touristy.Their rooftop terrace was nice with a great view.I felt the staff were a little cold. The decor was very contemporary and gives doesn't give you a cozy feeling.", "Date": "Jun 22, 2007", "ReviewID": "UR740533594", "Ratings": {"Service": "3", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "4"}, "Author": "jacers1"}, {"Content": "Not a four star We stayed at the Kraft for three days this May. Folks, this is not a four star hotel. No doorman, schlepped our own luggage to a third floor new room so small it was difficult to walk around the bed. The room did have air and there was a heat wave. Sure appreciated the cool air.The cleanliness was disappointing. Floors needed vacuuming and the room a general cleaning. Breakfast was adequate; some food not the best quality. The shorthanded staff was overworked. The man behind the desk also pinch hit as a concierge. The day we checked in he was doing it all. Did I say this hotel is definitely not a four star? Value is not there for your money. Don't waste it. As reported in another post; it is too far from things. We had to be booked by a travel agent this trip or we would have checked out. You are really in a no win situation and bound by a contract. The staff was polite. The wireless signal did not work in the room, only the lobby, for my husbands laptop. That became inconvenient. Overall, this hotel should not be more than a three star at best.", "Date": "Jun 22, 2007", "ReviewID": "UR700346483", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "netravelers"}, {"Content": "Perfect !! This was a beautiful hotel . Staff were friendly , room was very clean and very comfortable. Loved the roof top bar at night.couldnt fault this hotel it was perfect for a romantic getaway to florence which is now my new favourite place to go.", "Date": "May 25, 2007", "ReviewID": "UR636933365", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "Sarah1986*"}, {"Content": "Noisy Hotel We slept at Kraft Hotel for 3 nights and I was disapointing by the hotel; it's so noisy. You hear the noise from the street very clearly. During the night, the noise was very loud from the street. The first night we were ont he first floor and it was horrible. The second and third night we asked to be moved on the third floor and it was much better. The hotel was weel located for me. Not far from the train station (10 minutes walk) and not to far from the center (10-15 minutes walk). There are few good restaurant on via borgongni which is not far from the hotel. The breakfast in the morning was average. I would say this is not a real 4 stars, but it,s not to bad. The size of the room is excellent and very clean.", "Date": "May 25, 2007", "ReviewID": "UR109564737", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "2", "Value": "2", "Rooms": "4", "Location": "4"}, "Author": "ginro"}, {"Content": "Fabulous Location and Value       The lounge area with mezzanine above", "Date": "Jan 13, 2007", "ReviewID": "UR217160663", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Fabu"}, {"Content": "Average Stayed here two night with my husband in sept 2006 with internet -rate. The staff at the reception is just rude !! Can't think of another word to use. I've stayed here two years ago and it lookes like the management/staff has been totally changed, but it lookes like the current staff was either overworked or just plain rude. The room was ok, pretty basic, clean but looked somewhat old. It lookes like they have to save money and did that on the maintance of the rooms and the swimmingpool-area. (When we got there the second time we saw that they changed/added the lounge area and extra rooms). Above our heads in the room, you could here water runing all day and night long.The staff at the restaurant and the cocktailbar are still very polite and nice. And they serve wonderfull cocktails (鈧?10,- each but very delicious).Based on a previous stay we went back to this hotel this year. But to be honest, when visiting Florence the next time, I am not sure whether I will return to the Kraft Hotel. Can image that the staff at the reception could have been tired but it looked like this was their normal way to speak to their customers. Just working for the money instead of just being somewhat enthousiastic about their customers and the hotel they are working for.That realy regrettably because the rest of the hotel is OK !", "Date": "Dec 28, 2006", "ReviewID": "UR513073958", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "4"}, "Author": "M&M-0511"}, {"Content": "A Nice Hotel We've stayed at the Kraft hotel before and it is a nice property. The staff are professional and courteous. The rooms are good size and clean. It is a little out of the city center but everything in Florence is easily walkable. Our room was just outside the elevator and a little noisy but not a problem. I would recommend the Kraft hotel to anyone visiting Florence. The reduced rates on the hotel's web site may not be a huge bargain but offer a realistic price for a nice room. We will return when in Florence.", "Date": "Nov 26, 2006", "ReviewID": "UR372212352", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "EC_Traveller"}, {"Content": "Overcharged Us on the Bill The only negative thing was the BILL. We had booked through the website and they offer a special for Americans that the rate would be in dollars not Euros. We thought we were getting this price which would have meant the 260 Euro rate would have been much less due to the American dollar offer. When we checked out I was quite surprised to see that they did not give us the discount. We were told we were not eligilbe because it wasn't noted on our reservation but showed me other bills that did receive it. The manager was of course not available and we had no choice but to pay the overcharged bill. I emailed the hotel upon my return home and they insist that we are not eligible and would not get a refund. Perhaps I can save someone else from this by telling you if you stay here and want that discount, get it in writing. The hotel is an OK place to stay, quiet room, it was quite large, we had a triple. 15 minute walk to Uffizzi etc., nice to walk along the river. Staff is OK, the are pretty business like. They were very stubborn about this discount and I felt based on their website and we booked online for this that we were eligible for it. It states that ALL AMERICANS will pay dollars and instead of Euros how could we not qualify????", "Date": "Nov 13, 2006", "ReviewID": "UR333106542", "Ratings": {"Service": "2", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "3"}, "Author": "cathy0516"}, {"Content": "Not worth the price, but an okay place to stay The website is a bit misleading. The Hotel is in a rather dull part of the city, a good 20 -25 minute walk from the ideal parts. For example, the Ponte-Vecchio is about a 20 minute walk along the Arno. The main areas of the hotel are nice, but the rooms are a bit outdated, and in stark contrast to the modern and elegant decor in the front lobby. The upstairs pool was also a bit of a disappointment. It is small, cold, not the cleanest, and rather shabby with green astroturf all around. We expected a heated pool with ecclectic Italian tiling, or some sleek modern style. It is not luxurious or inviting by any means. Don't decide to stay here for the pool. Trust me. The balcony in the room was a nice feature, but the view (or lack thereof) made us opt to not use it much.The views from the rooftop are spectacular, and the best thing about the hotel. Since this hotel is a bit far away from most of the sights in Florence, I would expect the hotel to make up for it in style and service. The service was rather lukewarm. Not bad, but not great. The breakfast buffet was 3 stars, not luxury. Just ok. The rooms were reminiscient of old French hotels from the 1980's. Not sure how it got its 4 star rating.The hotel should consider renovating the rooms and upstairs pool area to match the cool lobby and front bar area.  This hotel has potential to be something great, in spite of its rather dull location. If they made it a destination hotel, or added a great restaurant, lounge, or spa, it could be great.Overall, it was ok. The price was rather hefty for what felt more like a 3 star hotel, but Florence Hotels are so expensive.", "Date": "Oct 17, 2006", "ReviewID": "UR695884348", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "2"}, "Author": "xtos"}, {"Content": "Really liked this hotel We really liked this hotel where we stayed three nights in September. Our room (Superior) was spacious, airy and light (not the usual gloom that you get in so many Italian hotels); it had a small balcony with plenty of room for two to sit overlooking a leafy street that was quite quiet. The real bonus about this hotel is the stunning roof terrace which has views all over Florence and the hills beyond. Sitting here in the early evening with an aperitvo is what it's all about. There is also a small swimmng pool on the roof terrace - you can swim whilst looking over the rooftops and domes of Florence. We ate one night at the hotel restaurant which was superb, although you wouldn't want to eat there every night. There are plenty of trattoria nearby. THe only thing some people might find a disadvantage is that it is at least ten minutes walk from central Florence and the main sights. Many hotels are more central but it's very easy to hop on a bus just behind the hotel if you don't want to get sore feet before you start sight seeing.", "Date": "Sep 29, 2006", "ReviewID": "UR578471160", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "ImogenB"}, {"Content": "Not impressed, would not recommend We were supposed to have a non-smoking room but the room stunk of smoke. Additionally, the staff seemed a bit rude. The room we had was on the third floor and every night it sounded like our bathroom was flooding - something with the pipes (possibly washer/dryer) being routed near our room. However, the walls were paper thin and you could hear everything. The hotel is also pretty far from the main area of Florence (Ponte Vecchio), which is our fault for not researching that ahead of time.", "Date": "Sep 20, 2006", "ReviewID": "UR863345440", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "2"}, "Author": "djbauda"}, {"Content": "A hotel intent on cuttin costs - theirs, not yours! Whilst this hotel has nicely furnished rooms and a fairly convenient location to the station, we found some of the staff could be quite condescending and rude. We noticed they seemed intent on cutting costs by watering down the body lotion, not replacing the bubblebath and shampoo bottles during the daily room maintenance, and serving yesterday's stale breads and cakes for breakfast. The rooftop pool is a disappointment - it's very small and there are limited lounge chairs in a cramped area. There are no Sun Umbrellas at the pool area so fair-skinned holidaymakers cannot benefit - they have to go downstairs to the bar area to find some cover.", "Date": "Sep 13, 2006", "ReviewID": "UR186310521", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Kazzabunga"}, {"Content": "not bad..but not great we booked 6 nights at the Kraft for our honeymoon. We had quite high expectations based on the website ..but the hotel itself was a bit of a disapointment. The room we had was very basic and didn't look like it had been painted for about 20 years. The other reviewers have complained about the noise of the AC - it is pretty loud! The rooftop pool was a great way to spend a couple of hours in the late afternoon but it is tiny and very cold! The bar menu was fine..but not extensive and the food in the restaurant was expensive for what it was. The Kraft is an ok hotel and the terrace is great- but don't go if you're off on a romantic break.", "Date": "Sep 12, 2006", "ReviewID": "UR249389109", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "2", "Location": "4"}, "Author": "sarah36"}, {"Content": "Kraft Hotel. Just come back from Florence,staying at the Kraft Hotel. Hotel easy located from the Main train station.Hotel clean,tidy  and most of the Staff are very friendly..except the eldely  gentleman who suppose to assist you with your breakfast. ...Can be a bit grumpy and off-hand depending which side of  the bed he has got out of. Nice splash pool on Roof top to cool down after walking round lovely City. Personelly I would go back and stay there.  Trip Advisor member Cumbria.", "Date": "Sep 10, 2006", "ReviewID": "UR786458831", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "wrufc"}, {"Content": "Good location  Booked this hotel on the basis of the Tripadvisor reviews. Made the right choice. Yes, the rooftop pool  bar are just the job after a hard slog around Florence. Staff are very efficient  friendly. Location is a 10 minute stroll to the centre, 5 mins to Station  close to the hire car pick ups. Very quiet in August as this hotel is in a bit of a residential area. Rooms are comfortable.", "Date": "Sep 4, 2006", "ReviewID": "UR666363084", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "KAMIO"}, {"Content": "Refined - no, Ok - just about. The welcome from reception was farely cool and we were left to take baggage up steps, into lift and to your room on your own. Not what you would expect for 4 star, The room when you got to it, was what we would call a shoe box and very small shoe size at that. However this appeared to be bad luck as we looked into rooms on the other side of the corridor that seemed bigger and had a balcony (we had nothing). The bed was smaller that you would expect with a mattress that had seen better days. The pillows were poor quality. Given the choice between mosquito bites at night due to leaving the window open or facing the prospect of a sleepless night due to the noisy air condition system - meant some uncomfortable and scratchy mornings. The breakfast buffet was good compared to other places in city, although not up to quality of other 4 star hotels - no hot selection. Decor was basic standard. Roof terrace had fab views, lovelly trees and plants but badly let down by cheap unpleasant plastic furniture. Bar staff there were hard working and friendly, but keen on playing Italian pop music from a radio loudly. They did turn this down if asked. Food was good in the restaurant particuarly when on a nice evening they served the meals on the terrace - albeit with nasty furniture. Recommend the set Tuscany menu. Location - not the best at all and more of a 15-20 minute walk to the main areas of interest. Staff - not interested in any feedback and frankly didn't seem to give a damm.", "Date": "Aug 28, 2006", "ReviewID": "UR581883193", "Ratings": {"Service": "2", "Business service": "3", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "1"}, "Author": "suzienrob"}, {"Content": "All that glitters.... We booked through Expedia.com and stayed at the Kraft hotel in April 2006 and were soon to regret the choice. We understand that usually, when booking through discount on-line sites you get the hotels worst rooms. But many of the listed room amenities for the Kraft are complete lies. Not all rooms are soundproofed. Our room faced a busy side road, on the opposite side to the river, and was noisy with the windows closed. Note: 鈥渃onverted 19-century townhouse鈥? does not mean double glazing. But the noise from the housekeeping staff, yelling at each other, and dragging furniture across wooden floors, drowns out the Vespa cacophony. But even they are no competition for the breakfast staff. Bring your ear plugs!Rooms have 鈥榗limate control鈥? i.e. open a window because the 鈥榓ir conditioning鈥?is not switched on. In April we experienced temperatures from a hot and humid 29 degrees Celsius, to a wet and blustery 12 degrees. Not at any time did the air conditioning work in our room. On the initial hot day I enquired with Reception how to work the climate control. I was informed that the 鈥榮ystem鈥?would not turn the air conditioning on, and was told to open a window. What little noise reduction there was, disappeared. When the temperature dropped to 12 degrees during the day, again the 鈥榮ystem鈥?would not turn the AC on. I don鈥檛 know about you, but the idea of 鈥榗limate control鈥?is that I, the guest, have the ability to set the temperature of the room, as I like it. A plus for the room is that the bed was comfortable, but it took up much of it. A crab like walk would get you around the bottom of the bed and wall. And this was good practice for the shower. Nice as the green marble tiles were, the shower was literally closet size. Turning around in it meant scraping your shoulders on the cold walls, cosy. Yes, the roof top garden is pleasant, no water in the pool, but a great view over the city. Yes, the hotel is close to the Opera House, the river, and a brisk 10 minute walk from all the sites. But it is also, if such things concern you, 100 metres away from the fortified American Consulate.The Kraft hotel is not worth the discounted rack rate. There are better value options near the train station, for a good deal less.", "Date": "Aug 23, 2006", "ReviewID": "UR897945687", "Ratings": {"Service": "1", "Business service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "Aroborus"}, {"Content": "Great Place! Our Family of four (2Adults and 2 late teens) stayed at the Kraft Hotel for a few nights in the middle of July. We booked two double rooms on-line with no problems. The Hotel, rooms, staff and location............all Fantastic. The Hotel has a roof top pool with a upscale open air dining room for the evening as well as a bar that serves good food for most of the day, all with a low-key atmosphere great for relaxing and enjoying the view over the city. When we come back to Florence we won't even think of staying somewhere else.", "Date": "Aug 20, 2006", "ReviewID": "UR641289694", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "CaptainBlair"}, {"Content": "Excellent - made my Honeymoon               More photos", "Date": "Aug 20, 2006", "ReviewID": "UR431830537", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "dhroser"}, {"Content": "A very pleasant stay       Bedroom, work desk", "Date": "Jul 11, 2006", "ReviewID": "UR645129518", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Terrace and pool a bonus My friend and I have just returned from a 3 nights stay at the Kraft hotel. We were very pleased with the accommodation, our room was large, it was spotlessly clean and the air con was quiet and efficient. The area is quiet and relatively traffic free yet only a few blocks away from the start of the town. The inclusive breakfast was plentiful and varied. Food and drink are available on the lovely roof terrace. A few steps further up is the pool terrace where you get fantastic panoramic views of the city. The staff were pleasant and helpful they made calls to check prices and when we asked if they new the train times they checked their computer and printed them off for us. We would return to this hotel and would happily recommend it. If you fly into Pisa airport the train to Florence will cost you 5 Euros the bus approx 7 Euros. It takes just over an hr for both. The red open top bus tours round Florence offer 2 routes. Both are included in the 20 Euro cost and they are valid for 24hrs.", "Date": "Jul 10, 2006", "ReviewID": "UR204818026", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "crreview"}, {"Content": "Great Place for a Honeymoon       Duomo from the rooftop of Kraft hotel", "Date": "Jul 9, 2006", "ReviewID": "UR155111026", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lsandora"}, {"Content": "Great location and the pool is a real treat! My husband and I stayed at this hotel for 3 nights and had a lovely time. It is clean, the staff are very friendly, the pool is fantastic for a dip after a hectic day in the hot sun, breakfast is plenty and we even tried dinner which was delicious.The hotel is about a 5-10 minute walk from the station and in walking distance to everything else. Try to book museums in advance as it is the busy season.Fantastic!", "Date": "Jul 7, 2006", "ReviewID": "UR221819304", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "T&MWilson"}, {"Content": "perfect with some issues okay-it would have been perfect if we hadn't had a problem with our reservation. We planned this trip ten days before we were to leave on a 4 city 12 day trip-florence being the 2nd leg. Long story short, I tried to book on their website with a credit card, when I did not receive any confirmation page, I emailed twice to make sure it went through. Got nothing back for 24 hours, so I rebooked it through priceline(at a higher rate). I wrote again to confirm the new reservation and got a comfirmation. When we arrived, the woman at the desk had two sets of reservations. I explained what had happened, and she was pretty rude to us-tried to make me feel like an idiot, and insinuated that we might have to pay for 4 rooms when we only needed two. In the end, it was fine but it turned out that they don't have an agreement with priceline so we had to pay for it at the end after I had already paid for it through priceline. Turns out, I didn't actually pay priceline, but I thought I had-so it was annoying and stressufl to argue with the manager after a lovely stay, but it all worked out. THe hotel itself was perfect for us -in the embassy district, a nice walk to the center so a restful place to come after a busy day of touring. The rooftop pool, while modest, is exactly what you need after a long sweaty day at museums, and it has an amazimg view of the whole city. All in all I would come here again. ANd they gave uys a baby crib. The concierge, Giorgio, was excellent.", "Date": "Jul 5, 2006", "ReviewID": "UR524633398", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "-1"}, "Author": "gemelin"}, {"Content": "Great Hotel We loved the Kraft! From some of the reviews that I read on here and other sites they said that the hotel was sub par. We found that the kraft was great. The room that we had was spacious and clean and quiet. The hotel was just outside the craziness but within a five minute walk of everything. Florence is so small everything is a five minute walk. The hotel staff was friendly and courteous speaking english and helping us out whenever possible. The price for our room was not outrageous and after some of the other hotels we stayed at in italy they could have charged more for what we got. The complimentary breakfast was great. We just loved this hotel.", "Date": "Jun 1, 2006", "ReviewID": "UR928549614", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Modern, Clean, High Standards The Kraft is a very modern, high quality hotel in Florence. The rooms, though not large, are well equipped and the bathroom is excellent. Breakfast is superb. The only problem is that the staff are a little austere and parking costs 20 Euro per day. Recommended.", "Date": "Apr 25, 2006", "ReviewID": "UR121070458", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "-1"}, "Author": "cerij101"}, {"Content": "Very disappointed I have finally gotten around to writing a review of this place. We stayed there in mid December, 2005. The staff at reception were immediately hostile, almost fearful, and informed us that no phones in the hotel were working due to no fault of their own. They claimed that the phones would soon be working. It took at least two days for the phones to work properly. As I had had my credit cards stolen at the Rome train station (they were in my purse which was lifted from my handbag), I needed to make quite a few phone calls. I ended up having to use my cell phone to make the calls - very expensive. Aside from this, whenever we asked for something from the reception staff, they looked bemused or annoyed and tried to get rid of us as quickly as possible. A salient example of how they treated us was the time they called us a taxi. Immediately prior to me was a young woman waiting for a taxi. She came into the lobby, and her taxi arrived outside. She stood talking to her family for a while then smiled at the reception man and told him she no longer wanted the taxi. He then gestured to me that we could have that taxi, which had been waiting for five minutes for the other woman. When we got into that cab, the meter was at 5 Euros already! The driver claimed that he had been waiting all that time and would charge for it. Of course, he had been waiting for the other woman -- not us!! Now the hotel receptionist knew very well this would happen. He had been having fun at our expense. We insisted to the driver as he drove off that we should not have to pay this amount and we made the driver turn around and return to the hotel where the receptionist reluctantly got the driver to put the meter back to 0!!The hotel itself was acceptable for the price, but the staff really made it unpleasant. They gave us no help whatsoever.My advice: give it a miss.", "Date": "Mar 25, 2006", "ReviewID": "UR728443819", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "3", "Location": "-1"}, "Author": "boomertraveller"}, {"Content": "Kraft Works Although, the pricing seemed a bit high, we were pleasantly surprised by this hotel. It is close enough to walk to the centre (1km) yet far enough out to be quiet at night.The staff were on the ball and the breakfast was as good as we have had in mainland Europe.Try and avoid the 5th floor, as there is a restaurant and kitchen, which can be noisy, if you need to get to sleep early.", "Date": "Nov 3, 2005", "ReviewID": "UR872017832", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great views Great views from the pool terrace. Better not, ......great, just wonderfull views. Clean, nice staff, good breakfast and very modern rooms.No problem with the noise.Con:Just a bit far from the center of the city. To get to the domo you can take a nice walk across the Arno River (15 min).Difficult to get by car.", "Date": "Sep 22, 2005", "ReviewID": "UR235850217", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great Wonderful hotel, clean  well maintained. Fantastic buffet breakfast. Good location near train station and American Embassy.", "Date": "Sep 13, 2005", "ReviewID": "UR680448156", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "weratravelduet"}, {"Content": "Loved the Kraft My husband and I stayed at the Kraft for five nights in May, our first stop on our two week trip to Italy. We chose the Kraft after doing extensive internet research, and we were not disappointed. We booked a double superior room, and requested a balcony, which we did receive. Our room was a good size and comfortable, nice furnishings, facing the main street. We found it to be a very quiet street, and in general, a quiet neighborhood. The bathroom also was a good size, with lots of counterspace. There were extra blankets and pillows in the closet which we made use of. The bed was pretty hard, but so were all the beds in hotels we stayed at in Italy, so not an issue. We did occassionally hear guests in the room above us, but it wasn't intrusive. The balcony had a small table and chairs, perfect for enjoying the beautiful weather with a glass of wine. The hotel is located in the Ognissanti area, near the Arno, and we were able to walk everywhere from the Uffizi to the Duomo and everywhere else with no trouble at all. Ognissanti is a quieter district from the tourist crowds and has several good restaurants in close distance. What really made our stay at the Kraft so nice was the excellent service. The front desk staff were so helpful and accommodating to all of our needs, genuine and friendly, as were all the staff we encountered. The breakfast was excellent, with a good assortment of meats, cheeses, breads, pastries, yogurt, cereal, juices, fruit. The large rooftop bar was a great way to relax after a day of sight seeing. We went to the hotel restaurant on our first night there, an excellent way to begin our vacation, and had one of our best meals (4 course Tuscan style chef's choice w/wine pairings). Thanks to Jonathan, the excellent restaurant manager for his attentive service; he also recommended a terrific restaurant for our anniversary. There also is a small rooftop pool and area for sun bathing. I loved Florence and the Kraft made a good home base. I would stay at the Kraft again, and at their other locations in the future. A hip lounge bar in the area recommended by the front desk is Universo Sanchez. Hint: Make reservations for the Uffizi as far in advance as possible.[Other hotels we stayed at in Italy: Venice - Hotel Bisanzo, Rome - Hotel San Francesco, Rome - Hotel Exedra]", "Date": "Jun 12, 2005", "ReviewID": "UR691988657", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "cstar11"}, {"Content": "Kraft Work This hotels needs a lot of work to reach it's '4 star' rating. We chose this hotel because of the rooftop pool and it's '4 star' rating. We could not have been more disappointed if we tried. We had originally booked 3 nights but left after 1. We booked a 'superior room' that was reminiscent of a TV make-over show with poor stenciling, bad lighting, extremely basic bathroom facilities and worst of all paper-thin walls. We were woken at 1:30am by residents of the room next door and then again at 6:15am by the residents of the room above - hardly conducive to a relaxing weekend break. On a final note the staff were surly, bordering on rude. If you're used to proper 4 star accomodation and professional, friendly staff - avoid it like the plague!", "Date": "May 18, 2005", "ReviewID": "UR744155189", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Just what we wanted This hotel was exactly what myself and my boyfriend were looking for. Clean, comfortable and good value. It's a short walk (10/15 mins) from the main attractions but I thought the quiet location was part of the charm.Admittedly, the windows don't keep out a lot of noise so when the traffic gets going in the morning it can disturb you. Although not as much as the neighbours that we could hear through the adjoining door at 7.30 both mornings, but to be fair, they were very loud people and it wasn't the hotel's fault!The bathroom was a good size, excellent shower. The room was light and airy, with a beautiful fresco painted on the wall. The balcony was quite sweet too. The reception staff were very friendly and helpful.I would definitely recommend this hotel to anyone who doesn't mind a bit of walking.", "Date": "May 11, 2005", "ReviewID": "UR356671055", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Very good small hotel My husband, teenage son, and I stayed in the Kraft Hotel in March of 2005. We had a very spacious room with a view of the street below. The room and very large bathroom were extremely clean. The breakfast which was provided was excellent and the breakfast room was very large and welcoming. This hotel is about a 15 minute walk from the major museums and churches but that did not pose any problems, in fact it was nice to be able to leave the crowded piazzas behind for the night when we returned to the hotel. The staff at the hotel was very helpful and pleasant and the front desk staff spoke excellent English. I would highly recommend this hotel to anyone visiting Florence who is able to do the necessary walking. We would definatley return to this hotel again.", "Date": "Apr 6, 2005", "ReviewID": "UR641996016", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Thouroughly enjoyed our stay My wife  I stayed at the Hotel Kraft from 19th to 26th March 2005. The reception staff are very friendly, spoke good English and were helpful in getting some sightseeing booked.The room was traditional decor with wooden flooring, high ceilings and shuttered windows opening onto a small balcony. The bathroom was clean and fairly modern with a shower over the bath. Maid service was daily and the room/bathroom were kept spotless.The breakfast service is buffet style which is great if you are in a hurry to grab a quick coffee and a croissant befor heading of to the sights that Florence has to offer. Beware, the hotel bar is pretty pricy so don't go overboard! 11 Euros for a measure of single malt scotch whisky!There are a fair number of restaurants within 10 minutes walking distance. Try crossing the River Arno and heading to the Santo Spirito district.....I can particularly recommend eating at the Osteria Santo Spirito.", "Date": "Apr 5, 2005", "ReviewID": "UR238241112", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "Billowingflag"}, {"Content": "Noisy room My wife and I stayed 2 nights in this hotel and are both disapointed with the room which was noisy caused by the traffic outside and the movement of furniture from the floor above. The room was also very tiny. Our expectations were high because this hotel is classified as a 4 star but it is really 2-3 star. The bathroom was new but the bath would not accommodate a non-skinny person, show also available. Location is Ok just a short walk from the center. Breakfast up to 3 star standard. Staff ok but a bit indifferent. We will not stay there again because their website is misleading (4 stars and soundproofed rooms)", "Date": "Mar 28, 2005", "ReviewID": "UR132575118", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "peterstravels"}, {"Content": "Wedding in Italy I had a small wedding in Florence, Italy in September 2004. My mother, mother-in-law, father, husband, and I stayed at this hotel for a week. We absolutely loved it. The staff was very helpful. Breakfast was great! The location was the best! I liked walking from the hotel to the main part of the city because I was able to see so much more and buy more items that were not overly commercial (eg, hats, t-shirts, postcards, etc).   The rooftop terrace is the best part of the hotel. The view and the breeze was excellent. For several nights, my family and I sat in the terrace and sipped elegant chianti and moscato di asti in the tuscany sun. I can't wait to go back.", "Date": "Feb 8, 2005", "ReviewID": "UR211709661", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "1Rabbit"}, {"Content": "Don't stay here, not worth it. I would not recomend this hotel. It is very shabby and run down. The bathroom was outdated and the shower was terrible. The tub was about 1 foot wide, which made showers almost impossible. Towels were very thin.It is about a 15 minute walk from the center of town. Florence is such a walkable city, so there is no reason to stay so far from everything. We spent our days walking from site to site, which was tiring enough, and the we would have to walk the 15 back to the hotel! Stay somewhere else, there are plenty of hotels in Florence, don't stay here. We would definitely not stay here again.", "Date": "Nov 20, 2004", "ReviewID": "UR676481557", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "DG0217"}, {"Content": "Pleasant hotel, handy location We spent 3 pleasant nights in this hotel. Situated near the river, the hotel is walking distance from the station, even with suitcases. There are plenty of restaurants within near the hotel and we didn't need to get any public transport when out and about.The room was large and airy with high ceilings and shuttered windows. Whilst the Kraft lacks the polish of new build large hotels, the character more than makes up for this.The staff in reception were very welcoming  friendly and the breakfasts were nice.We would recommend this hotel to friends and would definitely stay there again if we returned to Florence.", "Date": "Nov 13, 2004", "ReviewID": "UR610649031", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Good Hotel, Quiet  Just spent 4 nights here. All that you could want. Rooms Quiet  Clean. Staff friendly. Yes it is 15-20 walk from center but there are many routes to take and see a slightly quieter bit of Florence away from the bustling middle. Buffet breakfast was excellent and there are many restaurants within 5-10 mins walk on both sides of the river. I'd certain stay here again.If you are going to the main museums - book in advance. The queue on the day we went was 3 hours.Take time out to go to Sienne (1 hour by bus- forget the train). Tuscany without the motorbikes. Something really special.", "Date": "Oct 26, 2004", "ReviewID": "UR704194330", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "Only_the_truth"}, {"Content": "Good Old Cockney Knees Up   showReview(2780334, 'full');", "Date": "Oct 23, 2004", "ReviewID": "UR808382302", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "JD"}, {"Content": "Fun in Florence   showReview(2757847, 'full');", "Date": "Oct 19, 2004", "ReviewID": "UR792002821", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "judOxford_Michigan"}, {"Content": "The Kraft was great!   showReview(2606318, 'full');", "Date": "Sep 28, 2004", "ReviewID": "UR114462970", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Lolafromsocal"}, {"Content": "Attractive hotel, impolite staff   showReview(2462557, 'full');", "Date": "Aug 19, 2004", "ReviewID": "UR219416622", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "islandbren"}, {"Content": "Great Stay!   showReview(2328924, 'full');", "Date": "Jul 28, 2004", "ReviewID": "UR527501607", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Single Traveller   showReview(2314743, 'full');", "Date": "Jul 22, 2004", "ReviewID": "UR140114403", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Good Choice   showReview(1756878, 'full');", "Date": "Mar 30, 2004", "ReviewID": "UR387081645", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Excellent hotel if you don't mind walking   showReview(1278277, 'full');", "Date": "Sep 10, 2003", "ReviewID": "UR435949402", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "The Kraft excels   showReview(1272801, 'full');", "Date": "Sep 3, 2003", "ReviewID": "UR426815781", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "Nelehenworb"}, {"Content": "Great Hotel!!   showReview(1263154, 'full');", "Date": "Aug 28, 2003", "ReviewID": "UR578289787", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Corina1231"}, {"Content": "hotel tres sympa   showReview(22690520, 'full');", "Date": "Dec 13, 2008", "ReviewID": "UR349847409", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "lunevilleNormandie"}, {"Content": "No lo recomiendo   showReview(22277121, 'full');", "Date": "Nov 28, 2008", "ReviewID": "UR987343990", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1", "Value": "2", "Rooms": "3", "Location": "1"}, "Author": "Tinkerbell019"}, {"Content": "Vergonzoso. Cancelaron nuestra reserva sin previo aviso   showReview(20984136, 'full');", "Date": "Oct 18, 2008", "ReviewID": "UR715490114", "Ratings": {"Service": "1", "Business service": "3", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "2", "Location": "3"}, "Author": "viajera2008Spain"}, {"Content": "Bel hotel   showReview(20803572, 'full');", "Date": "Oct 11, 2008", "ReviewID": "UR605425692", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "rhymdunet"}, {"Content": "Un bon choix   showReview(20552615, 'full');", "Date": "Sep 14, 2008", "ReviewID": "UR826004644", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Accueil en Fran莽ais, chambre au...   showReview(20387288, 'full');", "Date": "Sep 7, 2008", "ReviewID": "UR298114115", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "瑭曞垽銇汇仼銇€傘€傘€?#x201d;   showReview(20752599, 'full');", "Date": "Sep 5, 2008", "ReviewID": "UR452165919", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "灏戙仐閬犮亜銇屻偖銉偖銉緬姝╁湉   showReview(19762760, 'full');", "Date": "Sep 4, 2008", "ReviewID": "UR979038263", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "3"}, "Author": "KayJay08"}, {"Content": "un tres bel hotel   showReview(20552614, 'full');", "Date": "Sep 2, 2008", "ReviewID": "UR154918499", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Un peu d茅莽u   showReview(19636093, 'full');", "Date": "Aug 29, 2008", "ReviewID": "UR113816765", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "2", "Location": "-1"}, "Author": "lass="}, {"Content": "Tr猫s bonne prestation   showReview(19636091, 'full');", "Date": "Aug 11, 2008", "ReviewID": "UR614967948", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Parfait   showReview(19636090, 'full');", "Date": "Aug 7, 2008", "ReviewID": "UR414764966", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "vista mozzafiato piscina bella ma da rinfrescare   showReview(18532422, 'full');", "Date": "Jul 18, 2008", "ReviewID": "UR376718032", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "灏戙仐閬犮亜銇戙仼銆侀潤銇嬨仹銇?#x201d;   showReview(19171888, 'full');", "Date": "Jun 17, 2008", "ReviewID": "UR860769128", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "hotel correct   showReview(17437571, 'full');", "Date": "Jun 15, 2008", "ReviewID": "UR545565104", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "hotel exceptionnel   showReview(16590515, 'full');", "Date": "May 18, 2008", "ReviewID": "UR483797150", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Solides Hotel   showReview(16590503, 'full');", "Date": "May 8, 2008", "ReviewID": "UR463704301", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "posizione tranquilla e non molto lontana dal centro storico   showReview(16590501, 'full');", "Date": "May 8, 2008", "ReviewID": "UR124440393", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "bon sejour   showReview(15567466, 'full');", "Date": "Apr 25, 2008", "ReviewID": "UR232248561", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Gerne wieder   showReview(15567468, 'full');", "Date": "Apr 24, 2008", "ReviewID": "UR951014421", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "nous en parlons autour de nous et y reviendrons des que possible   showReview(15567464, 'full');", "Date": "Apr 22, 2008", "ReviewID": "UR579806468", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Praticamente perfetto   showReview(15567469, 'full');", "Date": "Apr 21, 2008", "ReviewID": "UR139103582", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "L'h么tel est bien mais pas eu de chance   showReview(15567467, 'full');", "Date": "Apr 11, 2008", "ReviewID": "UR547504534", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "alles bestens   showReview(15567460, 'full');", "Date": "Apr 1, 2008", "ReviewID": "UR338978639", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Nicht empfehlenswert   showReview(15567459, 'full');", "Date": "Apr 1, 2008", "ReviewID": "UR399111083", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "2", "Location": "-1"}, "Author": "lass="}, {"Content": "bien situ茅 - rapport qualit茅 prix correct   showReview(14734071, 'full');", "Date": "Mar 11, 2008", "ReviewID": "UR416960655", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "la chambre a une d茅co un peu ancienne mais la terrasse est un plus   showReview(14734072, 'full');", "Date": "Mar 10, 2008", "ReviewID": "UR120003855", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Hotel Kraft   showReview(14734069, 'full');", "Date": "Mar 10, 2008", "ReviewID": "UR260297669", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "2", "Location": "-1"}, "Author": "lass="}, {"Content": "蹇仼銇儧銉嗐儷銇с仚   showReview(19169101, 'full');", "Date": "Feb 29, 2008", "ReviewID": "UR594203366", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "鎵嬮仌銇?#x201d;   showReview(19166587, 'full');", "Date": "Nov 24, 2007", "ReviewID": "UR462655350", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Bon h么tel   showReview(11307682, 'full');", "Date": "Nov 5, 2007", "ReviewID": "UR194132975", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "gerne wieder   showReview(11666364, 'full');", "Date": "Oct 17, 2007", "ReviewID": "UR793224649", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "mantiene le promesse   showReview(11666362, 'full');", "Date": "Oct 4, 2007", "ReviewID": "UR937752327", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "assez bon hotel   showReview(11666363, 'full');", "Date": "Sep 22, 2007", "ReviewID": "UR923366806", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Bruyant       balcon", "Date": "Sep 7, 2007", "ReviewID": "UR822936799", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "3"}, "Author": "famille64"}, {"Content": "Lage gut, ansonsten na ja...   showReview(11443559, 'full');", "Date": "Aug 10, 2007", "ReviewID": "UR353637874", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "PARFAIT !!!!   showReview(11443558, 'full');", "Date": "Aug 3, 2007", "ReviewID": "UR335348375", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Durchschnitt, aber mit Pool.   showReview(11443556, 'full');", "Date": "Aug 2, 2007", "ReviewID": "UR926095929", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "2", "Location": "-1"}, "Author": "lass="}, {"Content": "Il tipico 4 stelle italiano: in...   showReview(11409292, 'full');", "Date": "Feb 26, 2007", "ReviewID": "UR293447282", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Le camere non molto spaziose,ma...   showReview(11409293, 'full');", "Date": "Feb 15, 2007", "ReviewID": "UR147337108", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "bonne prestation   showReview(11386298, 'full');", "Date": "Jan 9, 2007", "ReviewID": "UR715569010", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "ci torneremo   showReview(11386297, 'full');", "Date": "Jan 6, 2007", "ReviewID": "UR140709316", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "銈儵銉曘儓銉涖儐銉?#x201d;   showReview(19159564, 'full');", "Date": "Dec 1, 2006", "ReviewID": "UR492759420", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "鐔熺潯銇с亶銇俱仚   showReview(19159417, 'full');", "Date": "Nov 13, 2006", "ReviewID": "UR969174840", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Tr猫s bon h么tel   showReview(5963452, 'full');", "Date": "Oct 17, 2006", "ReviewID": "UR646640678", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "sylbij"}, {"Content": "gerne wieder   showReview(11347778, 'full');", "Date": "Sep 20, 2006", "ReviewID": "UR274728606", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "ho么tel a recommander   showReview(11338518, 'full');", "Date": "Aug 24, 2006", "ReviewID": "UR461997213", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Une piscine sur les toits de Florence !   showReview(11347777, 'full');", "Date": "Aug 18, 2006", "ReviewID": "UR381240266", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Tr猫s bon h么tel proche du centre (脿 pied)   showReview(11347776, 'full');", "Date": "Aug 16, 2006", "ReviewID": "UR486792189", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "闆昏粖銇хЩ鍕曘仚銈嬨伀銇究鍒?#x201d;   showReview(19156468, 'full');", "Date": "Jan 18, 2006", "ReviewID": "UR122212419", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Ottimo albergo vicino al centro...   showReview(11409294, 'full');", "Date": "Dec 17, 2005", "ReviewID": "UR413471216", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "La collocazione 猫 favorevole...   showReview(11409295, 'full');", "Date": "Jul 31, 2005", "ReviewID": "UR887171730", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "lass="}, {"Content": "銇婂嫥銈併仹銇欍€?#x201d;   showReview(19930007, 'full');", "Date": "May 14, 2005", "ReviewID": "UR103299675", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "銈儠銈枫兗銈恒兂銇犮仯銇熴仜...   showReview(19925579, 'full');", "Date": "Feb 29, 2004", "ReviewID": "UR164450356", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "瑕冲厜銇腑蹇冨湴銇嬨倝銇?..   showReview(19921665, 'full');", "Date": "Sep 25, 2003", "ReviewID": "UR661001263", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銇撱仭銈夈伄浣撻〒璜囥倰鎷濊...   showReview(19917218, 'full');", "Date": "Feb 20, 2003", "ReviewID": "UR183740727", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "绉併伅銇撱伄銉涖儐銉伀锛撴硦...   showReview(19916848, 'full');", "Date": "Feb 4, 2003", "ReviewID": "UR368318844", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}, {"Content": "銈点兂銈裤優銉偄銉庛兇銈с儍...   showReview(19916612, 'full');", "Date": "Jan 24, 2003", "ReviewID": "UR711727305", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "0", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d228926-r20527172-Kraft_Hotel-Florence_Tuscany.html", "HotelID": "228926", "Price": "$260"}}