{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Great location, comfortable”", "Author": "LaineyLa", "ReviewID": "UR126987214", "Content": "Hotel Montreal is a little worn around the edges but in a great location - close to the main train station and to the metro. Our room was quite, beds were comfortable. The breakfast was adequate. Only complaint is that there was a slow leak somewhere in the bathroom and so the floor was always a bit wet. Great price - would stay here again.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lisbon", "Title": "“Simple, Economical, They Remember You - Stayed 4 Years in a Row”", "Author": "WoltersWorld", "ReviewID": "UR126767274", "Content": "My wife and I have stayed at Montreal Hotel four years in a row, by ourselves and with our two small children. The front desk has remembered us every year and it is kind of a tradition for us to stay there. The rooms are fine for Rome standards, breakfast is fine as well. It is nothing super spectacular, but we really like the front desk guys as they are always great to us and our kids. It is relatively near the Termini Station (rail) so it is easy to get to, though not a lot of restaurants close by. Recommend it for couples who want to see the city but not spend a lot of money.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Wuxi, China", "Title": "“Cosy and quaint in central Rome”", "Author": "MalRiley", "ReviewID": "UR124947690", "Content": "Good location, small quaint and quiet inward facing room. Inclusive breakfast was a little light, very 'continental'. It's an old hotel, not recently decorated but the price and position will ensure we return.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Poulsbo", "Title": "“A few blocks from the Termini train station and the Staff is great!”", "Author": "amoreitaliaPoulsbo", "ReviewID": "UR124128780", "Content": "We stayed at Hotel Montreal three nights at the beginning and at the end of our trip in Italy. Both rooms were excellent. We enjoyed the buffet breakfast with our pot of coffee each morning. The hotel staff were friendly and very helpful. The location is perfect with a trattoria nearby for dinner. We will stay here again next time!", "Date": "February 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Mt Prospect, IL", "Title": "“Great Central Location, Very Friendly Welcome and Staff, Decent Rooms”", "Author": "FSYMP", "ReviewID": "UR121099028", "Content": "The Termini area is within 20-30 mins by foot to most major sites. The Hotel is 5 mins away by foot from the Termini bus hub and Metro stop. The rooms are on the smaller side but functional. They serve good Italian coffee at breakfast which goes a little beyond coffee and cornettos (pastries). It provides a computer to guests and offers excellent WiFi. In 2011, it is offering great off-season rates. In summary it was for us a great value for Rome.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "San Diego, California", "Title": "“Reasonable experience, but not a stand out either way.”", "Author": "ww6721", "ReviewID": "UR120208138", "Content": "We didn't have any major issues. The staff was friendly and helpful. Our double room on upper floors was reasonably nice and clean, except there was some mildew in the tile grout in the shower. The breakfast was ok too, but nothing fancy. The AC had a fixed setting and a slight musty smell, but not too bad. We would have preferred to open the window, but there were mosquitos outside. Overall, I think it was reasonable for around 100 euro/night.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sault Ste. Marie, Canada", "Title": "“Nothing special”", "Author": "susan s", "ReviewID": "UR119873108", "Content": "The desk staff were fantastic. The location left something to be desired and our room was rather small. The bathroom and the bed were clean, but the room could have used a good wall scrubbing.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Convenient for a night but uninspiring”", "Author": "eleanoran", "ReviewID": "UR119643263", "Content": "I booked the Montreal for its closeness to Termini, since this trip we had only one evening in Rome before a transatlantic flight and I wanted to be able to walk to and from the station. It is close, and the room we had was clean, so for a place just to sleep it was ok. Breakfast similarly was adequate. I can't imagine making it a base for exploring Rome, though. Too dark, no atmosphere (though the desk clerks were polite), and the wifi didn't work at all while we were there. Overall a disappointment.", "Date": "October 23, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Naples, Italy", "Title": "“Don't accept rooms on bottom floors”", "Author": "nellalucedelsole", "ReviewID": "UR118087633", "Content": "Booked into this place after other bad hotel experience. We booked the room at the (free) hotel booking service at Termini station which gets you cheaper prices. When we arrived the guy showed us a small room on the first floor, which we refused. He then offered us for the same price a much larger room on the third floor which we took. You had to sleep with earplugs because it is on a main road, but other than that we were happy. Biggish room, clean bathroom, air conditioning. The breakfast is pretty awful after a few days, although they do have good home made cake each morning. Overall, I was happy with this hotel, especially compared to others I have stayed in in Rome for similar prices or more.", "Date": "September 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great little hotel in a fabulous location, great service and fantastic value!”", "Author": "Galadrielk", "ReviewID": "UR117911294", "Content": "We are just spending our last night in the Hotel Montreal before moving to a 5 star hotel with a group tour. We are extremely sad to be leaving. We picked this hotel based on Tripadvisor reviews, location and cost. Everything has been great. Our room was super clean with a view of Santa Maria Maggiore. The beds were comfortable with extra pillows and blankets. The service was very personable and accommodating. You would not go wrong with this hotel. It is very traditional and we could not recommend it more highly.", "Date": "September 10, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "USA", "Title": "“Bad experince..Dark room, AC not working properly,Recepion staffs very not all friendly...”", "Author": "Snekan", "ReviewID": "UR117904633", "Content": "I stayed in this hotel few weeks back, First ..this hotel is not close to terrmi station...you have to walk atlest 10-12 mins to reach this hotel, the metro close to this hotel is closed currently due to some rennovation. Reception staff were not friendly and helpful...I was waiting for more than hour to check-in though i reached after the time mentioned in my booking..but I noticed they are giving preference to few people.The room was too dark...no option to open window and some bad smell..got some room refreshner ...AC in my room was not working most of the time and everytime i have to fix myself by adjusting it manually...Breakfast is very simple , but not bad..This hotel does not deservere 3 star rating.. .I would not recommendthis hotel...Pls stay away..", "Date": "September 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Nice hotel”", "Author": "Giagkidis", "ReviewID": "UR117752083", "Content": "Excellent location for discovering Rome, very friendly and kind staff, very clean but the breakfast was below par. I do recommend it though.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Split, Croatia", "Title": "“Good hotel..”", "Author": "ILoveToLove", "ReviewID": "UR115953953", "Content": "We stayed there in march. The room was small but very clean with a great view on St. Maria Maggiore Church. Breakfast is very good if you wake up early. Later the choice of food is very poor. Location is very good-near the metro station.. Stuff was good, nothing special. You need to pay for internet and it was really slow. Overall - Very good hotel for the price we paid..", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Gainesville, Florida", "Title": "“Good place overall.”", "Author": "JeanClaudeandSophi", "ReviewID": "UR115133490", "Content": "This was a good place. I especially like that they offer small fridges, this helps you save money by buying groceries etc. Our room was very clean. The breakfast and coffee was terrible. Especially the coffee, (not like normal and wonderful Italian coffee) was rancid.The location for us was a bit farther away from all the major sites. Because of the location we probably wouldn't stay here again. Also the manager likes to tape the AC remote shut so you can't adjust your own temperature (not cool), but I just ripped open the tape every day and adjusted the temp (it was hot) to our liking. I paid for AC, I'm going to use it.", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Will stay here again!”", "Author": "KirstyB23", "ReviewID": "UR114819788", "Content": "We both thought this hotel was everything you need for a short stay in Rome. Clean rooms with air conditioning, polite and very helpful staff (gave us a lots of information on Rome when we checked in), great location (5 mins walk from Termini Station), breakfast was basic but fine, and inexpensive. We want to come back to Rome next year and we will definitely stay here again.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Budget price, budget hotel”", "Author": "ahsbooks", "ReviewID": "UR114675579", "Content": "We stayed here for a couple of nights after our cruise of the Med. We wanted something that was relatively inexpensive and that is what we found here. The staff was very nice and helpful. The AC worked great and the room was a decent size. We had an inside courtyard room, so it was very quiet. The only problem with it was that it had a musty smell and we weren't quite sure why (maybe it was the age of the building?). We didn't spend a ton of time there though, so just had to put up with the mustiness when we slept. It had a good location about 10 minutes walking time from the Coliseum. If you are picky about hotels, this probably isn't the place for you. If you want something inexpensive in Rome (which isn't easy to do) and plan on being away from your hotel room most of the time, then give it a try.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Denwood", "Title": "“\"Very courteous and well priced\"”", "Author": "ramsayj01", "ReviewID": "UR111186220", "Content": "Stayed a couple of days. The owner was extremely helpful. Room was clean and nice bathroom was large. Nice breakfast nook and place to have a drink. Very good price. Would recommend as a great location as it close to the main station for trains buses and subway.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Spokane, Washington", "Title": "“Very disappointed.”", "Author": "lindahagenmiller", "ReviewID": "UR107432364", "Content": "This hotel was recommended by Rick Steves. Location--close to train station, metro and the Colosseum--was good, but it didn't make up for the hotel's rundown condition, dark room, lack of air conditioning (management turns it on and off), minimal breakfast, horrible bed and general creepy feeling. We'd been in Italy for 3 weeks and had had wonderful hotel experiences throughout until Rome. After one night, we moved to the Hotel Mondial about a quarter of a mile away where we got a room for about 10 Euro more with a AAA discount. The difference was night and day.", "Date": "May 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Moscow, Russia", "Title": "“Noise!”", "Author": "Jul_kl", "ReviewID": "UR98124238", "Content": "Budget stay for Rome. Advantages: close to Termini, heating control in the room (actual for winter), not so small rooms, reasonable price. Disadvantages: noise - you'll hear everything in the street and in the corridor. Windows and doors are so weak, that you can hear the breathing of your neighbors in the corridor and steps in the street. If you decide to book this hotel ask for the room with window to the backyard - in this case you'll enjoy only the sounds of your neighbors. There are not so important minuses else: not enough light in the room and no shelf in the bathroom. I would rated this hotel normally, if it were not so noisy.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Mount Pocono, Pennsylvania", "Title": "“Don't believe these pictures!!!”", "Author": "Mitzi1938", "ReviewID": "UR91418082", "Content": "We visited Italy for three weeks and this was our final destination. Thank god it was our last place, because if it was our first place to have stayed we may have packed it up and gone home right then and there!! The rooms are small, slightly dirty, beds are less than comfortable, like sleeping on a board, bedding is old, walls had several small holes in them, not a great neighbor heed either. We were afraid to go out at night,very shady here. I would not recommend this hotel to anyone. Not only are the rooms not even close to what is advertised but when I went to the front desk to say something these people are crazy, they told me it was because it was \"staged\" for the photo shoot, now come on a bowl of fruit, some flowers, etc. Does not make a room look this different. I could not even go somewhere else because when I booked I did not read the fine print, if I had left at this time, they would still get my entire purchase price! Stay away!!! Trust me spend the extra thirty bucks or so For comfort and security!!!", "Date": "January 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Fredericton, New Brunswick", "Title": "“A Good Choice For Rome”", "Author": "Canam778", "ReviewID": "UR88584497", "Content": "This was our first trip to Rome. Hotel Montral had good reviews and a decent price so we gave it a whirl. We really found this centrally located hotel a great stay. Very helpful desk staff, clean rooms, and a nice breakfast to get you on your way for a day of sightseeing. The room was a bit small, but it's Europe. Half a block away is the Metro stop to get you most anywhere in Rome. It's far enough away from the Termini to get you into a nice neighbourhood. We felt safe at The Montreal Hotel as we returned late in the day. We would reccommend to budget conscience travellers looking for a base in Rome.", "Date": "November 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Long Beach, California", "Title": "“A jewel of a hotel--excellent service, location, and room decor”", "Author": "hugomom", "ReviewID": "UR85990432", "Content": "We were stranded in Rome in the rain because the hotel we booked thru Bookings, was non existent. In desperation we began calling hotels near the train station and given the time (approx. 8pm) all were booked. But Hotel Montreal had a dbl with a private bath. One of the owners, Pasquale, calmed us down, told us we were 5 minutes walking distance away, and gave us explicit directions. When we arrived, he was \"our angel\" and calmed us down some more, showed us their lovely facilities, told us not to worry about payment at the time, gave us a discount, and took out a map of Rome and proceeded to draw detailed directions (very clearly) to all the major sights. Everything was within a 15 minute walk. They served a fabulous breakfast, the garden was lovely, the location was fabulous. The room was lovely in all ways. Pasquale saved the day for us and redeemed our faith in humanity. He recommended restaurants also. Thanks to him, we had a wonderful time in Rome. In addition, he arranged for a taxi with a flat fee to pick us up at 4 am (yes!!) to make a 6:30 am flight. He advised us on the time. I can not recommend this hotel enough in all ways---cleaniness, charming, location, excellent service. Next trip to Rome and we will definitely stay there.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Clifton, Illinois", "Title": "“Excellent location: within walking distance of most of Rome's highlights”", "Author": "sjmtammen", "ReviewID": "UR85890225", "Content": "Easy to find; within blocks of Termini Train station; although a business hotel, gave great tourist information; paid for wifi, but was a good deal; free breakfast was decent.", "Date": "November 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Missouri", "Title": "“Perfect for the independent traveler.”", "Author": "GarnetMissouri", "ReviewID": "UR83703879", "Content": "We love staying in the Montreal. It is easy to walk to the Termini; it is one block from the Victor Emmanuel metro stop; and it is walking distance to many of the major sites. The staff are friendly and helpful and security is excellent. There are two Bancomats within 30 seconds of the front door. The breakfast is simple but tasty and filling. We have stayed two consecutive years and will likely return.", "Date": "October 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“Great location and service”", "Author": "Pinback", "ReviewID": "UR81124882", "Content": "Very convenient to train station, Metro and many tourist sites. Neighborhood seems safe. Front desk staff was very helpful with local information. Very nice breakfast buffet with a selection of cold meats, breads, and fruits. Room was quiet and the air conditioner worked. WiFi was 3 Euro for 3 hours and worked well in the room.", "Date": "September 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Montreal", "Title": "“Good Location, Quiet and Friendly”", "Author": "Flying-sunshine", "ReviewID": "UR79668281", "Content": "For my first time in Rome, I thought this hotel was perfect. Close to the train station, metro station and at a walking distance to many of the attractions in Rome. On a cute little street, with lots of restaurants and gelato places close by. The service was excellent. Friendly and helpful staff at the front desk, clean and nice rooms, good breakfast, it was all we could ask for! I will go back next time I'm in Rome.", "Date": "September 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Denver, Colorado", "Title": "“Good Hotel With Very Friendly Staff”", "Author": "JustSomeGuyDenver", "ReviewID": "UR77156409", "Content": "This review is late in coming but I wanted to share the great experience my fiance and I had at Hotel Montreal last year. This was my first visit to Rome and Hotel Montreal did not disappoint. I was not planning on spending much time at the hotel so we booked Hotel Montreal based on Rick Steves recommendations. We found it to be a good value with very friendly staff. We felt the walk from the Termini Station was a bit sketchy at night but overall not a terrible location. I would recommend this hotel to anyone visiting Rome.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Yalova, Turkey", "Title": "“It was beyond my expectations. A bit outdated but clean hotel and helpful personnel.”", "Author": "otuzkilo", "ReviewID": "UR74721791", "Content": "We stayed with my wife for 3 nights. Our room was quite small and its look was a bit outdated but i was already not expecting a superb room. I knew aproximately what i would get. Although it looked a bit old the room was qite clean, everything wprked very well, the bathroom was new and everything was perfect there as well. The personnel was very helpful and smiling.. The breakfast place was also very small but it was enough to start the day. There was everything for every type of people. Cereals, honey, milk/coffee/tea/orange juices, bread, cake, nutella, 3-4 kinds of cheeses and more. If you are looking for a cheap and nice hotel in the centre of rome and if you plan to spend your day mostly outside not in the room or hotel i would definitely suggest Montreal Hotel. 7-10 mins away from Colosseum, 100mt away from Santa Maria Maggiore church, 100mt away from metro station. I hope your trip with the help pf this hotel.", "Date": "August 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Wisconsin", "Title": "“Friendly, informative staff, near Termini / Santa Maria Maggorie”", "Author": "GianniSaint", "ReviewID": "UR71540550", "Content": "We were greeted by friendly staff who provided a map of the city and rough walking times. We enjoyed our stay at the Hotel Montreal. Four short blocks from the Termini, which includes the bus station and a Metro stop. Plus, the Hotel is two blocks from another Metro stop.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "baton rouge, la", "Title": "“Big City Service, Small Town Prices!”", "Author": "ccturtle_79", "ReviewID": "UR70983094", "Content": "I stayed only one evening in the Hotel Montreal, but I truly enjoyed my stay. The staff were all very helpful, from the desk clerks to the coffee guy. I was allowed early check-in (once my room was available after cleaning), and the accommodations were great. Large, full size bed in my room (I've been sleeping on a smaller than twin sized mattress since), view overlooking garden, but step outside and there is a lovely view or the St. Maria Maggiore Church. Very good location within city, close to termini and the Colosseum and Forum. Good restaurants near. Breakfast was good, though mostly pre-packaged. Best cup of coffee I have had in Italy, but Americans used to lighter coffee should ask for hot water to dilute it. Rooms very clean, with wireless internet access. Bathroom had shower stall, no bath, but water was warm and room was clean.", "Date": "July 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Martinville, Louisiana", "Title": "“Four star service at a three star price, great location”", "Author": "Springers", "ReviewID": "UR70080318", "Content": "I booked this hotel on the European Destinations website and it exceeded my expectations. The staff at this hotel treats you like guests in their home. At first I thought they could not possibly be genuine but I overheard someone stumble in off the streets with the dumbest questions imaginable and the staff was not only gracious but extremely helpful and way more patient than I would have been. They dole out great touring suggestions, restaurant recommendations, traveling advice and shopping tips with the enthusiasm of new hotel owners. We felt so at home here that we looked forward to unwinding in the courtyard after endless hours of walking the city sites. A friendly bellman takes your luggage upon arrival and shows you how to work the air conditioning and electrical components in the room. Although our room was on the front street, closing the window and turning on the a.c. provided ample quiet for sleeping. The window treatment and bed fabrics are particularly lovely. Bathrooms are outfitted with a corner shower, hair dryer and bidet. Two small and cozy breakfast rooms serve the usual European fare. The second room is a little cooler due to the hard working a.c. There’s a computer in the small room near the check-in desk available for a small fee. But the best part of this hotel is after traveling on long flights and arriving dog tired, getting there is a snap. From the baggage claim at the airport, follow the signs to the train. Take the Leonardo Express train to the Termini (main Rome Train Station). Make sure to purchase your tickets and validate them in the little machines behind the ticket ATMs. Upon arriving at Termini, take the Giovanni Giolitti exit on left. Cross the Via Giovanni Giolitti Street and continue 3 blocks. The hotel will be on your immediate left corner. Also the metro is one long block from the hotel and the trams run one street over, so getting around the city from here is a snap. In spite of this we did most of our touring on foot from here. We also enjoyed a couple of neighborhood authentic Italian Restaurants. Great food at great prices. This is a terrific hotel for the price but for me, the employees and the service made all the difference. I took some pictures, but the ones on the website are accurate.", "Date": "July 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Carroll, IA", "Title": "“Close and casual”", "Author": "DrJhn", "ReviewID": "UR69472325", "Content": "This small hotel was only a short four block walk to the Termini Station, where the trains buses and subways meet. They have a nice breakfast every morning, and the rooms are air conditioned, although we had trouble regulating it the first day in one of our two rooms. They have four steps up to an elevator, and a nice little courtyard. Internet was available for about 2 Euros for a half an hour, but only on their computer, no WiFi up and running and no plugging in your own laptop. We were close to plenty of outdoor restaurants. There was a bank cash machine just down the street. I would definitely stay here again if we come to Rome.", "Date": "July 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cambridge, Massachusetts", "Title": "“3-star room, 2-star breakfast & staff”", "Author": "spark02139", "ReviewID": "UR68421992", "Content": "Perhaps it's cause we went during the World Cup, but the staff were not helpful while we were there. The free breakfast was not very good and my worst cup of coffee in all of Italy. That being said, the room was spacious and clean. I wish they had internet available though.", "Date": "June 23, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Great Location but outdated and small accomadations!!!”", "Author": "cszlaien", "ReviewID": "UR67456481", "Content": "The hotel room was the smallest we had ever stayed in before. There really were no amenities to speak of and the hotel really needs updating. The breakfast consisted of pound cake, cereal, yogurt, bread and not the greatest of juice but the coffee was good. The positives are that it is really close to termini and we walked to the Colosseum from the hotel. I dont think I would recommend this hotel to any of my friends just because of the quality of the room. The sights we visited in Rome were the colloseum which was great and we got there at 9AM and it was not packed but by 10:30AM as we were leaving it was crowded. We also bought the Roma Pass which was really helpful to bypass lines and it was only 25E. We also did Vatican City which was nice and St. Peter's...be aware that on Wednesday's the Pope makes a speech so you cant get into the basilica until late afternoon so we went back the following day and that was worth it. We also climbed the duomo and be aware that it really is hard and narrow but worth it for the view of Rome. The Pantheon was great and a quick 20 min tour. The national museum for us was a bit boring. I found the gelato to be the best in Rome as well as the pizza. Def check out trastevere for dinner.", "Date": "June 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hillsborough, NC", "Title": "“Loved our stay. Great staff and location.”", "Author": "kjordan3", "ReviewID": "UR66767619", "Content": "We stayed twice during our trip in Italy and hope to stay again. When we decided to extend our stay, they were great at accommodating us. We recommended the hotel to everyone. The staff is great. Pasquale was great at recommending restaurants (one close by that we ate at three times) and options to maximize our site seeing in Rome. He along with the entire staff made our stay wonderful. Everyone was willing to answer our endless questions, since this was our first trip to Europe. They were even helpful in returning an item that we left behind. The location is great. We took the train in from the airport and walked just 3/4 blocks to the hotel. The metro was only a block away and we we able to walk to several major site seeing areas. Although we didn't get a change to use it, the hidden quart yard in the back was beautiful. The breakfast was really good. It's not your typical American breakfast, but it was definitely enough to get you through the morning. Plus the coffee was very good. At times the street was a little loud, but we just closed the window. There is a grocery at the end of the block and a mini fridge in the room, which we found to be very useful. There is also a safe in the room. There is a computer in the lobby area for public use for a small fee. FYI: From the train station, exit at the doors near the car rental. Once outside, cross the street and walk 3/4 blocks or so up to Via Carlo Alberto and the hotel will be to you left.", "Date": "June 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gilbert, Arizona", "Title": "“A Hotel with a Great Staff !!!!!”", "Author": "azgirl528", "ReviewID": "UR66645329", "Content": "After a lot of looking we chose the Hotel Montreal based on a \"Rick Steves'\" suggestion. The hotel had a great location, 3 blocks from the Termini and 1 block from the Metro. The room and bathroom were a good size and very clean. With a Rick Steves discount we got the room for 100 euro. The hotel staff deserves a special \"High Five\" and thank you. They went over and above to make our stay a special one. From breakfast in the morning, though it wasn't a fancy breakfast, Mamu made it special. He was very conscientious when serving us (a group of 6) every morning. On our last morning there he had breakfast ready for us even though it was earlier than it was normally served. The front desk staff was very helpful from check-in to check-out. Pinto was always helpful with any questions. But a special Thank You goes to Pasquale. He made our stay outstanding. From recommending places to eat (which were always great) to sharing stories and having a night cap with us everynight. They also got us a cab big enough to hold 6 people with 6 big suitcases to go to the airport for only 70 euro. A BIG thank you goes to our maid. We had left our vault in our room open one day and when she saw it, she immediately locked it and brought the key to the front desk. It's a comforting feeling to know that there are honest people out there. Cudo's to mangement for having such a great staff. We will always be know as \"Room 108\". We felt very secure at the hotel, you had to be buzzed in to get to your rooms. We would highly recommend Hotel Montreal, they made our stay in Rome so much more enjoyable. \" Thank you Pasquale\"..", "Date": "June 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Very nice, clean & safe hotel.”", "Author": "56003Traveler", "ReviewID": "UR66235500", "Content": "Second stay (first in 2006) & again we were very pleased with the hotel. We traveled with another couple & their first stay & they were very pleased also. It is a small hotel & access to attractions is very easy. It is close to the central termini station & easy to get to from the airport. Breakfast dining area very nice & clean & small patio outside is very nice.", "Date": "June 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "California", "Title": "“Near Termini Station”", "Author": "RayPays", "ReviewID": "UR65935469", "Content": "This hotel provided good basic services. The front desk was very friendly and helpful. The rooms are nothing special but are clean and basic. If price is your major consideration then you cant be that picky. We stayed only our first night after arriving in Rome as we were traveling on the next day. When we came back through Rome on our way out we stayed at another hotel for no other reason than variety. It cost about $30E more per night and was also an older facility but had better bedding and was in a quieter location. The street noise from the Montreal cana be somewhat annoying from the street side rooms. Another in our party did not face the street and had no noise at all.", "Date": "May 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Copenhagen", "Title": "“Great hotel, lousy breakfast”", "Author": "EldritchDk", "ReviewID": "UR65258366", "Content": "Very nice and friendly staff. The rooms er clean and nice. Bathroom is also nice though the shower cabin door is very small so only small/average size people kan use the shower withouth trouble entering the shower. There is a lot of noise from the street så you have to sleep with the windows closed. God that there is a aircondition in almost every room. Now to the bad part. The room fare includes breakfast but this is really really bad. The bread are not fresh all are wrapped in plastic except 1 bun which tastes as if it is from yesterday. But there is all you can eat. No chease fro the bread though. A guy is running about and serving coffee and tea. My advice to Montreal is to make it a breakfast buffet instead, Drop the plastic wrapped bread and maybe introduce some eggs and other kind af food. Let people get their own coffe in an dispener for this. But all in all a very nice place to stay and I certainly would recommend it for others. Its only about 10-12 minutes walk from the colloseum so where central indeed.", "Date": "May 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fort Collins, CO", "Title": "“Good Value, Good Location”", "Author": "smccreary", "ReviewID": "UR63136927", "Content": "This is a good hotel for budget conscious travelers who will accept a clean room with no frills. Our room was next to the street and a bit noisy, but it's location just steps from the Vittorio metro stop made up for that. Front desk staff was very friendly and helpful. If you book here, request better instructions from the train station than what we got \"follow the signs to Santa Maria Maggiore\". We got very lost, but found some help on the street to get re-directed.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "portugal", "Title": "“Average but expected better...”", "Author": "joanainha22147", "ReviewID": "UR60411222", "Content": "We booked this hotel after reading several reviews, but now we realize that we could have booked a better hotel for the same price. The hotel is very close to Rome Termini and that was exactly what we wanted. The location is really good and we were able to walk to the major attractions in Rome. When we arrived, the hotel owner who received us was really friendly and helpful. The room was ok, but the bathroom needed to be remodeled. Everything was clean and we had a lovely view to Santa Maria Maggiore from our room window. But the window was at the same time a bad thing, because at night the traffic was so intense that we had some difficulty to sleep. The only low point was the breakfast. We usually don't really care about it, as long as it's eatable and clean. But we were really disappointed with this one, as we had to beg the rude breakfast staff for a little milk and coffee. The tables weren't clean from the previous guests and had a bread basket with a croissant wrapped in plastic, some breads and toasts that probably were touched by the person before us. It was really poor and after the second day we decided to skip breakfast at the hotel and take it somewhere else. Except this, we enjoyed our stay, but next time I think we won't go back and try something else.", "Date": "April 5, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Nicosia", "Title": "“Good location, old hotel”", "Author": "vkyriakos", "ReviewID": "UR59789520", "Content": "The hotel is close to the termini which is convenient.The hotel is quite old. The breakfast is below average and the hotel generally at most average. I would recommend the hotel if you are looking for something relatively cheap in the city centre.", "Date": "March 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ottawa", "Title": "“Thank You for another great stay . . .”", "Author": "OttawaOceans8", "ReviewID": "UR59140094", "Content": "The hustle and bustle of Rome requires you to have a quiet oasis you can slip away to. This is the Hotel Montreal in Rome. Located near Santa Maria Maggiore, it is near enough to the major sites of Rome (and the train station), yet far enough to allow you to enjoy the local neighbourhood. The owners are found in the hotel each day and can resolve any issues you may have immediately. Heck, they'll even pour you a drink at the bar!! It's that little extra touch that keeps me coming back. Thanks for another great visit.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Burbank, Washington", "Title": "“Great location and staff.”", "Author": "lovetogo1950", "ReviewID": "UR57426978", "Content": "We stayed four days and it was great. The reception staff was friendly and very helpful. The price was reasonable. We were a short two blocks to the subway that we used often and about 4 blocks from the main train station, Termini. There were a couple of little quick mart-type stores down the street for snacks and beverages. Breakfast was included and very satisfying before heading out to see the sights. The bath had a nice shower with plenty of hot water and pressure. We had a courtyard room and it was quiet. A computer with fast internet was available for 2 euro for 30 min. We used it twice and it was very convenient.", "Date": "March 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Ponte Vedra Beach, Florida", "Title": "“Very good hotel with a great location!”", "Author": "CruisinCherie", "ReviewID": "UR49708034", "Content": "We stayed at this hotel for 3 nights in mid-Oct. prior to our cruise. We were extremely happy with this hotel. The room was very clean, the bed was quite comfortable. Our room faced the street, but if there was noise, we simply closed the window & shutters and it was very quiet. The breakfast was adequate...juice, coffee, pastries, cheese....and yes, the crazy yogurt machine ( we declined). But the rate was reasonable (110 Euros booked through Rick Steves). The location was perfect. We walked to Termini with four heavy bags and it only took us about 10 minutes. Many restaurants nearby, AND a great grocery store about a block away (SMA). We looked out at the Santa Maria Maggiore from our window, and there was a cute outdoor cafe right across the street. Everyone at the front desk was extremely helpful, spoke excellent English, and were very polite. The only caveat is that the shower enclosure was quite small...particulary for us \"healthy\" Americans. I would definitely recommend this hotel!", "Date": "November 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Sacramento, California", "Title": "“Great Value and Good Choice”", "Author": "droraback", "ReviewID": "UR49122121", "Content": "Hotel Montreal is a good choice for a safe sturdy hotel within walking distance to the Termini (Rome’s central train and metro station). The afternoon desk clerk was super helpful. He told us what to see and how to see it. He gave us some good advice, which made a big difference. The place locks down at night and the hotel staff keeps tight control on who comes and goes. A big plus for us is that their English was really good. The room and bathroom were very small and the beds could have been softer. For the amount of time we were at the hotel, it was fine. If you are looking for upscale high-end accommodations, Hotel Montreal is not the place for you. If you a looking for a clean and safe place to sleep while touring the Roman capital, then I would recommend the Hotel Montreal.", "Date": "November 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "JOPLIN, MISSOURI", "Title": "“Beautiful courtyard”", "Author": "MOTRAVELERJoplin", "ReviewID": "UR48728274", "Content": "After travelling to 9 countries in 18 days, our last night in Rome at the Hotel Montreal was a pleasant treat. Front desk staff very friendly, helpful and courteous, especially the night time gentleman. He was very helpful in pointing us in the right direction and recommended an excellent pizza restaurant within a about 15 minutes walk from the hotel. Room we had was quite large by European standards, clean and comfortable. The especially nice feature was the large outdoor shaded patio with several tables and an excellent to relax and enjoy a bottle of wine after a LONG day of sightseeing. Breakfast was adequate but as in other reviews, it was mostly prepackaged pastries which were only mediocre~~would have much preferred a good croissant from a local bakery. Hot chocolate was very good and made to order; yogurt was in a yogurt-making machine and very liquid and sour tasting (may be a local thing) but would've preferred the carton variety; hotel was very accommodating in getting a cab which would accommodate us 4 travelers on the morning of our flight and we were charged 40E which was cheaper per person and much faster than taking the train to the airport. A hotel we would definitely recommend~~price was very low for Rome (115E)", "Date": "November 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "California", "Title": "“Exceeded expectations and put our first European trip at ease”", "Author": "TheRabidRepublican", "ReviewID": "UR46943178", "Content": "Being our first trip to Europe, my wife and I were most apprehensive about our accomodations for 2 nights in Rome before we boared our cruise ship. Found this hotel through Rick Steves, and couldn't have been happier. A polite and helpful staff, excellent location, great little room (It is Europe, had AC too), decent breakfast to start the day (Saved some Euros here), great security, within walking distance of major sites (Antiquity), transportation (Metro and Termini), and great dining. Worked very hard to keep graffiti at bay. Would stay here again.", "Date": "October 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "fullerton, CA", "Title": "“Clean hotel, close to the Termini train station.”", "Author": "plumeriafullerton", "ReviewID": "UR46420291", "Content": "We had a good stay at the Hotel Montreal. Yes, there was street noise, but you have to expect that in a hotel in a city. We had double pane windows and shutters which blocked the noise so it did not bother us. The location was close the the Termini train station. Easily walked, the metro is just down the block to go the Vatican. We are walkers so we walked to all of the other sites. The Coloseum, Trevi Fountain, Spanish Steps and Pantheon are walkable for most people. It was enjoyable to walk the city. The room was clean and comfortable. The staff was helpful in advice on travel in the city. The breakfast was good. Fresh rolls, breads, juice and yogurt. Typical continental. Enjoyed the small common courtyard to relax in.", "Date": "October 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Pleasant Hill, California", "Title": "“A Budget Disaster”", "Author": "Loves2TravelandRead", "ReviewID": "UR33981844", "Content": "We spent four nights in a double room. I was told that there weren't any rooms with two beds pushed together to form a king, but that's the kind of bed we were given. Good so far until you went to lay on the bed. Ouch! Coils were pushing up against the back. Did not make for a comfortable sleep or encourage romantic interludes. No functional drawer space so our two bags were left open on the day bed. Linens were thin, towels were thinner, and soap/shampoo were available in little packets. Toilet paper was rough, and the shower was a \"Beam me up, Scotty\" stall. Safe was pretty small and could hold our passports, but not too much more. We counted six pillows and we needed to use all six. The air conditioner was fair but rattled from time to time. The place was clean and the hotel used a nice smelling air-freshener, but if you have perfume allergies, you might find it overbearing. The area was a bit dicey at night but the building felt secure. A hight light was Pasquele in the office who was a sweet heart with fun stories of encounters with Rick Steves and serious conversations about running a hotel. The breakfast was dismal. Watery coffee, Tang-like juice, a croissant wrapped in plastic like they were purchased in bulk for the week, a hot dog bun roll....cereal, yogurt (in a rotating, slushee type cylinder), two pitchers of milk for the cereal (one warm and one warmer), some packaged biscuits, along with a biscuit with yogurt inside. We were a block away from the Vitorrio Emmanuel metro stop. Though buses passed by the Santa Maggiore church, steps from the hotel, we never did click with any of them. Around the corner near the department store, was a downstairs supermarket. Inexpensive way to load up on water/soda/snacks for the room refrigerator. You could get ice cubes from the front desk. No WIFI access from the room, but you could pay to use the small lobby's computer. In conclusion, if you are looking for an economical, secure, no-frills place to sleep (although our bed very uncomfortable), you may want to consider this hotel. We paid the Rick Steves rate of 115 euros (cash) per night. I wouldn't stay here again.", "Date": "July 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Regina", "Title": "“For Canadians Eh!”", "Author": "Estongirl", "ReviewID": "UR33415890", "Content": "We would have to agree 100% with Kathy50. We stayed there for three nights in late May, 2009 and have nothing but good things to say about the staff, the location and the rooms. The two gentlemen at the front desk were very helpful and spoke very good English which helped us greatly as our Italian was lacking greatly. One morning at breakfast we discovered that all ten of us there were from Canada. One thing not mentioned in the other reviews was that the hotel is located close to the Hop On Hop Off bus service as well. We used this service for two days and at the end of each day we only had a one block walk back to our hotel. This made sight-seeing very enjoyable", "Date": "June 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Colorado", "Title": "“Very pleasant”", "Author": "Kathy50", "ReviewID": "UR30484019", "Content": "We had a very pleasant stay here our last night in Rome. The man at the front desk could not have been more helpful, breakfast was lovely, the room was comfortable and clean - no bedbugs (in response to a previous revies). It was a very good value and in close location to the Termini station which gives you quick access to just about anywhere in Rome. I would recommend it. Mention the Rick Steve's book and get a discount!", "Date": "May 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Great location, great staff, great value for money”", "Author": "StephenSmithInLondon", "ReviewID": "UR28345087", "Content": "My girlfriend and I stayed at the Montreal Hotel for a week over Easter and were very happy. The room was a good size and clean. The staff were very helpful, and the location (a 2 minute walk from Termini station, less than 15 minute walk from most Rome sights) is simply superb when you consider how many Rome hotels are actually on the outskirts of the city. Great value for money, highly recommended.", "Date": "April 19, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "San Jose, CA", "Title": "“Bedbugs! Save yourself!”", "Author": "Rogered15", "ReviewID": "UR25962661", "Content": "This place has bedbugs. I had several rashes on my body when I got up in the morning. Complaining to the hotel folks didnt help since they maintained they didnt have bedbugs. I showed them the rashes but their explanation was - 'You could have gotten them anywhere!'. Save yourself and save your vacation. Go to a place where the hotel actually cares about its customers.", "Date": "March 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Oxford, England", "Title": "“Centrally placed and very close to termini.”", "Author": "sueandjaffa", "ReviewID": "UR25941667", "Content": "This is a clean and cool hotel, rooms are pleasant and our double room at the rear of the building was very quiet - lovely! Staff all spoke good English and were very helpful and efficient. Literally 5 minutes from the nearest Metro point or ten from the Termini, depending on whether you go left or right! Great central location within walking distance of all the major sightseeing points. Very close to bars and cafes etc, including 4 Irish bars. Opposite the church of Saint Maria Maggiore - go in if you get the chance! You can come and go as you please (as long as you leave your key every time) as the reception is manned 24 hrs. Lovely place, clean and welcoming, would go back.", "Date": "March 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nazareth", "Title": "“Great Location,kind stuff, and the most of all CLEAN”", "Author": "NateTravels", "ReviewID": "UR22725801", "Content": "I returned from Rome 2 days ago.. I stayed at the hotel 4 nights... 3 nights, and then i traveled, and came back for one night.. the hotel location was great, and i think when you are traveling to explore the city and visit places of interests, the first thing u have to choose is the location....it was near to the Santa Maria Maggorie cathedral, one of the biggest....near the Termini station, that is a train station..and also there is a Metro station also(2 mins walking)... near the hotel u can found a lot of super markets(one of them is SMA, that's not expensive and some chineese super markets also). from the hotel we went by walking to the Colosseo..it's not far.. The hotel was so clean(i think its important)....the breakfast was good....", "Date": "December 14, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "West Sussex, England", "Title": "“Convenient Location”", "Author": "jmr192", "ReviewID": "UR20928501", "Content": "Small hotel within 5 minutes walk of the Termini. Staff were friendly and helpful. Had a little courtyard which was nice for unwinding after a long days walking and for smokers! Rooms basic but clean. Lack of drawer space could be a problem if staying longer than a couple of days. The rooms at the front appeared to be bigger than those overlooking the courtyard, but would be noisier. Breakfast - basic rolls/croissants with cheese or jam, cereals. Served from 07:00 - 0:930 - nothing special but perfectly acceptable. Very convenient for shops, restaurants and picking up tour buses.", "Date": "October 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Norwich", "Title": "“Great location and helpful staff”", "Author": "sazzle_pink", "ReviewID": "UR20663782", "Content": "Lovely little hotel about 5 mins walk from Santa Maria Maggiore (which is beautiful inside and out), there is a small supermarket below a department store which is handy for water and snacks on days out. Make sure you stock up if you're going for a week as the water on snack huts are extremely expensive, we paid 6 euros for a bottle of water!!! The air con in reception was fantastic and the reception staff were brilliant. Breakfast was not great, nothing hot apart from tea and coffee and it was all pre-packed!! Not good. The hotel comes with a quant little terrace area and bar, which was nice when the sun had set a little. This hotel was ideal for hard core tourists and if you're only interested in Rome for it's attractions then this is perfect.", "Date": "October 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Montreal, PQ", "Title": "“Nice Place & Helpful People”", "Author": "mdcarzoli", "ReviewID": "UR20563786", "Content": "Nice place. Helpful staff. Great location close to the Termini train station & subway for mobility to other locations in Rome. A little noisy as its on a busy street. Breakfast is not much to brag about. Sleep was comfortable.", "Date": "October 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "St. Louis, MO", "Title": "“Nice hotel at a reasonable price”", "Author": "STL531", "ReviewID": "UR18464589", "Content": "My family (parents and two college-age daughters) stayed at this hotel for four nights while visiting Rome. I picked this hotel after reading Rick Steves' Italy guidebook and was not disappointed. There is nothing spectacular about the hotel, but the rooms were clean, cool (although the air conditioner was sometimes loud), and not too small. The location is convenient if you are arriving/departing from Termini train station, and it is also very close to a Metro stop. Many attractions are within walking distance, and all are accessable using the Metro. Our only problem was that one of the managers had informed us that there would be an additional charge for paying with a credit card (which was not mentioned in Rick Steves' book or when I reserved the rooms and, at least in the US, is probably in violation of service agreements with the major credit card companies). However, the manager at the desk when we checked out said that those were the \"other manager's rules\" and didn't charge us more than the Rick Steves' rate of 95 Euros for a double bedroom w/bathroom. All in all, we would recommend this hotel.", "Date": "July 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Killington, VT", "Title": "“We loved the Montreal!”", "Author": "Riverwood", "ReviewID": "UR17664268", "Content": "We chose the Hotel Montreal based on (travel guru) Rick Steves suggestion and other Trip Advisor reviews. They were right on the money. The hotel is only a few blocks from Termini, which made getting in and out of Rome very easy. Out of half-dozen hotels we contacted via email in Rome, the Montreal was the fastest to respond and gave us great rates. Considering the strength of the Euro vs the US dollar, we were very pleased with the rates and felt we got more than our moneys worth. The staff was exceptionally welcoming and friendly. Michael, Pasquale and Derek did everything they could to make our stay memorable. Out of 9 nights in Italy, our 3 nights at the Montreal were the most comfortable of our lodging choices and the only one to offer 24/7 air conditioning. A real blessing during a major heat wave! Thanks guys for a wonderful stay. We will make sure to recommend you to everyone we know!", "Date": "July 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "sittingbourne", "Title": "“Great weekend break”", "Author": "soveriegn", "ReviewID": "UR14334506", "Content": "The room was clean as were the stairs. The lift was all part of the charm of the hotel. The manager was fantasic. He gave us a map of the city and pointed out the best attraction. Directed us to a local restaurant which served good food and local wine straight from a barrel. The breakfast wasn't much to write home about but plenty of local places to go for morning coffee. In a quite area of the city and really near the Termini. Rome was lovely with great attractions, would advise a guided tour for the collesium, ours included a free city tour as well. Romans although proud seem to have a likeness for graffiti, bit off putting and even found its way into the Vatican city. O well still a great stay and top place to visit.", "Date": "March 17, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Average Hotel, good location”", "Author": "isspaul", "ReviewID": "UR14014269", "Content": "Room - ok decent bed, ok shower, tv ok, but very very average. Only negative was that there was a lot of noise as we were on the first floor, esp those of you who like a lie in Location - great in terms of Metro Station a minute away, loads of cafes and stuff, within a 5 minute walk from termini, 15 minute walk from colosseum, 15 minute walk from centre, perfect really which was all that really mattered. Didnt think the area was dodgy at all. Staff - Poor in my opinion, couldnt get us a cab when we left, friendly enough throughout 4 days there but left us wandering around looking for a cab. No money exchange either. Rome was amazing, everything about the place, paid about £60PN for this hotel which was average value for an average hotel, loved rome though and only thing i'd have done different was to have spent a bit more on a nicer hotel (in the same loaction):)", "Date": "March 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milton Keynes", "Title": "“Great Value Hotel”", "Author": "PAULRMiltonKeynes", "ReviewID": "UR13837889", "Content": "Have just got back from Rome where I stayed at the Montreal Hotel. Paid £47 a night which for central Rome I thought was great. Hotel room was clean and large enough, with a good shower, would recommend this hotel. Just a quick run down went on Ryanair got the Terravision Bus from the airport which takes you right into Rome and drops you off at the train station which is about 1/4 mile from the hotel all for about £8 return , the bus picks you up at the same spot. If you do get the bus be aware, the return ticket will give you a return time but this is not a seat booking it is just an advised time to get the coach so you still have to wait in line for the bus and if you get late you might not get the bus and have to wait about 1/2 hour for the next one. Went to the Colosseom great to see but worth paying for the guided tour as you get straight in and do not have to waite in the line only costs about 9 Euro Went to the Vatican, NIGHTMARE, went on guided trip again paid 30 Euro's alot but you only go once, but the line to get in, it was free Sunday, got there at 8.30am did not get in the door until 10.30am people jumping in etc etc. Metro is a good way of getting around as the Hotel is right next to one.", "Date": "February 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "washington", "Title": "“Would stay there again...”", "Author": "Gotravler", "ReviewID": "UR10553977", "Content": "We stayed at the Montreal for 4 nights. It is in a central location and easy to get to from the Termini and was just a block from the Metro station. We had heard it was a terrible area to stay in since it was close to the Termini, but didn't feel that way at all. We got a great rate. Our room was clean. With one exception, the hotel staff was very friendly and helpful. The breakfast wasn't the greatest, but was on par with all the other hotels we stay at in Italy. I even stayed there for a night after my friend flew home and felt comfortable walking around at night by myself. I would stay there again and would recommend it to a friend.", "Date": "November 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“incredibly nice staff,loved it!”", "Author": "gnicIreland", "ReviewID": "UR10224474", "Content": "Arrived from Ireland. Staff are defintely the friendliest and most helpful staff I've ever come across anywhere in the world. They really went out of their way to advise us on everything from sightseeing, travel, right down to what wines were nice from hotel bar. The cleaning staff had our rooms incredibly clean everyday, they were spotless!! On our arrival the man at reception spent at least 15minutes advising us on Rome's main attractions, transport around city, shopping streets etc. he was incredibly helpful. Our porter was one of the most pleasant porters I've ever met. Location was perfect, just a walk away from all main attractions, and 4 minute walk from termini train and underground station. Would defintely recommend this hotel, and would definitely return. It was fantastic.", "Date": "October 22, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "west sussex", "Title": "“excellent location!!”", "Author": "wigsxxx", "ReviewID": "UR10215732", "Content": "what a great little hotel!!!!! excellent location, really friendly and helpful staff, very secure hotel as you had to be buzzed in everytime by the reception staff. it also has a great little court yard where you can sit and relax after a long day of site seeing! the breakfast wasnt the best iv ever had but i didnt really expect much after reading some of the reviews on here before i went. the colosseum is a 10 minute walk away and the metro is a 2 second walk down the road. The main train station is a 5 minute walk away also. if you do have any spare time left go to see the santa maria magiore which you can see down the road from the hotel, it looks quite plain on the outside but once you get in it is like a hidden treasure!!", "Date": "October 22, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Flagstaff, Arizona", "Title": "“Good central location hotel in Rome”", "Author": "MarkOlsen", "ReviewID": "UR10074356", "Content": "I stayed at the Hotel Montreal in Rome in early October 2007. The best thing about the hotel is the location, I came in on the train from Florence and left on the Leonardo Express train (11 Euros) for the airport (FCO) and was able to simply walk from the Romi Termini station with my luggage with no problems. The hotel is also near a Metro (subway) stop that will get you to the Vatican for only 1 Euro. The hotel itself is small, only 27 rooms on 3 floors (the top 2 floors are regular apartments) and is very safe and secure in that the front desk must buzz you in whenever you return. I found the front desk people to be very helpful with whatever tourist-related questions I had. The room itself, in my American opinion, was small but neat and clean, it had a safe in the closet and a stand-alone air conditioner. I thought the price I paid (110 Euros for a single) was a little high but I've never been to Rome before and all rooms might be expensive. The only negative was the breakfast, it was lacking quality and selection but was included in the price so fill up and save some money where you can. I also felt the street noise and church bells were annoying so if you are a light sleeper ask for a room facing the interior courtyard which, by the way, was a welcome retreat after walking around Rome all day. The hotel did have an Internet PC for 5 Euros/hour but there are many Internet Cafes that only charge 1.50 to 2 Euros per hour in the same neighborhood. There is also a good self-service laundromat 1 street over if you're like me and need to do laundry while on vacation The good parts were by far the location, air conditioning, front desk personnel and security. The bad, smaller room, some street noise and a sub-par breakfast. If you can get a good Internet deal this is an acceptable hotel. I'm afraid that other hotels are more expensive and are located farther from the station. I was glad I stayed at the Hotel Montreal for my first trip to Rome but I will probably not be returning.", "Date": "October 13, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Canada", "Title": "“not bad hotel”", "Author": "CHe1975", "ReviewID": "UR8865394", "Content": "The hotel is a 5 minute walk from Termini train station. It is located on a big street right beside a church. The room was average size and fairly clean. You definately feel safe here as you have to buzz into the hotel everytime you come in and they have video cameras everywhere. The breakfast left alot to be desired though.", "Date": "September 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Florida", "Title": "“Nice business class hotel.”", "Author": "johnnybfl", "ReviewID": "UR8454298", "Content": "A pretty decent hotel for the price. Comfortable, clean quiet room with all the amenities (TV, good AC). Maybe a little small, but not too bad. We had a room facing the interior courtyard on the 1st floor . Good closed in full shower (not the hand-held one slike some other hotels in europe). Security seemed very good. The front desk has to buzz you in every time. The public areas are fair as I've seen was the case for most hotels in this class (2 star). Nice little breakfast. You can walk to the colliseum, and the metro stop is a couple blocks away to get you to the vatican and other sights. Also walking distance (about 4-5 mins) from the train station.", "Date": "August 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Texas", "Title": "“Good hotel”", "Author": "KamaLinn", "ReviewID": "UR8220780", "Content": "We stayed in this hotel during our 3 week trip through Europe in June. It was one of the nicer and more exepensive hotels we stayed at. It was relatively easy to find and in a good location. The hotel was clean and secure. They asked us to leave our key at the reception desk whenever we would leave for our security. We were in a room on the bottom floor. There were shutters on the outside of the window that did not open, so it was always kind of dark in the room. There was an AC in the room as well as a safe that you would get the key from the front desk (he told us not to lose it multiple times). The bathroom was bigger as well as the room. There was a small TV, but we didn't turn it on. The beds were 2 twins pushed together and a set us sheets covering them. There was a breakfast, but it was really bad compared to most we had eaten in other towns. It was all prepackaged--rolls and croissants. There was some cereal, 1 type of cheese and you could order juice. Not the best, but better than nothing. We stayed 2 nights in this hotel. The internet is not free, but they do have a computer you can use and pay them when you check out for your usage. Overall a pretty good hotel.", "Date": "July 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "North East England", "Title": "“Great location”", "Author": "nicem29", "ReviewID": "UR8190164", "Content": "We stayed at this hotel for 3 nights in July and I couldn't fault it. It is an ideal location for sightseeing around rome and definitely in one of the nicer areas. Metro station is 2mins down the road - metro is excellent value and takes you near all the sights. The room & hotel was clean, and staff were very helpful. Only negative was the breakfast which wasn't upto much but it filled a hole! Would recommend this to anyone great value for money", "Date": "July 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Fantastic Hotel. Staff was excellent.”", "Author": "misstoscana", "ReviewID": "UR7280176", "Content": "Everything was great about the hotel. The rooms were clean and large. The breakfast was good. The location was a few blocks from the station. Definitely within walking distance. The metro was in clear vision of the hotel. I was traveling with a group of 8 and everyone's opinions were positive. The staff was very informative providing maps and recommendations and even tips and warnings about traveling and the city itself. We had an accident on our trip where one of our group members broke her leg and he even came out to the car to help carry her in. Would definitely recommend this to anyone and stay here again in the future.", "Date": "April 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "dublin", "Title": "“Perfect”", "Author": "mccaffo", "ReviewID": "UR6813557", "Content": "The man who greeted us when we arrived was very pleasant and helpful. He recommended that we take a room beside the courtyard because it is quieter. The bed was really cosy. The hotel was extreme value for money. The room was very clean and tidy with air conditioning, tv and fridge. The breakfast was fine. My husband enjoyed the cappacino. The location is very close. As you exit the hotel and turn left you'll see M in the distance for the metro line. We took it to see the Trevi fountain which is located a couple of stops away. We would definetly stay here again.", "Date": "February 19, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Good base to explore Rome from”", "Author": "guiliette", "ReviewID": "UR5825420", "Content": "The best thing about this hotel was the location, 5 minute walk from the Termini, but far enough away from the really murky areas. There's also a metro stop a few minutes down the road. We always felt safe in the area. Our room was ok, lacking a bit of character, but clean and neat. The breakfast was terrible and we only tried it once, but luckily the bars near the hotel serve nice coffee and food. There are obviously prettier places to stay in Rome, but as a base it suited us.", "Date": "September 22, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Vermont, USA", "Title": "“A pleasant hotel”", "Author": "Alisseta", "ReviewID": "UR5620564", "Content": "The Hotel Montreal is located not too far from Roma Termini (walking distance) -- but just far enough! It's right at the back end of Santa Maria Maggiore, more or less across the street from Santa Prassede (with some of the best mosaics in Rome). The hotel is clean, comfortable, air-conditioned, and the management is very pleasant. On the downside, the breakfast is pretty dreadful. I would happily stay here again, however, since picking up coffee and pastries elsewhere is not too much of a hardship.", "Date": "August 17, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Phoenix, AZ", "Title": "“Great place in Rome”", "Author": "EricAZ", "ReviewID": "UR5339213", "Content": "Room was very roomy. Very clean and safe. They have a gate and have to buzz you in so your valuables and passport are safe there. Staff was way more than friendly and extremely helpful. They will give you a map of the tourist spots in the city. Breakfast isn't much to speak of, corn flakes and an oat type of cereal with a couple breads. Not much to speak of at all. They do have a computer set up there that you can use for dirt cheap if you need to check email or sports scores etc. Close to Termini Station which runs buses everywhere you need to go. Bus 64 is the one that goes to the Vatican and most of the tourist spots in the center of the city. DO NOT BUY BUS TICKETS FROM THE GREEN MACHINES, THEY DON'T WORK. GO TO A TABACCHI STORE AND BUY THE TICKETS THERE!!! Be careful, the pickpockets are on the buses. I never saw or had a problem anywhere in Rome with the Gypsies or pickpockets. There's a cheap call place just down the street (walk out the door and turn left and it's about 50 feet down on your left) 0,10 cents a minute to call the US. Next to that is a great Chinese market called Xin Shi with cold water for dirt cheap. Buy water here before you go anywhere. A 1,5L bottle was 0,80 cents whereas in the stands by the tourist spots, they are 2,00 Euro for a 0,5L bottle of water. Also, get the Lemon The (tea) there, it is soooooo good. I wish I could find that here in the US. There is a supermarket down the street to the right (as you walk out) of the hotel called SMA. It is in the lower level of the corner by the big church. Very cheap but no cold water or beer. Cheap Extra Virgin Olive Oil and Wine though.", "Date": "June 13, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Cottingham", "Title": "“Fine Hotel”", "Author": "BFNBs", "ReviewID": "UR4827583", "Content": "My wife and I stayed for a few days in March. We were impressed with the friendliness of the staff and the cleanliness of the rooms. The area is a bit sleazy with down and outs reclining on the pavements but we had no problems with them. It's in a handy location and most of the usual tourist sites are within walking distance. It's also about a five to ten minute walk to Termini bus, train and metro station. That's an experience in itself. Watch out for pickpockets and con artists. The only downsides are that there is no real lounge area to relax in so you have to go out and the breakfast is a bit basic. We would definitely use this hotel again.", "Date": "April 2, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Ireland", "Title": "“Loved it”", "Author": "globetrotter24", "ReviewID": "UR4736338", "Content": "I liked this hotel- true the area wasn't the best but it was near shops and the metro etc. The rooms were nice and clean and the the staff friendly. We have been twice to Rome and have gone back to the Hotel.", "Date": "March 27, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "3.0", "Value": "2", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Boston, MA", "Title": "“Did not like this location AT ALL!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4604405", "Content": "I actually booked this hotel by accident....OK...not too bright, but I read the wrong phone number from the book I was using, and the hotel clerk answered the phone in Italian (which I do not speak at all...)and I didn't realize I had booked the wrong hotel until he gave me the email address for confirmation. So maybe this tainted my opinion because I really wanted to stay closer to the Trevi Fountain... In any case, this hotel was located in a neighborhood that felt very unsafe to us. The clerk was very nice, but you had to be buzzed in at all times through an iron grate...I witnessed him letting a vagrant use the downstairs bathroom. Yes, it is not far from the main Termini Train Station (not a perk for me..I find these neighborhoods to be less than savory), but we were forced to pass by a row of homeless people every day/night, living, sleeping and drinking on the sidwalk right around the corner from this hotel. It was not a great first impression of Rome, to say the least.I am from Boston, so this is not a foreign concept to me (seeing homeless people on the streets occasionally) but it really took away from our enjoyment of Rome. On the positive side, it is conveniently located to the Metro which we used to get to the Trevi fountain area for dinner in the evening and also to get to Vatican City. Unfortunately, they seem to close at an unusally early hour (10:30 p.m?) We were shut out twice and had to walk home anyway. We have no problem walking, but again, the neighborhood did not feel safe. On the positive side, the staff was very nice, the room was fairly clean--no insects or anything, but the door to our bathroom was very mildewy and we had a very hard time opening and closing it. The bedding, space, housekeeping etc. were all just adequate. I think we could have done better for the money (we paid 110 Euro/night for a triple.)", "Date": "March 13, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "the midlands, england", "Title": "“Excellent value for money”", "Author": "smartprincess", "ReviewID": "UR4335818", "Content": "We went to Rome for a few days to celebrate New Years 2005-2006. We stayed at Montreal Hotel, after finding it cheaper to book through expedia.co.uk. I have to say, i was very very pleasantly surprised and pleased with the hotel. Compared to other 3-star hotels in Rome, it was great! Clean, smelled nice, good housekeeping service, power shower. We requested a double bed via email a few days before, and they had specifically reserved it for us. The staff were incredibly helpful, explained how to get to all the sites via the metro (costs only 1 euro for journey upto 75min!!), or even walking. The best thing about the hotel was it's location - a 15-20 min walk from Termini Station, 20 min walk to the colosseum, 25 min walk to the Spanish Steps. We even walked 50 min up to Vatican City because the map was that easy to follow! Or, conversely you can take a hop-on, hop-off bus (number 110) and see all the sites. The only thing that sucked about the hotel was breakfast - you get a glass of orange tang, some stale croissants, hard buns, mushed apple or cereal. Don't even bother to go down for breakfast. There is a supermarket 5min walk from hotel, or better yet, hold out for lunch (see resturant review below). I would recommend going to the \"TerraVision\" counter at the airport and paying 13.50euro return for a coach service from ciampiano airport to termini station. Much much cheaper than taking a taxi. Frequent service. Being vegetarians/vegan, we were worried about finding good food. Let me recommend one of the best restaurants i have EVER been to - \"Margutta Ristorante\". Tel ------ or -----. Vegetarians will be in heaven! Unbelievably delicious food - in fact, we ate all our lunches and dinner's there!! Lunch was all u can eat buffet for 15euro, and dinner varied - Believe me, it's worth every penny! The restaurant was near the Spanish Steps. All in all, a great trip. Hope this review has helped!", "Date": "January 10, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "England", "Title": "“Loved it!”", "Author": "RuthieRed", "ReviewID": "UR4067852", "Content": "Having read a lot about how small and expensive Rome hotels were, I was a bit worried about booking this, but the other reviews on Tripadvisor sounded ok so we went for it! Hotel Montreal is great- very central location (between Colosseum and Termini), nice quiet rooms (not huge but didn't feel cramped), clean and modern, and reasonable price. The staff were all very friendly and went out of their way to be helpful. We liked it so much we're going back next year!", "Date": "October 28, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Utah", "Title": "“Great hotel!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3898621", "Content": "We stayed at the Hotel Montreal during a 6-week journey through Europe and absolutely loved it! It was a typical, small European hotel, but the owners and workers were so helpful. Our train arrived late in the evening and the owner had stayed late anticipating our arrival. The rooms were nice with air conditioning and very nice furnishings. It was located very close to the train station (just a few blocks away) and near Metro stations, too. The staff was very helpful with restaurant suggestions, directions to nearby attractions, and anything else we asked of them. Definitely a place to stay when you're in Roma!", "Date": "September 13, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Atlanta, USA", "Title": "“Good and recommendable”", "Author": "GradguyAtlanta", "ReviewID": "UR3416579", "Content": "I just got back from Italy and since I got such great help from this site I decided to write my reviews. I stayed at the Montreal 3 nights. In general I would say it was a good place to stay. However, I think that for the money I pay (95 euros a night) I could have gotten a nice place somewhere else. However, I also have to say I was in Rome in the middle of the Pope election and it might have been hard to find a single room. I had booked this a couple months ahead so I decided just to stay there. No matter how you book it, the pictures are a bit enhanced. The rooms are spacious and clean, the staff was friendly. The breakfast is adequate. The location is great, only a 5 10 minute walk from the train station. There is a grocery store almost around the corner, and plenty of places to eat. I walk from it to the Coliseum and all the attractions, however it was a long walk, but I like that. If I have a choice, for the same money I would try another hotel, just to try. However, I can stay there again especially if I get a better rate. I do recommend the hotel; I just say do your research before booking.", "Date": "April 26, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Arizona", "Title": "“Rate Switching”", "Author": "West-Coast-Travelers", "ReviewID": "UR3102484", "Content": "Used the hotel's email address to get a rate quote which was 115 Euro/night. Subsequent emails directly from the hotel told me I must book it online and when I did it quoted me 150 Euro/night. (---) (the online reservation agency) said (after numerous emails to them) that the hotel would have to honor the lower rate. They promised to get back to me but I have not received a response from either (---) or the hotel directly. Nice 'bait-and-switch' tactics. Looks like a nice place but I don't think we can count on going there and not having the price increased again!", "Date": "January 31, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Princeton, NJ", "Title": "“Very nice for the price”", "Author": "TaipeiTigers", "ReviewID": "UR2993620", "Content": "The price was right for the hotel. It is close to the Metro, and the staff was friendly. Will definitely recommend it to my friends.", "Date": "January 10, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Palmdale, CA", "Title": "“Would stay here again.”", "Author": "A TripAdvisor Member", "ReviewID": "UR2871324", "Content": "We spent two nights here in Nov. It was an easy walk from the train station. The bed was the most comfortable and the room the quietest of the three hotels we stayed in in Italy. There is a security gate and the staff was very polite and helpful. Newer sheets and towels would make it even better! The breakfast was poor - plan on only a hot coffee or tea and perhaps a packaged biscuit. There were several homeless people sleeping on the sidewalk nearby, but we did not encounter any problems. We would stay here again, it was a good room for the price.", "Date": "December 8, 2004"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "California", "Title": "“Nice safe haven in the big city”", "Author": "finickytripper", "ReviewID": "UR2782425", "Content": "Most of the staff was very friendly and helpful. Hotel had clearly taken extra steps to make security a priority, which was a nice touch. Room was well-sized and quiet, overlooking the small courtyard where we enjoyed a take-home pizza one night. Breakfast in the cramped eating area was below average for Italy, with few fresh items and micro-sized cups of poor orange juice that were dispensed slowly by the staff, as if from a Pez dispenser. Easy walk to Termini and the Metro. Generally felt like a safe location, but at night we did see a few homeless on the hotel street's sidewalks, and the dimly lit walk from the Metro would have seemed more uncomfortable later in the night when the tourist crowds thinned out. Coloseum/Forum was easily walkable from hotel, and those in decent shape could continue walking on to Trevi, Pantheon and others from there in a single day - but might take Metro or taxi back to Montreal. Vatican is an easy but very crowded Metro ride, and even then requires some walking. The supermarket on a corner near the church (the only one we'd stumbled upon in Italy!) was a nice find for inexpensive water, wine and other essentials.", "Date": "October 24, 2004"}], "HotelInfo": {"Name": "Montreal Hotel", "HotelURL": "/ShowUserReviews-g187791-d228921-Reviews-Montreal_Hotel-Rome_Lazio.html", "Price": "$86 - $166*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4 Via Carlo Alberto</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "228921", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/8b/4c/8b4c2b0085bbd3e7257af8598d9e271c1large.jpg"}}