{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Nizhny Novgorod, Russia", "Title": "“Spoiled weekend in Rome”", "Author": "Sergey C", "ReviewID": "UR118977257", "Content": "The hotel is very old: smell, dust - everywhere. I've found ants eating a bug in the center of bathroom. Bedclothes were not very cleared, but bearable to sleep without disgusting. Most furniture is quite old and and made me sad. Stuff is quite kind, but kitchen stuff is not. Breakfast is not poor (there are many things to choose), but I'm not sure that they were fresh. One more - Leonardi Hotels manager stuff badly speaking English: it was pain to confirm the reservation. I hope my fate is kind to me and do not make me stay again in this hotel.", "Date": "October 5, 2011"}, {"Ratings": {"Location": "2", "Overall": "2.0", "Value": "3", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Hartford, Connecticut", "Title": "“Dingy and inconvenient location”", "Author": "nuoverose", "ReviewID": "UR118285329", "Content": "I will start by saying we were pleased with the proximity to the subway since this hotel is not within easy walking distance of any attractions but the Termini train station. This hotel is a few blocks form the Castro Pretoriano stop on the blue line. However, the immediate area was lacking in any enticing restaurants or other amenities. We did not feel completely safe walking around in the vicinity except when near the armed guards for the consulates across the street. Our biggest complaint was the utterly rude and unhelpful staff at the reception desk. Upon check-in we were not given the remote control necessary to operate the A/C and he held our passports with no explanation. Later in our stay, I asked if he could assist us in making 2 dinner reservations. He looked at me like I had three heads, then informed me I would have to pay him for the 3 local phone calls he reluctantly made. Since I was not expecting this I told him I would have to bring the 0.60 cents to him on our way out to dinner in a hour, and he expressed concern that I might not get it to him before his shift ended at 11 pm. Another time, we had to wait for the attendant to finish his cell phone conversation outside before we could retrieve our room key (which they required us to leave with them). I do wish to say that the one female desk attendant was always willing to help and she was friendly, but spoke poor English. (The hotel's website advertises \"multilingual staff\".) We were not happy with the selection at breakfast and the other reviewer who compared the waitress to a member of the Addams Family was not far off. We didn't mind the basement setting but it was deathly quiet in there. The room was dirty and had some problems. The bed was seriously lumpy and the sheets coarse. The armoire door did not stay closed. The hairdryer was coming unattached from the wall and got far too hot to hold after a few minutes. There was a white stain on the extra blanket that I could not bring myself to identify. Worst of all, the toilet could barely flush and took several tries to get just toilet paper to go down. At one point it stopped flushing altogether.", "Date": "September 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fayetteville, Arkansas", "Title": "“Nice Spot, Great Room”", "Author": "Brandon004", "ReviewID": "UR116238377", "Content": "At first I wasn't to sure about the Hotel since my room was a 400 hundred number which I figured would be on he 4th floor. But to find out it was on the ground floor. Nice room with a garden like area. The staff was friendly and always pointed me which way to go.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Esposende, Portugal", "Title": "“NIce and easy”", "Author": "NJames1", "ReviewID": "UR115261281", "Content": "Old style Rome Pallazzo, with an excellent location, close to Termini and easy to get anywhere. Bus, trains,tube, round the corner. Peacefull and safe street. Nice traditional eating places arround. Kind and friendly staff. Ensuite room, with daily towels and bed linen changing. Fair breakfast. Very good value for money.", "Date": "July 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Never ever stay at this hotel!!!”", "Author": "Styve007", "ReviewID": "UR88431297", "Content": "Recently stayed at this hotel with my fiance.Booked a hotel room for 6 nights. The first night we arrived very late and went up to the bedroom straight away. The bedroom didnt match the picture as on their website. It was too hot , wasnt possible to turn off the heating system, or put on the AC. Next morning we woke up at around 7am because someone was having a shower in the room next door, and every time someone went into toilet and flashed it we were jumping in our bed because of the terrible noise. The sheets werent changed not even once during all our stay. The breakfast was terrible so was the service.Once asked to move the room we were told that it wasnt possible at all. Eventually we left the hotel a few nights earlier. We wouldnt recommend this hotel to enybody. The only good thing about this hotel is the location. Enjoy Italy!", "Date": "November 28, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Don't stay here at Sigvilia Hotel!”", "Author": "BeckyDK", "ReviewID": "UR80744771", "Content": "We booked rooms at Edera Hotel, which is a part of Leonardi Hotels, but when we arrived, they had no rooms,despite that the room was booked 6 month ahead!! They moved us to Hotel Sigvilia, close to Termini Station. I was very angry to be removed, because the hotel Sigvilia was farther away from everything. The hotel was below standard, grotty/tatty. The breakfast was very poor, boring, not worth eating. I was so disapointed to stay there.If you choose to stay, go out and buy breakfast some where else. One good thing, clean sheets and hot water for shower. Finally conclusion, we will NEVER stay at Hotel Sigvilia again or any other Leonardi Hotel. But we defently will come back to Rome. Becky, Denmark.", "Date": "September 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Canterbury", "Title": "“Below average”", "Author": "kjb35", "ReviewID": "UR65881247", "Content": "Even for a young couple with not much of a budget this hotel did not live up to expectations. The rooms, although seemed fairly clean, were dimly lit and dingy. The hotel is very tired and certainly needs some revamping. As other reviews have said 3/4 of the hotel staff were indeed extremely rude (however 1 was very helpful.) Breakfast in the basement fitted with the hotels theme of trying to suck any sort of atmosphere out of the hotel. The virgin mary painting hung above our bed, although very italian, we found rather unsettling! On the positive side you could walk into the center of Rome, however it is not a quick walk (especially after a day of sight seeing). Overall this hotel took away from the magical city of Rome. Although a fair price, consider staying anywhere else, or risk loosing a lot from your holiday.", "Date": "May 31, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Barreiro, Portugal", "Title": "“The worst in Rome- If you can´t stay ANYWHERE else, don't visite rome!”", "Author": "Catariina", "ReviewID": "UR63342332", "Content": "We were in Rome for 3 nights and stayed in this hotel. We had a reservation for Hotel Fiamma and when we got there they informed us that we had to go to other hotel, Siviglia. If you are planning on staying here, please reconsider. It was the worst acommodation ever. The room was dirty, the matress on the bed full of hair and stains. The rooms had no sound isolation, we could hear converstations across walls without making an effort. The bathroom flusher did work. We had a constant water noise in the room that kept us from sleeping. When we thought it couldn't get worse, we got to the breakfast room. It was in a bunker, no windows what so ever. The lady there could be a waitress for the Addams Family. Spooky and incredibly rude. Don't ruin your vacations like I ruined mine. The area is also terrible. So, my advice, reconsider.", "Date": "May 5, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Berkeley, CA", "Title": "“I WOULD NEVER STAY HERE AGAIN!”", "Author": "geraldlenoir", "ReviewID": "UR48020469", "Content": "First of all, we were quoted a price of 89 Euros over the phone and when we got there, it was 100 Euros. On the website, it says there is internet access but there isn't. The clerk at the reception desk was downright rude. The room I stayed in had a horrible musty smell like mildew. I only stayed one night and moved to a better hotel.", "Date": "October 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Scotland", "Title": "“Fits the bill”", "Author": "Rosher_9", "ReviewID": "UR28335791", "Content": "We enjoyed our stay in Rome. We wanted somewhere that was clean, comfortable and within walking distance of main sights... we weren't after luxury....this hotel was more than adequate. Did feel a wee bit Fawlty Towers.....Breakfast could have been better and it was rather odd to eat in the cellar. If you decide to stay here make sure you have a balcony....was a nice surprise and we enjoyed supping wine and eating olives in the evening before heading out to dinner. Area was a wee bit strange and there were some homeless dudes about but embassy opposite/constant police presence made us feel a bit safer. Try Florentines Restaurant nearby for some excellent nosh.", "Date": "April 19, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "1.0", "Value": "1", "Location": "5"}, "AuthorLocation": "Moscow", "Title": "“Something happened”", "Author": "repaMoscow", "ReviewID": "UR21101452", "Content": "Last year in this hotel was very nice and comfortably. This year something happened with this hotel: - rooms (not only our one) in hotel full of mosquitoes, people cannot sleep - very strong smell from bathroom (I think it's sewage problem) - one day breakfast table was almost empty from last day, juice was diluted by water 50/50. Resume: this hotel must cost cheaper twice for their services.", "Date": "October 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chicago", "Title": "“Clean, nice hotel”", "Author": "asford1", "ReviewID": "UR17266324", "Content": "The hotel was very clean. The room we had was small, but adequate with a private bathroom. The room had a TV, but the reception was horrible. It also has a mini fridge with a minibar in it. (You could watch a station for about 30 seconds before losing it). Noise carries easily from outiside and from the halls. The front desk staff was nice and helpful (and spoke English well). The breakfast consisted of yogurt, juice (orange, pineapple), cereal, fruit and bread. The location is fairly close to Termini and close to the Metro stop Castro Pretorio, but we just walked from Termini a lot since it was so close. We would stay in the hotel again for the service and actual hotel, but I think we would choose a different location next time. The area around Termini is a little shady, especially to be walking around at night, but immediately around the hotel it is okay.", "Date": "June 27, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Arboath, Scotland", "Title": "“pleasant hotel, area not so pleasant”", "Author": "HappyTraveller20", "ReviewID": "UR13841604", "Content": "I went on a five day trip to Rome with my married daughter, who had not been to Rome before. She actually booked the trip for us as she is a travel agent. We picked a hotel which was near to the centre so we could reach the attractions on foot, but far enough out so as not to pay the prices of the inner city hotels. The hotel was homely enough and the reception staff helpful. Our room was quite small but adequate, the en suite bathroom clean, the room decor fresh. Our room was at the back of the hotel so we didn't hear much street/car noise. All attractions/sites were within walking distance, but it was best to keep to the main lighten streets at night, as the side streets were rather dark with a few homeless street people hanging around. The hotel was only a five minute walk from the main train station, where we booked our tickets for a day trip to Florence on the express train. This was easy to do and worth the day away from the slendour of Rome. If I was to return to Rome I would use this hotel again.", "Date": "February 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "North West UK", "Title": "“Was much better than some of the reviews I have read!”", "Author": "cousinten", "ReviewID": "UR7179056", "Content": "I have just got back from a very pleasant trip to Rome, which was booked only 2 weeks before departure. If I had taken notice of some of the reviews for this hotel I had read on this site, before I went, there is a possibility I would have changed the booking. It was as well I didnt. What certain of our friends from the USA have to consider, is that there are many hotels in the States who do not have a bellhop or the historical value an hotel of this category can offer! If you want those extra facilities you have to pay for them! This is a friendly and most acceptable hotel. It is clean, the room we had was of a respectable size, and it has a quaint atmosphere befitting a hotel in the centre of such an historic city. The linen was fresh and regularly changed and the breakfast was more than adequate to set you up for sightseeing! This hotel is well placed for the Metro and bus services to get you all over Rome. I find some of the other reviews here a little unfair, I thought it good value for what we paid.", "Date": "March 17, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "newcastle,england", "Title": "“good hotel, great location”", "Author": "3jays", "ReviewID": "UR6932784", "Content": "This hotel was not half as bad as the other reviews state. I have stayed in alot of hotels as we are regular travellers and do alot of city breaks. The location is excellant, five minutes walk from the Termini in a quiet street. The room was quite big with alot of space to move about in. The bathroom was also good, new and clean. The only problem I had was there was no tea or coffee in the room. The breakfasts were continental in a large breakfast room, lady waitress quite rude! The rest of the staff were friendly and provided large, free maps with an a to z on the back from reception. Very usefull. This is probably the best city hotel we have stayed in, and I'm choosy!", "Date": "March 8, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Los Angeles", "Title": "“Ok Hotel, Ok Location”", "Author": "Travelguy1972", "ReviewID": "UR6571279", "Content": "During our 2 week trip to Europe, the 2 nights we spent at this hotel were probably the worst on the whole trip. While the hotel is ok, it's not 3-stars. Upon check-in, we actually found the desk staff helpful to book us tours, get a taxi, etc. We had to track all of our luggage up a large flight of stairs to the first floor, with no bellhop available. The elevator was too small to even fit a large suitcase. The hotel was older, and felt similar to a hostel. Our room was a bit musty and hot (mid-winter so the heaters were cranking), so we opened the nice veranda double windows, and it airred out nicely. The room was small and old, with very old furniture. It had two twin mattresses (this is called a 'double' in Europe) on a weak bedframe. The AC did not work, but they probably disconnect it in the winter. The bathroom in our room was actually large, newer, and quite nice and was the highlight of the room. The shower stall was small though, but I find this common all over Europe. The walls and door were thin, but we didn't hear anything. Breakfast downstairs was nice with plenty of choices. It kind of felt like an underground bunker or dungeon. The selection of meats and cheeses with bread, fruit, cereal and hard boiled eggs was good. As far as location, this hotel is not in any kind of tourist area! You can take the subway, which is only 2 or 3 blocks away to the Colosseum (3 stops), so that was nice. Otherwise, it's a 10-minute walk to the main train station, which will take you anywhere. If you are looking for a central hotel near lots of sites, spend more money and stay in Old Rome. The area of the the Siviglia, while not bad, kind of has a seedy feel to it. The good news is that the Turkish Embassy is across the street, so there is always a police guard right out front of the hotel.", "Date": "January 10, 2007"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "2", "Service": "2", "Rooms": "1"}, "AuthorLocation": "St. John's, NL", "Title": "“Stay away - staff rude, holes in sheets, no cafe or bar as advertised”", "Author": "Cheocheo", "ReviewID": "UR4446819", "Content": "I was stuck there for 5 days while on business. While a couple of the staff were polite and helpful, one in particular was rude and creepy. I didn't feel safe there at all. The breakfast was OK - but I watched the waitress yell at another patron one morning for requesting a second latte (the patron even said she'd pay extra for it - eventhough it was supposed to be complementary...) The room was small - but roof balcony very nice. The place was OK in terms of cleanliness, but the matress and sheets must be 50 years old. Very uncomfortable. There is no bar or cafe - despite what they advertise. Neighbourhood a bit sketchy - but seemed safe enough, easy to commute anwwhere in the city, 5 min walk to Tirmini.", "Date": "February 8, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "", "Title": "“Mixed”", "Author": "chrs4944", "ReviewID": "UR4147292", "Content": "I have just returned from a 3-day sightseeing trip to Rome, and spent my nights at the Siviglia. To say that the hotel was mixed is an understatement! Reception was courteous and OK - Bar was closed. My single room was basically a large cupboard with a clean, but functional shower/toilet. The breakfasts were the highlight of the stay - good choice and efficient service. The staff were reasonably helpful, if a little formal. If you are looking for a place to bed down for the night whilst visiting the beautiful city it is OK, but don't make the mistake of trying to impress a partner - romantic it is not. The permanent presence of the Carabinieri across the street is moderately reassuring - as long as nobody wants to blow up the Turkish Embassy. All in all, pretty mixed, but not disastrous.", "Date": "November 28, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“not so bad”", "Author": "PirateLola", "ReviewID": "UR3780629", "Content": "i stayed at siviglia in january this year. i was a little disappointed by the location of the hotel -- on a back street near some seedy looking pubs -- so i always made sure to be back at the hotel before dark. the receptionist who checked us in was rude and abrupt. our room was located on the first floor and was clean and comfortable with a small terrace overlooking a neighbouring street. the buffet breakfast was great -- we stocked up on bread rolls and fruit to take with us as we spent every day seeing the sights. the main train station is only a 10min walk away and from there you can travel straight to fumicino airport or any metro location in the city which i found extremely handy. the local supemarket filled in the blanks where evening meals were concerned as hotel siviglia did not offer dinner. i wouldn't recommend this hotel to families or those looking for a relaxing break but, if like me, you are more interested in seeing the sites of rome then you could do a lot worse than this.", "Date": "August 17, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "3.0", "Value": "5", "Service": "3", "Rooms": "2"}, "AuthorLocation": "USA", "Title": "“Could have been worse.”", "Author": "A TripAdvisor Member", "ReviewID": "UR3589544", "Content": "The room was tiny, but the veranda more than made up for it. I was in room 441, so I had a corner balcony that was larger than the room itself, overlooking the Turkish Embassy. I was in Rome alone, my first time in a foreign country. Someone attempted to snatch my purse a block from the hotel, but the Carabinieri was parked on the corner, so the guy ran off when I screamed. So I guess crime isn't so bad. The maid was really sweet, but the two guys that worked the front desk were rather stuffy and brusque. My only complaints were that the pipes can be loud at night, a bellboy walked into the room to get a lemon from one of the trees on the the balcony without knocking first (I was in a towel the one time this happened), and my personal belongings were always stuffed into the closet while I was out, even if I left a note (in Italian) for them to leave my things alone. The air conditioner/heater did not work, and the sheets were stained, but the weather was perfect so I slept on top of the bed with the balcony open. Also, DO NOT drink anything from the frigobar. The price list is wrong, and you are in for a SURPRISE when you get the bill. Another plus is the pizza by the slice place up the road- wonderful!!! And you can walk to anywhere in the city. I never caught a bus or train the entire time I was in Rome!", "Date": "June 21, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "4", "Rooms": "1"}, "AuthorLocation": "Canada", "Title": "“horrible place”", "Author": "Hugh9", "ReviewID": "UR3467163", "Content": "I stayed here with my wife and 2 kids for 3 nights. We were switched from the hotel we were supposed to have to this one. Staff were courteous but our 2 ground floor rooms were dreadful. Cramped and musty. Plus, each morning between 3 and 6 we had either people moving furniture above us or street crews working on stuff. The hotel has 2 near-by restaurants (same family owns them) which are terrific, and a nearby grocery store is very convenient. We payed a fortune to stay here and have never had rooms this poor. A real 1-star place IMO. This place lives off its proximity to central Rome sites. Do not stay here.", "Date": "May 12, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Loved Rome - Hated this hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3235847", "Content": "We had a fabulous 3 days in Rome but this hotel was absolutely dreadful. It was the only unpleasant part of our trip. We had no water supply at all in the wash basin, shower or toilet for 1 day. Can you imagine what that was like ? The room was very dirty with filthy carpets, bedspreads and broken furniture. The walls were thin but mercifully, we weren't disturbed by other guests. Breakfast was derisory. Reception staff were uninterested. I cannot understand how some reviewers here can find any redeeming factor to this hotel. It is billed as a 3 star hotel. That is an outrage. It would be generous to give it 1 star. You should not allow your trip to the wonderful city of Rome to be spoilt in any way by staying at this terrible hotel.", "Date": "February 28, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Nottingham", "Title": "“Clean, Safe and Convenient”", "Author": "Viviannew", "ReviewID": "UR3011795", "Content": "I spent 3 nights here and cannot fault this hotel for price and location. The breakfast was fresh and good choice on offer. I stayed in a twin room on floor 3 and there were no real problems with noise. The bedding, towels and bathroom were all clean and in working order. Near to large supermarket, train and metro.", "Date": "January 17, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Middlesbrough, England", "Title": "“dripping noises in the night.....”", "Author": "A TripAdvisor Member", "ReviewID": "UR3005250", "Content": "Just returned from 4 nights in the Siviglia! It's well positioned close to Termini station and there is at least one eaterie along the street that is cheap and welcoming. But......a very small room on the ground floor that was far too hot at night. But trying to turn the radiator off, it wouldn't, but had the valve dripping all over the floor and soaking the carpet for our trouble. We put a cup under it to save the stain spreading. The showerhead had 'brewers droop' and would not tighten up even with excessive application so the 'old rubber band trick' came in useful. The final straw came when the toilet flush started to flood like a torrent continually back into the bowl. They came and stopped that but it started doing it again after a little usage and this time would not flush at all. They fixed it again but we used the flush sparingly after that because we could not cope with the intrusion of a young guy berating the flusher and getting very physical with a scew driver. It's a maintainance thing I think! The stain down the back of the toilet bowl said this overflow problem had been going on for months maybe even years. Some people staying in room 95 must just live with the racket that sounds like Niagarra Falls when it is quiet at night. We won't be using this hotel again.", "Date": "January 13, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Miami, Florida", "Title": "“Horrible service”", "Author": "A TripAdvisor Member", "ReviewID": "UR1729627", "Content": "I was very dissatisfied with the service provided. Upon our arrival we were changed to a different hotel, supposedly same quality. We were given a room with a broken glass shower door, we reported this to the front desk and was advised that they would check it tomorrow even after explaining the danger of the door to the front desk they still did not move us or repaired the door. Two days later we checked out and still no repair. The front desk attendants were arragant and disrespectful. Would never stay at any Siviglia and will advise others not to.", "Date": "March 17, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“Cheap and cheerful”", "Author": "A TripAdvisor Member", "ReviewID": "UR1553509", "Content": "For the price we paid which was very reasonable for a 3 star, the room that we got was very spacious and clean. The bathroom was nicely decorated, and has a good shower. Staff was generally helpful, although I wouldn't say they were very friendly. About 5 mins walk to the main Termini station/metro that conveniently takes you everywhere in the City.", "Date": "January 15, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Reading, UK", "Title": "“Loved Rome”", "Author": "A TripAdvisor Member", "ReviewID": "UR1495939", "Content": "Ideally located hotel. 200m to subway. Average rooms. Service helpful and good breakfast.", "Date": "November 21, 2003"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Norman, OK", "Title": "“Would Stay There Again”", "Author": "A TripAdvisor Member", "ReviewID": "UR1376269", "Content": "Charming lobby and rooms but the room air conditioners was high on the wall and could not be accessed without calling staff for assistance. Shower door was so narrow that an overweight or large person might have a very difficult time getting into the shower. Other than the shower door, the bathroom was clean and modern. We found the staff to be very helpful. They made restaurant reservations and called taxis.", "Date": "October 5, 2003"}], "HotelInfo": {"Name": "Siviglia Hotel", "HotelURL": "/ShowUserReviews-g187791-d228951-Reviews-Siviglia_Hotel-Rome_Lazio.html", "Price": "$73 - $208*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Gaeta 12</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "228951", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c9/67/c967500716d9b2a3d81955cc788e72085large.jpg"}}