{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Southampton, United Kingdom", "Title": "“Distinctly average”", "Author": "SvenskTjej", "ReviewID": "UR127426230", "Content": "I stayed here during a 3 day business meeting, also being held in the hotel. All in all the hotel was clean, the room was well equiped, the food was alright and the staff was ok. The hotel is located close to the Vatican and it is possible to walk into the city center of Rome but it is a good 45 - 60 minutes. The meeting rooms that we used were fine, nothing fancy but had all the amenities you would expect, including wifi. There did seem to be some power issues as several times over the few days, the power would go but come back on within a minute. The sleeping room was fine - clean bathroom, again wifi worked well, there was a safe in the room as well as ironing facilities. It was possible to turn the heat/air conditioning off which was appreciated. Annoyingly, my room key needed to recharged twice over the course of my stay although I'm not sure why. The breakfast was pretty good with a selection of hot and cold options. My stay here was fine but I would say very average as there was nothing particularly good or bad about the hotel. If you are looking for a simple hotel with no surprises, then this is the hotel for you.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Isernia", "Title": "“NH VILLA CARPEGNA”", "Author": "edmondoangelaccio", "ReviewID": "UR124563937", "Content": "a good hotel, not the best for NH in Rome, not closed to anything. You need taxi to go everywhere or walking very much. Not confortable to go to airport. The hotel however is not good , maybe not fresh new structure but good in complex. I d say excellent breakfast. Good rooms, not so hot, not noisy, so i d say ok as hotel but not good logistic.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Denderleeuw, Belgium", "Title": "“Too far away from the centre, rooms and towels were smelly”", "Author": "Nausika_82", "ReviewID": "UR122226441", "Content": "The hotel was located too far away from the city centre. You had to walk and then 2 busses or bus+subway. Especially in the evening, when fewer busses and metro were available, this was too much for us. The rooms were very small, no view (walls), the smell of cigarettes was still around and the towels in the bathroom had an awful chemical smell. The breakfast was poor and you had to be early to still have some. The pool is only available in july-august. This hotel didn't live up to what I espected from a 4* hotel and was not up to NH standards.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Krakow, Poland", "Title": "“Good and not so far from Vatican”", "Author": "sranda", "ReviewID": "UR121740579", "Content": "Hotel is located in a quiet and green area about 2 km from Vatican City. Please be aware that it is located on a hill, so if you do not take a taxi, walking there can be quite tiring. There is an outdoor swimming pool, but it was closed in October. Room has average size but it was ok, I can't complain about its cleanliness. Breakfast has quite limited choice of hot meals, but very good choice of pastries and sweets. To sum up - a good hotel for a reasonable price.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cape Cod", "Title": "“Good Hotel To Stay At”", "Author": "Peter H", "ReviewID": "UR120971948", "Content": "Stayed 3 nights as a pre cruise package.Arrived at the hotel early,10:00am on a Sunday after a flight from Boston. Asked if we could check in then and they did accomodate us so we could get a little sleep before the three couples coming after us arrived. Front desk couldn't have been more helpful.Most of our dealings were with Giuseppe Rattu who should be commended. Our room was on the 3rd floor away from most of the foot traffic and was very quiet.The room was small but was adequate for the 2 of us.Bed and furniture very comfortable.Agree carpeting and some lobby furniture was a bit tired.Breakfasts were good as was the one dinner we had.A 10-15 euro cab ride to the center.Would stay again and recommend to others.Nice to be out of the center after a day sightseeing.", "Date": "November 23, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Galveston Island, Texas", "Title": "“a refuge after hustle & bustle”", "Author": "p g", "ReviewID": "UR120835478", "Content": "LankyB - we agree with you - thoroughly enjoyed this hotel - 3-nite pre-cruise stay - a welcome quiet refuge after each day of sightseeing, crowds, and noises of the big city. We found the personnel friendly and helpful - and rooms clean and spacious. At breakfast - bacon was undercooked but were enough options to fill one heartily to take in the sights (and the walk to the Vatican) which we did the first day - after that cabbed for 7 Euros each way - that hill is a \"killer\" LOL. Had pre-arranged airport pick-up through hotel and after almost 16 hours in and out of airports and planes and security checkpoints it was the best 65 Euros ever spent! Lots of other pre-cruise guests - we formed a happy hour\" group and met in the bar each evening to share our adventures and unwind. Would certainly stay at this hotel again.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Manila, Philippines", "Title": "“Good hotel but far from sites”", "Author": "pirkkotroy", "ReviewID": "UR120693662", "Content": "Rooms are clean and facilities are modern. What it lacks for location, it covers it with it's elegant lobby, rooms and facade. Food is good and staffs are friendly. Not much nearby shops so not recommended for long stay.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“A GREAT HOTEL”", "Author": "LankyB", "ReviewID": "UR120073195", "Content": "I do not get the negative reviews on here. This is a great, huge, American Style hotel who bent over backwards to please us. The rooms are big and clean. They are NOT outdated. They have breakfast included. It's located off the beaten path in a quiet place that's a 10 Euro cab ride to the Vatican so you don't have to stay in a noisy, grafitti filled area. McDonalds is within walking distance. Ignore the negative reviews on here. Plus, it is SO reasonably priced. This is the place to stay in Rome.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Lancaster, Pennsylvania", "Title": "“Not near anything !”", "Author": "HedyS", "ReviewID": "UR118923734", "Content": "On my recent trip to Rome I stayed at this hotel 2 nights and was disappointed as its location is terrible. There is nothing close by (within walking distance) other than Vatican City which is a hike. The lobby is impressive but that's about it. The carpet in the halls and room were stained,and the buffet breakfast left much to be desired. I was with a group and they kept running out of food, coffee and coffee cups. We ate dinner one night at the hotel and it was expensive. If you want location and more for your money I would not recommend this hotel.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Avoid”", "Author": "xxx279", "ReviewID": "UR118435525", "Content": "Extraordinarily offhand service. I would NOT recommend this hotel - fleas (!), non-helpful staff, restaurant too expensive, pool (one of the main reasons for choosing this hotel) only open June-August despite brilliant weather in September", "Date": "September 22, 2011"}, {"Ratings": {"Location": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "3"}, "AuthorLocation": "wien", "Title": "“never again”", "Author": "Alexander H", "ReviewID": "UR118084163", "Content": "I stayed in september 2011 The hotel is expensive and all extras are expensive ( eg internet even in the lobby has costs ), The stuff is not friendly, The locatiion is far away from any public transport. Although it was terribly hot the pool was closed. The bar was often without service. rooms are ok. Breakfast as usual. I recommend to enjoy Rome somewhere else!", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "2.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“good and bad hotel”", "Author": "mazedaze", "ReviewID": "UR117357439", "Content": "Good things: -It is a nice hotel with a wonderful breakfast for being Italy. -You have a nice big pool. The hotel is fine if you plan to stay at the hotel your whole time. -Close to a big street when you can big food in a supermarket and there are some restaurants also. -The hotel is located on a hill so we had a great view over Rome. (we stay at the top floor, 3th) -Great and big bed. - They are really good in cleaning. Every day they clean and make the bed. Bad things: -A little drudgery room. -And the cleaning people seems to have it had to understand the “Do not disturb” sign on the door since they entering anyway. -The shower have low water pressure so it can be had to taken a good shower. -There is no children pool and the pool is deep. I am 180 cm and I have it hard to be able to stand in the pool on the bottom and still be able to breath with out difficulties. -For a four star hotel the staff is really unhelpful and speak bad English. They did not wanted to help my taxi driver to found me so he would leave and they could ordering a taxi for me and take money for it. -The webpage says they they have internet. Don't believe it it. They have 30 minutes free wifi internet in the lobby each day. At the great speed of 128 kb per second. It felted like being back to the early 90th again and sitting on a telephone modem -The location. It is really faraway from everything you want to see in Rome.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Kabul, Afghanistan", "Title": "“Would not recommend this hotel and would never return.”", "Author": "Darryl T", "ReviewID": "UR117142477", "Content": "I cant say that my standards are above the norm, and I have stayed at many hotels around the world. Im not sure what standards have been used by the people that have recommended this hotel. The lobby has been updated but the rooms are in desperate need of an update. The front desk staff seemed to be put out that they had to check us in. What a disappointment when we got to our rooms. It wouldnt have been bad if we were staying in the heart of Rome in a 100 year old hotel. Very outdated and worn. We couldnt wait to jump into the pool until we were told that we had to wear bathing caps??? Not too cool for my 17 and 18 year old sons or myself. I was trying to figure out the use of the bathing caps when a bird flew over and pooped in the pool. The bathing caps seemed kind of mute then and not all bathers were made to wear one. The 15 minute walk to the main street is on a very steep grade and I cant see anyone with mobility issues taking it on. There is a shuttle to downtown Rome but no airport shuttle. We booked for two nights but were so disappointed that we asked to cancel our second night. Even after being told by the front desk that we could cancel the reservation and our credit card would be credited, we were charged for the room and now three weeks after we are still trying to get our money back. I would recommend the Crowne Plaza St Peters hotel. Courteous staff, airport and city center shuttle, updated rooms, great breakfast, great pool (no bathing cap),and better value. A little farther away from the city center but well worth it.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent hotel & Value”", "Author": "mikemurray2009", "ReviewID": "UR117110539", "Content": "Great hotel, great staff, great pool, excellent breakfast buffet, Good overall value for money", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Toronto, Canada", "Title": "“Would never return”", "Author": "Debbie T", "ReviewID": "UR116810510", "Content": "From the time we arrived the staff we rude and it felt like we were always bothering them when asking a question. The rooms are very dated and in desperate need of updating. Food was fine, not a lot of selection. The pool was nice except that you had to wear a bathing cap when swimming......well some people did and some seemed to not have to. Only one shuttle service to downtown. No shuttle service to the airport. The 15 minute walk to the bus system is really a little longer and one must navigate a large hill on the return trip to the hotel. Had to pay for internet and WIFI only worked in the lobby. Overall, not recommended and we wouldn't return. Better off at the Sheraton Golf Parco (beautiful rooms a little closer to airport)!", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "dublin", "Title": "“Great hotel”", "Author": "lorri84", "ReviewID": "UR113690670", "Content": "I thought this hotel was a great place to stay. We asked the hotel to arrange transport for us from the airport and the driver was there waiting for us when we flew in. This cost €50 but was well worth it! When we arrived at the hotel the receptionist gave us a map and a list of tours we could do. Everyone had great English so communicating was not a problem. The room was small enough but nice and clean. The pillows were a little flat but we managed! Breakfast was good with a nice selection. We booked a lot of tours through the hotel and it worked out really well. You pay a little more to do them but when you see the length of the queques you get to skip when you have a guide, it's well worth it! For one of the tours we could not find the meeting point and missed it! The hotel was very helpful and got us a refund. The location of the is great. When you leave the grounds you take a left and then a right. it's just a few minutes from the main street where there are shops, restaurants, etc. the bus stop is almost across from Mc Donalds and brings you into town. the trip takes about 20 - 30 minutes depending on traffic. the only negative thing I have to say about the hotel is that the restaurant is crazy dear!! Overall, a good experience and I'd go back if going to Rome again.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "RHODE ISLAND", "Title": "“NICE PLACE AT A DECENT PRICE”", "Author": "4TH STOOGE", "ReviewID": "UR113138954", "Content": "If your not concerned about staying in the center of the city, this is a nice, affordable hotel. The area is ok, mostly residential apartments with stores and a few restaurants on the main street at the bottom of the hill. The ROME bus system, available at the bottom of the hill on the main street, provides great access to the sites of ROME. The Vatican is about 1 mile east, quickly reached by bus or a twenty minute walk. The included breakfast is wonderful. Lorenzo at the desk was very helpful.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Victoria, Canada", "Title": "“Room was satisfactory”", "Author": "dorothy_leong0", "ReviewID": "UR112339109", "Content": "Basically clean. Room decor needs updating. Room furnishings are outdated and a little old and worn out. Not our North american 4 star standard. Breakfast buffett is very good. A short walk to mini grocery store and a few eatery. Overall nothing terribly bad during our stay of 3 nights.", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Finland", "Title": "“Far from downtown”", "Author": "MustaPekka Posted by a Choicehotels traveler", "ReviewID": "UR111996465", "Content": "Checkin was fast and friendly. Requested a quiet room was I also got. Room was average, both in terms of space and condition. Very negative that internet is offered at a fee. Breakfast was good and met all my requirements. Location of this hotel is far away from downtown as it is in a residential area. If purpose of your visit is to see downtown, I would choose another hotel.", "Date": "June 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“DO NOT STAY IN THIS HOTEL!!!!It's dirty,the staff are rude & arrogant & it's over priced..”", "Author": "WDonnelly", "ReviewID": "UR110214455", "Content": "Myself & my partner are just back from holidays in Rome and we stayed in this hotel. We booked it on the secret hotel packages and from start to finish it was a disaster. We booked a balcony room or so we thought,when we arrived me told it wasn't and basically because we booked it through another website it was our problem.we asked to speak to the duty manager who wasn't there until the morning.The next day we finally spoke to a lady called Olga who told us that there was a mix up and that we could stay in a balcony room from Wed on (this was Tues).until this we would b moved to another room..long story short we moved rooms 4 times in 3 nights thanks to the hotels incompentence.When we finally got tot the balcony room it was FILTHY,the balcony had a view of the back of the kitchen & he had to wipe down the whole balcony area.I have photos if anyone wanta to see them. For the rest of our holiday the hotel staff practically ignored us(probably because we complained). The hotel was overpriced,expensive,dirty & the staff were atrocious.I have never seen anything like it. The area around the hotel was terrible,it's unsafe after 8 pm.the website says the hotel is 1.5km from the Vatican but its 3 cos we walked it every day! And finally when we were leaving we realised we had 75e taken from our room the night before & the hotel would hardly believe us.They refused to take the complaint seriously n ordered us a taxi and drove us literally to the airport to get rid of us. I have since contacted their customer care n guess what-they saI'd it was OUR fault!!! Rome is an amazing city,don't ruin it by staying at this hotel..I'm still angry over it.", "Date": "May 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Overall value and a warm welcome made up for location”", "Author": "Marie890", "ReviewID": "UR108676895", "Content": "We travelled to Rome in May for a long 'girls only' weekend. The hotel wasn't the usual NH boutique city hotel, rather typical of a 4* chain but the little touches such as the handwritten local map (in English) and the overall service and standard were good throughout. We opted for a taxi vs bus/walk into the city, approx 3km and 10-12 Euros (Vatican 6 Euro or 15 min walk where you can get metro or buses). Only a few negative points to mention. During one meal, our bottle of prosecco was a little too 'lively' for our waitress and poured onto the floor upon opening. We weren't impressed when she tried to stem the flow with the palm of her hand and asked for another bottle when it was offered to us! Menu choice for dinner was adequate, tasty but only opted for pasta and salad during our stay. The literrally translated menu gave us a chuckle (sea lupins aka baby clams and noodless). Also, the hotel is often used as a city base for stay/cruise and coach tour guests, which can be irritating when located in a room close to the lifts when pick-up is 7am! The breakfast buffet was excellent, choices were varied and available from 7-10am which set us up for a long day of sightseeing and shopping.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "wm", "Title": "“pricy, wouldnt stay again.”", "Author": "12121212Wm", "ReviewID": "UR106568244", "Content": "booked through that \"secret hotel location\" thing online for a special deal. Hotel itself was clean and nice. Room air con was very weak so we slept with windows open but very heavy traffic at will wake you in the early morning. The pool does not open until the summer months also. The minibar available in your room is very expensive, €4.80 for a can of coke, €5 for a juice, the menu in the room has all of the prices definately review these before using anything. A cup of tea was 6.80!!! These prices do not reflect any place we went to during our stay . It is far too expensive to eat or drink there, a round of : 2 pints of heinken, 2 jack daniels with no mixer was €34. the walk to vatican took 30 mins didnt mind this the first day but found it very difficult after going back and forth for the few days we were there. A taxi to the vatican costs €13. taxi to airport cost €50 this was for 4 people for a minivan taxi cost €65. cost 840 for 4 people for 5 nights with breakfast", "Date": "May 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "manchester", "Title": "“Nothing great or special”", "Author": "kennydoll", "ReviewID": "UR106204406", "Content": "After reading the reviews, I felt happy going with this hotel considering the price we paid for it via a different website. Rooms - asked for a double, to be given a twin. Asked to be moved, but new room STUNK of cigarette smoke. Asked for a different room only to be given a double room used as a single (couldn't move round both sides of the bed) which was very dusty and carpet needed a good hoover. I could pick up stuff off the carpet. After going back to reception we were told that they could move us tomorrow. We opted for the twin room as it was the cleanest. The following morning we spoke with reception about moving but it ment us waiting to move and with us having such a short time in Rome, we decided that we would be in our room very little so decided to stay where we were. The hotel is used by a lot of tour companies and cruise lines so is always busy. The noise outside our room often began at 6am as people began to check out or luggage was collected for the tours. The beds were okay, pillows hard and rubbish. We asked for extra ones but they were no better leaving me sleeping without one as this was more comfortable. House keeping was okay, they didn't change the sheets or vacuum the carpet the entire time we were there. The sheets/towels I am okay with but when you can see a carpet or floor needs a quick brush you kinda think it will be done. Basically, once you are there, they just make the bed and refold your towels. Don't expect anything else. The hotel is also VERY warm. We slept with our window's open and AC off as this was the coolest but it is a balancing act between the street noise and the heat. Living on a busy street at home made this a simple choice for us. FOOD: Very little in the area to dine on. Supermarket close to bus stop for bits if you need them. Breakfast in hotel was fine. Service in the bar at night was poor. I waited 15 minutes for service one night and that was after going to reception to ask for someone to serve me. FACILITIES: Gym was tiny and in 3 attempts to get there due to cleaning or technical difficulties it was only open once. Pool was closed but we knew that. LOCATION: horrible location in terms of from the airport. We decided to DIY it without the taxi using buses/metro. Took us 2.5 hours from airport to hotel. Take a Taxi. In terms of getting around each day. Bus stop is a 5 minute walk. Talk the 916 to vatican and down to pantheon etc(every 15 mins). Don't waste your time going to metro. Bus 31 is every half hour to metro so stuck to other bus. Take a good map with you as one hotel gives you stops at the colosseum. Considering this is an NH hotel, It seriously lets the chain down. It was okay! nothing special, nothing great, nothing terrible but I am certain that we could have paid the same amount and got a better hotel.", "Date": "April 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Carcassonne", "Title": "“OK Hotel, but bad location for sight seeing.”", "Author": "Badger_10177", "ReviewID": "UR98765421", "Content": "The hotel was nice enough, reasonable breakfast, quiet comfortable rooms. The main problem was the distance to the city centre and its travel connections. Unless you travel by cab, you're restricted by buses and the last bus is at midnight, so you're clock watching! It was also too far and difficult to return to the hotel to get ready to go out in the evening, so once out in the morning you stay there. The internet was very pricey also.", "Date": "March 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Great hotel lead to a great holiday”", "Author": "callumbann", "ReviewID": "UR74214754", "Content": "A great hotel in a decent location only about a mile from the Vatican the hotel was very clean and the rooms were great with a little fridge ,great beds ,very clean and up to date bathroom with a power shower ,there was a safe and a tv with some english speaking channels. the pool was great very clean the only problem was there wasn't many chairs but it was a god sent with the hot weather .We arranged for the hotel to pick us up at the airport and take us straight there we didn't want to faf about with getting the train to termini station and we didn't want to be scammed by the taxis waiting to rip off tourists. It cost about 65 euros which was defiantly worth the hassle free trip to the hotel. The location of the hotel was pretty good with 2 good supermarkets near by there was a limited number of restaurants near the hotel and the hotel restaurant was very expensive and it didn't have a great menu. the best way to see rome was to get on one of the city sightseeing tour buses and the nearest pick up point was at the vatican for the first few days we walked the mile to the vatican and back for about 3 days and we just couldnt do it anymore it was tiring especially after a long day walking around rome . So for the last few days we got the hotel to ring a taxi up to take us to the vatican the taxi came in less than 5 mins and it cost about 12 euros for 4 people and at the end of the day we would get it back .If only we had done it from the start of the holiday that would be my best tip if you stay at this hotel.In all the hotel was very good and defiantly worth its 4 star rating the location wasn't such a big problem if you were willing to get a taxi and over all our holiday was great .", "Date": "August 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Tifton, Georgia", "Title": "“Very Nice Hotel To Stay At”", "Author": "lloydmare", "ReviewID": "UR74192248", "Content": "This hotel is great! We have stayed at it during three vacations. The rooms are bigger than most you'll find in most hotels in Europe. Breakfast was plentiful each morning. Every question that we asked, the staff was pleasant and helpful. The location isn't Rome center, but you can easily catch a bus to get to your destination. There is an ATM on location, which is very convenient. The swimming pool is nice to cool off in after sightseeing.", "Date": "August 7, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Malta", "Title": "“An average hotel”", "Author": "Tony M", "ReviewID": "UR74033907", "Content": "This hotel is not far from the vatican and is located in what seems to be an upmarket area of Rome. First impressions are good as reception and pool areas are smart. Check-in was smooth and efficient. However the room was a disappointment because it was small with little workspace whilst the furnishings were old and tired. It had no tea and coffee making facilities which one would expect for the price paid. Albeit the room including linen and bathroom were clean! Breakfast had both hot and cold buffet, with a reasonable but not expansive selection.", "Date": "August 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "O'Fallon, Missouri", "Title": "“Hotel to far from center unless you really like to walk.”", "Author": "ceet69", "ReviewID": "UR66863210", "Content": "Breakfast very good! Room OK. Clean. Pillow as hard as a rock. No coffee/tea service to relax with in room. Pool looked very nice. Staff appeared to be stuffy and unfriendly. A real communication barrier exists with no one trying to break it down.", "Date": "June 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Modena, Italy", "Title": "“Good 4 star, renovation would benefit”", "Author": "apvac", "ReviewID": "UR52376769", "Content": "The position is good: in the city. a few kilometers from the main attractions. You can easily walk out and find shops, get a taxi, walk to the metro or reach Saint Peters (less than 3km). Easy to reach by car, large parking partly covered (in the basement, although unguarded). The hotel is on a little hill, there are fine views from many rooms, there is an outdoor swimming pool. The hotel decor is good although a little dated. I had a room with queen bed. The room was average size, had everything needed but looked old and a little tired. Some stains on carpet and walls, worn bathroom, old CRT TV, small safe (room for netbook only), limited minibar choice. Since the Hotel is now part of the NH family, I hope that renovation will take place. Service has been excellent both at reception and the restaurant. Food in the restaurant was good enough. Breakfast food was sufficiently varied and constantly replenished. Overall it was a good and comfortable experience. This hotel has a beatiful structure and a good position: it could easily become an excellent choice in Rome after renovations. Nonetheless, it still remains a good choice that you will not regret, if you can live with dated rooms. After all, this remains much better than many other more expensive hotels in the city.", "Date": "January 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Dublin", "Title": "“Stayed for 4 nights”", "Author": "GoldfinchDublin", "ReviewID": "UR45222833", "Content": "We are back from a trip to Rome with a group and stayed here , the pool was closed despite 32 degrees in the afternoon and we would have loved a swim . The room faced the road and the traffic noise was awful, we couldnt leave the window open and even closed it was too loud and woke us at 5am . The breakfast was adequate but nothing special .", "Date": "September 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Worcester, England", "Title": "“Villa Carpegna with a car!”", "Author": "Wood501", "ReviewID": "UR39468806", "Content": "I stayed at this hotel for 7 days in the middle of August with my husband and 11 year old son. Good hotel, in my opinion correctly rated as a 4 star. The rooms were typically Italian with lots of dark wood and a super king sized bed, we also had an additional bed for our son which was a bit of a squeeze but perfectly ok, the bathroom was adequate; fitted out with bidet, shower over bath etc. finished in granite, copious amounts of hot water and good water pressure. Breakfast was good but if you’re expecting a ‘Full English’ breakfast you will be disappointed. The pool was an absolute God send and was one of the reasons we chose this hotel, there was a large conference taking place at the hotel during our stay and there was a scramble for sun beds on the days the delegates were at the hotel and many people were disappointed (I couldn’t understand why they didn’t have more sun beds as there was plenty of room to accommodate them), as soon as they had departed the pool area was deserted for the rest of our stay. Service around the pool was lacking to say the least; to order drinks you went to the pool attendant and waited whilst he got them from a store at the back of the pool and then you took them to where you were seated; not the sort of service you expect when you are paying 4 Euros for a Coca-Cola. The staff were the ‘down’ side; I left my glasses case on the table at breakfast and returned 5 minutes after I realised what I had done, they denied having seen it! They charged 10 Euros for a Grenadine and Lemonade, the same price as a Gin and Tonic, for those of you who don’t realise Grenadine is a non alcoholic syrup when we expressed our concerns the member of staff was positively rude and we still ended up having to pay 10 Euros for what effectively was equivalent to a orange juice and lemonade. All in all the staff were a miserable bunch which was a real shame because the hotel itself was really very agreeable. The position of the hotel was quite good as far as we were concerned; it was a good 20 minute walk to the Vatican and in the 40° heat of August was not something I wished to contemplate. My husband had unfortunately had an accident shortly before we left for Rome which made walking long distances a problem so we decided to hire a car at the last minute. The car was brilliant, plenty of parking at the hotel which is positioned at the top of a fairly big hill not one that I would have fancied walking up after a day of sightseeing. We drove everywhere, my husband has sat.nav. on his mobile phone with all the maps of Europe, we drove to all the main tourist sites, had no problem parking with meters everywhere. Having a car gave us the flexibility to drive to the coast only 30 minutes away and have a day on the beach, we drove to Tivoli, 30 minutes inland and went around the famous gardens – a really good afternoon and the day we came home we had lunch in Frascati, just 15 minutes from Ciampino airport. We were VERY thankful that we had hired a car as the position of the hotel is not ideal without one. (Please note that it was August and most the residents of Rome leave the city, we don’t know whether it would be quite so easy to park the rest of the year) Overall I would recommend staying here, we had a great week, it made a good place to base ourselves and if we return to Rome in the future we would probably stay here again but not without a car.", "Date": "September 1, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "greece", "Title": "“Very good choice”", "Author": "cult1", "ReviewID": "UR36172504", "Content": "The hotel was excellent.Great big rooms, good location,excellent breakfast.However the stuff was not friendly enough.The reception was far away from the customers.And i saw something i will never forget.In a dinner with spaghetti when we asked for some extra cheese a waitress came over us and pour some in our plates instead of leaving it on our table.And the fact that for 2 straight days ,in a prepaid meal it was served almost the same food was much frustrating.", "Date": "July 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Hollywood, Florida", "Title": "“Friendly, welcoming and accommodating!”", "Author": "pateLio", "ReviewID": "UR34366358", "Content": "Our group of Italian teachers has been here for just about three weeks and we cannot agree more that it is like home. The rooms are spacious, we have been having dinner in our rooms with up to 7 people. There are two supermarkets near by so \"dining in\" is very easy and affordable. The restaurant is good, QUALITY at times, but pricey. Since our stay is long, we have to pursue the supermarket route. Since we are a large group of 25, there are bound to be small issues with a room, etc. The staff here was and has been so accommodating. We were moved quickly when the wi-fi wasn't working in our room. Luggage was easily stowed for a quick trip to Florence -read other review!-, and we were welcomed back home with hugs and kisses from the wait staff. As we sat down to eat yesterday, we all smiled and played jokes and tricks with the staff as they have become like family to us. The pool is lovely, large and refreshing. The gym is small but works. The conference rooms are comfortable and spacious. The location is about 15 minutes, on foot, west of the Vatican. Buses are easy and the bus stop is right to the left of the hotel's entrance. A taxi can run around 10-14 euro at night, depending your location and the hour. And of course the neighborhood at the foot of the hill here is great. 2 supermarkets, pizzeria; RISKY POINT for a pizza and a beer and local young Romans. If you can afford it, come here! We have been blessed and lucky to have this whole experience.", "Date": "July 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“NH Villa Carpegna - Nice Hotel!”", "Author": "Bonnsoir", "ReviewID": "UR33011875", "Content": "Now officially an NH property, the Villa Carpegna was a Nice Hotel in an okay location. The rooms were clean and neat, although a bit dated-looking - not like the newer / contemporary NH's I've stayed in.. The staff were very friendly - the bar staff were great. Food? Well, there was plenty of breakfast and a good varierty, catering for most European tastes but I wouldn't pay the prices for the evening meal. Way too expensive and who wants to eat in the hotel, when you have all of Roma!?! Anyway, I enjoyed my stay and would probably go back. The pool looked fabulous but we never got the chance to go in as it didn't open until 10:00 and was off-limits by the time we returned from sight-seeing in the evening (basically after 19:00 - but maybe the timeframe is seasonal?). Hey-ho, just something you might want to consider if a pool is a must-have - this was one of my reasons for booking the NH; the thought of an invigorating swim in the morning or a cool dip post tourist-day. So, getting there / out & about. Loads of buses into town unless of course it's belting down like it did on our first day and you have to get a taxi to Piazza San Pietro ... and get ripped off ... lol. Because we got into Ciampino late-on, we jumped on the Terravision bus to Stazione Termini then got a taxi to the hotel - get the bus tickets from the vendor outside of the airport, they're cheaper and a return is best. You won't miss the \"touts\" waiting for you. Alternatively, if your cost-cutting get the Metropolitana - either from Anagnina (nearest Metro to the airport) or Termini to Cornelia, then jump on buses: 916, 791, 190, 98, 46/ or C6 a few stops down to Via Gregorio VIII and get off at McDonalds! Similarly, going into town there's a host of buses near to the McDonald's stop but you may want to download a map or buy one for EUR2.50, it helps. You can walk to Piazza San Pietro - weather permitting - we used this as our starting point and walked most places from there. The Metro is easy to use though but get a pass - 3 days was EUR11 I think and can be used on the buses too. I tried 3 tobacconist's but they'd ran out of the 3 day one's so I just got ours from the machines in the stations. Where was I? Oh yes, McDonald's. I didn't have a detailed map at first so if you are on Via Gregorio VIII with McDonald's to your right, head up to the corner towards another main road - keeping to the left (I think there's a Renault-Nissan showroom on the left) then take this left. Continue a little further on, past the petrol station on your right and do another left. You should see the hotel entrance / drive on the right over the road. I found the public transport great to use but could have done with a heads up before I went.", "Date": "June 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Great base”", "Author": "MrsLS", "ReviewID": "UR29821307", "Content": "Booked up this hotel on a website under the 'top secret hotel' guise. Have to say I was worried having read all the reviews. Happy to say I was very happily surprised. Whilst yes it is a little way out (20 min walk to the Vatican), it is a great spacious hotel of very good standard. The breakfast is excellent, a great selection for all, the staff very friendly and helpful. If you want a central hotel where you don't have to travel then this isn't for you, however if you want somewhere away from all the hussle and bussle this is ideal. I would recommend this hotel and would stay again.", "Date": "May 12, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "orlando, fl", "Title": "“Disappointing, at best”", "Author": "roxieb", "ReviewID": "UR28475452", "Content": "The room level was standard. Although it was clean, it was incredibly small and claustrophobic. The weather was nice, but you could not leave your window open because of the loud traffic noise. Amazingly enough, it had nowhere to store your clothes - not a dresser drawer to be found, only a very small, hard to access closed with a limited number of hangers. The hotel did not have an iron for guests to use, forcing me to use their laundry service to have two skirts and a blouse pressed at at cost of 16.50 euro. The staff were in general cold at best, rude at worst. The food was extremely marginal. Breakfast every single day was snotty eggs and extremely undercooked bacon. Dinner every night was a pasta, and most times, a mystery meat served lukewarm at best. From night to night they could not agree on whether or not coffe was at an extra charge or not. Members of our party were the victim of a bait and switch when they ordered two bottles of Chianti which were listed on the menu at 12 euro. When they received the bill, they were charged 20 euro. The kitchen manager said they were out of the wine which was ordered so they substituted without approval from the patron. They refused to adjust the bill. We sincerely feel that because so many tour groups stay there, they really have no incentive to make you happy - what the heck, another group is coming right behind you. I would not recommend this hotel to my friends.", "Date": "April 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Malmo, Sweden", "Title": "“Wonderful pool area – but a bit far out”", "Author": "DenmarkLotte", "ReviewID": "UR24376420", "Content": "This hotel is great – especially if you visit Rome during the hot summer months. The hotel itself and the room are average without much charm. Great breakfast buffet. But what really makes a different is the pool area. That is absolute great. We spend a week in Rome in July and enjoyed to combine the historical sight of Rome with some relaxing afternoons at the pool. The location is a bit far out the city centre but if you don’t mind walking it’s only about 30 minutes walk from the centre. There is also good connection with the bus. If you only visit Rome for a very few days I will prefer a hotel closer to the city. But in our situation it was great", "Date": "February 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "1"}, "AuthorLocation": "England", "Title": "“A very nice hotel but too far out”", "Author": "puddyhustonEngland", "ReviewID": "UR20217392", "Content": "I stayed at this hotel with my daughter from Saturday September 13th to Wednesday 17th and it was very nice but just too far out and a real nuisance to get home some nights, we had to get a bus to the metro and if it was late when we were going home we had to get a taxi . If I ever go to Rome again I would want to stay near the centre where I could walk home from most places of interest. Rome is very expensive and taxi fares are too much. They provide computer and internet for 5 euros for half an hour but the keyboard is atrocious and I told them this, it just sticks all the time and the chair is so low. The breakfasts were lovely and the staff were nice, well those I spoke to. If you do not mind being so far out it is a lovely place to stay.", "Date": "September 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Bolton, United Kingdom", "Title": "“Great stay at Jolly Hotel Carpegna”", "Author": "boltonlad", "ReviewID": "UR20176040", "Content": "Stayed in the hotel in august for 3 nights and had a great stay, the rooms were nice and clean, breakfast was fantastic they had a great selection including actimels, yogurt, toast, scrambled egg, bacon, sausage, jams, fruit, pastries, coissants etc The pool was great for sunbathing and relaxing after a long and hot day out, although it is very cold so you have to brave but its worth it. The hotel bar and restaurant might seem expensive but only at first until you realise how dear everything in central Rome is. We ate in the hotel restaurant the first night and it was the best meal we had in rome. The location is abit out the centre but not far, about 11euro in a taxi or you can get the bus but gettin a ticket for them is a different matter!!", "Date": "September 18, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Netherlands", "Title": "“never go here”", "Author": "ELREY123", "ReviewID": "UR18715876", "Content": "We made a reservation 2 months in advance. Upon arrival, at 21.00 PM, the desk clerk told us that, due to technical problems, the room was not available and we had to move to another hotel. This was clearly not true, since rooms are not unavailable due to technical problems. Another couple was told the same, which I found highly suspicious. What technicality could it be, and in at least two rooms ? No answers of course. The truth is this hotel overbooks continuously and dumps the less paying guests at the last instant. It is a habit one can encounter in major city's. But the lying makes it such a poor performance. Do they think your stupid or so ? And why not call in advance ? Because that would give the guest the possibily to go elsewere. Now, a befriended hotel picks up the stressed guests, and probably pays for it too. The hotel staff seemed not in the leasted interested in our troubles, it is a daily routine it appears.", "Date": "August 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Tifton, Georgia", "Title": "“Great Hotel”", "Author": "lloydmare", "ReviewID": "UR18358409", "Content": "My husband and I stayed at Jolly Hotel Carpegna for six nights. The rooms are large compared to many hotels within the central part of Rome. Breakfast was very plentiful each morning. The front desk was very helpful whenever we had questions. We caught the 571 or 916 bus (bus stop is about 4 blocks from hotel not far from the McDonald's) daily to visit the monuments. The swimming pool was very nice to cool off in after sightseeing. We had previously stayed at this hotel in 2005, and were drawn back to it because of the size of the rooms and the many amenities that the hotel offered.", "Date": "July 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sydney", "Title": "“Pretty good, but with some drawbacks....”", "Author": "Sedona2222", "ReviewID": "UR10658421", "Content": "Our young family stayed at the Jolly for 5 nights in mid summer, having been strongly (and correctly) advised that pool & aircon were almost mandatory for travelling in kids in Italy at that time of year. We found it a pretty good value compromise. Basically you get the pool, ac & decent rooms for a good price. However you also get the pain of being well out from the centre of town: it's around 2kms west of the Vatican. Nearest Metro is a 15 minute walk up a hefty hill, so most residents stick to the nearby buses to get into town. These may or may not come quickly, can be hot in the summer, and will still take 15-20 mins to get anywhere interesting. Taxis are quick to arrive, but at 10 or 12 euros each way, get expensive fast. Likes: Quiet rooms: double glazed (yet openable) windows. Well behaved aircon Friendly staff throughout the stay. Decent breakfast Dislikes: Pain of getting into the centre. Expensive restaurant, with not much else close by.", "Date": "November 7, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Padua, Italy", "Title": "“The hotel is very good, but location is not”", "Author": "MemberfromPadova", "ReviewID": "UR10459158", "Content": "The hotel is quite new and has very well appointed, clean rooms. Food is good as well. The only problem is location. It is actually not that far from city centre, as you can get to St. Peter's and the Vatican by a single bus ride. However, as the hotel can be only be reached by bus or taxi, the bustling and chaotic traffic of Rome does make the difference. Timing is really unpredictable as a short ride normally taking 15-20 minutes may become a nightmare lasting over 1 hour at peak hours and/or inclement weather. In the end, it is a very good business hotel. If you are visiting Rome for sightseeing other than cars and traffic, you should better search for a different option where commuting by car or bus to major attractions can be avoided.", "Date": "October 30, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Essex", "Title": "“Weekend traveller”", "Author": "weekenderEssex", "ReviewID": "UR10041694", "Content": "Stayed for 4 nights. Good location away from the city centre. Travelling wasn't a problem once we had bought a bus map from the hotel shop. The room was comfortable and for a short stay the limited storage space was adequate. The only meal we had at the hotel was breakfast, which provided a good start to the day. I would be happy to stay there again.", "Date": "October 5, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "calgary, ab", "Title": "“Location wasn't great but decent hotel”", "Author": "globetrotters21", "ReviewID": "UR8443654", "Content": "My husband and I went on a 2 week trip to Italy and France via Globus tours, Rome was our first stop. And this hotel was booked by Globus. It was fine for our 2 night stay. Rooms were clean with 2 twin beds (in our past trips to Europe - double/queen beds are hard to come by, so they usually just push 2 twins together). There was a mini bar, fridge and only 2 towels - face towels are also rare so you may want to request more. Also, the TV was all Italian except for CNN, so if you suffer from jetlag bring a book. There was also a nice pool and a VERY BASIC gym. Location was lacking. There wasn't a lot of places to eat near by, there was a McDonalds a couple blocks down the road. Along with a super market. So if you were hungry, your only quick option would have been the hotel restaurant/bar. The restaurant wasn't open for lunch but the bar was - with only sandwichs and salads to offer - that said it was pretty pricey. A grilled cheese sandwich was about 7 euros. Buffet breakfasts were included in our package. And they offered a nice selection of fruits, cereals, croissants, rolls, cheeses, cold cuts, etc. For us North Americans, they also had warm dishers like bacon and scrambled eggs - which was usually runny. Tourist attractions weren't too close to the hotel - about a 20 minute cab ride to them (costing about 15 euros a trip) but you can take a bus to the Colosseum. All in all - not bad being part of a tour group but you may want to choose something closer if you don't have means of transportation.", "Date": "August 17, 2007"}, {"Ratings": {"Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Far, Far Away!”", "Author": "edmontontraveller11", "ReviewID": "UR8440228", "Content": "We booked this hotel after reading reviews but would not recommend it. Firstly, it was far from the major sites in Rome. Even the Vatican was a fair distance, especially in +40 degrees C when we were there. The front desk staff were talking amongst themselves every time we came down and would greet you when it was convenient to the conversation. They were helpful with bus routes but they really had to be because the hotel was so far from downtown. There was a bad smell in the hallway as you got off the elevator on to our floor. It didn't seem to matter when we went down for breakfast but we always had to wait for a table. They would only open a small section of the restaurant so that when we got a table we always felt rushed by the people in line staring at us.", "Date": "August 17, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Syracuse, NY", "Title": "“overall a great choice”", "Author": "zeczeczec", "ReviewID": "UR8356250", "Content": "Stayed at the Jolly Villa Carpegna in July 2007 for 4 nights. Room were standard with a minibar. Nice marble bathroom with a decorative but not very functional 1/2 length glass panel instead of a curtain on the tub. Beds were firm but I like them that way. Hotel is approximately a $50 cab ride from Ciampino airport. On the trip to the hotel, the driver took the freeway and it was very quick. On the trip back to the airport, he went through town and it took much longer but was more scenic. The free buffet breakfast was great, except for the runny scrambled eggs which may be how they are done locally. Great selection of good quality breads, buns, meats, cheeses, bacon, scrambled eggs, cereals, juices, yoghurt, fruits, donuts and other sweet baked goods. You will not go hungry. Hotel is located in a residential neighborhood on a small hill about a five minute walk from a main street, Gregorio VII. There you will find a bunch of shops for most of your needs, including banks, and small supermarkets and even a McDonalds in the neighborhood. We used the ATM at the Bank of Rome to get cash. On that small street there are several great restaurants and another supermarket. We usually ate at least one meal daily of sandwiches and fruit and snacks we purchased and ate in the room. Cheap and tastey. Best restaurants in the area were the Siciliana for ice cream and desserts, Risky Point, a neighborhood bar/restaurant with great pizza and also found a great little family run restaurant next to a butcher shop in the area that had a very atmospheric back dining area and a nice menu with hearty, well prepared meals. Highly recommended for dinner and much better than anything we found in the touristy areas. There is also a bus stop a bit further down from the McDonalds that will take you past the Vatican and go all the way to the Colosseum. We took the bus 571 (the hotel has local maps with that information), every day and found it worked really well to get to all the sights and travel into the old city. The busses do stop early though. It seemed like no matter where we were in Rome a cab back to the hotel would cost between 8 and 12 Euros, not that bad. All the tourist attractions seemed to be about a 6 to 10 block walk from each other so despite the high heat of July it was easy to cram in lots of sightseeing on foot. We did it on our own, The tour bus people following guides around didn't seem to be having much fun and were hoofing it anyway, we just saved the expense. The hotel pool was nice. Water felt cool even on scorching hot days. Good quality lounge chairs (but not enough of them), food and drink service, and lots of sun umbrellas. Great spending afternoons there. Housekeeping staff were thorough, changed and refilled everything as needed. Towel change was optional but they had no problem doing it. Personally I don't mid re-using a towel. The Cons: The hotel is a couple of miles from most of the sights. The only thing in walking distance was the vatican and nearby areas. The front desk people weren't especially knowledgeable or friendly. The hotel was wired and Internet available, but if you used their computers it cost $10 Euros an hour, and they used some unliscensed software for browsing that would freeze the system for 30 seconds with a message to register the program every five minutes. Very annoying at those exorbitant prices. Also had some extra phone calls on the final bill. It irks me when I get stuck paying for the maids personal calls at a hotel (not the first time), even if it is just a dollar or two on the bill. The checkout staff wouldn't budge on the phone calls though. Overall a great stay at the Jolly Villa Carpegna with a couple of minor negatives.", "Date": "August 5, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kansas City, MO", "Title": "“A pleasant stay”", "Author": "KCRookie", "ReviewID": "UR8347133", "Content": "My wife and I stayed at the Villa Carpegna for three nights in August as a post cruise package. This was our first time in Rome but not in Europe. Our room was about the same size as your average American hotel. We had a good view of the pool. For me two important features in the bathroom are strong water pressure and large towels, and the Carpegna had both. Though it was hot in Rome, our room had great air conditioning. Breakfast was included and was buffet style with plenty to choose from. For my taste the scrambled eggs needed more cooking time; they were very runny. But the many breads and pastries helped me overlook the eggs. We had dinner all three nights in the hotel's restaurant. Everything we ate was delicious though the menu's offerings were rather expensive, but what isn't in Europe? Though the hotel is located outside central Rome, it is in a quiet neighborhood and is only a twenty to thirty minute walk to the Vatican. A couple of blocks from the hotel on Gregorio you can catch bus 571 to St. Peter's and on to the Colosseum--one Euro for a one-way trip, one of Rome's best deals!", "Date": "August 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Austin, TX", "Title": "“Nice Hotel, Good (not great) Location”", "Author": "RFD", "ReviewID": "UR7365971", "Content": "We stayed at this hotel for 2 nights on a Globus escorted tour in mid March. Our flight landed at FCO around 4:30 p.m. on a Monday afternoon and after clearing customs, we encountered some agents at the airport who wanted 60 euros to take us to the hotel. We walked past them and got a standard taxi. The ride took about 30 minutes and cost 35 euros including tip. I don't know what the hotel is rated but I'd say it's a strong 3 star. The room was small but nice, the bathroom was very nice, and the common areas were nice. The breakfast buffet was very good and the staff was very good. The location is not far from the Vatican but not really close to anything, located in a residential area. There's a McDonald's very close down the hill from the hotel along with some shops. I would definately stay here again.", "Date": "April 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Wonderful Option”", "Author": "Dublinfemale", "ReviewID": "UR7338326", "Content": "We arrived into Fiumicino airport at 9pm and took taxi to hotel – be advised that there is a standard taxi rate into Rome of €60.00. The Jolly Villa Carpegna Hotel is situated in a smart residential area about 4 kilometers from the centre of Rome. The entrance is impressive as was the lobby. Staff, were helpful and our room was spacious and quiet, overlooking a green area. Breakfast in the smart dining area was a feast! But be warned it stops at 10.00am. As we were there in April we had no use for the pool, which is a fine size but I suspect it would be most welcome treat after a hot day sightseeing in the summer. There was a piano player every night in the bar but not many guests, this might have been due to time of year. You can walk easily from the hotel to the Vatican (down hill – about 15 mins) or take a bus. From the Centre of Rome back to the hotel is a €10 .00 taxi. The hotel offer a Limousine service to the hotel – avoid it. They quoted us €55.00 to our departure airport Ciampino saying a taxi would cost as much. Not so! The taxi, which they called for us, cost €30.00. I would recommend this hotel as an oasis close to the wonderful busy noisy city of Rome.", "Date": "April 12, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“OK but a bit far out”", "Author": "LondonMisses", "ReviewID": "UR6821391", "Content": "We stayed here as my friend was getting married in Rome. The hotel had a lovely pool which was really appreciated after a hot day of sight seeing. The vatican is within easy reach but the rest of Rome is a bit of a mission you need to rely on public transport which isn't very easy to work out metro is fine but the buses are tricky (no metro nearby at least 20 minute walk). There are very few restaurants nearby and the hotel menu wasn't very appealing so we used to go to Traverse (not sure of spelling) which is where the locals go for dinner. There are some great tradiitonal retsaurants and they aren't expensive. From the hotel you have to get a taxi which cost us 20 euros each way which worked out pretty expensive over the week. The hotel was clean and smart, but it did often feel very formal and business like.", "Date": "February 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New York", "Title": "“Outside of town”", "Author": "DiFred", "ReviewID": "UR6051588", "Content": "The Jolly Hotel was outside of town by the Vatican. We saved a lot of money by taking the public buses instead of taxis. It was a quick walk down the hill to the main street to catch the bus. Breakfast was more than enough, they had a big selection of food, even though the eggs were runny. The lobby was spacious, the rooms were clean and well kept. I would ask for a non-smoking area. The halls did have a smokers smell to them. One drawback was that the area didn't have many local restaurants to choose from. We wound up taking the bus to go back closer to town to eat. We didn't try the hotel restaurant.", "Date": "November 3, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "long island, new york", "Title": "“LOCATION IDEAL-ROOMS VERY SMALL-STAFF STUFFY”", "Author": "mike21212", "ReviewID": "UR5901221", "Content": "Just returned from Italy. Stayed 3 nights at this hotel. The location was ideal since we didn't want to stay in the heart of Rome. As expected the rooms were very small. The staff was not helpful at all.", "Date": "October 2, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Henderson, Nv.", "Title": "“Close to Vatican - Quiet”", "Author": "toomacks", "ReviewID": "UR5893781", "Content": "The Villa Carpegna is located in a quiet neighborhood about a 45 minute walk to the Vatican and its treasures. T.V. /radio is in the bedroom but sound is automatically piped into the travertine bathroom. Tub and shower combo with variable showerhead. Bar and dining area appear new, or just well taken care of. Very clean, quiet hotel. Breakfast buffet oferings were many and plentiful. Small elevators hold 6 person maximum. This is a definite re-stay hotel when in Rome.", "Date": "September 30, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Location": "5"}, "AuthorLocation": "Chew Moor, Bolton, Lancashire", "Title": "“Ideal - not in the centre but close enough”", "Author": "MichaelC1968", "ReviewID": "UR5888070", "Content": "This hotel is an ideal base for sightseeing in Rome. The rooms are comfortable the breakfast was very good and to have a pool in such a hotel is an added bonus. Its about a 15 minute walk (downhill) to the Vatican or just get on one of the frequent buses which run from the main road 150m from the hotel - we had a 3 day Roma pass which includes bus and metro travel as well as queue jumping at the Colosseum - worth the cost on its own. All the staff we came into contact with were very helpfull and I would happily recommend this hotel. Overall much better value than a hotel in the City Centre.", "Date": "September 28, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Amersham, Bucks. UK", "Title": "“September break”", "Author": "Banditrider", "ReviewID": "UR5829482", "Content": "We stayed here from 19-22nd, and were hoping that it would live up to it's name. The rooms were fine-clean, big enough and situated on the rear side of the hotel which was probably the quieter side as the road which runs past it is rather busy! Unfotuneatly the pool had closed the weekend before we arrived, even though the temperatures were in the mid-late 20's, which was a disappointment. I think they close it for no other reason other than cutting costs, as no one I asked could give me an explaination as to why it was closed. Despite what other contributors to this site have said, the breakfast buffet was being replenished throughout the opening times, with a good selection of breads, jams, cold cuts, cheeses and cakes, sweet pastries. Although not much interaction with the staff as we obviously couldn't speak much Italian. Location wise, it was a little too far out of town for what we wanted, and we didn't find the bus service that easy to use, and the road traffic is hideaous in the area and into the central areas. Found a lovely restaurant in the main shopping street from the hotel, a Sardinian restaurant with lovely homely food, with great fresh produce. Good house wines, very reasonable. The hotel stored our baggage all day for us, so that we didn't have to worry about where to store them safely, and it was no problem for them to book us a taxi to the station, and confirm it was on its way for us. All in all, a nice hotel, about right for the money, and would suit those that don't mind experimenting with the local transport.", "Date": "September 23, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "durham UK", "Title": "“Jolly holiday”", "Author": "pinstrips", "ReviewID": "UR5764744", "Content": "We have just returned from a week in this hotel where we stayed with our 2 children aged 13 and 17. The selection was made as a bargain choice on Last Minute.com. One important factor that influenced choice was the hotel pool which certainly lived up to expectations and was essential for relaxation after touring the sites in the high temperatures of August in Rome. The staff were friendly and helpful although the suggestion that a walk to St Peters was about 15 minutes must have been with a strong following wind and definitely not with 2 children in tow! Street maps and additional written directions for specific bus routes were provided on request. The main attractions and sites could all be reached within 10-20 minutes by bus (and Metro). Rooms were clean and well-serviced although the a/c was a bit noisy. The breakfast was the only meal we had in the hotel and was pretty much consistent with a traditional European-type buffet. A buffet lunch on the terrace was also available (for 14 Euros) although the restaurant seemed to be only sparsely populated apart from at breakfast; no doubt because of the vast array of options for eating in Rome. There were shops within a 5-minute walk from the hotel and these included a supermarket and an excellent, small pizzeria that was open most hours of the day and night and where any amount of pizza could be purchased at very reasonable prices. There is also a McDonalds close by for those who simply are unable to 'do without'. A few minutes' walk down the road towards the City is the Restaurant Del Sardo which at a glance appears to be nothing too special but the staff were friendly and the food certainly compared more than favourably with many restaurants in the City. A small tip also secured a splendid 2007 Pope calender with 12 seasonal pictures of PBXV1including a festive appearance in a Santa's hat; try looking at that and keeping a straight face! Bus tickets (that must be purchased before boarding public transport) could be obtained from the newsagent/tobacco shop (Tabacchi) near the hotel which, according to the sign on the door, is open between 08.00-13.00 and then 16.00-19.30. Do not rely on these times however as the staff seemed to close and open on a fairly random basis! On the whole, a really good bargain and well worth a stay.", "Date": "September 3, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London", "Title": "“Great Hotel, Friendly bilingual staff and truely made welcome.”", "Author": "Padua", "ReviewID": "UR5729499", "Content": "This is a family friendly, clean and comfortable four star hotel, close to the Vatican, (yet not within walking distance). The pool is awesome, but the water is very cold and there is no shallow end. The hotel provides towels, at the poolside but insists everyone wheres swimming caps... also provided. Drinks at the bar are expensive! Pina Colada is about 11 euros. Pot of tea is about 6 euros. However the bar staff are friendly and courteous. They also have internet access on the ground floor, which costs about 5 euros for 30 minutes - cards available at reception. We stayed on the third floor, but did not notice the sound of the air con units as others have commented. I used the telephone twice to make calls back to the UK and it was VERY expensive. Local calls seem very cheap however. Rooms are very comfortable, clean and cool. There is room in the private bar fridge to put your own drinks/food - anything you use is charged 3 euros each. Check out is by 2pm, but the hotel does look after your luggage at no extra cost. We arrived a little before the standard check in time but were still able to go to our roms. We enjoyed the eat as much as you like breakfast buffet - hot food, cereals, fruit, juices and croissants...7-10am daily. To get out to the center of Rome, you need to walk about 5 minutes and catch a bus to Pizazza Venezia which has plenty of transport links to the main attractions. One day bus passes cost only four euro each. (kids 10 or under travel free). Buy these at the Tabacco shops. When you get on the bus you need to validate the ticket just once, then keep safe. Do watch out for pick pockets - we lost two mobile phones and some camera filters. Be alert... especially on the crowded buses. We had trouble returning to our hotel after about 11:30pm because buses stopped running. Taxi's were not so easy to find. We caught a taxi from Piazza Venezia to the hotel and had to pay about 15 euros. We did not know at the time, but there are these oddly shaped curvy green machines in the middle of some roads that look like parking meters but are in actual fact call taxi's to you! I would return to this hotel again - we loved our time there, although you must be prepared to walk and take public transport or drive to get to the best attractions and restaurants. Highly recommended, especially if you dont mind walking or paying for taxi's.", "Date": "August 31, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Good points and bad points”", "Author": "19katy80", "ReviewID": "UR5727816", "Content": "We booked this hotel because it has a pool and Rome can be oppressively hot in August. It is only 10 minutes to the vatican and there are plenty of buses that run into the city centre from Via Gregorio VII just around the corner. Buy tickets in tabacchi (1 euro for 75 minutes on bus/metro) and stamp it when you get on the bus. The pool itself was great. There is a lifeguard who hands you towels and the obligatory swimming cap, although there were not really enough sunloungers unless you get there in the morning. The staff were friendly and efficient. Previous reviews complained that Italian guests were given preferrential treatment. I (an Italian) stayed with my English boyfriend and we didn't see any evidence of this. There were, however, some problems with the hotel. The buffet breakfast was quite limited, perhaps because we ate quite late (9am). The eggs and bacon were cold and the fruit in the fruit bar was brown and shrivled. We didn't eat in the restaurant during the evening. There are several good restaurants very near to the hotel that are half the price. The rooms looked smart and clean but, like most Italian hotels, pets are allowed in the rooms and in the night we got a couple of bites which I am pretty sure came from the bed base. For this reason I think I would not stay here again.", "Date": "August 30, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Haven from the hustle and bustle”", "Author": "rruparelia", "ReviewID": "UR5726823", "Content": "We booked this hotel after reading the other reviews on trip advisor and I agree with most of the comments. 1. The hotel is out of the city centre but the easiest way to get to the hotel is to get the A Line to Cipro station and then get the 31 bus, get off when you see the Texaco service station (approx 6 stops) and the hotel is located on the opposite side of the street. I have to warn you that its quite a steep climb up the driveway to the hotel reception! 2. You can get into the city centre quite easily by getting the 571 bus which also goes past the Vatican. The 571 bus will drop you right outside the Colossium. We preferred to get the 31 bus and take the metro from Cipro. Also be warned that the metro closes at 9am so learn your bus routes! 3. You can walk to the Vatican which takes about 30 mins but I would advise to either take the bus or the metro as the stop outside and when you wlak its hard to find the entrance. Ok, now the hotel, The rooms were small but comfortable and housekeeping service was excellent. We asked for a double room but once we got inside the bed was tiny. We were told it was a matrimonial bed but they were more than willing to give us a room with 2 singles beds pushed together. Breakfast is ok, avoid the fresh juices as they taste very watered down. Also they dont really make it obvious that they serve fresh cappachino's, you have to ask for them. Try and go down early aswell as we went went down at 8am and most of the food had finished and they don't refill it. Apart from that no complaints about the hotel, had a lovely stay, the pool is definately a plus point as it gets really hot in the afternoons so its nice to relax by the pool. If I was going to Rome again I would definately stay here, the hotel was reasonably priced and looked much better than some of the hotels in the centre of Rome.", "Date": "August 30, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Athens Greece", "Title": "“Rome for my son's 18th birthday”", "Author": "Jennyferk", "ReviewID": "UR5701157", "Content": "My family and I have just returned from a 4 night stay in the Jolly hotel villa Carpegana (17- 20 August). As previously mentioned Rooms: were a little on the small size but as were we barely in them this did not prove a problem. Each bathroom is fully equipped including hairdrier but the trouser press was usless so an iron is needed unless you use the pressing service. The air-conditioning through -out the hotel was fantastic and a welcome relief from the heat in Rome. Distance to sites: We had hired a car for 4 days which worked out cheaper than the taxis etc from and to the airport and we had the comfort of being able to get back to the hotel quickly each night. We did not find any problem parking in Rome and the Italians certainly drive more safely than the Greeks here in Athens. Staff in hotel: ok . WE had a problem with a wakeup call that never came the day we were leaving for the airport (and so we were late). Pool staff very polite. Pool: Exceptionally clean and well looked after (swim caps and towels compulsary but provided by hotel). Another welcome relief after walking around the boiling hot sites in Rome. Breakfast: A more than adequate buffet breakfast though a bit sparse if you arrived too late. We ate so much it lasted us until we went out to eat in the evening. We did not eat or drink in the hotel so cannot make a comment there. Recommendation:We enjoyed our stay there and would recommend this hotel to anyone visiting Rome and we would definately stay there again but not on the 3rd floor as you can hear the air conditioning machines from the roof (sounds like washing machines)", "Date": "August 23, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Chicago (Southwest Suburbs), IL", "Title": "“Modern Hotel--Staff Not Very Helpful”", "Author": "gms11", "ReviewID": "UR5616852", "Content": "The Jolly Hotel Villa Carpegna is in a great location for many of Rome's main attractions and is a clean hotel with modern amenities. A big disappointment, however, was that the staff at the front desk was not overly helpful or friendly when we asked for directions or assistance in making sightseeing plans.", "Date": "August 16, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Washington, DC", "Title": "“Great place”", "Author": "Terrapin1", "ReviewID": "UR5616849", "Content": "We had the opportunity to stay at the Ridenhour Inn while in the area for a family reunion. We truly enjoyed the stay. Dana and Brian are relatively new owners. They were most accomodating with suggesting places to eat and making reservations. The breakfasts at the Inn were superb. We will definitely stay there next time we go to the Russian River.", "Date": "August 16, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“If you need an affordable handy hotel with a pool, this is the place!”", "Author": "barryuk", "ReviewID": "UR5540555", "Content": "Just came back from 8 nights in this hotel, which is about a 20 minutes (mostly downhill and safe) walk to the Vatican - 30 mins from other main features. Don't worry about the walk - within 3 mins you can hop on a 571 or 916 bus and do the trip in 5 mins (and the 916 runs thro to midnight too). Super bus service really. The rooms were perfect for us...we had a king size bed, kids a twin. Hotel achieved in giving us quiet rooms with twin near the double..excellent. Spotlessly clean and bedlinen changed almost every other night. Free electronic safe, minibar/fridge and trouser press. Pool simply perfect, tho no childrens end (hurrah as far as we were concerned tho! hehe) Limo service to Ciampino at 55 Euros was less than we paid from the airport in a standard taxi. Adverse comments were i) the price of food and drink, which meant we didn't use the restaurant or bar snacks as much as we might have ii) breakfast very much 3 star quality (even tho choice was OK) I don't think, for the price, you will get a better class city hotel with pool.", "Date": "August 2, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Brossard, Qc", "Title": "“Very good and quiet!”", "Author": "Gti59", "ReviewID": "UR5468626", "Content": "Just returned from a 4 days holiday in Rome. The hotel is locted 25 min walk from the Vatican but you just have to take bus #31 to Cipro subway station. The rooms are not so small. I’ve seen much worse. Having said that though the rooms and the hotel in general was spotlessly clean. The reception staff all spoke excellent English and they are helpful. The included buffet breakfast there is very good. They have an extensive choice of filled croissants. Again I saw much worse in a 5 star hotel!!. The pool was excellent, spotlessly clean and very quiet and a lovely place to relax particularly after a day of sight seeing. Believe me this pool is a must mainly for summer time visit to Rome! You can find good restaurants five minutes walk from the hotel but be careful with the restaurant “LE VELE” near the hotel which is a sting (18 euros for 3 shrimps in your plate). Unfortunately Italians are sometimes exaggerating a lot! Would probably use the hotel again.", "Date": "July 15, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Davenport, Iowa", "Title": "“great”", "Author": "Nanamary", "ReviewID": "UR5416692", "Content": "Rooms were barely large enough for two guests and luggage, but they made good use of the space. Beautiful and clean, everything you'd picture in a classy Italian hotel. The desk staff was snooty, the maids were very pleasant and friendly. Don't expect service people to be friendly in Italy, they can't be fired and they know it. The hotel is situated within walking distance of everything you could want--restaurants, supermarket, shopping, pharmacy. Great place to stay.", "Date": "July 2, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Loved the Pool”", "Author": "A TripAdvisor Member", "ReviewID": "UR5336503", "Content": "Recently returned from a fabulous holiday in Rome and stayed in the Jolly Villa Carpegna in Rome for a week. As previous reviews have mentioned the hotel is in a residential area approximately 25 min walk from the vatican. The rooms as numerous other reviews have mentioned were definitely on the small side with very limited wardrobe facilities for longer stays. Having said that though the rooms and the hotel in general was spotlessly clean. The reception staff all spoke excellent English but felt the hotel was probably more business orientated and not particularly \"user friendly\". I was very very disappointed with the breakfast and was probably one of the most disappointing breakfasts I have had in a 4* European Hotel. Though there were adequate selection of cereals and bread - other choices i.e. tinned fruit, cold scrambled egg and very grizzly streaky bacon, limited selection of cheese - certainly not my idea of an excellent breakfast! The pool was excellent, spotlessly clean and very quiet and a lovely place to relax particularly after a day of sight seeing. Taxis varied considerably in price from being reasonable to actually quite expensive from main activities back to hotel. Bus service very good and were quite happy to use this through the day and taxis in the evening. We also found an excellent restaurant five minutes walk from the hotel which we used on a couple of evenings - highly recommended, food, service, choice of food and atmosphere excellent. Would probably use the hotel again.", "Date": "June 12, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "5"}, "AuthorLocation": "Cornwall", "Title": "“Comfortable Hotel”", "Author": "MikeCornwall", "ReviewID": "UR5314428", "Content": "Booked the hotel for 3 nights. Reception was excellent..nothing too much trouble, all spoke excellent English. Hotel was a typical large 4* hotel with a somewhat business feel to it rather than a family hotel. It is located in a relatively quiet and residential area of Rome which was nice, approx 1 mile from the Vatican which was no problem to walk. The rooms and bathrooms were very clean, the breakfasts were very good with an excellent hot and cold buffe,t however the evening meals were not wonderful with a fairly restricted choice. The bar staff were not very friendly as it would appear that unless you were Italian the little extras were not provided. eg.. we bought a bottle of wine and two cokes which came to well over 20 Euro. An Italian resident came in shortly after us and ordered a small beer and was presented with a huge bowl of complimentary crisps!!! charming!! Overall I would reccomend this hotel. I would suggest you fill yourself up at breakfast and you could get through the day until evening with fruit and water (local market very good on the walk from the hotel into town) also there are so many places to eat in town that you just have to eat in one of them. The atmosphere in the side streets around the Vatican is wonderful and you could easily sit with a drink and just 'people watch' for hours. Taxis are very cheap but just make sure you get the hotel name written on a piece of paper as one or two taxis like to 'misunderstand' the hotel name and charge off in the wrong direction. Also, walk into town (as it is down hill and cooler in the morning) and get a taxi back!! Finally, this hotel is very nice, not too expensive and is worth the stay for those little extras you get in 4* hotels...it is also fully air conditioned...heaven on a hot day, and it can get very hot in Rome. Enjoy!!", "Date": "June 6, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "sacramento, CA", "Title": "“Modern hotel close to Vatican”", "Author": "pacifichopper", "ReviewID": "UR4092863", "Content": "I organized a group of 16 to stay here during the second week of July. Despite some small early snafus with my reservation, my stay proved to be outstanding. This was my fifth trip to Rome and I have stayed in hotels both downtown and in the outskirts. This hotel is within a 15 minute walk from the vatican in a residential neighborhood. Considering it was high season, I was paying about 110 euros/night. A similar nice hotel downtown would have easily been over 200 euro. Even by taxi, you could be in downtown within 10-15 minutes for 10 euro. One can easily do the math and see it is a good deal. The key factor about this hotel is that it was modern. The AC was great. The rooms were not musty. The breakfast buffet was very tasty. A closeby hotel is the Crowne Plaza which is more worn and old and certainly does not compare in quality. The Jolly gets two thumbs up!", "Date": "November 8, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Hertfordshire, England", "Title": "“Could not fault it”", "Author": "TessyP1", "ReviewID": "UR4031262", "Content": "I booked this hotel for my finace 30th Birthday, it was a romantic surprise for his birthday. It was superb. The staff were very helpful and polite, the rooms were lovely and big, the bathrooms were so clean, the cleanest that I have ever seen. The location was great, it took us about 10 minutes to walk to the Vatican and about 20/25 minutes to the colusium. I can not find a bad word to say about this hotel. The breakfasts were great so much cholice that it was hard to decide what to have, and by the time we arrived back to the room after breakfast the maids had been, it was fantastic, I would stay agin, and I can honestly say I was very said to leave. The bus runs from just outside the hotel into the centre and you can buy bus tickets from the hotel. Fantastic service, fantastic rooms and fantastic location. Very Romantic", "Date": "October 18, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Hercules, CA", "Title": "“Nice, Clean Hotel”", "Author": "MattAndIsaacsDad", "ReviewID": "UR4024239", "Content": "Friendly Staff - The reception staff all spoke English, but some of them would let you practice Italian with them. The wait staff was sometimes slow by U.S. standards, but they were always friendly. The wait staff did not all speak English, and so you would need to speak a little Italian with them, which was fun; They were always kind and patient when you tried to order in Italian. Great Location! Via Gregorio VII is very close to the hotel, and if you follow Via Gregorio for a 20 minute walk, you will find yourself near St Peter's Basilica, the Square, and the Vatican. Hotel is also near a grocery store, where we bought Espresso beans/grinds, Italian chocolate, and Biscotti for our trip home. Since we stayed at the hotel at the end of our trip to Italy, we needed a ride back to the airport (FCO). The hotel reception staff arranged for a Mini-Bus for the six of us for 65 Euro. Not bad for a private Mini-Bus for six people and our luggage. We would stay at the Jolly Villa Carpegna again.", "Date": "October 15, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "orlando", "Title": "“A nice hotel a little too far from the action”", "Author": "A TripAdvisor Member", "ReviewID": "UR3926996", "Content": "The rooms where decent in size and where very clean. The hotel is pretty nice and in a good area. I wish that we where a bit close to the heart of Rome as a cab is needed to even go out for dinner as there is not much in the immediate area. The staff was helpful and the breakfast pretty good.", "Date": "September 20, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Lancashire, England", "Title": "“Jolly Hotel Villa Carpegna”", "Author": "Sandan", "ReviewID": "UR3763543", "Content": "Myself, wife and two sons aged 20 and 16 stayed at the Jolly Hotel Villa Carpegna in July, in two adjacent rooms booked via Expedia, and were pleased to find that these were at the back of the building, looking out towards the back courtyard which was peaceful. The hotel is a pleasant modern fully air-conditioned building, about 5 years old, located 20 minutes walk from the Vatican, using Via Gregorio VII. The walk, whilst easy, does involve negotiating the Rome traffic at several crossing points which is definitely not for the faint hearted! The centre of the city (Piazza Venezia) is reached by catching the number 916 bus (1 euro for a single ticket) from Piazza Pio XI which is about 5 minutes walk from the hotel. The hotel is located in a pleasant residential suburb which has a real neighbourhood feel with a good range of shops and facilities. Being out of the immediate centre of Rome was never a problem and it was good to spend the mornings sightseeing and return to the hotel later on in the afternoon. For reasonable cost dining, of particular note was the excellent Tavola Calda and Rosticceria called ‘Delizie del Palato’ at the junction of Via Gregorio VII and Via S. Damaso, 10 minutes walk towards the Vatican from the hotel. This was well patronised by locals. The hotel breakfasts were excellent, with a wide selection of cooked and cold foods. It did pay to be down to breakfast fairly early, however as some of the cooked food did run a little low after about 8.30am. The staff were efficient and helpful, and the very well tended pool was excellent for cooling down after a hot morning’s sight seeing (some days temperature was around 32 centigrade). Would I stay there again? Most certainly – although slightly out of the way, this is a pleasant well run hotel with helpful staff and an excellent breakfast. With more moderate restaurant prices and slightly better facilities it could be outstanding. For example we didn’t use the hotel restaurant for evening meals, as it was way too expensive (33 euros a head for a three course meal). The same for the mini bar in the rooms with small cans of beer costing 5 euros. Instead we made up picnic lunches from the PAM supermarket on Piazza Pio XI. The hotel rooms were quite small, and there were no tea or coffee making facilities. The in house laundry service was also too expensive and the hotel could have done with a laundry room.", "Date": "August 15, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Minnesota", "Title": "“Nice Hotel, Great Pool”", "Author": "A TripAdvisor Member", "ReviewID": "UR3763152", "Content": "Stayed here in August 2005. The rooms were nice and clean (except for the bathroom floor). The air conditioning work perfectly - which is not the case for a lot hotels in Europe. The pool is nice after walking in the sun all day. The only drawback is the location (or benifit depends on how you see it). Its out of the way of most of the hustle and bustle, so the bus or taxi is your best choice. Watch out for taxi drivers who charge too much. Ask the hotel how much it should cost. The staff speaks english are very helpfull. Go the grocery store to buy beer and stay away from the mini bar and the beers at the pool. The pool guy is the coolest, his name is Juliano and he gave us a ride in to town one night.", "Date": "August 15, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "North Carolina", "Title": "“Nice hotel, although out of the way”", "Author": "A TripAdvisor Member", "ReviewID": "UR3576892", "Content": "This hotel was very nice. The staff was not the kindness especially, the breakfast staff. Overall this was a good hotel although a little out of the way. We paid about 50euros for the taxi (they called a limo). A taxi to go to the spanish steps or the fountain was only 10euros. Overall I would stay here again.", "Date": "June 20, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "US", "Title": "“Not our favorite hotel in Rome - but a quick one night...”", "Author": "ita5724", "ReviewID": "UR3551827", "Content": "A small room - spent 1 night - our first night in Italy after 30 hours of travelling - meeting up with an organized tour. Hotel was clean, bed was comfortable, bathroom was clean - no complaints there. Very far from anything - so what we were told was an 'easy' walk upon arrival to get a glimpse at St. Peter's was a 45 minute sweaty mess to get there, and then back. (Hadn't been in Rome long enough to master the bus system as we did by the end of our trip when we stayed at a better hotel...) Breakfast was the same as all hotels in Italy - nothing great, but adequate.", "Date": "June 14, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Arlington, Virginia", "Title": "“Great hotel, but a little far”", "Author": "DanRandom", "ReviewID": "UR3325679", "Content": "Just got back from a week in Rome at the Jolly Hotel Villa Carpegna. The hotel itself was great. The staff was extremely accomodating, especially to this bunch of Americans with little knowledge of Italian. They were more than willing to check us in a little early upon our arrival. The free breakfast was great (especially for us, rolling in 5 minutes before they closed the doors), dinner was okay, the bar/lounge was great, lobby comfortable and clean, and we can only imagine the pool is great in the summer. The rooms were a bit small, with NO IRONS (bad for this poor packer), little dresser space, but great bathrooms and a nice TV (no alarm clocks, either). The hotel, in and of itself, was great. However, the hotel is a bit of a distance from central Rome. It's an easy 30-45 minute walk to Vatican City, and quite a hike to anywhere in the Ancient City. There is a bus right out front (woohoo #31) which will take you to the Metro or the Tram #8, which is great to downtown. I didn't mind the adventure (a weeklong Metro/bus/tram pass is 16 Euro - and worth it!), but it was a little taxing on my grandparents in their late 60s. But the busses run on time and frequently, so it's not a major problem. That would be my only warning to anyone looking to stay here.", "Date": "April 3, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "London", "Title": "“Comfortable hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR2974539", "Content": "We stayed for 5 nights, and found the hotel very comfortable, if somewhat lacking in character. Good, clean rooms. The only negative comments about the rooms was lack of tea/coffee making facilities. Staff in general ranged from indifferent to unhelpful. Breakfast buffet average - no complaints. Located in a nice part of town, it is a 10-15 min bus ride from the centre of town with a reasonable bus service. Taxis are not too expensive either.", "Date": "January 4, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Great Hotel - Great Food”", "Author": "A TripAdvisor Member", "ReviewID": "UR2973252", "Content": "I took my mother to Rome in October 2003, it was both our first time there. We were quite pleased with the accommodations. The hotel decor is very very nice, the rooms were great, a bit on the small side, but very nice overall. The restaurant was an absolute delight! The food was amazing. Their breakfast buffet was one of the best I ever had. The hotel also sits up on a hill, so the views are great, and I also liked the fact that it is located a little outside the center of Rome. So if not being in the center of town is a must for you, I highly recommend staying at the Jolly Villa Carpegna. The surrounding neighborhood is really nice and it gives one the feeling of a native. I will definltely stay there again when I am in Rome.", "Date": "January 3, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Mold, Wales", "Title": "“Ideal for rest and touring Rome”", "Author": "A TripAdvisor Member", "ReviewID": "UR2615960", "Content": "Stayed here for 4 nights, but they were relaxing. The western location was not a problem the transport system work well. Pool was essential, the rooms were cool and the stay was relaxed and quiet. The building is new but functional cool and clean. Breakfast was good and there was plenty on the buffet. You could easily walk as far as the Vatican or step on a bus down the road about 300 mtrs. I could not get Sky to broadcast in english on the TV but you do not need the TV here. I would stay here again, and would recommend the Jolly Hotel Villa Carpegna to friends", "Date": "October 3, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "USA", "Title": "“Loved this hotel.”", "Author": "A TripAdvisor Member", "ReviewID": "UR2220997", "Content": "This hotel was excellent. I would stay here again in a heartbeat. I'm rating this a 4 instead of a 5 only because of location; it's not in the center of the city. However, this was not a problem, and everything else about the hotel made up for it. To get into Rome, you had to go to the bus stop (a 2-minute walk from the hotel) and take a 10-minute busride into Rome. The room was large, clean, and modern. Air conditioning was on all night and hot water in the shower was always available (big pluses for European hotels). Breakfast was excellent and one of the best in Italy, served in their modern, large dining room. The swimming POOL was a must for the summer months! It was great to relax by the pool during the hottest hours and saving sight-seeing for early morning or late afternoon. True, staff wasn't so helpful, so buy a guidebook. Also, you must buy bus tickets from a tabachi shop, which closes around 2pm so buy a bunch early in the day.", "Date": "June 24, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Clearwater, Florida", "Title": "“Staff Unaccomodating”", "Author": "A TripAdvisor Member", "ReviewID": "UR2181082", "Content": "The hotel room was comfortable and clean but I found the front desk as well as management staff very unaccomodating. We were travelling with a tour group; Rome and the Jolly Hotel Carpegna was the beginning of my 10 day tour. After 25 hours of travelling I was looking forward to taking a nap and getting cleaned up before our welcome dinner that evening. At 11am the porter brought one of our suitcases from the bus but we were still missing one, which I informed him of at that time. 2 hours later he had not returned so I went to the front desk and was told that they would check into it for me and call me at the room. I waited another 1.5 hours without response before following up at the desk, this time the clerk told me that he was waiting on a call from the airline...I again informed him of the situation and that my bag was not at the airport but somewhere in the hotel. He then said that he would have the porter check the luggage holding room and would let me know. I sat in front of the luggage room for 1 hour and not one person checked ANYWHERE for my suitcase! When I approached him again I was told that it was probably delivered in the wrong room and that it was going to take some time to find it. Still, nobody moved in any effort to look for it. Finally, at 5 o'clock our tour director arrived back at the hotel and I informed him of the situation. Within 2 minutes of him addressing the staff they were all over the hotel searching! I waited 6 hours and not one person lifted a finger! The luggage was found outside the wrong room which was 2 doors down from ours. Those people must have just returned to their room and just set it outside the door because I had walked that corridor all day. The only comment I got from anyone at the hotel was \"I cannot believe you didnt see your luggage sitting there...it was only 2 doors away from yours!\" This didnt sound like an apology to me since I now had no time to get cleaned up before dinner. The most hospitable gesture they could have made if they didnt have time to try and solve the problem was to at least offer me some replacement toiletries so that I could have freshened up in the meantime.", "Date": "June 10, 2004"}], "HotelInfo": {"Name": "NH Villa Carpegna", "HotelURL": "/ShowUserReviews-g187791-d229083-Reviews-NH_Villa_Carpegna-Rome_Lazio.html", "Price": "$121 - $556*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Pio IV, 6</span>, <span class=\"locality\"><span property=\"v:postal-code\">00165</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "229083", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/e5/2d/e52dbc1dffa138d69e3044e0f0e130eb9large.jpg"}}