{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Massachusetts", "Title": "“Keep on looking!”", "Author": "KevinandMarilyn", "ReviewID": "UR126776094", "Content": "Stayed at this hotel three nights in October 2011 with a tour group. We should have known when we saw the property was \"gated\" that it was not going to be one of our better adventures. The rooms reminded me of my college days living in a high-rise dorm in Boston. The only partial salvation was that the food was adequate. This hotel is supposedly 4 star, but we found that in Italy these ratings are tenuous at best. Do your homework, and check Trip Advisor before booking!", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Friendly and talented staff, so-so rooms”", "Author": "RMarieMpls", "ReviewID": "UR125720996", "Content": "On my second trip to Rome, I decided to stay off the beaten path and selected the Princess Hotel. It's farther from central Rome, but within a few minutes by car to the Vatican. The hotel staff was marvelous. We arrived very early in the morning from an international flight and only had to wait about 20 minutes for them to ready a room even though we were way before check in time. We sat at the quaint bar and conversed in English and Italian with the bartender, who gave us some excellent suggestions for very authentic local bistros. When we locked ourselves out of our room, they were extremely prompt. The free shuttle drops you off on the south side of St. Peter's Square, a perfect point for exploration. The staff outshines the room conditions.. The rooms were sub par, a little outdated but otherwise clean.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Larisa, Greece", "Title": "“Auwful Hotel - not worth of 2*”", "Author": "larisa l", "ReviewID": "UR124356113", "Content": "No. No. NO. It was first and the last time I stay in that hotel. Old furniture, airconditioner out of order, breakfast miserable, far from Metro (appr. 20 minutes on foot). Far away fron city center. Internet are not available, No printer to print necessy documents. Keep away from this hotel. Old hotel of Year 1980, probable to that time it was 4*, but since that time nothing was changed in the hotel.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Quiet Hotel”", "Author": "wp327", "ReviewID": "UR123032015", "Content": "This hotel is outside the city, but is very quiet and convenient to the city. It has a wonderful restaurant that is economical and the food and service are great. The rooms are spacious and not as small as British rooms.", "Date": "January 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Not Promising”", "Author": "Rodrigo S", "ReviewID": "UR121096413", "Content": "First time italy. I have hearh a lot about how the hotels in Italy. Thats why my expectations were low for Princess Hotel. The name is quite famious in the world sounds like a chain hotel. But everything in the hotel is average. The room was small and noisy by at least we have plenty of sun in the room. But hotel decoration needs to be rebuilt soon.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Andover, Massachusetts", "Title": "“Definitely not a 4 star hotel”", "Author": "adnilb", "ReviewID": "UR119801662", "Content": "Promoted as a 4 star (or similar) hotel by my travel agency in Stoneham, MA, it was more like a 2 star, old Holiday Inn more suited for a college dorm The rooms were small and stark, the lighting was very dim and the food was terrible. Could not pay the Rome tax with credit card (only cash). Located in a \"not so nice area\", and far from walking distance to the center of Rome, the people in my group were afraid to go out for an evening stroll.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Sydney, Australia", "Title": "“Princess Hotel - nothing Royal about it.”", "Author": "RenLenCar", "ReviewID": "UR119101333", "Content": "This Hotel wasnt too bad. The Rooms were icy cold, thankfully as it was very Hot in Rome. The aircon was quite noisy and a unit that sat in the window, kind of kept you awake at night. The Hotel Lobby was amazingly nice and cosy. Like sitting in your own loungeroom. Hotel staff were nice. One of the restaurant staff members sometimes made you feel like you were inconvenience to them. overall pretty good.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "australia", "Title": "“Not 4 star”", "Author": "australiaClare", "ReviewID": "UR118833084", "Content": "Last hotel on a Cosmos tour supposed to be 4 star. Small shower little old tv and noisy old fashioned airconditioner. Our room was noisy located on first floor near reception Mold in the bathroom hardly 4 star. dark and dingy. The breakie was the best thing about the p lace I dont know why Cosmos uses this hotel still One of the fellow travellers on the tour had her watch stolen by a a man possing as a porter in the hotel take care with your security", "Date": "October 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Suffolk", "Title": "“Princess Hotel, Roma.”", "Author": "retsuos", "ReviewID": "UR118477690", "Content": "Stay:- 16/9/2011 to 22/9/2011 I booked this hotel through booking.com before I read the reviews on Trip advisor. It was a surprise trip for my husband. After then reading the reviews on this site I was very apprehensive of what we would find. I can only say that the people who have written bad reviews must have stayed in a different hotel. The hotel is clean,room was fine, bedsheets and bathroom linen changed every day. hotel staff very friendly (Claudio in particular), sometimes you get you give, treat them with respect and they will respect you in return (We observed some very difficult guests!) The staff work very hard! For the very reasonable price paid we were more than satisfied. Yes it is a little out of Rome, but no problems getting to the centre, 246 bus to Cornelia and metro straight in. The only thing I would make a suggestion on is that the pleasant terrace could be made more use of and that the pool is kept open for longer. It was shut from Monday 19/9/2011 because it was \"end of season\" The temperature was around 30 deg!!! All in all, a great trip.", "Date": "September 23, 2011"}, {"Ratings": {"Location": "3", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Quiet and comfortable - a long way out”", "Author": "Phil I", "ReviewID": "UR118135067", "Content": "Cosmos tour - 2 adults and a 12yr old Rooms very comfortable Grounds very clean and well kept Food from the bar limited but nice - a bit expensive. Breakfast ok. The location is a bit out of Rome - tooks us about 45 minutes on a train and two buses but was a fantastic experince - staff on public transport very very helpful and we saw a lot of Rome in the process. The bus stop is right at the front gate. Would recommend this as a clean and comfortable place to stay. Staff were fantastic.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Paris, France", "Title": "“Nice experience I would repeat as soon as I have to get back to Rome”", "Author": "maud_arditti", "ReviewID": "UR116356417", "Content": "Really Really nice hotel, with a very friendly staff, the lobby is decorated with a good taste, sobber and lovely. The breakfast was good, and the bartender smily and polite. This is definitely a hotel i would recommend for couple or a group of friends who want to visit Rome and more particularly the vatican. After the comment i saw concerning the unaccesible WIFI , i would just add an advice: \"Press the button of your labtup to open the WIFI and you might access to your dear internet to write another comment on tripadvisor....\" At least my internet access was free, fast and easy\"...", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Keep Away from this Miserable Place!”", "Author": "KenJBurns", "ReviewID": "UR115935996", "Content": "The Princess is advertised as a four-star hotel, but having stayed there for six nights (June 30 – July 6) I can only assume that the person who rated it must have been seeing double – it hardly even deserves two stars! My bedroom was spartan with minimal furniture, and air conditioning supplied via a very old “through the window” unit that rattled whenever the refrigeration element started up. When I first heard it I thought the front grille was loose, but that wasn’t the problem, nor was the filter screen behind the grill. I don’t think that screen could have rattled if it tried: it obviously hadn’t been cleaned for several summers and it was clogged with dust! The initial response of the front desk when I reported the problem was to send up a porter who jammed in a thin strip of wood he went to fetch (I naively thought he’d stepped out to get some tools!), but that didn’t work. I reported the problem to the front desk again next morning, and they said it would be fixed, but it never was. The bathroom was OK except for the shower which was in a square cubicle a maximum of one metre square fitted into a corner of the room. The two sliding doors didn’t close fully, leaving a sizeable gap through which water escaped, making it necessary to lay a towel on the floor before showering to prevent a flooded floor. I have no experience of Italian hotels at all, so I’m not sure if this next item is an example of Canadian expectations running up against what is considered normal in another country, but I found it annoying. My room had absolutely no information in it at all. No phone book, no hotel directory, no instructions on how to use the phone, nothing – it was absolutely bare! One final demonstration of the poor customer service came on the morning I checked out (July 6). I had been carrying some postcards around for a couple of days and had been unable to buy stamps for them. I asked at the desk if they had any, and the clerk offered to put them through the Hotel’s franking machine and mail them for me. This I agreed to, leaving the cards with him, and paying what now seems to be the postage rate plus an extra Euro for each card. One of the postcards was to my wife: it arrived here on July 27, and when I checked the card (not franked but with ordinary stamps), it was postmarked July 16. I haven’t heard if any of the other cards I sent have arrived, but I assume they also sat in someone’s desk for 10 days or more until they were finally mailed. I have no doubt that the problem with this hotel is that it caters for large tour groups. I was part of a band that was playing at a festival In Rome, and there were four other bands, including three high school bands from the US, in the hotel at the same time, all of us booked in by the same tour company. No matter how poor the rooms or wretched the service, the hotel owners know that it is impossible for a group of 50 to check out and move to another hotel if they’re unhappy, so they have no incentive to improve.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Calgary, Canada", "Title": "“Horrible”", "Author": "munamunah", "ReviewID": "UR115648285", "Content": "Out of a group of about 60 people, 5-6 of us had something stolen from our luggage in our rooms. From shirts to earrings to a wedding ring. Can relate to another poster about calling for directions only to be given a very unclear response and to \"call back later\"?? Rooms are very outdated and the hotel is in an inconvenient area for the solo traveller. Disappointed.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Very disappointing”", "Author": "JAMMYJOEY", "ReviewID": "UR113086579", "Content": "This hotel was rated 4 star.... maybe in 1980 it was but it most certainly is not now. We specifically booked this hotel which was a bit out of Rome as it had a swimming pool yet when we arrived we were informed it was not in use until the end of the month. This was not stated anywhere on their website or by booking company. When we complained and asked if we could use the facilities in a near by hotel at the cost of 20 euros per person per day!! When asked if they would be refunding this as a good will gesture they refused. Contacted the website we booked from who also contacted the hotel who again refused to compensate us for the lack of facilities as advertised. The rooms are basic but adequate - one good point is the beds were very comfortable however in my room there was a foul smell like sewers in the bathroom- Refuse this room if offered rm 509. I didn't complain about this as I suspect noting would have been done anyway plus i was rarely in the room. The walls are paper thin!! I could actually here the couple next door as clear as if they were in the room with me. The subway is a good 20 min walk from the hotel of 4 bus stops away. Didn't try the breakfast", "Date": "June 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Montreal, Canada", "Title": "“Uncomfortable and Unsatisfactory”", "Author": "gagagurl", "ReviewID": "UR110080522", "Content": "We stayed in Rome for 2 days at Princess hotel and it was uncomfortable. The reception was unapologetic about the fact that the WIFI or none of the computers didnt work. The walls were paper thin and the man beside our room kept banging on the walls to suggest that we tone down our voices - this was very uncomfortable. We were with a tour group in Rome and unfortunately an elderly lady broke her arm coming out of the shower since there was no handle bars to hold on to while getting out and there was no grip on the shower floors. The towels smelled like vinegar and I could have sworn they were actually table cloths. We brought converters that worked everywhere else we went to in Europe except for here....I had to position the tv so that the converter could actually stay in the outlets. To top it off.. the safe in our room wasnt working and after talking to reception he said he would send the porter to check it out -- but the porter never came.... we were only there for 2 nights and left our valuables at front desk Taking the subway to central rome was easy enough since there was a bus that took you from the street in front of the hotel to the subways. The continental Breakfast wasnt as bad as expected after staying a night at Princess...there was a variety of foods compared to other hotels we had stayed at in Italy. In a magical city like Rome, it would have been nice to stay in a nicer place. For the next time I visit Rome, Princess Hotel wont be an option.... it is better to spend more money for the comfort and I would not reccomend this hotel.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "4", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Quite bad.”", "Author": "singpon", "ReviewID": "UR106348827", "Content": "This hotel is a bit far from Rome and there's nothing to do around. The bedroom was so awful that we could hear what the people on the next bedroom were talking about. The breakfast is quite poor as well and the staff could care less, specially with you're part of a Cosmos tour.", "Date": "May 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Buenos Aires, Argentina", "Title": "“Satisfactory”", "Author": "jmontano8421", "ReviewID": "UR100427909", "Content": "I didn't choose this hotel, as it came with a tour. I wasn't expecting something spectacular from the reviews I have read in here. But it was just fine. Yes, the bath tub is a square and the water filtrates to the outside, but outside of that, I had a perfect stay. It's not near the centre of Rome, but you're not far from the Cornelia station (I recommend a map from this area in particular, since most maps don't include the zone). It's an easy zone to walk. Internet is not free, and it costs you 36 cents (euro) in the hall, the minute. Or, 7 euros an hour in your room. It's not a service from the hotel, you buy it with your credit card. There's an internet point in via aurelia, near the McDonalds (which is near Cornelia Station), I recommend going there for all your phone calls and internet use. For everything else, the hotel was satisfactory, since the real joy of this stay is the city itself and I recommend you to walk the whole city, all day, you won't care about the hotel later. Also the attention at the reception was very good.", "Date": "March 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Milton, Canada", "Title": "“OK hotel, but hard to get to and from the city centre”", "Author": "jmilli", "ReviewID": "UR99942395", "Content": "I stayed here with my spouse in June 2010, we were travelling with a budget tour group. The hotel was fine, rooms were fine, no complaints about any of that. The staff were actually very helpful and spoken english quite well. The pool was closed when we were there, so that was a disappointment. Breakfasts we ok, but again nothing special. My only real complaint is about the location of the hotel. It is quite far from the metro and it is not the greatest neighbourhood if you have to walk from the metro to the hotel. It took us about 30mins to get from the metro to the hotel, and we were walking quite quickly. If you do not mind the trouble getting into the city then this is an ok hotel, but if you are looking for something that has easy access to the city centre, this may not be the hotel for you.", "Date": "March 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Not so good”", "Author": "misscroftTurkey", "ReviewID": "UR88623492", "Content": "We have stayed at Princess Hotel at our first two nights with our tour group. We all realized that the hotel is not a four star-hotel. The location is not in the city center, but you can take a taxi aproximately for 15 euros, or you can take your chance on buses and metro. But I must remind you if you don't chose taxi, you have a long way to track to reach metro. Any way, the rooms are so small that we could not find a proper place to put our luggages. If I am not wrong I found some ants (and live ones) around the room. And bed sheets and bed cover were not quite clean and so the bathroom (thank God I could find time to take a shover). But if you come that hotel with a tour group and you have less time to be in hotel (only for sleeping) the facility is not the deal.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Montes Claros, MG", "Title": "“Not so good”", "Author": "eovieira", "ReviewID": "UR85781403", "Content": "This hotel isn't good, because didn't hot water in yhe bathroom at nigth, the hotel was dirty and breakfast was very poor", "Date": "November 2, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "2.0", "Rooms": "2", "Service": "2", "Location": "2"}, "AuthorLocation": "Waikato", "Title": "“Adequate, but there are better hotels available”", "Author": "R_and_D_NZ", "ReviewID": "UR47120642", "Content": "Stayed at this hotel as part of a Cosmos Tour. Rooms were clean, and larger than our other Rome Hotel (Parlamento has 2 stars but was twice as good as the 4 star Princess). Princess location is good for tour bus to get in and out, but not very good if you want to get out on your own. Limited dining options nearby. Neighbourhood is similar to the hotel, not seedy, not stunning. Breakfast at the Princess for guests on tour was adequate, but limited - we were in a separate diining room to other guests. Long queues at the coffee machine. Recommendation - look elsewhere, ok if all the good places are booked out..", "Date": "October 18, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "JAX", "Title": "“You get what you pay for”", "Author": "flyplayne", "ReviewID": "UR46031672", "Content": "To me, this was an average hotel.The hotel grounds were clean, but once out on Via Aurilia, It gets pretty seedy. Open garbage dumpsters and lots of trash. Breakfast was adequate although the coffee dispenser is European style=1/2 cup. A/c seemed to run with no temperature control, so it was either cold or warm, depending whether it was turned on or off. I elected on and slept under a blanket. This hotel was part of a tour and was for 2 nights. All in all, for the price of the tour, about what you'd expect. 4*'s is stretching it a bit. Be prepared for sticker shock in the restaurant. Small glass of Coke about $6.00 U S. Il Postiglione restaurant near hotel is good.", "Date": "October 6, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "1", "Rooms": "1"}, "AuthorLocation": "UK", "Title": "“Disappointing location”", "Author": "welsh74", "ReviewID": "UR38472066", "Content": "Stayed here for 3 nights on a Cosmos tour. A triple room in the hotel was twin beds and a put-me up bed - the room was too small to accommodate everyone. Breakfast was very busy but food was ok. Pool was a welcome break from the heat but the lifeguard was hopeless, he just didn't want to be there! Terrible location. Wouldn't stay here again unless desperate.", "Date": "August 22, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "California", "Title": "“You can do better”", "Author": "CaliforniaPapa", "ReviewID": "UR35612806", "Content": "Four stars??? This hotel needs a woman's touch. It is not the place to visit on vacation. Simple. Cold. Barracks like. The location is poor. Possibly a thirty minute walk to the Metro. Busy steets, narrow sidewalks. Seems to be taken over by Japanese tour companies. Love the Japanese but I hope they drove a hard bargain for those rooms.", "Date": "July 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "1", "Rooms": "5"}, "AuthorLocation": "New Haven, Connecticut", "Title": "“Clean & comfortable but bad location”", "Author": "Heart_Traveling85", "ReviewID": "UR30939559", "Content": "The entrance is pretty dated with grimey couches that have seen better days and a gift shop that looks like it has been closed for 25 years but rooms and bathrooms were clean. Room windows were a bit gross with black mold on them but other than that, no issues ( clean towels, friendly staff etc). The restaurant downstairs is good, they have great pasta but not much else. Morning breakfast buffett is simple but everything is fresh and tasty. The biggest drawback is the location. My friend and I had never been to rome and had to take a taxi back, it cost us 25 Euros, and about 20-25 min. Needless to say the driver probably took advantage of us but it is still a bit far away from the heart of Rome. If you get a cheap rate from a room I would do it!", "Date": "May 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Boston", "Title": "“Comfy Hotel”", "Author": "BCgirl09", "ReviewID": "UR23323414", "Content": "I stayed at this hotel with my friends as part of a tour we took, and I enjoyed it quite a bit. The room itself was a little small, but I slept so well there and it was clean. It wasn't too close to downtown, but it was close to a metro stop, so it was very easy to get there. The staff was pretty nice. The elevators there were HUGE compared to any other elevator I'd been in Europe, so that's great for anyone with disabilities. The restaurants nearby were really good, and we got to know the staff there in no time since we frequented it for desserts, dinner, and wine. I would definitely recommend Hotel Princess.", "Date": "January 6, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Singapore", "Title": "“will not stay here again”", "Author": "ydujgoh", "ReviewID": "UR21256403", "Content": "Was travelling around Europe last christmas and had problems securing my accommodation in Rome - new year's eve to new year day itself. Hence, had gone ahead to book a room at Princess Hotel last minute. Arrived at Campino Airport late at night and had taken a cab to the hotel. The cab ride cost about EUR55 - the driver claimed that the hotel is located outside the area where cab fares are capped at EUR30-40. Anyways, we arrived at our room, which was pretty average. Would have to say that the bathroom was well maintained and clean. The EUR125 per night price we paid for was strictly accommodation only - no airport transfers, no breakfast. Was most disappointed with the location of this hotel. It was a long long long walk to the nearest metro station! I recall having to walk the long long stretch 4 times a day - unbearable. Especially, if you have alot to carry with you, the walk takes forever. Checked out after 2 nights to move to somewhere closer to central Rome. Had left my mobile at the hotel and made the long way back to collect it. To our horror, on our way back, just 500m away from the hotel, we were stopped by a car, with some self-proclaimed police officers (they look like Morrocans), who asked if we were Koreans and requested to check our passport. We ran for our lives, back to the hotel to inform thhe receptionist, who seem non chalant. All in all, not so pleasant experience - not entirely attributable to the hotel but still, will not stay at Princess again. Should have read the reviews here before proceeding wiith my booking.", "Date": "October 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Paris", "Title": "“a real let-down.”", "Author": "Heath-in-Paris", "ReviewID": "UR18372673", "Content": "I booked the hotel on-line and decided to go with a hotel that was further afield so that we could enjoy the pool in the July heat after a day of site seeing. I was a bit aprehensive after reading the reviews here, but went ahead and booked anyway. The hotel is a good 15-20 minute walk from the metro (which closes at 10pm). Buses run to the metro stop about every half hour, but you still have to walk about 10 minutes uphill to get to the bus stop. Once you get to the metro, nobody has ever heard of the street on which the hotel is located nor have they heard of the hotel! So good luck finding it if you haven't brought along a special non-tourist map (tourist maps in the guidebooks don't go out any further than the vatican)!! The hotel is a 1970's warehouse looking building with windows (as are the neighboring buildings). The pool was out of order and had not been functioning at all in 2008. The \"double bed\" was actually 2 single beds pushed together. The fridge didn't work. The air conditioning had two settings: ON full blast or off. Rooms are not soundproof and several nights we heard our neighbors on all sides talking and their TVs blaring. The restaurant closes at 10 or so, and after that, when you order food, it is microwaved frozen food. On the positive side, the hotel was clean, the staff friendly and willing to help us find our way around, to the metro, to the beach etc. There were also plenty of bathroom amenities, which is probably where they got their 4 stars, I would have given the hotel 2 stars.", "Date": "July 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "uk", "Title": "“clean + handy base”", "Author": "aliandsteve", "ReviewID": "UR12353525", "Content": "Read very varied reports about it and were a bit uncertain. Pleasantly surprised. It was clean, rooms ok with airconditioning, food ok (we only had breakfast but could fill up for the day!), swimming pool was clean. Staff were very helpful + pleasant. A lot of comments stating how far it was from the Vatican + central Rome but taxi was fairly cheap + the Metro was quick + efficient. The nearest metro station is about 15 mins walk but if you buy your ticket (small shop behind the first petrol station you see) this includes bus travel to metro (only about 3 stops). We found it a cheap alternative to the city centre hotels + was fine.", "Date": "January 5, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Toronto", "Title": "“Who cares how many stars??”", "Author": "Indysmom", "ReviewID": "UR10229304", "Content": "I stayed in this hotel for 2 nights as part of a package tour to Rome this month. Facilities were clean and comfortable, not at all like I was led to believe by the reviews I read on this website. What more do you need? Rome is busy and exhausting, so there was no problem sleeping, and if all you need the room for is a place to shower and sleep, as long as cleanliness and comfort are there, the rest doesn't matter. Breakfast was adequate, and we were able to take enough from the buffet table to make a picnic lunch. This is a clean, decent hotel, at reasonable rates. You will pay much more closer to the centre.", "Date": "October 22, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Lucerne, Switzerland", "Title": "“Fine for large tour groups, but wouldn't choose to stay there”", "Author": "inkwave17", "ReviewID": "UR10031002", "Content": "Ah Italian hotels...I don't know what rating system they use, but this is definitely not what most people would call a 4-star hotel. It is basically a big boxy hotel designed for tour groups. To be fair, I have stayed in much worse and for its purpose, I think it is fine. However, if you are the average tourist on your own, I would not choose to stay here. First of all, rooms are tiny - however they DO have air conditioning, which is great. Bathrooms were also small and the provided \"towels\" were more like dishcloths. The tv screen was smaller than my laptop with only CNN (in black and white) for non-Italian speakers to watch. It appeared that some rooms had renovations and used key cards, while others were older and were still using keys, but I don't know if there were any other differences. Another big complaint - the walls were paper thin. I was staying with colleagues who were in the room next door and we could literally have conversations through the walls at normal speaking volume. The breakfast was blah..just dried up croissants, water, stale cereal and juice. As for access to city center Rome without a tour bus, you can either walk to the subway in about 20 minutes along a busy road or take taxis. It was about 13 euros by Taxi from Piazza Navona, which isn't too bad if you are sharing. If you are traveling on your own, stay somewhere else. If you are taking a tour and are being put up here, it's not going to be luxury, but it's not terrible and at least you aren't stuck an hour outside of Rome.", "Date": "October 2, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "uk", "Title": "“Fab - no problems at all!”", "Author": "ShaUk", "ReviewID": "UR10024624", "Content": "There was a group of 51 of us - we had a great time. The hotel isn't central but it only took minutes to get anywhere by taxi and the metro is close. Breakfast could do with a bit of a revamp and unfortunately the pool was closed, but the rooms were comfortable and clean, the staff were helpful, the bar was well stocked! We would recommend this hotel to anyone, its difficult to get a hotel in the centre of Rome that doesn't cost mega money! The Metro in Rome is so easy to use this hotel is great!", "Date": "October 1, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Versailles", "Title": "“simply horrible”", "Author": "inagoodmood", "ReviewID": "UR8451854", "Content": "I stayed at the Princess with my wife and I have never been more disappointed by a hotel in my life: the hotel is very far from the city center and the nearest underground stop is more than a mile away. You need to walk along a shabby and noisy road to get there because there are very few buses and you'll drop dead from breathing in all the pollution from the bustling street waiting for the bus to arrive! the hotel is located near the Hilton hotel and other very nice 4 or 5 star hotels but the Princess is certainly not one of them and should never have been awared 4 stars. How deceiving!: our room was small and barely clean, the bathroom tiny and inconvenient and the staff at the reception barely polite! We have returned to Rome since that dreadful stay at the Princess and have picked a really nice place near the Spanish steps; so my advice to you is: go to Rome but pick your hotel wisely!", "Date": "August 19, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Australia", "Title": "“4 stars - what a lie!”", "Author": "MagicBall", "ReviewID": "UR8417854", "Content": "My first encounter with this hotel was through its website where it showed decent photos of the hotel & room with a good description of its surrounding sites. Furthermore, it listed itself as a 4 star international hotel. As the price was reasonable (not cheap), I decided to give it a go. As I got there, the experience was far from 4 stars. The staff was rude when I asked for directions on how to get around in Rome, stating they had better things to do and just pointed me to a map. When I asked how frequent its complimentary shuttle bus to the train station was, rather than telling me the time - they proceeded telling me off as the information was already listed on their board - which was covered with so many tour bulletins, it was difficult to spot. Their shuttle bus times only runs about 5 times a day - the last being at 5ish pm. In summer, the sun sets past 9.30pm so going back to the hotel where there is nothing to do, seem pointless. However, it is a tiring 20mins walk back from the train station to the hotel. When I asked for additional towels, I was subjected to an interrogation as to why I needed them - the reason - the bathroom is so badly designed that it floods! When I explained my situation, they reluctantly handed me an additional rag - which was the towel. It was a horrible, nightmares experience staying in this hotel. Do not stay in this place unless you are desperate – and even then, surely you can find something better.", "Date": "August 14, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "england", "Title": "“so disappointed”", "Author": "superpippa", "ReviewID": "UR8273269", "Content": "I was terribly disappointed with this hotel Rome is my favourite city in the world and as a massive Roma fan, I was hoping to get to the stadio olimpico but not a chance! The hotel couldnt have been further away from the centre The area surrounding was enough dodgy and the rooms were dirty and unclean. The staff were rude too....they must have been laziali! I dont recommend to anyon, I dont understand why Cosmos still have it in their book", "Date": "August 1, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Brazil", "Title": "“Not good”", "Author": "CasalBrazil", "ReviewID": "UR8254391", "Content": "The hotel is far from the city center and twenty minutes walking to the near metro station. The room was clean but with a terrible musty smell. The breakfast was terrible. The staff was not so patient except just one man. There is no internet acess in the hotel. There was a terrible noise coming from the Ergife hotel that was in front of the hotel. We do not recommend this hotel.", "Date": "July 29, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Manchester, UK", "Title": "“Reasonable Hotel”", "Author": "Sam69", "ReviewID": "UR6749500", "Content": "I stayed here for two nights with a friend on a brief trip into rome during the summer and must say that I was slightly disappointed by it, considering the fact it was rated as 4 star on hotelopia.com. We used the metro from termini station to get there which took at least 20 minutes, and then found it difficult to find which way to go when exiting Cornelia station. Twenty minutes later and a mile down via Aurelia (and a few hundred yards down a back road that is via Andrea Ferrara), we arrived! The staff were extremely helpful and gave us maps and information upon arrival without having to ask for it at all. The rooms were quite clean, but the hotel was clearly in need of renovation. The shower was too small in my opinion and the bathroom in general seemed a bit run down, but overall the room was tolerable. The breakfast was poor, with the orange juice tasting like it was industrial acid and the bread/pastries tasted somewhat stale. We didn't get a chance to sample the swimming pool- Rome is an amazing city and there was so much to see! You can walk to the Vatican if you are up for a nice long two mile walk, and the area on the way does feel safe even in the evening. Overall i'd say that by Italian hotel standards, the princess is sound and I would stay there again if I had to, otherwise I would stay closer to the centre as the inconvenient location was the only real problem here. The hotel itself was average but maybe not quite up to the same northern European/N.American standards and I would warn anyone with very high standards that they may find this hotel a disappointment. Otherwise, you shouldn't have too much of a bad time after you've found it.", "Date": "February 6, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Kansas City", "Title": "“Good value - excellent staff - reasonably convenient”", "Author": "MJ-KC", "ReviewID": "UR6479630", "Content": "Staff was really pleasant and helpful with recommendations for getting around, places to eat, cool things to see and shopping. Rooms are small by US standards, but clean, with robust shower with plenty of hot water every day. Towels are skimpy, like a dish towel, but did the job. But I liked that the windows opened and we could get fresh air. The Gate 1 breakfast was a continental breakfast, not as good as the deluxe regular hotel guest breakfast, but very adequate. The short walk from the hotel bus to the Metro is no problem - across the street, behind the McDonalds (very good coffee and Italian sweets) barely one block. If you are in average physical condition you can walk the 3 km to the Vatican. We did several times - took about 35-40 minutes with traffic lights and window shopping. We felt safe - sidewalks were well traveled by all sort of people. Sorry to read about the bad experiences. We liked the Princess Hotel and would stay again on our next trip to Rome.", "Date": "December 21, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "st paul, minnesota", "Title": "“Do NOT choose this hotel!”", "Author": "robbiem", "ReviewID": "UR6233474", "Content": "We booked our travel, flight and hotel, through Gate 1 Travel. The Hotel Princess has a website which is totally inaccurate! The hotel is NOT in the Vatican area, nor is it \"conveniently\" located to a metro stop. It is on the outskirts of Rome and difficult to reach. There is a hotel shuttle to the metro which stops at 5:00pm. The metro stops at 9:00pm. It is very complicated and inconvenient for a tourist. I would NOT reccomend this hotel unless you are with a tour group and all of your transportation is arranged.", "Date": "November 29, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Burke, VA", "Title": "“Good Hotel”", "Author": "VAAdventurer", "ReviewID": "UR5428858", "Content": "After reading the reviews of the Princess Hotel, I was apprehensive about staying there. But I found it to be a delightful hotel. I was wondering if I was staying in the same hotel!!! My room was very nice and the location was good for the price. It was only a 15 minute walk to the metro and just a few stops to the Spanish steps. The metro station looked new and wasn't dirty at all. In addition, on the main street there were numerous places to eat dinner within walking distance of the hotel. The hotel staff were helpful. I don't know what everyone is complaining about. When in Rome, why are you even thinking about staying in your room!!! There are some many sights to visit, I was barely in my room except to sleep at night.", "Date": "July 5, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Portola Valley, California", "Title": "“Just Don't Plan to Stay in Your Room”", "Author": "A TripAdvisor Member", "ReviewID": "UR5188834", "Content": "My friend booked this trip so I was along for the ride. I went on all the web sites and read the various reviews about this hotel. To say the least I was a bit nervous about the Princess Hotel. We took a taxi from the airport so getting to the hotel was no problem, the taxi driver took us straight there. Once we arrived at the hotel it's not a very attractive, and it's next door to a hotel that looks like it's been bombed out. The view from the room window was depressing like a war torn country. There was not one ounce of charm to be found. My biggest complaint was that this hotel is not conveniently located period. You have to walk 15 minutes just to get to the metro station. Might not seem like a big deal, but when you have been walking for hours during the day, you want to be able to get on the metro and get home quick. On the good side, the rooms were clean and the staff could not have been nicer and very efficient. The restaurant, despite it's total lack of aesthetic appeal was suprisingly good. I would never come back to this hotel, I just think for a few extra Euro you can find a much nicer hotel in a better location.", "Date": "May 22, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Fantastic Holiday”", "Author": "A TripAdvisor Member", "ReviewID": "UR4997737", "Content": "After reading the reviews before we departed to Rome we were a little apprehensive to say the least! We took a bus service from the airport to the termini (which is the main train station in Rome) this cost us 8 euros each. From here we got a taxi directly to our hotel which cost 40 euros. We new this was a bit much but it took us straight there. Also we didn't know where it was so we had no choice! Upon arrival to the hotel, the receptionist was extremely helpful. He gave us maps for the underground and explained where all the main attractions were. We went our to our room which was a refurbished room - very clean. To be honest the hotel is on the outskirts of Rome however there is an underground station which is a 15 minute walk and from there its just a few stops to all attractions. The hotel runs a free bus service to the station every hour. We chose to leave the hotel at 9 each morning after breakfast and did not return until the evening after dinner. The hotel would not be very practical if you wanted to pop back for sleep/shower etc. Breakfast at the hotel was standard, toast, cereal etc. Our rooms were cleaned each day. Fresh towels and sheets etc. We decided to take a taxi from the hotel to the airport and reception arranged this. We paid upfront - 50 euros. Good holiday!!!", "Date": "April 23, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Cork, Ireland", "Title": "“Let's say that it's a bit old”", "Author": "Marla7", "ReviewID": "UR4990154", "Content": "Ok, it was cheap. Prices in Rome the week before Easter were just inaccesible. So we had to settle for this. But if it was in another country, no way it would keep not even half of its 4 stars! But I have to say that the room was clean and it seems they're doing some effort to rejuvenate the place a bit. Anyway, definitely a tour hotel. A room factory. And if you don't have a Globus bus driving you around, the 15 mins walk to the metro station can be tough!", "Date": "April 20, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Merthyr Tydfil, South Wales", "Title": "“Good value if you're on a budget”", "Author": "LouiseMerthyrTydfil", "ReviewID": "UR4956557", "Content": "I was a bit dubious about this hotel after reading some reviews but for the price, I think it was good value. The hotel is in the middle of being renovated and the work outside starts early in the morning but it's a good wake up call when there is so much to see in so little time! Even though the hotel is a fair distance from the centre of Rome, the public transport system by day is fantastic. We saved about 50 Euros by catching the service bus from the Airport instead of getting a Taxi. If you are on a budget and your bags are not too heavy, get the airport bus to the Termini (6 Euros pp). Then get the Metro from the Termini to Cornelia and hop on the no. 246 bus which stops by the Agip petrol station on Via Aurelia (1 Euro PP) - the hotel is about a 5 min walk from the bus stop. There was apparently a shuttle bus operating from the hotel, but we never saw it so we caught the service bus from the main road (Via Aurelia), to the Metro at Cornelia and then hopped on and off the Metro to see the different sights. We found the bar and reception staff friendly. If you are having breakfast at the hotel, wait to be seated as we picked our own seats on the first morning and were told quite sternly that they were reserved for other guests. We found the bottled lagers quite expensive (12 Euros for two bottles of imported brands and 8 Euros for two bottles of local brands)but bottled wine was quite reasonably priced (can't remember how much exactly). The food at the restarant was quite expensive too but if you can get the the area where the Cornelia Metro stop is, we found one or two nice restaurants there. Overall, a good value for money hotel. The location is fine for getting out and about in the days but I would rather have been somewhere with more choice of restaurants for the nights.", "Date": "April 10, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Abingdon, England", "Title": "“Really quite good”", "Author": "barbarat85", "ReviewID": "UR4948548", "Content": "I can't believe that some of the reviewers of this hotel were in the same place as us, with their complaints. The rooms are fairly ordinary (could do with some pictures on the walls!) but they were clean and comfortable,reasonable size, bathroom was immaculate and fully functioning. Staff were helpful and friendly (even found out the football results for me!). Breakfast was plentiful and good, though one morning it was very full with several large parties and it was a bit hectic. Yes it is a fair distance from the centre of Rome, but what do you expect for the price? Anywhere central is exorbitant. Buses and metro are easily reached and used, or a cab is only 10 euros. Only complaint was that the heating was on, making the room like an oven (until we dismantled the front and managed to turn it off!). And, the pizza served in the bar was like a frozen supermarket value product - shouldn't they do better in Rome?!", "Date": "April 7, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "2"}, "AuthorLocation": "Yorktown, Virginia", "Title": "“Requires a sense of humor...”", "Author": "A TripAdvisor Member", "ReviewID": "UR4823870", "Content": "Ah, Rome. How can you be unhappy when you're in Rome? I was totally impressed with the hotel staff--bilingual and very helpful. However, we reserved a queen sized bed and didn't receive one. Otherwise the room was fine, but construction on the outside began at 8 am Saturday morning. The shower was a vertical coffin--it will NOT accomodate a larger person. My boyfriend and I are average size, but acquired 50 elbow bruises banging into shower walls and doors. Say hello to Tony, who was an amazing bartender who taught us to say all the Italian cuss words. Have a GOOD map as it is quite tricky to return to the hotel on Roman roads if you are driving (eveything is one-way). We didn't sleep well because a big snoring monster was in the room next door and the walls were thin... but hey, who sleeps in Rome?", "Date": "March 31, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "glasgow", "Title": "“bit of a mixed bag”", "Author": "A TripAdvisor Member", "ReviewID": "UR4328135", "Content": "my room was pretty poor,rubbish bed and shower yet along the cooridor all my friends had new bathrooms with shower and bath the rooms were really warm and the foyer was fine and you cant argue with 8 euros for a bottle of wine the staff were friendly enough and the shuttle ran when it said it would all our maws would love it", "Date": "January 6, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "2", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Newcastle, N.Ireland", "Title": "“Isn't as bad as people make out!”", "Author": "dat_sloan", "ReviewID": "UR4323124", "Content": "I am a person who doesn't like sleazy places, and when a family member booked it, i thought Faulty Towers!! but this wasn't one of them, i was very impressed. The rooms were warm, nice and clean and recently refurbished (First Floor). Food was impressive and most staff are friendly apart from the reception staff. They seeem to have an attitude with the guests!! Breakfast consists of cereal, bread, orange juice and tea/coffee. For an extra €6 you can have bacon & egg. Hotel isn't 4* but hotel at the top of the road is 4* for and extra £10 per night. I came as part of a group of 18, including kids and no one had any problems. I don't think i could stay there at High season, but who knows. Taxi is €8 to the vatican and from there you can walk to most attractions within 20 minutes. Take my word for it, it's fine, don't worry yourself! Have any questions, don't be afraid to e-mail me! Hope this is helpful to you! David (from Ireland)", "Date": "January 4, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "3", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Virginia", "Title": "“Reminds me of the Titanic”", "Author": "love2travelpinay", "ReviewID": "UR4141013", "Content": "It was very cold in Rome during our last day of travel in Italy. We stayed in the 1st floor of the hotel. Our room had no carpet and worst of all there was no heater. The shower was terrible the water drain had a problem. When I took a shower the entire bathroom was wet. The floor drain was not working. I did not sleep that night the room was freezing. I was like Jack in the movie Titanic. The hotel lobby was so dark. And the hotel looked liked it was not remodeled since the early 70s. I would defintely not use this hotel in the future. If you have a choice please don't stay in this hotel.", "Date": "November 23, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Merseyside", "Title": "“Great value hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3779596", "Content": "We stayed at The Princess in August with two small children. After reading all the reviews we were quite worried to say the least but when we arrived we were very surprised how good it was. The rooms were very clean and all had had a face lift with air-conditioning, new bathrooms, clean sheets and towels every day and they provided cot beds for our children - more than you could wish for for the price we had paid. The staff were so very friendly and helpful and the hotel had a buzz about it as it was busy. The only down side about this hotel is the location, it is about a 45 minute walk to The Vatican or 10-15 euros in a taxi. We would definately stay there again especially as they were so child friendly.", "Date": "August 17, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Dublin", "Title": "“A LOT Better than you'll imagine”", "Author": "dublindec", "ReviewID": "UR3653764", "Content": "Going by other reviews on this website I assumed that what I was going to stay in was a hole but just returning from a 4 day break in Rome I genuinely was pleasantly surprised with my stay in Princess Hotel. These are the facts as to how I saw it: 1. The hotel and its surrounding areas are undergoing complete refurbishment at the moment which they seem to be doing on a room by room basis. It would appear to be hit and miss as to what one you get when you book. 2. The refurb'd rooms are perfectly fine - clean, smartly decorated, tv (all italian speaking channels except mtv) fridge, air con, safe, good shower, towels not great but everything else WELL worth the 80euro a night the room cost 3. Breakfast is standard continental fare 4. The Hotel is approx 40 mins walk to the Vatican 5. The Hotel is ten minutes walk from Cornelia Metro stop 6. Dont be expecting much of Hotel Bar This hotel for what I paid for in peak season was well above average", "Date": "July 10, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Denver, CO", "Title": "“Bad, bad, bad”", "Author": "A TripAdvisor Member", "ReviewID": "UR3574422", "Content": "They stuck me for a $417 cancellation charge on 2 rooms I did not book! The cancellation transaction is in dispute now with my credit card company. Their computer system died completely and they wanted cash for all transactions while the the computer was down for 3 days. Very difficult to work with. They cater to tours and know the clients will not return, so they don't care about service. Lackluster menu. Same breakfast every morning.", "Date": "June 18, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Grandville, MI", "Title": "“I would rather sleep on the streets than stay here again”", "Author": "A TripAdvisor Member", "ReviewID": "UR3495492", "Content": "Let me begin by saying, this by far, was the worst hotel I have ever stayed at in my whole life. Everything about this hotel was terrible and I would have rather slept on the streets than to stay in this hotel one more night. The room was very dark and outdated and extremely hot. The airconditioning didn't work and the room was uncomfortable. The walls were seriously paper thin and you could hear every word of the people in the rooms on each side of you. (not to mention the anybody talking in the hallway) You could even hear someone tinkling in the toilet in the room next to you. I could seriously hear everyword of the tv program in the room next to door. I know hotels in Rome are old and this is a common problem, but the Princess Hotel was about a million times worse than any hotel I have ever stayed at. We traveled throughout Italy for 11 days and this hotel was downright terrible. Before my husband and I went to bed, we put the do not disturb sign up on the outside of the room. The maid completely disregards the sign and barges in our room before 9AM and then slams the door closed when she realizes we are still in there. HAs she ever heard of knocking? Then, the posted check out time on the back of the door was NOON. We got a call from the front desk at 10:35 telling us check out time was at 10:30 and asking us why we were still in the room. We told them the time posted on the door was noon and they acknowledged this and then stated we still had to be out of the room by 11:30. I didn't want to stay in this hotel a second longer. I was hot and tired and barely slept a wink past 6 AM because of chatter in the rooms next door and hallways. All were heard all morning, were doors slamming and people talking. Even if someone whispered, you would probably been able to hear it. The staff treated us like second class citizens. This hotel is so far off the beaten path, you have to walk 25 minutes down a busy road to get to a train station to take you to anywhere. The shuttle was a complete joke. I don't ask for mcuh out of a hotel room other than a clean, safe place to sleep. I hardly slept a wink between the noise and the heat. The staff were so rude that we couldn't wait to leave this dump. To anyone considering staying in this hotel, please think twice. I know there are nicer hotels in Rome at this price. If you like being treated like dirt and can sleep through an atomic bomb, then this is the hotel for you.", "Date": "May 23, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Scranton, PA", "Title": "“Pretty good”", "Author": "A TripAdvisor Member", "ReviewID": "UR3434825", "Content": "Having read the horror stories, we were apprehensive to say the least. WE were pleasantly surprised with a clean, large and accomodating hotel. It is in the midst of moderniizng. The rooms were large, good beds, friendly staff. The hotel is way out of town but this is why it is cheaper. Bring earplugs for all Italy's hotels. I feel this hotel is underrated, and while not the best, is certainly not the mess I expected. Most hotels in Europe have different set ups in rooms, as the hotels are old and the renovations move along slowly. If you want the Holiday Inn, stay home. If you want to experience a culture, travel.", "Date": "May 3, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Most Definitely, never again!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3394210", "Content": "My wife and I booked for a 14-17 Apr 2005 stay in this hotel thru hotels. In the hotel description from hotels, it said that is just a few kilometers away from the Vatican and St Peter's. This is the reason why we booked this hotel. During our stay, we were able to prove that the cleaning crew were not changing our bed sheets, and we suspected that the used hand towels which we left in the hanger were not replaced either. Only those towels that we threw on the bathroom floor were changed! Or so we hoped! We arrived into Rome by train. From the Roma Termini station, we decided to take a taxi ride. During the taxi ride, we were so excited seeing great attractions that we would pass by. My wife even urged me to start taking videos! Minutes past and we started seeing residential areas. Soon we realized that we were outside of Rome. We decided to take a look at the tourist map given to us at the information booth from the Termini station. We thought, our taxi driver was taking us for a ride! Sensing that we were suspecting our ride, the driver asked if we were looking for the hotel in the map. We told him yes. He smiled and told us that our hotel was off the map! He assured us that he knows where our hotel was and we should not worry. Indeed, he was able to get us to our hotel without consulting his detailed map nor asking anyone at a metered price cheaper than what was suggested to us by the information agent at the Termini station. Once we arrived at the hotel, the hotel staff were great and very polite. They gave us a version of their tourist map which includes their location. Indeed, this hotel is off the city map! It is not even close to the 3 kilomoter distance as advertised. They even provided us with a hand drawn supplemental map on how to get to the train station from the hotel. However, the hotel provide a free shuttle to and from St Peter's but the first trip we thought is quite late, which is set at 915A. Especially at that time when Rome is bustling with tourist, we thought, it would be too late to be arriving after 9A at St Peter's. In addition, the shuttle bus that they use is just a measely 25 seater bus, with 1 seat missing! During this entire trip, we visited London, Venice, and Rome. In each city, we booked hotels thru hotels at rates that were similar. All hotels were rated by hotels as 3-star and above. Of all 3 hotels that we booked, this is the only hotel that did not include a complimental breakfast. The only thing that is working for this hotel is their friendly and helpful staff. One of them even let us borrow his own umbrella on our last day when it was pouring outside.", "Date": "April 20, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "London", "Title": "“Not happy”", "Author": "A TripAdvisor Member", "ReviewID": "UR3332123", "Content": "I don't see how the hotel can be rated as 4*, as it certainly doesn't seem like one to me. 1. The breakfast wasn't free, and they didn't tell us that until we've started eating! It costed like 6 euros per person for some stupid burnt croissants and funny tasting orange juice! 2. Being in the room at night was like being in a sauna, there was no air con nor temperature control, so we were like dehydrating sleeping in that room! 3. The room was so noisy...can hear the people talking next door and the cars and coaches going pass outside. 4. The toliet didn't flush properly, and made a loud scary noise everytime we flushed! 5. The room looked a bit crap, small and undecorated, and no kettle nor cups nor coffee/tea/hot chocolate. 6. The bathroom was way too small, it didn't even have a bath tub. 7. You need to pay 5 euros deposit for this special hotel adapter for your electronic equipments (such as hairdryer)- but this is so silly of them! Why can't we use our electronic products as normal?? 8. The bar only opens from 9.30am to 12pm, and remains shut for rest of day. What's the point?! But apart from that, everything else was ok, the beds were tidied by the maids every morning and bins were emptied, the shuttle bus service was ok too apart from being too small, and the hotel is not too far from vatican (about 45mins on foot).", "Date": "April 5, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "greece", "Title": "“The most impolite stuff in Rome!”", "Author": "terina", "ReviewID": "UR2960710", "Content": "I am from Greece, I visited Rome in November 2004 and I stayed in this hotel 4 days. I had a very bad experience. My room looked like a stable (cold, dirty, very-very old), the food was bad, but the most important was the behavior of the people who working there!!", "Date": "December 29, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Phila, PA", "Title": "“Not 4* but......”", "Author": "A TripAdvisor Member", "ReviewID": "UR2856024", "Content": "Not 4* hotel. The rooms were clean, the staff friendly, the breakfast croissants and coffee. The price was right, the location is a bit distant. Cabs into town about 12-15 Euro each way. The bathroom was tiny, the beds were ok...unless you are over 6' then you will have a problem. I had no need for airconditioning, but the heat worked fine. They have a special electric hook up so your adapters won't work. It can be noisy. The elevator does not go to the top floor, so you must go to 5 then walk up two flights of stairs, but you get used to it. I came to Rome for the city of Rome, not to spend too much time in my room, and when I did return, I was so exhausted that I fell right to sleep. All in All no major problems.", "Date": "November 30, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Minneapolis, MN", "Title": "“I would NOT recommend anyone to stay at this hotel.”", "Author": "A TripAdvisor Member", "ReviewID": "UR2772328", "Content": "Bring your earplugs because the noise from the trucks and buses outside is unbearable. The rooms are cramped and run down. The hotel is not centrally located and quite far from many of the major sites and subway. We only stayed one night here (thank goodness!). There are many other hotels in Rome that for the money would be better choices than this one.", "Date": "October 22, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "queens,ny", "Title": "“hated it”", "Author": "A TripAdvisor Member", "ReviewID": "UR2587395", "Content": "we stayed at the Princess Royal Hotel, in 8/04 and the atmoshpere and experience was very bad. we got there late in the evening and went to the resturant, ask for Lasagna, we were given burnt food and the Maitre D told us that's how they eat in in Rome, we refused it. (the maitre-d is bald head tall old guy with glasses , he was very rude and loud and acted like he wanted to start a fight). the refrigerator in the room was old and molded and the place is falling apart for get about the bed and the furniture looks like its from a dumps, and i do think the name should be change from Princess to Roach motel. i would not recommend this hotel to anyone it is the worse place and experience that i have ever had. (Roach Hotel).....It's is far from all the site scenes.", "Date": "September 20, 2004"}], "HotelInfo": {"Name": "Princess Hotel", "HotelURL": "/ShowUserReviews-g187791-d229050-Reviews-Princess_Hotel-Rome_Lazio.html", "Price": "$86 - $194*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Andrea Ferrara 33</span>, <span class=\"locality\"><span property=\"v:postal-code\">00165</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "229050", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/6b/80/6b80486867c6133e8b78140c7649aaa68large.jpg"}}