{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "norfolk UK", "Title": "“Heart sinker.......”", "Author": "yummymummynorfolkUK", "ReviewID": "UR128311012", "Content": "The location of the Inn is great, enviable location right amongst the beautiful shops on Via Condotti, excellent coffee shop next door, and just steps away from the Spanish Steps, so top marks for the location, I think this must be what the hotel base their pricing on. We had booked the standard room category, expecting that such a high standard of property would be well appointed at this level, but sadly not. My heart did sink when we entered the room, it was small, very small, and dark, giving us a very oppressive feeling. We had been on a real high, Roma is the most amazing place, but when we got to this room we felt really gutted to end our last few days here. We asked to upgrade, which the concierge - who was super by the way, was able to sort us out another room in a higher category for an additional 80 euros a night which I think was a reasonable price for the improvement we got in the room. So - this improved the situation, as the next room was much bigger, with nicer decor. I know Roma is expensive and you pay for location. My advice for this property is to choose a higher category of room than the standard types. The concierge recommended a restaurant to us called Guatano Costa, at Via Veneto - he booked us a table there, we had a fabulous dinner, the ambience is very en vogue - modern contemporary, excellent service, totally fabulous dining experience, I am grateful to the concierge for his advice on this one. Roma is magical, expensive yes, but you expect this. We loved our visit, and would definitely return , but maybe experience a different property that suits us more.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jakarta", "Title": "“The Inn at The Spanish Steps..... remember that name.”", "Author": "Irvansaid", "ReviewID": "UR128205736", "Content": "We just came back from travelling around Europe for 24 days, our first stop was\"The Inn\", and oh boy what a nice hotel to start a long romantic trip, it was indeed a memorable stay. Gina, the previous reviewer is my wife, and we both were so grateful for the upgraded room, the view was fantastic and the room was quite spacious considering the super prime location this little boutique hotel is located. I was a little apprehensive at first, since I'm use to big hotels, because the entrance to The Inn was quite deceiving as it was rather small, a little dark, and yes... the tiny elevator scared me a little bit. But that was it, the room was surprisingly marvelous. If you are a shopaholic for branded fashion items than look no further, this is the hotel for you. Downstairs next to the lobby is Cartier, opposite is Bvlgari, Gucci etc etc. My wife nearly had a branded stroke, luckily for our credit cards, it was our first city and we didn't want to carry shopping bags all around Europe. So instead, we walked around Rome and I was surprised to see how close everything was! Trevi fountain, Colosseum, etc etc...nearly all tourist attractions are within walking distance. The service is another thing, it was great! I had great breakfasts, and if you guys from the Inn are reading this, please tell me what kind of coffee you serving in the morning? I miss that coffee. The Inn at the Spanish Steps, remember that name when you visit Rome.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“A gem in Rome,no where else to stay”", "Author": "Ginahalomoan", "ReviewID": "UR127282660", "Content": "Excellent staff, Fantastic view,cozy and tastefull rooms, very clean and breakfast is superb! Location is excellent! In front of spanish steps, surround by high end designer boutique in via condotti right across Bulgary, gucci, hermes, prada, roberto cavalli. The staff is very nice, we got a free upgrade for the rooms! Flavia also very informative and helpfull! The services are excellent. Great place to start exploring italy.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manila", "Title": "“Feels like home on the best shopping street in Rome!”", "Author": "mainevent", "ReviewID": "UR127228543", "Content": "I purposely chose The Inn for its location as Rome is the final stop of our fourteen-day vacation in Italy. Intended to shop on our last few days. Heaven as all luxury brands are at the doorstep, more around the corner at Via del Babuino! Despite location on real estate gold, the inn feels homey and comfortable. Rooms are very clean and charming, rooftop terrace a nice respite from the chaos outside. Breakfast spread quite good. Staff is outstanding--- helpful and sincere, thanks to you all very much! Metro is a short walk away, and other sites like Piazza Navonna, the Patheon etc. are within walking distance with a map. Streets near and around the hotel filled with restaurants, delis and shops. All Saints Church at Via del Babuino has opera nights, sublime. We took the advice of one reviewer of booking the limo service to the airport as our flight was 11 am. At 45 euros, a very good deal, instead of lugging heavy luggages around the train station on our last day, we were relaxed and arrived in good time at the airport. What a perfect end to a memorable trip!", "Date": "April 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Quirky but it works”", "Author": "samuel04", "ReviewID": "UR127119172", "Content": "You wonder if you've made a mistake when you enter the Inn - it's hidden away off the most impressive street in Rome. And the reception doesn't give away anything either. It's only when you realise that the position of this hotel is everything that you understand why this hotel is a hidden treasure; a one minute walk and you are at the Spanish Steps, 30 minute slow walk to the Vatican is the longest you can take. And the roof terrace is something else when you know that five floors below there are thousands of people rushing around. Breakfast is a pleasure as is late afternoon tea with complimentary nibbles. Staff were very helpful with everything we needed. And we shall return.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Carmel, California", "Title": "“Priceless memories.”", "Author": "carmelsunset a", "ReviewID": "UR125211686", "Content": "This little inn sits next to everything you will want to see. The joy of being able to walk to shopping, sites and fine dining. We have stayed other places in the past and the motions of getting a taxi and hurrying to get home after an evening out detracted from the old world feel. The Inn allowed us to mantain this European feel from the beginning to the end of a day. Our room looked out at the Spanish Steps and the dull murmur of people talking as well as the fountain was a welcome backdrop. A true piazza feel! The staff was extremely friendly, the linens perfect. Really it was worth the splurge. If you are in Italy than it pays to stay in the heart of it. The Spanish Steps are the heart and the Inn is the perfect location.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Singapore, null, Singapore", "Title": "“Excellent location, very excellent staff”", "Author": "Victorkwok", "ReviewID": "UR125159730", "Content": "Just finished a medical conference in Denmark and landed here (still here). Great disparity between Denmark hotel and here. This place has superb location; downstairs is prada, Gucci etc, like living in Orchard Road in Singapore. Its walking distance to all attractions. Rooms are average size but decent and very clean. But won't be in design magazine catalogue. Place is homely. More character than hotel chains. Not budget hotel or low class inn, don't worry. Staff is extremely polite and helpful. Especially the lady at reception counter who gave a good restaurant recommendation at Marco G. Gonna stay for another 2 days in this beautiful city. Will stay here again.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Herzlia, Israel", "Title": "“Intimate and charming hotel”", "Author": "michelleatzmon", "ReviewID": "UR124946757", "Content": "A wonderful little hotel, excellent location. Walking distance to all important places and shopping centers", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Ideal romantic break away”", "Author": "Niamhod84", "ReviewID": "UR124315613", "Content": "I cannot describe how fantastic this hotel was. From the beautiful and immaculate rooms to the welcoming and professional staff it really is the ideal hotel to stay in while visiting Rome. We were upgraded on arrival by the lovely Karina to a frontfacing room with a view right up to the Spanish Steps. The hustle and bustle was right outside our window from morning until evening but once the heavy curtains closed we didn't hear a thing. The snow in Italy came down on our second day and although we were disappointed that a lot of the sights such as the Vatican and the Borghese was closed we enjoyed the romance of the city and the absolute delight of the Italians. Families were out in force enjoying the weather and spirits were high. This hotel is wonderful for a couples break away and is a little oasis of peace and quiet after a days trekking! Enjoy x", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Great location, great staff!”", "Author": "Sjefftx", "ReviewID": "UR124261595", "Content": "Went to Rome on the first leg of honeymoon and The Inn At The Spanish Steps was our first hotel. The location is as good as it gets and allows for walking the city and/or short taxi jaunts. The hotel is small enough to be considered quaint, but staffed as well as any of the bigger ones. The staff was very helpful and went out of their way to make our 4 night stay quite pleasurable. They offered magnificent restaurant recommendations and reservations, accurate and helpful walking directions, and daily service that really helped make our stay relaxed and easy. The free breakfast upstairs was first class and a really nice touch as well as the happy hour. The room we stayed in was located in the main hotel building and it was small(as most European hotels are,) but quaint and well appointed. If there is any complaint, it would have to be the bed. It was the hardest bed I have ever slept on and could really only compare it to sleeping on a dining room table. We enjoyed the hotel very much and made it through the stay on the bed and slept pretty well, but if these recommendations are going to have any merit I believe that issue has to be mentioned. Hopefully they will look into upgrading the beds in the near future. I would recommend the hotel to others, but I would want them to be aware of the bed situation before making their final decision. If the bed situation is remedied I cannot think of any reason not to stay at this hotel. In fact, I would say to stay anywhere else would be foolish.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“great location fantastic rooms”", "Author": "judith s", "ReviewID": "UR124214825", "Content": "i stayed at the inn at the spanish steps for the second time .The rooms are beautifully furnished ,modern clean spacious ,at the best location .The service very helpful ,I greatly reccomend .", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Perfect location and overall lovely”", "Author": "Louiangel", "ReviewID": "UR124172065", "Content": "We stayed at the Inn for 4 nights at the end of Jan and was picked up from the airport in a comfortable car which was included in the package we booked. I think we would have been shattered trying to find it in the rain had we had to get the bus. Check in was easy and our room was spacious and clean. One downside was the lack of tea/ coffee in room - this wouldn't have cost much and if like me you like tea before bed bring a travel kettle. We were informed that breakfast was a full English however it wasn't (although probably some discrepancy in definition). It consisted of lots of lovely cakes, pastries, cereals and a bit of cold scrambled egg and bacon. What didn't help was the seating- wicker sun lounger type chairs not conducive to sitting up and eating more suited to sitting back and relaxing and quite uncomfortable. The hotel did offer a free buffet in the evening but the drinks were charged and weren't cheap. The hotel was in the perfect location for all sights and very comfortable after a long day. There is a spar supermarket and a mcdonalds cafe round the corner to solve the tea problem. Lots of lovely restaurants close by near the steps. Lovely designer shops on the same street. We were due to come home the day after the snowfall and we had booked a private care back to the airport. We were informed on the morning of our departure Franco at reception informed is the cars were not running and we would have to rely on taxis or public transport. Easier said than done when not a taxi in sight and a vey difficult walk with bags to the stations. However Franco and the staff were wry helpful and actually walked out onto the piazza in the snow to find us a taxi. Not the cheapest taxi ride but peace of mind to reach out flight in time. Thank you to all who helped much appreciated. Overall if I came to Rome again (which I will as it's a beautiful city) I would stay here again but I would not pay for breakfast (25 euros each per day) as not worth it and would like to sit up properly.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Couldnt have asked for a better location”", "Author": "kim1310", "ReviewID": "UR123897844", "Content": "I booked the Inn at the Spanish steps for a 4 day trip to Rome. As it promised to be on Via Condotti, I was filled with expectations. After reading the reviews, I was a little nervous. However, I must say that the room was beautiful and far exceeded my expectations. The staff including Franco, Pascal and the lovely ladies at reception were friendly and helpful. Breakfast was delicious and better than what is offered in most good European hotels. Finally I wish to say that there is nothing more wonderful than being able to drop off your shopping every hour and to pop into all the lovely bars and restaurants just a minute or 2 away.....I cannot wait to go back and stay in my favourite hotel in ROME!", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“3 wonderful days at the Spanish Steps”", "Author": "marikajkilleen", "ReviewID": "UR123339643", "Content": "It's the very first time that I write a comment on a community site like tripadvisor, but the Inn at the Spanish Steps deserve it! I found the hotel on booking.com. The rate was good, but I thought it was better to make a call to the hotel directly and see if there was any cheapest rate available if doing reservation over the phone. i spoke to Karina, and I immediateky understand she was a sweet and professional receptionist. She offered me a great rate with a compimentary upgrade. No need to say that I made the reservation with the hotel directly! I sent an email with my cc details and after 10 minutes I did received the confirmation by Karina. Fast and professional. At check in I have been welcomed by Franco, who speaks a fluent english and is very well informed about restaurants in the area. He gaves me great suggestions for dinner and every place had fantastic italian food at reasonable prices. As promised by Karina, I have been upgraded to a deluxe room, spacious and very well appointed. Breakfast was included in my rate and I enjoyed it every morning on their beautiful rooftop terrace. I will surely come back to the Inn!", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Executive room on Via Condotti.... Beautiful....”", "Author": "mandanarhughes", "ReviewID": "UR123189901", "Content": "My wife convinced me to spend some days in Rome to go shopping in occasion of the winter sales and we couldn't choose any better location. The inn is right on via dei condotti, which is the heart of shopping district in Rome. Among the variety of room category available on the inn's website, we booked the executive at a very discounted rate. There were special offers available and we got the seasonal sales offer, as sponsored on tripadvisor page. The room was beautifully decorated with a canopy bed (and a very comfortable mattress!). The service there is superb!", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Helsinki", "Title": "“Location, location, location (and service too...)”", "Author": "Lux-Hki", "ReviewID": "UR123166210", "Content": "As the purpose of our trip was shopping there really wasn't any other choice than the Inn at Spanish Steps, right on Via Condotti! We found a great prepaid deal on hotel website including breakfast, wifi and 'upgrade upon availability'. When we arrived the fabulous service by Giordana at front desk set a luxurious tone to our entire stay! The room we were upgraded to was located in a different building than reception but this was no problem at all, bellboys handled the luggage. In fact we rather enjoyed the private feeling of the floor where the room was. Rooms were large in Roman standard, clean and stylish. The breakfast was adequate in all ways, although the breakfast room is the smallest I've every been to, seats max 12 people or so. But we never had trouble finding a table and seats. As we arrived rather late we had asked in advance the hotel to book a restaurant for us and after the excellent dinner at restaurant 59 we actually opted to let the hotel arrange all our restaurant selections and reservations for us - every time hitting the nail no matter what our particular wishes were... We will definately stay here on our next stay in Rome!", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great location, great concierge”", "Author": "Scoobyru", "ReviewID": "UR121872087", "Content": "We came to Rome for a wedding in October, and chose this hotel based on its proximity to wedding festivities. It proved to be the exact type of hotel we wanted: small, quiet, a real respite from the tourist crowds of the Spanish Steps. The rooms were small, but we were upgraded to a very spacious room because we're members of the Small Luxury Hotel Club (SLH). It's free to join, and if you book your room through SLH, you should definitely join for the perks. The rooftop bar was a HUGE plus to the property! We specifically asked not to be in the annex, so that we could enjoy many a peaceful breakfast and cocktail hour on the roof. Best of all was the Concierge service. Not only did they recommend our favorite restaurant of our Rome trip, but they also helped my boyfriend track down a rental tuxedo for the wedding. We were definitely happy with our choice of the Inn at the Spanish Steps.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Apollo Beach, Florida", "Title": "“Perfectly Located”", "Author": "Judy M", "ReviewID": "UR121594003", "Content": "We have stayed in the main building of this hotel on two different trips and find it to be in a perfect location near the Spanish Steps, the Borghese, many restaurants, Condotti Street and Trevi. It is also convenient to the underground. The hotel staff is very accomodating and tries successfully to fill any request from making dining reservations, suggesting great restaurants that are not real pricey, arranging transportation to and from the airport. The rooms are beautifully decorated and the hotel has a rooftop terrace overlooking Condotti Street with the Spanish Steps at the top of the street where you can enjoy cocktails with snacks and the great breakfast served in the morning. There is a small evelator to service the main building. The elevator does not go all the way up to the terrace so you must walk up one flight of stairs to reach the rooftop, but the climb is worth it. The entrance to the hotel is on Condotti Street just about 1/2 block from the Spanish Steps and next to the Caffe Greco. It is a good choice when in Rome.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hamburg, Germany", "Title": "“Great location and hotel”", "Author": "Rahmies", "ReviewID": "UR121494274", "Content": "i'll make this short and concise: - helpful and friendly front desk. recommended some amazing restaurants to us that weren't overpriced and had incredible service and food. - rooms: we stayed in the main building. extremely efficient room staff. we left our room at 7 in the evening once, came back and noticed the staff had come back (again) to fold our towels and turn down our beds. in europe, that's not typical. - location: after walking everywhere in Rome for 5 day, i can safely say that you won't find a better location than this hotel. special: we arrived quite early, and our room had not been vacated yet. so we were invited to the terrace to have some coffee. they unexpectedly welcomed us with a delicious strawberry cheesecake.", "Date": "December 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tanya0810", "Title": "“Great location and beautiful rooms.”", "Author": "Tanya0810", "ReviewID": "UR121336467", "Content": "I stayed at the tinny inn at the Spanish steps in Rome November 2011. The location is perfectly close to everything; very central if you want to mix shopping and site seeing. It is also right next to the oldest cafeteria in rome. It is located on via del corso which is we're all the higher end retailers have shops. But all around the area you can find shops for all budgets. Don't miss the new Zara flagship store. It as 5 floors and beautiful set up. The hotel is really small but charming. The entrance might scare you (no elevator to bring your luggage to the small reception room) but don't worry, the staff is great and helpful. The rooms are just beautifully decorated in traditional roman art. The furniture and beds are comfortable. Just outside to the left and few yards to the Spanish steps. They recommended great restaurants in walking distance. Trust them. The terrace has a nice cozy section for breakfast to drinks (they offer a 5-7).", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Excellent hotel - location, staff, appointments”", "Author": "Michael800", "ReviewID": "UR121286190", "Content": "My wife and I really enjoyed the hotel's location (on the high end shopping street Via Condotti at the base of the Spanish Steps), its always-friendly and helpful staff, our beautifully appointed room with ceiling fresco, and the rooftop breakfust buffet and evening snacks. When we made our reservations, we were careful to specify the main building instead of the annex, and we also asked for the frescoed ceiling. They did have to move us to another room on the last day because they had to look for a leak from somewhere on our floor. They were gracious about the move and upgraded us to a room with an identical floor plan and location but on a higher floor with a small terrace we didn't have before. I'm glad we didn't pay for that type of upgraded room, as we didn't like the decor as much (too animal kingdom & modern) and the terrace was too small for furniture, so it wasn't like we could sit out there.", "Date": "December 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kuwait City, Kuwait", "Title": "“Location and perfect staff”", "Author": "Banshaker", "ReviewID": "UR120730618", "Content": "Very comfortable, cosy and so clean hotel. Wonderful breakfast, great personalised service, everywhere is made easy. Many thanks to the staff, you are great and you have a wonderful team. Ban Shaker", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kuwait, Al Kuwayt, Kuwait", "Title": "“Fantastic Hotel”", "Author": "Ramiikbal", "ReviewID": "UR120714583", "Content": "\"Extremely pleasant stay. A very warm welcome for us! Excellent in every respect, the rooms are very comfy, food is so great and all staff members are FANTASTIC... Would love to come back again.\" (Rami & Ban Ikbal)- Kuwait", "Date": "November 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Hustai National Park, Mongolia", "Title": "“Not quite average even!”", "Author": "TheMightyRawdon", "ReviewID": "UR120453397", "Content": "It is in a great position but if you are looking for a luxury boutique style hotel, this is not it. The place is tiny and not particualry well appointed. I would venture to suggest that the owners are watching every penny and are not investing in the infrastructure of the place. Something that made us laugh was the offer of a drink on the roof terrace - it is a joke (you think you may be getting a glass of prosecco on the House, but you ain't!). Breakfast was served on the roof which sounds great. However, the place is overrun with pigeons and the hotel seems unable to do anything about it. Will not be staying here again.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Stayed at the annex and loved it; will definitely return again if we get a chance”", "Author": "shinobirastafari", "ReviewID": "UR120174318", "Content": "We stayed at the annex off-site, and would definitely return there again. It's a very pleasant apartment, somewhat removed from the crowded Via Condotti zone. The only headache was the extremely cramped lobby (or lack thereof), which made it difficult for us to check in and check out when there were other guests ahead of us. Even so, the room itself was excellent, and we appreciated being situated in a pleasant \"locals\" building which provided excellent WiFi service and a quiet comfortable environment. I didn't think staying in the Spanish Steps area could be so relaxing!", "Date": "November 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“Fantastic location!”", "Author": "Kezbomb_8", "ReviewID": "UR120128795", "Content": "Fantastic base for seeing Rome. Staff were friendly, rooms clean and quite spacious for Rome (bed was a bit hard) we had a room with views of the Spanish steps.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Perfect stay with my family”", "Author": "erikamillblmq66", "ReviewID": "UR119669659", "Content": "We are a family of 4 and we spent a five days stay at the inn last week. We booked a family room as our two kids are still too young. Family room was a great compromise as it is composed of two connecting rooms, totally independent each other. So we could have our privacy and at the same time we were able to look after our children, sleeping right next to us. Staff was great and patient, our kids loved Karina and Jordana!", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Relaxing stay in a fantastic location”", "Author": "lisbethbjurvang55", "ReviewID": "UR119669131", "Content": "We reserved a superior room at the inn and got a very convenient rate. Breakfast was not included but we used their room service and every morning we got cappuccino&croissant, italian style! Our room was quite and very well decorated. It was facing the courtyard and our room had also a small balcony where we could sit and read a book. The terrace on the fifth floor is amazing and we loved the afternoon buffet before having dinner in a nearby restaurant.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Elegant ans stylish room”", "Author": "erikagrossmanny5f", "ReviewID": "UR119580325", "Content": "The Inn is amazing! Our room was quite, facing the inner courtyard, decorated with quality antiques whilst providing all possible modern coveniences. Front desk staff was extremely kind and professional and helped us a lot in arranging pick up service and visits to many museums. Great place to stay!", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Lovely place!”", "Author": "stifvermagnuss65", "ReviewID": "UR119579346", "Content": "The Inn was really nice! Our room was beautifully decorated with personal touches evident everywhere. Location is great, it is the perfect place from which to explore Rome. All sites are within walking distance. We enjoyed breakfast every morning and it was so good! The staff was helpful and always smiling. Overall a truly lovely stay!", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Jose, Costa Rica", "Title": "“Great location!”", "Author": "M29G", "ReviewID": "UR119548657", "Content": "The hotel is located in Via Condoti, really close to the Spanish Steps and Piazza del Popolo. The roof top terrace is beautiful.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "usa", "Title": "“Best Location. Great views.”", "Author": "sisraelt", "ReviewID": "UR119324546", "Content": "The Inn at the Spanish Steps in the most central location for touring Rome. It's a few steps to the Spanish Steps (you can see it from your window), short walk to Piazza Nueva, Trevi Fountain, Piazza Popolo and shopping areas. The metro/train is also a few steps away and a couple of stops to both Vatican, Termini and the Colosseum. The location is by far the most convenient for walking around the city and using public transportation on your own instead of taking cabs everywhere. The hotel itself is boutique like and very chic. The staff is very helpful and the happy hour and breakfast were both convenient and enjoyable.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Great Central hotel”", "Author": "Debbie966", "ReviewID": "UR119173982", "Content": "We were alittle worried when our pickup from the airport was over an hour late, but once we arrived at the hotel all our worries were forgotten. We were met by wonderful staff that made us feel at home. Our room had great views, with plenty of room to move, I do question there idea on the size of a king bed though. Breakfast on the roof terrace was excellent and a great way to start your day.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“excellent city centre hotel”", "Author": "01stephanie", "ReviewID": "UR118968267", "Content": "we booked the executive room which had a small balcony overlooking condotti st. It was clean & well appointed. The afternoon tea on the rooftop terrace was excellent, as was the breakfast in the morning. All the staff were attentive & made our stay comfortable. A little oasis in the hubbub of Rome", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "melrans", "Title": "“Wonderful....you could not find a better to explore Rome from.”", "Author": "markshreeve", "ReviewID": "UR118927162", "Content": "A wonderful hotel, attentive staff, service could not be faulted. We had a small verranda from which we could see the Spanish Steps themselves. Lounge/breakfast room on top floor verranda was amazing a bit of tranquility above the frantic place of life taking place below. The complimentary mid afternoon tea, could easily replace an evening meal !!!!!", "Date": "October 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“This is luxury!”", "Author": "gregorurghenst33", "ReviewID": "UR118294200", "Content": "We booked a double executive room with balcony for our three nights stay in Rome. The room was charming, with a canopy bed and beamed ceiling. From the small balcony we could see condotti street where all the most famous shops are, and spanish steps is on your left hand side. Breakfast was served on the rooftop terrace. It looks like a garden, with its lemon trees ans flowers! The staff is great and always smiling. We took advatange of their transfer service to the airport, with private car and driver, and it's been a good way to end our fantastic stay at the inn.", "Date": "September 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“What a wonderful stay!”", "Author": "santiagoplacencia556", "ReviewID": "UR118254178", "Content": "This place is our new favourite one in Rome! We booked the studio room among the several room categories available on their official web site. We chose the studio as pictures showed a very nice and modern room with kitchenette and independent entrance, furthermore it was the most convenient one! We loved the studio! Even though it is a little bit far away from the main building, you have everything you need there, it's like having a private house in Rome. Front desk staff is really friendly and professional. They helped is with restaurant and tours reservation. It' been a wonderful experience.", "Date": "September 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Lovely room in the annex!”", "Author": "florenziathugtdd1", "ReviewID": "UR118254071", "Content": "We had reserved a double room on their web site and Karina @ front desk has been so kind to let us decide at check in time among a room in the main building and one in the annex. We booked a classic room with courtyard view, therefore we decided to stay in the annex cause the room there faced condotti street. The room was spacious, with modern decor. Internet connection, which was included in the rate, worked properly both in the room and in the lobby. They use to organize a private breakfast in the annex for guests who sleep there. Of course you can still reach the main building and decide to have breakfast on the terrace. We loved the annex, and it was not too far away from the main building, you just need to walk down condotti street!", "Date": "September 18, 2011"}, {"Ratings": {"Location": "3", "Overall": "3.0", "Value": "2", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Weehawken, New Jersey", "Title": "“Like a chain hotel”", "Author": "BavariaB", "ReviewID": "UR118200343", "Content": "We booked here when our apartment rental in Rome fell through. We try to choose small hotels or apartments whenever possible, so when we came across a room belonging to this hotel that was off the property (more like a studio apartment) we figured we'd struck gold---an apartment with hotel amenities. Well, we'll never know, because when we arrived to check in at the main building, we were \"upgraded\" to a deluxe room (the rates were the same we later found out) in their property down the street (same name, many buildings---like a chain), which they told us was far superior to the room we'd booked. The decor and the atmosphere was what you'd expect from a chain hotel--a better chain, but a chain nonetheless. Housekeeping knocked on our door several times and at all hours to ask if we wanted more towels--one knock a day is enough. The concierge staff was helpful and recommended excellent restaurants in the area. We found that giving a hotel on Condotti as your destination to the cab driver tacks on 10Euros to your trip. It's the Madison Avenue equivalent of NYC. The view from our room was of a retail store. The breakfast was expensive but bountiful and served on a pretty terrace (in the main building) with a stunning view BUT this was the first and only coffee I had in Italy that was not good. Overall, we were not impressed. The price tag and star rating are too high and really undeserved. There's nothing unique here. Nothing special. Made for the masses.", "Date": "September 16, 2011"}, {"Ratings": {"Location": "3", "Overall": "2.0", "Value": "1", "Service": "1", "Rooms": "3"}, "AuthorLocation": "Seattle, Washington", "Title": "“Disappointing Experience”", "Author": "Stockyardspacking", "ReviewID": "UR118181617", "Content": "Here are the reasons for the star rating: - Our room was in the annex which was 3 blocks from the main hotel. This meant we had to walk to the main hotel or happy hour and to take advantage of the rooftop deck.  The hotel did not inform us prior to our arrival that this would be the location of the room. - The annex smelled horribly of smoke and the smell was also noticeable in our room. - The shower height made it difficult for my husband to shower. - The air conditioner unit in the room was loud and disrupted our sleep. - The phone in the room did not work for contacting the main hotel.", "Date": "September 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Amazing”", "Author": "thaochiegg98", "ReviewID": "UR118154913", "Content": "Great location, welcoming staff and clean room. We had a very nice time at the Inn, beyond our expectations!", "Date": "September 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Perfect stay!”", "Author": "hildebrandasandahh21", "ReviewID": "UR118154658", "Content": "Everything was perfect! They upgraded us to a deluxe room in their annex building which was very nice! Actually, it was one of the deluxe rooms shown on their website, with modern decor. The annex is 3 blocks away from the main building but they serve a private buffet breakfast in the lobby, so you don't need to walk to reach the main building, apart for check out procedure. The room was air conditioned and it was good cause in Rome it's still summer! The room was clean and the bathroom was very comfortable. Staff is friendly and professional.", "Date": "September 15, 2011"}, {"Ratings": {"Location": "5", "Overall": "2.0", "Value": "1", "Service": "4", "Rooms": "1"}, "AuthorLocation": "West Palm Beach, Florida", "Title": "“Charming decor only goes so far...”", "Author": "Deborah M", "ReviewID": "UR118152179", "Content": "When choosing accommodations the top 3 most important factors for my happiness are safety, location, and comfort. This hotel is undoubtably in a great location (perfect actually). I also felt very safe day and night. The most disappointing was the terrible mattress. I upgraded to a fresco ceiling room to celebrate the end of our amazing 2 weeks traveling throughout Italy. We even bought an amazing bottle of champagne to share. Upon entering a long narrow corridor to reach a security door we were buzzed into a non-lobby with a desk to check in. The staff was friendly and helpful. I was reasonably happy until being escorted to our upgraded room where I found a bed maybe knee-high with a mattress so worn and used I could (literally)feel springs. I immediately went back to the check-in room where they offered a different room with a better view at no charge. The bed in that room was no better. They refused to allow me to check out without penalty and go elsewhere (outside the cancellation period). They placed mattresses from the roll away cots on top of the mattress which helped slightly. Overall the staff did what they could to make the bed more comfortable. The reality is the only thing I wanted was a comfortable bed and that was they only thing that could make me happy. I was disappointed that I paid approximately 450 euro a night for the quality I received. I won't be back and would not recommend.", "Date": "September 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Two days of non stop shopping in Rome!”", "Author": "arizaflorentin66h", "ReviewID": "UR117992639", "Content": "It's been a wonderful week end! We chose the inn at the spanish steps for its location and it was perfect! The area is fully of shops and it's been a hard time for our credit card!! Our room was specious and not too expensive. Breakfast, which was included in our room rate, was great! We'll go there again, maybe for next seasonal sales!", "Date": "September 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Littlehampton, United Kingdom", "Title": "“Expensive but worth it for a treat”", "Author": "AA10", "ReviewID": "UR117976639", "Content": "Have just returned from a long weekend in Rome. Hotel is in a great location and the staff are fantastic couldnt do enough for you. We were upgraded from a classic to a superior room which was a great size. Was worried that hotel might be a bit noisy in view of the location but once in the room you felt away from all the bustle of Rome. Between 5-8pm complimentary snacks are served on terrace but drinks are expensive. We also had breakfast included in room rate if you don't it is 25 euro each which I think is a lot. Tip would be to get a card from small leading hotel group before you book as you get complimentary breakfast and upgrade if available. Nothing to fault with hotel at all", "Date": "September 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Beautiful boutique hotel in Rome”", "Author": "balingrayhowac55", "ReviewID": "UR117777406", "Content": "This small boutique hotel impressed us! We spent a couple of days there before catching our flight back home, after a 10 days cruise. The room was spacious with amazing modern decors. Bed was comfortable and the bathroom had jacuzzi bath. The price we paid was fair, considering that you are right at the spanish steps, next to prada, bulgari and any other famous shop! We've been welcomed by Franco, who gave us lots of suggestions for dinner and places to go. Our stay was just perfect!", "Date": "September 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Truly a nice place to stay”", "Author": "nicholasfrantrontt54", "ReviewID": "UR117729789", "Content": "We will recommend this hotel to all of our friends. To be at the spanish steps, our rate was a deal! There is a promotion going on (which we found on trip advisor!) and we've got a discount on the room rate and wi fi included in the rate. They upgraded us to a deluxe room with jacuzzi in the bathroom! At check in time we've been informed about the afternoon buffet (snacks are included in the rate, drinks are at a charge) and we enjoyed it everyday. We suggest you to do the same, it worth it!", "Date": "September 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“We spent two wonderful days at the Inn!”", "Author": "marcinkgrecay87", "ReviewID": "UR117704342", "Content": "It's been a very nice week end! Our room was superb and we got a very good rate (booked their special offer online and got free internet included as well as the breakfast!). Front desk guys are friendly and smiling. Location is perfect! We'll book it again for a longer stay hopefully!", "Date": "September 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Super! We will go back!”", "Author": "vannozzstendhal156", "ReviewID": "UR117643053", "Content": "If you are planning a visit to Rome, we highly suggest the inn at the spanish steps. Its location is perfect, with metro just few steps away. Shops, nightlife, monuments. Spanish steps is the very city centre! Breakfast is what we liked best! We always started our day with cappuccinos and cakes on their beautiful terrace.... Room was lovely and the courtesy of the staff made our stay truly enjoyable.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tucson, Arizona", "Title": "“I have recommended this hotel to everyone I know visiting Rome.”", "Author": "JHeieck", "ReviewID": "UR117628792", "Content": "We visited Italy in November 2010 on a historic tour. Rome was our last city. We stayed on a couple of extra days in Rome to sightsee and we selected the Inn based on trip advisor reviews. It did not disappoint. We had breakfast every morning on the roof lounge and closed out every night with a glass of wine and appetizers. The rooms were nice and clean. The staff was very courteous and attentive. The location is unbeatable! If we visit Rome again, we will definitely stay here.", "Date": "September 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent service!”", "Author": "standhalkugthh11", "ReviewID": "UR117614825", "Content": "Beautiful stay! The room was nice and very clean, staff is extremely friendly and helpful, location is perfect! You can't ask for anything better!", "Date": "September 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A lovely stay in a dog friendly hotel!”", "Author": "nathalyeortegaBHG22", "ReviewID": "UR117587394", "Content": "I booked a a room at the inn cause it is maybe the only hotel in the spanish steps area which accepts dogs. My little dog liked the food that they provided every day for her! Each staff member has been truly nice and welcoming with us, they helped me in arranging both the arrival pick up and the departure transfer to the airport at a very convenient rate (considering that it's a private car with driver!)", "Date": "September 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Beautiful stay”", "Author": "kafguimaraesyy1", "ReviewID": "UR117519840", "Content": "We spent two nights at the inn before a cruise and we enjoyed our stay very much! It was our honeymoon and they upgraded us to a deluxe room in the annex overlooking condotti street. The annex has only four rooms and it was really nice. It is down condotti, near to the corso, ultra centrally located. Our room had a huge walking shower and the both the room and the bathroom were spacious ans clean. A good start for our honeymoon!", "Date": "September 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Cozy room and friendly staff”", "Author": "nickmastersonhh32", "ReviewID": "UR117493032", "Content": "I chose the inn among the slh hotels in rome and I liked it very much. The front desk staff welcomed me as a club member and agve a free upgrade to a superior room which was very quite and cozy. Karina at the front desk has been truly helpful and suggested very good restaurants for dinner. i discovered that the view is their sister hotel and next time I'll book a room there!", "Date": "August 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“The best place we've ever been!”", "Author": "manolitoheming23", "ReviewID": "UR117477873", "Content": "We loved the Inn at the Spanish Steps! The room was on top floor and it was quite as it faced their inner courtyard. The staff is professional ans friendly, the know the area very well and you can trust them for any restaurant or tour suggestion. As many others reported, the afternoon buffet is great! Although you shall buy at least one drink, it really worth it cause there is a wide choice of appetizers. It's been a very nice stay!", "Date": "August 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great service and wonderful room”", "Author": "justincuendmil56", "ReviewID": "UR117257108", "Content": "We loved the Inn! Everything was perfect, starting from the front desk staff who welcomed us and made us feel at home. They gave us many good suggestions for restaurants and places to go. The room was truly nice and, considering that you are in the very city centre, it was quiet. Breakfast was delicious! We will go back!", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Scarsdale", "Title": "“Wonderful hotel and location”", "Author": "ScarsdaleJayS", "ReviewID": "UR116901284", "Content": "Recommended by friends we could not agree more. Upgraded from Deluxe to Executive room without asking. Room was amazing and not noisy considering location near the Spanish Steps. The morning breakfast on the roof was relaxing before touring. Staff was pleasant and efficient, though check in and check out seemed like something under the occupation with paperwork and stamps and receipts. I know alot of this in Europe but still took three times as long as other hotels in Italy. Would never consider any other hotel in Rome due to location and quality of rooms.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Guelph", "Title": "“Elegant and Stylish - location perfect.”", "Author": "LesleyFlaminio", "ReviewID": "UR116466393", "Content": "Although the rooms are small and few, the Hotel is beautifully furnished and elegant. We had a room for three people. A huge King Size Bed and a very comfortable extra bed filled the room. The bathroom was well equipped and clean. The location is priceless - on the Via Condotti - in the heart of all the designer shops. The rooftop terrace was lovely for breakfast or for the complimentary snack buffet in the afternoons. The staff was professional and helpful.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“amazing location”", "Author": "tpmack2", "ReviewID": "UR116234339", "Content": "We spent 3 nights at this lovely hotel. the location is second to none and the rooms while small were very nice. the roof top terrace was the perfect location for breakfast and late evening drink. staff was very nice and friendly.", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Toledo, Ohio", "Title": "“Living the life of luxury at this Inn”", "Author": "skynews60", "ReviewID": "UR116061188", "Content": "The hotel is charming. When you arrive you walk down a long corridor. There is an iron gate and you walk up a few stairs and then down a few to the office to check in. There is a bellboy there to take the bags. The lift goes up 3 flights but it is small so we walked to our second floor room and he took the bags. My 19 year old daughter and I had a deluxe room, though it came with no free internet, and no breakfast. I read that others had breakfast on the roof garden but we didn't know about it. We did go up to the top for drinks and fruit and other snacks at 5:30pm. The snacks are free, the drinks not. The room was stunning and classy. We were happy to be there after a week of more \"college\" accommodations in the Greek islands. The hotel is very security conscious. They filled out paperwork and needed my passport to buy internet time. I loved opening the window and looking to the left and there is the Spanish Steps. Wonderful part of town to stay in . Very classy.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Best location in Rome.”", "Author": "angelasedley", "ReviewID": "UR115714637", "Content": "Very friendly and efficient staff made our trip memorable. The young ladies on reception were just the best. Will definitely return very soon..", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Amazing staff and location”", "Author": "zilli34", "ReviewID": "UR115652690", "Content": "On arrival we were greeted by the charming Jordana who could not have been more pleasant and helpful. We has a few little issues which were sorted out speedily by Linda with no fuss and in a professional manner. Breakfast was delicious and eaten on the roof terrace overlooking the Via Condotti and the Spanish Steps. Great location and wonderful staff.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "2", "Service": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Great location, but not really luxury”", "Author": "CanadianRambler", "ReviewID": "UR115342245", "Content": "We booked this hotel based on the glowing reviews here, in Frommer's guide and elsewhere, but having now been there we would suggest you temper the expectations those reviews (and the hotel calling itself a luxury inn) will lead you to. We stayed here for our first 2 nights in Italy at the Inn, then travelled around Italy for the next week, then spent our last 3 nights back in Rome at a different hotel. I will review the various other properties separately but will only say by way of contrast that the Inn ranked 4th out of the 4 places we stayed. Other than 3 relatively minor things, nothing in particular was \"wrong\" with the hotel. The first exception to that was mostly just bad luck - we had a family staying down the hall with young children who apparently were still on North American time and who awoke us before 6 a.m. by going from their room to their parents approximately 30 times, with two accompanying door slams for each trip. This review isn't of said children's parent's parenting skills so I have not docked marks for that other than a slight deduction for the lack of soundproofing, which is unfortunately common in most of the hotels we have stayed over the years. The second issue is also minor but is the fault of the hotel - the towels were few and far between, and not what I would classify as suitable for a luxury property (small-ish and not very plush). We also had trouble throughout Italy figuring out why no facecloths, but I think thats more of a cultural thing than a hotel issue - it was the case everywhere except the big north-american chain we stayed at. Third, the room was exceedingly small and the bed exceedingly hard. There is a note on the hotel website that the classic double room (which we stayed in) in the main hotel are smaller than their counterparts in the annex, but I also note that there are no pictures of the smaller room on the website to show you just how much smaller. Since we forgot to take pictures, I will describe it as what I'll call the European classic, with maybe 5 inches on either side of the bed, and a bathroom with about 6 square inches of counter space. There was some room for clothes in a wardrobe but unpacking (or doing anything really) in the room was akin to playing Tetris given the lack of space. The bed along with the towels was also not what I was expecting out of something calling itself a luxury property - again the European classic, being small and a few notches above a piece of plywood in terms of comfort. The TV also only had about 3 working channels but we wouldn't have watched it anyway. On the plus side I can echo many of the other positives you will see in the other reviews. The location is truly outstanding, the staff very pleasant and helpful, and the rooftop lounge and breakfast are great as others have indicated. Everything was also very clean and the air conditioning blessedly worked well in the Rome summer heat. If this hotel marketed itself as something other than a luxury property (and/or charged less) I would not hesitate to give it a 5/5. However, for what we paid (almost 300 euro with the breakfast supplement) and with the negatives noted above I would rate it closer to a 3.5/5, rounding up to a 4 because of the great location and staff. I think the best way to sum up would be that we were disappointed because our expectations were so high - lower yours (and don't book the classic double) and it is probably a fine option. One other thing - if you are flying into Rome and staying here be sure to arrange to have them pick you up - in contrast to the other items this is a great value at 55 euro (pretty much what a cab will cost you) and its a huge relief to see someone holding a card with your name on it after a long day of travel.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Kinnelon, New Jersey", "Title": "“Lovely, romantic inn at the heart of Rome”", "Author": "pjonthego", "ReviewID": "UR115319284", "Content": "This is a lovely small inn at the bottom of the Spanish Steps where we stayed to celebrate our 25th anniversary. The rooms have old world charm and the service was excellent. Every restaurant recommended was wonderful, and the front desk staff was helpful with questions from directions to prioritizing sites to visit to making dinner and taxi reservations. Katrina in particular was most helpful (she was usually at the desk when we needed help) The breakfast buffet was very good, eggs, cold cuts, pastries, and assorted fruit. It was nice to come back to the evening snack buffet after a day of touring. The location was excellent for touring; we could walk almost everywhere. My husband and I liked the layout of the hotel (not a straight halled, rooms off the corridor place) and the tiny elevator made us smile each time we used it. Be aware that the elevator does not go up to the top floor, nor the terrace where snacks and breakfast are served.", "Date": "July 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“We've enjoyed our stay so much!”", "Author": "lukasandheather88", "ReviewID": "UR113570501", "Content": "This place is so nice! The staff is attentive and responsive, they know the area very well and gave us many recommendations about what to do during our stay. Jordana was extremely sweet! She checked us in and offered a room upgrade for our honeymoon. Our room was located on the second floor, facing the inner courtyard, and it was truly quite. It's been a relaxing and exiting honeymoon!", "Date": "June 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Unforgettable!”", "Author": "guddymarilu11", "ReviewID": "UR113342528", "Content": "We were a party of 4 and it was the first time in Rome for the all of us. This stay has been truly unforgettable... Rome is gorgeous, I guess it's the most beautiful city in the world and we were lucky to stay at the Inn, right at the spanish steps! This hotel is ultra centrally located and the staff make you feel at home. They care after us during our stay and booked private tours, restaurants and transfer service to the airport. Karina was the best, she's so sweet! Thanks everybody!", "Date": "June 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great! This is LUXURY!”", "Author": "lenetyort63", "ReviewID": "UR112117301", "Content": "It was my first time at the Inn. I go to Rome almost every year (I love shopping and Rome is the best place to do it!). I used to go to the Hassler, but my last stay there was terrible and I've decided to try something else. My choice has been the Inn cause I found their website so attractive! Rates were also convenient and I booked online with a discount. My room was in the annex and I liked it so much! The bathroom was spacious with a walking shower. Location was perfect as all my favourite shops were just there! The staff pampered us from the moment we arrived 'til our departure. They picked us up at the airport and organized the transfer back too, it was great!", "Date": "June 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "NYC", "Title": "“Beautiful - large rooms”", "Author": "garveyc", "ReviewID": "UR112082606", "Content": "We stayed at the Inn and were blown away. A beautiful hotel with large rooms (we stayed in the Annex) and loved it. The rooftop terrace has nightly appetizers, and the service is impeccable. The only downside is that there is so much traffic on the street because of the high-end shopping. It is like staying on Fifth Avenue in NYC. So, although not ideal for me, you may see it as a benefit.", "Date": "June 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“What a wonderful stay!”", "Author": "barbratownsend36", "ReviewID": "UR112005143", "Content": "We truly enjoyed our stay at the Inn. A friend of mine stayed there a couple of years ago and suggested me to book this nice property. I dare say it's been a very good suggestion! My room was very comfortable and they offered us complimentary items such as fruit and wine, much appreciated! They helped us in making reservation at the borghesi gallery and also took care of our flight reconfirmation. The staff is very efficient there!", "Date": "June 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Very nice and comfortable room!”", "Author": "geraldinehoppert32", "ReviewID": "UR111698218", "Content": "I booked this hotel for its location as I was looking for a place near the most important sites of the city. I like jogging and it' been so exiting to run every morning up to the spanish steps and villa borghese! Spanish steps at 6.30 am is amazing! The breakfast was rich and I could choose among a wide selection of fruit and cakes. My room was fantastic, with any comfort you could expect from a small luxury hotel. They upgraded me in one of the rooms in the annex building, down condotti street. Great!", "Date": "June 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Beautiful place with friendly staff”", "Author": "amandahouswey64", "ReviewID": "UR111522107", "Content": "I was in Rome for a meeting and I booked the Inn cause I don't like staying in big hotels. Two of my colleagues reserved their room at the Hassler and were not satisfied at all. When they came at the Inn and saw my room they were impressed, like I did, by the nice decor. My room was facing the inner courtyard and was so quite! The staff called me by name and they always welcomed me with a smile, and when one is on a business travel it's always good to feel that familiar atmosphere. Their rooftop terrace is beautiful! Every morning I could not miss my cappuccino. Will be back with my husband!", "Date": "June 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“The best place in Rome”", "Author": "monikausgrand85", "ReviewID": "UR111465989", "Content": "My new favourite hotel in Rome. I liked the style of the room, which was also spacious and comfortable. The service was impecable: the front desk staff helped me in finding lots of shops to buy very original gifts to all my friends. They also gave me good suggestions for tours and restaurants. I will stay there again for my next visit to Rome.", "Date": "June 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "phoenix", "Title": "“Great place but be wary if you have trouble climbing stairs.”", "Author": "time2travelPhoenix", "ReviewID": "UR111103261", "Content": "First I will start by saying that this boutique hotel is in a perfect location with very friendly staff and the most amazing views from the hotel roof where we recieved breakfast and had our afternnon snack and glass of wine. What I found was a pretty big problem for our group with one person having serious knee problems. The steps to get up into the room are plenty and they are quite steep for a person with walking problems. We knew it was a problem for us when looking to book this and it said on the website and through our travel agent there was an elevator. Well, there is an elevator but you have to go up steps to get to it and then it misses the third floor where our room was and even better did not go to the rooftop patio. The steps to the rooftop was actually more steep then any other staircase. So, I would highly recommend this hotel to people without any disability but absolutely not for someone with. For me personally it was a rooftop patio that you never forget with amazing views and really a fantastic breakfast in the morning that we looked forward to.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“It's been a deal!”", "Author": "maggievandykmas54", "ReviewID": "UR110653806", "Content": "Well, let's start from the rate: I booked one of the offers available on their site and I got a discount on my room rate and free internet connection for the whole stay! When I arrived there, they welcomed me in a very friendly and professional way, not a traditional check in. I could have a sit while they were doing the paperwork and in the meantime we talked and they offered me assistance for tours and restaurant reservations. The room I had was truly nice and the breakfast was superb! They use to serve breakfast on a terrace surrounded by lemon trees (can you imagine? Lemon trees in the very city centre) and flowers! It was perfect!", "Date": "May 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Perfect Location”", "Author": "Sankofa7", "ReviewID": "UR110328217", "Content": "This hotel is a quaint hotel situated in the perfect location, near shopping and all the sights. We stayed in their loft suite which is a block or two away from the rest of the hotel, which was nice because it gave a reprieve from the flocks of tourists near the actual hotel. It is a separate apartment with a small kitchenette and it's own private entry. The staff at the hotel were very helpful. In addition, they offer a nice spread of appetizers around happy hour on their rooftop. After staying in some dire places in Rome, this place is worth the nightly rate.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Awsome”", "Author": "billf8", "ReviewID": "UR110129371", "Content": "I stayed here with my husband and son for 3 nights. We got nice triple room with view of the condotti. Beds were nice and soft and the front desk staff was really nice. Good location in busy down town area but close enough to everything. Would stay again.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great rate!”", "Author": "gretchenkell66", "ReviewID": "UR109893156", "Content": "I found the inn at the spanish steps so convenient from any point of view. The rate I paid was really a deal, also considering that you are in the heart of rome, close to the spanish steps. The service they provide is impecable and everybody there has been nice and helpful. The room was beautiful and location is gorgeus! My opinion is overall positive, as many of other clients who spent their roman holiday at the inn!", "Date": "May 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“I must have been staying at a different hotel to the majority of the reviewers posted on here??”", "Author": "denisesims", "ReviewID": "UR109550917", "Content": "I m struggling with most of the reviews... whilst the location was spot on... I have nothing but complaints and negative comments regarding this hotel... how it can be part of the 'Small Luxury Hotels of the World' is beyond comprehension...?? Where shall I start?? The very basic basic rooms??, the refurbishment of D & G at 5.30am every morning below our room, the leak that wasn't fixed during our 3 day stay... turning the bathroom into a wet room?? the generator that ruined any conversation on the terrace?? the 2 ft square room that had to accommodate 30 people for breakfast when it started to rain?? the list is endless... if you're looking for a overpriced,basic 'b & b' in a very noisy, overcrowded location... this is the place for you.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“An interesting hotel to stay at.”", "Author": "Jandkat", "ReviewID": "UR109410941", "Content": "We stayed here for a week and booked through the SLH group. We paid a high rate made plain at check in when we were reassured the wifi would be free because we paid so much. Great. Location cannot be faulted though. Very central and everything is walking distance. Staff were good, made every effort they could with what they have. Value for money is questionable given the lungarno portrait suites less than 100 m away which are substantially superior to this. We've stayed at many of the hotels listed in SLH and this should not be rated as 5 star. It is a good quality 4 star hotel in an excellent location but needs more to make it 5 star. The 'family' room is simply a portable bed in a slightly larger room, and with an appropriate price increase. The bathroom is very small and whilst appropriate for the age of the building, it's not appropriate for 5 stars. Cafe Greco is Italian snobbery at it's laughable best. The waiters will ignore you for up to 20 minutes before deigning to accept your order. Coffee was barely average but the service is classic Fawlty Towers. It is worth going in and watching for half an hour as an amusement. Have no fear that you'll be asked to order something. The inn mentions the cafe as a highlight hence my inclusion in this review. Nice, interesting hotel, better available for less $ spent. 4 stars not 5", "Date": "May 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Welcoming staff!”", "Author": "eleonortribeca63", "ReviewID": "UR107953131", "Content": "We liked the Inn for its location, for the room which was really nice and for the breakfast, it was truly delicious and rich! But what made the difference there is the staff. Everyone has been really nice and gave us good suggestions on restaurants and place to go/see. They helped us in booking galleria borghese too! It's very hard to find tickets there!", "Date": "May 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Top hotel”", "Author": "svenson25", "ReviewID": "UR107891026", "Content": "We really can say that we had a great stay at this Inn. Upon arrival we were informed that our room had been upgraded that was a great surprise as this was our last night in italy. The room was huge facing out to the famous condotti street. We loved the location having the entire Rome in a walking distance from the hotel. Breakfast area was very cozy and full buffet breakfast was included. The staff booked us some great restaurants in the area and took care of our airport transfers at departure day. Great stay in great city.", "Date": "May 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A beautiful sunny week end in Rome”", "Author": "hugoandfiona1", "ReviewID": "UR107750186", "Content": "Spent a wonderful 2 nights stay at the Inn last week. We've enjoyed Rome so much, it was sunny and we walked everywhere. Location of the Inn is perfect to do so! Our room has been a wonderful surprise, much better than what I could expect! We purchased a room without breakfast, but the front desk staff suggested us to have breakfast there, as there was a special promotion and breakfast cost would have been reduced. Truly a good advice, as we loved the breakfast in the morning!", "Date": "May 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Superb!”", "Author": "francisdelakruz5", "ReviewID": "UR106437749", "Content": "The inn is definetely my place in Rome. It's now the third time that I go there and it's always nice. As a regular guest, I had an upgrade into a deluxe room, which was really cosy and spacious. The staff is friendly and they welcomed me as I was an old friend! The complimentary appetizers served in the afternoon are delicious and even if drinks are at a charge I find it a good idea. Internet connection is not for free, but the are lots of special offers on their website which also include internet!", "Date": "May 2, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "London", "Title": "“Needs a bit of attention in a few areas then it could be special”", "Author": "Conners37", "ReviewID": "UR105990639", "Content": "Spent 4 nights over Easter here. It's a cracking property but falls short if you're looking for luxury, peace/quiet and great service. We were on the 4th floor, big room but the sound proofing needs looking at. Had to bang on the wall twice and call reception as we could hear everything next door very clearly - especially if someone is wearing heels on the wooden floor. The terrace above also is noisy at breakfast every morning. The bed was two beds pushed together which kept coming apart. There was no duvet, just a blanket and not exactly premium linen. We were told no duvets were available. For the money and the aspirations of the hotel, this was not really acceptable. Luxurious and cosy it wasn't, which was a shame as the room was special, had loads of space and bags of character. Finally the service was a bit all over the place, slightly comic at times and didn't really match the price. It's in an amazing location in an incredible city but The Inn at the Spanish Steps didn't reach the heights we were expecting having read other reviews on here.", "Date": "April 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Easter in Rome”", "Author": "genevievegrangt6", "ReviewID": "UR105711465", "Content": "We booked a room at the Inn for our Easter break in Rome as there was a special offer available on their website. The room was not too big, but it was clean and very nice. The staff is superb! Always smiling and attentive. Easter breakfast was delicious, with cakes and chocolate eggs! Even if it rained a little bit, we enjoyed our short vacation so much and will choose the inn again in the future.", "Date": "April 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Italian ospitality!”", "Author": "steraveroBGH", "ReviewID": "UR104027144", "Content": "We've been welcomed by Karina and Pasquale. It was our first time in Rome (and in ìtaly) and both of them have been so kind to provide lots of information on tours, restaurants, places to visit. We walked a lot, as it's been sunny all our stay long! Don't miss the buffet on the terrace before dinner, we found it a very good idea cause you can relax a little bit before going out again for dinner! The room was nice and quite, although you are in the very city centre.", "Date": "April 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Our room was beautiful!”", "Author": "juliusholly32", "ReviewID": "UR103767438", "Content": "We spent almost one week at the Inn and it was our second time there. The room we had this time was even better than the one we've got last year, they told us that they renovated some rooms and as we were returning after one year they offered one of the new rooms. They are very comfortable, with flat tv and nice decor. The staff is friendly and welcoming. Thanks to everybody.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Lexington, Kentucky", "Title": "“I was claustrophobic by the second day.”", "Author": "teach7477", "ReviewID": "UR103673400", "Content": "Very small, dark room. There was no place to sit other than on the bed. Also, there is no lobby. The only place to find a fairly comfortable place to sit is on tthe 5th floor where they have seating and an outdoor terrace with tables and chairs. The morning breakfast served there is very good. They also have complimetary snacks in the evening. If you want a cheery, comfortable place, I would recommend that you look elsewhere.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Free internet and free upgrade”", "Author": "jamesandannie85", "ReviewID": "UR102509477", "Content": "We've just came back home after a super week end spent at the inn at the spanish steps. Booked the spring promotion through their website and got free internet connection and free upgrade to a deluxe room facing via condotti. Breakfast was superb and the staff has been extremely helpful!", "Date": "April 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Beautiful!!”", "Author": "gracerandmarta22", "ReviewID": "UR102431171", "Content": "Our stay at the Inn was memorable! From the first moment we found that place truly nice and welcoming. The room was gracious and comfortable. We will book the inn for our next trip to Rome!", "Date": "April 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“An amazing place to stay”", "Author": "tabonejill55", "ReviewID": "UR102312868", "Content": "I discovered the Inn thanks to some friends of mine who previously stayed there, and I decided to try it for my short holiday in march. Definitely a nice place to stay, with professional and friendly staff, they gave us a wondeful room and lots of good advices for restaurants and sites to visit. Location was terrific! Will go back for sure!", "Date": "March 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A nice stay at the Inn!”", "Author": "theodoretatcher98", "ReviewID": "UR99490008", "Content": "Our stay at the inn has been unforgettable! We found this hotel on tripadvisor. As we heard many positive comments about it, we decided to try and we are now glad to share our experience with the tripadvisor community! The inn is a small property, don't expect a huge hall. The staff is truly kind and professional, our room was cozy with a mix of classic and modern furniture. The breakfast was superb each day! Really a good choice!", "Date": "March 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A romantic Valentine's day”", "Author": "jtorsten_jap5", "ReviewID": "UR97717590", "Content": "I booked a room at the inn for me and my wife to celebrate valentine's day, which is also our anniversary. The room was really nice and we appreciated the gift that we found on 14 feb evening: chocolate&strawberries for our anniversary! Each member of the staff has been so kind with us that we felt like home!", "Date": "February 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Absolutely lovely!”", "Author": "hughesrown65", "ReviewID": "UR97051906", "Content": "We've loved that place! The room we had was a superior on the top floor. Breakfast is served on their rooftop terrace. Actually it is more than just a terrace, it is like a garden with flowers and lemon trees. Cherry on top: the front desk staff is professional and friendly.", "Date": "February 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Pure luxury in the heart of Rome.”", "Author": "GolaRS", "ReviewID": "UR96965890", "Content": "Unforgettable stay at the Inn, where excellent staff combines with superb location and divine design of accomodation. It'definitely worth the money we spent.", "Date": "February 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“My favourite one among small luxury hotels!”", "Author": "heatongroo99", "ReviewID": "UR96813399", "Content": "I am a SLH club member and I booked this hotel for my stay in Rome. Besides the slh amenities I am entitled to get as a slh member, I received a high quality service and the room was really nice and charming. The breakfast is rich and the staff is always smiling. No doubt, it is the best slh hotel I ever visited.", "Date": "February 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“8est place to stay in Rome.”", "Author": "tepricen", "ReviewID": "UR96546767", "Content": "We were in Rome for a long weekend and prefer boutique style properties, so chose this one based on that, reviews and location. We were not disappointed!! The place itself is beautifully presented with individually styled rooms, our room was very spacious. Our favourite part was the roof terracewhere we had breakfast every day. Service was fantastic and we got a pretty competitive rate via Hotel.", "Date": "February 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“Expensive, fantastic position and view, good service, but rooms were dark and dingy”", "Author": "Su51_11", "ReviewID": "UR95762090", "Content": "Disappointing. Although we had good service things were still forgotten like no bathrobes and slippers which was poor for a 5* hotel. We had to ask for them. Sometimes we had plenty of towels sometimes not. The freebie late afternoon/ evening snack at the sister hotel was a nice idea as there is no bar. We got a little gift everday which was nice but felt we had paid for it as it was very expensive. The postion of the hotel was good for a lot of sights. Unfortunately despite suggestions from the concierge and the travel books we never had a really good meal however hard we tried. Absolutely loved Rome itself, the sights are just mind blowing and we want to come back to see what we missed. Use the buses and get passs for 2 days to jump on and off at different points of interest as its hard on the feet walking everywhere.", "Date": "February 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Truly amazing!”", "Author": "madamegrunt", "ReviewID": "UR95388071", "Content": "We read so many nice things about the inn and that we finally decided to book a room there. It's absolutely an amazing place to stay! We reserved a classic room without breakfast. The front desk staff offered us to add breakfast for just an additional 15 e per person per day and we actually did as the buffet was great. It's been a very nice stay!", "Date": "February 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A beautiful place to stay”", "Author": "magdasprings99", "ReviewID": "UR95286271", "Content": "Our stay could not be nicer. The room was a little gem. We've been upgraded to a deluxe room in the annex. The afternoon buffet has been a surprised and we've enjoyed it each day. A special \"thank you\" goes to Karina, she's the kindest receptionist I ever met!", "Date": "February 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A unique experience!”", "Author": "Arongoldman", "ReviewID": "UR94296932", "Content": "What a magnificent weekend in rome, nice place friendly staff spectacular location for shooping and sightseing. The bed was very confortable, the furnishing divine and the staff care was stellar. If you can affort it book it don't loose time going other places.", "Date": "January 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“We had a great time”", "Author": "danlal9628", "ReviewID": "UR94212913", "Content": "Just few words to say that we really enjoyed our stay at the inn: perfect location, friendly and professional staff and gorgeus room! We'll choose it again for our future trip to Rome.", "Date": "January 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Superb!”", "Author": "twaindean5", "ReviewID": "UR93298361", "Content": "I decided to book a room at the inn because I had previously read lots of positive reviews about it on many blogs and I now wish to share my experience too with other people. I had reserved a superior double room and the front desk staff has been so kind to upgrade me in a room in the annex and I liked it so much! The second thing I liked best was the breakfast and the kindness of the staff.", "Date": "January 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“The kindness of the staff made the difference”", "Author": "jordankirk59", "ReviewID": "UR92786357", "Content": "My stay at the inn has been memorable. The staff, everyone, has been so nice and friendly! Always smiling and helpful. Franco helped me in booking two tickets for an important football match, Karina suggested lots of good italian restaurant and Pasquale was so nice to bring every morning my favourite newspaper! I felt like I was their preferite guest of the year! The room was cozy and location is terrific, just few steps from the Spanish step.", "Date": "January 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Impecable service”", "Author": "grettjoemina28", "ReviewID": "UR91640858", "Content": "I found this place very comfortable. Location is perfect and I could walk everywhere, saving lots of money that I should have spent otherwise for taxi rides! The front desk staff makes the difference: all of them have been so kind but Karina is the best. She helped us a lot to have our bags back from the airport. The room we have been assigned to was small but very clean and with nice decor. Not noisy at all, considering that you are in the very city centre.", "Date": "January 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Even more than what we were expecting”", "Author": "barbrated81", "ReviewID": "UR91495268", "Content": "If you are looking for a big hotel with huge lobbies, then you need to go somewhere else. But if you prefer not be just a number, the inn is the right place for you. For the first time, each person at the inn did remember my name and it's nice to be recognized by the front desk staff. They have been extremely friendly and helpful. Rooms are big, very well furnished and - most important- clean. One word to describe my stay at the inn? Perfect!", "Date": "January 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Unforgettable New year's eve at the inn!”", "Author": "gracecapetown22", "ReviewID": "UR91368581", "Content": "We decided to celebrate New Year's eve in Rome and while serching on the internet, we found a great last minute offer at the inn spanish steps. It was their last room available! Our room was exactly what we wanted! Spacious, clean and so cozy - it also had canopy bed, so romantic! Franco,the concierge, reserved a table for us in a restaurant nearby but before having dinner we enjoyed the buffet on their rooftop terrace. Shukri, the barman, prepared delicious snacks for the all of us. I think we will go back for our winter holidays on february!", "Date": "January 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Breathtaking view of the spanish steps!”", "Author": "hellenG523", "ReviewID": "UR91177480", "Content": "We booked the junior suite last week end and view from there is gorgeous! You have the spanish steps right in front of you and it is amazing! To be at the spansih steps the rate is reasonable and by prepaying in advance I also got a huge discount. The service was impecable and staff is truly friendly. Overall, a good experience.", "Date": "December 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A wonderful experience”", "Author": "fridttgrut", "ReviewID": "UR91065582", "Content": "Our experience at the Inn has been really positive. We've been literally pumpered by the staff during our stay: Franco upgraded us to an exectutive room, which was so nice! It also has a small balcony on condotti street! Shukri is the barman and each day we spent at list one hour up to the roof top terrace to taste his snacks and cocktails... We felt the friendly atmosphere and it was like being at home... Very good!", "Date": "December 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“What a wonderful surprise!”", "Author": "audreywilliamson", "ReviewID": "UR91036532", "Content": "Decided to take my husband on a surprise trip to Rome and I booked the hotel on line without any great expectations. It reavealed to be a little gem due to its location and overall charm. We truly enjoyed our stay without kids and to be able to shop and sightseeing full time. The staff was extremely helpful which made things so much easier . We can sure reccomend it to other couples that want to get away for a relaxing break.", "Date": "December 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“We really enjoyed our stay”", "Author": "joerads33", "ReviewID": "UR90957766", "Content": "We spent our christmas holidays in Rome and booked a room at the inn. the hotel is really nice and the service is just perfect, as any other small luxury hotels. Reservations staff has been so attentive to our needs and sent several emails to confirm each detail of our booking. Front desk and concierge guys are friendly and professional. The is is one of the best small luxury hotels I have ever been to.", "Date": "December 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Real Luxury! Great location, service and staff.”", "Author": "gudrun77", "ReviewID": "UR90681478", "Content": "To be Rome and staying in its most famous street its something absolutely special. This small luxury hotel combines location, service and friendly staff in a bond that its impossible to find in other hotels. We are so happy for having stayed here and we are going to return .", "Date": "December 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“BEWARE”", "Author": "jsteincatcher", "ReviewID": "UR87309520", "Content": "As if it weren't bad enough that the entire top floor sits under the breakfast patio, so one is awakened every morning at 6am by the screeching of the chairs on the tile and the banging in the kitchen, the hotel was also overbooked!! They had 'unanticipated' maintenance problems which allowed awful sewage stench to permeate the hotel. And because they had to close a few rooms, offered to have me spend the last night of my trip at another hotel. They offered to reimburse me for one night of my hotel fees for the inconvenience. And now they won't pay me. If this is the kind of service and environment that is provided by one of the \"Small Luxury Hotels of the World\", i'll obviously be staying elsewhere next time!", "Date": "November 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A perfect roman holiday”", "Author": "aaafritz", "ReviewID": "UR86023670", "Content": "I was in rome for a long weekend and after reading many stories I booked the inn at the spanish steps and I was very happy about it.we did bay the airport pachage and our driver was fantastic and we arrived with no problem to what we now consider our new roman home ,our stay was so nice that we decided to go back as soon as possible.all the best shops just out the door,a lot of very good restaurant few steps away a fantastic room and a top terrace bar with a beautifull view . We can sure reccomend it .", "Date": "November 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Location, Location, Location!”", "Author": "gochal", "ReviewID": "UR85342945", "Content": "Just returned from Rome, here's the details I was hoping to find when I was researching this hotel on TripAdvisor, so here goes Doesn't look like a hotel from the outside at all, so just want to set expectations up front. But with Prada and Cartier right next door, and Bulgari, Gucci and Louis Vuitton across the street, there's no doubt that this hotel is all about location location location. The lobby is tiny and nothing to write home about, but the porter Pasquale is very welcoming and inviting. More importantly, we arrived at the hotel at 8am after our redeye flight from NY, and even though our room wouldn't be ready until about 1pm, they checked us in and held our bags for us, so that we could wander around without having to worry about them. At that time in the morning, we had a choice between a room at the Annex and a room in the main building. They said the rooms at the Annex were larger, but based on the reviews I had read, I preferred to be in the main building because that's where breakfast and snacks are served. We ended up getting room 401, which faces onto a courtyard vs. the street, so there was no street noise like I had read about, but I have to admit it would have been fun to have a birdseye view from my window of the street, which is a bit of a people watching mecca, though probably overrun with tourists similar to how Times Square is crowded on a Saturday night in the summer. The room was relatively quiet, but every once and a while we'd hear knocking or water dripping very loudly in the middle of the night when it rained outside, which actually woke us up, believe it or not. I was pleasantly surprised by the room, it had one 110volt US outlet, which meant I didn't have to worry about buying a converter or potentially frying any electronics. A hair dryer was provided too, and the shower had great water pressure. And though the room was small, they still managed to squeeze in a decent sized flat screen TV! The 5th floor terrace is very charming, and the breakfast and afternoon/evening snack buffets are fantastic! They even served prosciutto, salumi and several types of cheeses and grapes. You can order a glass of wine to accompany the afternoon snacks. There's also a great view of Via Condotti and the Spanish Steps from the terrace. You have to pay for WiFi, but it's reasonably priced, and I was glad to not be tied down to an ethernet cable. The elevator is the tiniest thing I've ever been on, so be warned if you are claustrophobic. The staff all speak English, and it also seems a majority (or all) of the guests are from Stateside. The air conditioning was very cold, which is such a welcome change from my last experience in Italy, where the AC didn't work and so we had to open the windows and deal with buzzing mosquitos all night long. Overall, the rooms were very clean, and they even changed our towels twice a day. No, this is not a 5-star luxury full service hotel with all the amenities you'd expect for royalty, but it has charm, a good value (considering that there are many comparably priced and officially rated hotels that received much worse TripAdvisor ratings), and an amazing location. The only drawback is that the bulk of restaurants are a bit of a walk from here, as this is more of a shopping mecca vs a dining mecca. And you will have to take several steps once you step off the elevator, for those of you that can't do steps. Overall, a great experience, and I would DEFINITELY come back here next time I am in Rome!", "Date": "October 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kuala Lumpur", "Title": "“Love the location and Room. Average everything else.”", "Author": "purple_dots", "ReviewID": "UR85034101", "Content": "We booked the executive double room which was on the highest floor. I loved the jacuzzi in the room, the HD TV (and good selection of English language channels to choose from) and the balcony overlooking Via Condotti and The Spanish Steps. The sound proofing in the room was good so it did cut out sound from the noisy street below. Big difference when you leave the windows open. What I liked about the hotel. 1. Location (especially if you love shopping and its close proximity to some lovely sites in the area - Trevi Fountain and Pantheon are just 15 to 20 minutes away). 2. Comfortable Room with nice attention to detail. 3. Complimentary tea time buffet (not a great spread but its a nice offering) 4. Cosy lounge area What I did not like about the hotel. 1. Mediocre service 2. Very tiny reception area. 3. Very tiny elevator (there is only one) but is expected from a building that is so old. 4. It classifies itself as luxury (the rooms maybe) but not the common areas. I would say it is `cosy' but that is about it. 5. Mediocre buffet breakfast 6. If you are driving - there is no garage for you to park your car. 7. No free internet access. Still, it was a comfortable stay. The room is great. The location is really prefect.", "Date": "October 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Austin, Minnesota", "Title": "“Absolutely Perfect”", "Author": "BDF43", "ReviewID": "UR82217238", "Content": "We've traveled a lot in Europe, but never to Rome. We could not have picked a better hotel. The staff was outstanding and professional. The roof top terrace was a perfect way to top off the day. It may be on the higher side of pricing but when you factor in all of the positives this place has to offer, it is worth it. We traveled with another couple and we all agree. Great place! Minnesota, USA", "Date": "October 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Lovely hotel in a great location”", "Author": "MegandTimC", "ReviewID": "UR82007159", "Content": "We had a wonderful experience at this hotel in fact we extended our stay as the location is perfect, you can walk to all the attractions. We had a suite with a tiny balcony that looked straight up to the Spanish steps. The breakfasts on the roof terrace were good and it is just a great way to start the day. The evening snacks were a nice complimentary touch as were the lovely gifts left each day (buvlgari perfume and chocolates etc). The staff could not have been more sweet and helpful. The only minor negative was the noise that the laundry man made very early every morning as he crashed the trolleys on and off this truck, I watched him one morning and you could tell he made no effort to try to be quiet, actually the opposite appeared to be the case!", "Date": "October 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Great location”", "Author": "TravellingSusan", "ReviewID": "UR81910768", "Content": "The location was great as it was right on Via di Condotti and very close to the Spanish Steps. The room was a good size but the beds were very hard. Most hotel have foam to deal with those who prefer a softer mattress but not this hotel and as a result we had four nights of poor sleep. The breakfast was good, although the seating on the rooftop area was in chairs not ideal for eating - they were more like living room chairs. The staff were very helpful at the front desk. It was the only hotel during our five stops in Italy where we had to pay for Internet.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "VICTORIA", "Title": "“Not a small luxury hotel”", "Author": "JENKINSWILSON", "ReviewID": "UR79192464", "Content": "The hotel was expensive,rude staff in the reception area.Very poor access to lounge and breakfast, on the top floor.Lift to only third floor then five flights of steep stairs to this area. No powder room at all, so a long trip back to your room if in this area.The breakfast was of very poor quality and only one pop up toaster for everyone.No area to even sit if waiting for friends or taxi, had to stand in the exit to the street. If wanting to speak to reception staff re bookings etc, had to also stand in hallway as no other area available. The room itself was shabby, chunks missing off bathroom wall and pieces of timber fell off the wall surrounding the bed.In all a very disappionting first experience of Rome. Inn at The Spanish Steps is not by any stretch of the imagination a luxury hotel.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Welcoming Hotel at a Perfect Location”", "Author": "YetiAspen", "ReviewID": "UR76164470", "Content": "We spent four nights at the Inn at the Spanish steps with our four children, and could not have been happier with our choice. The hotel itself is very discreetly tucked away on Via Condotti right off the Spanish Steps. My husband and I stayed in a junior suite at the View at the Spanish steps (adjacent). Our room was a perfect corner room, very large and well appointed, that had a wrap around deck overlooking the steps. One night as we returned from dinner, an opera was being performed at the Spanish Steps, and we watched from our balcony! The breakfast served daily on the top floor terrace was lovely (included with the room) and abundant. What really sets this hotel apart, however, is the staff and the service. They treated us truly as guests. Franco, who I believe may be the manager, was very helpful with restaurant recommendations as well as anything that we needed. If your hotel preference is smaller, more boutique type of hotels, (as is our preference), do not hesitate to stay here. We will recommend to all of our friends.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "bratislava", "Title": "“A lovely stay ,we will be back”", "Author": "geltf", "ReviewID": "UR67567121", "Content": "We have booked the inn at the spanish steps based on tripadvisor reviews and we are happy about it.The location is just beatifull just few meters from the spanish steps.W e did a lot of shopping while in Rome and to be at the inn is perfect.One day we went at the spanish steps and we got the roman carozella to go around and it was very nice . All the restaurant the reception suggeted us were all very good and not to expensive ofcourse they were full of tourist and italians. Our room was on the four floor with a small balcony on the street with a nice view of the square ,the roof terrace with the complimentary snack buffett in the afternoon was lovely. We will be back .... Geltrude ..", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Auckland Central, New Zealand", "Title": "“Truly a great hotel, for rome”", "Author": "luxurycomfort", "ReviewID": "UR67352754", "Content": "We were recommended this hotel by several friends, and as you would expect we were unsure what the hotel would truly be like as people have different standards. The reception is accessed from the street down a hallway, and you walk into a small office sized room which gives a unsure impression of the hotel, if there is another person or group checking in around the same time as you, you may possibly wait up to 10 mins before you are served to be checked in, but its not too bad we didn't mind it too much, the reception guy is also the concierge. We went up to our room and it was really nice, i have stayed in some pretty bad hotels and some extremly nice ones too and this hotel room was at the higher end of the scale, everything was nicely finished and new, it had a big tv on the wall, a couch and the beds were very comfortable, one dissapointment was that when booking the room be assumed (inn spanish steps room with view) meant view of the spanish steps, but it does not neccessarily, our room had a view of one of the side roads which is full of upmarket shops such as gucci, dior etc, but if you stuck your head out the window you could see the spanish steps, we thought the room and its position was excelent, but just keep in mind it might be nice if your room faced the steps. The bathroom was nice and clean, not very big but its big enough. The room was serviced twice daily and fresh towels were supplied. The staff were all exceptional, if you wanted something done they would jump to attention right away. Upstairs is a very nice drink and snack room, where you have afternoon tea, breakfast etc and it really gives you a great idea of living in rome because its on the roof. I would recommend staying here because this hotel is bang smack in the middle of all the great action of rome...restaurants..bars..pub crawls..shopping..etc", "Date": "June 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "France", "Title": "“My favourite hotel in Rome”", "Author": "frechertour", "ReviewID": "UR66700572", "Content": "We travel often to Rome as my husband do business there. We found this special offer at their website including free pick up from the airport which was very appreciated after long travel. We thoroughly enjoyed our stay here as the room was comfortable and clean, breakfast was very good served on the roof terrace which was a nice surprise. The best thing of all was the location, full of shops just outside the hotel and not to mention all the good restaurants that you can find in the area. Ask the front desk staff as they gave us very good suggestions of places in walking distance from the hotel. Overall, we enjoyed staying at the Inn and were happy with our choice. Will recommend it and stay again on our next trip!", "Date": "June 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Perfect choice for families!”", "Author": "markdwyer5", "ReviewID": "UR64843160", "Content": "We are a famliy of 5: me, my wife and our 3 kids. After some \"shopping\" on the internet, we decided to book a Family Room at the Inn: perfect choice! We had two connecting rooms and that allowed me and my wife to have our own privacy and, at the same time, look after our kids, just next door. Rooms were gorgeus with a wonderful view on Via Condotti!! They also put some gifts in our children's room and I found this very kind of them! Everybody has been helpful and friendly: Pascuale the bellman, Beatrix, Franco and Flavia at the front desk. It was nice to start and finish our roman days with their smiles! We'll be back next year!", "Date": "May 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“The Inn at the Spanish Steps-Highly Recommend”", "Author": "CaliLaugh", "ReviewID": "UR63805276", "Content": "I researched a long time before I decided the Inn at the Spanish Steps would be a perfect stay for our 20th wedding anniversary. My husband and I were happy about the choice. The location is perfect, we walked to all the major sites and the official taxi service is right around the corner. The rooms are spotless, the staff is friendly and helpful. The breakfast on the rooftop terrace is perfect and you can have ourdourves during happy hour, order some liquor or just take your own bottle of wine up. The rooms are small but they are all small in the city, just like New York, so if you don't want a small room, you will have to select a place that isn't centrally located like this hotel. When it was time to checkout, no need to call a Taxi, we just walked around the corner at 5am and took the Taxi. Everything is so convenient, they have an elevator if you don't want to walk the steps, just note the elevator doesn't take you to the 4th floor. You won't be disappointed.", "Date": "May 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "5.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Cameron Park, Ca.", "Title": "“Problem Resolved Immediately. They are wonderful!”", "Author": "robinCameronPark_Ca_", "ReviewID": "UR62153298", "Content": "I was given full credit for our trip. I appologize for reacting so quickly. The hotel management has been extremely helpful in booking our next trip and we look foreward to staying with them. Robin", "Date": "April 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "4", "Rooms": "1", "Location": "5"}, "AuthorLocation": "NYC, NY", "Title": "“Small, Old, Dirty and Horrible service”", "Author": "TravelJLF", "ReviewID": "UR61356229", "Content": "This was our last stop on our honeyoom (our 7th hotel) We travel often and this hotel was just terrible but with a GREAT location if I may add. Our room was so small that only a full sized bed fit in the room. My luggage had to go on top of the mini fridge if that paints for you a clear enough picture. There was water damage on the ceiling, the walls were cracked, there was a hair in the toilet that was not ours upon arrival, our room looked out to the garbage area of the hotel and was next to the elevator shaft that was an exterior shaft which was a few feet from our window. It gets worse. I unpacked some expensive items that I purchased and didn’t feel like re-packing them again before we went out to dinner. I knew the turndown service would come in so we put the do not disturb on the door. When we got back from dinner sure enough.. they had been in our room and didn’t bother to look at the sign we put on the door. I was annoyed but checked my items and all were there. The next day again we put the do not disturb sign on again and AGAIN the room was made up. I was now really annoyed. I ran down and spoke to a manager. He said “Ill be sure to call the maids and let them know this is not acceptable”. Was he serious??? That didn’t make me feel better at all!!!! We stay at some top notch hotels and that was not the response I was looking for. Pros.. the best location, beautiful roof top terrace (which is good because we couldn’t sit in our small room so we did go upstairs). I would never stay here again! Ohh PS. When we checked out the manager did give us some small bottles of perfume as an im sorry. To be honest.. I would have liked a discount on the room instead.", "Date": "April 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Excellent choice! We would definitely stay here again!”", "Author": "jandm6", "ReviewID": "UR60862534", "Content": "The Inn at the Spanish Steps was a wonderful choice. We booked a \"Room with a View,\" and it was absolutely charming. The daily breakfast served right outside our room--either inside or on the terrace--was lovely. Beatrice helped book us a private tour of ancient Rome with Valentina, and it was the highlight of our Italian vacation. Every member of the staff, from Michael the bellman to Beatrice and Carlo, was outstanding, always giving us excellent advice and recommendations. If you can afford it, we recommend it highly.", "Date": "April 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Great location - buggy room”", "Author": "mriedema", "ReviewID": "UR58637295", "Content": "My husband and I stayed here in May of 2009. Having previously stayed at the St. Regis Grand Hotel this hotel was a BIG disappointment. The room was small, and unbeknownst to me (my husband told me after we got home) there were bugs/roaches in our bathroom. The persons running the Inn could not have been nicer, and the rooftop bar was the picture-perfect setting for breakfast overlooking the Roman rooftops.", "Date": "March 15, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "london", "Title": "“Staying at The Inn at the Spanish Steps, Via Condotti, Roma.....be careful!”", "Author": "MelanieEv", "ReviewID": "UR58385998", "Content": "We stayed at The Inn on the Spanish Steps the 1st week of March 2010. We were given a small room in the annex section of the hotel which is a 3 minute walk away from the hotel....I know, unbelievable! The hotel should make guests very aware of this as it didnt feel like we were staying in a hotel at all and didn't use any of the hotel facilities which includes a bar and roof top dining area, such a shame! The room itself was clean but very hot, which would of be awful in summer months! Its incredibly central and we went to a fantastic local restaurant called Nino's around the corner from the inn at The Spanish Steps which feels as if nothing has changed much since the 1940's, beautiful dining room, wood paneling and the food was very authentic....go for the house white, fantastic and get the hotel you stay at to book as its very busy! We were relieved when the all Italian menu was swapped for an English one! Rome is incredible and we didn't let a shoddy hotel spoil it....Melanie Evans", "Date": "March 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Our family loved the Inn at the Spanish Steps!”", "Author": "edward_engalls", "ReviewID": "UR58293337", "Content": "We are a family of 5 and reserved a family room at the inn. That room category was available on their web site and it was a good choice! The family room is composed of two connecting rooms and this allowed me and my wife to have our own privacy and look after our kids at the same time. It's the ideal option if you travel with the whole family! Both rooms were spacious and clean. Reservation department is very efficient: they sent us several e-mails to confirm the reservation and gave us useful suggestions for restaurant reservations and tours. We booked through them a private tour and our kids fell in love with the guide! She was fantastic! Each staff member was always smiling and attentive to our needs (and believe me.. with 3 kids we had a long list of requests...). In few words... wonderful service, beautiful property and strategic location!!", "Date": "March 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Quebec", "Title": "““Hidden gem in Rome””", "Author": "paulj1958", "ReviewID": "UR56742281", "Content": "We were planning to visit Rome for years now, and finally this year we did it! We booked online in the very last minute, and had to say we didn’t expect something so nice! This little “Inn” is something amazing, the staff at the reception is so polite and always available! They gave us advices on where to eat, how to jump long queues at the Vatican, booked our airport transfers too…, etc. We had our little puppy with us, he was also very welcome, they also organised a dog-sitter while we were to visit the Vatican. But the best was our executive room, the bed so comfortable! Sure be back one day, thanks!", "Date": "February 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Ultra centrally located!”", "Author": "gracewintry", "ReviewID": "UR56550563", "Content": "I was a guest at The Inn at the Spanish steps over Christmas and New Years and I had a wonderful stay, apart from the fact the hotel is ultra centrally located, the room was beautiful and the staff really exceptional. We had a perfect Christmas vacation in Rome and the restaurant that the Hotel Concierge chose for us for New Years Eve dinner ( Gaetano Costa restaurant ) was the best restaurant we ever eaten at in all our lives.", "Date": "February 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Thought a perfect say with kids is impossible?”", "Author": "Bigfamilyinrome", "ReviewID": "UR56335715", "Content": "So did we. This was the first time me and my husband decided to take our three children of the ages two, five and seven on a trip outside the states. Rome is a busy and hectic place to have chosen but has also always been a dream of mine to visit. The flight was a little hard and we were already feeling a little uneasy about our decision until we got to the Inn and saw that the hotel would have made things a lot better. It is a little hidden nook on one of the most important and beautiful street in Rome, like a little amazing \"nest\" for us to retreat in. We had two spacious, comfortable, and most of all very clean connecting rooms.This allowed our kids to be kids whilst at the same time we got to relax and enjoy our own space. The breakfast and afternoon meals were very good and offered a wide range of typical italian, or american food which was also great for the picky eaters.. Lastly the staff was very friendly and extremely helpfull when it came to organizing travelling and visitng the city with kids. They would order us cars, or tell us the most conveniant roots to take to entertainment suitable for both us adults and our kids. Overall this hotel is a real gem and helped make our trip exactly what we wanted.", "Date": "February 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Fantastic! Loved the studio room...”", "Author": "marthybedd", "ReviewID": "UR56007542", "Content": "Despite what I read about the annex, I have decided to book the Studio Room at the Inn at the Spanish Steps 'cause it was a great deal indeed. I made the reservation through their official web site and reservation department was so efficient that after 40 minutes only I had my confirmation with a detailed description of my room! I had already saw some pictures on the web though, and upon check in I had the same exact room. The studio is located in one of their annex buildings. I liked that room cause I was totally independent! I had my \"private home\" in Rome and could anyway take advantage of hotel services. The room was clean and well decorated, internet access and flat TV. Cherry on top: the private kitchenette! Will come back for sure!", "Date": "February 15, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Naples", "Title": "“Awful experience”", "Author": "LaBelleNaples", "ReviewID": "UR55710363", "Content": "The reviewer who said location is everything was correct. We checked in for a Sat and Sun and received the second to last room in the main building. The site we booked through promised an upgrade but the staff offered us one at 100 euro more/per night. Our room was small, noisy and warm; bathroom was cramped - could not even keep toiletries in it. It was at the back of the building facing the courtyard. Due to renovation scaffolding covered the windows so we could not sleep safely with the window open. Our room was under the kitchen so we heard EVERY noise and smell as breakfast was prepared. It was also next to the elevator which was very noisy in the room. We spent two sleepless nights here. Our booking site did contact the hotel after our return. Management response was \"So sorry\" - nothing more. This room should not be sold to anyone - make it a storage closet. The positives were the location and breakfast. Skip the afternoon buffet, especially if you need to pay for it.", "Date": "February 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Szeged", "Title": "“excellent”", "Author": "atti_45", "ReviewID": "UR55643759", "Content": "I started organising our trip to Rome as a surprise present for my wife, for our 20th wedding anniversary. I had to deal with all the little details on my own in secret, but the staff of this hotel was so nice to help me organising everything from the pick-up to the transfer, also sightseeing tours and restaurants booked in advanced... I really wanted the best for us to relax but at the same time, see as much as possible of this marvellous city. Our room was spacious and really beautiful, with modern furniture, and we had our own terrace too – it was so nice sitting there in the evening with our cocktails and just watching the people hanging around the Spanish steps! I want to thank the whole staff of the Inn at the Spanish Steps for being so nice with us and making everything so unforgettable! Highly recommend this hotel to everyone!! Judit & Attila, Szeged Feleségemnek szánt meglepetésként kezdtem el tervezni a római utunkat, 20. házassági évfordulónk alkalmából, igy minden apró részletröl nekem kellett gondoskodnom titokban. Szerencsére a hoteltöl rengeteg segitséget kaptam, nemcsak a pickup és transzfer megszervezésében, hanem különbözö városnézö túrák és éttermek foglalása terén is... Mindenképpen a pihenés volt elötérben amellett, hogy minél többet lássunk ebböl a csodaszép városból. A szobánk tágas volt és valóban lenyügözö, modern bútorokkal, söt, saját terasszal – esténként koktéljainkkal a kézben innen figyeltük a Spanyol lépcsönél lézengö embereket! Ezúton is szeretném megköszönni a hotel teljes személyzetének hogy ilyen kedvesek és segitökészek voltak velünk, és hogy ezáltal felejthetetlenné tették római tartòzkodásunkat! Tiszta szivböl ajánljuk mindenkinek ezt a hotelt. Judit & Attila, Szegedröl", "Date": "February 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Terry, Mississippi", "Title": "“Great location and wonderful service”", "Author": "Cocoreb", "ReviewID": "UR55500877", "Content": "We booked this hotel ourselves and were always dealing with the hotel's front desk. We were given an upgrade to a room facing the street which was fun because we could watch the people on the Spanish Steps. The roof top deck was a beautiful place to have breakfast and an afternoon glass of wine with appetizers. The staff were attentive to all our needs and questions. I would definitiely recommend this hotel to women traveling alone.", "Date": "February 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "NYC", "Title": "“tucked away in the perfect nook”", "Author": "Fabiolaabu", "ReviewID": "UR54307536", "Content": "We arrived to this hotel unsure of what we would find. It was booked for us last minute through our travel agent. Upon entering through a narrow hallway we felt wary of what kind of hotel it may have been. However upon being shown up into our room a few flights up we found a spacious room with a view of Bvlgari and Gucci on via condoli. The staff was very helpful and were happy to point us towards the sights we were interested in. Our bedroom and bathroom we very nice and the bed was very comfortable.", "Date": "January 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Savannah, Georgia", "Title": "“A Delightful Experience”", "Author": "FSHphd", "ReviewID": "UR53692719", "Content": "We stayed at the Inn at the Spanish Steps for three nights. The staff is markedly professional, the food delicious, and location spectacular. Our room was rather small but very well appointed, and the atmosphere is elegant. I highly recommend this hotel.", "Date": "January 17, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“The heart of Rome with a View”", "Author": "DaleneM4", "ReviewID": "UR52805933", "Content": "We have stayed in the View at the Spanish steps, an annex to the Inn a view times already. It.s only a few rooms with a stunning view over the Spanish steps. The rooms are comfartable, the food excellent and the view one of the best in Rome. The location is also excellent. The sounds from Via Condotti is rising to the top in a soft whisper, which add to the Roman experience of Spirits gone by!", "Date": "January 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Florida", "Title": "“Now Wait a Minute!”", "Author": "wrantar", "ReviewID": "UR51020361", "Content": "No disagreement with other guest' s positive comments on location and staff. However, no one seems to have mentioned several negatives that may be deal breakers for some travelers. Comments based on my four night stay booked as classic twin beds @ €200 that was upgraded to twin bed superior. The room was a cramped 10' x 15'. The bath had a dangerous – toilet facing bidet setup that narrowed the tub/shower access to approximately 2 feet. This configuration combined with no grab bars and a wet floor surface made for a for hazardous access. English language television is limited to \"European\" CNN, which outside the US is heavy on recycled Ammanpour and Blitzer et al, and light on US or international news. Be advised of the elevator and stair situation. A slow speed single 3 person elevator services passengers and baggage creating significant delays at checkout and check-in times. Regarding the stairway's, there are 9 stair steps from street to entry and first elevator access, then, 6 stairs down steps to reception and then the climb back to the elevator landing. The elevator stops only between floors (where there are no rooms) so there are another 9 stair steps to your room floor. Lastly, there are 19 stair steps to breakfast room (plus another 9 stair steps if you are not staying on the top floor and have to climb to it in order to access the 19 steps to breakfast room. No active fire sprinkler system was visible and staff could not point out an active fire suppression system. A significant life safety issue. Noise coming through old-style single pane windows may keep some light sleepers awake. Request a rear courtyard room with the negative being absolutely no view.", "Date": "December 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Uk", "Title": "“Our favourite hotel in Rome!”", "Author": "matthdennn", "ReviewID": "UR50830090", "Content": "We decided to spend some days in Rome to buy all our Christmas's presents and we've booked a room at the Inn at the Spanish Steps. We bought their Last Second offer on the internet; their booking engine is simple and fast and they have a wide room selection and several room rates. With the last second we've got a special discount and it was good 'cause we spent a reasonable amount for a very nice room facing via Condotti, the most famous shopping street in Rome. We can't believe we've just at the Spanish Steps! Location is perfect and the staff is superb! Everybody is professional and smiling, both at the front desk and at the breakfast room. We had a positive experience and we highly recommend it to couples!", "Date": "December 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Boca Raton, Florida", "Title": "“Great Stay”", "Author": "mkg623", "ReviewID": "UR49425478", "Content": "My wife and I thorougly enjoyed our stay at the Inn. The room far surpassed our expectations. It was big, as was the bathroom. The service was outstanding. Everyone was very nice and helpful. The location was a plus and minus. The Spanish Stairs and via Condatti is a great place to be. It's in the center of everything and you can walk everywhere. However, the area is very busy and can be very noisy. The only downside to the hotel is that I was kept awake one night by the street noise. All in all, for the value, service and location, I would recommend this hotel.", "Date": "November 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Bergen County, New Jersey", "Title": "“Near-luxury with side view of Spanish Steps”", "Author": "obsoperator", "ReviewID": "UR48758393", "Content": "We chose this hotel because it's widely recommended-even making it into Frommer's Rome. I noticed on their web site that they also have an annex building, so it would be helpful if someone could review that as well. We were in the main building, Room 305, which looks out on Via dei Condotti. They said it was an upgrade from the Deluxe Double Room I had booked on the web for 319 Euros (including breakfasts for 2) plus 10% tax per night. It was clear to me that the 30-day advance booking price (with deposit) was going to go up after the 30-day deadline, so I went ahead and booked. They told us that they were full-up by the time we got there. Internet was 15 Euros for two days, very high speed. (This was essential for grabbing the last Borghese gallery tickets available!) This is a small hotel, with a hardworking, dedicated staff. There's an elevator, but it's impossible to avoid all the stairs. Although breakfast in your room is available, there's no way to reach the beautiful rooftop bar and breakfast terrace without climbing stairs. Those with bad knees, etc., should consider staying elsewhere. We had no complaint ourselves. The room was attractive and clean, if not more spacious than the average midrange european hotel. That is, we had a desk, but you had to push the chair in to get by when going around the huge bed-bigger than kingsize. There was one window with double glass. You could hear the garbage trucks, the noisiest things on the street, although you could not hear the crowds of tourists at all. We slept fine.The bathroom (with Jacuzzi that we didn't use) was more spacious, modern, and attractive. Like much of Italy, there's no shower curtain, but a glass partition kept 99% of the shower water in the tub. I strongly recommend that you stay here three nights, because you probably will then qualify for a free airport car pickup. We paid 55 Euros, and we enjoyed the luxury after a two-segment flight from the US. But because we were meeting a cruise ship, there was no way to stay more than 2 nights. The car to the Civitavecchia cruise port was 150 Euros (!), but that's the going rate for a trip three times as far as the airport, and no hope of a fare back for the driver. The managers also made two restaurant reservations for us in advance. We were pleased with all the staff we met. When the weather is wet, the breakfast room can be crowded, since many are reluctant to sit under the (huge) umbrellas on the terrace. An evening glass of wine (very reasonably priced) with complimentary heavy hors d'oeuvres is magnificent in the sunset. You have to look over the edge of the roof, and turn your head to see the Spanish Steps, however. (I'm not whining, just a matter of truth in advertising.) The location is excellent for attractions on this side of Rome. In particular, the Borghese and Barberini Galleries are walkable, as is The Trevi Fountain We did a sightseeing walk home from the Castel Sant'Angelo, through Piazza Navona, to the Pantheon, and the Trevi Fountain. But not everyone would want to walk that far. The Coliseum and ancient Rome are actually a shorter distance from the hotel than that walk added up to. Walking was cool in October, but you might want to use the Spagna subway stop on a sweltering summer day. I can't recommend the hotel at the full rack rate, but if you can get a discount, it's a worthwhile splurge. The rooms are not quite as charming as the hallways and public rooms, but our room was certainly quiet and comfortable. Our room was in excellent shape, and I wouldn't even describe it as \"dated\". But the striped and printed fabrics looked like an obsolete style of luxury-decorating. In that sense it wasn't \"better\" than a glossy modern business hotel interior.", "Date": "November 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Good but expensive”", "Author": "Tripper099", "ReviewID": "UR47869579", "Content": "We liked the Hotel. Traditional European townhouse. No facilities other than the roof terrace/bar area and helpful staff. Our room was at the front overlooking Condotti - a tastefully decorated medium sized room with good quality linens. The doble shutters, inside and out, save you from a very noisy crowd in the street at the weekend. the bathroom was of poorer quality, small and dated. Restaurant recommendations are reliable but not inspired - mainly touristy places. You can walk just about everywhere and Rome really is on the doorstep. I would stay there again but, even taking into account sterling's weakness against the euro, it was expensive for what you get. Do book Borghese and the Colosseum in advance but not the Vatican based on our experience. The only place where there were no queues was at the Museum ticket office which covers the Vatican Museum, courtyards and the Sisteine Chapel. And go there early, it is incredibly busy.", "Date": "October 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Earth", "Title": "“Great Location, Helpful Staff, Spacious Rooms”", "Author": "WalkingTowardBuddha", "ReviewID": "UR47607205", "Content": "Can't beat the location on Via Condotti just a half block from the Spanish Steps. Ton's of great shopping and restaurants within a few blocks of the front door of the hotel. The staff was really helpful with general assistance and dining recommendations. Very good breakfast bufffet on the top floor with a nice rooftop terrace. The rooms were large and clean but some of them seemed a bit worn and could use a facelift. We were initially in room 205 which is supposed to be a deluxe room facing via Condotti but when we expressed our disappointment with it's general level of upkeep after the first night the front desk person admitted that it was a \"sad room\" and moved us into a much brighter snd larger room around the corner. Bottom line with this place is location, location, location and the staff was really quite great.", "Date": "October 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Dhahran, Saudi Arabia", "Title": "“Best Breakfast in The World!”", "Author": "caty3", "ReviewID": "UR45408349", "Content": "I was lucky enough to stay it this very beautiful hotel in Rome. I was so impressed by the friendly service of staff. Big thanks to Francesca and Franco! The Best Breakfast in The World. I've had loads of good breakfasts at beautiful hotels but this breakfast was indeed fit for a queen! I highly recommend you have a night or two here. Right next door is Cafe Greco and you can get take out from there and take it to your room and people watch on the Via Condotti. Two steps away are \"The Steps\". This hotel is amazing, especially if you like your exclusive hotel very discrete. Thanks again to the Beautiful Inn at the Spanish Steps.", "Date": "September 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Book the annex! It's superb!”", "Author": "Tigronerino", "ReviewID": "UR43921961", "Content": "I booked 4 rooms at the Inn at the Spanish Steps for a long week end in Rome and I have decided to stay in their annex building on Condotti 48. I acknowledged on their web site that they have two annex buildings: one faces the Spanish Steps and it's called the View; the other annex is an apartment of only 4 rooms, on Condotti as well, just few blocks away from the main building. I'd loved staying at the view, but I could not afford the price for those rooms (it's gorgeus! I saw some pictures on the web site and I guess it's really unique...), so I've decided to book the other option. The rooms in the annex are furnished in modern style and had plasma TV. We had the whole apartment for us (I was travelling with my three sisters with our husbands) so we also had a private butler in the morning at our complete disposal for breakfast (which was great! Tasty cappucinos and espresso!) Furthermore..the rates I've got were much lower that the rates for the view! The annex has been our home for some days... and at the same time we had all assistance from the front desk for restaurant suggestions, tours... The Inn at the Spanish Steps with its annex is my new favourite place in Rome! I recommend it to all of you!!", "Date": "September 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "France", "Title": "“What a pleasant stay!”", "Author": "nerinotino", "ReviewID": "UR43112555", "Content": "We've just back after a short stay in Rome... and we can't wait to go there again! For sure we'll choose again the Inn at the Spanish Steps! The room we had was amazing, with canopy bed and plasma TV!! It also had a small balcony and we could see the spanish steps on our left hand side... we made the reservation on their web site because there was a last minute offer available, it was a deal! The front desk staff is friendly and it's nice to have people calling you by name! it makes you feel at home and not just a client.. Everything was walking distance and after shopping it's good to enjoy the snack buffet.. the barman (Shucri was his name...) is great! It was not our first time in Rome, but the Inn at the Spanish Steps is for sure the best place we've been.. Highly recommended!", "Date": "September 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York, NY", "Title": "“Amazing!”", "Author": "bab231", "ReviewID": "UR41608090", "Content": "The Inn at the Spanish Steps is a wonderful place to stay. It is a hidden gem that is tucked away behind many upscale shops and it feels like home from the minute that you walk in the door. The staff is extremely helpful and our room, while small, was extremely clean and absolutely perfect for us. The rooftop deck is beautiful and relaxing and the complimentary happy hour snacks are a wonderful perk. This inn should not be missed on your next trip to Rome!", "Date": "September 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Boston, MA", "Title": "“Great Location, Service”", "Author": "Rbos1", "ReviewID": "UR39996609", "Content": "Stayed a few nights at The Inn at Spanish Steps during a recent trip to Rome. If you want to do some high end shopping (or browsing) - you're on the right street. Boutique hotel was funky but historic at the same time. Breakfast was amazing and they had a great happy hour type thing on the roofdeck with appetizers that I thought was a really nice touch.", "Date": "September 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "hong kong", "Title": "“The best thing abt this hotel is location”", "Author": "PirateprincessX", "ReviewID": "UR39675147", "Content": "Inn At the Spanish Steps is right in the middle of Rome's shopping high streets. If you are into shopping or even just window shopping/people watching, this is probably one of the best locations you can ask for. We also can walk to most of the famous tourism sites from the hotel. But that's probably what I like the most about this hotel. The room was a bit small, dark and tired-looking, in my opinion. The staffs are generally quite friendly. Franco (receptionist) is excellent and very helpful. Overall, I will give about 70/100 for this hotel.", "Date": "September 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ireland", "Title": "“Family reunion at the Inn at the Spanish Steps”", "Author": "levittsandra", "ReviewID": "UR35668976", "Content": "I have found the Inn at the Spanish Steps while searching a hotel in Rome and I've chosen it because they offered a very good deal for mini groups...we had a special discount because we've booked 5 rooms on their web site. I booked immediately for me and my family. My partents and my sister live in US while my brother works in Australia so we meet each other only once a year... and this year we've decided to spend a week all together n Rome... I highly recommend the Inn at the Spanish Steps! They reserved for us the annex building located just two blocks away from the main building and we felt like home! the annex has 4 double rooms: a private apartment for us!! The rooms we had are modern with plasma tv, even if we did not used it so much... how could one watch tv while being in Rome... ? We have been pumpered by the staff.. they booked for us restaurants for each day and I can say now that Italian cuisine is really the best! We enjoyed our experience there so much and can't wait to go back to the Inn... maybe next year!!", "Date": "July 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "uk", "Title": "“Sales in Rome...”", "Author": "beckyspenck", "ReviewID": "UR35386058", "Content": "I have spent some days in Rome in occasion of the summer sales (....). it was hot.. but we enjoyed so much our short break in that beautiful city! Thanks to all the staff of the Inn at the Spanish Steps! Shukri the barman... Fabio and Franco at the Front desk: their restaurant suggestions were perfect! The room we have been assigned was a classic room facing the courtyard and it was so quite that I could not believe I was in the very city centre!! Shopping was great cause all the main shops are just there... in a few words: a wonderful experience! I highly recommend it and I'll go back there for winter sales :-) becky", "Date": "July 21, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "usa", "Title": "“Appearances can be deceiving”", "Author": "nicoledu_9", "ReviewID": "UR34912749", "Content": "Before our arrival the hotel booked us car service and provided restaurant recommendations. The service appeared to be superb. When we arrive it was an entirely different story. The first night we went to one of the restaurants recommended - it was so awful that we left in the middle of dinner! How can you have an awful dinner in Rome? They placed us in apartments a few blocks from the hotel, it seemed fine, but then the power went out. And did not get turned back on. We requested a new room or even a flashlight and were provided with neither on the first night. Finally, they moved us to a new room...", "Date": "July 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New Jersey", "Title": "“Pleasantly Surprised!”", "Author": "MStierle", "ReviewID": "UR34817519", "Content": "We stayed at the inn for two nights at the end of our twelve day trip to Italy. We were hot, tired, and ready for home, but the Inn was wonderfully relaxing for a hotel in Rome! I had stayed in Rome several times and never liked the hotels. The Inn was a welcome change from what I was expecting. The rooms were quaint,clean, and cool, but not brand new. We enjoyed the location, so close to the Spanish Steps, the subway, and shopping. We ate both nights in little wine bars in the immediate area and were pleased with the food. The Inn has a cocktail hour from 5-8pm with complimentary appetizers that should not be missed. It is up on the rooftop terrace, with spectacular views and yummy foods (for free!). My husband and I would have been miserable if we were not happy with our hotel at the end of a wonderful, but long trip. The Inn was the perfect Rome hotel in my opinion and I highly recommend it!", "Date": "July 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Usa", "Title": "“Magnifico!”", "Author": "Roxanne4Miller", "ReviewID": "UR33239693", "Content": "I choose an Italian word to say that the Inn at the Spanish Steps is simply unique... if you want to feel not just a tourist, you shall stay there! All the staff has been extremely helpful and they gave me very good restaurant suggestions. Actually my boyfriend took care of the hotel reservation cause it's been his present for my birthday.. and I really never forget it.. We had a room in the annex building... fantastic!! Thank you Inn at the Spanish Steps", "Date": "June 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Austin, TX", "Title": "“Perfect Hotel in Rome”", "Author": "travelinfool101", "ReviewID": "UR32844146", "Content": "My husband and I stayed here for 3 nights in May. The hotel was in the perfect location - we walked everywhere - even to the Vatican and Colloseum - everything was easy to get to and not a far walk at all. The hotel was very clean and modern - perfect for our tastes. The courtyard upstairs was beautiful with lush flowers and trees all around - made us feel like we were eating breakfast in a lovely garden every morning. The staff were fabulous as well and advised us on excellent dinners each night. We felt they sent us to true Italian restaurants and not just some chain restaurant which was offering a bonus to the hotel for the referral - they were truly amazing Italian dinners - especially restaurante 59 - off the beaten path and the best service and food in Rome. Thanks again Spanish Steps!!", "Date": "June 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "midlands uk", "Title": "“Intimate Hotel”", "Author": "PaulH1967", "ReviewID": "UR32659424", "Content": "We had a lovely May short break in Rome and stayed at the lnn @ the Spansih Steps Hotel. It is located rght on the Via Conotti with all the glam shops. The hotel is very intimate and romantic with a super terrace from where you can saviour the rooftops of rome. We had a executive room with a huge comfy bed. The room was a delight and had nice touches such as fruit, bottled water and nuts. The staff were very attentive and professional and made us very welcome. We opted for a chauffeur serviceto and from the airport for 120 euro. An expensive transfer but we wanted to arrive in style. It was a pity about the return chauffeur service as we were driven to the airport in a clapped out peugeot with no air-con and stinking of smoke! I did complain and was refunded 30 euro. I would advise to check type of vehicle if you opt for this service. The hotel booked fine restaurants for us and the breakfasts were extremely nice. You could also have a complimentary buffet food on the terrace in the afternoon which was a real treat. This is an expensive hotel and Rome is an expensive city! But we had an amazing and exhausting time! The location is ideal for seeing all the sites and we walked pretty much everywhere. Grab a map, take your time and see all the sites taht Rome as to offer.", "Date": "June 19, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Iceland", "Title": "“What a nice week end...”", "Author": "Priscilla72", "ReviewID": "UR31926370", "Content": "Dear all! If you are planning your trip to Rome choose The Inn at the Spanish Steps! I have been there with my friends just a couple of weeks ago and I would immediately come back there... A perfect location for everything: shops, monuments, restaurants.. all is walking distance.. We went to Rome for shopping and could not be better located that there! Just be aware not to spend all your money :-) We received an upgrade to two superior adjoining rooms and we had breakfast on the terrace, between lemon trees and colourful flowers.... simply amazing!", "Date": "June 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pgh Pa", "Title": "“Great Boutique Hotel”", "Author": "denaza", "ReviewID": "UR31699375", "Content": "Lovely Boutique Hotel..Rooms felt like a mini mansion..brocade lined walls, painted ceilings. Great location for strolling to the sights. Surrounded by restaurants and shops galore. The hot breakfast was wonderful with alot of variety. We were pleasantly surprised with a feature we were not aware of..At 5:00pm a fabulous antipasto table is presented on the rooftop. Free laptop brought to our room was appreciated.The staff was great. Everything at the Inn was done with class!", "Date": "June 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Oceanside, NY", "Title": "“Awesome Hotel!!!”", "Author": "theschneids", "ReviewID": "UR30851678", "Content": "What an amazing, quaint hotel! The location cannot be beat! The Spanish Steps, which is the most central location in Rome, was right in front of you. The roof-top terrace alone was amazing....breakfast every morning was delicious as was the complimentary snack buffet between 5pn and 8pm. The staff was very attentive - they were able to secure us a Saturday night reservation in a very popular restaurant for our 10th Anniversary! Cannot say enough! Just a word of advice....they do not supply wash clothes, but none of the Rome hotels do..so, if you are like me and need a wash cloth, bring a couple of your own! Enjoy.....WELL WORTH the money!!!", "Date": "May 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Reykjavik", "Title": "“Excellent for Families. Superb location and friendly staff.”", "Author": "SolveigReykjavik", "ReviewID": "UR28163204", "Content": "Just got back from Rome where me and my family spent a week at The Inn at the Spanish Steps. We were very pleased with this hotel. The location is superb right in via Dei Condotti, the center of shopping in Rome and just a few steps from the Spanish Steps. Easy to walk everywhere, charming place. We booked the Inn taking advantage of the special family offer (we are two adults and three children of 2, 7 and 14). Two of my children got free!!! Thanks to the site in Icelandic language we were able to book it very easily. We will book again if we will return to Rome.", "Date": "April 16, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "iceland", "Title": "“Well done! I will be back ,Takk fyrir.”", "Author": "jonsson_ingi", "ReviewID": "UR27742757", "Content": "After I had booked this hotel I have to say that I was a little concerned about the cost wich in this period of economy crises is not a second issue but I have to tell you that it was exceptional for a wide variety of reasons ... location, service, rooms, roof terrace, staff... all amazing. We checked in on a Friday evening after a very loooong flight and were upgraded to an executive room with a small balcony overlooking the Spanish Steps. The canopy bed was very confortable.. Bathroom had jacuzzi tub, shower, separate area for the commode and two sinks which made getting ready in the morning a breeze. The breakfast buffet on the roof terrace which was included in our room rate was delicious. All the espresso and cappucino you can drink. Fresh baked pastries, and American breakfast items like eggs and bacon. When I return to Rome I'll stay here again without a second thought.It is worth every Krona.Takk fyrir!", "Date": "April 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York", "Title": "“What a wonderful find!”", "Author": "Betera", "ReviewID": "UR27291744", "Content": "We have just returned from five days at The Inn at the Spanish Steps. We were so happy we sent a thank you note to the hotel. After changing rooms (they were very helpful) we found ourselves in a sunny, cozy, antique filled room with a good amount of space and some lovely touches (fireplace, beamed ceilings). A note--the street is lively and noisy. Great for walking on but not for having a room above. The windows shut out the noise, but if you like an open window, day or night, ask for a room facing the back. The location of the Inn is perfect, right in the center of shopping and endless trattorias/ristorantes, not to mention the obvious (the Spanish Steps right down the block) The concierge service is perfect. Franco, in particular, was most helpful, suggesting wonderful places to dine. The entire staff is friendly, polite and very professional. We were delighted with their help and most appreciative. Our favorite part of the Inn was the upstairs breakfast nook/lounge area. A lovely buffet breakfast (included) is served as you sit on comfortable couches and arm chairs (or outdoors, under umbrellas in warmer weather.) An early evening free buffet is offered as well, and provides an opportunity to meet and chat with other guests. We found the Inn via Tripadvisor, so thanks to all who recommended it before me. Much appreciated.", "Date": "April 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York", "Title": "“What a wonderful find!”", "Author": "Betera", "ReviewID": "UR27291611", "Content": "We have just returned from five days at The Inn at the Spanish Steps. We were so happy we sent a thank you note to the hotel. After changing rooms (they were very helpful) we found ourselves in a sunny, cozy, antique filled room with a good amount of space and some lovely touches (fireplace, beamed ceilings). A note--the street is lively and noisy. Great for walking on but not for having a room above. The windows shut out the noise, but if you like an open window, day or night, ask for a room facing the back. The location of the Inn is perfect, right in the center of shopping and endless trattorias/ristorantes, not to mention the obvious (the Spanish Steps right down the block) The concierge service is perfect. Franco, in particular, was most helpful, suggesting wonderful places to dine. The entire staff is friendly, polite and very professional. We were delighted with their help and most appreciative. Our favorite part of the Inn was the upstairs breakfast nook/lounge area. A lovely buffet breakfast (included) is served as you sit on comfortable couches and arm chairs (or outdoors, under umbrellas in warmer weather.) An early evening free buffet is offered as well, and provides an opportunity to meet and chat with other guests. We found the Inn via Tripadvisor, so thanks to all who recommended it before me. Much appreciated.", "Date": "April 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "PASADENA, CALIFORNIA", "Title": "“Amazing”", "Author": "TRAVELADIX", "ReviewID": "UR26190882", "Content": "Loved every minute of it! Beautiful hotel with friendly staff & a great location. A little on the expensive side. Best breakfast room in the whole city.", "Date": "March 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sydney", "Title": "“Top quality five star hotel in rome”", "Author": "harrybruce", "ReviewID": "UR25627283", "Content": "I have been in many hotels in rome during my life, never was so good. Great location, excellent staff, wonderfull view., really nice room with canopy bed. I will be back soon", "Date": "March 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "geneva", "Title": "“Best hotel in rome”", "Author": "johnbruno6", "ReviewID": "UR24813503", "Content": "I was at the inn at the spanish steps in december with my friend to celebrate my birthday. We found a very good hotel, great location, friendly staff, excellent breakfast, nice room. My best hotel experience, we will suggest it. Thank you", "Date": "February 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Berkshire", "Title": "“Lovely Inn at the Spanish Steps”", "Author": "Jaxy74", "ReviewID": "UR24468784", "Content": "My fiance and I have just come back from a 3 night stay at the Inn at the Spanish Steps. Overall the stay was excellent. The staff were very helpful and accommodating and we were delighted to also receive a free room upgrade. Breakfast was very pleasant in the lounge area (sadly it rained all weekend so we had no chance to have breakfast out on the pretty terrace.) The bedroom was very spacious, clean and stylish. The bathroom was a little small and the jacuzzi did not work but hey - we had received a free room upgrade so we didn't complain. We had a view of Bulgari and Gucci which was great and an oblique view of the Spanish Steps. The location was perfect, right at the top of the glamourous Condotti. The only minus point would be the bed. It looked amazing, was huge with loads of cushions but the mattress was very hard. Saying that, I would stay there again and also recommend it. Its a shame however that with the pound to euro rate, Rome works out to be an expensive city break.", "Date": "February 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "OC", "Title": "“Great Hotel, Great Location”", "Author": "cirrichard", "ReviewID": "UR21942297", "Content": "The Inn is one of the best value luxury hotels in Rome. The service was great. The rooms are large for Rome and the beds are huge. There is a garden lounge open for a late afternoon cocktail and the Inn supplies a great spread of appetizers. The view is great and it is quiet and intimate. The same lounge is where a great breakfast is served, including bacon and eggs (IN ROME). The best asset of the Inn is the service. This is a small establishment that treats you personally and professionally. From all the reviews that I read on Trip Advisor of Rome hotels and our past experiences, the large 5 star hotels do not compare to this Inn. I recommend it highly and will stay here again.", "Date": "November 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Great hotel, location, & staff”", "Author": "jvbi", "ReviewID": "UR21651240", "Content": "This is a good hotel with a great location and possibly the best , friendliest staff ever. It is also a good deal for the area, right on the Via Condotti, a very fancy shopping street. We stayed at their annex , still on Via Condotti but a few blocks further from the Spanish Steps. The annex was very quiet, and has bigger rooms than the main hotel. We spent several late afternoons / early evenings having a drink in the main hotel's terrace lounge. They serve free hors d'oevres - seriously, that's a deal in Rome where everything is so ruinously expensive. Outside overlooking the skyline and reputedly the designer Valentino's apartment, or inside the cozy lounge, it was wonderful place to hang out. The staff could not be friendlier or more helpful. I used a staffer's laptop since I didn't have my own. Need anything? Just ask and they perform with smiles. Truly, the entire staff work really hard to ensure their guests are comfortable and happy. If we go back to Rome, we would definitely stay there.", "Date": "November 8, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "oxford", "Title": "“three unforgettable days”", "Author": "francy0oxford", "ReviewID": "UR20756439", "Content": "I've been for three days in this small but very pretty hotel in Rome. So near to the romantic Spanish Steps and the most famous shops in Via Condotti. The staff was professional and also friendly. My husband and I have been so impressed of how they helped us to find everithing we needed: good restaurants and the tour into the city. Our room was comfortable, the stile modern and in the same time warm. TV with a lot of international channels, king bed and a small terrace in front of Via Condotti. Also the terrace were we had breakfast every day was characteristic and familiar. We had the chance to visit one of the most famous city and also to live three unforgettable days in a great atmosphere in a romantic location. Rose", "Date": "October 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "steyr", "Title": "“superb hotel in great location”", "Author": "ich_8", "ReviewID": "UR20686934", "Content": "great hotel, top service and good location of hotel, we had a great stay at the inn", "Date": "October 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“My wife and I love it”", "Author": "ClaGlasgow", "ReviewID": "UR20592443", "Content": "Owesome property, Ideal location to visit the city and for the shopping. The hotel is located in Spanish steps, the heart of Rome, crucial place for the shopping (my wife love it) with the major brands all around within few steps. To visit the major attractions you no need to go anywhere else you are already there! The Staff of the Hotel,extremly helpfull, will drive you throught your personal experience in the city. By using their tips when the evening will come you wll be already under the spell of one of the most beautifull city in the world. Coming back at the hotel i found romantic the view on the spanish steps late a night. Overall good value for the money. I will certenelly come back.", "Date": "October 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "california", "Title": "“If the bed is uncomfortable.....”", "Author": "seetheuniverse", "ReviewID": "UR20383645", "Content": "This hotel is all about location. If you want to stay within the shopping triangle, surrounded by glamour and glitz, this is the place for you. Nestled next to Prada, you couldn't ask for a better spot. One block from the metro and walking distance to most of the sights. However, when I come back from a day of shopping and sightseeing, and am paying as much as I am for a night in a hotel, I want a comfortable bed. What I got was several nights of sleeping on a box spring, with coils sticking me every time I moved. After I was told my room rate was being increased for the weekend, I complained bitterly to the staff. I was given a withering look and told the beds were \"orthopedic beds\". Whatever that means. They placed a foam pad on the bed which helped to cushion the springs but I was rather disappointed overall with the size of the room, the furnishings and the amenities. I paid half as much for a room (that was also next door to Prada) in Florence and slept much more comfortably. Research your options and instead of paying through the nose for this hotel, find a cheaper place so you have money to shop with!!", "Date": "September 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kansas City", "Title": "“Poor value, great location”", "Author": "JMHKansas", "ReviewID": "UR20289934", "Content": "We stayed at the Inn at the Spanish Steps in late August. Their driver was waiting for us at the airport as promised, which was nice after an 11 hour flight. Upon arrival at our hotel we were informed that because another guest had to change their travel dates (due to a sick baby - long story about hospitilization ensued), our room was not available but we would be put in the Inn's \"small apartment\" for the night. We were so exhausted at that point we agreed. After a 3 block walk lugging our suitcases over cobbled streets, we colapsed on the rock hard bed in our little apartment. After a freezing cold shower (due to poorly functioning boiler) I demanded a new room, and was promised an upgrade the following day. Long story short, we were upgraded, but the experience left a sour taste in our mouth. We would not stay here again, nor would we recommend it to others. The location was great, but beware if you're a light sleeper, as the street noise at night woke me frequently.", "Date": "September 22, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Newport Beach, Calif.", "Title": "“Not happy with this hotel at all.................”", "Author": "shawnc2", "ReviewID": "UR20227943", "Content": "I just got home last night from Rome and staying at this hotel, let me just say, only one good thing about it, the location that's it, we were in France,and Italy for 14 days before this and stayed in three other hotels, and this was the only one we did not like. I always look at reviews to make my decision and I just needed to say I did not like the hotel and the service was ok, Franco greeeted us and offered us an upgrade so we took it right over the street, extremely loud all night, so we went back to our original room and cheaper price which he said he would not charge us more for the one night we upgraded but when we checked out he changed his mind. Oh well, I just had to say this, because we wished so much we would have stayed somewhere else.....The whole hotel needs an overhaul, for the price not woth it at all. Even if they did, we would not go back too because of the service.", "Date": "September 20, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Pleasanton, CA", "Title": "“Good location but VERY overpriced”", "Author": "funw3boys", "ReviewID": "UR17736404", "Content": "We have just returned from a 3 1/2 week trip to Florence, Rome, Positano in Italy and Valencia & Barcelona in Spain and New York City with our 3 boys aged 8-12. By far for the price, this was definitely our biggest disappointment. I was very apprehensive to stay here from the beginning because of the $ and I wasn't sure how much time we would actually be staying in our room. The biggest disappointment was we had specifically requested adjoining rooms since we were having 3 children stay in a room by themselves. I said this was a huge deal breaker for us if they could not accommodate us. They said they could but made us upgrade to a 100 euro, more expensive room. Well, I guess there is a little bit of a language difference on what adjoining/connecting rooms mean. These rooms were not connecting but next to each other. I was extremely disappointed. The rooms were fine and they did have the largest king size bed I have ever seen. It had to be 2 doubles pushed together. We could have easily had 4 if not 5 people in our room with the children, but they would only allow 3 max and 1/2 our bed went unused. The breakfast and hors d'oeuvres were good but you had to pay for the drinks including water, so they kind of get you with that. It was a nice idea though and customary in Europe. Also, I was surprised about the other review about the concierge. The one time we got a referral we had asked for something kid friendly and casual with pizza and they sent us to a restaurant with no kids menu or pizza and was fancy. Luckily we were able to find a place right next door! I think there are better options for your money. Now the most luxurious hotel we stayed in was the Westin in Valencia, Spain, now that was comfort AND our cheapest hotel of the trip WITH adjoining rooms!", "Date": "July 9, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Smelly Room with Broken Furniture Costs How Much?”", "Author": "mlm125", "ReviewID": "UR17400188", "Content": "During a month long trip to Italy and Eastern Europe in February 2008, I booked this hotel to celebrate my husband's 32nd birthday as a nice surprise. Although it was the priciest hotel we stayed at during this particular trip, it was one of the least nice properties. After traveling throughout Europe and Asia and staying in all sorts of luxury properties, this one stands out as a big disappointment. I would not stay here again. When I finally saw the room, I was crushed. Not the kind of birthday surprise I was hoping for. We had a room on the second floor that overlooked the street. The room absolutely STANK from smoke and was so must y that every time we walked in the room, we rushed to open the balcony door to provide some relief. Literally, other than while sleeping, we were never in the room without the balcony door open, and in February, this says a lot. Worst of all, some of the furniture in our room was actually broken. The desk drawer had a giant chunk of wood missing. This is fine for a Motel 6, but not for a property like this. Looking at the broken and scratched up furniture just made my heart break. In fairness to the hotel, the breakfast each morning was very nice in terms of selection and quality of food. Although the space where they served the food was lovely, it was very cramped, especially during rush times. The location is nice, too, but the hotel could do a bit more to make its property actually deliver.", "Date": "July 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“fabulous”", "Author": "emgtraveller", "ReviewID": "UR17238842", "Content": "i almost hate to tell people how great this place is. the location is perfect, the breakfast on the roof garden is wonderful. service is very attentive. and we were travelling with a college age child so we had a great room with two beds. and internet of course. loved it.", "Date": "June 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chiswick, London", "Title": "“Great staff keeps this hotel a step ahead of the rest”", "Author": "CHG30", "ReviewID": "UR17060074", "Content": "We stayed at this hotel for 3 nights in June 08. Overall our experience was excellent. I really felt this hotel tried to add value to our experience the whole way through our stay. Pre- arrival service with this hotel was AMAZING. Francesca emailed us at least 5 times prior to arriving with many suggestions such as how to pre book attractions to avoid the queues etc. She also pre-booked all our restaurants for the Rome leg of our trip taking into account our preferences. All of the restaurants were excellent. We appreciated the free upgrade to a deluxe room, and the free airport transfer. ( They offer a free one way pick up.) Overall it was these types of little touches that make this hotel a step above the normal tourist hotel. This and the staff who were all superb, from the receptionist to the thoughtful waiter who would bring strawberrys unprompted to accompany a glass of Prosseco! The room itself was large, furnished in typical Italian style with antique furnishings. It was clean, the bed was comfortable, the linen new and in good condition. The room was also very quiet. Breakfast was taken on the roof terrace, a lovely location for breakfast surrounded by lemon and olive trees and a great view over the city. From 5-8 they also serve aperativo on the terrace - a most pleasant way to spend the early evening. Overall excellent hotel, excellent location, superb staff. I would definitely stay here again.", "Date": "June 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "dublin", "Title": "“fantastic”", "Author": "betDublin", "ReviewID": "UR16245808", "Content": "stayed here on the 9th may for 2 nights. staff, exceptional. location, right on via condotti, was in shopping heaven. have been to rome lots of times, but truely have found a gem of a hotel. rooms, lovely, very clean. hotel terrace a haven of calmness, you wouldnt think you were in the centre of a bustling city. am going back in august & will be staying there", "Date": "May 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Istanbul", "Title": "“Lovely Hotel”", "Author": "Maya34", "ReviewID": "UR16241005", "Content": "We stayed at the Inn for 3 nights last week. We were recommended by two different friends, so we thought there should be something at this hotel. There really was... From the moment we entered the hotel, we were met by the staff who were very kind, helpful and positive. We had a very nice room at the other building of the hotel, still on via Condotti. The location is perfect, within walking distance to most of the tourist attractions. We never took a taxi or the metro. The terrace is a little piece of heaven among lemon trees and you can enjoy some complementary food there. It is always possible that some unfortunate things can happen as was mentioned by other people in reviews. But I would highly recommend this little hotel that contributed much to our pleasant stay at Rome.", "Date": "May 20, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Harwinton, Connecticut", "Title": "“Great Location”", "Author": "kna774", "ReviewID": "UR15969447", "Content": "My husband and I stayed at the Inn for 3 nights in September as part of our honeymoon. We loved the location, the evening cocktails on the roof and the service was decent. Our room was pretty yet small, but we expected that as we were in Rome. No view. We spent most of the time away from the hotel exploring the city, so the room did its job. I had friends who lived in Rome so I got most of our restaurant recommendations from them. The once place we were sent to by the hotel was incredibly overpriced, very touristy and we got royally ripped-off. We travel often and this place was more like a slap in the face. Our trip to Rome was excellent and at the time I thought the hotel was great and I couldn't wait to tell others to go there. After leaving Rome we flew to Mykonos. While unpacking at that hotel, we noticed that my husband left some of his dress shirts at the Inn at the Spanish Steps. I immediately called the hotel (we had checked out earlier that morning) and was told that I needed to fax over my credit card information so that they could send me back the shirts. I said, you have my info from this morning and I wouldn't send it over again. They wouldn't send me the shirts - not to Greece and to the States. Got in touch with my travel agent (while still on my honeymoon) to get her people on it. It is now May '08 and I still do not have those shirts. For a hotel that is supposed to be to high-end and cater to people, I was incredibly surprised at their behavior. I have never had issues like this before.", "Date": "May 12, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Tucson, Arizona", "Title": "“A tale of two stays: one decent, one dreadful”", "Author": "ncinaz", "ReviewID": "UR14777187", "Content": "We recently had two stays at the Inn at the Spanish Steps and the experiences couldn't have been more different. The Inn's billing works in mysterious ways. We booked the stay several months in advance and were surprised to be immediately charged for the entire stay. When I inquired with the hotel via e-mail, they explained that the charge was just an authorization and would expire within two weeks, which it did. A few weeks before our arrival I checked the hotel's website to see if rates had gone down since the initial reservation. They had gone down dramatically, from 390 euro to 250 euro per night. Again, I contacted the hotel and they agreed to reduce the rate. Finding the hotel once you arrive in Rome isn't easy, it's hidden away and has only a tiny sign leading through a drab hallway to a small office - don't expect a lobby. The front desk personnel were warm and helpful on our initial two-night stay. Our room, in the \"View,\" on the top floor of a separate building, was relatively modern and had a lovely view over the Spanish Steps. Unfortunately, the ruckus from the Steps caused us a lot of lost sleep. The bed was more suited to a one-star hotel than one that commands nearly 400 euro a night. Nevertheless, we enjoyed the location, the wonderful terraces, and the friendly staff. We returned to Rome a few days later after a visit to Positano and the truly first-rate Le Sirenuse. We were greeted at the front desk with indifference and the staffer who had been helpful on the prior visit was quite unpleasant. We were stunned to learn that our room would cost the mysterious price of 340 euro, not the 250 the hotel agreed to, and not the initial 390. The front desk attendant said he had no record of the 250 rate and refused to honor it unless I had proof (even though we had just stayed there a few days prior). I emailed him the correspondence that mentioned the 250 rate and he said that only the manager could reduce the rate and we could discuss it when we checked out early the next morning. As it turned out the manager never appeared that morning, just a night attendant. Then there was the matter of our room on the second stay. This room, in the \"Inn\" proper, was small, dark, dingy, had no view whatsoever. The horrendous bed in that room made us nostalgic for the other lousy bed. The coup de gras was that our wake-up call the morning of check-out was a half-hour late. Our follow-up emails to the hotel haven't been returned. One last thing to be aware of - the hotel plays fast and loose with your credit card information. Expect them to take a huge authorization on your card and hold it for several weeks while also charging you for the stay once you check out. Apologies for the long message. I just thought potential guests should be aware of all the issues at the Inn.", "Date": "April 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“great location, friendly staff”", "Author": "girl506", "ReviewID": "UR11069206", "Content": "The inn at the Spanish steps was quite lovely. The rooms were fairly large, clean. Most staff members speak english, and were very friendly. The location is conveniently located to anywhere you're going in the city. On via Condotti,where most luxury boutiques are situated. It was a pleasant stay!!", "Date": "November 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Best Find in Rome”", "Author": "kcpf1121", "ReviewID": "UR10119252", "Content": "When we arrived in Rome we had a reservation for a different hotel. Due to the condition of that hotel we had to change. My travel agent suggested the Inn at the Spanish steps. From the manager (Franco) down to the service staff I have never stayed at a hotel where the staff was so helpful. The hotel was immaculate! If you are expecting a great room entrance you have the wrong place. They make up for it though in every other aspect of the hotel. The size of the room was big enough that coming back to the room to relax was entirely possible. If you wanted to check your e-mail the staff sent up a laptop so you could do so in private. Not only did your stay include breakfast but also an evening snack, both of which were excelent. With so much to see and do in Rome, we left feeling as if we didn't spend enough time in the Hotel!", "Date": "October 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NJ", "Title": "“Nice boutique hotel”", "Author": "HonestTravelerNJ", "ReviewID": "UR10034894", "Content": "What people are saying in the reviews are true. It's a quaint small boutique with the friendliest staff! We were upgraded to a larger room without asking. The bathroom was very large and modern and the bed was huge (a little hard but I found most beds in Europe are this way). It turned out there was construction on the street outside our window one night and the staff gladly moved us to a new room at the rear of the hotel. I have to say the rooftop lounge was a great perk. When you want to rest your feet from touring and don't want to sit in your room, it's a nice place to go. They provide a free early evening buffet with snacks and small sandwiches and great breakfast with eggs, pastries, toast, cereal, etc. What made this hotel amazing was mostly the location and the amazing staff. I would recommend it to anyone. It is worth the price. (also, it might be worth checking out the new hotel the owner opened called The Inn at the Roman Forum. We spoke with the owner one day and it sounded nice).", "Date": "October 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Surrey, England", "Title": "“Best service in Roma”", "Author": "Jason_Suzanne", "ReviewID": "UR10017845", "Content": "We stayed at the Inn having booked it at short notice. We had heard that the staff there were excellent and thoroughly helpful. This certainly turned out to be the case. They arranged a fantastic tour of the Vatican (with Kim) and changed our room when we noted the temporary road works to improve the pathway outside. The location was also superb and felt very safe. The complimentary evening buffet is also excellent and the free internet service very useful. We would recommend this place to prospective travellers - you definitely get what you pay for in Rome and this place is worth every penny.", "Date": "September 29, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Mixed Feelings”", "Author": "clifton2a", "ReviewID": "UR8368347", "Content": "Stayed here for 3 nights, There is no doubt the location is great location we were upgraded to the view which is the top floor of a building overlooking the Spanish steps and 10 doors away from the main hotel it has a private terrace and living room which is shared by the 3 bedrooms breakfast is served on the terrace each morning, The unsual thing was that you had to go to the hotel to let you in the building everytime you came back which was a real nuisance also as it wasn't in the hotel room service etc took a while. They don't have Irons either and it's quite expensive to get shirts pressed !! The rooms was a nice size and the bathroom had a Jacuzzi all in all it's a great location can be a bit noisy but when you close the shutters it's fine ( have to expect it for the location) we spent most of our time sightseeing and were able to walk everywhere, The staff were great and Franco booked us some nice places to eat and was great at giving directions, The little gifts in your room eveyday was a nice touch. If you do go to Rome you should try and get to BABY in Hotel Aldrovandi Palace we had the tasting menu here and it is one of the best meals I have ever had for food and service [--] The hotel provided a car to pick us up from the airport and ordered a taxi for us to go back it was meant to only cost 45 but the driver tryed to get 56 when we got there he finally settled for 50 Obviously this wasn't the hotels fault but just beware Great hotel, Great location but don't expect 5* service", "Date": "August 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“The perfect place”", "Author": "ItalyfanEngland", "ReviewID": "UR8099522", "Content": "Mike and Frances Wedge, England My husband and I stayed at the Inn at the Spanish Steps from 20th June for 3 nights. We also asked the hotel limousine to collect us from and return us to Rome airport, which saved a lot of hassle and the service was first class. Staff at the Inn were always courteous, polite and discrete. The waiters who look after the roof terrace are charming and cannot do enough for guests. Our 'favourite' waiter was an Iraqi, married to a Croat, who spoke Italian and English with an American accent. Great! He was charm personified. The roof terrace really is a little haven away from the busy streets below and what a view of the Spanish Steps (especially first thing in the morning). Location-wise this hotel could not be better, surrounded by super restaurants and even (good) walking distance to the Forum. We would recommend the use of taxis rather than the Metro - they are relatively cheap, airconditioned and you get chance to see more of Rome (if sometimes slowly). Each night from 5 pm the hotel serves a super buffet on the terrace - a word of advice - get there early as our friends from over the Atlantic are fond of their food and it can be cleared out relatively quickly! Further advice - if you want to visit the Colosseum, get tickets on line in advance and avoid the 30 minute queues. Further advice - don't fly into Fiumicino airport - on return we arrived 3.5 hours early and only just managed to catch our planes. There were 3 american jumbos leaving but all departures had to queue in a main queue before checking in at relevant desks. It was a nightmare. also, hire a car from central Rome not at the airport - this queue was 2 hours long! (Avis). We shall return to the Inn - it is now one of our most favoured hotels in the world. Our room was spacious and well furnished with a HUGE bed and stuccoed ceilings. Each day we had a little 'gift' from the hotel - a lovely touch.", "Date": "July 11, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "London", "Title": "“Worst hotel ever stayed - and that for 1200 Euros per night!!”", "Author": "JapanLondon", "ReviewID": "UR8086859", "Content": "The hotel was truly disgusting - I do not comprehend the lack of taste and investment of the owner while having the audacity to charge 12K Euros per room per night! As the Suite was gone, I booked the 'second best' choice , according to the hotel, for my parents' 50th anniversary. The room turned out to be mouldy and grim (without any old charm) decorated with dust covered cheap synthetic flowers dated from mid 80s at least ( !), the so called 'jacuzzi' was old , scratchy, and filthy, the bath amenities were less than the 2nd rate, the corridors were filled with revolting 'synthetic' cheap scent often used in some hideous toilet in a dim backstreet cafe, and the terrace where breakfast was served was again filthy with pigeons flocking on the plates on tables that guests had left. No waiter/waitress bothered to chase the pigeons away or clear the mess. The breakfast was equally distasteful with the highlight of tinned fruit and cheapest packaged chesse. In Italy! The following morning we moved to the Hotel Eden on the hill - thank God the hotel was excellent and the staff civilised. It was not much more expensive than the Spanish Steps, which by the way refused to refund for the 2nd night that we cancelled. Before coming to Rome, we stayed at the Lungarno Suite in Florence and the Danielli in Venice both of which were good in different ways - and I thought a little sweet boutique hotel in Rome would be good but it turned out to be a nightmare. I wanted to make it special for my parents for their anniversary- but this hotel really ruined it for us that night.", "Date": "July 9, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "New Jersey", "Title": "“Be wary Can be Very nice or Very unpleasant”", "Author": "worldllc", "ReviewID": "UR8086740", "Content": "We booked through a travel who lack advising some key details. Last time booking throuh him! Some words of wisdom and experience as I was traveling with Native Italian family members who gave me even another perspective. 1) Only taxi's are allowed in this part of the city if you have a private car or rental find another hotel in another area of the city no parking or access here. 2) staff (bell, maid, waitress very nice) the reservation area is a mess. THE KEY TO STAYING AT THIS HOTEL if your going to, IS TO STAY IN THE HOTEL BUILDING NOT THE \"INN\" OR \"RESIDENCE\" BUILDING. There are really 2 buildings detached and the rooms are very different in each building. I stayed 2 nights, one in the Inn horrible and moved to the hotel building nice. It changed my rating from POOR to GOOD. 3) Since you are at the foot of the Spanish steps it continued to be noisey through the night with party goers. Although the second night in the hotel suite was great and the help staff was great I would not stay at this hotel again. There are so many other nice hotels (Hotel Barocco or Hotel Benini) in the city center. Nick, NJ, USA", "Date": "July 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Very Nice”", "Author": "smith01", "ReviewID": "UR7871885", "Content": "I stayed at this hotel for a long weekend with my boyfriend back in February. I have been to Italy many times and stayed in a wide variety of accommodation. Our experience at this hotel was excellent. The accommodation itself was of a high standard, the breakfast was good and the staff were great. As this is a small hotel - the staff were really attentive and we felt very welcome. I would highly recommend this hotel to couples looking for a small friendly hotel in a fantastic location in the heart of Rome.", "Date": "June 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“Lovely hotel, great location!”", "Author": "NYCandbeyond", "ReviewID": "UR7843167", "Content": "My husband and I recently stayed at the Inn for four nights in early June. We booked a great rate on the slh.com website. I highly recommend joining the SLH Club (free membership) because we received a room upgrade and several complimentary bottles of wine, fruit and Bulgari perfume during our stay. The entire hotel staff is very friendly and accommodating - from check in to check out. They made dinner reservations for us, provided maps and really went out of their way to make our stay in Rome perfect. You can't beat the location just a half block from the Spanish Steps down Via Condotti (amazing shopping)! There are countless restaurants within a few blocks. Our room had a lovely little terrace and several large windows. Our room faced the courtyard so it was very quiet. Breakfast is served on the top floor both inside and out in the beautiful rooftop garden. Breakfast consisted of juices, cereals, toast, eggs, pastries, fruit, meats and cheeses. In the afternoon there is a generous complimentary snack buffet consisting of everything from antipasti to cake to mini sandwiches. Each evening we would take the bottle of wine that the hotel had delivered to our room and brought it to the rooftop and enjoyed it with a few appetizers before dinner. Our room was a very nice large superior room with big windows that we opened a lot and a marble bathroom with shower and tub. Housekeeping came twice a day. There is a small elevator in the hotel but the stairs are very manageable. I highly recommend a drink not only in the hotel's rooftop garden but also walking up the Steps to the Hotel Eden and enjoying a cocktail at their rooftop bar - Bar La Terrazza. Stunning views of the sun setting over Rome! The drinks are pricey but well worth it! In summary, this is a fantastic deal in Rome when you add up all the little extras the hotel provides and the wonderful service! I am very picky when it comes to hotel rooms and I always do a great deal of research before traveling and I couldn't have been more pleased!", "Date": "June 13, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“amazing location”", "Author": "shelgreb", "ReviewID": "UR7471878", "Content": "My husband and I just returned from our vacation in Italy. We adored this hotel. Not inexpensive but for the price you must request a room facing the street. Do not take one of the interior rooms they are very confining and claustraphobic. Great great locaion at base of the Spanish Steps. A very safe area and it is convenient to walk almost anywhere in Rome. Our room faced directly across Bvlgari and was directly aboe Cafe Greco. Great pastries and espresso. Nice high end shops close to all good shopping in Rome. Prada, Gucci, Dior, Miu Miu steps away. Rooftop patio is nice for a drink. Pass on the lemoncillo not our thing at all. Breakfast was okay better than most hotels. Afternoon snacks offered betetr on some days than others. Executive room was quite large and had walk in closet and jacuzzi tub. Nice bath amenities. High ceilings and large balcony style window. A gift waiting in the room every afternoon. Champagne, red wine, bottle of Bvlgari perfume. Loved it.", "Date": "April 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Las Vegas", "Title": "“Perfect fit”", "Author": "rugburnz", "ReviewID": "UR7434998", "Content": "Really loved this hotel. It worked perfect for us. Right in the heart of the action on Via Condotti and 50 yards from the Spanish Steps. The rooms were gorgous, the service great. Excellent breakfast buffet. Would recommend!!", "Date": "April 25, 2007"}, {"Ratings": {"Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Service": "2", "Location": "5"}, "AuthorLocation": "London", "Title": "“Nice - Great Location, but be warned.”", "Author": "EW1966", "ReviewID": "UR6750263", "Content": "In short - my advice is to make sure you get a copy of their cancellations policy when you book. We were forced to cancel due to the death of my Mother and in fact cancelled within 24 hours of making the reservation. The hotel applied a charge of £1066. We disputed it through Amex having been ignored by the hotel despite 3 telephone calls and numerous emails. The person to whom we were directed dint even work in that hotel and they refused to acknowledge us. Amex upheld our complaint. 3 months later, the hotel re-applied the charge and then claimed that the email I sent them had the wrong email address on it. This was odd - how would they know unless they received it? Likewise, it was the same address from which the notification of charges was sent! I have visited the Hotel to personally request a copy of their cancellation policy - they couldn't find one. The Hotel is in a fab location, though a little noisy. It looked lovely - but it is very expensive for what it is. Try the hotel d inghilterra. It is only down the road and, whilst small, oozes charm and character. Nice staff too. Oh, and their very own cancellation policy.....", "Date": "February 6, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "zurich", "Title": "“Not a luxury hotel”", "Author": "ZurichSwitzerland", "ReviewID": "UR6476831", "Content": "My husband and I booked a weekend at the Inn at Spanish Steps for his 40th birthday. I have never felt so cheated in all my travels....and I have travelled extensively. The rooms were dirty and very crummy (wallpaper peeling off, mold in the bathrooms etc), the service was rude and the price outrageous (for what one is getting in return....!). The only attribute that this hotel has its location - next to the Spanish Steps and adjacent shopping districts. I am a frequent guest of relais et chateaux, leading hotels of the world etc. and I have never had an experience like this. I regret my stay at the Inn at Spanish Steps (so much so, that I wanted to let it be known on tripadvisor so that others can be aware!!)", "Date": "December 20, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Reston, Virginia", "Title": "“Hated the Annex”", "Author": "LF1", "ReviewID": "UR5817371", "Content": "We just stayed one night at The Inn at The Spanish Steps and were disappointed to have been booked in the Annex. Not once in the entire booking process did the hotel elude to the fact that they have 4 classic rooms that are NOT located in the main hotel. They are not even located next door, but 2-3 blocks away in a condo building. This definitely took away from the experience that they sell you on -- the rooftop terrace and parquet floors in every room. Not the experience we had and just for that I would not stay there again. They could have a least discounted the room, which they did not.", "Date": "September 19, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Position, position, position ... plus style and service!”", "Author": "TurfTycoon", "ReviewID": "UR5502490", "Content": "My wife and I stayed for 5 nights at the Inn and it was a memorable and enjoyable experience. The low-key entrance next to Prada was our \"secret\" escape route from the maddening crowds and it was always a pleasure to make it back to the hotel. In contrast to a number of the reviews on this site we had a great time at the Inn and received outstanding, friendly and professional service from Francesca and the rest of the team. Our room (315) was bigger than expected and while it had a few problems / quirks they did not detract from the stay in any significant way. We did not have a view (unless you wanted to open up the curtains and windows and look at the backside of adjoining buildings and their plumbing / air-conditioning) but if you stay at this hotel you should not be thinking about a view - when you understand where it (the hotel) is located and the claustrophobic nature of the average Roman street you will understand. Besides, the lack of natural light seemed to help us sleep really well. The room seemed to fall away from the bed slightly (it is in a 200 year old building ...) and while the bed was firm and comfortable and the decor stylish and luxurious there were a few problems with the period(?) furniture. The wardrobe was really struggling with the uneven floor and one door was very difficult to close and the whole thing seemed like it might fall on you but rather than get annoyed we just laughed at it (we called it \"character\"). There was no drawer space save for the two tiny bedside units. The bathroom was quite large with a good bath and shower and a nice size basin. Italian's seem to like bidet's but we didn't use it. The room was thoroughly serviced every day and they even changed the bed sheets daily. Breakfast is included in the rate and it was easily the best small hotel spread we've seen. The roof top terrace is a lovely relaxing way to start the day with table service for your tea or coffee (I recommend the \"american\" filtered coffee with hot frothed milk). The roof-top also doubles as a bar and sitting room (there is a comfortable inside section as well). They serve a reasonable amount of complimentary canapes every evening but the drinks seem a little over-priced (but subsequent bar / restaurant visits tempered that view). We were so tired one night we even ate upstairs from the limited room service menu which included a very nice lasagne. The hotel is exactly where you expect it to be - right at The Spanish Steps (which are perpetually crowded with tourists and hawkers) - we were speechless when our limo pushed it's way through the crowds past the Steps and into via dei Condotti. Get up early and you will have the steps (and the nearby Trevi Fountain) to yourselves. At 7am the average tourist is still in bed (or not so centrally located to start with) and even at 8:45am it was quiet. The Spagna metro station is right behind the Steps (good Gelato in the alley) and only a 1 euro ticket to Termini (main / central station) or even the Colosseum. There are buses that run down the Corso (down the other end of Via Condotti) - taxis can be hard to find (especially in a taxi strike like we encountered!!). There are many restaurants, bistros and bars nearby but the quality is variable - the one restaurant recommendation we solicited from hotel staff was ok but elsewhere it was very hit and miss. Same goes for coffee and gelato - look for establishments run by Italians and patronised by Italians as there are some rubbishy tourist traps. The shopping on Via dei Condotti is reserved for those who have money to burn - the Inn is next door to Prada, opposite Bulgari and there are all the other labels you could never afford as well. The good news is that there are more down to earth shops close at hand - head down to the Corso. But overall my wife found the shopping a bit disappointing and the quality and styles very hit and miss (much like the food). Overall we found the Inn to be reasonable valuable for money, the room was comfortable, the service absolutely first-class and the location very convenient.", "Date": "July 24, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "atlanta, georgia", "Title": "“first visit to rome”", "Author": "A TripAdvisor Member", "ReviewID": "UR4951138", "Content": "This was the beginning of a trip I have dreamed of many years, and the Inn at the Spanish Steps was the perfect choice for that beginning! We were greeted at the airport and transported into the city by two most kind and helpful gentlemen. Our room was quite lovely, roomy, and the bathroom a lovely space, women appreciate that. The staff was so well informed, sent us to marvelous restaurants, found an excellent personal guide for us, and in general helped us in every way they possibly could. My welcome to Italy, Rome, the Inn was as perfect as it could have been. I cannot wait to return to Italy, I absolutely love the country, the people, the generosity of spirit, and I will stay at the Inn at Spanish steps again.", "Date": "April 8, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "England", "Title": "“Great Central Location”", "Author": "thepickytravellers", "ReviewID": "UR4583507", "Content": "We stayed at the Inn for 5 nights and had a lovely time. We booked an executive room, (don't have 405/407 as the walls are paper thin) and it was warm and soundproofed from street noise. The 'balcony' is really just a ledge, so don't expect to sip coffee on it! I would go for a deluxe facing onto Via Condotti if we go again. Breakfast was very nice, plenty of choice & rooftop lovely sun trap with fab views over the city. Staff friendly and helpful. Be warned that the Spanish Steps are currently undergoing an Italian (ie. slow) makeover, so there's not much to see as there are hoardings etc. However, you can't knock the location & you're right above Prada and all the best shops in Rome.", "Date": "March 5, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Newport", "Title": "“We recommend it!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4473105", "Content": "The Inn at the Spanish Steps is the hotel where we stayed during our Roman holiday, my family and I would like to reccomend it because our stay there was fantastic, my husband and I as well as the kids enjoyed it very much, the shopping on Via dei Condotti is great with all the brand name stores right next to the hotel, being a family of four with two small children we where able to have connecting double rooms so we could keep a close eye on them, the best part was the afternoon snack buffet at the roof garden lounge which the kids assaulted daily, the breakfast was great also. what a wonderful trip at least once in a lifetime must be experienced.", "Date": "February 20, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Baltimore, MD, USA", "Title": "“Underwhelmed, overpriced, and stinky”", "Author": "LGMG", "ReviewID": "UR4464403", "Content": "I stayed here for 2 nights in January at the tail end of my honeymoon. I had really been looking forward to the Inn, based on the reviews I had read on Trip Advisor and my husband and I had decided to go for it, even though it was a bit pricey. On the plus side, the location is phenomenal with a fun atmosphere, surrounded by the ultra chic boutiques and Porsches cruising by. On the downside, I was a bit disappointed since we did not get any honeymoon upgrade like they advertise on their website--I know its based on availability but the place seemed empty but they claimed not to have any free rooms. So we were shown to what had to be the smallest room in the hotel, right next to the stairwell with a view of the backside of the elevator shaft and their air conditioning system. The really terrible thing was that the room had the distinct odor of raw sewage. I am from New Orleans originally and I know that smell, the aroma of the French Quarter, and it was definitely coming from somewhere in that room. I am not naturally a complainer and so didn't say anything because I thought maybe it was just me, but after leaving for the afternoon and returning--it really did reek. At that point though we had unpacked and it seemed like too much hassle to ask to move. To be fair, it was elegantly appointed with a fresco on the ceiling and a tiny but luxurious bathroom. Not a fan of jewelry catalogs on the bedside table-seems cheesy. The bed was rock-hard with scratchy sheets and a thin comforter that looked a little soiled. The breakfast room on the top floor is relaxing with a nice selection of goodies to choose from. It was winter so a little too chilly for the terrace, but it looked lovely. Their \"Evening Buffet\" is a racket designed I think to get rid of some of the food from breakfast and charge you close to 10 bucks fro a cappucino--not impressed by that at all. The waiter left the door to their kitchenette open the whole time we were snacking so I had the pleasure of watching the mini pizzas go into the microwave--kind of spoiled the atmosphere. All in all, I guess maybe we made the mistake of trying to go budget thinking that the cheapest room at the Inn would still be a luxury experience, but we were wrong. I'm sure if you have the really big bucks to shell out for one of the nicer rooms, your experience would probably be much different than ours. I wish we had saved our money and stayed somewhere less pretentious and less odiferous.", "Date": "February 16, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“We loved it!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3489020", "Content": "We expect a lot from this hotel, because of the great review, the price and their association with Small luxury hotels. They really met our expectation: the location is perfect, the service was wonderful, the roof-top terrace lovely, the breakfast very good and the room was confortable. We just dream to return :-)", "Date": "May 20, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Oxfordshire", "Title": "“great location, thats it im afraid”", "Author": "PatsiStone", "ReviewID": "UR3416386", "Content": "We have just returned from a 4 day break in Rome to celebrate my partners's 40th birthday. I did alot of research on hotels, preferring to choose a small boutique hotel rather than a huge faceless one...The Inn at the Spanish Steps is in the most perfect location. However, we are both well travelled and I am afraid that simply because we like a bargain ( I got a deal somewhere on the internet for our room) does not mean that we will settle for second rate. The room we got given has already been described by someone else on these reviews and was a tiny, dark hovel with a window looking out to the sewerage pipe. There indeed was no number on the door and on 3 separate occasions our key cards stopped working - a minor hassle really. The staff upstairs on the roof terrace were lovely - friendly and helpful but the staff downstairs were a bit surly. They did not accept Maestro cards, something which I find incredibly hard to believe in this day and age....our bar bill was the final insult as we departed - 70 euros for 2 drinks each from the mini bar and 3 drinks each on the roof terrace. As I say, location perfect, but give me Le Petit Hotel where we stayed in 2003 anyday over The Inn.", "Date": "April 26, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Sunderland, England", "Title": "“Ideal location for a short stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR3298358", "Content": "We stayed at the Inn for 3 days in March. Arrived late at night and the Night Manager was a little abrupt. Junior staff were more friendly. The location was great and all major sights were walkable. Roof terrace was lovely for breakfast. We were pleased with our room which was ornate and very clean. The lobby, stairs and lift are cramped but it is a historic building and something has got to give! We would certainly go back. One note of caution, taxi transfers to the airport arranged by the hotel (maybe all hotels in Rome) are double what you can get on the street.", "Date": "March 24, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Istanbul Shirel Davies", "Title": "“Wonderful stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR3293598", "Content": "We visited rome with my boy friend and spent a fabulous week end at the Inn at the Spanish Steps with very helpful staff in a room spacious and very nicely furnished: N°409. The hotel is situated on the most famous street in Rome Via Condotti with all fashion shops like Gucci, Prada, Bulgari, etc.. near the famous Spanish Steps Place. The breakfast on the roof garden is delicious and served by very efficient staff. I enjoyed my stay at The Inn at the Spanish Steps and will return for sure!!!!!", "Date": "March 22, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Toronto, Ontario, Canada", "Title": "“Gorgeous Location.. For a Closet!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3254572", "Content": "The Inn itself is perfectly situated, intimate, and charming. But we arrived at the end of a wonderful, month-long stay in Italy to find ourselves in romm 301 which we could barely fit our luggage and ourselves into! (Should have known something was amiss when there was no number on the door!). Furnishings were quaint but the room overlooked the elevator shaft and the sewage pipe ran up the outside of our window! We complained and were told no other rooms were available. The terrace is lovely...Thank goodness we did not start our Italian holiday with accomodations like these! (We were in Italy, primarily Tuscany, from mid-September till mid-October 2004). The staff (except for the waiters/ waitresses on the terrace) were haughty and cool. Would NOT go back.", "Date": "March 6, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Magnific Vue from the roof garden”", "Author": "A TripAdvisor Member", "ReviewID": "UR3237845", "Content": "I spent the romantic week-end of St Valentine with my husband at The Inn at the Spanish Steps. It was magnific in a spacious room with original antique furniture, a bathroom with a jacuzzi, the personnel helpful and very efficient. The best thing was the buffet breakfast served on the roof garden with an unforgottable view on the Spanish Steps, the Via Condotti, the St Peter Basilic and the whole city-center. We were very satisfied of our stay and have recommed it to our friends, my sister, her husband and their 2 children will stay there for Easter. Don't hesitate to visit the place, you will be charmed!!", "Date": "March 1, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Hampshire UK", "Title": "“Location Location !”", "Author": "beenthereHampshireUK", "ReviewID": "UR2582991", "Content": "We have just returned from a stay at The Inn - it was to celebrate our 21st Wedding Anniversary. It is situated in the upper class shopping district and undoubtedly, the location is great. However, for SHL to call this a luxury hotel was an over statement to say the least. The room was average, some nice furniture was dotted around the hotel, room service took ages and the panini we received was not really that great - in fact, all food served by the hotel, was less than average, especially breakfast. The high spot is the roof terrace which you can sit at and enjoy the sunshine - or the torrential rain - whichever suits. We had a fabulous time in Rome but having travelled all over the world, my idea of a luxury hotel is not this one.", "Date": "September 18, 2004"}, {"Ratings": {"Cleanliness": "5", "Overall": "1.0", "Value": "3", "Service": "1", "Rooms": "5"}, "AuthorLocation": "Austin, TX", "Title": "“Be Very Wary!!!”", "Author": "CCKAUSTIN", "ReviewID": "UR2518435", "Content": "I made a reservation for this hotel while in Europe. We had spotty internet connection, and our reservation was duplicated. We cancelled the duplicate per phone and internet. Upon arrival, they agreed that our reservation had been cancelled and we would NOT be charged. The hotel lied, and charged us for the duplicate reservation. We are in a dispute with our credit card company, and now have our own attorney involved. Be very wary of this hotel!!!", "Date": "September 8, 2004"}], "HotelInfo": {"Name": "The Inn At The Spanish Steps", "HotelURL": "/ShowUserReviews-g187791-d229087-Reviews-The_Inn_At_The_Spanish_Steps-Rome_Lazio.html", "Price": "$290 - $756*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">85 Via Dei Condotti</span>, <span class=\"locality\"><span property=\"v:postal-code\">00187</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "229087", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/5d/c6/16/executive-double.jpg"}}