{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Geneva", "Title": "“Perfection.”", "Author": "Lewis R", "ReviewID": "UR128503456", "Content": "The hotel is in the perfect spot and the people were very nice. Although the room was very comfortable and relaxing there were several occasions where it was very noisy in the other rooms and in the corridors. There were lots of echoes. Overall i loved it but i wouldn't come back again because it was noisy and smelt like cheese.", "Date": "April 24, 2012"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "", "Title": "“Not for drivers!”", "Author": "JARPHX", "ReviewID": "UR128177321", "Content": "Our room had a narrow door-sized window, through which we could hear drilling in the neighborhood. I felt like we were sleeping next to a dentist office. Breakfast was not bad, but the room did not have nearly enough staff members to keep up with demand. The wi-fi did not work in the room three of the four days we were there. The shower was a hose with an attachment with little water pressure. To make it worse, the closest available public parking was about six blocks away at 37€ per day. My husband fended off a thief as we made our way to the hotel with luggage. Thank heavens for my Pacsafe purse and his Pacsafe shoulder bag.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Thank goodness Barcelona is so wonderful!! Because this place isn't”", "Author": "IndyG66", "ReviewID": "UR126878912", "Content": "After a 26 hour journey we arrived at the hotel 15 minutes before check in and where told by the rather grumpy lady on the front desk that we would have to wait! What we should have done was found a new hotel. Our room was old tired and smelled alittle to funky for my taste. Carpet was worn and tiles cracked. You cannot fault the location, close to market and supermarket and of course all the extertainment of las Ramblas. But accept for the breakfast I can find nothing to recommend this hotel. Even though they advertise wireless internet that to was a joke. I was told my 2 week old high end laptop wasn't good enough to use on there network yet it worked everywhere else perfectly", "Date": "March 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Good location, bad surroundings”", "Author": "HHov", "ReviewID": "UR126168137", "Content": "The Hotel is located in busy Rambla street. The location is good, but what bothers me about the surrounding are african prostitutes who won't let You to walk in to Your hotel without trying aggressively (even physically) to offer their services. This happens especially during the evening and night times. The hotel itself needs an update, the rooms were small, dirty and noicy due the heating. The security box costs extra and You need to leave deposit to get token to be able to use it. Internet connection was good and fast. Also the staff was friendly. I could recommend this for budget travellers, but this does not meet criterias for business travellers. Anyhow this was the best option available since I was visiting Barcelona during Mobile World Congress.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oulu, Finland", "Title": "“Nice hotel on Ramblas”", "Author": "ExpTravellerOulu", "ReviewID": "UR126035385", "Content": "The location is great on Ramblas. It means that all the rooms on that side are pretty noisy , but on the other hand they have a nice view to Ramblas. It seems that some of the rooms have been removated (I believe upper floors: at least floors 6 and 7 were nicely renovated, whereas a room in 2nd floor was worn). The rooms were clean, but pretty basic. The breakfast was reasonably good for Spain. We were told it starts at 8, but it was available already 7:30). The staff was friendly.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "norway", "Title": "“Friendly hotel and good service”", "Author": "ingliab", "ReviewID": "UR125513925", "Content": "We had a 2 rooms with connecting door on 4 th floor with a balcony and a view to the Ramblas. Everything was quite OK except a strange smell in the bathroom and a noisy water pump (?). Free Wifi and heating in the room. Our children enjoyed the Wifi as they both had brought their PC. Good breakfast with cava as well. We enjoyed the stay. Extremly good service on email with Monica to ensure a nice room.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wiltshire", "Title": "“great location - OK inside.”", "Author": "tiggypad9", "ReviewID": "UR124959071", "Content": "The hotel is right on The Ramblas so easy to walk to all places of interest. Room was on the top (9th) floor so great views across skyline but room was very basic with no tea and coffee making facitlites. As we were on a hen weekend, this would have been very handy when we woke up in the mornings! There is also no bar at the hotel. Breakfast was very good and plentiful - both full English and continental style. Also make sure you only have 4 people in the lift, otherwise a very grumpy Spanish chap has to get you out! The front of the hotel is lovely with the pretty mosaic tiles set into the facade. There is a left luggage room which came in very handy as our flight was later in the day. All in all an ok place to stay for adults on a short trip.", "Date": "February 21, 2012"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Toulouse", "Title": "“Unsuitable for business people”", "Author": "Greenfly", "ReviewID": "UR124724992", "Content": "The best things about this hotel are its location & charming facade. Do not be fooled by the latter. The first bedroom I was offered reeked of some kind of throat-choking chemical, perhaps an air-'freshener', but equally possibly - given the dead cockroach in the bathroom - insecticide. It didn't have a proper window for ventilation, just something that opened on to a small and airless shaft. The second room also had a smell, but less overpowering than the first. It, too, had no 'window', just a sliding pane that opened onto another shaft, this one without any daylight. The rooms are noisy because ill-fitting doors allow through any sound from the corridor (let alone the two nights I experienced of what appeared to be a screeching hen-party rushing up and down util the small hours). The rooms were clean, the bathroom large (but without hot water on the second morning). Based on reviewers' warnings, I did not try the breakfast (there are excellent places nearby, especially those close to the wonderful and unmissable) market. Despite other reviews claiming that the rooms are equipped with tea/coffee-making facilities, neither of my two rooms had these. The free WIFI works well in the rooms, but finding an electrical plug may require shifting the furniture around. The reception staff were friendly, except for a shrill and brusque manageress who appeared to have graduated from Fawlty Towers. This is a place definitely best avoided by all except the least discerning traveller.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "", "Title": "“not bad but going downhill”", "Author": "Petefeet33", "ReviewID": "UR124406406", "Content": "we've stayed here twice before and this hotel seems to be on the downward slope. our room 601 had no minibar and no tea/coffee making facilities. the bar on the ground floor was not open and only a drinks machine was available. And this is supposed to be a 3 star hotel? we skipped breakfast and ate out - the location means that you're not short of places to go. in short, unless you're desperate, I'd try elsewhere. Barcelona is a big place with plenty of choice and it's not worth chancing this hotel right now.. sorry", "Date": "February 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Nicosia, Cyprus", "Title": "“Only good thing about the hotel was its location”", "Author": "leo2005", "ReviewID": "UR121701841", "Content": "I have two positive things to say about this hotel. First it was situated between two metro stations in Ramblas Avenue which is the most popular place for pickpockets and the other free wi-fi. The reception staff not bad either. The worst breakfast i have ever had at a hotel. The decoration of the rooms could be dated since the soviet era. Hot water in the shower was not always available. The bathroom was larger than the room! Every night from 2 to 5 there were a group of russians, i think, who made too much noise which was impossible to sleep.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glos", "Title": "“Did exactly as we wanted!”", "Author": "laurzGlos", "ReviewID": "UR120674910", "Content": "Stayed here as a group of 17 on a hen party (15 between 24 - 30, 2 of us over 50!) and it was ideal. Superb location. Had read reviews and asked for twin room at front for mother of bride and me (mother of groom). Superb room with balcony overlooking Ramblas. Went to several of the other rooms. Rooms at front definitley better than rooms at back. All rooms were clean. Basic breakfast, but that was fine for the price of our stay here.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Leuven, Belgium", "Title": "“Poor hotel (only good thing: its location)”", "Author": "roxycar", "ReviewID": "UR120579341", "Content": "My husband and I just came back from Barcelona. We loved the city and enjoyed our trip. However, we did not like our hotel at all. Why? * Our room had no window. OK, it had something which looked like a window, but which viewed a dark and closed lift shaft. There was no daylight in our room (never!) and no fresh air at all! * It was extremely hot in the room and the airco did not work properly. The airco was very noisy, but we could not turn it off at night as it would even get hotter in the room. * The room was not very clean. The person who stayed in our room clearly had short dark hair (which we found in the sink, the badtub etc). * The breakfast was really poor and some of the products were totally articifial (powder which became juice/eggs etc.). The choice of bread was ok. The only good thing about this hotel is its location.", "Date": "November 14, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Expat", "Title": "“A Good Choice For the Budget Minded”", "Author": "DandKOntheroadagain", "ReviewID": "UR120193598", "Content": "We stayed here during the November long-weekend, when Barcelona seemed quite hectic. Huge crowds everywhere, and the hotel was at capacity. However the staff coped well with our requests and questions. We welcomed the double bed,as opposed to our previous night in 2 twins pushed together. Our room was on the 9th floor, and had delightful views of Montjuic around to the sea. The room size was adequate, as was the bathroom. The hallway carpets looked worn, although they were better in the rooms. Breakfast was a busy time, but the staff quickly and discretely changed table papers (not linens as in a 5 star hotel). There was an adequate choice of both hot and cold foods, although the eggs were powdered and disgusting. I would advise staying here if you want a budget priced hotel right in the action of The Ramblas, and close to the metro trains. In fact, it's location is within easy walking distance of the port area as well, so you really don't need the metro unless you're heading further afield. And with that in mind, I'd suggest taking the Aerobus from the airport, which arrives at Plaza Catalunya, rather than the metro, which entails changing terminals, stations and several waits.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sulphur, Louisiana", "Title": "“Enjoyed our Stay”", "Author": "teebee777", "ReviewID": "UR119792709", "Content": "Stayed four nights and enjoyed the hotel, the staff, and the location. We reserved 7 rooms for 14 people. We were all well satisfied. There was one problem with one room and the couple was moved to a new room the day of check in. The staff was pleasant and helpful. The location was ideal to catch the subway, and the hop on and off tour bus. The breakfast was plentiful and the food was good with several selections. There are many restaurants in the area. My room was located at the front of the hotel facing the street. If the windows were closed there was no noise from the street. I really don't understand other reviews of this hotel that have been negative.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ormskirk, United Kingdom", "Title": "“Good value.”", "Author": "ELAMARBAR", "ReviewID": "UR119392276", "Content": "The hotel was clean, comfy, very central, breakfast was good, views over Barcelona WOW!", "Date": "October 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Gloucester, United Kingdom", "Title": "“Perfect Location”", "Author": "HanHoliday", "ReviewID": "UR119335622", "Content": "After reading some of the reviews on trip advisor we were a bit worried about staying in this hotel, but on arrival we were pleasantly surprised. I would definately recommend a room on the front of the hotel as they have a great view. The rooms were adequate and clean, the location is perfect and we found the staff friendly and helpful. The breakfast was good and for a basic hotel in the heart of barcelona i would definately recommend this hotel", "Date": "October 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Good location but poor value for money”", "Author": "RRYorkshire", "ReviewID": "UR117624870", "Content": "Stayed for 3 nights at the end of August. Located 3/4 down La Rambla from Plaza Catalunya. Room and bathroom were spacious enough and clean but frosted windows and curtains hid a view of an internal airwell but this did mean that traffic noise was low. Breakfast was not worth the money with both coffee and fruit juice dispensed from vending machines - you could eat better and for cheaper at the local market or a cafe. Small reception staffed by one person who were sometimes surly and inconvenienced if you asked directions.", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5"}, "AuthorLocation": "Uxbridge, Canada", "Title": "“We'd come back”", "Author": "Carol984010", "ReviewID": "UR115582012", "Content": "Nice hotel, very close to harbour (500 yards), although depending on the cruise ship, you might have to take a taxi to it (we did). Open air art stands on the boulevard in front of it. Great breakfast; front desk staff was helpful with directions. It's on the main drag - not sure how safe I'd feel wandering the area at night, although lots of people were out when we arrived about 11 p.m.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good location but disappointing hotel”", "Author": "harmsworth", "ReviewID": "UR115493049", "Content": "Hotel looks great from the outside but our room was at the back and whilst quiet looked into a wall and at a washing line - not a great view. Room was large - as was the bathroom, and clean. Breakfast potentially good but they kept on running out of stuff and sometimes we had to wait for a table. Generally the staff were not very friendly. I appreciate that it is a big tourist hotel, full of groups and people snatching a long weekend or a winter break, but the week before we had been in Florence in a similar hotel and they could not do enough for us. Here we had to queue at reception and staff disinterested in dealing with queries. I had some papers sent out to me by my office and had to pay an extortionate amount to have them printed for my signature and pdf'd back. They really did not want to know. alos lifts were inadequate so taht we usually ran down the stairs to breakfast - five flights from memory.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "ireland", "Title": "“don't look out your window if staying in the back of de hotel”", "Author": "cathIreland", "ReviewID": "UR115328642", "Content": "stayed in this hotel for one night before headiing for a cruise,its basic clean ,no frills,location perfect we got this very cheap for a family of four but when i pulled my curtains it was looking in to a slum not very nice . would i stay here again? no i'd pay a bit extra for a bit of comfort and style", "Date": "July 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bragança Paulista", "Title": "“Worst experience in years”", "Author": "Oldiemeister", "ReviewID": "UR110535614", "Content": "To attend an International trade show I initially tried to book the Rivoli Ramblas, but it was completely booked, so I decided, unfortunately, to try the Ramblas Hotel. This establishment should not have any stars at all or only for the location at La Rambla. When I arrived I was surprised to learn that I had to pay the whole stay in advance and that they would not need any credit card, as the hotel did not allow the charging of food or beverages to the room. Everything had to be paid up front. There was no luggage service either, which was difficult for me, as I arrived a little under the weather and had problems getting my heavy bags through the maze of corridors on the 9th floor. The view from the terrace of my room was and surely is still amazing and made me forget the arrival surprises. This is, however, only a benefit if you are staying in of 2 rooms on the 9th floor, possibly also on the 8th. The room itself was reasonably clean and comfortable. Later, I met with some colleagues, who had fortunately checked into far better hotels, on my terrace, overlooking the skyline of Barcelona. We had a couple of drinks, all of which we had to get ourselves, as the hotel does not offer any room service. Btw: The remains of this get-together were left on the terrace until my departure 3 days later. This, however, was in line with the general cleaning policy of the hotel. They only changed towels (pretty old ones, I should add...) and made the bed, no further clean-up was done (I intentionally left some garbage at the end of the bath tub...it was never removed). The breakfast buffet reminded me of a students hostal, very few selections, and again no service is offered, you even have to get your own forks and knives. Of course, there was no late check-out available on the day of my departure, although I even offered to pay for a day room...the only solution offered was a luggage storage room at the 1st floor. Again, no help was offered by anyone. They just give you the key and tell you where it is, no receipt or other document is issued. This only key is apparently given to anyone, who asks for it, because, when I returned to the hotel some 6 hours later, a different receptionist just handed me the key without even inquiring for a passport or any other document. Fortunately noting was missing. The overall experience was definitely the worst I had in years. The same week, I had stayed a couple of nights in a small hotel in Germany, at half the price of the Ramblas Hotel, where they bent over backwards to please their guests, including eggs made to order and smoked salmon at breakfast. Conclusion: Avoid this hotel at all cost!!", "Date": "May 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Cheshire", "Title": "“Terrible hotel - shortest stay ever!”", "Author": "chrissie21uk", "ReviewID": "UR103373223", "Content": "We had originally visited Barcelona 11 days previously staying for one night pre cruise. We were staying at the Ramblas as the Rialto Hotel we had originally booked with was having alterations and there was no room pre cruise but were told the alterations would be finished when we came back. We were not happy to find this not so but didn't have a choice and were sent by taxi to the Hotel Ramblas which was in a good position but on the noisy Ramblas street. The reception area was small and the hotel looked very shabby. Tables with marble tops in the Reception area were cracked and broken. We were allocated rooms 406 and 407. The elevator was extremely small and rickety and when we reached the rooms we found floor to ceiling curtains behind which were french windows leading to what looked like a disused lift shaft. There was no window in the room which was badly decorated and shabby. It was difficult to get around the bottom of the beds to the bathroom. The room itself was a horrendous fire risk and if there was a fire we would have had no chance at all getting out. We rang down to reception to say it was not acceptable and they were less than helpful saying they had no other room available. We eventually got them to ring our original hotel - the Rialto - but told us that if we went back we could only have an interior room. We decided to go back anyway to sort it out and, miraculously, the original hotel found two rooms available with windows. We were annoyed that we had spent over two hours of our precious time going from one hotel to another and would certainly never consider booking at either of them again.", "Date": "April 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Orimattila, Finland", "Title": "“Superb location - great view”", "Author": "Turmanow", "ReviewID": "UR102859305", "Content": "Great location and magnificent view from the 9th floor. Spacious room in basic condition with a huge balcony. Basic but sufficient breakfast. Negative issues? wall-to-wall carpet not that clean and quite smelly. Well - what else can you expect from a carpet like that?", "Date": "April 5, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Izegem, Belgium", "Title": "“Great location. Terrible hotel”", "Author": "Fre_Fred", "ReviewID": "UR101266560", "Content": "The only thing good about this hotel must be its location. It's on the Ramblas, right in the center of everything you want in Barcelona. I booked 3 rooms. The first one didn't have windows. There was one window, but it opened onto a dark airshafft. Not a bit of daylight entered the room. The second one had an unbearable smell. Something must be wrong with the drains. Thank god that one did have windows so we could open them for some fresh air . The thrid room was \"okay\" All the rooms were very dirty, take a look at the picture of the toilet bowl ... The 20 year old TV didn't work so I decided to check if it was plugged in okay. The TV nearly fell onto my head. They arranged the cables of the TV in such a manner that the TV doesn't fall of the stand. The power cable was the only thing keeping the TV in place. Clearly not very safe !! Breakfast was very poor. The breakfast room was very crowded. There were too few glasses and plates so we had to wait for the staff to wash them when some other guests were done. The buffet was also very very limited. We only had breakfast there once because it was that bad !! The staff was not entirely unfriendly but they weren't all that great too. As hotel guests we were even declined to have some drinks on their terrace because it was \" too late \". It was 23.00 !!! Everything you wanted the staff to do for you seemed like a hassle for them. Barcelona is fabulous place and there are plenty of hotels to chose from. Don't pick this one !!", "Date": "March 23, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Horsham", "Title": "“Good location but find another hotel”", "Author": "horshamsussex", "ReviewID": "UR91126153", "Content": "Good location on Las Ramblas. Room was big with large bathroom but furnishing poor. No hot water the day we were leaving meaning we couldn't shower before our flight. Many hotels in the area so find another.", "Date": "December 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "New Zealand", "Title": "“Good location but poor value for money”", "Author": "PhoenixBloom", "ReviewID": "UR85111399", "Content": "From memory (we booked several months in advance) this hotel had good reviews so we booked it. We did not find this hotel to be very good in terms of quality and service for the price paid compared to other European cities. Breakfast was included in the price as it was in many of the other hotels we stayed at elsewhere in Europe. Breakfast was pretty awful, the staff serving we grumpy and not very friendly, food would run out and slow to be replaced or if there was enough it was kept warm but often seemed overcooked. We had asked for a room looking out on the Ramblas and appreciate that they may not be available but instead our room (with balcony) looked out to the back of rundown apartments, I did not feel comfortable or secure.", "Date": "October 28, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "perth, Australia", "Title": "“Good location, but thats about all its got going for it.”", "Author": "maxico", "ReviewID": "UR84722497", "Content": "Stayed for two days pre cruise.It is just a very basic, budget hotel.The biggest problem was the stench from the drains filled the whole room. I had to keep the plugs in the bath and basin and buy an air freshener to stop it.We also had a sliding door opening to an air shaft( not good for kids).The room was clean and had a safe and fridge. Air conditioning was good and the water was hot.The lifts are small and busy so you may have to wait for a while now and again.The hot breakfast was cold, you would be better to stick with a cold selection or eat elsewhere.There is a store room available for luggage if you have to check out before you are picked up.Overall I probably would not stay there again, but I have stayed in worse", "Date": "October 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "wisconsin", "Title": "“Yikes!”", "Author": "catsywi", "ReviewID": "UR84535041", "Content": "Great location, terrible room. We were stuck in a room with a window that opened up on a closed air shaft....I felt as though we were sleeping in a closet. People at the desk weren't very helpful - actually seemed to be annoyed that we had questions about our transfers to the airport...\"We don't do transport - know nothing.\" Would not want to go back to this hotel in spite of its location on La Rambla.", "Date": "October 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Stoke-on-Trent, United Kingdom", "Title": "“try it-no frills”", "Author": "Levi040797", "ReviewID": "UR71360291", "Content": "we stayed at the Ramblas for 3 days in march and guessed it would be quite basic. But the staff were great, the room could've done with an update but it was clean, warm and plenty of hot water for baths/showers - great when on the first day it snowed!! Breakfast was fine ,again plenty to go at! the only downside was that because of the time of year the restuarant/bar wasn't open so we had to eat elsewhere of an evening. The biggest disappointment of our time there was down to the fact that we had booked transfer from the airport with W.A.T....DON'T they never collected us,and we had to get the bus to the hotel in a major downpour! and on return the taxi driver they sent wouldn't accept our voucher for pre-payment they;d issued us with! We were finally re-imbursed on our credit card 3mths later because we reported them to our bank! So don't bother just use the Aerobus it's sooo easy!", "Date": "July 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Warsaw", "Title": "“Perfect for a not-too-long stay in Barcelona”", "Author": "Non-Jetsetter", "ReviewID": "UR62963945", "Content": "A reasonable hotel in terms of price and comfort, though nothing exceptinal. Perfect location on the Ramblas. Only major problem was the lifts, there were often queues of guests waiting to use two tiny lifts (even tinier when one squeezed all one's luggage inside), so we preferred to take the stairs to the fifth floor.- at least we had some exercise. Finding the breakfast room was also not easy on the first morning , it was tucked away behind what seemed to be a banqueting room for special occasions but was actually the hotel cafe, still closed for the winter season. Friendly, helpful multilingual staff. None of the smells other contributors here have complained about - perhaps it wasn't the right time of the year? All in all, a reasonable hotel.", "Date": "May 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“Heart of the action”", "Author": "NorthParker", "ReviewID": "UR61638805", "Content": "We wanted to be in the heart of Las Ramblas and this small, older hotel fit the bill; not luxurious, but close to everything, including metro; hold out for a top floor with balcony. Staff was genial and helpful with city details and tips on where to go; I found it cozy and perfect for what I expected a small Euro hotel to be. Big tip: Don't eat there, free breakfast was uninspired and the hotel's sidewalk cafe awful. But with the Plaza Real just up the block along with the Mercado--who needs hotel food. Our 8th floor room with balcony gave us a gorgeous view of the city facing northeast, Perfect base to explore the city. If you don't enjoy sounds of the city--no hotel on Ramblas is for you.", "Date": "April 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Norfolk England", "Title": "“Quaint old hotel in the middle of the famous Ramblas, Barcelona”", "Author": "carlyle24", "ReviewID": "UR58752947", "Content": "Having just spent a wonderful weekend at this hotel, I thought others would like to know of our views. The staff are just great and put themselves out on our behalf and could not have been more helpful. The hotels positioning could not have been better. Right on the main street, about 2 thirds of the way down. Rooms are a good size and very clean, as is all of the place. Breakfast was plentiful with a good selection to choose from We only had one problem, and that was on our arrivel late in the afternoon, when being shown to our room we discovered it was an internal room with no window and the heating system was running on the warm side. We requested a change of room but was informed that there was not one available until the following day. With no hesitation we were promised a new room the next day. Our new room was just the best ! So all I would say is that make sure you request a room with a window. Oh! yes & the bar does not open until April.", "Date": "March 16, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Mumbai", "Title": "“the only disappointment in the trip”", "Author": "greeengirl", "ReviewID": "UR57229566", "Content": "Barcelona is Heaven... and once you go there, trust me you will not want to leave... the food, the people, gaudi, the sangrias, the summer sun! but the hotel - a total disaster... truly the only disappointing part of the trip. The rooms are really smelly and stuffy, they had an odd smell that of monsoon moss! The twin sharing room, had the beds stuck together, as the rooms very very tiny... the bathroom, was not well equipped, the towels were as thought they had been used for years! We had breakfast included in our room rate, which we had one morning, and was very poor. There was juice, meat and bread! no cheese, on eggs... really not worth giving up a holiday meal for this... the one saving grace was that the hotel was off the ramblas, and for those interested in very touristy things... a great location, but having said that... they are hotels there a dime a dozen.... definitely not worth my money... as for that money, other European countries, offer way better rooms!", "Date": "February 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Israel", "Title": "“Good hotel in great location”", "Author": "wshalev", "ReviewID": "UR56880757", "Content": "This hotel was reserved by my company for our participation at the Mobile World Congress, and after reading the previous reviews, I expected the worst. There must have been some changes here recently because the opposite was true. After leaving the taxi at the wrong address (hotel with a similar name about 100M away) the reception clerk was efficient and friendly (later also helped with directions and restaurant reservations) and I got a room on the top floor - fantastic view over the city of the Montjuic and port from the huge terrace complete with table and chairs. The room itself was spacious, fresh, the bed was comfortable, heating worked well and the bathroom large and recently renovated. Free wireless internet on every floor. While the furnishings are very basic, and the hotel has no real lobby or other frills, the overall value and quality of service were quite good. My colleagues that stayed on other floors had no issues as well. The breakfast was ample, but nothing special, and the location can't be beat- right opposite the Gothic quarter and walking distance to Placa Catalunya with 3 metro stops and 10 min. to the fair area (Placa Espanya).", "Date": "February 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Norfolk", "Title": "“Disappointing to say the least!!!”", "Author": "SamH-W", "ReviewID": "UR55633297", "Content": "When we arrived at the hotel, the reception area was dirty and was full of staff members congregating at the reception desk making it very difficult to check in. We were finally directed to our rooms and found that it wasn't even ready due to the lack of cleaning staff available. We therefore had to leave our belongings in a check out room and have a wander around the local area for 2 hours. Once the room was ready we were disgusted to find that the facilities were more like a 1* hostel rather than a 3* hotel. The bathroom was not adequate for a 6 person room. The bedroom itself overlooked the busy streets below and was very noisy - this became even worse in the evening!!! The beds were not made properly and looked like the bedding was more than 20years old - they smelt like stale tobacco and musty. The beds themselves were very uncomfortable - I would have found more comfort sleeping in a tent. We did ask to be moved to another room, but this was declined by management, who to be honest were more interested in organising their social life than helping their paying customers. After a dreadful nights sleep we were all looking forward to sitting down to a full cooked breakfast, but were advised this was not included in the price of the room, and would cost a further 15 euros - after looking at the breakfasts being served to other residents we all made a joint decision to wait until we arrived at the airport to eat. Overall a very disappointing and uncomfortable stay - I wouldn't even recommend this hotel to a family of rats!!!!", "Date": "February 10, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Southport", "Title": "“This hotel stinks.....literally!”", "Author": "SagaBoy13", "ReviewID": "UR51266013", "Content": "Stayed here with a group of friends for a weekend in September. Seems we had the same room as Sanfernando21 as we were almost overcome by a vile stench when we opened the door to our room (501, incidentally). The standard of the room itself was bad enough but the smell was quite disgusting. It was so bad that we couldn't even tell exactly where it was coming from - the bathroom, ancient air conditionong unit or what seemed to be an internal ventilation shaft, which was the only other opening access apart from the door -there were no external windows. Complained to Reception who were clearly aware of the problem and offered to move us to a different hotel! Not really viable in a group of 14 females at 10.30pm. When we said we wanted to make an official complaint, were handed a form to be completed and returned to both the hotel and the Local Administration Authority. The email address on the form was unobtainable so spent some time finding correct one. The hotel sent us a very snotty email and said there was nothing wrong with the room and they had not had any other complaints - oh really? After 3 months of dialogue with the Authorities (Tourism and Health) have finally been told our only redress is to go to court as the hotel refuse to make any refund ,claiming there was no problem. Good to know the Spanish Authorities are so supportive of the tourist trade. In any event, strongly advise you avoid this hotel unless you are smell-impaired!", "Date": "December 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Walsall", "Title": "“Excellent Location”", "Author": "Rhisibabe", "ReviewID": "UR42872402", "Content": "We stayed in Hotel Ramblas for 2 nights prior to joining a cruise ship. The location was perfect as we travelled everywhere by metro and the hotel is between 2 metro stations. We had requested a quad room, but the room had enough beds for 5 and was huge. The window looked out onto a quadrangle full of rubbish so we kept the curtains shut most of the time. The breakfast was nothing to write home about, but it filled us up in the morning. The staff were helpful. The reception and bar were small but there was an area outside where you could have a drink and something to eat. Overall this was just somewhere to lay our heads inbetween sightseeing and this hotel suited us perfectly.", "Date": "September 19, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Buenos Airies", "Title": "“Unbelievably BAD!! - choose another hotel on La Rambla!!”", "Author": "chuggerdogbug", "ReviewID": "UR40010232", "Content": "STAY AWAY FROM THIS HOTEL!!! The room we had was apparently they're best! Listen to this.... the air-conditioning was not working and it was sweltering heat... I actually slept outside on the veranda because it was cooler! We had a shower... the nozzle of the shower head fell off. After stepping out of the shower we walked on the bedroom carpet... we discovered our feet were covered in black stain from the carpet! One of the bed lamps did not work. There is no iron or ironing board. To have someone deliver ice to the room was too much trouble. The phone was only working intermittently. Very frustrating. To top it all off the guy at the hotel front desk was rude, arrogant and had an attitude right from check in. I brought these issues to the attention of the front desk but basically it was... \"all we do is complain... I am not your servant... etc etc.\" He should not be in the service industry... especially not on the front line! He had a broken hand and fingers... it's not a stretch of the imagination to assume that another disgruntled hotel guest may have given it to him. This hotel is in a great location but there are many many other hotels on La Rambla that are deserving of your hard earned dollars. STAY ON LA RAMBLA FOR SURE BUT STAY ELSEWHERE!!", "Date": "September 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "b", "Title": "“very good location; good value for the money”", "Author": "radubm", "ReviewID": "UR39541823", "Content": "We spent one week in Hotel Ramblas Barcelona, by the beginning of August. Location: - The hotel is located right on Rambla, between Liceu and Drasanes metro station. - About 10 minutes walking from Mare-Magnum (the Aquarium), and 25-30 minutes walking from Barceloneta beach -> which led to us spending 2 mornings there, on the beach, as it was so conveniently close. - 5 minutes walking to Boqueria, 15 to Placa Catalunya - 10 minutes walking from the funicular to Montjuic - Palau Guell right behind the hotel, Placa Reial is on the other side of the street; the Cathedral, Generalidad, Palau de la Musica Catalana and a lot of other tourist attractions - all in less than 30 minutes walking from the hotel - several non-stop mini-markets on the street next to the hotel Room: - clean - size was ok for 2 people; never felt the need of more space in the room or in the wardrobe - the bathroom was pretty big, with a window to outside -> no problems with humidity - mini-fridge, tv with a bad selection of programs (didnt watch it, anyway) - safe, but against a fee :( ; didnt pay it, didnt use it - A/C ok - our room was located on the 8th floor, and we had a terrace that was actually bigger than the rooms itself ! (around 17 sqm, from my measurements...). The view was spectacular: the sea and the port (with the big touristic-ships) on the left, Montjuic in front, and Tibidabo on the right. Palau Guell was right in front of our rooms, and we had a perfect view over it's roof and it's beautiful chimneys. Our friends' room was located on the other side of the hotel, also with a very big terrace; they were watching the entire Rambla, the sea on the right side and a splendid view over Bari Gotic right in front. - WLAN everywhere, very good ! Breakfast: - very good Services: - apparently they were not changing the towels every day (although they were cleaning the room!), which was unexpected for a 3* rated hotel; - personnel at reception quite polite and helpful, when asked for directions or other information", "Date": "September 2, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Essex, England", "Title": "“Hotel Rambles - Barcelona”", "Author": "Tysonator", "ReviewID": "UR37177481", "Content": "This trip was meant to be a great get away city break. We flew with Ryan Air, which was OK and you pay for what you get with them. Just remember that the hand luggage must fit in the cradles station at check in desk or at the departure gates. As some times they do ask you to put your hand luggage in ! ! We flew into Girona and got the coach from the airport to Nord Bus Station in Barcelona. Note you have to buy your tickets for the bus in the airport NOT on the bus and the timetable can be downloaded off the internet We had booked to stay at Rialto Hotel in Carren Farren, Gothic quarter, Barcelona. The Internet booking company ‘Bookinhotels.com’ had cancelled our reservation the day before we were due to fly out. I could not contact them on the telephone numbers supplied on their web site, and I e mailed them that day I received their cancellation e mail. I had to wait 9-10 days after this e mail before I received a refund. Then I had to e mail and phone them for 2 days before I got passed the automated telephone system, and they Head Office was based in Istanbul ! Please be careful when booking with this company, always arrange accommodation directly with the hotel ! On arrival at the Rialto Hotel they no reservation for us and the reception staff could only get us in at the ‘Rambles Hotel in the Main Rambles street, at €110.00 per night ! This was double what we had original paid at the Rialto via bookinhotels.com ! This period was one of the most busiest times for hotels in Barcelona, so we were lucky to get 3 nights in a hotel in the Gothic quarter ! ! On arrival at the Rambles Hotel our first impression was not great, as the reception was cramp and all the paper work and PC monitor + cables on view ! We had to pass through some additional security to get the hotel lifts which was reassuring. The room was airy, some what spacious, and clean. The view from the window off the rear of some apartments that look like they belonged in a slum ! The breakfast was from 7.30am till 10am, so reasonable times. The breakfast buffet offered the usual array of continental dishes. Though the layout of the food and cutlery was not logical at all ! The system with the breakfast coupons meant that you have to put them in a box without anyone checking was amazingly strange, as they did not have any details on who you were or room numbers ! ! The lunch and evening menu was reasonably priced and competitive with other restaurants in the Rambles street. The bar is expensive as a large larger was €6.00 ! There some bars that have happy hours and you can take advantage of this, other wise drinking out in this part of Barcelona can be expensive. There is lots to do in Barcelona and my recommendation is to buy a 2 day pass on the open top red Tourist Buses. This works out a lot cheaper than buying a daily pass, plus you get a booklet of vouchers to use around attractions and food outlets in Barcelona. We saved a lot of money, especially on food. As we found Barcelona very expensive especially now the pounds is so weak", "Date": "August 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Location": "1", "Rooms": "2"}, "AuthorLocation": "SOUTH WALES", "Title": "“room accesories are lies and where did the s/pool come from?”", "Author": "WELSHMAN1948", "ReviewID": "UR34811539", "Content": "stayed in this hotel with a mate,no mini bar just a broken fridge same for my mate, spanish tv only,no coffee or tea tray etc,and cerainly no room to walk around the bed let alone swing a cat.,Both our windows opened out into a walled area almost dark day and night,i had the bigger room and had to climb over a second bed to get to the bathroom as the gap to the wall was about 15\" ,not really a 3 star hotel ,old very run down chunks of marble stair treads missing in fact dangerous for anyone to walk, let alone elderly or children especially down the steps in to the breakfast room where everyone walks first thing in the morning.The breakfast was both hot and cold continental food and hot english food .Firstly the hot quasants were freshly cooked and served to the buffet area and that's where it ended,all the english food were terrible bacon (small fatty scraps),scrambled eggs floating in water,some type of mini sausages cut in half no taste,watered down baked beans and cold hard boiled eggs&tomatoes ,the latter i suspect were part of the cold buffet ,all the bread for toasting was stale and the toaster took for ever i gave up after waiting 20mins to do 1 side only but the rolls were fresh so it was continental for me although i dont like that type of thing.The cerials were stale also,all coffee,tea etc were from a machine and consintrated,cold juices machine served watered down juice equally terible tasting,nothing like the hot and cold drinks served in the ouside pavement cafe belonging to the hotel where prices like all the rest of la ramblas was triple normal barcelona prices away from ramblas and twice the price of Catalonya square cafes.The room maids and all other staff i must say were 5 star in help and room cleanliness also service desk staff the same helpfull and 5 star people,the hotel i would rate a a 2 star hostel for what you got for your £69/night .BEWARE OF THIS PART OF LA RAMBLAS BY NIGHTFALL prostitutes outside hotel door and this end of the street is full of guys selling ilegally beer cans and other things! pickpockets galore ,beggars and theives. Lower Ramblas after dark is a no go area once the street traders and entertainers are gone. I would go back to Barcelona but stay in Gracia or gothic areas La ramblas is a half or 1 day thing to see all whats good about it, and get from there before night fall or stay at the top end by Catalonya square if you want to pay double for everything or La Ramblass if you want to pay treble. TIP-10 to 15 mins from La Ramblas in the bars a 3 course meal with wine,coffee & brandy to finish from 7 to 12 euros,we had a meal in a LA RAMBLAS popular bar/resturant i had a childs size spagetti bolognase,my mate 4 bowls of tapas which would have made a small starter with a couple of meat balls on top, the usal bowl of dry french loaf six small slices with two mini pats of butter!! a small beer each not a bit of anything else not even a salad bowl, we ate it treated it as a disapointing starter and decided to eat elsewhere later,(the spag/bol was smothered in grated cheese to hide the fact it had hardly any meat in it,and the sauce was simular to the hotels watered down baked bean juice ) the waiter brought the bill 49euros and told us it didn't include service charge i.e. tips,so we paid him the 49 euros, told him it was not very good food and we left still hungry and thirsty.we looked around more La Ramblas resturant annd found them all to be the same so we went 10 minutes down some side streets off Ramblas and found all these bars serving the set menus what a treat after that rip off ,live and learn i say. Sorry Ramblas hotel staff you are 5 star people working in a bad hotel envirioment and area of the street, you all deserve better.", "Date": "July 15, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "SOUTH WALES", "Title": "“Ramblas Hotel Barcelonia 33, La Ramblas”", "Author": "WELSHMAN1948", "ReviewID": "UR34310245", "Content": "having stayed in the hotel 6th and 7th July 2009 i can say you don't get what you book on their website or at least myself and a mate didn't. Walking from Plaza Catalonya Square,was a busttling delight with all it's street vendors,artists & human statues etc. and hotel open air cafe/bar/bistro's on the central area all the way down the la Ramblas street,it was 12.30 midday and we arrived straight from the airport by a/port bus direct for 4.30 euros,stoping for a cool drink on the way paying our 11 euros for both the half litre of beer we drank we finally made it to the hotel.The reception and all staff over the 2 nights 3 days were polite ,helpfull and booking in and out was easy. The maid service and breakfast room/bar staff also the same the rooms were supposed to have balcany's and mini bars they were single rooms with windows opening to a darkly lit shaft type area at the back of the hotel,the minibars were broken empty fridges and the satilite tv's were spanish chanels only and no tea or coffee facilities as stated on the write up,clean small basic rooms with a clean bathroom and facilities towels,soap, shampoo etc,my twin room ihad to climb over a bed to get to the bathroom as the gap was less than 400mm to the wall, my mate only had 1 bed in his room with about 300mm spare to walk around and yes a broken fridge and no tea or cofee facilities. Apart from the pavement openair bar as all the other hotels serving average to good food and drink, that is where it ended.Breakfast was a nice continental choice but products varied in quality meat and cheese also tinned peaches,boiled eggs & tomatoesetc and quasants of 3 or 4 varietys looked ok, all the cooked engish food were floating in water,poor quality and the bread and cerieals were stale, the toast machine i gave up on after 30 mins and still waiting i settled for quasant watered beans,scrappes of fatty bacon and half slices of ? anyway i gave up and ate out in a cafe up the road as also their drinks were out of a cold juice machine and hot tea coffee or chocolate machine either hot or cold were poor standard watered down concentrated stuff,entrances and comunial areas had cracked or damaged tiles,pieces broken away on some steps and the breakfast room reminded me of a london hostel with white table cloths.The breakfast up the street was a delite a full english for 7 euros with coffee.After several hours and talking to some others it was plain to see La Ramblas and its imediate side streets had prices twice more expensive than Plaza Catalanya bars and 3 time more expensive than the rest of Barcelonia a 10 15 minute walk out of the area,or eat as the knowlegable people do plenty of fresh takeaway baggettes,tapas and roll shops along the side streets 1min from ramblas and buy a hot or cod drink sit in the square and enjoy or do as we did and pay 49 euros for a spag bolanase and half litre of beer each accompanied by the famous ramblas wooden bowl of stale dry french bread with 1 pat of butter each which buttered 2 little slices each. After dark the lower half of ramblers and its imediate side streets changes the humon statues and street vendors leave and their places are taken by pickpockets ,muggers,prostitutes and guys trying to sell you cheap cans of beer ilegally all dojing the many police on scooters who don't care anyway,whilst being verbaly abused by one of these so called ladies and a guy trying to sell me beer a policeman pulled up got off the bike went to the litter bin next to me and picked up the beer the seller had left there for him placed it in his back box on the bike smiled at me and drove off. For those people like myself stay in the gothic area or gracia area 10 to 15 minutes from Ramblers and visit there by day it's worth it and the gothic square cafes/bars are realy good or even further out the buses run to ramblers every 3 or 4 minutes from all the main roads. Don't do what i did pay £65 a night for a gloryfied hostel full of youngsters stay 4 star plus in the mentioned areas and save on your eating and drinking at least 60% ramblas and plaza catalonya can be visited thats what i will do next time,it's cheaper,safer and more enjoyable tust me i'm an easy going person well travelled but today i nurse a sore kneck from looking over my shoulder every night. p.s. a 3 coures meal with wine ,brandy &coffee after and \"\"freshbread \" cost 7 to 12 euros a head in the other areas 15 minutes walk from Ramblers enjoy yes i'm going back but staying in Gracia area or gothic \"ole\" sorry all staff of hotel ramblers you were all 5 star people.but it is 30 years overdue for a refurbishment and a visiting person to write the write up of what you get which is not 3 star facilities", "Date": "July 9, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Zurich", "Title": "“Centrally located, but don't go there”", "Author": "CH_inTheWorld", "ReviewID": "UR28380970", "Content": "We just spent 4 days in the \"Ramblas\" which we had selected for its central location, which turned out to be its one positive attribute. The room was a cell without daylight, the window just offered a view to a concrete wall less than a meter away, the carpet was torn, there was airconditioning but no possibility to change the temparature. In the neighbouring building there is some Flamenco school or presentation, leading to pounding noise every evening from 10 to about 1 am. The bathroom is ok, although the mirror had some large blind spots and although they once left 4 shampoos rather than 2 shampoos and 2 shower gels. The breakfast buffet offered a lot of sweats, not too bad, but don't try the stuff that is labelled \"orange juice\", it's gross, and don't expect too much from the coffee either. Their system with the breakfast coupons that noone you have to put in a box without anyone checking is more hilarious than annoying.", "Date": "April 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cheshire", "Title": "“Lovely stay, no complaints”", "Author": "WidnesCheshire", "ReviewID": "UR26145925", "Content": "I have just got back from Barcelona from a weekend trip there with my husband, and friends and family. We stayed at the Ramblas hotel and I must admit I was a bit dubious about it after reading some of the reviews on trip advisor. I have to say though that our stay was very comfortable and as a party of 10 not one of us had a complaint about the hotel. We arrived at lunchtime and were checked in immediately. We were pleasantly surprised with the rooms - we were on the eighth floor, 4 of the rooms were at the front of the hotel and 1 at the back. At the front we had lovely balconies with a small table and chairs that overlooked the Ramblas and we had a fabulous view across the rooftops of the city. The room at the back of the hotel had a huge balcony that had the sun on it for most of the day, and although the view wasnt quite as pretty as the front rooms (you were facing the back of some apartments that looked quite scruffy) there was still an incredible view across the city and a good view of the back of Gaudi's Geull palace. The rooms themselves were clean and comfortable; there was a small fridge in each room (no charge to use this) a safety deposit box (there was a charge for this), and the bathrooms were supplied with the usual complimentary soap, toothbrush, sewing kit etc. Towels were changed each day. Breakfast was quite basic but adequate. We found that the staff were very friendly and helpful with our enquiries. They recommended a nearby restaurant to us called Los Caracoles, which served delicious food in wonderful surroundings, which is certainly worth a visit. We went there twice! When out in the city, especially in the tube stations, just beware of pickpockets. Myself and a fellow traveler both had items stolen from our bags. In conclusion if I was to return to Barcelona I would have no hesitation in booking this hotel again (I would ask for the 8th floor though).", "Date": "March 14, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Belgium", "Title": "“bad breakfast”", "Author": "Awokja", "ReviewID": "UR24426976", "Content": "We just returned from a 4-day trip to Barcelona. The location of the Hotel Ramblas is very good and the service at the reception was also good. But the service at breakfast and the breakfast itself really weren't. Even when we didn't finish our meal and there were still other tables to clean, the personnel was standing next to our table (so we would hurry up and they could go on with cleaning). When I asked for a glass, they just pointed there finger towards the cups. So I had to take a cup (not that big of a deal but why not even give an explanation or excuse yourself that there aren't any glasses). Also the breakfast is untill 10.30 but when e.g. the eggs were out at 10.00 they wouldn't give extra eggs because it's near closing time. And the quality of the food is also not good. I first tried eggs and bacon (which I normally love), next day just bacon (and an apple afterwards, which I found out was old while eating) and the last day I just took cereals and yoghurt (cereals were old). I really didn't like the breakfast so I ended up having breakfast somewhere else every day. The room was nice and comfortable and we had a little terras, but the bathtub was very small and the toilet was annoyingly close to the washing table. The cleaning service at the other hand was very good! I went with my bf so I found it very strange to get a room with two seperate beds but we pushed them next to eachother and so that problem was solved. The cleaning lady just let them as we had pushed them and she was also very friendly! Always a nice 'hola' and she did her job very good :) I don't use the bar in an hotelroom, but our bar was empty. What if we would have liked to use the bar? Strange. Also the TV didn't work well. And the second day I had to buy earplugs because of the noise in the hotel. But with earplugs I had no trouble getting asleep.", "Date": "February 10, 2009"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Manchester", "Title": "“Good location, very basic hotel.”", "Author": "Hotel_traveller32", "ReviewID": "UR24053685", "Content": "Hi everyone. Well as i only went to barcelona for a night, i didnt want anything too expensive So i booked this hotel. fairly basic nothing to shout about, small room, over looking Las Ramblas, big windows that open all the way, which is a bonus to lean out looking over Las Rambla. with the window shut you couldnt hear the noise outside. good view from my room (607) awful bed. no english channels on television ( no news) no tea/coffee making facilites. awful bedroom furniture. bathroom not bad, good shower, very clean and small toiletries. but there is a toothbrush/paste, shaving kit, gel douche. and an awful smelling hand soap. Breakfast not bad, but cold, cold bacon, cold chorizo sausages, cold scrambled eggs oh and not forgetting the cold beans. gave up on trying to make toast far too slow even for spanish standards. lots of pastries to spoil your figure. tea/coffee machine, not bad drinks. YOU HAVE TO PAY FOR THESAFE IN THE ROOM, WHICH I ALWAYS HATE. THEY SHOULD ALWAYS BE FREE. there is a small bar but didnt use it, although the lady serving was very polite to everyone. check-in was good, very smartly dressed gentleman, room wasnt ready but offered to keep my luggage safe on 1st floor til room was done. if your there for a stopover, then that is the only reason i would recommend this hotel for. Enjoy, have fun on all your travels. Preston.", "Date": "January 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "uk", "Title": "“Love Barcelona, location excellent young student”", "Author": "topcat07Uk", "ReviewID": "UR23928923", "Content": "really enjoyed my time here. centrally located loads of restraunts. near the sea. staff were wonderful. breakfast great. the only thing was the air con was a little dodgy otherwise had a great time", "Date": "January 26, 2009"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Dundee Scotland", "Title": "“Sleepless in Barcelona”", "Author": "playfair99", "ReviewID": "UR21173338", "Content": "We stayed in this hotel on the 9th October 2008 for one night before we joined a cruise ship. Despite asking for a quiet room, we were allocated a room overlooking the Ramblas. This was a good size of room which was obviously for a family as it contained a king size bed and a single bed as well as a convertible couch in a small annex. The en-suite was in need of some upgrading and the toilet sat on a raised dais which was strange. The shower was best avoided as there was no bracket to hook it on to. Our problems started when we retired for the night. There was shouting and screaming outside until 5am and it was impossible to get any sleep and even then normal daily activity soon woke us up again. The proximity of a 'gentleman's club' almost next door to the hotel may have been a contributory factor to the nocturnal racket. We would advise anyone thinking of booking this hotel to make sure that they are not allocated a room to the front . If you are, insist on another room immediately.", "Date": "October 24, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "sheffield", "Title": "“barca hotel”", "Author": "raytat", "ReviewID": "UR20637064", "Content": "Just stayed at the ramblas hotel and found it in the perfect location in Barcelona. Hotel was very clean good choce at breakfast and room was quite large. Reception staff were very polite and helpful and told my wife and i how to get to some places not on the tourist bus route. All in all a brilliant holiday and would definatelystay there again. also very close to marina and a 15 min walk to beach.", "Date": "October 5, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Belfast", "Title": "“Beautiful Barcelona”", "Author": "silvy84", "ReviewID": "UR19870827", "Content": "Barcelona is such a beautiful place and staying at the Ramblas Hotel just added to our time there. The vibrant Ramblas is on your doorstep and I couldn't think of anywhere better to sip coffee and people watch! The hotel itself is above average. The room we stayed in was well presented with a great view. The room was turned down every day and had handly little extras like tooth brushes and even a sowing kit. The breakfast was one of the best I've had in any hotel in Europe, lots of fresh fruit, pasteries, bacon, egg etc, yummy and just what you need to set you up for a day of site-seeing in the great city of Barcelona. The hotel staff were friendly and we were able to keep our bags all day in the luggage room as we had a late flight.", "Date": "September 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "london", "Title": "“Enjoyable stay”", "Author": "Florence1", "ReviewID": "UR19018730", "Content": "We stayed at the Hotel Ramblas for 4 nights and had a very pleasant stay. The location is excellent, right in the centre, close to the Barri Gothic area and had easy access to the tourist bus. We took the airport bus to Plaza Catalunya for 4.05 euros and walked 10-15 minutes to the hotel. We had a large bright twin room with a window overlooking the Ramblas on the 6th floor.(Room 606) Obviously being on the centre of the Ramblas street there will be some noise but I did manage to sleep well every night. Other reviewers mentioned about pickpockets and petty crime in the area. We did not notice any incidents but one of the restaurants did mention to us about being careful about my rucksack and not leaving it hanging on my chair. There is a safe in the room which costs 2.50 euros a night so it is advisable to take out only the money you feel you will need and leave as much money, important documents, passports etc behind. The reception staff were very helpful and we had a late return flight and were able to leave our luggage in their luggage room when we checked out. Breakfast was plentiful and varied from cereal to cooked breakfast to cold meats and cake. There was plenty of everything and nothing appeared to run out. I can recommend the Barcelona tourist bus for 1 or 2 days at 21/26 euros for giving you an overall view of the city. Highlights were the Guell Park, Sagrada Familia ( we didn't actually go inside due to the large queues) and the Casa Milia( La Pedrera), all examples of Gaudi's work. There are lots of art musuems to go and visit but we did not have time to do everything. In the evening we ate in \"Les Quinze nits\" restaurant which is in the square across from the hotel. It is recommended in lots of the guide books for cheap good food in elegant surroundings. The food is indeed good and there are queues in the square when the restaurant opens in the evening at 8pm. My only criticisms of the hotel were that in the morning when the taps were turned on in the bathroom there were some bad smells. This was also noticeable outside when walking around Barcelona that the sewage system smelt. My other criticism was that the hotel did not provide a booklet about the hotel to give you more information. The reception staff were very helpful about the times of breakfast and tours etc but it would have been helpful to have had more information about bar prices etc Overall we had an excellent break and would be happy to stay in this hotel again and visit Barcelona again.", "Date": "August 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "karachi", "Title": "“great location”", "Author": "sainbasha", "ReviewID": "UR17963602", "Content": "Me and my family recntly stayed at Hotel Ramblas Barcelona in a quad room. It was a very good experience. The staff was friendly and the price was reasonable. But above all the location was excellent. It was situated bang in the middle of La Rambla, the main tourist street of Barcelona. Everything a tourist can possibly do, was available at the doorstep. The room was also nice and clean and pretty large. It was divided into two sections, one which housed a single bed and the other which housed a double and one single bed. Still there was a lot of moving space in the room. A good 3 star hotel.", "Date": "July 17, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "huntsvillel", "Title": "“Stay Away From Ramblas”", "Author": "bobby1940", "ReviewID": "UR16441201", "Content": "Stay away from this hotel. They ended up charging us twice since we refused to take a \"room\" away from the hotel down a dark alleyway and up three flights of stairs. There are better opportunities just a few blocks away without all the hassle", "Date": "May 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "glasgow", "Title": "“Location, Location, Location”", "Author": "jagsfan1980", "ReviewID": "UR15159444", "Content": "A group of 19 of us stayed here in Oct 2007 for the weekend. When we arrived check in was swift. We then all met in the bar for drinks before our evening exploring barcelona. Sorry I can't remember the barmans name (he was from venezuela i think) he was great fun and very tolerant of our requests. This hotel is almost next door to the boqueria market. You can walk to Placa d'spanga in 5 mins (if you choose to ignore everything happening on the ramblas) and the beach is not far in the other direction. The breakfast was good, buffett style with something for everyone, the rooms were basic but clean (some had a balcony) you could here a bit of noise but you don't go to barcelona for r&r but if you did you wouldn't stay on the ramblas! The hotel is good at catering for large groups (we were on a work weekend away) and I 'm sure stag and hen parties would be fine. Don't expect 5* luxury, it doesn't pretend to be this its a budget hotel in the best location. Enjoy", "Date": "April 20, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“loved the city!”", "Author": "Joanne276", "ReviewID": "UR14409767", "Content": "myself and my boyfriend were in Barcelona in feb 08. We had a fantastic time and i would go back tomorro. The hotel was a lot smaller than it looked and we paid for the location more than the hotel. Its a very small hotel, however the rooms were clean. There is no bar at the hotel really. However, we were right in the middle of ramblas and close to all the bus tours and shops. I highly recommend the bus tours, very enjoyable!! one thing we really were not mad about was the food. Its not great at all!! we found a few gr8 irish bars and were good craic! I would go back to barcelona tomorro but i think i would stay in a different hotel.", "Date": "March 20, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Perfect location and comfortable staying”", "Author": "odd76", "ReviewID": "UR10640529", "Content": "Fantastic place to stay in Brcelona (for low budget), especially if you get a room at 7th floor with an expanded view on Ciutat Vella and the Cathedral, and many more other attractions. Easy to find, easy to come back to every evening after a day of sightseeing just to take a shower and go out in the neighbourhood. Very nice front, richly decorated. The inside looks new, very pleasant. I would say a bit more quality and better then Ibis** Hotel. The room with a view on the Rambla, but no problems with the street noise. Two large single beds, big closet, big bathroom in \"marble\". The service was ok, nothing to point out, but we are not very difficult clients. The breakfast was very good - just basic continental, but more than enough (even croissants were ok) and there was place every morning. The coffee was even served at the table. The room itself was not very cozy, rather like a school cantine. The resaturant had a much better appeal, although we didn't dine there. In general, we were very pleased.", "Date": "November 6, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "london", "Title": "“Good position but.........”", "Author": "Burstow", "ReviewID": "UR8754740", "Content": "I stayed here with a party of 15 guys and it was booked by one the party. The best thing about this hotel is it's position, secondly the price. Outside the door is the Ramblas. No walking to find on your door step entertainment and food and drink. Its also a short walk to the tour bus stop, a much longer walk to the beach, about 30 minutes. The staff were fine and the rooms clean. One big gripe for me was the plumbing! Having stayed out until 2.30am on our first night I was eager to get some sleep after the travelling. At 6.30 I was awakened by horrendoes noise from the water pipes when people used the toilets and showers. Having spoke to the rest of our party it appeared all the rooms have the same problem. Our room was tiny with no windows, but as we stayed out until 7am the rest of our trip this was not so much of a big deal. I was told the breakfast was fine with plenty of choice although I never made it down once in time. So to sum up, if you want a peaceful lay in bed - this hotel is not for you. If you want to be in the middle of the action at a good price - fine. My advice is ask to see the room and get drunk as a skunk and you dont hear the plumbing!", "Date": "September 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Belfast", "Title": "“Perfect for what we wanted”", "Author": "stickysticky", "ReviewID": "UR8614255", "Content": "13 lads stayed here for 2 nights. The location is very central. The Hotel wasn't very noisey - Although we were out most of the night. We never got to eat breakfast. Romms are clean and comfortable. Staff were friendly. I'd return with my wife and famil or another group.", "Date": "September 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "South Shields", "Title": "“No complaints”", "Author": "Emmylousdad", "ReviewID": "UR8185210", "Content": "Stayed in this hotel over New Year with my wife and twelve-year-old daughter. Room, which was clean and tidy, was on the eighth floor with a balcony overlooking the Ramblas and a great view of the city.Staff were very friendly and couldn't be more helpful with any queries ( try speaking Spanish, it helps ! ). Breakfast buffet was as good as any I've had in hotels in Britain ( probably more variety ). Location was fine, near the bottom of the Ramblas and close to the marina - yes there are a couple of seedy sex shops, but hey it's a big city and others such as London have them in abundance.", "Date": "July 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Redondo Beach", "Title": "“Horrible location and rooms”", "Author": "Mishima03", "ReviewID": "UR8030018", "Content": "I booked this room through Flight Centre, which I will use again but I will definitely research the hotels first. This hotel could have been in a prime location, minutes from the Mediterranean and right where the action is on Las Ramblas. However, the level of crime against tourists is very high in this area and someone tried to steal my backpack at the Internet Cafe, which is right next door. Pickpockets are ripe in this area so be very careful. Not only is crime high in this area, but the room they put me in was terrible. It had NO WINDOW and I could hear every single toilet flush, sink running, and conversation that happened in the hotel (maybe not all conversations but the plumbing for sure). There are also two Nudie-Strip joints within a few yards of the hotel and the area is rather seedy as a result. If I were to go to Barcelona again, I would stay somewhere near the Passig de Gracia instead of on Ramblas. And I would never stay in this hotel again. The staff at the hotel were great, which was the only redeeming quality.", "Date": "June 30, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kent", "Title": "“Good Value For Money”", "Author": "KentEuropeTraveller", "ReviewID": "UR7780246", "Content": "Having arranged a trip for 7 women aged betwen 36 and 60 I was a bit worried with the first 2 reviews I read but, having already booked, there wasn't a great deal that I could do about it. We were allocated a triple bedded room and 2 twins. A drawback we hadn't expected was that the 2 twin rooms didn't actually have a window although there was a patio door behind drawn curtains that looked out to a concret wall. Must admit it came as a bit of a shock especially when our friends in the triple room on the 8th floor boasted a fantastic view over the rooftops. Our immediate reaction was to seek a change to a room with a view and on approaching staff we were asked to enquire at reception the following day when changeovers were due. However, we didn't bother because in all honesty we were hardly in the room. We were there for 3 nights and we were only in the rooms to sleep. The rooms (and bathrooms) were spacious and very comfortable with plenty of wardrobe space and were cleaned every day with fresh towels etc. Yes, the flushing toilet from next door did make some noise but it was shortlived and out of the 7 of us I was the only one to use earplugs (something I do everywhere I go). It's certainly not the noisiest place I've stayed but I would recommend taking earplugs just in case if you happen to be a light sleeper. The breakfast was generally quite good although there was a bit of a problem with the orange juice machine on our last day and they did slightly overcook the choc au pains (not that it stopped us eating them anyway!). The bar was comfortable and there were no complaints from any of us with regard to the drink measures or cost. We had a fabulous break; the hotel was much better than we'd expected and it's location was absolutely right for us and was definitely value for money when considering what the holiday including travel actually cost us. I would definitely stay there again.", "Date": "June 5, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "New York", "Title": "“One of the worst hotels I've ever stayed in!”", "Author": "Fathersontravelers", "ReviewID": "UR7406366", "Content": "This hotel was substituted for another by a travel agent, and I was told it was comparable to a 3 star hotel, and it definitely was not. The room was 85 degrees F in April and there was no A/C. The only window opened to an airshaft seven stories below! In the middle of the night a fight erupted in the hallway with people banging on someone else's door. Breakfast food (especially the orange juice) was awful. Staff had an attitude about calling a taxi, but were helpful about some other things. Definitely no more than a 2 star hotel, and should only be considered by those on a tight budget!", "Date": "April 21, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Newcastle upon Tyne", "Title": "“The worst hotel i've ever stayed in!!”", "Author": "DaveBaldBear", "ReviewID": "UR7214560", "Content": "The worst hotel i've ever stayed in. The room was dirty, the furniture was lopsided even the tv was on an angle (with no english news channel!) the bathroom smelt of sewers (even after all the taps were run). Complained and then complained again and they gave me a different room. This room at least had different tv channels!! with CNN news. However the bathroom still smelt of sewers!! all of the time. The staff on reception were pleasant but somewhat ineffective. The dining room staff were downright awkward and unpleasant even to the extent of switching off the hot ovens before the end of breakfast even though guests were still entering the dining room. Not a hotel I will be going back to.", "Date": "March 24, 2007"}], "HotelInfo": {"Name": "Hotel Ramblas Barcelona", "HotelURL": "/ShowUserReviews-g187497-d229682-Reviews-Hotel_Ramblas_Barcelona-Barcelona_Catalonia.html", "Price": "$124 - $307*", "Address": "<div class=\"amenFloat\">", "HotelID": "229682", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/1e/91/1e91365defa311e5b39dbf23a108628b4large.jpg"}}