{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "london", "Title": "“4 day break.”", "Author": "ryansees", "ReviewID": "UR128215899", "Content": "Just stayed there for 3 nights recently. Was a pleasant stay with excellent service, rooms were very adequate with most mod cons, bathroom wasn't the best but for price we paid can't really complain. Location isn't great as its a bit away from the centre but easily accessible by metro or bus. Weather wasn't the best so didn't get the most out of pool area.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "essex uk", "Title": "“quiet comfortable”", "Author": "stevegEssexUk", "ReviewID": "UR128155229", "Content": "we stayed for 3 nights in early april, the hotel was quiet and comfortable with a small rooftop pool which we didn,t use, as it rained. Close to the beach we had 1 afternoon in a beach bar there, which would have been very nice if it was warmer. Close to the metro so very easy to get into town and around. Came back to the bar a couple of evenings very quiet, one evening it was shut at 10.30. Breakfast was a buffet lots there and restocked quickly. Overall a nice hotel, we had a family room 2 adjoining rooms would stay again", "Date": "April 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Waterford, Ireland", "Title": "“5 days city break”", "Author": "UnaCourtney", "ReviewID": "UR127999726", "Content": "Room was standard, nothing special! Hotel is very like a conference hotel. We stayed in a triple room. Mattresses are flat and one pillow supplied. Little atmosphere in hotel, bar is tiny and we didn't see anybody there over the five days. Restaurant seemed to be closed during the day - we never saw anybody eating. Location is east of Barcelona. It is five mins walk from metro €2. Taxis cost approx €15 to Barcelona centre. Very close to beach at Mar Bella. A great shopping centre located 10 mins walk away. Staff were friendly and gave a map and good information about city on arrival. Cleaning staff knock and enter on door at 8am each morning (so vaccuums etc start at this time).", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Richmond, United Kingdom", "Title": "“5 Days in April”", "Author": "James_Carlton", "ReviewID": "UR127881064", "Content": "5 days in April at Attica 21. Hotel is located in suburbs but is about 600m from the nearest Metro and as such only 15mins from the centre of town. The advantage to being in this area is that it is quite quiet, but also near the beach at Mar Bella. Also nearby are a number of other hotels, and also a large commercial centre \"Diagonal Mar\" which offers various restaurants in addition to the numerous small local bar/cafe/restaurants. All in all for our family this worked really well. The hotel is very good; the staff were all very helpful and spoke good English. The rooms were good in particular for a family of 4 two linked twin rooms worked very well. We all rated the breakfast the best we have come across at any hotel. The only warning to add about the hotel is if you want fitness facilities - there is no gym and the pool is really just a splash pool for the hotter times of the year. For a family or those looking for a quieter but very easy option for a stay in this great city Attica 21 BCN Mar is a highly recommended.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Aylesbury bucks", "Title": "“Great hotel nice location”", "Author": "sarahlou9432", "ReviewID": "UR125716050", "Content": "The hotel was very clean friendly staff and in a ok location. Beach about 5mins away and it's such a nice beach you have to go their. The location was nice it was in a quiet area away from all the hustle and bustle in the city and has a big shopping centre about 10mins walk away. Metro was a short walk away and so easy to get around. Would defo go back to the hotel the pool on the roof was nice just cold :) had a great time Barcelona was fantastic any questions email me sarahlou9432&hotmail.co.uk xxx", "Date": "March 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Clean modern hotel in quiet location”", "Author": "barcafans", "ReviewID": "UR125695175", "Content": "The hotel is very clean and modern. Our room had 3 beds and we still had enough room. The only thing the rooms could do with is coffee and tea making facilities. Location is very good las rambles by tube 20 MINS. but be warned to the camp nou it takes a lot longer. Having said that I would definitely would return :-)", "Date": "March 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Good business hotel”", "Author": "dyava", "ReviewID": "UR124803933", "Content": "We spent in the hotel four days in February 2012. This is typical business hotel located very close ( 3 minutes walk) to the Barcelona's congress center. Our room vas quite big, the only bad thing in the room was a limescale around the bath tube in the bathroom. During the stay we had ( almost every day) some problems with wi-fi internet connection. The staff was very friendly and helpful. The breakfasts quite good except - coffe , it was terrible.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great Stay”", "Author": "Sabery I", "ReviewID": "UR124531971", "Content": "The hotel exceeded my expectation. The room is spacious and bed is comfy. The bathroom is also very spacious. Walking distance to the metro station and beach. The vicinity of the hotel has many amenities, like pharmacy, supermarkets and restaurants.", "Date": "February 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“Friendly Staff”", "Author": "Steve H", "ReviewID": "UR123862693", "Content": "Great Location from the beach and Diagnol Mar Shopping centre. As an English couple was very Impressed that the two receptionist we both seen spoke perfect English. Swimming pool on the roof is small but Hey its on a hotel roof. Our room was cleaned daily including bed sheets. Plenty of little Cafes nearby open usual after 10am each day. Also supermarket and shop within 2 mins walk. Only set back breakfast buffet is expensive at 14 Euros. If you do ask for a double room ask for a double bed otherwise you will get two single beds pulled together. Metro traib also in walking distance and cheap to catch", "Date": "January 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Good place stay”", "Author": "ronald L", "ReviewID": "UR122904019", "Content": "1. Hotel reception were helpful and speak good English. 2. Room cleanliness are high standard 3. TV has English program 3. Near to amenities ie supermarket, metro and beach 4. Hotel room are value for money 5. Surrounding are quiet and peaceful Not so good 1. Location is a distant from shopping belt. 2. No kettle/ No tea bags in room to make hot drink during cold season", "Date": "January 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Varberg,Svezia.", "Title": "“Value for money.”", "Author": "Hans B", "ReviewID": "UR121583873", "Content": "Location,design and size of room,cleaning,nice staff and exellent breakfast. Metro or walking distance to the city.Best experience in Barcelona so far.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Newcastle Upon Tyne", "Title": "“Fabulous weekend break”", "Author": "Alison36", "ReviewID": "UR120591840", "Content": "Lovely hotel in a quiet area of Barcelona. Very clean and modern with friendly staff. Thought we had been given a smoking room ( we requested a non-smoking) so called down to reception. Within 5 minutes a member of staff was at our door armed with an air freshner spray. Turned out it was a non smoking room and the smell came from the spray she used! Excellent service though. Not much of a view (room 516, top floor) but weren't too bothered as we were out most of the time. Pool, not the biggest, but very welcoming and relaxing, very comfortable loungers and plenty of seating, nice roof top view of Barcelona. Good choice for continental breakfast - cereals, meats, fruit, toast, yogurts etc. Husband asked for an omelette which they did for no extra charge and he didn't wait long for it either. 5 minute walk to nearest shopping centre which has loads of shops and eateries. Same distance to nearest metro stop - Selva del Mar. Would reccomend buying a T10 ticket - 10 journeys on the metro, tram, train or bus for less than 9 euros per person. the train also goes direct from the airport to the centre of Barcelona. Drinks and food quite expensive on Ramblas and by the port area (11 euros for 2 pints of lager and a coke!!) so would suggest going off the beaten track and finding where the locals drink, lots of fabulous bars and lounges to visit. 'Cheers bar' is a great place for watching the footie with the locals, near to a couple of British bars. Weather was very good for November - 21-24 degrees. Would definetly stay at Attia 21 again and can't wait to be back in Barcelona for the fourth time - amazing place......!!", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Nice experience”", "Author": "reona", "ReviewID": "UR118990521", "Content": "Staff were very friendly and helpful. Rooms were clean and nice size. The area where the hotel is based is a bit quiet and more relaxed. Big shopping mall only 5 mins walk away. Easy access to public transport. Overall thumbs up!!!", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice hotel close to beach”", "Author": "Taylor1979", "ReviewID": "UR118722340", "Content": "A nice hotel with friendly staff. Rooms are clean and adequate. Hotel is a 2 min walk to the metro line that takes you into the heart of Barcelona. Close to beach. The morning breakfast was excellent with a good assortment of fresh pastries, fruit, and meats.", "Date": "September 29, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Bratislava, Slovakia", "Title": "“Excellent location, clean and nice hotel.”", "Author": "Andrejocka68", "ReviewID": "UR118069922", "Content": "My husband and me stayed in Attica 21 Barcelona Mar for 6 days in the ending of august 2011 with our 12-year son. Room was large enough for 3 persons, very nice and clean. But the best was - the location of the hotel. 5 minutes from metro, 10 minutes from beach. I recommend this hotel to anybody who want to join sightseeing, swimming, shopping and of course watching a football match of FC Barcelona!", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Asker, Norway", "Title": "“A very nice week at the Attica 21 Barcelona Mar Hotel”", "Author": "Ann Karin O", "ReviewID": "UR117385831", "Content": "I stayed at this hotel for a week in the beginning of august 2011 together with my two teenage daughters, aged 14 and 16. When I picked this hotel it was because of its location close to the beach, in a quiet and safe district of Barcelona, close to a shopping center and with an easy access to the center of Barcelona city by Metro, bus and tram. There are no busy night clubs and noisy bars close to the hotel which was appreciated by us. There are however some nice bars on the beach :-). We did not find any interesting restaurants close to the hotel but maybe we didn't search to well....so we had dinner downtown. Remember that the Metro stops running from 00.00..... Breakfast at the hotel? Well, we did not eat breakfast at the hotel because of the price.... If you want a trip by the Bus touristic (hop-on-hop-off), ask the staff for tickets. It seems that the hotel can offer cheaper tickets than if you buy them from the bus driver. We returned very back to the airport by bus (a lot cheaper than by taxi). Route 41 to Placa Catalunya and then the airport bus to the air port. Enjoy your stay :-)", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Excellent Hotel and Location and will return”", "Author": "jcgdublin", "ReviewID": "UR116059655", "Content": "Room was excellent and location was very near the beach and metro so perfect base for the long weekend's various activities.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Ok but wouldn't go back”", "Author": "oxfordmonty", "ReviewID": "UR115950965", "Content": "Booked this through Expedia for my son's 21st birthday treat to see Barcelona FC play. No real p[roblems with the hotel, but it is so far out from the centre that the cvost saving wasn't worth it. Tip: don't use the hotel bar - total rip-off. Tip: take a short-is walk to the shopping mall at the bottom of the Avenida Diagonal. Good shops and some decent eateries.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Would recommend and will be back!!!!!!”", "Author": "kesray", "ReviewID": "UR114142169", "Content": "Great hotel and helpful friendly staff, great safe underground car park. Nice quiet part of the city but tube station 5 mins away to centre. great breakfast and lovely pool on roof, cant fault the place!!! Stayed on top floor and had no noise problems with room.", "Date": "June 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Gothenburg, Sweden", "Title": "“Barcelona have everything for everybody!”", "Author": "Barca031", "ReviewID": "UR110510782", "Content": "We were very pleased with the hotel and its staff. State, the rooftop pool We will warmly recommend it to others. Breakfast was excellent!", "Date": "May 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Good hotel in quiet but o.k. part of the City”", "Author": "PeterJC07", "ReviewID": "UR107625341", "Content": "Good hotel, 5 min. from the beach, less than 5 min. from Metro. Friendly staff, good breakfest, room o.k. Nice pool on the roof with chairs and beds (cold water!)", "Date": "May 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Guildford, United Kingdom", "Title": "“Fantastic hotel-highly recommended!”", "Author": "grzanka", "ReviewID": "UR107198650", "Content": "I stayed in this hotel in march 2011 with my baby and my mum. Service was excellent and very kind and helpful staff. Moreover room was very clean and well decorated. I do recommend this hotel for any family with children. The only thing which was missing was a free internet facility but overall great hotel.", "Date": "May 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Lovely hotel, but not 4*”", "Author": "gemmawells1", "ReviewID": "UR104247510", "Content": "I stayed at this hotel for 5 nights whilst in barcelona. When we arrived we were checked in by a very nice man who made an effort to speak english as we didnt understand very much spanish. We got to the room and were very impressed, very clean and nicely set up. Through out the stay we did have a few problems though, our bed was very noisy and creeked everytime we moved, my hair dryer blew up and i had to wait 12 hours and go to the reception twice before they gave me a new 1, and then the TV wouldn't go on. Apart from the nice man who checked us in the hotel staff are not friendly and are very sour faced. The pool on the roof is extremly clean and has a lovely view of Barca, thou the pool is not deep and you are not given any warning of this. The hotel is also in the middle of nowere and this is not clearly stated online. The metro station is only a 5 minute walk away but it's a good 40/45 minute journey to the Nou Camp and you have to get an interchange as there is not a direct line. The city/ La Rambla is around 20 minutes on the metro. Barcelona itself was not at all what i expected, we went for the football side of things but stayed for a few extra days to see the sights. Apart from the Nou Camp i did not enjoy barcelona, its full of horrible people who clearly do not like tourists and the customer service is appauling. Unless you like tapas food theres not really alot for you, it's full of cheap looking little cafes and it's very difficult to find a proper restaurant with a menu in ENGLISH! We walked around the city centre for 45 minutes before finding somwere were we knew what we were eating.", "Date": "April 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Great place for great times”", "Author": "stebemue", "ReviewID": "UR103762719", "Content": "The Hotel is located in a rather quiet street less than a 10 minutes walk away from the beach. First I thought that the city center could be too far away from the hotel which could cause some inconvenience. But the subway station is close (5 min walk) and the trains run often and quickly to many places of interest downtown and at the beach. Our room was clean, quiet, spacious and equipped with all necessary items that can be expected from a 4-Star hotel. The terrace on the roof with its pool was nice to start the day and to get an idea of the weather you could expect for the day. The hotel serves breakfast from 7 to 11. The breakfast-buffet was not special, but there was quite a choice of food and the plates were kept full over the entire time. A negative point might be the coffee machine which could not reach up to the habits of spoiled coffee drinkers. We can only report good experiences with the people of the hotel. On the first evening we got a brief introduction to the places of interest in Barcelona, how to get there and what to pay particular attention to. Altogether the place was not special BUT very comfortable and in excellent shape. If you look for a nice refuge to recover from the bustling city and beaches this place is just right for you.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Ignore poor reviews”", "Author": "dianemanchester85", "ReviewID": "UR101571909", "Content": "Before our recent trip to Barcelona, I read some of the poor reviews of this hotel and was worried we had made the wrong choice. However, we were pleasantly surprised. The room was clean and well equipped - powerful shower and constant hot water. We asked for extra pillows and they were delivered promptly. Staff were polite and helpful and the room was thoroughly serviced each day. Although out of the centre, the hotel is only 3 mins walk from the Metro. Trains run every 4 mins and the journey into the centre only took 8 mins", "Date": "March 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kuopio, Finland", "Title": "“Peaceful”", "Author": "Lepa088", "ReviewID": "UR100478132", "Content": "Good beds, no noice, clean, good breakfast, well-working interned.", "Date": "March 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Madrid, Spain", "Title": "“Feel unluncky to stay here”", "Author": "Wssb8279", "ReviewID": "UR82760266", "Content": "1st day check in my husband need to use the hotel trolley to move our bag to room and the hotel staff only stand at the hotel bar watch tv,after still need to return the trolley by our self to the lobby. I don thing there is a 4star hotel, 2 star only. call room service few time but nobody answer. Because the hotel only 1 or 2 staff, 1 for check in, another 1 serve in the hotel bar, so u know why we need to move our bag by our self, call customer services but no answer.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "New Cumnock, United Kingdom", "Title": "“Nice hotel, shame about the location”", "Author": "heleng98023", "ReviewID": "UR77611422", "Content": "Went to Barcelona on the 26th August. Hotel was really nice very close to the beach, wouldn't say it was a four star hotel. Very clean and staff friendly enough. Pool clean and only about 8 sun loungers. Hotel isin't very central had to get a taxi most places, unless you wanted a long walk. There are no bars or eating places round about, very quiet. If you are going to this hotel you should do your research and make sure you know where its situated. Watch out when you leave. We asked the hotel to phone a taxi to go to the bus station which cost us 9 euros to get there. They charged us 21 euros. Not a lot you can do about it but a bit of a rip off.", "Date": "August 31, 2010"}], "HotelInfo": {"Name": "Attica 21 Barcelona Mar", "HotelURL": "/ShowUserReviews-g187497-d229678-Reviews-Attica_21_Barcelona_Mar-Barcelona_Catalonia.html", "Price": "$119 - $241*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Provencals 10</span>, <span class=\"locality\"><span property=\"v:postal-code\">08019</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "229678", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/1a/b8/8d/piscina.jpg"}}