{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "manila", "Title": "“OK hotel. Somewhat Far.”", "Author": "earth-trekker-x2", "ReviewID": "UR128180262", "Content": "We got this hotel as a part of a Globus tour package. Rooms are decent enough, we had a tub in the bathroom. Heater wasnt working though. (note: we did not call for service so we werent sure if it was broken or we just didnt know how to operate it) Our complain is that this hotel is far from the sites and only 2 buses passes by near the hotel and there are not much places to go after 8pm. It is near a street (Salle) that has some nice pricey shops but very far from getting to the sights. Buffet breakfast is decent enough. one very very negative thing for us is the wi fi. there is a complimentary wi fi connection in the lobby, but they only give you 30 minutes! they will issue your room one user name and password. so that means only 1 device can be connected. so for a party of two, that means you either share your ipad or you limit each usage to 15 minutes each. or if you need to connect 2 devices (say your iphone and ipad) - there is no way you can do that. a big negative for us.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Cumbernauld, United Kingdom", "Title": "“Accomodation”", "Author": "Keith506", "ReviewID": "UR127346065", "Content": "The hotel is situated outside the walls so taxi charges from airport on meter all the way and was 65 Euro's. The hotel is situated on a very busy road junction and therefopre very noisy. Also, the rubbish bines located at the front of the hotel are emptied throughout the night and can also be noisy. The inter bedroom sound proofing not very good. However, the staff are extremely polite and very willing to help. The cleaniness was superb and, the included, breakfast excellent. Remeber the City tax needs paying even if you are on an inclusive package. Thge room was very large with balcony and the bed very very comfortable. The attractions are about 30-45 mins walk albeit buses run frequently into the main terminus where you can use metro to get around and not very expensive.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, UK", "Title": "“Reasonable stay but not Grand”", "Author": "looptail", "ReviewID": "UR126616535", "Content": "This hotel was selected for us as part of a package deal. Arrival: friendly, welcoming - the staff spoke good English, which was greatly appreciated. Room: clean but tired - mould on the bathroom ceiling - otherwise reasonably comfy. Our room was at the back of the hotel so there was little noise; however, other guests did lean out of their windows to smoke, and the smell drfited back in to our room and the corridors. Air conditioning was fitted but won't be operational until June (we were told), so the rooms got quite warm at night. Breakfast: very basic. No decent tea or coffee (all from vending machines), the only hot dish at the buffet was scrambled egg. Although the volume was plentiful - and the cakes were very good - the range was somewhat limited. Area: actually very pleasant - lots of boutiques nearby, a very good cafe/bar across the road and several good restaurants within a couple of minutes' walk. Connections: Good. Tram nearby linking to the rest of Rome (Piazza Buenos Aires); bus stop about 5 minutes' walk from the hotel (on Via Po) which goes straight to Termini rail station (86 or 92). Internet: several PCs were available at 35 cents/minute; however, one printer wasn't working and the hotel wasn't interested in helping at all (not even having spare toners to hand). Wifi in the rooms but payment required. Concierge: reception staff were knowledgeable and helpful. Overall: reasonable but not a Grand hotel.", "Date": "March 25, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Warrington Cheshire", "Title": "“Very nice hotel”", "Author": "Ann48", "ReviewID": "UR126551305", "Content": "Just returned from a 5 night stay at this hotel, a great base for a sightseeing trip to Rome. Rooms are spacious and clean, bed was very comfortable, bathroom well equipped with towels and toiletries etc. Even had a clothes line over the bath if you needed one! Our stay was bed and breakfast and there was plenty of food available, the scrambled eggs were some of the best I've had. The hotel bar has a 'happy hour' from 5pm to 7pm with 20% off drinks. There is a 6 euro per night city tax charge per room payable on departure. All the staff were really helpful, check in was swift and easy, and nothing was too much trouble for anyone. If I had to say a negative it would be that there is no tea/coffee facilities in the rooms, and I do like a cup of coffee as soon as I get up, but they do let you go down to the restaurant when breakfast is being served and bring one back to your room so not so bad. A special mention would have to go to the poor man on reception (didn't get his name) when we checked out, we made him work hard when we settled our room bills. We stayed in room 706, nice room, not double glazed so you do hear some noise from outside but nothing that would keep you awake unless you're a really light sleeper. Going back to public transport, the number 53 bus stops close to the hotel and will take you straight down to the Coliseum, (bus tickets are sold in the shop very near to the bus stop) or if you want to go to Vatican city, then turn right out of the hotel and the turn right again on the first junction where the tram lines are, and a short walk down you can get a number 19 tram that will take you there. Tickets are 1 euro for a one way trip or for 4 euros you can get a ticket that will give you unlimited rides on the buses/trams/metro for a day.", "Date": "March 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Clonmel, Ireland", "Title": "“Got this on offer”", "Author": "susanlaste", "ReviewID": "UR126373975", "Content": "We recently stayed in this hotel for 3 nights, ourselves and another couple, we got it at a great price, on arrival we were told there were no double rooms, (Only Twin) but were told when rooms became available we would get them, this didnt happen. The rooms are average and the bathroom that we had is SO TINY, my husband is a large man and when i stood in bathroom i could touch either wall by streatching out my arms/hands.. these bathrooms are VERY dated and old fashioned, they really warrant an upgrade. The hotel staff, both reception, dining/breakfast were VERY ATTENTIVE and VERY HELPFULL, which was fantastic. Beware of the taxi prices we booked a taxi and if you feel the price is too expensive you still have to pay for the Call out....This hotel was perhaps a little far out for us as we were there for the marathon, but beautifull italian resturant nearby, and once you got the hang of the metro/bus system you were grand. This is my 4th time visiting rome, and i fear it will be my last, the pickpockets have really gotten very bad and we ourselves witnessed 5 attempts on people on the metro, which is very scary and frightening. The italian people that we met (expect the taxi driver) were lovely, helpfull and pleasent to deal with.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boise, Idaho", "Title": "“Very good.”", "Author": "Rita F", "ReviewID": "UR125508369", "Content": "We were pleased with the service, food, and room. The staff was friendly, the food was good (breakfast buffet especially), and the room was clean. We heard some street traffic noise but that is to be expected in a large city and was not a problem. Restaurants and shops are within easy walking distance. The only service we felt could be improved upon was the internet connections. The hotel offers two daily 30 minute passes for no charge (always in the lobby, not in the rooms). The connections were always slow and I used at least 7 of the 30 minutes just to log-in. Other co-travellers paid for the in-room internet and also commented on the slow speed. Other than the internet, this was a very good hotel and I would recomment it to travellers. We will definitely stay there when in Rome again. Thank you, Grand Hotel, for a wonderful time in Rome!", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Great hotel!!”", "Author": "y r", "ReviewID": "UR124391869", "Content": "We got to the Grand Hotel Beverly Hills just as the snow storm started to cover Rome with a white blanket, it was freezing outside and each time we got back in to the hotel it felt like coming back home. The staff is very very nice, and pleased to help you with anything you need- starting with quick check in and all the way to helping you connect to the wireless internet. The internet is not free at the hotel and costs 5.50 euro for 24 hours on mobile phone or 11 euro for 24 hours on laptop. Also- you are required to pay 3 euro per person for each day you are staying at the hotel, for city taxes. A payment no one told us about when we checked in... The rooms are very clean and comfortable. The double room has a very large bed that gave us 3 nights of great sleep after a day full with snowy activity. The bathrooms are very clean and comfortable, equipped with a regular toilet and a bidet. Breakfast is yummy, not very diversed, but tasty and fresh. I don't believe other hotels (in that level) offer a much larger variety of food for breakfast... The hotel is not located on the very center of Rome, but has a very good options of transportation to all the places you would like to visit- the Colosseum, Vatican city and also to Termini- the main station for all the buses, trains and metro. All-in-all, we had a great experience with the Beverly Hills hotel, and would definitely love to stay there on our next trip to Rome.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Gaffney, South Carolina", "Title": "“Very pleased”", "Author": "Chillaxer103", "ReviewID": "UR122300409", "Content": "We stayed eight nights during Christmas and found the hotel to be one of the cleanest we've ever stayed in. Great staff who were every helpful to us, especially Sandra. Close to tram and bus stops and far enough away from the busy tourist areas to enjoy it. The midnight trash pickup can be frustrating if you are a light sleeper. Breakfast was nice but we weren't aware it was included until several days into our trip. Wifi was a little pricey at €5.50 for 24 hours. However, they were very helpful with helping me pull up and print my plane tickets to avoid having to check in at the airport. They have a shuttle service to the airport for €55 that was so worth it for us. Beds were really comfortable.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Paris, France", "Title": "“Unfriendly and unaccomodating”", "Author": "highersights", "ReviewID": "UR121261314", "Content": "I stay in hotel all around Europe and the service here is one of the worst I have expereienced. In particular, the reception staff are unfriendly and unaccomodating. The service is frosty and aloof. The amedities in the hotel are not 4*. All business travellers know the importance of having a access to an iron! Here, you have to PAY to have your shirts washed and ironed. Incredible, and the first hotel out of 30 or so this year without an iron available. The hotel masquerades as a 4* hotel but in reality it is an ageing 3* hotel with 2* service. To make matters worse, it is a long way from anywhere. Never again.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Belo Horizonte, MG", "Title": "“GRAND HOTEL BEVERLY HILLS”", "Author": "ROBERTO G", "ReviewID": "UR121248752", "Content": "the hotel is good ... but the receptionists are not very nice and the hotel is far away, located bad .... and the rooms have carpets which caused me an allergy and poor sleep nights .... and still worse, they charge 10 euros for 24 hours internet ... The hotel should offer the customer free access to internet. I think charging for access to the Internet is a passdo.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Timmins, Ontario, Canada", "Title": "“A good stay in a great area of Rome”", "Author": "Rob-Joy G", "ReviewID": "UR121007308", "Content": "This is our second time in this Hotel. 2004 & 20011 Sept. Nice rooms , not large but well done. Staff very friendly and helpful even when not asked. A wonderful location. Half hour walk to the Spanish Steps. 10 minute walk to Villa Borghese. A wonderful park with many quiet areas in a very large city. We would go here again.", "Date": "November 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Rugby, United Kingdom", "Title": "“Wonderful hotel, great service”", "Author": "Marion M", "ReviewID": "UR120692553", "Content": "We stayed here from 12th - 15th November 2011, and I can do nothing but praise the staff and the hotel. For the price it is great. The staff were acommodating to myself and my elderly mother, and were happy to advise on getting in to the centre, and to the airport. Whilst the cost from the airport is more than the 30 euros fee for the airport to city centre hotels, a more agile tourist could easily take a bus into the centre and get a taxi from there. The room was adequately furnished and very clean, beds comfortable. Bathroom was lovely, with great shower. Breakfast was continental but there was plenty of it. Ate in two lovely restaurants in the immediate vicinity in the evening, Bartolomeo's across and down the street a little from the hotel was wonderful. In the square behind the hotel block there are lovely take away pizza cafes too. Coffee shop nearby is pleasant and reasonably priced. Or keep the lonely bartender company in the hotel bar, very underused when we were there! Easy journey into the centre, take the 63 bus from the stop on Avenue Po around the corner from the hotel. I take you into the Piazza di Veneto through the Via Corso, a major shopping area. We took the 110 hop on hop off bus (16 euros for 48 hours?) well worth it.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Rome, Italy", "Title": "“Better than expected”", "Author": "annsTrip", "ReviewID": "UR120677820", "Content": "Reviews here sounded not so good, but I was pleasantly surprised spending 2 nights here (Nov 12, 2011). Pros: Hair dryer with small nozzle, extra shelves in bathroom for cosmetics, desk with ethernet cable, carpeting, better pillows, light yet warm down comforter, ice machine. Cons: Wifi very expensive. I would go here again, easily.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Lake Havasu City, Arizona", "Title": "“Globus Best of Italy hotel”", "Author": "wheretonext123", "ReviewID": "UR120504562", "Content": "We stayed at this hotel on the Best of Italy Globus 11 day tour. Remember when you are out of your normal surroundings things are different. They will not be the same as you are use to. Take it with a grain of salt and make the best of it. Hotels and food are not what you are use to. Know that going into the vacation. This hotel is nice. It's not the high end type but it's clean and I thought safe. The only things I'd say negative is it doesn't appear to be close to a lot of things like bars, etc. There are a few places to eat, but you have to look for them. There is a very small cafe across the street, that has sandwhiches, etc. There is an ATM just to the left of the hotel. Our Bath was very tight/small. Has a bidet, clothes line, hair dryer. There is no iron or board. There is a safe and it appears to be ok and large enough for an ipad. You can hear the traffic. The beds are twin and apart. There is a reasonably priced bar. There is restaurant. There is a small frig that has some items in it. A small flat screen TV. Large mirror in the room and one on the closet. No wash cloths. They provide shampoo, conditioner, bar soap and shower gel. No shower cap. There is one outlet at the mirror and one inside the bed side table on a cord. The window has the metal security screens to block the light. You must pay for Internet. The air conditioning was not very cold. It's clean. It has an ice machine down the hall. Don't forget to bring your plug adapter.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Braintree, United Kingdom", "Title": "“A short trip away..”", "Author": "Jane F", "ReviewID": "UR120115768", "Content": "I have to say i was a little apprehensive reading a few of the reviews, but in hindsight, we were 'satisfied' with our experience. Rooms are a little dated, but clean and comfortable. It states that they are sound-proofed, but we very much doubt this as noise was very audible from neighbouring rooms. The whole 'star-rating' thing is a little suspect, as i expect more from a 4-star hotel and this i must say fell short of some basics, such as comp coffee/tea in communal areas, free internet, in-room facilities etc. Location was fine, as just a short walk away you get the bus into the centre with relative ease, and it is ideally located for a nice walk through the nearby park - just a few minutes away. The concierge and other staff were on the whole very helpful. Breakfast was a little unimaginative, and fresh fruit salad and a little more attention to detail would befit a 4 star grade - it's the small things that can make the difference would i return....Rome - definately, Hotel....undecided", "Date": "November 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Manalapan, New Jersey", "Title": "“Nice property but too far from main sites”", "Author": "dcdrj2", "ReviewID": "UR119916131", "Content": "Hotel was a bit old but in fairly good condition. It is clean and the staff for the most part was friendly and helpful. Only problem we had is that it is quite far from most sites in Rome. Bus transportation is no far but difficult to traverse and add time to travels. Taxis are available but add 8 - 12 euros each way to daily activities. There are several good restaurants less than a 5 minute walk but Rome nightlife is not local.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Ottawa, Ontario", "Title": "“Nice hotel but a good walk to sites”", "Author": "Acadia80", "ReviewID": "UR119500246", "Content": "I just came back from a one week tour of southern Italy and enjoyed 2 nights at the Grand Hotel Beverly Hills. We arrived early Sunday morning and our rooms were ready for us. Thank goodness as I needed to sleep after the long flight from Toronto. The staff at the front desk were very friendly and helpful. The hotel was a good walking distance from the main sites but I spent the first day walking to the Spanish Steps and the Trevi Fountain. The next day I walked back to the hotel after visitng the Forum, Colesseum and the Pantheon. Yes, my legs were killing me but it was wonderful to enjoy all the sites and sounds of the city. I think it's about 5 km to the historic area. Breakfast was included and had a great variety. The room was simple but clean.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "israel", "Title": "“our summer trip to rome”", "Author": "esther j", "ReviewID": "UR119197922", "Content": "enjoyed our stay there. bus station near but buses do not arrive occasionally. we had to wait quite some time. in the month of august they have their holiday in italy so most of the shops and nice restaurants nearby were closed and we had no choice but eat in a nearby restaurant most of the time. breakfast is ok but same everyday with nothing special to make you feel good. bar was empty every evening. could not eat at the hotel cause there was nothing which was worth it. ac was good. room was without any view and there was nothing to do if you return early evening. not in the center at all.", "Date": "October 11, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Whitby", "Title": "“Geared to \"Tour Groups\"”", "Author": "CherWhitby", "ReviewID": "UR119161932", "Content": "We were on a escorted tour \"Dolce Vita in Tuscany\" by Alba Tours. The hotel itself was fine for a short stay. The breakfast was ok but geared to tour groups, meaning we were limited to what was available for us. Our room was fine and overlooked the front of the hotel. Borghese Palace was not far and we walked there. But you would need to take a taxi or transit for other points of interest. The staff gave us wrong information as to our pickup the next day and we were up really early and some other guests did not get wake up calls.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“This is not a 4* Hotel !”", "Author": "Gary C", "ReviewID": "UR118684687", "Content": "Booked a 3 night leisure break here - never again. Hotel had no note of my booking on arrival and kept me waiting over 30 minutes to check in.. No porters to help with the luggage. Reception area is like a glorified waiting room. Bar so bleak that I never saw a single person in there (not even a barman !!). Breakfast buffet is very basic with a limited choice and lazy waiting staff. The Hotel is also a lot further out of the centre than I was led to believe and its difficult to get anywhere without using transport to get to the main sites. The Hotel also now seems to be dominated by tour groups and coach parties .... certainly not a suitable Hotel for the individual traveller or family. There are many better hotels (in similar price brackets) in Rome than this one. I WOULD NOT EVER RECOMMEND THIS HOTEL TO ANYONE !", "Date": "September 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Hotel and people”", "Author": "Wazobi", "ReviewID": "UR118528299", "Content": "The hotel is good but the staff specially on the reception r bad it's like they don't have time for u in general almost all the people in Rome r not friendly specially with the tourist", "Date": "September 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "St. Petersburg, Russia", "Title": "“Grand Hotel Beverly Hills”", "Author": "Oleg N", "ReviewID": "UR118395892", "Content": "I’d spent five nights at that hotel in April 2011. Room was clean. Personnel were friendly and helpful. Room could be bigger but since I came to Rome to visit its Cathedrals, Churches, Museums and other historical places I actually only slept, had my breakfasts and took showers in the hotel. Food was good, tasty and plentiful. Rest room had enough space but the shower cabin was too narrow for the man taller six feet. If you bend your knee and raise your thigh parallel to the floor then you will touch the glass wall of cabin with your knee. So, fat people may only stand at attention there. If you are the fan of Baroque art and architecture then this hotel is especially for you because the Borghese Palace with its nice garden is not far from the hotel. It takes ten minutes to get the Borghese Palace and Zoo by walk. If you came to visit ancient and medieval Rome then you will have to use a taxi or walk approximately three miles (five kilometers).", "Date": "September 21, 2011"}, {"Ratings": {"Location": "3", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "2"}, "AuthorLocation": "D.C.", "Title": "“Not for solo travellers”", "Author": "NextStopAsia", "ReviewID": "UR118237841", "Content": "This is one of those hotels that the cheap bus tours book. It's a hike from the sites so you will rack up taxi fares. Would taxi to metro and take that (1 Euro). I was alone so they put me in one of the suite half-rooms. It was very small. You could barely fit in standup shower. The elevator made a noise all night. I asked to be moved to a quieter room and they said it would have to be an even smaller room. I refused. Then after being told I was very difficult and picky, they came up with a larger, quieter room but made sure to let me know that I was picky and difficult. Breakfast was pretty bad. Self-service. Bar was dismal. Beware the rooms by the ice machines as well. There was one younger desk agent that was fabulous and helped me immensely when my luggage was lost by the cruise transfer company. My advice would be stay within walking distance of a metro stop.", "Date": "September 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Leesburg, Florida", "Title": "“Bit far”", "Author": "Frank M", "ReviewID": "UR117625484", "Content": "From just about everything of interest in the city of Rome, though we got in a LOT of needed exercise walking to the Termini each day. Still, the area was beautiful with a feeling that one is quite safe there, and the hotel itself does deserve its name, Grand, as it is. Three stars only because if its being so far from the touristy attractions, otherwise would definitely be a four.", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "kent", "Title": "“Wonderful city, lovely hotel”", "Author": "280157", "ReviewID": "UR117589497", "Content": "We had three days in Rome at the end of August and stayed at the Grand Hotel Beverly Hills. The hotel was very clean and comfortable, a king size bed with a comfortable mattress and pillows. The bathroom was ok but a little bit small. The room was cleaned every day and the sheets and towels changed every day. Breakfast was good lots of choice - a typically European choice but enjoyable. The concierge were helpful apart from missing our early morning wake up call on the day we left!! We had some delicious meals and around the corner from the hotel we found a small pizzeria which served excellent food at very reasonable cost. Rome itself was a delight an amazing city so much to see and do but not in August!!", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "2"}, "AuthorLocation": "Santiago, Chile", "Title": "“great room, unfriendly staff”", "Author": "Luchoruiz", "ReviewID": "UR117200613", "Content": "We spent 3 nights at The Beverly Hills in early August. We arrived at around 11 PM, and we were close to check ourselves in,and find our key and room, as the person who was at the counter did not even raise his head to say \"good evening\" (my girlfriend and I were the only people at the reception). No one helped us take our luggage upstairs. Next morning, we let them know that the night before we were dialing Reception for 15 minutes and the phone was busy. They told us that at night there is only person there. The good thing about his hotel is that is is a few blocks away from Villa Borghese. Termini Railway Station is not that far from the hotel. If you take public transport from The Cinquecento Square, you can rely on the 38 and 92 buses as they both go along Via Po, which is less than 5 minutes away from the hotel. The room we occupied was big and comfortable. It is a pity that you have to pay to connect to the Internet, which is not even free at the hall. The breakfast buffet is very good, though.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "parigi", "Title": "“so, so”", "Author": "maduuu", "ReviewID": "UR115892314", "Content": "Staff was very nice, but as i'm in the 'trade' myself that's more or less the least i expect, Hotel's not that far from center town and a cab ride is a tenner. I chose this Hotel as it had great reviews on cleanliness, but to my disappointment there's hair in the shower and even after telling the concierge it had not been cleaned when i came back at night. The showers are the worst i've ever seen, really tiny ... Internet acces is a ripp off, they charge you 0.35 € per minute and it's slow ... i moved to another hotel the last night i stayed in Rome with less stars and better service!", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“Average hotel, good location, relatively inexpensive by Rome standards”", "Author": "JohnK1470", "ReviewID": "UR115290050", "Content": "This hotel is located north of Rome's city center and is a 15 to 20 minute walk to the major sites (like the Spanish steps or Trevi fountain or the Pantheon). Another 10 minutes to the Colosseum. It is located at the north-east side of Villa Borghese, a large park in Rome. Given its location north of the city center, it is substantly less expensive than other hotels closer in. We spent four days here and generally we would walk to the city center, walk around all day, and then take a taxi back which cost about 10-13 Euros for the family. It is close to a bus stop which can take you to the Vatican for a euro each if you are comfortable with taking the busses (we always cabbed it). The hotel is showing it showing its age and needs a facelift. Elevators are tiny (like 2 people stuffs them) and bounce at every stop which made certain members of my family take the steps. The common areas are nice but a bit faded. The breakfast was free and a simple continental breakfast with a few hot items. Nothing elaborate. Internet was around 10 Euros a day. The rooms are cheaply furnished and decorated. Imagine a Hampton Inn or Fairfield Inn Property which has a few years on it and you will get the sense. Not bad, liveable, but definitely not close to 4 star by US standards. Lastly, the concierge was very helpful and a plus.", "Date": "July 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Good service but far from city and transport(train)”", "Author": "Gea43", "ReviewID": "UR113580956", "Content": "We stayed in this hotel for 3 nights .The room is clean and comfortable but the decor is old ,tired and depressing when we complain if we could transfer to a better room we were told that its a standard accomodation that were in so the room is almost the same i fully understand that we booked a standard accomodation but i felt for a 4 star hotel its not up to the standard.the location of this hotel is quite far from the city and metro(train station) .There is not much selection in the breakfast bar not even a complementary tea or coffee in the room.but they make it up with the good service when we complained of what we thought a leaking toilet bowl they promptly sent somebody to fix the problem .The receptionist were accomodating and helpful when we asked to book a taxi for us without realizing that we need a reciept for reference.we quickly went outside he chased us give and explained what in the reciept.(the taxi company,number and the waiting time.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Hong Kong, China", "Title": "“Convenient location and friendly staff”", "Author": "eymwonder", "ReviewID": "UR113339220", "Content": "The hotel was recommended to us by a friend who stayed there years ago. It is a little ways off from the Via Veneto, but easily reachable by bus. Initially you will need hotel staff to give you the bearings, and which side of the street to catch the right bus. Eateries and restaurants nearby are quite good quality, but cannot compare with the foodies' haunts in Trastervere. It's just a short stroll away from the Villa Borghese Museum, where you can catch a ride on the park \"train\" to Pincio near the Piazza Republica. Inside the hotel the amenities are fine, and housekeeping standard is good. The breakfast at the hotel was plentiful though not luxurious. For a three to four star hotel this is very good value for your money. Local tours can pick you up and send you back to the hotel so you don't need to look for transports.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Nice hotel, off the beaten path”", "Author": "Quilting4Cats", "ReviewID": "UR112313476", "Content": "I stayed at the Grand Hotel Beverly Hills for 2 nights during the end of May as part of a tour package. The hotel was clean and the staff very friendly. The front desk staff were exceptional in answering my questions and helping with exchanging money and where certain things were located. Wi-Fi is available for 5.50 euros per day (which is cheap compared to other hotels I stayed at during my trip throughout Europe). Although the rooms were small, they were very clean. And besides, who goes to Rome to hang out in their hotel room? We were only in the room to sleep anyway, so size did not matter. You do have to put your key into the slot inside the room to keep the lights on. We asked for two keys so that we did not have to worry about one person going out before the other and the remaining person stuck in the dark! The toilet flusher was a little funky as you could hold the handle down to flush for as long as you wanted. Took a while to figure that out! There are a ton of restaurants and cafes all around the hotel for lunch and the staff were very friendly and the food was great. Down one of the side streets by the hotel there is a market where vendors hawking all kinds of items set up shop. They start shutting down around 2 pm so get there before then. it is a perfect place to stroll back to the hotel after having lunch and do a little shopping. The only complaint that I have is that the hotel is really not close to anything. It should only be a about a mile from the Villa Bhorgese but that only brought you to the zoo entrance. I would stay here again, but only if I was not going into the center of the city.", "Date": "June 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Outstanding!!”", "Author": "clapwoman", "ReviewID": "UR110979206", "Content": "The Grand Hotel Beverly Hills gave us a very warm, memorable experience; the decor is very chic, the rooms exceedingly comfortable, the staff exceptionally friendly. The food at the restaurant was wonderful, especially pasta with seafood sauce!! The Beverly Hills is next to Villa Borghese and the Museum holds the most beautiful sculptures I have ever seen Apollo and Daphne is breathtaking....The park grounds are a nice place to stroll after seeing the museum. We enjoyed renting the electric dual bicycles which you can ride all over the park. PS: You MUST book this museum in advance!", "Date": "June 1, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Toronto, Canada", "Title": "“sub-par”", "Author": "starlayna", "ReviewID": "UR109624226", "Content": "I must say that most of the staff were great! Some are not fluent in English (obviously, I don’t want to sound like one of those annoying ppl that give a hotel a bad review not based on realistic expectations) But there was one incident were I asked for a cab and a staff member pointed to a payphone. I was pretty upset I had to go through all that work to call a cab! that’s what hotel staff are there for! I waited till that staff member was away from the desk and I asked another conceirge and I got a cab called that way (lol!!) My partner and I haven’t had a worse shower in our lives. If this is important to you, be aware of this. Accomodations: far. Expect about a 13 euro cab. Here’s the deal: Hotel beverly hills!! Your hotel is far! The LEAST YOU CAN DO IS OFFER FREE INTERNET!! This way your guests can properly manouvre there way around rome, or plan out their stay better. The fees you charge for internet are obsurd!!!! I feel like this is the least you can do to is add this as an inclusion. You need to communicate better with your tour companies, as most of the time the hotel had no idea what was going on with which tour. I know this is not your responsibility, and it’s the tour operator, but a little initiative would be amazing. All in all, I wouldn’t stay here again. It is not because of the staff. I would take my money, and add 40 bucks onto it to spend my time in a central area. I would re-consider my rates, and start to include more services for guests if I were you.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Tunis, Tunisia", "Title": "“To be avoided!”", "Author": "FMaTunis_Tunisia", "ReviewID": "UR102576351", "Content": "Far from the center of Rome, the only attraction near the hotel is Villa Borghese. The hotel is definitely not a 4 star hotel, but rather a 2 stars. Decorated with awful taste, the grand hotel Beverly Hills has absolutely no charm- but with a name like that, what should actually one expect?!! Everything about this hotel is bad- cleanliness, clientele, noise, location; definitely a bad choice!", "Date": "April 2, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Enjoyed our stay very much! Convenient location.”", "Author": "Jenschneidey", "ReviewID": "UR101821895", "Content": "We booked this trip 1 month prior and we were very happy with how easy it was to get around Rome and travel to Florence from this hotel. Highly recommend the train to Florence from Rome at 1 1/2 hours. Very easy to find a hotel once we were in Florence. Grand Hotel Beverly Hills is conveniently located to public transportation and is a generous walk to many historical sights and landmarks. Hotel website shares that it is a short distance to many areas on foot. This is not the case. However, we enjoyed the 20-45 minute brisk walks. Two very valuable and loyal employees that we enjoyed getting to know were Giovanni and Velario (sp). They were very personable and had much knowledge of the area and all of Italy. We very much enjoyed talking with these very personable men that we truly considered friends by the time we left The windows in the room were thin and noise was abundant. I understand that the windows were replaced but the sealant may be an issue. We were very content in this hotel but we would not feel good if we did not share this issue. La Balestra around the corner from the hotel is a 'must experience'. Great food and run by the family. I few were to visit this same area of Italy again, we would visit this hotel,again.", "Date": "March 28, 2011"}], "HotelInfo": {"Name": "Grand Hotel Beverly Hills", "HotelURL": "/ShowUserReviews-g187791-d230556-Reviews-Grand_Hotel_Beverly_Hills-Rome_Lazio.html", "Price": "$119 - $393*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Largo Benedetto Marcello 220</span>, <span class=\"locality\"><span property=\"v:postal-code\">00198</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "230556", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/e9/9c/a7/exterior.jpg"}}