{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Amsterdam", "Title": "“Small room, but comfortable and fantastic breakfast”", "Author": "EllesP", "ReviewID": "UR126380325", "Content": "This hotel was perfect for us. Great price vs comfort. The location is not downtown Berlin, but with the tram in front of the hotel we quickly reached all the hot spots. The breakfast is great. Why? See my pics.The only complaint is the noise @ rooms facing the street. There is no airco, so with open windows the noise it horrible. We did not sleep at all. The next day we were moved to another room (on new years eve...full hotel) facing the court yard, thank god!, and we slept like babies.Great service. Hightlights for food: Vietnamese restaurant Si An @ Prenzlauerberg.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Aesch, Switzerland", "Title": "“Nice design and excellent staff, roomservice with room for improvement”", "Author": "catiraPalma", "ReviewID": "UR126028827", "Content": "I stayed during the trade show ITB in March at this property. My room was in the main building on the 5th floor with a nice balcony, facing the cross street. I slept with the window open, traffic noise wasn't too bad. The room was spacious enough for being a queen bedded room, large safe with plug inside, flatscreen TV, minibar, etc all good. Internet comes included in the room rate. All staff I met was very friendly, both at front desk and in F&B service. The bathroom was good too, with a real hairdryer and not one of those super small ones. Only thing I have to comment here is that in the shower the shower tube's tap was loose, and there was some painting to do above the mirror. Breakfast was served across the patio (this is a negative, as you have to cross a parking lot to get there - either take your coat or umbrella, it's about 100 yards so with rain it's long enough to get wet). Nice large breakfast buffet with an option of scrambled eggs, variety of cheese, sausage, breads, jams, muesli, etc. I believe in this building there is also more rooms as I saw another elevator and people getting out with luggage. I tried room service once, this was a negative. My order came incomplete, and plates were covered only with aluminium, not with the usual cloches that are placed on them. Thus, wasn't too hot anymore. Minestrone was ok, but the Cesar's salad was disgusting. Salad leaves were definitely not fresh anymore, sauce was very oily, chicken was minor quality and had a weird taste. Still would visit again, although definitely not for ITB as the location is not good. Next public transports SBahn is about 1km walk, and takes forever to get to central Berlin or even fairgrounds. To Alex / Brandenburger Tor etc by Taxi I'd calculate 10/15min.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "munich", "Title": "“General review”", "Author": "pinme", "ReviewID": "UR123344361", "Content": "Very nice, cosy and romantic hotel. Reception extremely helpful, smart and nice presentation. Good food and reasonable price however limited menu. Matress and linens were very confortable and TV superb however without CNN! Room and B'rooom lights could be a bit stronger; however romantic if one wants it. Only negative of my room was the shower which could have used a good cleaning and there is no shoe cleaning kit available. I did not try B'fast. Remember when booking the hotel is in the East part of city therefore requires quit a taxi to the West areas.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boras, Sweden", "Title": "“Outstanding Hotel in former East Berlin”", "Author": "Thorkild N", "ReviewID": "UR120493375", "Content": "When visiting friend which now live in a flat in former East Berlin we those to try the hotel New Berlin. The only reason we had to choose this hotel was that it was only a 100 meters away from the flats belonging to our friends. However the hotel was a huge surprise. A very friendly and very informative information at the arrival. The whole hotel was very fresh and during our whole stay the service was amazing, in terms of perfect. The hotel rum was excellent. The whole hotel and the rooms had a very distinct architecture and down to the little thing it was genuine to its nature. The breakfast with no doubt five stars. Furthermore, in this area of Berlin you can go out to the little restaurants around the hotel. There you can find a very personal service and extremely inexpensive for a city like Berlin. For two persons with a three dish meal and water and a bottle of vine (1 liter and a very good Valpolicella) the cost was about 25 to 30 euro - altogether. It’s not the last time we will those hotel New Berlin. The hotel deserves a five star with no doubt and the areas around the hotel with small restaurant, with tramp and bus – or walking you can reach practical most of Berlin. However to a cost here is only a fragment compared to other places I Berlin", "Date": "November 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Cairo, Egypt.", "Title": "“Nice New Berlin Hotel.”", "Author": "Akramdash", "ReviewID": "UR100366919", "Content": "New Berlin Hotel is a Really very good Hotel, it is 4* and it really deserve it. Hotel location is not very central, but the tram M5 & M6 are 100 m. away, and from there it is a direct line to ALEXANDER PLATZ and more, If Prefer to take the S lines it is almost 15 min walk to Lendersberg Allee Station. The Hotel it self consists into 2 Buildings \" Classis & Mediterranean\" my room was in the Med. House, very spacious Room \" 404\" , very well equipped , Huge space, King Size bed, Nicely decorated bathroom, \" no tub\", TV is a normal classic one Not LCD, has almost 35 channels all in German language !! Mini Bar and Safe are existed into the room closet, Free Wi Fi, No Tea & coffee Facility. Breakfast was OK with good selection of food. Staff are excellent and Nice and ready to go the extra mile to serve you. Hotel Rooms \" or My room\" has No A/C , I think that will be very needed in the summer time. I also recommend the hotel to have bill boy service for the Luggage and Luggage trolly, I had 3 suitcases and there was only the Restaurant Waiter to help me with them \" Very nice of Him indeed\". reception staff \" the ladies\" are all exceptional.", "Date": "March 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Leverkusen", "Title": "“Nice hotel in Berlin-Friedrichshain”", "Author": "AndreaLeverkusen", "ReviewID": "UR31642459", "Content": "The \"New Berlin\" is a nice hotel in the Eastern part of Berlin. It consists of two houses, one at a mainstreet (classic house) and one in a courtyard. We had room 507 in the classic house. You can hear the noises of the street a little bit but we didn´t care. The rooms in the other house (the Mediterranean House) must be more quiet and bigger (they did cost 95 EUR, our room 85 EUR per night). Our room was nicely furnished, not too big but big enough for the two of us. The bathroom was very nice and seemed to be new (marble). You even can dim the light. You get a free bottle of water each day. And you can use the sauna free of charge (we had not time enough to do that). If you want to you can have breakfast for EUR 12 each person. You get a piccolo and can choose how you want to have your egg (the boiled ones are on the buffet, sunny side up and scrambled are freshly made), have cheese, cold cuts and fish and much more other appetizingly things. Around the hotel are mostly apartment houses, no restaurants but a discounter. But you don´t need to have restaurants nearby as the streetcar stop is around the corner and you can drive to Berlin Alexanderplatz in about 5 minutes. And the hotel has its own restaurant and bar (I think it was italian, but we didn´t test it). As we were sitting at the bar one day at 0.20 a.m. (the kitchen closes at midnight) we heard that other guests asked for something to eat and they opened the kitchen for them again. The whole hotel staff was that nice! You can buy tickets for the streetcar in the hotel, too. The help you by choosing what is best. And they give you a map and a subway and streetcar plan. We certainly will come back although the hotel is not in the middle of the town!", "Date": "June 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Berlin", "Title": "“Good deal”", "Author": "LukeSkywalker", "ReviewID": "UR10087544", "Content": "We stayed there because a friend had recommended it to us. Our first impression from the homepage was: ugly design, horrible colors. In reality it turned out to be a nice hotel, clean and at a good price. The design isn´t really fancy, but not ugly. The room was very clean, spacious and very quiet. The hotel is situated in a rather boring but safe area of Berlin, there are not many restaurants nearby, but two supermarkets are around the corner. But therefore it is directly at Tram M10, which will take directly to the cool Kastanienallee/Prenzlauerberg area within 5-10 min. Alexanderplatz is about 8 min with Tram M5 and 6. The breakfast buffet was really nice with a large variety. On Sunday we joined the brunch buffet in the restaurant, which was rather boring - take the regular breakfast, it is cheaper and better.", "Date": "October 16, 2007"}], "HotelInfo": {"Name": "New Berlin", "HotelURL": "/ShowUserReviews-g187323-d230573-Reviews-New_Berlin-Berlin.html", "Price": "$118 - $186*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Petersburger Strasse 24</span>, <span class=\"locality\"><span property=\"v:postal-code\">10249</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "230573", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/d9/a4/5e/aussenansicht.jpg"}}