{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“the Zone hotel”", "Author": "terrymarks", "ReviewID": "UR127525414", "Content": "stayed at this hotel from March 19th to 21st 2012. on arrival, staff at reception supplied us with maps of rome. told us about transport to and from the Hotel, and how much it cost. marked out sights to see on the map. we only used the local bus once, then used the hotel shuttle to take us to central rome, and got taxis back at night. taxi cost an average of 15 euros. well worth the price. the staff were friendly and helpful at all times. the only downside, was not the hotel, but the surrounding area. it was very dirty, on the pavement, some filled with rubbish, and dog dirt. had to walk on the road most of the time.pavements also full of potholes. would not like to walk the area in the dark. need also to remember, if using the bus, to buy ticket, cost 1 euro, at tobbaconist BEFORE boarding. there is a fine of between 50 and 100 euros each ON THE SPOT if you dont have this ticket.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Italy", "Title": "“Perfect for a visit to Rome”", "Author": "tageSK", "ReviewID": "UR121897249", "Content": "Looking at the map the hotel seems to be in the distance. In reality, however, Bus 990 and train FR3 all passes in the vicinity. Thus, getting to downtown Rome is a breeze, also in the week ends. The hotel itself is very modern, has a breakfast that will satisfy also non-Italian travelers, proper room-service and a well stocked bar. The room and other facilities is as one can expect from a four-star hotel. Within walking distance we found several trattoria and even a more than decent Chinese restaurant. Free underground parking. We were there in winter and the price was a mere 55 euro/night.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Not very good”", "Author": "jpn n", "ReviewID": "UR121231581", "Content": "My husband and i spent 2 night at this hotel and couldn't get out of there fast enough. It is new and very clean and has a good shuttle service and that is about it The hotel is in a very dirty built up area and is a long way from anything and after being out all day it is just to far to go into town again for dinner 20- 25min drive. We were given a small hot, stuffy room on the first floor. You had to climb into bed or you hit the wall. The air conditioning had been turned off and you couldn't open the door as the bed was up against it. The bathroom didn't have anywhere to hang a towel or put any of your toiletries in. The breakfast was served in a airless room that looked like a double garage. The coffee was made and kept in a thermos if you wanted a cup of tea they had tepid water in a thermos. When i asked for fresh boiled water I was told the water in the thermos is freshly boiled, it was dreadful tasted like plastic. They served the same dry pastries every morning. The breakfast staff were pleasant but the staff at the front desk made you feel like you were intruding if you dared ask for anything. There are better places to stay.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Chi City", "Title": "“Deskgirl destroyed my ready to mail postcards, and IMPOSSIBLE!”", "Author": "PermVaca", "ReviewID": "UR119598686", "Content": "You read that title correctly. This is not the only reason for the one star. The other desk clerk was rude from the start. He did not want to accommodate me into my friends room or upgrade us. He could not understand anything we were saying. He repeatedly said, \"IMPOSSIBLE!\" That is the moral of the story, everything about this hotel is impossible! It started with the bed. Sharing the bed is impossible. It is small than my dorm room bed. Sleeping on the floor is impossible because there is barely enough room to get through the room. Other things impossible: The wifi is impossible to get except in the lobby, the one computer in the lower level of hotel is impossibly slow, a decent breakfast is impossible, unless you like warm milk. Easy transportation and good food around here: impossible. Calling a cab to the airport: IMPOSSIBLE! This is what led to my postcards being fervidly torn up and thrown in the waste can. We asked for a taxi to bring my 2 friends and me to the airport. We had to make one stop before and so the lady said we will not make it to the airport (my one friend had an hour earlier flight). She cancelled the first cab. Then she suggested to order 2 cabs because the one cab she said was approximately 45 minutes away. Ok... Then the cab shows up 10 minutes later. We said cancel the other cab we have time now. She refused to cancel saying she will be in trouble. She had no problem canceling the other cab and she told us we wouldn't fit in there. We fit in the cab just fine. And it turned into me saying, \"I'm sorry we have to go! We don't have a lot of money for 2 cabs, since she was pressuring us into 2 cabs in the first place.\" Do you know how expensive cabs are to the airport??? Let alone anywhere in Italy. You have to pay for the cab to come to you and then to where you are going. It's ridiculous. So she is saying, \"You can't!! You can't\" Yelling and I kept apologizing but we had to go so we left. I felt bad, but I also felt like she was trying to scam us. Then I realized I handed her my 7 postcards to different family members to mail 10 minutes before that, with stamps. Can you guess what happened? They never made it to their destinations, my other ones from the day before I dropped in the Vatican did. I am not going to say she is a bad person. I can see somebody in the heat of the moment ripping up some paper postcards angrily. Maybe she regrets it, maybe she doesn't, but my family was looking forward to getting postcards from Italy from me. This hotel is just not worth staying at, and this experience was terrible for me and impossible to forget.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Newcastle, Australia", "Title": "“Excellent Hotel”", "Author": "Ljupco M", "ReviewID": "UR118395488", "Content": "Very modern, stylish, and new. I loved it. Wifi, friendly staff, free parking, excellent breakfast, clean, a must. Only slight small problem, it's not 100% conveniently placed, but a train station is about 10-15min walk, but you must change to get the main line heading to rome city.", "Date": "September 21, 2011"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1", "Location": "2"}, "AuthorLocation": "Kfar Monas", "Title": "“MADE a reservation BUT the room was NOT held for me !!!”", "Author": "DoctorHenry", "ReviewID": "UR118311221", "Content": "I have made a reservation for myself and two other friends with this hotel using Hotels.com online. I personally was in contact with the hotel reception desk by email a day before arriving at the hotel. BUT to my suprise the room was avalibale more then that no room on the hotel was available!!!!so the sent us to a different hotel, same category but not even close to were we need it to be!. In short this has never happened to me or any one I know that makes booking on line with a leading company like Hotel.com!!! Never ever do any business with this Hotel!!! This is for your own personal safety and well being!", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Nice hotel... but far from Rome”", "Author": "SpdGrfr", "ReviewID": "UR115492566", "Content": "Stayed at Zone Hotel for leisure trip in June 2011. Hotel is situated in a nice quiet residential area in Monte Mario. Safe enough to walk around in the evening and shop/browse around the few commercial streets around. Public transportation is a 10 minutes walk to FR3 regional train station Balduina. From there, a short trip takes you to a transfer possible on Line A train Valle Aurilia, but be sure to commute anywhere from 45 to 75 minutes to get to Rome. The hotel shuttle takes about 15 minutes to Piazza Cavour, on reservations at front desk only. The basic room on the second floor, was very regular. Clean sheets, clean towels, vacuumed daily but a bit disappointing compared to the overall look of the hotel. Even my travel agent was shocked when I told him about the look of the rooms, web site sold it as an classy stay... but not on the 2nd floor! There are no ironing board and no additional power outlets to charge a camera or mobile phones in the rooms. Even if there is a 120V converter in the bathroom, but it might no be the best place to put a mobile phone to charge while your in the shower. Hair blower wasn't working as well. The bathroom isn't the best part of the room, big enough for a single person and unfortunately the way the shower is built, all the water from the shower ends up on the floor and even outside the bathroom after a shower. The rug in the room was always wet after a shower and the smell of the humid rug and humid shower curtain was really awful. The restaurant has a great service. The food was great and the small selection on wines and local beers is more than enough. The barman/waiter offered an awesome service and was very helpful with information on transportation, safety in Rome, buses, tours and TV shows to watch! He was very friendly and is definitively a valuable resource for this hotel. The breakfast is just good enough to get your day started with it's diverse menu but after 3 days it really gets on your stomach! But it's quite fair compare to what's available to breakfast in Rome. There's a tiny pizza joint called City Pizza on the same street as the hotel, where the servings are really good and the pizza is quite good tasting and affordable. Overall Zone Hotel is good, would be even better closer to Rome... but somethings you just can't change!", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "San Diego, California", "Title": "“Love Rome but not the location of hotel”", "Author": "LGriss", "ReviewID": "UR115242972", "Content": "The hotel was nice but more hidden all the way in the back of a residental area. All the receptionist was very friendly and helpful. The resturant was perfect, inside and outside spots to chill and eat. The waiter was wondereful. Wireless service was great. The Breakfast was great.", "Date": "July 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Awesome place to stay”", "Author": "Ryan8033130", "ReviewID": "UR115122442", "Content": "The only negative comment I can make about the zone is it's location. It is a bit far from the city center and if your caught looking for food at night your out of luck as many business close early. However if you take advantage of the free shuttle service or catch the 990 downtown then location becomes less of a hassle. The room itself was very modern and mimicked the minimalist style illustrated in the lobby which in my opinion is very appealing. Tv had CNN eurosport and RT, with more chanels if you wish to purchase them, which came as a surprise since most euro hotels lack English channels. Breakfast was simple yet did a sufficient job supplying the guest with everything from cold cuts to eggs and everything in between. The restaurant surprisingly was very good considering my usual experiences with hotel food my only suggestion is that they put a beer on tap rather than only having bottles, but hey you can't get everything Probably the greatest quality of this hotel is its staff. Initially my flight out of JFK was canceled and I lost my bag during my stay and the reciiptionist was more then courteous in helping me retrieve it. Once while working out in the gym I thought I had gone in unnoticed yet within 2 mintues a employee came flying in the turn on the tv and make sure the room was at a suitable temperature. In summary the hotel zone is just an great hotel and I will be staying here when I come through next time in early august", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Arlington, Virginia", "Title": "“Great hotel, outside from the city but great location!”", "Author": "katiuska15", "ReviewID": "UR112462016", "Content": "I actually went there in May 2010 with my mom. It's a little far (20 min shuttle ride) from downtown Rome and the vatican but they provide a great shuttle service that runs from ealry in the morning and until late at night free of cost. the breakfast was delicious, the staff was very helpful and nice, and the rooms were very clean and comfy. I would come back in a heartbeat!", "Date": "June 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“In a great little location outside the city centre!”", "Author": "PSB123", "ReviewID": "UR95690730", "Content": "I really enjoyed my time at Hotel Zone. When my partner and I arrived in Rome, the cab driver new the exact location, so no troubles there! The cost of the cab will, however, set you back around €45, so a tad expensive!! The hotel is located in a residential area - it was lovely walking around and discovering the little shops and restaurants. There is also a supermarket about 15-20 minutes walk from the hotel! The nearest overground station is Balduina, which is about a 10 minute walk from the hotel. There is a little shop next to the station where you can buy your travelcard from (about €3). When you catch the train at Balduina, you are a few of stops away from an area that has a Metro station (check your maps). Although this sounds like it would take you ages to get to the city centre, it only takes about 30 minutes max! Alternatively, you can use the free shuttle bus (people carrier) that the hotel provides in the morning. You'll need to register your seat/s with reception. We always got a seat when we needed them. The shuttle bus will drop you near the Vatican. Staff at Hotel Zone were friendly, especially the bar man (who was sometimes on reception). He was always happy to help answer any questions we had. The food served at the hotel was lovely and the free breakfast was nice (which included bread, scrambled eggs, pastries, cereals, juice, tea, coffee, etc)! The hotel room we had was clean and the bed was comfy. The walls, however, are very thin and you can pretty much hear everything is the rooms next door. It was also a bit annoying when I wanted a lie in but I couldn't because the cleaners were hoovering! It would also be great if there were tea/coffee making facilities in the room. Overall, a nice hotel in a lovely area (I felt like a local).", "Date": "February 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Camarillo", "Title": "“Don't be fooled by room photos”", "Author": "OBZRVR", "ReviewID": "UR90822242", "Content": "The hotel is reached by traveling through a neighborhood. Taxis often had trouble finding it and drivers had to call in to try to get directions. The hotel is not close to the main tourist attractions. You need to walk through the neighborhood back to a main road to catch a bus. Once you figure out the buses and metro, it is fairly easy to get around and taxis are always available. Be prepared to carry your luggage up the stairs to the reception area by yourself. The lobby and reception area are very modern but quite spare in furnishings and decor. There was a single receptionist who was efficient. A non English speaking bellman helped us find our room and deal with our luggage. There are two, very tiny, shabby elevators. Our room was a huge disappointment; very small, shabby, with crumpled, torn light shades and it was hot. There is no air conditioning in the guest rooms. We returned reception and complained that the rooms were not as depicted in their online photos and that we would leave. We were offered an upgrade (additional cost) to what they called their \"superior\" room. This was a much nicer room with more modern furnishings and bath fixtures. There was a lot more room and there was a sliding glass door leading out onto the roof top terrace. We stayed. The free breakfast in the AM was adequate. If you get there early enough, there are scrambled eggs. Othewise, there is an assortment of breads/pastries, yogurt, cereals, thin ham slices, cheese, canned peaches, juice and coffee or espresso. Although we did OK at this hotel, it will never be my first choice.", "Date": "December 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Rio de Janeiro, RJ", "Title": "“Avoid staying at this hotel”", "Author": "idljapan", "ReviewID": "UR90202618", "Content": "My wife and I checked in at Zone Hotel, Rome on December 15 . We have made a reservation for 3 nights. The following day (December 16) I tried to open the safe box but it hasnot opened then I called for assistance. I found it very weird for not being able to open the safe box by inserting my four digit password. I promptly checked the amount of money that I left inside the safe box. I had 1500 Euros but after checking there was only 1095 Euros. So 405 Euros was missing. I had being stolen . I went straight and talked to manager of the hotel and she said that she could not help me with that. She could only advise me to report to police. She told me that the police station close to the hotel could not speak english and that I should go to police station in the Rome center. The following day I had no time to go to police station and I knwe that even if I report , they wouldnot get my money stolen back. When I was having breakfast(December18) with my wife prior to checking out. I saw a family of 4 brazilians in the same hotel. I told them about the incident and I warned them not to place money or valueble items inside the safe box. They promptly went back to their room. When I was the hotel lobby, they told me that the safe box could not open and they had the hotel staff to open for them. I hope that they havenot been stolen and become a victim like us. I learned a lesson the hard way. Never place your money or valueble items inside hotel safe box. They (staff) can easily open with a screwdriver. If they steal your money, it is going to be your words against theirs.", "Date": "December 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Carson City, Nevada", "Title": "“If you like suberbia of a National Capital this is the place for you.”", "Author": "robren88", "ReviewID": "UR62640372", "Content": "The good things about this suburban hotel are: the Staff is very friendly and helpful. The bed and linens are above average and the breakfast is very good. The neighborhood is very quiet . The bad things about this hotel are: the shower in the middle of the room, a design concept for the Zone I'm sure, is awkward and the shower leaked. The rooms are not soundproof and any noise be it neighbors flighting or loud airplanes overhead can be heard. The location is difficult to get to by using public transport unless you are very adept at this (fortunately we are).", "Date": "April 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Cape Cod", "Title": "“as in \"Twilight Zone\"”", "Author": "islander34", "ReviewID": "UR57161333", "Content": "As if Italy isn't disorienting enough, along comes \"The Zone\". I knew I was in trouble on arrival when I could not locate the check-in desk in the very minimilistic lobby :))! Maybe I was tired after a morning long search by car for the hotel. The Zone is located in a residential/office area, surrounded by green space (aka dog potty). The room was clean and spacious but the shower leaked into the desk area. Staff was helpful and friendly. Internet room 1 euro per hour. We were given a great map. Shuttle was full for 8AM and 9 so we opted for the bus into Rome. Walked a few blocks to tabachi (more dog pottys) for tickets (not needed but good to have). Bus 990 dropped us at Piazza Cavour, a short walk to St. Peter's. You can get off earlier, but the bus will stop only at regular stops. The hotel dinner menu is pricey and there are not many places to eat in the area. We did find a great roast chicken/pizza takeaway nearby. Be careful when booking online. For some reason still unknown, $30 was added to my bill. In my opinion, the Zone is a hotel for business travelers.", "Date": "February 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Location": "1", "Rooms": "5"}, "AuthorLocation": "Finland", "Title": "“Too far from the center”", "Author": "Missy_Finland", "ReviewID": "UR54860824", "Content": "The hotel is a good 4 star hotel. Rooms are big and clean. Staff is friendly and helpful. There is really good restaurant near by (alongside to the metro station). The hotel is really far from all the main attractions. The hotel offers a car ride to the city center during certain hours. In the distance are also a metro and bus stops but there are a lot of dog leavings in the streets leading to the hotel which are difficult to avoid in the dark. I recommend that you choose another hotel.", "Date": "January 31, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "1", "Rooms": "2"}, "AuthorLocation": "greece", "Title": "“far from city centre”", "Author": "johnhgreece", "ReviewID": "UR50958790", "Content": "This hotel is OK but very far from city center and almost from everything. You have to walk about 15 minutes to take one train that passes every half an hour. Then you have to take the metro to reach city. Although they claim to have transportation ro the city center you have to book well in advance and sometimes its overbooked If you do not have your own car do not try it.", "Date": "December 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "1", "Rooms": "3"}, "AuthorLocation": "Canterbury, United Kingdom", "Title": "“Such a shame”", "Author": "TractorBoy101", "ReviewID": "UR36185238", "Content": "We booked the Zone for a Valentine's trip to Rome. The room was clean and comfortable enough, but it was sooo far away from the city centre that I rang the travel agents back in the UK to change hotel to one more centrally placed. It wouldn't have been so bad if there were things to do nearby, but there was one restaurant about a ten-minute walk away, and the rest of the area was almost entirely residential. The hotel did have a small bar of sorts, but it was literally a small room with a couple of tables, staffed at two-minute intervals by the flustered-looking bell boy who was summoned to serve us by the receptionist each time we wanted to order a round. Would be fine for a business trip where you just need somewhere comfortable to sleep before being taxi'd to your conference in the morning. If you're going to Rome on a tourist / sightseeing trip, then forget it.", "Date": "July 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "York", "Title": "“Lovely hotel - a little hard to find”", "Author": "Y0rkfamily", "ReviewID": "UR29386054", "Content": "We stayed here over Easter, a very busy time in Rome. The hotel is very hard to find if arriving by car even with Google instructions but is extremely clean and modern once you get there. The staff on the front desk were very friendly and helpful, as was the shuttle bus driver who chatted with us about where we were from while waiting for other guests to arrive. We used the shuttle which drops you a few minutes walk from the Vatican but there is a bus service if you want to stay out later. Breakfast was good and parking at the hotel was no problem. We even drove into Rome the night we arrived which is not as scary as you might think! All in all good value for money.", "Date": "May 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Muscat, Oman", "Title": "“Good hotel, quiet neighbourhood but a little away from the city centre”", "Author": "MsSunshine10", "ReviewID": "UR27386747", "Content": "This hotel was booked for us as part of a travel package with our airline. Finding the hotel was a bit difficult. We took a train from the airport train station and reached Termini (main) station, from here we had to take the 990 bus to Baldunia, where the hotel is located. It took us abt 2 hrs to reach the hotel from the station as we lost our way in the middle, it was quite dark and most people were not familiar with the area. The neighbourhood is quiet and pleasant with lots of trees. Its nice to take a walk at night. The hotel is located on a hill. The views from the terrace are nice. The girl at the reception desk was very helpful and provided us with a map and bus routes. B/Fast was good and alongwith the regular items there were eggs, salami, cappuccino and hot choc (amazing). the lady who served b/fast, Marina was very kind and made it a point to wish everyone Boun Giorno. There is a free shuttle service from the hotel at 8:30 & 11 (twice in the morn) and back again to the hotel in the eve from Piazza Cavour. But be sure to book ur trip the prev eve as only 8 people can be accomodated at a time. By the 2nd day we were quite familair with the area and had no trouble getting a bus to the city (15-20 mts) and back. The bus stop is a few mts walk from the hotel. The room and bathroom were small and clean with basic amenities.", "Date": "April 4, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "paris", "Title": "“far far away”", "Author": "danimajo", "ReviewID": "UR24490977", "Content": "clean and modern, average gym and nice breakfast...BUT far far away from the city and the female staff was unpleasant !!! terrible service from the waiters !! it's certainly not a 4 stars hotel", "Date": "February 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fountain Hills, AZ", "Title": "“Good Value”", "Author": "jmemerson7", "ReviewID": "UR19619923", "Content": "In a quiet residential neighborhood. We love to explore so the 10 minute walk to the train or bus was no problem. Karim, at the front was great and very helpful. Genuine! Price was tough to beat. Good value. Air conditioning was below US standards but just a small inconvenience. Pantea, at the front desk was also helpful. Would go back. John and Ann", "Date": "September 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "uk", "Title": "“Few words of warning”", "Author": "riania", "ReviewID": "UR17577819", "Content": "The hotel and rooms are very clean. is def 4* as rated. it is far from the city centre. the hotel offers a free shuttle to the city...but on has 8 seats which you need to book in advance. Taxi costs around 15-20 euro one way. The female staff are unfriendly on the front desk. Not once did i see them smile in the 5 days i was there and were not helpful at all. Paulo on the front desk was extremely helpful, very welcoming. The air conditioning in the room is not great and the reception area has no air conditioning. in the shower the water leaks onto the floor. There is no iron facility and the hair dryer provided hurts your hand. it does get noisey as the hallway has wooden flooring, so people walking with shoes can be heard clearly and the cleaners are not considerate when they start cleaning at 7.30am a lot of banging.", "Date": "July 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Birmingham, Alabama", "Title": "“Rough around the edges, but very nice!”", "Author": "ashleyhsmith", "ReviewID": "UR17260698", "Content": "My wife and I stayed 4 nights in mid-June 2008. Our primary reason for choosing this hotel was its proximity to another hotel where family members were staying (in order to meet up with them daily). That said, I don't understand when reviewers weigh location so heavily against a hotel--it's not as if the hotel changed locations before you arrived. You know in advance where they are, and you can look them up on Google Maps, multimap, etc. A little research goes a long way! This hotel is indeed not very close to the central tourist area, but the price reflects that. My wife and I were regularly able to walk 10 minutes to Balduina station and take the light rail to Trastevere, or transfer to the Metro at Valle Aurelia. For anyone who has used big city transit before, this is not a big deal. We were in the historic center within 30 minutes each day. A ticket costs 1 Euro, while lesser hotels in a \"better\" location are often an additional 50 Euros or more per night. You can do the math... PLUSES: 1. Excellent and friendly desk staff, especially Paolo. All spoke very good English and most were extremely helpful--you could transfer this staff to the Cavalieri Hilton (EUR400/night) and they would fit in perfectly. We were very impressed with their professionalism and work ethic. 2. Clean rooms with plenty of information available. 3. Good closets and lots of shelving space 4. Very good breakfast staff, plus a pretty good breakfast. The eggs were marginal, but the cold meats, cheeses, yogurts, coffees and pastries were all very good and filling. 5. Free parking and exercise room (we did not use either one, but worth noting) 6. Bellboys were VERY quick and helpful. 7. Common areas were fairly clean and well maintained. MINUSES: 1. The air conditioner in our first room stopped functioning after a few hours. The replacement portable A/C required the window be left open for the exhaust hose. It rained that night. Not very pleasant. However, they were able to move us to a new room the next morning. 2. The wallpaper in both rooms was peeling, though not excessively so. 3. Upon check out, the desk clerk insisted that my credit card would not work (this would have been the first failure in 9 years, including 5 trips abroad). I ended up having to walk nearly 30 sweaty minutes round-trip to the nearest ATM to find cash to pay the bill. I am almost certain that this was a ploy to get me to pay in cash; if not, it sure is an odd coincidence. I used the same card without problems for two additional weeks in Italy. This particular desk staffer had a bad attitude in general, nothing like the other two we dealt with during our stay. If the key statistic is \"Would you stay here again?\", then the answer is definitely YES. Even if I wanted to stay closer to the historic center, I would still consider staying at Zone and making the transfer into town each day--I doubt you'll find a better experience for the money anywhere in Rome.", "Date": "June 26, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Ontario", "Title": "“Plenty of Surprises”", "Author": "Prof49", "ReviewID": "UR16464427", "Content": "Hotel is clean but the service leaves a lot to be desired. On the good side, they have free underground parking and provide a free shuttle to downtown if you sign up--only seats 8. Don't count on it being ontime, no guarantee of a return trip either if full. This hotel is far from downtown. Our problems were with the a/c. It was hot and the air didn't work well. They ran out of most everything for breakfast on our second day because 'a large group came in ate it all'.The desk clerk told us they were full (they weren't) and wouldn't change our room when we had a/c problems. Requests for restaurant recommendations were met with only 1 choice by the desk man. We had a car but he wouldn't recommend any other place--odd. The keys are cancelled anytime the hotel staff comes in to change a bulb or to try to fix the a/c. The don't tell you this either. No hot water one day. After 3 days, we had surprises everyday--not the Holiday Inn. Minus the sarcastic desk man, the place is tolerable. Not the worst place I've been to, but close.", "Date": "May 28, 2008"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "joisey", "Title": "“Noise; uphill walk; room door security; and what's good, too”", "Author": "jerz88", "ReviewID": "UR15249185", "Content": "Better be in good shape if you stay out here. The location is about a 20 minute, 1-euro, many stop bus ride to downtown. And, that requires a 5-10 minute, mostly uphill walk to the bus stop. (The hotel has a one-trip, free shuttle you can reserve, but it only seats eight people -- you do the math!) The Room: Our first room on the 1st floor was awful -- crammed, noisy all night and early am -- thin walls. Also there was a notch out of a metal piece on the outside door -- apparently forced open (maybe by a guest). No chain or peep hole on hallway door. Couldn't sleep! The unhelpful guy at the desk suggested we keep it, that it was as good as it gets. I almost did! Our second room was a big improvement -- spacious, reasonably quiet, not at street level! This may account for differing opinions. The Neighborhood is nice -- some upscale cars at the neighboring apartments; good pizza place, and a snack bar nextdoor, a few minutes away. BEST of Zone...great full breakfast, wonderful meats. WORST...Front Desk (& cab drivers) not friendly or real helpful. (FYI: It cost 22 and over 24 euros, respectively, to get to and from the main train station (Termini) in town.)", "Date": "April 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "2.0", "Value": "1", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Noisy rooms”", "Author": "BA_Uk", "ReviewID": "UR15017570", "Content": "After reading all reviews of this hotel, I decided to book a room in this hotel.The reason for this hotel, is that reviews of other hotels were even more critical, and some reviews here were positive. Ok...there are good things, and there are bad things with this hotel. The bad things. 1. I have spent a lot of nights in hotels in Europe. This is NOT a 4-star hotel. Whoever gave them the 4 stars must be currupt!! 2. The rooms are extremely noisy. Not from outside traffic; there is no traffic as the hotel is at the end of a dead-end road. The noise comes from inside the hotel. You can literally hear everything that is being said in the room next to you. Even if you fart, they will hear it!!! Also, the hallway has laminate. This means that you will wake up as soon as the first people go for breakfast. The cleaning process is also extremely noisy, and starts at 08.15. 3. I have never seen a 4-star hotel with a curtain in the shower. 4. The breakfast is ok for a 2-star, but not adequate for a 4-star hotel! 5. The gym is nice, but who uses it after walking the entire day in Rome? 6. I ordered a single room on bookings.com, only to discover that the hotel has cheaper single rooms on their own websites. 7. Getting there from the airport is a nightmare; take a train to the city centre (Termini station, 11 Euro), then take a taxi (25 Euro for suitcase and Termini surcharges). Forget about buses and undergrounds. That is not practical in the evening with suitcases. 8. My single room was very small. 9. Usage of the airco requires a science degree. The nice things: 1. At 10 minutes walking distance, there is a great Italian restaurant. Follow the road, keep right, and at the end go to the right. 2. The only place in Rome where you can sleep with an open room in the night.No traffic noise. 3. Transport to the city centre is easy. Take their free shuttle, and walk. Go back by taxi (15 Euro). Summarising: This is not a 4-star hotel compared to Spanish and Portuguese standards. And believe me, I am an experienced traveller. Now a meesage to the Zone Hotel staff who tends to respond to these postings: Instead of appologising, please take action. My criticisms are exactly the same as those made by others 1 year ago. The breakfast is still bad, ok..staff is now friendly.....but if you know that your rooms are noisy, try to put customers as far as away from each other. Adjust your pictures on your website; I did not have a fancy bathroom and glass panels. Start the cleaning process later. Put a carpet on the halways. Add a device that ensures that room doors are closed c losely and quietly, instead a big bang. And above all, be honest and remove a star. And please, don't tell me that this for Italian standards it is 4-stars. The room + breakfast is 3 stars. Having a fancy gym should not count for an extra star. And if someone pays 100+ Euros per night, do you really have to charge extra for WIFI? Make it free.", "Date": "April 14, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "London", "Title": "“20min bus journey from Vatican”", "Author": "Nat008", "ReviewID": "UR14596072", "Content": "We stayed here for 3 nights at Easter and were really disappointed with the location of the hotel. The website says it is near the Vatican, it is in fact a 20min bus journey away and a 5min walk up a hill to the bus stop. There is no metro nearby, and if you want to get to some of the other sites of Rome like the Colosseum and Trivoli Fountain, then you need to allow at least an hour to get there. It meant that we never bothered to go back to the hotel before dinner as it took too long, and there are no restaurants nearby as it is in a residential area. The hotel was okay, but the buffet breakfast didn't give much variety, the shower wasn't hot and we did not like our bathroom being part of the bedroom (no door) with see-through doors for the shower and toilet! We would not go back to this hotel again, mainly due to the location but it also isn't great when you do get there.", "Date": "March 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Liverpool", "Title": "“A warm, friendly place”", "Author": "muccabud", "ReviewID": "UR13349870", "Content": "I have just returned from Rome on business. The conference I attended was at the Hilton, so I wanted to find a cheaper place close by. Hotel Zone is a nice hotel with a friendly atmosphere and friendly staff. Karim, the hotel manager there was very welcoming and tried to help with anything I needed. If you're looking for a place to stay which is not in the centre and at a reasonable price, then this is the place. If you are wanted to be in the centre of Rome, then I wouldn't recommend this as it's a 15mins drive to the centre", "Date": "February 7, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Dublin, Ireland", "Title": "“A Distant Zone”", "Author": "Liath", "ReviewID": "UR11098220", "Content": "This is a hotel with reasonably good and comfortable rooms. It has not got a restaurant, just a breakfast room. The lobby is small, especially for a big group (as we were). The bar is really just a corner of the lobby. Breakfast was average and certainly well short of Irish hotel standards; even short of most other continental breakfasts I have experienced. The staff varied from pleasant to grumpy, depending on circumstances. The swipe-card system for opening the hotel bedroom doors was very unreliable and frustrating. This resulted in lots of trips back to reception to have cards redone. A shuttle bus is available but it is not as freely available as you might expect from a hotel which is so remote from the attractions of Rome. It should be available on the hour throughout the day, as in a neighbouring hotel, returning from the city on the half hour. Your alternatives are to take a taxi and run up a daily extra and unnecessary bill or to go by rail. The train station at Balduina is at some walking distance from the hotel and has no ticket machine. You are then at the mercy of the local shop which may be shut or out of tickets (but they do cost only one euro). You must go two stops on this suburban rail line before changing to the metro (you will get more than your share of exercise on the station steps if you choose this route). If you return by rail after darkness sets in, you will find yourself walking poorly lighted streets from the station to the hotel. And if you are using the footpaths, beware of the constant dog-poo. The footpaths seem to be a dog's first call!!! If you are prepared to travel for 20-30 minutes to reach the Vatican etc., this hotel may suit you.", "Date": "November 27, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Kildare", "Title": "“Not bad but huge improvements required”", "Author": "GLSMAR", "ReviewID": "UR10080351", "Content": "Spent 7 nights here so this is comprehensive The hotel is a good distance from the city centre - not walkable. Public Bus service is fairly good and cheap (tickets seem to be never checked) and the hotel runs a free shuttle from 8 to 11 which has to be booked. The road to the hotel is very poor over the last 100 yards with many potholes and there is no street lighting - the pathway is often blocked with cars - hence the need to use the road to get to the entrance - health and safety issue here!!. The hotel from the outside looks rather modern, but unfortunately, the rooms were poor with the wall paper peeling off the walls and the carpet looking and feeling threadbare. Beds were hard. During the night if another guest closes the door with any force the whole room will vibrate and if someone goes to the toilet in the rooms above, you will hear the flushed water!! Bathroom was clean, but the shower curtain is a bit dated and sink plug did not work. The room was clean too. TV selection was extremely poor - 2 english channels - CNN and EuroSport!! The air conditioning was an absolute nightmare - hit and miss and was noisy. I did ask for someone to have a look at it and it took him 20 minutes to get it to work. Once we turned it off, it was back to square 1 - at least it wasn't too hot. Breakfast was good with a decent selection and service. However, there was visible mold on the wall where water damage was evident. The fitness room is a good addition (be aware this is not a gym - there are no free weights so you can't do proper chest or any arm exercises) The real downer (and business people be aware) is the internet access. I paid 5 euros for a half hour and on the docket it said I had 24 hours to use it. I used 15 minutes and when I went back the next evening it didn't work. I went to reception and was told the account had 'died' after 11 hours since first logon by the system so I said create a new one for the 15 minutes I had still remaining and had paid for. I was absolutely astonished to be told that this was 1. impossible with out buying more time. 2. management were aware of an 11 hour termination for a long time but continued to allow the docket to be printed saying 24 hours. (this led me to be very annoyed as it's what written down is what can only be relied upon). 3. I was then informed that this causes continual frustration with other users but management policy is set with regard to this and I was told in no uncertain manner that it was to stay. I find the last point very worrying especially when it was a member of staff telling me this. Based on this I would not reccommend the hotel unless you can get it either very cheaply or are stuck.", "Date": "October 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Wonderful...”", "Author": "Jeyne", "ReviewID": "UR10057223", "Content": "Me and my husband enjoyed staying here and so did my brother and his wife. We found it easy! Using the bus or even the trains (metro) that runs so close by! Vatican is just a bus a way. We will definitely go back there to stay. By the way the staff were very nice and the recommended a lovely home-style restaurant for dinner and its so so so so wonderful. All in all thanks zone as we had a lovely holiday in rome. See you next year..ciao jeyne sarritzu", "Date": "October 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Grreat hotel at a very good price”", "Author": "AmocDublin", "ReviewID": "UR8749949", "Content": "I was a bit nervous about staying here after reading the many negative reviews but having stayed there recently for 3 nights I can recommend this hotel to anyone staying in Rome on a budget. It's located in a quiet residential area with easy links to Termini and the rest of the city from the nearby train station, Balduina. There are also frequent buses, the 990 will take you to the centre. A taxi from the city centre at about 1am cost under €12 for 2 people. A 3 day pass that covers buses, metro and suburban trains costs a measly €11. As for the hotel, the rooms were modern, clean and comfortable and the staff very corteous and helpful. Breakfast was plentiful with a selection of cereals, yougurts and fruit juices. There was also ham, cheese and scrambled egg available so you could make something a little more substantial to start your day! All in all I found the Zone Hotel to be perfect for our stay in Rome and would stay there again!", "Date": "September 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Telford", "Title": "“Magnificient!”", "Author": "bedorca", "ReviewID": "UR8535885", "Content": "Our trip to the incredible city of Rome was a while back but I thought I would share our experience with you all. Wonderful hotel in a quiet residential area. Good restaurants within walking distance. Very useful shuttle service to Piazza Cavour. Friendly and helpful staff who were very welcoming. Lovely and tasty continental breakfast served. Clean, comfortable room with ensuite. We loved Rome and the Zone Hotel was all part of that experience. Thank you Zone!", "Date": "August 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Michigan", "Title": "“Wonderful stay due to Karem”", "Author": "tap51", "ReviewID": "UR8020283", "Content": "I had the opportunity to visit Rome with my two daughters. Our stay at Zone Hotel was very pleasant . The room was clean and we like the quiet area that it was located. The shuttle was convenient to get to Center City for the tours. The reason the stay was so good was of one of your employees, Karem. Karem helped us with language barriers, restaurants, sites to see and taxi rides. He was always pleasant with a smile and went out of his way to make our visit wonderful. I hope that you share this with Karem because we want to thank him for his kindness and helpfulness. If we ever get the opportunity to visit Rome again we will be sure to stay at your hotel again. We hope Karem is there when we do. We would recommend your hotel to anyone who may be planning a visit to Rome. Sincerely, Theresa Parsons, CPCU, CIC, AU", "Date": "June 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Midlands", "Title": "“Zone, an oasis of peace & quiet away from the city”", "Author": "Dann61", "ReviewID": "UR7829383", "Content": "I found Zone hotel to be modern, minimalist in style and spotlessly clean throughout. High tech glazing and beautiful marble floors etc ensure that the interior feels cool and fresh on the hottest of days. The hotel has two lifts(elevators) and first class fire doors and evacuation routes. I had a double room on the third floor with pleasant views to the west with attractive high spec apartments in the foreground and woodland beyond. My room was clean and fresh with plenty of wardrobe space,air-conditioning, fridge/minibar, multi-channel tv, radio (has a socket for your personal headphones). The bathroom has shower, washbasin, bidet and wc. Ample towels are provided. There are no tea/coffee making facilities (a travel kettle is a must have for me). There is a telephone and the hotel offers room service. The room was cleaned each day to a very high standard. The hotel staff are smart,pleasant and efficient. Breakfast is served in a bright pleasant area from 6-30am. Good coffee and tea, scrambled egg, boiled eggs, ham , cheese, toast, cereals and a great choice of croissants and pastries to set you up for the day. Hotel location: This is something you have to consider carefully before booking. The hotel is located in a quiet cul de sac in the suburb of Balduina which is west of the Vatican. If you have a car it's no problem. Taxis to and from the city will be about 35euros a go. Nearest train station is Balduina 10 minutes walk away. My preferred method was a 5 minute walk round the corner to the bus stop for the excellent No990 service. This very frequent service takes 20mins to Piazza Cavour and passes through the Vatican area en route. For me the peace and quiet and absence of traffic fumes at night more than compensated for the out of town location.", "Date": "June 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Boston, MA", "Title": "“Great hotel, poor location”", "Author": "WhatRocks", "ReviewID": "UR7438698", "Content": "After coming from the Hotel Lella, this place was paradise. First the bad though. The only thing negative I have to say about this place is the location. It's FAR. It's way off the map, about a 10-15 minute drive from the Vatican (which is in itself a considerable ways from the city center). While there is a free shuttle service that goes to and from the hotel, I have three main problems with it: 1.) You can't take your luggage, which means you have to cab your luggage to and fro the place, and pay taxi costs (which are expensive -- 50 euro or so to the train station). 2.) It doesn't run all night - the last drop-off to the city is around 6:30, so if you're coming back any time after that, you're out of luck and have to take a cab -- again, expensive. 3.) It advertises as going to the 'city center', but it's nowhere near. It doesn't even cross the Tiber. It drops you off at Piazza Cavour, if I recall, which is near the Castel San'angelo. Look on a map - it's several miles distant from the Coliseum, Pantheon, etc. That having been said, the Hotel itself is very modern, and it was a charm to stay at. We booked a triple and got a spacious room with three beds. They have satellite TV with REAL CNN (Not CNN International, which is basically a continuous five minute loop of the world's activities) and a host of other channels, both in English, Italian and German. The continental breakfast was an actual continental breakfast. The server even made my friend and I an expresso, free of charge! The food was great. Internet access is available, but it's very expensive (something like 5 or 8 euro an hour). One thing I would recommend for food -- there's a Doner place just down the road, with the most amazing kebabs and pizza for ridiculously cheap prices. Ask the hotel. Some of the best food I had on my trip! Overall, would I stay again? The hotel itself was great, the service was exceptional, but the location is far too far. For the extra subsidy you're going to pay in cab fares when you need to haul luggage to the place or come home at night when the free shuttle service is no longer operating, you can probably get a just as nice hotel for the same price that's inside the city. And, if the hotel is reading this, what *would* make me come back to stay? One, make the hotel shuttle pick up and drop off in the *actual* city center -- like Piazza Venezia or San Marco. That's within walking distance of all the main sites in Rome and is close enough to the train station that a cab to and from there would not be that much. Two, extend the evening pickup times until at least midnight, if not later. If I'm going to a night out on the town - a nice meal with a girlfriend, a play, a bar with friends, etc. -- 6:30 as the last pickup time is unacceptably early. Midnight at the very least is a time I could have a nice meal, or enjoy an evening's entertainment, and be ready to return home by. Three, if you don't accept luggage in the free van, offer a paid service that does. I would not mind paying 15 or 20 euros for a service that would pick me up and be able to carry my luggage, because I know I would be paying 40 or 50 euros otherwise if I chose a taxi. If you had that, I would consider staying there again. The hotel is great, but the location is what's killing you.", "Date": "April 26, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Hitchin, United Kingdom", "Title": "“Avoid at all Costs”", "Author": "Makinpost", "ReviewID": "UR7367214", "Content": "My girlfriend and I booked a 4 night stay at the Zone between Friday 6th and Tuesday 10th April. As it turned out, we only stayed the one night..... OK, where to start? First the location. The hotel is approx. 1/2 mile from Balduina Metro station (up a slight but continuous hill) and there is no taxi rank outside the station. This isn't the hotel's fault but is worth bearing in mind if you have 2 or more heavy suitcases to take to the hotel! It is at the end of a dead-end road in a mainly residential area (no bars/restaurants that I could see). When we went to the room (201) it was, to be honest, tatty. Wallpaper peeling, stained carpet, mildew in the bathroom and the shower curtain didn't cover the shower properly. I phoned reception, and managed to persuade a disgruntled receptionist to give me another room. Room 206 was even worse! We decided to stay one night and then find somewhere else the following day. During the night, we were woken up at about 5am by noisy Italians in the room next door. Phoned reception and they told them to keep quiet. What I didn't realise until the next morning was that where the wall should join the window frame... it didn't! There was no wall there, only a gap filled with insulating foam! So when they say on the website 'Fully Soundproofed' - they are lying. Moved to a different hotel - Fellini B&B - absolutely fantastic, go there instead. 5 mins from Fontana di Trevi. To summarise, this was a nasty hotel and a nasty experience, and I intend to claim my money back for the 3 nights I didn't stay there. If you want to ask me a question, please email me. I will upload photos showing the faults ASAP.", "Date": "April 16, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "St. Albans, United Kingdom", "Title": "“Modern, good quality, but on the outskirts”", "Author": "chrisgarcia", "ReviewID": "UR7303717", "Content": "The only problem with this place is how far it is from the centre. However they do put a shuttle service on to get you to the centre in the mornings and early evenings. You are left a bit to your own devices when coming back in the evening though. We had to get the tube to an overground station and then walk from the station to the hotel. A little annoying when on a short break but we knew this before we went so weren't too annoyed. The hotel itself is nice. Modern, good breakfast and the staff were helpful. Rome is beautiful and when you're in the centre you can pretty much walk everywhere.", "Date": "April 10, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Brisbane", "Title": "“Disappointing”", "Author": "Brisvegan_Abroad", "ReviewID": "UR7292365", "Content": "Overall, quite disappointing. Very commercial with lots of hidden costs. While price seemed a steal, you also have to factor in the costs of it being so far away from the city and isolated from public transport. As we arrived late at night, we had a 70 euro taxi fare to get to the hotel, which has to be factored into the price. Internet was ridiculously expensive too. Breakfast was fine but a reasonably limited continental breakfast which didn't change while we were there. Shuttle services into town was useful in the morning but hopeless at night as it finished far too early to be able to actually eat dinner. Finding the place from the train station was a bit of a nightmare but signs appeared as you got quite close to the hotel. Distance also posed a problem when trying to get to our hire car place ( a couple of suburbs north, on the way out of Rome), as public transport would have been near impossible and taxis are expensive. Service was adequate and rooms were perfectly comfortable.", "Date": "April 8, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "east sussex", "Title": "“Middle of nowhere”", "Author": "minxiemoo", "ReviewID": "UR6797543", "Content": "Stayed at the Zone in October 2006, only because our other hotel was fully booked. Firstly, its no where near the main attractions you have to walk ten minutes down a steep hill to Bauldina train station then transfer on to the metro after two stops. The trains stop running at approx 11pm so if you want to have a drink after dinner youd better be quick otherise its a taxi ride home. Rooms were O.K tad on the small side, staff were efficent but never cracked a smile, breakfast was boring just cereal cheese and ham and yes the waitresses had faces as long as the commute was in to the city centre. We are twenty somethings and like to come home after a hard days sight seeing get showered changed and go back out for dinner but it was just to far for this. Did find an excellent restaurant just passed the train station on the right hand side. Good pizza, good beer friendly staff can get busy though.", "Date": "February 15, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Ireland", "Title": "“Dont go near it!”", "Author": "katrinafrank", "ReviewID": "UR6634512", "Content": "If you want to be shouted at and insulted during your holiday make a reservation here. The receptionist swore about other residents being stupid and shouted at us when we would ask him to clarify something. The hotel itself is nice and was extremely cheap but taxi drivers dont even know where it is. It is way out of the way and the taxi will cost 12 - 15euros each way back downtown.If there are more than four persons you will need two taxis because the hotel wont verify this when calling a cab! There are no restauraunts (or anything) closeby. Do not stay here. Katrina. Ireland.", "Date": "January 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Calgary, Canada", "Title": "“Great stay at Zone”", "Author": "stuckincarn", "ReviewID": "UR6569469", "Content": "I just got back from four nights at the Zone Hotel in Rome. I got an excellent rate from priceline-europe (52 euro per night, double room, incl breakfast), but was a little nervous because of some of the reviews here saying that it was 'far'. I found that yes, this hotel is not in the very heart of the city, but it is in a lovely residential area just a 30-minute walk to the Vatican. The bus 990 runs from a parallel street and gets you down to the city. So if you are the kind of traveller who likes to pack a backpack in the morning, spend your day enjoying the sites, and then relaxing in and around the hotel in the evening, this place is perfect. There is a fantastic pizza place just 100m from the hotel--great pizza (and other types of food) and extremely reasonable. 5 to 6 euro for a pizza that was perfect for me and my husband to share for dinner (and gorgeous salad too!). There are also other bars and trattorias in the neighbourhood. The hotel itself was good. It was billed on priceline as 4-star, which is a bit of a stretch. The rooms are clean, comfy, and warm, and the bathroom is modern. The breakfast is extremely generous--breads, meats, croissants, cereal, juice, toast, yogourt, fruit. The staff at the front desk are a little bit gruff (just a little!) but very helpful. All in all, I would definitely recommend this hotel.", "Date": "January 9, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Los Angeles", "Title": "“Terrible service”", "Author": "rubyLosAngeles", "ReviewID": "UR6567010", "Content": "If you want your passports misplaced, then by all means, stay at this hotel. It ended up costing us $1500.00 additional dollars to extend our trip, get emergency passports, and get home. Horrible!", "Date": "January 8, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "London", "Title": "“Okay Overall”", "Author": "Sashalondon", "ReviewID": "UR6521063", "Content": "We have just returned from a three day stay at the Zone Hotel in Rome. The hotel is modern and very clean with friendly staff. I would however not recommend this Hotel to anyone on a budget and is not prepared to take taxis as it is a long distance from the city. The walk from the nearest station -Bauldinia to the hotel is a good 500m up a rather steep hill. My son of 14 years complained -not to mention the condition of the bags after picking lots of doggy pooh on the way up!!! We did manage to book the free shuttle into the city on the fisrt day -but there is only space for 8 on each trip. Book early and you should get a slot available for one of the several trips he makes all day. Also be warned this hotel does not have a resturant and finding food in this residential area after a tiring days sight seeing was a nightmare for us. We had to settle for pizza on all nights !!!! In all well worth the price but location is a big problem. As we on a budget we did not use taxis and a single ride from the airport to the Hotel cost 5euros each. For travel in the city its best to buy the day travelcard valid for travel all all metro trains and buses (4euros. They also do a 3day travelcard.", "Date": "December 30, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Clean Hotel”", "Author": "WorldBreeze", "ReviewID": "UR6504341", "Content": "I stayed at this hotel when visiting Rome over Christmas 2005. I was a little concerned when my airport taxi driver couldn't find the hotel for a considerable time. It turned out that the hotel was situated in a dead-end residential street some distace from the city centre. The hotel itself was very modern & clean, my single room was functional and housekeeping kept it spotless all week. The room had a mini-bar fridge and a TV with no channels in English. The bed was comfortable, and there was no traffic disturbance at night due to the remote location. Disappointingly, the breakfast seemed to consist only of pastries and fruit juice and there was no facility for lunch/dinner unless I ventured into the city or walked some distance to local restaurants. This isn't recommended (especially at night) as the dirty residential streets are something of a minefield of dog poop. The lack of any hot food was a particular problem over the Christmas period when - unlike in the UK and US - everything seemed to be closed. The hotel provides an excellent mini-bus service to the city and back several times daily, with a very amusing driver, but this has to be pre-booked and is often full. The hotel does what it says on the tin, and doesnt try to rip you off. If I hadn't had some upsetting family news from England during my stay, and been desperate to get home, I guess I would have enjoyed my stay here a lot more.", "Date": "December 27, 2006"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Singapore", "Title": "“The middle of nowhere!”", "Author": "Black64", "ReviewID": "UR6179021", "Content": "Though this Hotel advertised that it was 2km from the Rome Termini, it is more like 10km, and a 15 Euro taxi ride. It is a 10 minute walk to the bus, then a 15 minute bus ride and 5 minute walk to the metro, which is a few stops into the centre. The hotel wasnt on the map that they provided, so getting lost is possible. Definately not the best option unless you have your own transport, as there is a garage on site. Otherwise the room was nice and the breakfast was good.", "Date": "November 26, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“A very tranquil stay”", "Author": "Woweee", "ReviewID": "UR6100937", "Content": "We thouroughly enjoyed our stay at The Zone Hotel in September 2006 on our trip to Rome, our first trip to Europe. It is situated in a quiet area just north of Rome called Balduina, away from all the noise and hubub of the city, which made for an extremely relaxing environment. The room was acceptabe, with plenty of storage and very clean. The bathroom was excellent. The bed was a tad hard and the air conditioning was barely working; however, the staff provided us with a fan, which helped. The refrigerator was stocked daily with wonderful Italian beer, wine and assorted drinks. The view was very picturesque. Breakfast was ample consisting of plenty to satisfy anyone's palate. Traveling to the sites was very easy. Taxis arrived in 5 to 10 minutes to take you where you needed to go at very reasonable rates. It was a short ride to the Metro, which I highly recommend traveling. It was a lot of fun, very clean and state of the art, at least compared to Boston, anyhow, and got you anywhere in the city. The best part of our stay in The Zone was the very cordial and helpful staff, who catered to our every need, including our lost luggage. Not knowing but a few words of Italian, it really helped that they spoke English. Hint; if you stay here, take their recommendations on where to eat for fantastic authentic Italian cuisine. The day we left, construction began on a new lounge. We were also informed that The Zone Hotel was upgrading to a 4 star hotel, so I'm sure that your stay will be even better than ours. I would absolutely stay there again and am looking forward to it again someday.. Paul and Valerie - Boston, Massachusetts", "Date": "November 10, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Staffordshire", "Title": "“Don't stay here.”", "Author": "lucie21", "ReviewID": "UR5983385", "Content": "I stayed here for three nights 7 -10 october, with three friends. We had two twin rooms. They were soooo small. One room had twin beds pushed together with no room to walk around them, you couldn't open the fridge as the beds were right up against it.. The other room just had two fold up beds and again there was no room to move around.They were more like rabbit hutches. Also the aircon did not work properly and the room stayed hot. The reception staff were nice but the waitress in the breakfast room was really, really rude and miserable. I think she was incapable of smiling. .Also it is a 30min-1hour (depending on the traffic) bus ride from the center. Much better to pay a bit more and stay nearer the sights.", "Date": "October 22, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Dublin", "Title": "“If you've a car, this one is a real find”", "Author": "Kaitak", "ReviewID": "UR5892227", "Content": "The Zone hotel would be a perfect boutique hotel, were it located somewhere a bit closer to the centre of rome. It's in a suburban region called balduina, which is not easily reached by public transport. At the moment (2006, and for the foreseeable future), the Linea A metro ceases running at 9 pm every evening, and this effectively put an 830 pm curfew on us every night. Furthermore, the suburban rail trains you need to take from the Linea A stop to the Balduina area are not frequent (1-2 per hour) and the Valle Aurelia station is not the safest after dark. The hotel tends to call a reputable local taxi firm who wont rip you off, but getting a taxi from the city centre entails the usual rolled eyes and scratched heads and the driver telling you balduina is so far, it will be over fifty euros for what is really only about 7 kilometres from the termini station and 4 from St Peters. On their website,the hotel wasnt so honest about how far they are from the balduina train station... it's more like 1000m, not 500m, through very poorly-lit suburban streets (safe though - very much a residential area) Then again, there's a lovely restaurant called \"Capperi\" just beyond the station from the hotel; we ended up eating there most evenings of our 5 night stay, and really enjoyed it. The hotel staff were extremely helpful and polite, the breakfast was lovely (fantastic coffee served with a jug of steamed milk) and the room modern, clean and spacious. There is a shuttle bus running for free four times in the morning and four times in the evening (only problem is that it doesnt run after 8pm) that you need to reserve with reception.", "Date": "September 29, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "UK", "Title": "“Can do better”", "Author": "aussiedocinuk", "ReviewID": "UR5801428", "Content": "well out of the way and difficult to get to (50 minutes by metro, walk, bus and walk), abrupt indifferent reception staff, airconditioner did not work.", "Date": "September 14, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Loved it”", "Author": "olipom", "ReviewID": "UR5703469", "Content": "I loved this hotel - it's comfy, the room we had was huge, overlooking the front, really great bathroom. The only problem is the a/c isn't quite up to the job but it wasn't hot, just not cold! Breakfast's perfectly adaquate, but i'll agree with previous posts, the coffee is pretty dire! The location's alright, yes there's no metro, but the metro connects with the FM3 railway and it only takes about half an hour out of town, which is fine for a day's sightseeing in Rome. We had dinner in Capperi! which was just amazing - the best food in all of Italy and it wasn't expensive (advantage of not being in the centre of Rome): 3 courses, bottle of wine and aperitifs was about €45 for two. It's further down the road from the train station (ie out of the hotel, all the way down the road, left, pass the station, 100m more, on your right). Highly recommended. Couldn't fault this hotel really.", "Date": "August 24, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New York", "Title": "“A really good hotel”", "Author": "azarifyan", "ReviewID": "UR5540115", "Content": "Great hotel for someone who does not want to spend a lot of money. The staff was very helpful, and the hotel - clean and quiet. They have breakfast running for 4 hours from about 6 to 10 am, with a good selection of food and great coffee. The hotel is a bit far from the center, but they have free shuttle running to the Vatican and to the center three times in the morning. Their return trips are a bit early, but Balduina train station is right by the hotel, and there is a city bus that runs there too. Overall, I'd highly recommend it. -Ally, New York City", "Date": "August 2, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Derbyshire", "Title": "“Get A Map Before You Come !!!!”", "Author": "Chris_F-Smith", "ReviewID": "UR5524583", "Content": "Just got back from Roma. Clean modern hotel. Mixed staff - some pleasent and helpful, some just miserable. The A/c is just about worth the effort - I have had better. The hotel is situated at the end of a residential street in the district of Balduina. For your sanity, get a map of the area before you arrive, as it is bloddy impossible to find !! We got lost on our first night and had to flag down a passing motorist who, very kindly, gave us a lift back to the hotel. Use Multimap[--]if you cannot get a local map. The breakfast is typically continental and very good but the coffee is dreadful. We do not know why ! The hotel lift is a form of torture and badly needs A/C. There are a couple of local resturantes within 15 mins of the hotel, all worth a look. We had a meal for 3 with wine ( house ) for €55. The local cafes are very good value too. We recommand using taxis to and from the airport. These are €45 & €60 from Fumicino and Champino respectively. Those carring luggage on the metro are targets for pick-pockets and other scum. The hotel offers a currier service at fixed times to and from the city centre - with limited capcity - book it ASAP as it fills up ! The local bus ( the 990) is very good, buy your tickets from a little kiosk or tabbaconists (?) for 1€ each, - that is 1€, 1 ticket, 1 trip - anywhere.The 990 can be boarded in the Vatican side /corner of the Piazza Cavor. There are several every hour. Note that metro tickets are the same but have a 75-minute time limit. So buy when you need, not before. Like most capitol cities, Roma is not cheap. Beer is very expensive - between £4 - £10 a pint. If you can, drink mineral water ( cheap by UK standards ) and house wine. The food is generally very good. There are hundereds of snack bars all offering quality food at a fair price. A good measure is if the locals eat there......... The city is busy but be brave when crossing roads. Only cross at designated crossings and if there is no green/red man, walk with confidence. Give the driver eye contact. Do not stop in the middle or you will get knocked down!!!! The drivers will adjust their speed to let you cross without them having to stop. At this time of year Roma is desperately hot. English \"Roses\" and those with Scotish \"Blue\" skin should use maximum portection, as you WILL burn. There is a lot of walking in Roma, try to walk in the shade and never stop in the sun. ALWAYS carry water with you. On wed.26th July it was 104ªF Overall it was a pleasent experience. We now know the area and would not struggle as we did when we first arrived. The hotel is part of a chain and we would be happy to try one of their other hotels in another part of this beatuful country.", "Date": "July 29, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Awesome - but far...”", "Author": "Cass and Age", "ReviewID": "UR5383410", "Content": "Reading the peoples review before us... WOW: We didnt get anything like that. We had a great room overlooking the front of the place. Air Conditioned, Mini Bar, Double Bed. A completely different story. The only down side was that the place was a little far from Rome itself. This could also be a positive as we got a few great nights sleep. To get there you must get the Linea A to Valle Aurelia and FR3 to Balduina. Out of the station turn left and then left again. Walk right down to the end. Voila. Some of the staff were great and others not so.", "Date": "June 26, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Sunbury", "Title": "“Overbooking”", "Author": "Roxy10Sunbury", "ReviewID": "UR5359855", "Content": "We booked our double room and paid for it at least 6 months in advance but on arrival were given a room that was obviously made for a single bed. Two fold up stretcher beds were pushed together, the mini-bar could not be accessed because the bed was in the way and you couldn't watch TV unless you stood in the door way. There wasn't even enough room for our luggage. Coffee machine didn't work nor did the Internet. Staff were apologetic and gave us a suitable room the next day. Shuttle bus was very good and free-nice drivers, easy access to city by bus, train station near by. Eventually received small refund for first night through booking agency.", "Date": "June 19, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Scotland", "Title": "“I love the Zone Hotel in Rome”", "Author": "R2driver", "ReviewID": "UR5203966", "Content": "The Zone Hotel is a great hotel in Rome and very reasonable. The rooms are very clean and modern and the facilies excellent. It is a little out of the way - it will cost you between 30 and 40 euros in a taxi from Termini. However, if you are happy with public transport, the buses and trains are excellent and easy to use. The breakfast is fine - fruit, cereal, meats and cheese and bread/pastries with coffee or tea. Most of the staff speak English and are friendly, and they recommended a restaurant around the corner which did an amazing pizza!", "Date": "May 23, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Houston, X", "Title": "“we loved it”", "Author": "A TripAdvisor Member", "ReviewID": "UR4824152", "Content": "My sister, mom and i went to rome over spring break. we booked with expedia and everything went perfect. the staff was really friendly and told us great places to eat. there is a shuttle that takes you to the piazza cavour and from there you see st.angelo castle and st peaters. when you are dropped off you are right behind the justice building, if you go to the front and follow the bridge over the river and down like a block you are right by the piazza nouvona. you couldn't walk to these places from the hotel but i we liked the seclusion of it when we came back from a long day of walking. if the shuttle is full because it may be you have to book it like the day before you can have them call you a taxi and it is like 10 to 11 euros to the piazza cavour. or you could walk right up the hill and catch the 990 if you like. we loved this hotel and the staff. the hotel was not the fanciest but it was what we expected for the price, besides how often are you going to be in the hotel room anyway?", "Date": "March 31, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Pretty good Hotel for the Money”", "Author": "A TripAdvisor Member", "ReviewID": "UR4772584", "Content": "My wife and I just got back from our trip to Italy (First trip to Europe). In Rome we stayed 3 nights at the Zone Hotel. This was part of a package, and were a little concerened after reading reviews. We landed at FCO at around 7:00 pm, so we opted for a shuttle bus to the Hotel. We had asked someone how to get to the hotel and they said use a shuttle. We asked the price and it was 50 euro, so we went ahead. It is a little daunting in the airport and trying to find the best way to the hotel is still a mystery. Shuttle took about 40 minutes as we had to drop off another couple. Room was pleasantly sized and had everything we needed. Area is definitely a residential area, but pretty nice overall. Hotel was getting remodelled when were their, so construction noise started at 9:00 am, but we off and site seeing by then anyway. We did take a peak at the rooms being remodelled and they are very, very nice. Staff was relatively helpful. They provided us with a tourist map that was very helpful, although the hotel was off the map. Maps of the bus routes were very weak at best. Breakfast was pretty good as other have said. Getting to/from the hotel via 990 bus is pretty easy once you get the hang of it. Taking bus back to hotel is a little tricky, but had it figured out by the 3rd day. You can try to tell bus driver you want the zone hotel stop and that helps, but pay attention. We opted for a 3 day bus/metro pass for 11 euro. Not sure if this ended up being the most economical, but not having to find a tobacco shop to get tickets was worth the extra. Bus is a little confusing because ir really zig zags through the neighborhood and you feel like \"hey we were just here\". Shuttle bus works best for the mornings. I would contact the hotel a couple days before arriving to reserve for every morning you are there. We were not able to get on it the day after we got there, but booked it for the following days. Getting to FCO from hotel was a little tricky, we took 990 bus to Metro, luckily we tagged along with a german lady that was going to the airport, otherwise we would have had trouble. I would suggest trying to get a detailed map of the area before going, as every map we were given either did not have hotel on the map or was too fuzzy to read. As far as restaurants, we did not go to any in the area, we did notice a little snack shop about a block away on the entrance road if you want to pick up some beverages or snacks. Overall, hotel was pretty nice and getting to and from the attractions was not too bad. If you are really short on time in Rome and want to hit a lot of attractions, I would suggest finding something more centrally located. But for the money and because it was in the package, it was pretty good.", "Date": "March 29, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Birmingham, Alabama", "Title": "“A little out of the way, but OK.”", "Author": "Zoecat601", "ReviewID": "UR4741259", "Content": "This hotel was out of the way; you have to take a train plus subway, or a bus to main sites in town. (Directions to train station from previous posts about this hotel are accurate, and we found them helpful.) However, the staff was very helpful and friendly. Several at the front desk helped us resolve issues with lost luggage. They called the airline and talked to the reps in Italian for us. The rooms were a good size, and worked out well for our group of 3. In general it is a fine hotel, but, if you are not into walking or paying for taxi, it may not be the best hotel for you.", "Date": "March 28, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Middlesex", "Title": "“Zone Hotel, No problem!”", "Author": "Free_Birdie", "ReviewID": "UR4595037", "Content": "My friend and I have just returned from the ZONE hotel in Rome where we stayed for 4 nights. ok, so it's a little way out of Rome city itself but I can honestly say for the price we paid (£204 flights from Heathrow and hotel) it was very good value! Rome city is easily accessable from the hotel using the 990 bus which is a 10 minute walk away, a little hill is all that needs to be overcome and we're both mid forties and had no trouble taking it on although it would not be suitable for disabled people. The bar does leave some to be desired and holds very little in the way of drinks and NO snacks but we brought along a kettle and some nibbles and ate out most of the time. The breakfast was quite ample, tea, coffee, rolls, meat, cheese, tinned fruit so we didn't go hungry. The hotel staff were very helpful advising us on transport etc. The rooms are very clean and well kept and a reasonable size. If you do wish to eat in the hotel they have leaflets (though not on show)on takeaway food which can be delivered to the hotel for you. There is a restaurant which serves delicious meals from 7.30 and is about a 20 minute walk away but a taxi can run you there and back for appox 10 euros total. There is also a chinese restaurant about 10 minutes walk away although we didn't have time to try this. As mentioned in previous reviews, there is an 8 seater shuttle bus that runs from the hotel (free) to the city and we booked our seats on arrival for the all the days we stayed there, it ran on time both outbound and returning in the evening with very helpful drivers full of tips of where to sightsee depending on how long your stay is. getting to the hotel from FCO was a doddle, we booked with VIATOR and for two of us from FCO to ZONE HOTEL and ZONE HOTEL to FCO cost us £38.00 in TOTAL, not bad atall and easy to find when we landed, they were running 15 minutes late for our departure and called the hotel to let us know they were on the way, it took about 30 minutes to get to the Zone (once you see how they drive in Rome you'll know why)! So, all in all a good, clean, basic, no frills hotel, easily accessable to the city and yes, we will stay there again.", "Date": "March 8, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Essex", "Title": "“went for the rugby”", "Author": "A TripAdvisor Member", "ReviewID": "UR4468852", "Content": "The hotel was lovely, staff were friendly and helpful the room was clean and the bed was comfortable and the breakfasts were gorgeous. The only problem with the hotel was the location. To get to the hotel you need to get on Metro A at the Termini following the Bastini Line. Then get off at Valle Aurelia about 6 stops. Walk round to find the main train line FM3 and get on the train to Viterbo then get off at Balduina 2 stops. Come out of the train station and turn left then take the first road on the left and it is a fairly long walk from there to the top of the hill!!!. BEWARE the metro finishes at 9pm so you would need to get a taxi if you want to stay longer in central Rome and this is about £40 one way. So not the cheapest option. I would recommend getting a week long metro ticket about £11 and this covers you for the Metro, urban train and trams. Be very very careful on the Metro for pick pockets if you get approached by women with babies be very careful as you will probably have a pick pocket close by!!!!!", "Date": "February 18, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Balfron", "Title": "“Lovely Hotel - Taxis extortionate”", "Author": "jeandun", "ReviewID": "UR4357786", "Content": "Nice Hotel however room was very cold on first night had to wear socks and a cardigan as well as pyjamas. The staff on reception were charming and helpful. The Hotel is quite far out of centre and as we arrived at 11pm we used a taxi from termini cost 98 euros approx £69 more than our flight from Scotland and our bus transfers.Once we found the Balduina Station which connects to the Metro we managed no problem suggest the hotel advises on best methods of transport to hotel as taxi's seem unsure of where it is and charge a fortune. The only restaurant is a 10 minute walk away beside Balduina station \"Cappieri\" lovely food great service and very reasonable.", "Date": "January 17, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Scotland", "Title": "“loved the hotel but to far from tourist attractions”", "Author": "A TripAdvisor Member", "ReviewID": "UR4332666", "Content": "The only problem was the location of the hotel, although they do run a shuttle bus, but this is based on a first come first served basis, advisable to book on arrival. This location is not suitable for families, more for the fit and agile. The metro and the bus 990 are the best way of transport to visit tourist attractions. Beware of pickpockets on the metro especially on a sunday asthis seems to be the busiest day.", "Date": "January 8, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "sheffield england", "Title": "“December in Rome”", "Author": "noriekkoorc", "ReviewID": "UR4217887", "Content": "The Zone Hotel was a very affordable and good value for money. The staff are helpful and friendly. The rooms clean and a good breakfast provided. It was however, much further than the 2km stated on the info provided on the web. Although the hotel runs a free transfer to the city, six times a day, the bus only holds eight so you have to book it well in advance. A taxi to the centre is about 14 euros so can work out expensive if you want to keep returning to the hotel during the day. Although public transport is ten minutes away. It took about thirty minutes to walk to the Vatican.", "Date": "December 7, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Gateshead", "Title": "“hotel zone”", "Author": "rmg95", "ReviewID": "UR4138165", "Content": "This hotel is a little out of town but very clean runs a free minibus into town and back until 630 pm breaskfast was help you self in a relaxed atmosphear. The hotel was in a residental area so was quiet 24/7. The rooms were of an ok size and kept very clean.", "Date": "November 22, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Scotland, UK", "Title": "“Pretty nice”", "Author": "A TripAdvisor Member", "ReviewID": "UR4077416", "Content": "After reading the reviews already written about this hotel I was a bit worried, I shouldn't have been! Its a nice hotel in a safe, quiet residential area. The hotel is a 5/10 minute walk to the bus stop (bus number 990), the bus took about 20 minutes to get to Piazza Cavour which was only a 15 minute walk to all of the main attractions. The hotel is not in the best location but I honestly didn't find it that much of a hassle to get into town. For the price I paid for this hotel I was more than happy with it - it was clean, the bar area was lovely, the staff were friendly enough and the breakfast was one of the better I've had in a European hotel. Don't let the previous reviews put you off.", "Date": "November 1, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "2"}, "AuthorLocation": "New Brunswick, Canada", "Title": "“Not worth it”", "Author": "A TripAdvisor Member", "ReviewID": "UR4041080", "Content": "This was our first time in Rome, so we weren't sure where to stay. We only stayed in the Zone hotel for 1 night-thank God! This hotel is in the suberbs of Rome-quite a ways away from the city. And it wasn't a nice suberb either! I wouldn't even have gone out after dark! Our taxi driver-who has driven taxi for over 20 yrs in Rome-had no idea where this hotel was. It was tucked away in the midle of nowhere! The hotel does offer a free shuttle into a point in the city-the problem is that this point is no where near any attractions. After taking the shuttle you would have to take the underground to get anywhere. It would take over an hour to get to any attractions. My word of advice-spend the extra 50 or so dollars and stay in a decent hotel in rome! We stayed in the Ripa hotel-which was cheaper than the Zone -but was right in the city center. So please don't stay in the \"slums\" of Rome-it's not worth it!", "Date": "October 21, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Alamosa, Colorado", "Title": "“Only a fair hotel”", "Author": "GeeandVee", "ReviewID": "UR4026649", "Content": "We just returned from a 4 day stay at the Hotel Zone. While the hotel is clean and comfortable, it has definate shortcomings. It is too far out in the suburbs to be handy for sightseeing. Buses are several blocks away and taxis difficult. The hotel has a free shuttle but you have limited availablity in times and space. There is no restaurant in the hotel and the breakfast is very limited. There are VERY few restaurants in the neighborhood and a bus or taxi ride becomes necessary to get to a decent eatery. The hotel staff is pleasant but not terribly helpful. Overall we would recommend spending a few more Euro and staying closer in with more amenities.", "Date": "October 16, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "2.0", "Value": "4", "Service": "1", "Rooms": "3"}, "AuthorLocation": "England", "Title": "“OK Hotel but a number of problems”", "Author": "Timetraveller1", "ReviewID": "UR3983470", "Content": "Location for this hotel was appaling, it was difficult to find (with many taxi drivers needing us to direct them to it) and information from the hotel before we arrived was very misleading making out that the hotel was only a stones throw from the Vatican. As previously mentioned, although there was a shuttle bus, it was nearly always booked up and this meant you had to book ridiculously early to take advantage of it. The rooms were nice, with a reasonably priced minibar and the breakfast was one of the better continental breakfasts I have come across. I find staff incredibly unhelpful though, mainly when an electric box in the bathroom starting creating excessive noise, it took three compliants before the staff decided to act and sort the problem out. I am quite a laid back person when it comes to hotels, give me a comfy bed and a TV and I'm usually sorted, but I won't be intending to revisit this hotel anytime soon.", "Date": "October 2, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "4"}, "AuthorLocation": "Uk", "Title": "“Distance from town a problem”", "Author": "Bilshe", "ReviewID": "UR3940568", "Content": "Just returned from a week staying in the Zone hotel. The hotel itself was clean and comfortable breakfast ok as continental breakfasts go. We found the staff not unfriendly just indifferent. The blurb about the location of hotel very misleading ----although a shuttle bus provided it did not run very often ---and you had to book very well in advance to get seat There was a local bus with a stop about 5 minutes walk away which was ok but it took 20 minutes to go to the city so bearing in mind that most people would want to come home for rest before going back into town for dinner you were actually travelling 2 hours each day ----a lot of time out of your holiday", "Date": "September 26, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Willenhall, uk", "Title": "“Zone location beware”", "Author": "A TripAdvisor Member", "ReviewID": "UR3936928", "Content": "Ok Location really is everything. Firstly the hotel is located in suburbs and so you have to catch a bus (990) into the vatican city. This takes approximately 30 mins to get to piazza cavour during the quiet times and up to 45 mins during rush hour. This is quite a problem. Imagine you have an early start at 8.00 spend the whole day in town and fancy heading back to your hotel to get changed. This means anywhere from 60-90 minute round trip to get to your hotel and then back into town for the night. Not good. Also you need to eat and the hotel has no restaurant and there are only snack bars or takeaways nearby. SO you really need to eat in town. meaning the journey or you stay out. Another very important point if you want to see the sights is that the journey only takes you to the vatican city, not rome city. To give you an idea it takes about an hour to get to rome city and the sites, and an 80 minutes to get to the colloseum. SO this hotel is a real hassle for those wanting to see all the sites over by the colloseum. ANd believe me this is where most of teh good sites are such as colloseum, palatino, baths of caracha(might be spelt wrong), trevi fountain etc. The catacombs are also this side and require another bus journey ( or walk as we did for over an hour from the baths). So bear in mind the catacombs are about 2 hours from the hotel. If you dont mind this and just want the st pauls bassillica and to see the cistine chapel etc then the hotel is 30-45 mins from here. Also with regards to the hotel. Breakfast is limited, you get rice krispies or cornflakes. You also get croissants and bread, plus if you are lucky and get there in time you get a yoghurt. They also provide a slice of cheese or slice of ham for you. I think its ltd. To cap it off because there is no restaurant there should be a kettle in the room, but there is no kettle. So no tea making facilities. There is a bar that no one goes to in the lobby. ITs lifeless. Other errors at the hotel are our key card needed reprogramming every day to allow us in the room and if you dont stick the shower curtain to the wall correctly the bathroom floods and there is no drain so it stays wet. on the positive the room is clean, spacious and airy. it has a minibar and a free safe. So its up to you. If you only want the vatican side its ok. But if you want the rest of the sites its not good. On the very positive side rome really does have some exceptional sites worth seeing. Dont just observe frome the outside go in and have a look. The catacombs are superb.", "Date": "September 25, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "5"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Nice rooms, OK staff, but bad location”", "Author": "A TripAdvisor Member", "ReviewID": "UR3794593", "Content": "I stayed at the zone hotel for three nights. The hotel was very modern, crisp, and refreshing. The overall hotel experience was great. There was only one set back, and you guessed it, it's the location. The shuttle worked okay but came back to early, so take 990 like everyone else said, it's kind of hard to figure out how to get around in rome so I would suggest finding a bus schedule/map. That way you know how to get from one side of rome to the other since their subway system is very simple and only consist of two lines. The air conditioner is also not a very strong aircondition unit and the refrigerator did not get nice and cold. There is a safe in the room that is incredibly easy to work, which was nice. Breakfast was fullfinling, light, and fresh. And be aware that this hotel does not offer laundry service as it says they do on the website. We only had one problem with one of the staff members and that was the lady that works in the morning at the desk, she was very unfriendly, unhelpful, quick, and made us feel like we were bothering her. Also be aware that when you sit down at a restaurant they charge a fee (around 2 euros) per person. This is considered to be there tip. But other than that it's a great city with lots of history, so enjoy it.", "Date": "August 21, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Finland", "Title": "“Very good.”", "Author": "VonGuller", "ReviewID": "UR3684837", "Content": "We were staying in this hotel last week for 6 nights. The hotel was clean and the stuff was friendly. The breakfest was good. The location is not perfect but manageable. The hotel has this shuttle bus to the piazza cavour as told before, but you have to book it in advance and the last shuttle back is at 6.30 p.m.(bit early). We used this shuttle a few times. Another possibility is to use bus 990(and this i recommend)which goes to the same piazza cavour from about 5 minutes walk from the hotel. This works fine if there is no strikes going on as we had for one day. On weekdays the bus goes like once in 15 minutes and on sudays about once in 30 minutes. We had to get to the ciampino airport early in the morning. We decided to use the 'cab' the hotel offered. It appeared to be the same shuttlebus that takes people to the city and was quite expensive. Ask a regular taxi for prices first. For the price we paid(62€/room/night) when booking from ryanairhotels this was a perfect hotel for us.", "Date": "July 20, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "LUXEMBOURG", "Title": "“Perfect But Acquainted With Bus System”", "Author": "mattes", "ReviewID": "UR3574417", "Content": "I stayed there for 5 nights last week. I can confirm all the positiv reviews posted before mine. I hope to give more clarity about getting to the hotel back-and forth town centre. 1) The hotel offers a shuttle (Mercedes Vito) going to Piazza Cavour every hour (except around mid-day). BUT you have to book your seat quite early the day before ! 2) BUS 990: It took me 5 minutes to get to the bus stop called BALDUINA/CERBONI. (it is the only bus passing the VIA CAROLIS) I took the bus twice from Piazza Cavour after 23°° and it took me exactly 25 minutes from departure to the reception of the hotel ! 3) N99: Night Bus. I tried this service and it worked. Be aware that you get off on a street called VIA MEDALLIE D ORO and that you need another 15 minutes after you get off the bus to get to the hotel.(walk down the piazza balduina and then up the hill toward via carolis) 4) FM3/FR3: SUBURBAN TRAIN: It took me 8 minutes to get to the station. There is a schedule on your left just at the entrance. There are on average 4 trains per hour running towards town centre. When you get off at the 2 station you can commute to the metro. 5)HOW I MANAGED TO GET THE TERRAVISON BUS AT TERMINI (departure 6:40) 05:37 I get on the Bus 990 at B/Cerboni 05:47 I get off the bus at via LEONE 05:52 I arrived at the OTTAVIANO station platform and got on the metro(lucky to catch it without waiting) 06:10 I arrived next to the Bus waiting at Via Marsala 06:38 TERRAVISION BUS left for CIAMPINO AIRPORT 07:06 arrived. Hope those information will help you decide wether or not you want to stay at the ZONE.... steph", "Date": "June 18, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Mobile, Alabama", "Title": "“zone hotel will stay again”", "Author": "A TripAdvisor Member", "ReviewID": "UR3546329", "Content": "We were a little afraid of what we would find. We were very happily suprised. We just returned from three nights at this hotel. We arrived by overnight train from Paris. There were five of us in our group. we had to take 2 cabs from termini station. Our cab fares were only 20 euros per car. you can't beat that. the hotel staff was very, very helpful. they spoke english and immediately responded when we didn't know how to turn on our room's air conditioner. we arrived early and they had the cleaning staff finish our rooms first so that we could go ahead and get into our rooms. we had three rooms between the five of us and they were all great. the cleaning staff was FANTASTIC. the shuttle service was great and would drop us off at either the vatican or piazza cavour. our shuttle driver also gave us specific directions to get back to the hotel late at night. the # 990 bus picks up at piazza cavour and drops you at the san Madonna dell cenacola stop 1 1/2 blocks from the hotel. the hotel is located in an affluent safe neighborhood. we saw many women out walking there dogs late at night. There was a lot to discover in this area (Balduina district). The hotel is located a little far out. However, with the shuttle and the #990 bus, we found it took us no more time to get to and from. We still stayed out late and had no problems problems getting back. We were all very, very satisfied with our stay and would definately stay there again.", "Date": "June 12, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Douglas, Massachusetts", "Title": "“Location”", "Author": "VTMChris", "ReviewID": "UR3493571", "Content": "We were confused by some of the reviews we read prior to our trip... some said this hotel was close to the metro and others made it sound like it was way out in the suburbs... here's my take, hope it helps! About 1/2 mile away is a metro stop for Balduina, this is on the FM3 (aka FR3 line), as near as we can tell, this stands for \"Free Metro\" as you DO NOT need a ticket to board this train. You can make your connection at Valle Aurelia to the Red Line (Aka A Line) you do need a ticket at this point and I don't remember if you can purchase them at this station or not (on our first day we had walked the full two miles to Cipro station (Aka Vatican Museum on the A Line) and purchased our tickets there. So, it is close to a Metro Stop but consider the following: The Metro stops running around 10:30 or 11:30 pm depending... and restaurants often don't open for the evening until 7:30pm. Restaurants do not rush you and whenever we ate in town we missed the last train and had to walk all the way back (often 3 - 4 miles) and many cabs are unwilling to drive that far (we tried to catch a cab one night at St. Peters and we no sooner told the driver Via Alfredo Fusco and he said no). Upshots: The rooms are sound proofed, there are safes and small refrigerators in the rooms (nice features) the staff is friendly, helpful and speak English very well. The continental breakfast included croissants, rolls, salami, ham, Swiss cheese, corn flakes, Rice Crispies, Yogurt, canned fruit cocktail, oj, milk, water, tea and cappuccino... we never left hungry. A nearby restaurant known as Cappieri (spelling may not be quite right here) serves excellent food, the wait staff is very friendly, speaks English well and the prices were very reasonable. We ate there semi frequently as it was close to the hotel and we would not have to worry about the metro/cab situation. A party of four with 2 appetizers, 4 main dishes, 2 desserts and a bottle of house wine ran about 65 Euro total. As I said the food was very good, we were never disappointed. We were very happy here, but there will be some walking, or have a number handy to call a cab if you need one. Other than that it's a great place to stay and we would definitely stay there again! Hint, you can take the FM3 train all the way to Pyramide station and switch to the Blue Line (aka B) and it's one stop to Circo Massimo or two stops to Colosseo (Coliseum) without having to pass through the crowded and much maligned Termini station... Enjoy!", "Date": "May 23, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“all about location!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3298467", "Content": "The hotel was lovely, a good 3* hotel, but location is important too, especially when you are coming in for a city break. It was easy enough to get into town and out -you get the overground train 2 stops then get on LineA of the Metro( 2 linesA&B), this is in theory. We were unfortunate enough to have the metro lineA shut due to engineering works on 2 evenings. Thought we would get a bus to our connecting overground station, but we missed the last train back (just v unlucky, missed by 3 minutes) and this left us in the suburban, concrete dual carraigeway which was Valle Aurelia, trying desperately to get a bus/taxi/anything, back into town, a scary experience if you are not from the area. The rest of the time we muddled through with the buses, because no-one could give us precise directions where to catch the buses into town from, not even the hotel staff. I think it would be really helpful if this hotel gave a map with precise directions to the bus stops/no.s to get into the city. I think the best thing to do for anyone staying atthis hotel would be to get to grips with the bus system on day1 from & to the hotel, to get bearings understood in case of an unfortunate metro/train breakdown. The hotels shuttle bus does not go to the city centre but near the Vatican, which is great if you are visiting that for 1 day.", "Date": "March 24, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Atlanta, GA", "Title": "“Pleasant”", "Author": "World_Quest", "ReviewID": "UR2884366", "Content": "A very nice contemporary euro style hotel. The rooms were small but nicely appointed. Several nice touches included shoe buffers in the hallways, huge windows that you could open like doors, internet enabled computer in the lobby, a small bar, and most importantly a complimentary shuttle to downtown Rome. Although there is no onsite restaurant, they offer a complimentary breakfast of cheeses, meats, breads, cereals and fruits. The Zone is in the surburbs in a non commercial neighborhood. Its about 10-15 minutes away from the city centre by car. The upside to this is the peaceful quiet of the area. The downside is there is absolutely nothing to do there. There are a couple of restaurants/snack bars and tabacchi shops a few blocks away. If you do not have a car you will need to either use the shuttle or the public bus service to reach the tourist areas. I recommend getting accquainted with the bus/metro schedule since the shuttle isn't available after 7PM. There is a bus stop a couple of blocks from the hotel. If you take the bus to the Metro station you can get to most attractions relatively quickly. The Zone is great if you are adventurous enough to use public transportation and don't need many frills at your hotel. I'd love to stay there again.", "Date": "December 15, 2004"}], "HotelInfo": {"Name": "Zone Hotel", "HotelURL": "/ShowUserReviews-g187791-d230560-Reviews-Zone_Hotel-Rome_Lazio.html", "Price": "$94 - $392*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Alfredo Fusco 118</span>, <span class=\"locality\"><span property=\"v:postal-code\">00136</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "230560", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/09/b3/09b3c62d533a0d6cce9db833a247195c12large.jpg"}}