{"Reviews": [{"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Australia", "Title": "“Nice new hotel but a long way from anywhere except the Halic Kongress”", "Author": "helenmcd", "ReviewID": "UR128406161", "Content": "Stayed here to attend a conference at the Halic Kongress. Nice hotel but there is nothing anywhere near it and it is a TL35 taxi ride into the main part of town. Good Internet, small but very clean and well equipped rooms. Good breakfast but apparently other hotels in town have much better ones, but still, the food was great and it was included in the room rate, so good value - not that there is anywhere else nearby that you could go to anyway. The rooms have a great view and the windows open which w great as the weather was wonderful on some of the days I was there. The staff are really helpful and everything seems to run smoothly. Opposite s nice park but as the hotel is located on a very steep slope, walking back is a challenge.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Tarrytown, New York", "Title": "“Nothing special, over priced”", "Author": "CherylNS", "ReviewID": "UR128282713", "Content": "Yawn, adequate hotel, frazzled staff, tourist central. Skip it.", "Date": "April 21, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Beirut, Lebanon", "Title": "“Good hotel provided by turkish airlines”", "Author": "Naguizz", "ReviewID": "UR126629500", "Content": "I guess this hotel with all the weather delays became more popular through turkish airlines, we were also on our way back to Beirut and i have to say we were lucky that we booked with turkish airlines since they really looked after us as we saw what happened to those travelling with other airlines. The hotel was nice, 30 minutes from the airport, rooms are clean and cozy, bathroom is nice and modern, basically has everything one needs and i had no complaints, my stay there as completely free , breakfast was really good, i suppose it is a turkish trademark to offer really rich breakfasts, this is my third stay in turkey and i was lucky in all three If i get the chance i will stay again in this hotel, or maybe if my flight is delayed again i will get to stay there again for free, who knows..", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Codicote, United Kingdom", "Title": "“Keep away until Libyan war guests leave”", "Author": "alp1942", "ReviewID": "UR125994208", "Content": "We had two rooms with my brother last weekend. Whilst the hotel is spotless, and the staff one of the nicest crew I encountered recently, with best of smiles, common parts i.e. the restaurant and the lobby were unusable due to a very large number of Libyan war wounded being treated in Istanbul. I do not have anything against such a humanitarian effort and I congratulate and applaud the Turkish Government for this initiative but surely the management should warn prospective visitors that the hotel is being used as a recuperation centre. Health centre ambiance is not conducive to a pleasure weekend in Istanbul.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Moscow", "Title": "“Perfect stay between flights”", "Author": "comnen", "ReviewID": "UR125036383", "Content": "Stayed there in the beginning of february, when there was a lot of flights delays. This hotel was provided by Turkish Airlines. The location is far from city attractions, but MiniaTurk is close. Surroundings are dull. The hotel itself is very nice: lobby, good breakfast (take fruits!), free wifi (ask for password).", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Budapest, Hungary", "Title": "“Perfect for Business”", "Author": "Patricia D", "ReviewID": "UR121676829", "Content": "Staying at this hotel, the guest is welcomed by a very attentive staff who does their outmost to make guests happy. The hotel is brand new and modern. They have a large selection for breakfast, nice meals for lunch, but there are outside dining possibilities just 50 m down the street. Meeting rooms have all the technical equipment you may need durig your meetings. All in all, a very comfortable stay.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "San Diego, California", "Title": "“New Hotel with Great Staff”", "Author": "bdouble", "ReviewID": "UR121301552", "Content": "I actually wanted a contest sponsored by Hilton Garden Inn and decided to go to Turkey to see my friend from college. I'll still try to present an unbiased review. First off, the hotel was only a few months old during my visit. The lobby is very nice and also features a business center, pantry for consumer goods, lounge/TV area, and bar/restaurant. Throughout the hotel, they have canvased pics of local attractions. The staff was very friendly and resolved a couple of minor billing issues I had when the central reservation center in the US hadn't put sufficient notes about my free stay. The bar is small and quite overpriced in my opinion (beers were $8+ I believe), but it is a high-end, chain hotel that probably caters more to business travelers than budget-minded ones like myself. Despite having a location a bit away from almost everything (except MiniaTurk), it had some incredible views. I had a room on the first flower which featured a large, private patio with a panoramic view across the river. The furnishings were new and high-end and the dream-style, adjustable bed is ultra-comfortable. They even helped me set up my laptop to use on the flat screen TV as I couldn't read the directions (in Turkish). The breakfast here is expensive ($18-20 I believe) but AMAZING. There were omelettes, 5 types of bread, probably 6 types of cheese, fresh olives, cafe/tea, and a lot more. Great if you have the money or time to enjoy it. The staff was exceptional and spoke great English. I found out one of the members had lived a few miles from my old home in Florida! Overall, this is a pretty expensive option but you get great food, service, and accomodations in return. Make sure you check out all the tourist attractions, bazaars, and food. Istanbul is an amazing place!", "Date": "December 1, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Tallinn, Estonia", "Title": "“Great staff deserve a better hotel”", "Author": "eab2124", "ReviewID": "UR121135950", "Content": "If I could give the staff an A+ and the hotel a C, it would reflect more accurately on my experience staying at the HGI Golden Horn. It's a brand new hotel with nice furnishings, comfortable mattress and a rather pretty view of the Golden Horn. I appreciated the fast, free internet and the very quiet location, as well. The staff were extremely friendly upon check-in and greeted us every morning and evening. On the other hand, I found the rooms too small and, given it's a brand new hotel, there were some plumbing problems: during my stay, for an entire day, the water was discolored and the hotel resorted to notifying guests that it is shutting off water for 2 hours the following day to fix the problem, which still reoccurred but to a much lesser extent. Breakfast was offered at 35 Turkish lira, a price I find offensive in a city where such a meal can be had at 1/5th the price. In general, I found I was paying too much for what I was getting, given that the hotel is too far from both business and tourist areas, apart from the convention center and the rooms are not commensurately larger.", "Date": "November 28, 2011"}], "HotelInfo": {"Name": "Hilton Garden Inn Istanbul Golden Horn Turkey", "HotelURL": "/ShowUserReviews-g293974-d2309995-Reviews-Hilton_Garden_Inn_Istanbul_Golden_Horn_Turkey-Istanbul.html", "Price": "$119 - $288*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Sutluce Mah. Imrahor Cad. Dutluk Sok No 2</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span> <span property=\"v:postal-code\">34445</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "2309995", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/42/87/4287c7a5d54c5e58c7f29b1c34b3be1f5large.jpg"}}