{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Hotel Allegra in Berlin”", "Author": "Rpstory", "ReviewID": "UR127417595", "Content": "This hotel was very nice for the value. It was walkable to many of the main attractions in Berlin with plenty of restaurants within walking distance. The reception desk was very friendly, the breakfast was delicious, and the room was small but very clean.", "Date": "April 7, 2012"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Texas", "Title": "“Good Value”", "Author": "Texasbutterfly56", "ReviewID": "UR114910955", "Content": "Good basic 3 star hotel. Good breakfast. Decor OK, Rooms OK.", "Date": "June 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Romania", "Title": "“Basic hotel, great location”", "Author": "Roazzura", "ReviewID": "UR106525508", "Content": "I have stayed in this hotel for 3 nights during a business travel and I have found it to be the right place to be accomodated if you visit Berlin. It's located in a quiet neighbourhood near Friedrichstrasse railway station, close to the bank of river Spree and at walking distance from Brandenburger Tor or Alexanderplatz. Near the hotel there are many restaurants with terraces on the river bank. The reception desk is in the hotel across the street, there you check in and you are given the card key to enter the hotel and your room. Rooms are clean, with basic facilities for a 3* hotel. The only inconvenience is that the bathroom is prefabricated and that makes it verry small and uncomfortable. Breakfast it's ok, you can choose something on your taste, whatever this is (eggs, cereals, fruits, coffee or tea, a.s.o.). All in all, a good place to stay for travelers who like walking through the town. I would come back again.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Bielefeld", "Title": "“Plastic Cube as bathroom !!”", "Author": "kauerman", "ReviewID": "UR19966088", "Content": "First the good things about the Allegra, the location is superb, just at Bahnhof Friedrichstrasse, but in a silent street with lots of restaurants around. However, the quality of the hotel itself is (friendly speaking) borderline. Instead of a bathroom the rooms are equipped with a plastic cube with a little more than 1squared meter size (including toilet, shower and sink). It means, you basically have the toilet under the shower. This is FAR below German standard I must say. Secondly, the breakfast room is tiny and there are not enough tables to fit all guests. Hence, you will have to squeeze yourself at any table, where there is a vacant seat, having breakfast with strangers at your table. The breakfast itself is excellent, but there the breakfast room does not provide an environment to appreciate this. Finally, schedule enough time to get to your room. A single tiny elevator serves the 80 rooms. All in all, I found this hotel disappointing, but the location makes up for some pitfalls.", "Date": "September 10, 2008"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Belgium", "Title": "“in the middle of Mitte !”", "Author": "A TripAdvisor Member", "ReviewID": "UR3937407", "Content": "We stayed here for 3 nights and are very enthusiastic about it. It's right in the middle of Berlin Mitte: 600 metres from the Reichstag and about 10 minutes from Unter den Linden. Bahnhof Friedrichsstrasse is just around the corner! And yet the Albrechsstrasse is very peaceful and calm with cosy little restaurants and cafés (Schiffbaudamm is in the neighbourhood, great to have a drink there on a terrace esp. late at night). Our room was big, sober and clean, just as we like it. We were very pleased with it! The breakfast (buffet) was excellent and the staff friendly. A minor detail : the breakfast-room was a bit too small. The ratings are okay. We loved Berlin (and this hotel) so much that we want to go back next year. I hope we will have a room in the Allegra Hotel again.", "Date": "September 25, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Brussels", "Title": "“Great location, good value”", "Author": "frauchang", "ReviewID": "UR3011270", "Content": "I loved staying at the Hotel Allegra! The location was fantastic, right near the Friedrichstrasse station, which is smack in the middle of everything. In walking distance to Unter den Linden and a lot of the historic sites. Very good breakfast, rooms were clean and comfortable though rather small, especially the bathroom, which reminded me of a space capsule. Across the street is its sister hotel, which has a restaurant and is more upscale (and more expensive).", "Date": "January 16, 2005"}], "HotelInfo": {"Name": "Hotel Allegra", "HotelURL": "/ShowUserReviews-g187323-d231106-Reviews-Hotel_Allegra-Berlin.html", "Price": "$75 - $180*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Albrechstrasse 17</span> | <span class=\"extended-address\">Mitte</span>, <span class=\"locality\"><span property=\"v:postal-code\">10117</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "231106", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/b1/5c/b15c14ebe72f2100cc0afd389a190c3a4large.jpg"}}