{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Amazing location, reasonable rooms and hotel services and great staff!”", "Author": "Travellingeuro", "ReviewID": "UR126879963", "Content": "We stayed in hotel Verona for 3 nights and greatly enjoyed our stay! We had booked our rooms based mainly on the reviews here and were not disappointed! The location is great, a short 5 min walk to the termini station which is safe to do even at night. It's also a comfortable 20 min walk to the colosseum from which the rest of Rome is very accessible by walk or public transport. The rooms were adequate though nothing fancy. Very clean, and had a picturesque view of courtyards and small quiet streets. The toilets are quite small though manageable. The breakfast was quite adequate too though it would have been nice to have fresh fruits and better hot drinks. The staff were very helpful and friendly throughout our stay. They took an extra effort to recognise all thief guests and enquire about our day's plans. We even managed to learn quite a bit of Italian! We were also iffered a room upgrade on our last bight which we much appreciated. One of the issues I had was the price, though centrally located, I did feel the rates were a bit on the higher side. However if I ever visit Rome again, would definitely stay here and reccommend anyone who does to do the same.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salem, Oregon, United States", "Title": "“A great Stay in Rome”", "Author": "Joni M", "ReviewID": "UR126634967", "Content": "My daughter and I started our Italy vacation in Rome. We were more than impressed with this hotel. The room was large and comfortable, it was quiet and night and the bathroom was fabulous! We loved the variety at breakfast and how convenient the hotel was to all the sites we wanted to see. Thanks for your part in our wonderful stay in Rome. I would definitely stay here again!", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belfast", "Title": "“Short Stay in Rome”", "Author": "Knockabout", "ReviewID": "UR125985933", "Content": "I can honestly say that when we booked this hotel, I thought that it would be just Ok as the price for accommodation was so cheap. I was very pleasantly surprised. The room itself was lovely, the bathroom was very small, yet has everthing in it. You could have ate you dinner of the flooor it was that clean and the bathroom sparkled the staff couldn't do enough for you. The only downside was the breakfast. Whist they are served until 10.00 am if you were not there early enough, say 9.30, they would not re stock the fridges. We were lucky enough, but the breakfasts are typical contental style. We stayed here for 4 nights. I can honestly say when I go back to Rome, I will stay in this hotel again. The location was perfect, a 10 minute walk to the Termini station. From here you can get trains, or metros anywhere. We even got one to the Colliseum, and it took three minutes from Termini. Good to note you can get a bus from Termini to the Airport and it only costs 4 euros.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Leeds", "Title": "“A really good choice of hotel”", "Author": "LeedsChrisB", "ReviewID": "UR125042685", "Content": "Just back from 5 days in Rome. We're really pleased that we chose this hotel. It's location is fabulous. It is about ten minutes easy walk from Termini station - which is great for the rail link to the airport - and far enough away from the immediate environs of the station which are a bit down at heel. It was about 5 mins walk to Cavour metro station and another 10 to the Roman forum or the Colliseum (we visited this on a stroll one night to see it illuminated and felt very safe doing so!). Down the hill to the left is the Monti/Via Panispera area which is crammed full of authentic little roman restaurants - we tried quite a few - our favourite being Restaurant Tema - but all the ones we tried were good so you won't go wrong. The room was great, kept very clean, with a big tv (didn't really use it but seemed to have loads of channels) a free safe - which we really appreciated - and free wifi - useful when you're planning where to eat each night! The bathroom was everything we needed and was sparkling clean each evening when we returned tired and a little jaded after another day's hectic sight seeing in Rome. All the front desk staff were really friendly and helpful - however special thanks go to Marco who helped us print off online tickets for the Vatican Museums and thus saved us about an hour and a half wait as we were able to dodge the world's longest queue! We felt we got really good value at this hotel, we would really recommend it and we would return again without any hesitation.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Anaheim, California", "Title": "“Great Location, Great Price for Rome!”", "Author": "Grace L", "ReviewID": "UR123886805", "Content": "My husband and I just returned from a two week trip to Italy. We stayed at the Verona Hotel for the first night, and made our way down to the Amalfi coast for the next three nights. I wrote a review for Hotel Sorrento City as well :) We returned to Rome for 4 nights for the 2nd leg of our trip and to celebrate the New Year! We are the type of travelers who like to stay in good locations, have good service, a clean place to stay, and most of all feel like we are getting a good value. The Verona Hotel delivered on all the criteria. We don't always stay at the four seasons, and we knew what we were getting with the affordable prices we were paying. Trust me, in researching, lodging in Rome was very expensive and over the New Year's holiday, prices were even higher. I would agree with most of the reviews on this forum. The rooms are small and the bathrooms are even smaller - but that's Europe! get over it. Most importantly, they were clean, and there were clean towels and an elevator to get up 4 floors with luggage! Breakfast was included and was very nice for a typical continental breakfast. We had a cappuccino every morning, with some toast, deli meats & cheeses, yogurt, and juices. It's in a good location. 10 minute walk from the Rome central station (Rome Termini) We were here for 4 nights, so we bought the Roma Pass which was great. For about 30 Euros, you had a metro pass for 3 days and skip the line benefits for at least two admissions. We used it at the colosseum. and we used the metro to get to Vatican City. Maurizio, at the front desk was espcially helpful. With our limited Italian, and his limited English, we were able to figure out a game plan for sight seeing. We would consider staying at hotel Verona again!", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Perfect Location --- very safe area”", "Author": "Sue A", "ReviewID": "UR122736560", "Content": "I chose to stay at this hotel after reading the posts on trip advisor. I'd like to share our experiences and also help demystify/realize some of the things mentioned in this forum. We rode the trenitalia from Firenze and hopped off at the Roma Termini. The key thing to do is to exit RIGHT out of the station, walk past the taxi stands and walk straight down Via Cavour. You will pass by the Santa Maria Maggiore church and the hotel is right around the corner. If you walk out of the other side of the train station, it is VERY local and you face many run down buildings. That made us very nervous but once knowing the RIGHT side exit, we felt very safe. There is truth to the tiny bathroom and it is true that the entire bathroom is basically your shower. The shower curtain encloses probably an 18\" x 18\" area and the shower curtain sticks to your body because of the air flow between the bathroom fan and the rest of the room. I ended up having to leave the side of the curtain in front of the toilet open to have enough room to turn (I am 5'2\", 115 lbs) and so that the shower curtain is not clinging to my body (yuck!). This caused water to essentially get all over the toilet, but it will not flood the rest of the bathroom. Be sure to remove the toilet paper before you shower because using my method will for sure soak your toilet paper roll like a sponge. The breakfast was lovely....though I wish they had brand name nutella instead and I wish they had freshly ground cappucino instead. Still very filling breakfast. The great plus about this hotel is it's safe location. Safety and hotel cleanliness matter a lot to me on trips, and I was pleased with the hotel. A quick note to help you out on how to get to the hotel: The hotel is about 6 blocks down from the Roma Termini and in a very safe location. It only took us 10 minutes to walk to the colloseum. There is the via cavour rail station on the B Line, but if you want to go to the Spanish Steps area, that is on the A line, so it's actually easier to walk up to the Roma Termini and catch the train from there.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Good value for money”", "Author": "Alena37", "ReviewID": "UR122589971", "Content": "We stayed in the hotel Verona for four nights. Staff was extremely nice and spoke good English. Room was very clean, recently updated, and even had a balcony. In spite of central location, room was very quiet as it was facing the backyard. Breakfast was very good for Italian standards and we were offered cheese, ham, rolls, juices, coffee, cereal, baked goods. Location is very convenient, very close to major attractions and the Termini. Overall, we were extremely satisfied and will certainly come back when in Rome again.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Clean, reasonably priced, comfortable and in decent location”", "Author": "holodan", "ReviewID": "UR120180585", "Content": "My partner and I ended up in Rome during the weekend leading up to Easter. We didn't plan it this way, it just happened because we could only get certain limited times off work. Needless to say it was a crowded time to go, hotels were more expensive and there weren't too many rooms available. I was a little worried about this hotel since it was a little closer to the train station than I wanted (I think about 6 blocks) and many guidebooks I read said to avoid the area immediately around the train station because it's not as nice and has more crime. However the neighborhood with the hotel seemed fine to me. It's right around the corner from the Santa Maria Maggiaore church. There is quite a bit of traffic on the street going by there, but the hotel was about 1/3 a block in from this street and was far enough not to be excessively noisy even with the windows open. With the windows closed, the temperature could be adjusted to be good, also. The Colosseum was only about a 15 minute walk and other attractions were also walkable distances. The bedroom and bathroom were not fancy, but they were a clean and comfortable retreat when tired or after long days. I found all the staff at the front desk be be quite kind and helpful and they certainly spoke better English than I spoke Italian. I would certainly stay here again, especially considering that the price point was quite reasonable compared to some of the other hotels in Rome I looked at. It was more comfortable overall than some of the other places we stayed in Italy since we didn't have the noise, mosquito and temperature problems we ran into even in some other places with higher star ratings.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "North Bellmore, New York", "Title": "“Rude hotel mgmt”", "Author": "Edward M", "ReviewID": "UR119887288", "Content": "I am 70 yrs old and did some traveling in Europe and the United States and I have to say this the first Hotel where one male desk person was very rude. My daughter speaks Italian very well having study in Italy several yrs ago. My wife and I and two daughters were staying at this Hotel. After my daughter unloaded the car with all our luggage and brought into the lobby my daughter chk'd us all in and then proceeded to ask the desk person for help w/luggage to the room and he said curtly no he was to busy. Looked around no one else in lobby no phone calls and he was reading newspaper. Rooms very small and so are the bathrooms. We asked if there was parking for the car and he said yes down the street. We brought the car to the garage 2 blocks away. Next day picked up car and e were told E25. The Hotel never told us there was a chg. The other Hotels we stayed never had a chg. Verona should be no Stars. During our whole vacation all the Hotels we stayed in were the opposite of Verona Hotel. Beautiful rooms, accomodating staff and even went out of there way to please. Some empolyees at Hotel Verona must go bck to Hotels 101.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brisbane, Queensland, Australia", "Title": "“Good Hotel Great Location”", "Author": "TwoMen A", "ReviewID": "UR119419232", "Content": "We stayed here for six days but this hotel was chosen for its location rather then its features. The rooms are quite small and the bathrooms even smaller. Most of the reception staff were quite helpful but one night manager was no use at all. It is very well located to all of the popular tourist attractions, public transport and local tour companies. The restaurant next door has live music and you can often hear that from your room, if on a lower floor. The breakfast area has indoor and alfresco dining which is quite pleasent and the breakfast is OK, but nothing hot.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“A Friendly Venue in Roma”", "Author": "tuktukcanuck", "ReviewID": "UR119238038", "Content": "We had a 2 week stay in this family owned hotel and were pleased with the attitude of staff and the accommodations. Breakfast was quite wholesome . The hotel was quiet except near the elevator. Location is quite central to attractions and very close to the On-Off buses. Front desk was always helpful and flexible. Although they wish full payment upon arrival to protect themselves, this is not necessary and daily payment is a good compromise. Rooms were very clean and the size varied as each room is unique.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "San Juan, PR", "Title": "“Excellent Hotel in Excellent Location”", "Author": "pablofm9", "ReviewID": "UR118158182", "Content": "A great hotel at a good price. I love the fact that it is close to everything and makes it easy to plan your day. The metro at Cavour is just around the corner with easy access to the colloseum and surrounding sites. A 10 minute walk leads to Termini station with plenty of shopping options when in need of anything for our trip. The service has been top notch with pleasant smiles and helpful advice on just about everything. This will not be my last stay here and I will recommend to my friends visiting the Eternal City.", "Date": "September 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Perfect if you r going to be most of the time out”", "Author": "DDancausa", "ReviewID": "UR117859213", "Content": "Its perfect if you look for a comfortable bed and shower. The service is really nice and they have a very nice terrace in which u can have breakfast. The location is really good, basically in between everything you should visit in Rome. I slept three days with my father in a double room while visiting the City and we left it very satisfied. Maybe it is a bit expansiva but you pay the location...", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Vista, California", "Title": "“Friendly staff, great location.”", "Author": "Cam G", "ReviewID": "UR117770904", "Content": "The location was terrific, right next to the Basilica di Santa Maria Maggiore and not far from Termini Station. Several places to eat in the area (we enjoyed both meals we ate at the restaurant nextdoor, but did not like the service or quick lunch we had up the street, on the corner and across from the basilica), but ask the guys at the front desk for directions to a less touristy area for more authentic food (we didn't do this until the last night of our trip - our loss, your gain). The internet cafes across the street are cheaper than the computer in the lobby. The staff was very friendly and helpful, especially Gesu (I believe that was his name), and we thought they all spoke very good english. The breakfast was good (my dad really enjoyed it), but the bread could have been better quality and the coffee machine misbehaved a few times. The room was comfortable and the air conditioner appreciated, although we would have preferred that the beds not roll, and the bathroom was very clean, but the shower was a bit snug (if you are overweight at all, I can't imagine it will be very comfortable for you). Overall, a pleasant stay and we would go back.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Edison, New Jersey", "Title": "“definately stay here again!”", "Author": "aviatorgirl2011", "ReviewID": "UR116074502", "Content": "location was great, reception was friendly and extremely helpful, shops and food close by all main attractions in walking distance and train close by as well. will be back to Rome and will definately stay here again!", "Date": "July 31, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Elk Grove CA", "Title": "“Great family - quad room on fifth floor”", "Author": "Mitchell013", "ReviewID": "UR115324139", "Content": "We stayed here for four nights at the beginning of our Italy trip. It was clean, quiet and in a great location - within walking distance to many sites. Anything further, we could hop on the train, bus or metro at Termini ( 5 min. walk). The staff was great - very helpful with directing us how best to get to our specific destinations. The breakfast was the best of the many places we stayed during this trip (yogurt, cereal, pastries, juice, hardboiled eggs, etc.). I would definitely return.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“We loved it!!!”", "Author": "Shimshi", "ReviewID": "UR110873836", "Content": "The hotel is in a great location - is located close to the Termini, colloseum buses and Metro. The staff of the hotel was very nice and helpful. The rooms were nice, clean and spacious. The breakfest was great the only thing that was missing were vegetable's. To conclude we had a great stay and if ever in Rome again I'm sure we'll come back!", "Date": "June 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Convenient location”", "Author": "Hellasgirl", "ReviewID": "UR108067216", "Content": "A very adequate hotel for the purposes of a sightseeing holiday. It's conveniently located for trains, buses and within walking distance of most sights eg Coliseum, Forum, Trevi fountain. Our room was small but clean and the bathroom although small was very new and clean (unlike some rooms mentioned in reviews). We had room 302. The breakfast was good with plenty to eat.", "Date": "May 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Not great”", "Author": "psconn", "ReviewID": "UR93254980", "Content": "This hotel has a pretty good location, nice staff and is affordable. However, I was happy to leave the hotel at the end of our stay. We had a small room that was decent, but the tiny washroom was gross. There was no shower stall/basin, so the water just collected on the bathroom floor. It was probably supposed to stay in the corner with the shower, but the shower didn't drain properly, so the entire floor was covered with soap and dirty water - making it difficult to use the washroom after showering. It was really disgusting. Also, the breakfast room does not seem to be cleaned between visitors so when we arrived towards the end of breakfast hours, the tables were all covered in garbage and lacking cutlery. It just made breakfast less appetizing. The check out time for the hotel is also 10:00am, which was not communicated when checking in, and is different from my previous experiences at Rome hotels where the check out time has aways been noon. It is an okay hotel, but I will stay somewhere else next time I'm in Rome.", "Date": "January 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Yes the Colosseum is only 10 minutes walk away.”", "Author": "Hut3Boy", "ReviewID": "UR85811278", "Content": "Easy 5-10 minute stroll from the main Termini railway station and 10-15 minute walk to the Colosseum. Clean, comfortable, smallish room but our bathroom had a permanent peculiar odour. Lots of eating options close by and walkable distance to Trevi fountain, Pantheon and Piazza Navona. Nothing particularly wrong with the Verona but not that special either with many alternatives close by probably worth considering. Air-con, lifts, TV and a good breakfast but the wi-fi wasn’t free .", "Date": "November 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Comfortable stay at Verona”", "Author": "vyv50", "ReviewID": "UR82328765", "Content": "Stayed for 3 days (Oct.1- Oct.4), everything was OK- good location (close- 10 min walk to Colosseum and Train Station), friendly stuff, good breakfast. A bit noisy during the night (should close windows), has problem with TV. But in general- satisfied.", "Date": "October 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Italy", "Title": "“Great Location”", "Author": "Jenn0310", "ReviewID": "UR77496250", "Content": "This hotel was nice, it was about a block and a half from the metro, had lots of restaurants down the street and across the street to choose from. Great free breakfast in the morning, no hot foods, but still filling. About 2 blocks from the hop on hop off bus tour. Very friendly staff, when I go back to Rome I will definately stay there again!", "Date": "August 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Rockford, MI", "Title": "“Nice place to stay”", "Author": "Klindblade", "ReviewID": "UR35455495", "Content": "The hotel is clean, with good air conditioning and small rooms. It's not super conveniently located (between 2 metro stops) but it's not that far walking from the Colosseum. The rooms have a good safe. Best thing was the air conditioner. They say they have parking but it's really a block and a half away at a private parking lot.", "Date": "July 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Madrid", "Title": "“Right place to move around”", "Author": "SirraMadrid", "ReviewID": "UR29142009", "Content": "I was there with my family (including a 2 year old kid) and 6 couples. 10 of us ran the Marathon. I'd say it was near to all the great monuments and to the Termini station (just walkable distance) apart from being the start & finish which is at the great Colosseum. The rooms are clean & good. Staff was friendly. No restaurent but that's not a problem cause there are a number of places next to or infront of the hotel.", "Date": "May 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Stockholm", "Title": "“Good place to stay!”", "Author": "Nattfari", "ReviewID": "UR23978232", "Content": "Me and my husband stayed here 3 nights and we were very happy choosing this hotel! Verona Hotel is located in a quiet street near Santa Maria di Maggiore. The bus stops close to the hotel and there´s a five minute walk to the nearest metrostation. There´s several resturants nearby. They arranged early check-in for us with no extra charge, our room was big and nice and the daily cleaning was exellent! Very nice breakfast with lot´s of choices. When we checked out early in the morning the staff gave us breakfast-bags. The only minus is that the walls were paper-thin and we were a little disturbed by the sound of the elevator. Would defenetly stay here next time we visit Rome, this hotel is good value for money!", "Date": "January 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Newcastle", "Title": "“Birthday Treat”", "Author": "JohnLNewcastle", "ReviewID": "UR21536935", "Content": "I stayed at the Hotel Verona for five nights with my wife as a 50th birthday treat and had a great time. The double room was over the front door of the hotel and the road outside but we were not disturbed at night. The toilet / shower room was of adequate size, clean and serviced daily. The continental breakfast had a good selection. The hotel is close to the Basilica Santa Maria Maggiore which is a beautiful church and all the other sights of Rome are easily accessible by foot, bus or metro. During our stay there was torrential rain with thunder and lightening but there were plenty of restaurants and cafes close by.", "Date": "November 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cumbria", "Title": "“Loved it”", "Author": "CumbriaMole", "ReviewID": "UR21400948", "Content": "This was my third visit to Rome and we chose this hotel for the price. Loved the hotel it has a fantastic location 5 mins walk from the termini. We arrived 3 Hrs before our check in time our room was ready. Our room 401 was a good size for a standard bedroom and very clean (we have high standards as we both work for the Fayrer Garden hotel in Bowness Cumbria) only dislike was the TV remote didn't work too well (but how much TV would we want to watch anyway). Breakfast was a very good choice of breads, pastries, hams, cheeses as well as good strong coffee. Eaten inside or out. All the staff we met were polite and spoke great English We stayed for 4 nights and ate out every night the best being Trattoria Monti 5-10mins walk from the hotel onVia di San Vito", "Date": "October 30, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Basel", "Title": "“Good at daytime, bad at nighttime”", "Author": "Paolo144", "ReviewID": "UR20444368", "Content": "Hotel perfectly situated in the old part of Rome with access in walking distance to Colloseum and so on. But has problems with noise of elevator and roof aircondition. Never stay on floor 5 and definitely not in room 507. Extremely loud/no sleep possible at night. We stayed there 3 nights. Hotel clean and nice, breakfast not bad.", "Date": "September 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "De Meern", "Title": "“Friendly, well located hotel”", "Author": "Edwinek", "ReviewID": "UR20228209", "Content": "Only pluses here: well located in a pretty quiet street near Termini rail terminal (about 5 minutes walking), with a twice an hour rail link to the airport and many bus connections. Bus 84 to Piazza Venezia stops only a minute away. Nice for the way back when you're tired, but it's really in walking distance. Also just down the road from the Santa Maria Maggiore basilica (well worth seeing). Friendly staff and well equipped, though pretty small rooms (but hey, you only need it for sleeping and showering anyway), pretty good breakfast (including buns and toast, cheese, ham, salami etc.) which can be taken outdoors. Airconditioner in the room. Just one warning: if you're sensitive to noise, bring some kind of earplugs, the doors and walls may be too thin to your taste.", "Date": "September 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Monterrey", "Title": "“Very good Hotel for the Price”", "Author": "TravelerG1976", "ReviewID": "UR19269298", "Content": "The hotel was 5 min walking from termini Hotel, the room was very spacious considering that you are in Europe, the room has Minisplit, the size of the Bathroom was good, Cable TV, it has a mini bar, the breakfast was OK, Milk, Cereal, Bread, ham, cheese, yogurth. All the people in the front desk was very kind they speak English and they could recommend restaurants. Its a laundry just a block away from the hotel if you want to wash your clothes, as you walk out of the hotel take a left and in the next block take a left again the laundry its on the left side a 100 mts away, in front of the laundry you can get a GELATTO while you are washing :D.", "Date": "August 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Cheap And Cheerful”", "Author": "corsa_c_sxi", "ReviewID": "UR15876359", "Content": "Before arriving in room we were a little worried about the hotel since reading the reviews on here but we found the staff to be polite and helpful, Our room was cleaned to an acceptable standard including the day we were in it until 1pm and breakfast was enjoyable and there was plenty of it. this hotel was in a great location for sightseeing we walked everywhere but if you wanted to use the public transport it is cheap and easy to use. Dont get a taxi from the airport as the train station is only a 5 minute walk from the hotel, takes onlt 30 minutes and costs 11 euros. One piece of advise would be to get to the main tourist spots early like we did as later in the day the ques are terrible. Over all a very pleasant hotel we would stay here again.", "Date": "May 10, 2008"}, {"Ratings": {"Overall": "4.0", "Value": "4"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Good relation quality/price”", "Author": "Pax3", "ReviewID": "UR15489173", "Content": "Just to start, let me mention that hotels in Rome are ridiculously expensive! I stayed w/ my girlfriend at Verona hotel, and we were not disappointed. It's very well located: - 4 minutes walk to Termini (train to Fiumiccino Airport + bus terminal + subway) - It had a bus stop right in front of the hotel - There are plenty of restaurants nearby - 10/15 minutes walk to the Colosseum When we first arrived we were a bit disapointed, since the hotel seemed very small in every aspect (reception, claustrophobic lift and corridors), but when we got to the room, it looked pretty ok. It was small, but clean and looking \"new\". It had a nice bathroom. Though I don't like spending a lot money on hotels, I have minimum standards, and I must say Verona is a good choice. Breakfast could be a lot better though. A lot of cakes, some bread, juices, coffe, tea and milk and cereals, but little more. There's a pleasant space outside where you can have your breakfast, I preffered it over the breakfast room. In conclusion, even though it might have some minor flaws, it's a great hotel to stay if you're on a low/medium low budget.", "Date": "April 30, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "2.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Farnborough, Hampshire", "Title": "“Verona a great little hotel”", "Author": "Kazanne_uk", "ReviewID": "UR14780878", "Content": "My Boyfriend and I stayed at the Hotel Verona for a long weekend. We booked it through Thomson. My Boyfriend is great at wanting to plan routes, so we got the train from airport to the termini station. This took about 30 mins and the walk from the station to the hotel no more than 10 mins. You want to head towards the Church Santa Maria Maggiore and its just off the back end of the square across the road. As we arrived the doors were being cleaned and it all looked very clean. The Front of House staff were polite and we were soon off to our room. to get to the lift, you need to walk up a couple of steps we were on the 5th floor the lift stops between floors so you still have to walk up a few steps when you get out of the lift. Not so good if you struggles with steps as they appeared to be quite steep. The room was larger than we were expecting and had a balcony. It was clean and actually much better than we thought it would be. However the only slight problem was our room was right next to the lift shaft so was quite noisy everytime the lift was used. This didn't really effect us as we were out all day and in very late at night when most of the residents had already come in and gone to bed. Breakfast, I really enjoyed it, lots of choice, very European with hams and cheeses, pastries and Yoguart. The breakfast waiting staff were not as friendly as the front of house staff. This didn't really bother us, just gave us something to smile about. Rome itself..... WOW beautiful and so much to see. The sites take longer than you would expect so give yourself plenty of time to enjoy them. Worth visiting is the Roman Forum which leads up into palatine hill. That has to be my favourite site there so far. we also went to the Palm Sunday Service at the Santa Maria Maggiore church. The inside of the church left me almost speachless, with thousands of questions about some of the art work. It was amazing and quite unexpected as I thought it would just be pretty outside but just a local church. Places to eat we did the normal Italian restrants which were lovely and we spent ages over food and really enjoyed it. One night we headed out to an Indian resturant called the Little India. It was quite a walk from the Hotel and parts of the road were dark in places, so we felt bit nervous at times. It might be worth taking a taxi there as the food is wonderful and you are not rushed at all and its the best traditional style Indian I have had outside of India. I can't wait to head back there!", "Date": "April 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "England", "Title": "“Great Hotel”", "Author": "Budweiser30", "ReviewID": "UR14748628", "Content": "Stayed here for three nights, considering the value price we were both very pleasently suprised by the quality and cleanliness of the room. Though small the room was perfect for our shot city break, however we could easily have stayed for longer as it was lovely and quiet. The bathroom was cleaned to a very high standard every day and had a self contained shower unit (contrary to a previous review we had read before we travelled). The electronic safe in the room was a major positive. Breakfast was continental and plentiful and set us up until lunch time. We found the staff to be pleasent and helpfull, always said good morning and evening and even helped me with my italian pronunciation. Good location 15 mins walk to the Colleseum and Roman Forum and a number of museums. Just a short walk to a number of good quality restaurants (including one with a live musician). 5 mins walk to the nearest Metro which linked to all the other tourist attractions and to the tourist information centre, where you can book all number of excursions. All in all a great short break in a great little hotel, would deffinately stay there again. Simon and Amy", "Date": "April 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Orpington", "Title": "“Clean and comfrotable but not very Brit friendly”", "Author": "Croftonglazier", "ReviewID": "UR13990018", "Content": "Booked via Thomsons and although accommodation was clean, quiet and comfortable we were disappointed that, bearing in mind it calls itself a \"family run hotel,\" we never got to be introduced to the management. In addition we never got a \"Good morning\" or \"Good evening\" from any of the staff. There was a good choice at breakfast, particularly if you like croissants, cakes, yogurts and cheese rolls but tea and coffee were left in plastic containers on the bar and were always cold. Laura on reception was helpful but any Brit should take along a basic phrase book if they intend to build up any sort of rapport with this establishment. Situated at the top of a hill, near bars and restaurants, close to Basilica Santa Maria Maggiore.", "Date": "March 2, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Exceeded our expectations”", "Author": "Traveldoves", "ReviewID": "UR10013497", "Content": "After reading the other reviews on Tripadvisor, we were quite worried about our stay at the Verona. We were pleasantly suprised, we had a lovely room, recently refurbished. The room is quiet and clean. The breakfast had a lovely variety, although only sweet things. They packed a lovely breakfast bag for us when we had to be at the Vatican very early. The area is quiet and safe to walk around at night. The hotel is very close to the Termini Station, which is quite convenient for arriving and departing by train. We will definitely stay here again.", "Date": "September 28, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Swansea", "Title": "“Good hotel for short breaks and sight seeing.”", "Author": "lizxxx", "ReviewID": "UR7940228", "Content": "My boyfriend and myself stayed at Hotel Verona at the begining of June 2007. We were very impressed with how clean the room and bathroom was. The room was spacious enough for the two of us with a sofa in a seperate area. We were in a room overlooking the main road and although nosiy, once the windows were closed the noise was blocked out. Air conditioning was available in our room and a safe was also provided. The bathroom was clean and provided everything you could need. The staff were friendly and helpful. The only downside was the breakfast, only sweet things were available but at least it was something to keep you going throughout the day! All the attractions are within walking distance of the hotel and plenty of restaurants and cafes around too. Overall a very good hotel which I would go back to.", "Date": "June 20, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Miami, Fl", "Title": "“Terrible bathroom ”", "Author": "marggis", "ReviewID": "UR7429638", "Content": "We stayed at this hotel the last night of our honeymoon, so it was only to spend the night, and take an early flight. The location is convenient, as it is a few blocks from Termini Station. The room was fairly big, it has one double bed and anotherone which as a sofa bed which we really did not need). The smell in the room was not so nice, neatness... fair. What bothered us the most was the bathroom. It was extremely small you could just get around it, and I am 112 lbs! There were no towels, there were some kind of big cloths with this weird smell... disgusting!! The shower mount was just hanging in a corner, sharing the space with the toilet. Basicaly, if you sat in the toilet your feet were in the shower drainage. Terrible! I would not stay there ever!", "Date": "April 24, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Essex, England", "Title": "“A terrible shame”", "Author": "Atravelpassion", "ReviewID": "UR6113596", "Content": "We have just returned from a weekend stay in Rome which, on the whole, was great. However the weekend was somewhat spoiled when my girlfriend and I returned to our room early on the Saturday evening to find the cleaner / maid had been round and 40 Euro's had been stolen! At first the woman we spoke to on the reception desk tried to tell us that the cleaner had not been in that day and nobody had been in the room. We showed her our room as it was obvious somebody had been in... noting the perfectly made bed (with extra blanket), the new bin bag, clean towels and all of our things moved around but left very tidy. The woman then accepted that someone may have been in the room but could offer no explanation and instead insisted that it was impossible that 40 Euros had been stolen! The thing about weekend trips is that its easy to account for every Euro you spend. We did this and we are still 110% positive we left 200 Euro's in our room when we went exploring Rome's sights that morning... on our return there was only 160 left! 40 Euro's may not seem alot but when you have carefully budgeted for a weekend it does get noticed!! Following our complaints the woman from reception rang her director to discuss the matter and after some conversation we received the expected response of \"we cannot help you but you can report it to the police\". This is something that, we are sure they knew, we were not going to do as it was our last night in Rome and we were due to leave at 8am the next day... Would we have been taken seriously? Would we ever find out what action (if any) had been taken? Who knows?? We just tried to enjoy our last night in Rome, eating in a restaurant and drinking in a bar, whilst carefully watching our money so as to be sure we could pay for the taxi to the airport in the morning. On the whole, as earlier stated, our trip to Rome was great. The historic sights are fantastic, the food and wine is generally good (cosy side street cafe's are definately recommended) and the people are generally very friendly. However, our advice would be, avoid the Hotel Verona and do not leave money or valuables in your room even if it does have a safe as these, if not already faulty, have a manual override code that can be used in case people go home and leave them locked!", "Date": "November 13, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Scotland", "Title": "“Very Good Hotel”", "Author": "suzecat", "ReviewID": "UR5380726", "Content": "Enjoyed our stay at this hotel. Room lovely. Very clean. Staff friendly and helpful. Close to bus and taxi or within walking distance of a lot of attractions. Would recommend.", "Date": "June 25, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Leamington Spa", "Title": "“pleasantly surprised”", "Author": "glanna", "ReviewID": "UR4971395", "Content": "Having read some of the reviews was a bit nervous about the noise as im a light sleeper, so at the travel agents we specified a quiet room. we could hear no traffic noise whatsoever and although the walls were thin the other guests were extremely quiet. breakfast was very tasty, rooms were spotless and very comfortable, staff were hit and miss but on the whole very pleased with this good value hotel.", "Date": "April 13, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Essex, England", "Title": "“great value”", "Author": "CJ_The_Globetrotters", "ReviewID": "UR4732703", "Content": "We thought this hotel was great value for money. We paid £60 per night for a room for two booked with Thomson holidays. The location was great, only a 15 minute walk from Termini and about the same to the Colosseum. We were a little worried about staying here after reading some of the reviews but we had no major problems. The room was probably the smallest hotel room we've ever stayed in but if you are looking for some where clean and comfortable to sleep at a great price then this is the place for you. If you are looking for luxury then I suggest you look somewhere else. The breakfast was basic but there was plenty of it, not much choice if you like savoury stuff though!! Plenty of pastries, cakes, croissants, jams, yoghurts and cereals. CIAO to the moody breakfast lady. We had a brill time in Rome, we would recommend a trip here to anyone!!", "Date": "March 25, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Harrogate, United Kingdom", "Title": "“great value hotel”", "Author": "brinybrooo", "ReviewID": "UR4441108", "Content": "we stayed here a couple of years ago and could find no reviews then to help me so decided to do one! this hotel is very simple, clean, good rooms with lockable safe, friendly staff and near to the subway station to get everywhere. couple of doors down was a lovely resteraunt that serves delicious food and over the road there was another resteraunt called L'esquilino that is lovely too.", "Date": "February 7, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "NE England", "Title": "“Nice Hotel, good for sight seeing”", "Author": "Lizzy-J", "ReviewID": "UR3982494", "Content": "Hotel is in a good position for visiting most of Romes sights. Rooms are small but typical city size. (for this price band). They are clean and the showers are good. You can walk to all attractions but use the metro where available as your feet get tired, there is something to see on every corner and you will want to walk round for hours. The hotel is a short walk from the main station so you can get on the metro or buses to visit the sights (recommended for St Peter's and the Vatican Museum). One complaint is that the breakfast is not good. No cheese and meat, only sweet rolls and cake. We stayed for 4 nights and would stay again for the location and cleanliness of rooms.Staff on reception are friendly, but the breakfst lady was very grumpy and i felt as though we were imposing. Loved the city, might have something to do with my boyfriend proposing at the Trevi fountain(I said Yes). Enjoy your trip.", "Date": "October 1, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Covington, Louisiana", "Title": "“Great little bargain!!!”", "Author": "bernieshere", "ReviewID": "UR3786709", "Content": "When visiting Rome in Febraury 2003 I found it to be a great bargain. I had a single room which was larger than other singles I've had in Europe. Room was very clean (very important to me), had a comfortable bed and a minibar. No safe. The room was on the front of the building and I had to have my wdows open the whole time I was there. Too much heat that could not regulated in the room. Street noises were present, but I was so tired from siteseeing that noices didn't bother me much. Breakfast was enjoyable as was the little Italian man serving it. The biggest problem was the elevator. It stopped between floors instead of on floors. No matter what, you have to drag your luggage up or down stairs. The bath had only a shower which is okay, but when you used the shower the whole bathroom and everything in it got wet!. Staff was friendly and helpful when needed. Would I go back? Yes, I would. I've learn how to DO these little European hotels over the last few years. You just have to know that when you travel in Europe things will be different. Isn't that WHY we travel?", "Date": "August 18, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Scotland", "Title": "“Disappointed in this Noisy Hotel”", "Author": "Addictedtotravel1", "ReviewID": "UR3676465", "Content": "We visited this hotel in January 2005, Never again! This hotel is basic but clean. The location is okay, only minutes from Termini Station and is within walking distance of all major attractions. The major downside though is the paper thin walls. We did not have one good nights sleep in this hotel. You can hear absolutely everything. Our room was on the second floor and we did not have any neighbours as we were on the end with only a cupboard next door yet we still heard everything that was going on. We could hear people coming and going in the reception area, using the stairs, footsteps in the corridors and talking in rooms at the other end of the hall. Once we eventually fell asleep we were woken again at around 6.00 a.m. by noise from the kitchen. We asked to be moved to a quieter room and were moved to the top floor which I must admit was much quieter as we were also away from the stairwells. Elevators only stop on the floors below and above the floors with rooms so there is no avoiding those stairs with your case! Staff were unfriendly and unhelpful. Only stay here if you are on a budget, try to get a room on the top floor away from the stairs and hope for quiet neighbours.", "Date": "July 17, 2005"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Munich, Germany", "Title": "“Bad customer service”", "Author": "A TripAdvisor Member", "ReviewID": "UR3318023", "Content": "This review is only to rate the customer service at the hotel and the location of the hotel. We came back from Rome a week ago, and were highly disappointed at the treatment we got at this hotel. We booked to stay at Hotel Verona for 5 nights. Because we arrived to Rome early in the morning, I called the hotel to see whether it would be possible to stop by and leave our luggage, and then come back later in the day for check-in. The receptionist agreed to it. So we took the taxi to the hotel, and when we arrived and attempted to check-in, we were informed that our room wasn't available due to some electrical problems. She then said that they placed us in a 4 star hotel, and it wouldn't cost us any extra money -- why didn't she tell this when I called from the airport??? We were really upset because our taxi was gone (and we were not offered any assistance), and we had to carry our luggage to this other hotel. On top of it the receptionist gave us the wrong directions so we were walking around for half an hour, and eventually ended up in a tourist information booth. From them we got the right directions, and finally were able to make it to this so called 4 star hotel Genova situated on probably the noisiest street in Rome. (Later I did some price comparisons for room rates and found out that the room rate is lower at Genova so we're getting some of our money back.) Interestingly, my brother-in-law also booked a room at hotel Verona, but surprise-surprise his room wasn't available either and he ended up with us at hotel Genova. We think that they simply overbooked at Verona, and then had to shuffle people around. Even though I cannot comment on the room quality, I can say that the hotel is located on an ugly street in a dumpy area. I wouldn't recommend anyone staying there as I think they are dishonest towards their customers.", "Date": "April 1, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Ayr, Scotland", "Title": "“Dissappointed with Hotel Verona”", "Author": "A TripAdvisor Member", "ReviewID": "UR3255868", "Content": "Stayed for 3 nights at the Verona. Room was pleasant enough, but no available electric sockets to plug in a travel kettle or travel iron. Bathroom had no shower tray just a drainage hole in the floor. Breakfast very basic, even a slice of cheese or cold ham would have been appreciated. Staff were either very pleasant or very unpleasant - no happy medium. I would not stay here again, which is a pity as it is in a good location for sight seeing.", "Date": "March 7, 2005"}], "HotelInfo": {"Name": "Verona Hotel", "HotelURL": "/ShowUserReviews-g187791-d231291-Reviews-Verona_Hotel-Rome_Lazio.html", "Price": "$140 - $350*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via di Santa Maria Maggiore 154</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "231291", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/33/8b/d7/il-ricevimento.jpg"}}