{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“The very worst I have stayed in Amsterdam”", "Author": "SennamanUK", "ReviewID": "UR118367014", "Content": "I booked a last minute trip to amsterdam with my wife and wanted a cheap clean hotel in a good location. To be fair its ain a great location, but thats where it ends. It is a pit that needs to be totally refurbished. We had the room behind reception that actually had the stair case in so as with most places in Amsterdam hotels there are loads of people at all hours of the night coming and going. Complained and they just basically said tough so I checked out and stayed in one about 50 meters down the road which was much better. The room was tatty, cramped dirty and in disrepair, I think I would rather recommend a bench in one of the squares rather than this place, stay here at your peril!!!", "Date": "September 20, 2011"}, {"Ratings": {"Location": "2", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Uknown", "Title": "“Horrible place”", "Author": "Myself00", "ReviewID": "UR118091557", "Content": "we stayed there for two nights, what a nightmare, dirty dark place, endless stairs, tight rooms, actually tight everything, we were actually without power for several hours the second day of our stay, so no shower because the water was cold, didn't shave either cuz it was dark. This hotel is a perfect place for rottens and nothing else. STAY AWAY!", "Date": "September 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Katwijk aan Zee, The Netherlands", "Title": "“very very bad!!!”", "Author": "joanie86", "ReviewID": "UR107656425", "Content": "we Arived at this Hotel and were shocked to find out the building was completly renovated and not fit for living, the windows where boarded up and it looked terrible. We had a look around the building for a while, through the windows we could only see woud and building aquipment laying on the floor. We looked for the entrance but no luck. We found accomodation elsewhere, but 3 days later realised we were charged a night by this hotel for the \"inconvenience\" of us not arriving for check in as we had booked online. They where open apparently but it didn't look that way at all, i defenatly would not have stayed there anyway the state it was in, it's a good location but the rest is just terrible.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Nottingham", "Title": "“All you'll find is an empty building!!!”", "Author": "NottinghamToffee", "ReviewID": "UR95280793", "Content": "We booked last August for this trip & at no point since did we get any correspondence to say the hotel had closed. Imagine our shock when we arrived to be confronted by a building up for sale & nothing more than a shell!!! My advice, if you've made the same mistake as us, (it's still on the internet as a lovely hotel!) wander further down the street, find the Lindburgh & book an apartment! Thankfully we found the Lindburgh & the staff were wonderful & sorted our accommodation problem within minutes. The apartment was clean & cosy & cheaper than the Damrak.", "Date": "February 2, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "dano535", "Title": "“Darn-I'd rather sleep on a Rack!”", "Author": "dano535", "ReviewID": "UR38575029", "Content": "Subject: Amsterdam Location: Amsterdam, Noord-Holland, The Netherlands, Europe Title: Never, ever, again! ID#: 38056587 I actually read reviews for this hotel on TripAdvisor before I stayed at this hotel with my teen son that a travel agent booked for us. The agent assured me that reviews online should always be taken with a grain of salt. At that point, I should have relied on my gut and TripAdvisor. This place is a tourist trap, and they prey on those who don't know any better. The front desk was a table in the back of an Argentine restaurant, and you have to lug your luggage through tables and chairs. The room had no sheets on the bed, no outlets in the room or bath, mold, broken furniture, and worn carpeting. I asked for a new room after telling the front desk I was in Amsterdam with my teen son and not for sex or drugs. It seemed it was assumed those were the only things one would need a room here for. Power in the room wouldn't work if I took my room key, so my son couldn't watch TV or read if I went to get a cup of coffee. I asked for a new room, and the second one was only slightly better because it didn't have any carpet at all. I felt so guilty bringing my son here, we left after two nights and I spoke with the manager about getting my money back for the next two nights. I filled in a ton of forms for the owner who was not on site, and the manager said his hands were tied. After I realized I was probably going to get charged for all four nights, I did let them know I would write an honest review here, but if I got the refund, I wouldn't be so brutally honest. I walked down the road to the classier Swiss Hotel and got a rate that was LESS than at the dumpy hotel. I was also greeted by uniformed guest service reps in an air-conditioned lobby. It was an awful way to start our vacation, and it's a terrible example of Dutch hospitality.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Marysville, Ohio", "Title": "“Horrible, Terrible, Insufferable”", "Author": "ohiohungarian", "ReviewID": "UR36356168", "Content": "Avoid this hotel! Almost everything was broken in the room, stuff (who knows what on the wall), and a twin room with only one pillow!", "Date": "July 31, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "amok", "Title": "“A hotel to avoid despite location”", "Author": "amoks", "ReviewID": "UR34866326", "Content": "The service we had at this hotel was shockingly bed, the man on the reception desk was incredibly rude when we were trying to sort out a booking problem and insisted on continually pointing in my face. The triple room was small and was in a very poor state of repair. This hotel is in a very good location but this in no way makes up for the terrible customer service (it was so bad my friends and I prefered to pay for breakfast nest door rather than have the breakfast included in the room rate) or poor room. There was no airconditioning which meant we were left with the choice of being boiling hot or leaving the window open and allowing the midgies in to bite us during the night. I have emailed the owner to complain about the service I received and haev had no response after 3 weeks. To make matters even worse (as if it was possible) I posted feedback on the website I booked this hotel trhough (easytobook.com) but my comments have not beed posted and the marks awarded start at 5 so when you think you are awarding the lowest possible score you are actually awarding 5 out of ten, misleading to say the least.", "Date": "July 15, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "New York", "Title": "“Stay away”", "Author": "NBJ_9", "ReviewID": "UR33309137", "Content": "Location is central, but everything about this hotel was awful. The room was dirty, bedding was dingy and smelled uwashed, comforters had cigarette burn marks and you're provided w/ stained towels that had once been white. We were afraid we'd leave carrying bedbugs and a rush. Forget room service, internet, alarm clock or even phone, and the A/C made plenty of noise but failed to cool our room. Also, be careful w/ your valuables, as we left carrying less items then we came with.", "Date": "June 27, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "london", "Title": "“Shared our room with thousands of bedbugs !!!!”", "Author": "suzie-sioux", "ReviewID": "UR30821400", "Content": "stayed for a few days only and were initially shown a relatively clean room which we stayed in for the night. We were then moved to another room which was revolting. A big fake wooden head board thing housed thousands of bugs that wait for you to go to bed before feasting on your blood. Heavily blood stained mattress and sheet, and dirty fresh blood stains on towels. Complained but the manager had mysteriously vanished and was not due back for some days. All staff very reluctant to visit our room. We caught in excess of 50 bedbugs in a plastic bag as the reception staff adamantly denied that there were bedbugs in the room. It was not until we began to show other guests our little biting roomates and they began to leave that we were offered any money back, by this time it was 4 am and we had been sitting downstairs, with no where to go all night All we got was a refund for that night spent arguing and catching bedbugs for evidence, and with no where to go.... No offer of a good will gesture or even an apology, ...Shame on you Damn Damrak", "Date": "May 26, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "San Diego, California", "Title": "“HORRIBLE HOTEL”", "Author": "SanDiegoLeslie", "ReviewID": "UR29485931", "Content": "Don't waste your money at this disgusting (but expensive!) hotel. Hair in the bed, stains and holes on sheets, tons of mold on the bathroom ceiling. Not a comfortable stay at all; breakfast was a joke. Staff could care less. Unpleasant all the way around.", "Date": "May 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "San Diego", "Title": "“I would have rather slept in the train station!!!!”", "Author": "alycat92107", "ReviewID": "UR29335922", "Content": "We stayed at the Damrak for two nights. It was a horrible experience. Dark, dirty, moldy, and unfriendly. The bedding was stained and uncomfortable. On night two we noticed a pair of mens underwear in the closet. We had not noticed them the day before. Not quite sure they didn't rent the room out by the hour while we were out for the day! I had to take two sleeping pills to get through the second night in this hotel. I was uncomfortable, felt dirty and unsafe while I was there. Don't waste your money!!!", "Date": "May 4, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Athens, Greece", "Title": "“I found a mouse in the closet , had eaten my stuff !!!”", "Author": "polinaki", "ReviewID": "UR28605972", "Content": "I stayed two nights in this awful hotel.The first night the bed sheets smell like someone had peed on them. And also there were funny noises coming from the closet. Next day I discovered that a mouse had eaten my bag with gifts I bought to bring home.... The receptionist was ironic and rude , nobody cared, they didn't say sorry or something else, they didn't give me my money back. Don't ever stay in this hotel!!!!!", "Date": "April 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "England", "Title": "“Let me out of here!”", "Author": "Beseeingyou", "ReviewID": "UR28397487", "Content": "Booked two nights, months in advance, based on the central location and the great looking pictures on the website. Do not be fooled! The website is misleading. This is a thoroughly unpleasant hotel. Our small, dark and dingy room seemed essentially clean but everything appeared old and worn out. The twin beds were the smallest I have ever seen at any hotel! The staff were totally disinterested in my complaints and refused a refund but it was so bad that we left the hotel and stayed in the Tulip at great expense rather than spend any more time in the Damrak. This is like a 1star hotel at 3star prices.", "Date": "April 20, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "west wales", "Title": "“Better than expected”", "Author": "WestWalesKiyo", "ReviewID": "UR25886160", "Content": "My husband and I stayed here for 3 nights on a short break. We were pleasantly surprised after reading some of the reviews. I would say this hotel is more of a 2* than a 3*. However our room was clean and the bedding was too. The room was freezing but once you put the heater on provided it was fine. If you want a shower be the first to use it. If you 're second expect to freeze. We stayed in a triple room which we found adequate for the two of us. One let down was the morning receptionist. She barely spoke. Only one word answers if you were lucky, really miserable. Breakfast was boiled eggs in a dish to help yourself. A couple of trays of meat and cheese. Two toasters to make your own toast. Orange juice, tea and coffee. We were more than happy with this, if we wanted cooked breakfast we'd go to a cafe. One morning though we came down for breakfast at 09:00 and there was no ham, no cheese, no tea, and no bread. They said they'd run out of bread and someone had gone to get some. No sign of anyone after 15 minutes so we went for a cooked breakfast. The restaurant was n't bad, food was very nice. They need to invest in some new crockery though the plate they served my dinner on looked liked the end had been chewed off by that man from the James Bond films with the metal teeth. No exageration!. I would n't dream of commenting on a plate with a crack or a chip. I thought it was hilarious!. You could n't fault the location of the hotel. Our room was clean and I felt safe staying there. We paid Â£31.60 per person per night including breakfast (they do provide it most mornings). Not a bad deal and the lift did n't break down once. Hooray!.", "Date": "March 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Not as bad as you'd think”", "Author": "LollyNYC", "ReviewID": "UR22336797", "Content": "After reading a lot of the one star reviews on here, I was a little nervous...but my expectations were definitely exceeded. Yes, it's grim and dark and old, but that's part of the experience. You don't go to Amsterdam to stay at a Marriott. If you don't want any surprises, then yeah, go for your chain hotel and be pleasantly bored. The Damrak is definitely anything but boring... I would say the best thing about the hotel is the Argentinian restaurant downstairs, where guests receive 10% off of their meals. Also, the wireless was faultless. I'm a student and rely on the internet to stay up to date with my classes via Blackboard, so internet is always a big deal for me. I never had a problem. Finally, the location...you really can't beat it. You're smack in the center of the city, less than a five minute walk from the Central Station, and you can just step outside and have your choice of dozens of cuisines and things to do. Definitely a touristy area, but convenient. Now onto the \"grim\" - there are no smoking signs in the rooms, and I requested a no smoking room...but what they don't tell you is that smoking IS allowed in the hallways. So everyone on my floor stepped out at all hours of the night to smoke, and that stench seeps into your own room. I woke up sick one morning. Really not healthy. Also, my sheets looked clean and new, but the comforter had an odd smell to it. I did without. The rooms are old and the carpets and decor are definitely from the 70s, but that kind of adds to its charm. Parts of the carpet are warn down and gritty, but I wasn't going to let that ruin my trip. I wore flip flops. The bathroom was definitely clean and the water pressure was really good. My other complaint was not really the hotel's fault, but the guests are SUPER noisy. The walls are thin (old building), and it felt like the adult guests here were more ridiculous than any of the guests I encountered at various youth hostels. They were coming in at all hours of the night, pounding on everyones doors for fun, screaming in the halls, etc. For about three hours on Sunday night I had to listen to a sports game blasting and the groans and cheers of the men watching. There's only so many times a staff member can tell people to quiet down, so it's not their fault. Another thing I thought was weird was that you had to leave your key whenever you left the building. You left it with the front desk clerk and picked it up when you came back. To me, it wasn't really an inconvenience, except for when one clerk was more interested in the internet than helping guests. But another clerk knew who I was and what room I had, so when she saw me coming she had my key ready and waiting, which was very nice. But then when I was thinking about it, I realized that it means the hotel staff knows exactly who is in their rooms and who isn't at all times, which didn't really feel secure to me... When it boils down to it, if you want convenience and a low cost and aren't afraid of a little grit, the Damrak will exceed your needs. But if you're the type to complain about every little dent in the desk or chipped paint on the wall, go to a chain so you feel like you're back in the US.", "Date": "December 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Doncaster", "Title": "“Very good experience”", "Author": "TheLickster", "ReviewID": "UR20144801", "Content": "I booked the Hotel Damrak for a 1 night stay for my wifes birthday in May 2008. I had read several mixed reviews so didn't know exactly what to expect and like everyone, was hoping for a good one. We arrived at the Hotel at 10.30 am to be greeted by a very friendly reception lass that went out of her way to be nice. Cases were left in the luggage room which was cool as we couldn't get into our room until 1pm. We were in room 36 which was excellent and a double room. No view from the window other than the escape exit stairs but it was clean with clean towels and floors and clean walls and the tv worked perfect and had a remote. The bar and restaurant were cool with plenty to choose from. Breakfast is NOT bacon and eggs, lol, which was a litle disapointing, but when in Rome.....eat the continental crap they serve for breakfast. Location is 100% awesome. You are a few yards from Dam Square and the famous red light district and cafes, the sex museum is like 5 buildings away and Centrall Station is close enough to nearly be able jump to. This Hotel is in the middle of everything you would visit Amsterdam for. My wife and I are 35 and had an awsome time. The price for the room was great, Â£80 for us both. Would definitely stay in this Hotel again from our experience. Hope my review helps. Please message me for any further details that I may have forgotton. Cheers, Steve", "Date": "September 17, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "bangor", "Title": "“disgusting damrak”", "Author": "chickensBangor", "ReviewID": "UR19622765", "Content": "the damrak hotel is absoloutly disgusting. The photos on the website are very misleading, they cant possibly be the hotel we stayed in! the rooms are nothing like the photos. they are dirty, dark and very grim. there were stains all over the walls, staff regularly walk into the room and you get a sense that anyone can and will just walk in at any time! i cried on the first night as i was dissapointed by the hotel and i actually felt dirty even being in the room cus it was so mingin! if we hadnt spent all or money on the hotel, we would definitly have looked for somewere half decent to stay! never stay at hotel damrak! im convinced the only reason we didnt see rats was because even the rats wouldnt stay there.", "Date": "September 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "South Wales", "Title": "“Best Hotel On Damrak”", "Author": "neil_boi", "ReviewID": "UR19551844", "Content": "This is the best, affordable, hotel on Damrak. Our room had clean sheets and towels everyday! The rooms are very well decorated, laminate effect floor, and modern dark wood. Staff are so helpful and polite. Its so easy to get to from Centraal Station. Great bar and restaurant! It even has a lift so no climbing stairs with heavy bags. We stayed in summer and our room was rather warm, but if you leave the window open all day it stays very cool. The bathroom was spotless. I would highly, highly recommend this hotel. If you're sitting there thinking should I shouldn't I comparing hotels, don't I done all that when I was booking, so glad I just booked this hotel!! Trust me from looking at the other hotels on Damrak I was going to book, this was the best.", "Date": "August 30, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "lincoln", "Title": "“Hotel From Hell!!!”", "Author": "haybon_8", "ReviewID": "UR19147670", "Content": "If you like mould, muck and stench then this hotel is for you!! We ended up getting another hotel, after losing our money on this one!! We could not unpack our clothes in this place, let alone sleep in the beds!! It was disgusting, we had 2 double rooms booked, both as bad, I even got taken to one of the better rooms to see if we could stay in one of them, but they weren't much better, all had mould on ceilings, filthy floors and upholstery, scratches all over the furniture etc. Wouldn't let my dog sleep there !!", "Date": "August 20, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Atlanta", "Title": "“Lousy Hotel”", "Author": "arsmith5", "ReviewID": "UR18473888", "Content": "The only good thing about this hotel is that is close to the Red Light District and the Centraal Station. The restaurant is OK. The receptionists are rude and could care less about anything you ask them. Employees just barge into your room without knocking. No, there is not a chain on the door. One time two guys burst in to \"check the safe\". The other time a lady burst in to tell me that today was check out day. There is no air conditioning, no ceiling fan so no circulation when its hot out. The bathroom is tiny and smell of mildew. You can sit on the toilet and have your head in the sink at the same time. They make you pay a 20 Euro deposit for an iron then claim to know nothing of the deposit when you give the iron back. The TV is tiny and has no remote. So basically nothing special for you at all. Just a bed and a roof over your head.", "Date": "July 31, 2008"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "London", "Title": "“Stay away from the single rooms!”", "Author": "ejg123", "ReviewID": "UR16553369", "Content": "I went with my mum to Amsterdam for a sight seeing break and we booked this hotel as it sounded central and was close to where the tour buses and boats left from. The on-line reviews seemed fair for the price and we booked a single room each. I really don't know where to start describing what we were presented with. The rooms were shocking - very tiny and dark. If I'd had a cat to swing it would have hit its head on the way round. A small single bed was pushed up against the wall with a pillow and throw/duvet folded on top (it was a make your own bed up style). The sheet however was already on the bed and I noticed a rather dark curly short hair on it - grim. There was a TV but it had wires sticking out the front so I wasn't going to touch that. There were cigarette burn marks in the walls and ripped furniture. The only ventilation was from a small window that opened out on a small smoking area in the middle of the building - this was filled with rubbish and pigeon excrement. If you opened the window then mosquitoes and flies came rushing into the room. The cleanest place was the bathroom, but I was not going to sleep in there. I refused to unpack and preferred to carry all my valuables in my handbag than leave in the room or safe while we went to find alternative (and much better) accommodation. I can't comment on the double rooms - the pictures of which enticed us in the hotels advert, if I had been aware of what the single rooms were like I would not have considered this hotel for our stay at all. Even the location leaves a lot to be desired, what the reviews don't tell you is that Amsterdam is having a new metro system built. The street the Damrak is on, and area from which the canal trips leave from, is filled with large cranes and noisy diggers obscuring the view of the canal and historical buildings. Apparently its going to be like that for a few years yet. If I had been a backpacker only needing a one night sleep over then this hotel may have just been marginally suitable, but I would say Â£50 a night is incredibly steep for that purpose. I'm 36 and my mum is in her 70's - if you are of these age groups and are looking for a respectable hotel. Look elsewhere.", "Date": "June 1, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "north wales", "Title": "“dreadful damrak”", "Author": "foxyladyno1", "ReviewID": "UR14855584", "Content": "arrived to a soaking wet room window left open bed soaked no one came to his rectify this problem after asking 3 times there were even mice running around yes MICE discusting and not helpful in fact the restaurant staff were extreamily rude. dont eat or stay there a real rip off", "Date": "April 7, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "scotland", "Title": "“hotel disaster”", "Author": "skindog79", "ReviewID": "UR13683823", "Content": "restaurant seems nice downstairs and reception. then you arrive in the room ripped carpet, cowboys for plumbers toilet was about 7inches off the wall and the heaters that bearly worked were hanging on and no more. the curtians if thats what they call them were okay to be honest. beds were single and pushed together but not bad for a nights sleep!! the furniture, i.e drawers and chairs, were all broken or hanging together. the fire alarms in our rooms were either wrapped with a condom or stuffed with tissues to stop the smoke!! managerial staff were not helpful and rather aggressive towards us!!!! this is only from group of 18 yr olds looking for place to stay for party weekend but this was a rip off!!!! beware!!!", "Date": "February 19, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "uk", "Title": "“[-] damrak”", "Author": "stobes", "ReviewID": "UR13676757", "Content": "the only good thing about this place is its location everything else about it is [-]. the room was freezing cold, dodgy shower, tiny bathroom, most things were broken in the room, there was a condom covering our firealarm so it wouldnt work and one of there staff tri8ed on a number of ocasions to charge us for 5 large beers which wee never even had, so dont go to this place, there is alot of nicer places very nearby aswell.", "Date": "February 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Not too shabby...”", "Author": "NotTooPicky-butCMon", "ReviewID": "UR13162068", "Content": "For my first taste of a European hotel, the Hotel Damrak was actually not bad. I was pleased to get it at a pretty good rate and it was backed up by a satisfaction guarantee by another website. As I said though, it was my first Euro hotel, so discern on your own what things are standard and what things are outside of the norm. 1. The rate was good. $50.00 Euro less than surrounding hotels. 2. The entrance was a restaurant/Inn. 3. The lobby was actually a reception desk at the posterior of the restaurant/Inn. 4. The elevator was a great sight to see! :) No need for steps with luggage. 5. The room ( a single) was adequate, although small (but it WAS a single). 6. The room, bathroom, closets were clean and well prepared. Good water pressure. 7. The continental breakfast (coldcuts, veggies, cereal, eggs, cheese, juice, milk, etc.) was different and pretty good. Kept me healthy and full at the start of my day(very important as that meant that I had more Euros in my pocket!) 8. The maid always came early (good). She always brought her two kids who played tag and games in the hallway (bad). 9. When you left the hotel, you had to leave your room key. ( good? bad?) 10. You could not have any overnight guests (bad). One of the staff members told me about this, the morning after I left with my overnight guest (GREAT!) 11. Very friendly and helpful staff. 12. PERFECT location! Would stay there again, but just in a bigger room.", "Date": "February 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Seattle, WA", "Title": "“It is what it is -- and that's pretty much OK”", "Author": "Speedball2", "ReviewID": "UR13083424", "Content": "You can't beat the location, just a block or so from Amsterdam Central Station and the Red Light District. The staff was very helpful -- they were nice enough to get my room ready a few hours before normal check-in. Very friendly -- even the waitstaff was pleasant (the lobby doubles as a restaurant). Breakfasts are about as basic as they come. If you'd like a break from the hotel breakfast, I recommend De Vergulde Lantaarn, which opens at 9 most days (10 on Sundays, I think). It's on the street just behind the hotel (red and white awning). (Go north from the hotel, hang a left at the first alley -- it's a narrow street, then left at the first street. About 100 feet down on your left.) Basic accommodations (I had a single room) and that's about it. You get two towels and the soap comes in a dispenser (no swiping bars to take home). Housekeeping, heaven knows why, likes to come in a lot -- it wasn't unusual for them to show up three times a day. Though the rooms had deadbolt locks, housekeeping had no way of knowing I was trying to get some sleep -- no Do Not Disturb tags. So, they'd constantly knock to get in. I got the feeling the same people own several of the hotels along the Damrak -- I seemed to see the same people in several of the hotels. Pretty good sized room safe (enough for a laptop computer and a couple external drives with room to spare.) If you're looking for a basic room to serve as home base, you'll do OK here. Things got a little noisy in the halls in the evening but nothing that disturbed me too much. If you need somewhat better accommodations, try the Hotel Inntel, the Victoria or the Golden Tulip (all within a stone's throw of the Hotel Damrak). I wouldn't recommend this place for a honeymoon but, for what it is, you'll be OK. (FYI, the Inntel is directly across from the Betty Boop Coffee Shop -- where Quentin Tarantino wrote a good bit of Pulp Fiction.) If you're really looking to spend some coin but stay in the same location, try the Swisshotel or, if you really have deep pockets, the Krasnopolski.", "Date": "January 29, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Convenient Location - Good Value”", "Author": "VLobos", "ReviewID": "UR11638696", "Content": "I stayed at the Hotel Damrak for one night on an overnight layover in Amsterdam. I requested a newly renovated room as others on the site have suggested and I did get it. The room was tiny but perfect for a single traveler looking for a place to stay overnight. It was clean and comfortable with a tv and a bathroom. The hotel was a short walk from the train station and the red light district. It is on Damrak St. so the location was excellent for a quick stay. The hotel staff was very friendly. Breakfast was not very special. This hotel is great for people who want a place to stay while they see the sites, not for relaxation or amenities.", "Date": "December 17, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Tipperary, Ireland", "Title": "“Okay!”", "Author": "mairesinead", "ReviewID": "UR10257310", "Content": "I read the mixed reviews on this hotel before I booked it and decided that I had to go to make my mind up for myself.My boyfriend and I stayed here and requested a newly renovated room (which we got) and found it very clean and all furniture was new.However,the room was small enough and the bathroom was tiny.We could get over these things but the things that bugged me the most was that our double bed (2singles together) kept moving apart if you slept anywhere in the middle of it,there was nothing to hold the 2 beds together,if we were awake in the middle of the night we could hear the next room using the toliet (and not just the flushing of the loo!),we were not allowed to bring food up to the room which was kind of silly as you dont want to eat in the restaurant everyday but we managed with out any hassle to bring food up anyway and there was only 2 english speaking channels and 1 was sky news.I am not sure whether to recommend this hotel or not.It had good and bad sides.The location was great and I guess it was fine while we were there and done the job but I dont think that I would book again.", "Date": "October 23, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Middlesbrough, United Kingdom", "Title": "“Got what we expected”", "Author": "RichardANDJacqui", "ReviewID": "UR8217322", "Content": "Six lads, on a stag weekend in the Dam. Wasnt looking for a five star pad. We wanted a place that was central, and cheap. This fitted the bill. I wouldnt take the Mrs here, but all we wanted was a bed to crash into, get up, showered, then out again. The hotel Damrak fitted the bill fine. If your taking the Mrs, spend 50% more and go in the golden Tulip around the corner. If you want a clean bed and a shower close to everything, as cheap as it gets, this is fine. I would stop here again with the \"lads\".", "Date": "July 22, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Delhi", "Title": "“Hell in Amsterdam !”", "Author": "ashboy", "ReviewID": "UR8089906", "Content": "Except for the convinient location I can not think of even one good point about this hotel. PATHETIC is the word! The Room was size of a rat hole, The bathroom with faulty plumbing. When i checked in the room was smelling like a tobacco factory. the bed; was one of the worst i had used in a hotel ever.. I wonder how do they manage to get three stars?? Is there a forum with the amsterdam hotel deptt or municipailty where one can complaint about them. At the breakfast time ; the hotel staff was more intrested in pimping their \"ENGLISH BREAKFAST\" to passerby than make sure the hotel guests are looked after.. PLEASE do not stay here.. the staff is rude and\"CAN NOT CARE LESS\" attitude is smeared all over. I regret the choice that i made; since i had payed all the money in advance I was like a captive..", "Date": "July 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Could have been awful...but...”", "Author": "Dicky54002", "ReviewID": "UR8035893", "Content": "Friends booked the Damrak for a long weekend with us. After reading the reviews here I was worried to say the least. The hotel is only a few minutes walk from the central station and is very easy to find. The girl at reception was welcoming, informative and friendly. We were given rooms 15 and 16 and they were sadly what I had feared from reading the reviews here. The furniture was old,dark and in a bad state, the carpet was so old and dirty that you wouldnt want to walk on it barefooted. There were electrical wires hanging from an old hair dryer in the bathroom. The rooms both stunk of stale cigarette smoke. We told the receptionist that we were non-smokers and would like to change rooms and she was really obliging. She immediately offered us some other rooms - 45 and 55. We checked these out and it was like a different hotel. The top 2 floors are completely renovated. New floors, carpets, beds and furnishings. The rooms were light and modern. We were so relieved and really enjoyed our stay. Strangely though they didnt seem to have really bothered to do up the bathrooms, but they were fine albeit really tiny. Breakfasts were Bread rolls, ham, cheese and jam. Cereal, Coffee and juice. Not great but ok for a continental breakfast in a budget hotel. Cooked breakfasts were available at the menu prices. We tended to have a quick bite and then brunch somewhere nice a bit later in the morning. Dont miss the 'Pompadour' in the Nine Streets for amazing cakes and coffee ! Do miss the Metz restaurant with its uninspiring and overpriced food and inattentive staff. The reception staff let us store our bags all day in a locked cellar room on the day that we checked out. The Damrak has a great location: Central station just a few mins away. Trains run directly from Schipol airport to central station regularly for just a couple of euros. Hollands No 1 chip shop is a few doors away. Very good! ATM less than 100 yards. Red light district with loads of bars, coffee shops, restaurants and... well... everything and more is just over the bridge opposite the hotel. So, if we hadnt changed rooms it would have been pretty grotty. It would have been a grin and bear it hotel experience. As it was we were well pleased. I would recommend that you stay at the Damrak if you can book a room on the 4th or 5th floor. We paid 380 euros B&B for our double room for 3 nights thurs to sat.", "Date": "July 1, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cardiff", "Title": "“Location best feature”", "Author": "Caerleon1", "ReviewID": "UR7899104", "Content": "We arrived and booked into a triple room. The room was basic however contrary to other reports posted the room was clean. The bathroom was not great, however sufficient, the shower pressure was excellent. We were in room 31, which would not probably be a room I would recommend. As it was relatively warm we needed to leave the window open, however as it was located on the main street, the noise did not stop for 24 hours. Once the drunks went to sleep the trams started. The reception staff were really helpful and friendly. Breakfast is served until 10, however this was a big disappointment, we arrived at 9.30 to find no meat was available, however you could have a coffee and a bread roll. Whilst we noticed the food served in the restaurant looked nice, the breakfast experience put us off eating there. Would I stop again? Probably not however if I was in Amsterdam with a group of male friends, I would consider it, mainly for its location to Central station, the price at 140 Euro would need to be better though.", "Date": "June 18, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Merseyside", "Title": "“Location Location”", "Author": "Scorpio47", "ReviewID": "UR7817845", "Content": "We have just returned from a short stay at hotel Damrak Amsterdam, The location was great, right in the heart of the city. The hotel itself is in need of some serious modernisation. I know it is an old building but the carpet was dirty and was not fitted to the walls,the room needed a lick of paint and the curtains needed hemming. The shower was very powerful or it would have been if it had not had a hole in it, sending most of the water sideways into the bath. The double wardrobe only had one door which was difficult to slide. There was a fitted hairdryer in the bathroom, at least the fitting was there but no dryer only wires hanging down. We will not be returning to the hotel and could not recommend it to anybody. The only thing going for it is the location.", "Date": "June 9, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Great location - but that's it!!”", "Author": "Sarah6969pink", "ReviewID": "UR7389268", "Content": "My boyfriend booked this hotel not having checked trip advisor, so I was a bit weary about stay here. The one thing this hotel has in itâ€™s favour is the location â€“ which is great â€“ near the trams, near the station, near the centre. This I could not fault. However that is where the praise stops. Our room was pretty direâ€¦..really small, was obviously decorated in the 70â€™s and has not been touched since!! The beds had springs sticking out of the mattresses, the sheets were not changed all week and the towels were ripped. The bathroom was actually OK, otherwise I donâ€™t think I could have stayed. And the rooms do have TV (which kept my boyfriend happy). I complained that the room was nothing like the refurbished room my boyfriend had seen a picture of and I was told they were fully booked and could not move us. So we were stuck!!! Would possibly stay again (if only going for 2 nights and if we could get room for aprox. Â£50 â€“ I would NOT pay more than this for it â€“ we paid Â£90 a night - not again!!). I would rate hotel 2 star, not 3.", "Date": "April 18, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Middlesbrough, United Kingdom", "Title": "“good location and good value”", "Author": "mandyliscious", "ReviewID": "UR7252974", "Content": "me n my boyfriend have just came back from amsterdam. It was brilliant and we are planning to go again. Damrak Hotel was a good location and very close to all the main shops.The room was small but ok. The staff were very polite and friendly and the restaurant had a nice atmosphere too.", "Date": "March 30, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Mansfield, Nottinghamshire", "Title": "“Could not fault the hotel - Will use again”", "Author": "deznottsuk", "ReviewID": "UR6932876", "Content": "After reading reviews on Tripadvisor was little weary of going to the DAMRAK HOTEL , I do not know what we were worrying about. The hotel room was clean, better than some ive stayed in in Amsterdam. The receptionist asked us ( 3 men - aging 38/43/50) to inspect the room before paying. We were in room 42 4th floor. The lift was out of order when we were there but was not a problem for us. WILL use this hotel again without a doubt. Those who complained on this site must have gone to a different hotel to us? Highly recommend this hotel. VERY central to train station / Red light/ Dam Sq.", "Date": "March 8, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "kuanta", "Title": "“run away”", "Author": "loloko", "ReviewID": "UR6719738", "Content": "run away fast,breakfast was for pigs,and the rooms colder than outside", "Date": "January 31, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stoke on Trent , England", "Title": "“What a hotel.”", "Author": "stevescfc11", "ReviewID": "UR6567469", "Content": "I have now been to amsterdam 4 times in the past 3 years and everytime we have stayed hear we have booked in this hotel. first of all i think this hotel is excellent and i wouldnt book anywhere else, location is the best and the staff are ultra nice. i have even booked up again for two quad rooms in april. some of the reviews i read i think they are from rival hotels in the same area, i can honestly say this hotel isnt bad at all. its not the hilton but its not a hostel.. what could also happen is people getting mixed up with damrak hotel inn which is a lower class hotel!!! overall i wouldnt go anywhere else..", "Date": "January 9, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "4", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Do not stay here Ever”", "Author": "superkala", "ReviewID": "UR6156278", "Content": "I would definitely not recommend this hotel at all. Its supposed to be a '3 star' hotel! The rooms and bathrooms are not the cleanist. The sheets are not changed, the towels are not changed and best of all..... There was a mouse in my room and I was told that Amsterdam has a mouse problem so tough and all you get is a mouse trap. I asked for another room and there wasn't any, however they did offer me a room in one of their sister hotels, a 1 star hotel with a bunk bed and a shared toilet (now if the Damrak is a 3 star, I dred to think what the 1 star would be like) I wanted to leave this disguisting hotel but they wouldn't refund me any money and as it wasn't a cheap hotel, I couldn't aford to get another hotel at the time. I also asked to speak to the manager but conveniently he had gone home and wouldn't be returning until I was on the plane home! And to top it off I didn't even get an apology!", "Date": "November 20, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Inverness, Scotland", "Title": "“Pleasantly dam(rak) surprised”", "Author": "Lexielegs", "ReviewID": "UR5957190", "Content": "Only arrived home yesterday. Having read previous reviews we were wary about checking in. However, the hotel was very easy to find from Central Station (about 5 mins walk). The receptionist was very friendly and dealth with us politely. She even allowed us to view the rooms before we agreed to stay there. The rooms aren't the biggest, but they were comfortable. The bedding was clean, and the towels changed daily. The hotel is right accross the road from the Grasshopper cafe if you want to sample the coffee shop atmosphere and about 10 mins from the red light district. We found this hotel to be very central and close to all amenities like Central Station and the canal cruises. There are losts of eating places nearby which cater for all tastes - Macdonalds, KFC, Indian, Chinese, Steaks. Please try any of the pastry shops behind the Grasshopper, they are wonderful. I would also recommend the pizza slices and the hotdogs, especially with cheese and mushrooms. The breakfast in the hotel was continental but full english was offered for a price. We didn't try the full breakfast but we were only there for 4 days. Any longer and I would have tried a cooked breakfast. Although the rolls, cold meats and cheese are the norm for continental hotels, a bacon piece would have been nice. All in all I would recommend this hotel to anyone who is looking for a base right in the centre of Amsterdam.", "Date": "October 15, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Dublin", "Title": "“Never ever ever stay here”", "Author": "phat1234", "ReviewID": "UR5789417", "Content": "I arrived on a Monday evening for the second of my stays in Amsterdam and having been before I knew not to expect quality hotels at reasonable rates. In booking this 'Hotel', I thought the location was good and the price ok. On arrival, we were welcomed through their restaurant enterance which isnt a great start. The check-in girl was very nice and accomodating, but once we entered the lift, we knew this wasnt going to be to our liking. We got to the room, opened the door, and took less than 5 seconds to walk back to the lift. The room was very small, had no natural light, seperate single beds (when we requested a double) and smell was appalling. As we hadnt payed, but booked by credit card, I raised this with the check-in girl and after a couple of calls agreed not to charge us. I wouldnt have payed anyway. I would not advise any couples seeking comfort to stay in this hotel, it is suitable for the '[\"\"] teenagers' who couldnt care less about the size or smell of the room.....", "Date": "September 11, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "dublin", "Title": "“Ran Out Crying”", "Author": "lorrie1", "ReviewID": "UR5610287", "Content": "Myself and my partner have been to amsterdam 6 times before and we have stayed in various hotel and in one hostel. When i booked this hotel i did so because of its locality .ie near central station and all the shopping streets , pubs and clubs. etc... On arriving we went to reception and were welcomed by a lovely assistant. We went through the usual check in procedures and then she asked for us to pay up front which we did and got our key to our room. as you ususly do. As soon as we stepped out of the lift i knew straight away i wouldnt stay . When we opened the door to the room i nearly fainted..it was the worse smell i have ever encountered, the walls were filthy and the bathroom was a disgrace, we just stood there dumfounded. We left our bags in the room and went and found another hotel and then retreived bags and went to check out. They insisted on showing us another room which was slightly cleaner but i just wasnt staying. We were only refunded half of our money.....i was just too upset to go further about getting a full refund....after all this one of the girls behind the receiption even admitted that the room wasnt one of their best.....so why give it in the first place.....", "Date": "August 14, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "London, England", "Title": "“great room, great location, great time!”", "Author": "Alexandra_1985", "ReviewID": "UR5419408", "Content": "I travelled to Amsterdam with two female friends to celebrate the end of university in June 2006. After reading the reviews of this hotel we were really worried about booking a short break here. However, we decided to go for it, as it wasn't expensive and looked like a good location. We arrived in Amsterdam and caught the train to Amsterdam centraal station in the evening. We were amazed at how easy the hotel was to find, and when we arrived, we were greeted by the hotel staff who were friendly, and spoke good english. We had booked a room that could accomodate three of us, and when we got to the room we found that there were three beds, the room was clean and cool and did not smell (as some past reviewers have found) and we had been provided with fresh towels and a fan to keep us cool. The hotel is perfectly placed, as it is right in the middle of the city. All roads lead back to Damrak, so it is very hard to get lost. It is close to the red light district, but not so close that you cannot easily avoid it if you wanted, and public transport is very close (with the station at the end of the road, and trams passing the hotel door every few minutes) We were concerned about the hotel being noisy at night, because it was right on a main street, and our room was at the front, however we found that with the window closed, we were not disturbed by outside noise at all. We always felt safe in the hotel, and had no problem with fellow guests, althogh at times, as three young women, we were very aware of the drunk men who wander the streets of amsterdam looking for women at night (girls, ALWAYS stick together in the street, especially at night as it did not always feel very safe.) Breakfast is served between 7am and 10am in the downstairs restaurant (which is full of character and charm) and consists of cornflakes or rolls with jam, and various hams and cheese etc. It is basic but nice, and there is fresh tea, coffee and juice. All in all, we really enjoyed our stay at hotel Damrak. I'm not saying that its perfect, but for a basic two star cheap hotel, you cannot beat it. We had a very enjoyable stay, and if i come back to Amsterdam, I would not hesitate to book ths hotel again.", "Date": "July 3, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Merseyside", "Title": "“Not bad at all”", "Author": "holty74", "ReviewID": "UR5419283", "Content": "My second time in Amsterdam but my first in the Hotel Damrak and I must say it wasn't all that bad. Good points were the cost, the location (as it's name suggests on the Damrak, 2 mins from Dam square and 5 mins from the centre of the Red Light District and it was clean and warm and the resteraunt below the hotel was OK. On the down side, the rooms are small, the staff pretty unsociable and as with most places in Amsterdam, the stairs are incredibly steep. Overall, it depends what you want. This was my annual boys weekend away so we thought it was great however if I go to Amsterdam with my wife and kids, we'll be booking something more upmarket.", "Date": "July 3, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "3", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Surrey", "Title": "“Come on, not that bad, just get st*ned...”", "Author": "al100", "ReviewID": "UR4363161", "Content": "Okay so it's tired, the receptionist isn't the chirpy sort and it's not the cleanest. But if you're a group of lads who are hitting Amsterdam for a bit of the usual entertainment it's ideal - cheap and slap-bang next door to the Red Light District. Staggering distance in fact so you can really cut loose. I stayed in what they called the \"penthouse\" - basically the big room at the top with a double, a single and a couple of big matresses on the floor. Great value if you don't care about creature comforts or the cr*p breakfast yet don't want to live in complete squalor. Go on, give it a go. With your mates, not your girlfriend though.", "Date": "January 19, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“40 euro? What do you expect!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4159326", "Content": "Budget hotel, if you get it for 40 euro you cant expect any better really, staff were friendly and you get to inspect the room before you stay! My room was completely new, only thing they didnt have was a fridge, idea for the budget traveller", "Date": "December 3, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Turkey", "Title": "“this hotel definitely sucks”", "Author": "A TripAdvisor Member", "ReviewID": "UR3908714", "Content": "I spend 3 days in this hotel and this was definitely the worst hotel I stayed in my backpacking experince in western europe. First of all price was high and definitely doens`t worth it. Personal was stupid, they are not helpful at all. Housekeeping wakes you up by knocking the door terribly at 11 am which makes you think there is a fire in the hotel. They don`t clean the room at all, all they do as cleaning is tidying the linens and changing the towels. There is no fridge in the room. There is only one good point about the hotel that it is close to the main attractions of the city...", "Date": "September 16, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Seattle, Washington", "Title": "“Central location, friendly staff.”", "Author": "A TripAdvisor Member", "ReviewID": "UR3747058", "Content": "Walk from the train to this hotel was short and towards the center. Breakfast was great once we found we could request hot water for our tea. Room was large and clean for this family of four, although furnishings were a bit worn and light bulbs must be rationed. Quite a climb to the room , most of it on the lift. Would stay again despite the high price.", "Date": "August 8, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Washington, DC", "Title": "“Stay Away!!!!”", "Author": "Exoleen01", "ReviewID": "UR3496713", "Content": "In all my years of travel, this is by far the worst hotel I've stayed in. The 'non-smoking' room reeked of cigarettes. The linen and bedspread were full of burn holes and - of course - reeked of cigarettes. Complaints to management were met with a shrug and a 'there's nothing I can do'. The walls in the room were chipping apart. Worst of all - About 15 minutes after midnight, we started hearing a very loud hammering and sawing - and we were on the 3rd floor. After 30 minutes, I went back to the lobby to ask for a new room and found - to my suprise - that the noise was coming from the hotel itself! They were replacing their restaurant bar at 1 in the morning! Please avoid this place if you are traveling to Amsterdam. While the location is great, your stay will not be pleasant.", "Date": "May 24, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "", "Title": "“ROOM WAS BROKEN INTO”", "Author": "A TripAdvisor Member", "ReviewID": "UR3483989", "Content": "Our room was broken into, items taken, and it was because the housekeeping staff LEFT the door to our room OPEN while they were cleaning. Someone snuck in, hid in the closet and took several items. The manager knew how it happened, but would NOT EVEN GIVE US DINNER OR A FREE NIGHT!! This was all the fault of their staff. Would never stay there again.", "Date": "May 18, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Bournemouth, England.", "Title": "“Mouldy, mouldy, mouldy!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3323056", "Content": "We arrived about 12.30 am, and had to pay upfront. If it wasn't for the time of night, and the fact I was with my 8 year old daughter, I would have left the moment I saw the room! Anyway, I'd already paid, I can't afford to pay for two hotels! The bathroom was disgusting - mould covered the ceiling and the stench of it was not covered by the thoughtfully supplied air freshener! This smell was complemented by the reek of chip fat emanating from the sheets. Although the rest of the room had been cleaned as much as the cra*** state of things would allow, there was no pillow for my daughter or toilet roll in the bathroom (although to be fair, when I requested them they were supplied). I could not sleep at all the first night because of the row of people coming back from the bars etc all night long - please don't believe the reviews that say it is a family hotel! After an unwelcome ( but ultimately harmless) encounter with a fellow guest who seemed to think that as I was female in Amsterdam I must be up for it, I was very glad of the chain on the door! The location was excellent for sightseeing and everything else. Although it was very close to the Red Light Area we managed to completely avoid it - handy to know if you aren't looking for that side of the city, but handy if you are! Ultimately I loved Amsterdam - absolutely hated the hotel. If I had paid the normal going rate I don't think my sense of outrage would ever recover! Avoid it like the plague! P.S. 5 Euros for half a cup of hot chocolate in a paper cup - despite what it said in the bar list. I must have had mug written on my forehead!", "Date": "April 2, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "widnes england", "Title": "“nice hotel - what do you want for the price”", "Author": "A TripAdvisor Member", "ReviewID": "UR3235078", "Content": "me and 4 girls stayed for a long weekend, i read all the reviews before leaving and i was dreading seeing this place, when we arrived i was quite ready for home, yea it looks terrible from the outside and it smells a tad in the lift and the halls, but god people ive been in worse in blackpool. the lift never broke on us, there were no holes in the walls, etc etc - i didnt actually have the breakfast in the hotel so i cannot comment on that, but looked ok to me, staff always willing to please even at daft o'clock in the morning to let us in when one of us was asleep. the beds are very comfy and the shower was hot, it was clean as well. i was never bitten by any of these bugs everyone keeps writing about - all in all it was a good hotel -", "Date": "February 28, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "", "Title": "“depressing hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR2801821", "Content": "i can honestly say the worst hotel i have ever stayed in. the rooms are small and in desperate need of refurbishment. the tv did not work properly or the shower. there was no plug in the bath and the main taps in the bath did not work. i had to strip wash and use dirty towels. the door knob o the door was hanging off and there were no coat hangers provided. the lift was very small and got stuck a couple of times when i was there. the buffet breakfast was very poor with little choice warm orange juice and mismatched crockery(not clean). the hotel is attended by surly and rude staff lacking courtesy and vision. the whole place smelt bad and of chip fat. i urge anyone not to stay here. simon m pettit (stayed26th september to 29th september 2004)", "Date": "November 2, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Don't be fooled by price and location”", "Author": "A TripAdvisor Member", "ReviewID": "UR2522398", "Content": "I have to grade my room at Damrak Hotel in Amsterdam as the worst experience in my life of frequent traveller. For the advertised \"low price room for one\" ($115) I got a \"shoe box\" with broken everything: air-conditioner, fan, desk lamp and even the bed frame. My window was looking straight into the dark well (6/8 feet) thickly covered by pigeon's guano. By the way, people who were just walking in without reservations, got a much better deal for the room for 2 (just $70, twice cheaper than on the internet!). I was having breakfast right near by the front desk and overheard all conversations. But back to the room, I counted more than 20 dirty spots, scratched and torn paper on the walls, few holes (like somebody was kicking or punching them). My mattress was so old, thin and bumpy ( few springs vere almost piercing me) that the only way to lay down was by using my blanket that I had to fold few times. The furniture was, probably, 30 years old and scratched. Another thing: when the cleaning person comes (usually, at 9-9:30) he opens the door wide open right after he knocks, without waiting for a response. There is no such thing as a tag with the privacy sign that you can hang on the door. As a matter of fact, there was no privacy at all: you could hear every word people say in the hall, behind your closed doors, or in the neighboring rooms. The air in the room was always stuffy and the smell of tobacco was always there, despite all of my attempts to get rid of it using the window and a little fan, which I received as a substitute for the broken a/c unit. An included breakfast was very simple and had never changed during my 5 day stay there: bread, boiled eggs, salami, one kind of cheese, cereal, milk, coffee and orange juice. No more delicatessen surprises. And I always had to ask for water. The only one good thing about this hotel is location: you can not beat it. So, for perfect location and accessibility, I can give this hotel one star. Three stars that can be seen on the wall behind the front desk is just a hoax! So, dear traveller, try to avoid price and location temptation and try to find something else.", "Date": "September 10, 2004"}], "HotelInfo": {"Name": "Hotel Damrak", "HotelURL": "/ShowUserReviews-g188590-d231320-Reviews-Hotel_Damrak-Amsterdam_Noord_Holland.html", "Price": "$92 - $211*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Damrak 49</span>, <span class=\"locality\"><span property=\"v:locality\">Amsterdam</span> <span property=\"v:postal-code\">1012 LL</span></span>, <span class=\"country-name\" property=\"v:country-name\">The Netherlands</span> </span></span></address>", "HotelID": "231320", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/ae/0e/ae0e6b6fb3f172dbcb032cd62542d4c01large.jpg"}}