{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“great stay at a great price.”", "Author": "edwardbrook", "ReviewID": "UR122879267", "Content": "The hotel is situated in the pleasant business area of les corts right next to the metro station and about 1/4 of a mile from barcelonas camp nou stadium,bars and resteraunts aplenty nearby at a reasonable price much better than ramblas rip off prices .The apartment was in need of redecoration but spotlessly clean with well equipped bathroom and kitchen area.The lady on reception spoke perfect english and was extremely helpful giving info on directions around the city and sightseeing advice.For me it was the perfect compromise for a short break in barcelona right next to the football stadium,loads of affordable places to eat and drink nearby saving a fortune compared to eating in the city centre,i cant belive the review that moaned there were 9 stops to the ramblas when it is only a 15 min metro trip to the ramblas from here.To sum up for a short stay in barcelona at the cheap rates on offer you cant go wrong.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Southampton, United Kingdom", "Title": "“A small flat”", "Author": "Sgorla", "ReviewID": "UR121091523", "Content": "This hotel is situated in the University area, near the Diagonal. The metro stop Les Corts is just 5 min walking so the rest of the city and the touristic attractions are easily accessible. The area (Guell street) is quite, so it can be considered a good compromise to sightsee the city avoiding the crowded center. The Aparthotel offers rooms similar to a small flat (40 sq.m or similar) with kitchen, complete of cups, dishes ..., , a small living room with sofa and TV, and a bedroom separated by a big door from the rest of the room. The bathroom is large. The forniture are very similar to the ones from the 70s and their level, in general, is not very sophisticated considering that you are in a 4 stars structure. Kitchen, Bedroom and bathroom are clean, and the personel gentle.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Sydney, Australia", "Title": "“Not Again”", "Author": "Rick B", "ReviewID": "UR120256460", "Content": "Our whole experience in Barcelona was tarnished staying here. If you don't mind to travel 9 stations before hit las ramblas every day, then this might be for you. We stayed over 7 hotels during our trip in Europe, this was the worst of all.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bergen, Norway", "Title": "“4 out of 5 - Very good”", "Author": "UrbanSuper", "ReviewID": "UR119108005", "Content": "Booking: - hotels.com - 2 nights - Standard room (406) - Price Including breakfast Pros: - Big room with a small kitchen - Probably the best breakfast experienced at any hotel - Free WiFi - Restaurants, shopping and metro close by Cons: - Outdated rooms and bathroom - Smelly and no aircondition in hallway - So-so staff - Beyond walking distance to city center", "Date": "October 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Not a 4 start hotel”", "Author": "FranciscoNYC", "ReviewID": "UR118384181", "Content": "This is not a 4 start hotel. At the front desk it said the 4 star has given in the year 1997, it has changed a lot since. The Carpet was not only old, but full of stains - probaby the same originally installed in 1997. Shower curtain was full of mildew - probbaly the same one they had in 1997. Shower changing form cold to extremely cold was a huge problem, specially if you try to avoid the dirty curtain. I would've changed hotels, but given that I chekced late at night, had no internet until i was in the room, did not know the area and that the next day I was travelling back to the US made me suck it up and stay. I DO NOT RECOMMEND THIS HOTEL TO NO ONE, IT IS AT BEST A 2 STAR HOTEL.Do not be fooled by the old 4 start hotel rating, it is outdated and not accurate The hotel was so bad I am signing to trip advisor so no one makes the same mistake I did.", "Date": "September 20, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Jaded room but courteous receptionists”", "Author": "168traveller", "ReviewID": "UR117800677", "Content": "For us, it was true that: 1) sound insulation very bad. Could hear neighbors sneezing (& scratching their bums) 2) shower blasted hot & cold. When hot, u stay out of shower until the warm bits come back - usually in 1o 2sec. Provided u have not been boiled alive 3) carpet old 4) good location near underground station - line 3, les corts. In quiet area too 5) chambermaid cleaned room well 6) useful kitchenette 7) helpful & friendly receptionists & staff 8) nearby shopping centre with supermercat (supermarket) Would I stay there again?", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "1.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Not what I expected for a 4 star hotel”", "Author": "lisa1188", "ReviewID": "UR117586786", "Content": "The hotel is very outdated, and the showerhead and carpets were very old..... The first thing I noticed upon arrival was that the bed had 3 hairs, and adding to insult, one very distinctive curly one on my pillow........... that is just unbelievable. I should have complained, but I was guessing that another room would have probably not been much better and not worth the complaint. We only stayed 2 nights and I was happy to go back to my lovely hotel in Madrid. I was on the seventh floor. I do not understand how this was a 4 star hotel - the fittings and furnishing suggest a much lower rating. The price was not that cheap too. I read on trip advisor ratings and I wonder why there are so many positive reviews.... a major renovation should be done for this to be in the 4 star category. Surely a decent looking shower head would not have cost that much considering how much is charged for the stay?!", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0"}, "AuthorLocation": "London", "Title": "“we liked it”", "Author": "stardomee", "ReviewID": "UR117028360", "Content": "Me and my wife have just spent 7 nights in this hotel and found our stay to be quite pleasant. The hotel itself is in a safe area in between 2 metro stations (Les Corts and Maria Cristina) of about 3-4 minutes walk each direction. Our room was more of a small apartment rather than a traditional hotel room, with nicely proportionate dimensions. There was cutlery and cookery in the kitchen from the very beginning and we had the Wi-Fi codes already provided in the reception. Having internet in the room was great, as we managed to check in our return flight online (to say the least.) The air-condition was quiet and good and we were always able to sleep at night. On a separate note, we found the use of showers and flushing of toilets in other rooms to be on the noisy side, especially in the morning. Overall, our room lacked that oomph but it was always very clean and tidy. So, we both think it was a decent stay.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Kfar Saba", "Title": "“great location, friendly staff,”", "Author": "ice180", "ReviewID": "UR116273163", "Content": "I stayed at this hotel for 3 nights with my teenage son. It was very close to the Barca stadium and no problem to walk to a game. very exciting. The hotel was close to an underground stop and really even in walking distance to the rumblas. Our room was big with nice size bathroom, good kitchenette with all the basics. Hightly recomment for budget travelers.", "Date": "August 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent hotel for a family”", "Author": "ts846", "ReviewID": "UR115813850", "Content": "Stayed with my family for a week. Room was large with a double bed and a sofa bed.Staff were friendly, helpful and spoke English. Location of the hotel is excellent as it is possible to be in the centre by Line 3 in 10 minutes. Buffet breakfast was good. There are quite a few cafeterias and restaurants around for good food.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "uk", "Title": "“Great area neighbourhood, helpful stuff”", "Author": "pinglemonster Posted by an OctopusTravel traveler", "ReviewID": "UR115381542", "Content": "Les Corts is a great area to stay in. The busy shopping street at Avinguda Diagonal is just 5 minutes walk, Most of malls open till 10pm. Hotel is in a good location, 3 minutes walk to Les Corts Metro, on the L3 line to reach easily to central. I checked in earlier but only wanted to leave my luggage at 10am. The stuff went a quick search to get me a room. But unfortunately, there was not a safe in the room. She kindly asked I could change to a different room but have to be after 12 noon. After Left luggage, I went to do some sightseeing. When I came back the different stuff offered me a ungraded room-a suite. I was well happy! Room was nice, tidy. Only problem was the sound prove was not good enough. I can sleep through into anything, but there were many times when other rooms put taps on or flush toilets I wake up. Besides there is a motorbike place next to the hotel. With loud engine in the evening was not comfortable. But average saying, it is good location, good price and everything else. highly recommended!", "Date": "July 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Great place to stay ...........”", "Author": "Shadwala", "ReviewID": "UR110088158", "Content": "We stayed from May 21st May till 26th May 2011 with our kids aged 10 and 5. The location is excellent as the metro Les Corts is 5 minutes away from the hotel and more importanly Camp Nou is about 15 minutes away! Also it was very quiet and absolutely no noise from the streets.The room furnishings were not very new and the carpets were a bit torn in places but the rooms were clean and were cleaned properly everyday. The room was spacious and there were separate areas for us and the kids.The kitchenette was quite handy as we cooked using the microwave mainly a couple of nights. The hotplate was very very slow to heat up and so of no use! The TV had a couple of English channels (BBC news 24 and cartoon network which was either in English or SPanish - kids got a kick out of watching Spongebob speak Spanish!!) and we were not fussed about it as we did not spend a lot of time watching it! The buffet breakfast for 10 euros was fantasic and kept us filled up till after lunch time!! Also children 5 years and under could get breakfast for 5 Euros. We did not sign up for breakfast while booking and we saved 25 euros as the cheap offer for kids was not available online. I definitley recommend this hotel for families with small kids. Also the WIFI is free and we could print out boarding passes for free which was terrific.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Princeton, New Jersey", "Title": "“The reviews were right about this hotel”", "Author": "Pedro S", "ReviewID": "UR106712144", "Content": "The hotel is about two minutes walk from a Metro Station which will take you to the main attractions in minutes. The area is very quiet and very close to a big shopping mall and supermarket and if you got time you can do some cooking in the small kitchen from the spacious room. The refrigerator and a microwave are very useful l but we did not use them because the full breakfast was exceptional with so many varieties that will keep you full most of the day. The whole staff was very friendly and helpful and the free Wi-Fi was another plus. I am very happy that I booked this hotel after I read the reviews and would recommend it to my friends and next visit to Barcelona I will book it again without any doubts.", "Date": "May 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Flitwick, United Kingdom", "Title": "“Great extras but the basics weren't right.”", "Author": "ajssw19", "ReviewID": "UR100750312", "Content": "I recently stayed at the Atenea Aparthotel in Maria Christina, Barcelona for a business trip. The hotel had been recommended by a colleague and my company had a corporate rate agreed with the hotel. Firstly, the breakfast was excellent with a great choice coupled with an efficient service and it exceeded my expectations. The wifi in the hotel which is included in the price of the room was reliable and I successfully used FaceTime on my iPhone with no call breakups. However, the hotel room was not a 4*+ standard and I left feeling that the hotel hadn't got the basics right. My main problem was that the room was incredibly noisy and I could hear other hotel residents moving around until late at night which kept me awake. I could also hear running water at times even with the bathroom door closed which again was loud enough to significantly disturb. I really was not impressed that the bed had a plastic sheet which I would not expect from a hotel marketed as 4* in quality. The bathroom was also in a poor state of repair with a shower that cycled between scolding hot and freezing cold. Again not good for a so called 4 star hotel. On the last morning there was an unpleasant odour in the bathroom which again suggests poor plumbing. To summarise, the Atenea Aparthotel does very well with the value-add extras but falls way short of the required standard on the basics. I would say that this hotel is nearer to 2/3 star and I wouldn't recommend this hotel unless it is convenient to where you need to be. In my opinion there are better hotels 4 star hotels in Barcelona at the same price point.", "Date": "March 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cambridge", "Title": "“Great location”", "Author": "ssw57", "ReviewID": "UR98584681", "Content": "First room we went to was great..modern and clean but a twin not double as we'd booked. We phoned reception and they speedily moved us to a much older double room. It was Ok..a bit in need of updating...certainly not 4+. Never got down for breakfast so can't comment on the food but the location as eveything with this hotel. Close to large department store containing a supermarket and close to small restaurants, cafes and shops as well as tube and bus routes. Overall a good choice", "Date": "March 1, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "San Francisco, California", "Title": "“Do not stay here”", "Author": "MelissaTravels99", "ReviewID": "UR96077486", "Content": "I want to start this note by saying that I hardly ever write reviews and I hardly ever complain about service! That being said, I feel compelled to warn fellow travelers about my stay at Aparthotel Atenea. First, our room did not have heat. It was extremely cold and my boyfriend and I had to sleep in layers. It was freezing! It took the Hotel about 36 hours to fix the heat in our room. Then, although the hotel claimed to have wireless internet, the wireless internet was down during our entire stay. Lastly, the room was dirty and the beds were very uncomfortable. We originally had a 3 night stay but cut our trip down to a 2 night stay. We cancelled our final night more than 24 hours in advance, however, they refused to credit us. They also refused to give us any credit for the broken heater. I was appalled by the lack of service and professionalism. I wouldn’t want my worst enemy to stay at this hotel. Happy Traveling!", "Date": "February 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Roding, Germany", "Title": "“Good Hotel for travellers”", "Author": "ralfbinder", "ReviewID": "UR92770724", "Content": "1. reception: nice and friendly, very caretaking 2. room : clean and but little older I have choosen the Hotel serveral times last year and was satisfied with location and service. There are several shopping places nearby in walking distance. Only disadvantige is parking, which is very expensive, but that's probally everywhere in Barcelona. Also good location for football fans, stadium nearby.", "Date": "January 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“A great hotel - excellent service and facilities”", "Author": "nimrod08", "ReviewID": "UR87877876", "Content": "We stayed at this hotel for 4 nights and had an infant with us. The staff at the hotel were friendly and always willing to listen. Their English was excellent. The room contained a small basic kitchen which came in very handy especially since we had the little one. Although the furniture looked a bit old, I would still definatly reccomend this hotel. The food at breakfast was lovely. Supermarket and Metro station v close to hotel. All in all, a superb place to stay.", "Date": "November 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good value but not quite 4*”", "Author": "Nikeesud", "ReviewID": "UR85582346", "Content": "Great location (less than 5 minutes form the tube which is cheap and very efficient) but nice and quiet with enough places to eat if you don't want to get back into town. Try La Botiga (chain) excellent food and great prices (less than 50 euros for a 3 course meal for 2 inc. a decent bottle of wine) only 5 minutes away. Very friendly hotel staff and overall recommended as long as you do not expect true 4* standards. The bed, kitchen and linens were spotless but the bathroom was a little tired with a door swollen with humidity that would not shut properly + a settee so dirty in the lounge area that you did not even want to put your bag on it. Otherwise great and I would go there again. Good free internet connection.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Brisbane", "Title": "“A lovely hotel in Barcelona”", "Author": "dlturner007", "ReviewID": "UR79156849", "Content": "A nice hotel at a reasonable price. Clean rooms, friendly and helpful staff and a station 2 minutes away, what more can you ask for? The restatuant is reasonably priced and the food and service was excellent. The Wif fi is also free. Be aware that parking is a little expensive if you have a hire car. I can certainly recomend this hotel.", "Date": "September 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Nizhny Novgorod, Russia", "Title": "“Barcelona Barcelona Barcelona”", "Author": "GoesAroundTheWorld", "ReviewID": "UR68847563", "Content": "The room that we had was quite big. It looked as a small apartment. It has small but functional kitchen with all necessary dishes. Near the hotel was a small supermarket with fresh seafood. That could be easily cooked in that kitchen. The furniture wasn't new. But the room has a nice view from window. The breakfast was always tasty and fresh. The staff was always friendly. The hotel is located quite far from the center and the sea. It needs to go there by subway or bus", "Date": "June 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“FANTASTIC VALUE FOR MONEY”", "Author": "Mck4", "ReviewID": "UR60580428", "Content": "My husband, son and I stayed here for two nights over the Easter weekend and found it to be a great place to stay especially as we were going to a game at the Nou Camp which was only a ten minute walk away. Rooms were very clean as was the bathroom. There is a small kitchen which had a fridge and cooker. This was also kept very clean. The furniture maybe a little outdated but that would be the only downside I would find. There is a tv in the room with two or three english speaking channels. Staff were very friendly and you could have a very nice breakfast there for 10 euro per person. There was a good selection of food so there was something there for everyone. To get to Las Ramblas it was only a fifteen minute journey on the Les Corts metro which was close by. As it was Easter the main stores close until after the Easter weekend.", "Date": "April 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "La Murta, Spain", "Title": "“I don't understand why this is a four star hotel”", "Author": "lamurta", "ReviewID": "UR56327616", "Content": "Thundering drains when neighbouring rooms use the toilet. Gushing pipes when they fill their baths. I am woken up to these sounds at half past five in the morning after listening to them until almost midnight again last night. The bathroom fittings are poor quality (the shower won't switch from filling the bath properly, the plug doesn't fit in the sink plughole, the fittings are old and shoddy). WiFi in my room has a really flaky signal, so in the evening the internet is all-but-unusable. (Good thing I've been woken up at the crack of dawn by the noisy plumbing to write this review?) The kitchen is fully fitted, but they clearly want to discourage you from using it so you need to go and get cutlery, implements and crockery from reception - you have 2 glasses in the room, that's it. Somebody needs to remember to vacuum under the bed once in a while. There is just a sheet and the valence cover on the bed, in winter. Ever heard of duvets? Poorly placed lamp above desk will have you hitting your head every time you use the desk. Still, breakfast is only 10 Euros.", "Date": "February 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nottingham", "Title": "“no thrills but not bad for the price”", "Author": "OlgaNottingham", "ReviewID": "UR55086364", "Content": "Basic but very clean. Spacious room and good bed though we got 2 single beds instead of a double. No kettle in the kitchen set, had to boil water in a pan. A bit far from the centre but close to the Metro.", "Date": "February 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Well located and excellent”", "Author": "broadwood24", "ReviewID": "UR47754679", "Content": "I spent 4 days at the Aparthotel Atenea.The rooms are all identical in size (35 sq metres) and include a double or twin beds The downside is that the kitchen is very basic,comprising a hob, a fridge ,a kettle and a sink, but lacking an oven, microwave and toaster .It is provided with plates, cups, glasses and cutlery .It is OK for preparing basic foods like sandwiches and cups of instant coffee.The breakfast buffet is very good at 10 euros pp. The Ateneas location is a 20 minute journey by metro from the main tourist sites such as the Ramblas but is central to the richer north west part of Barcelona. It is less than a 5 minute walk to two metro stations, Les Corts and Maria Cristina, a 2 minute walk to the Diagonal and El Corte Ingles department store. I have already booked to return in 2 months as I was very pleased with the cleanliness and amenities at the Atenea.", "Date": "October 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "london", "Title": "“Fantastic hotel”", "Author": "miximatch", "ReviewID": "UR44522549", "Content": "Me and my partner were really very impressed with this well located hotel. The metro Fontana is just a 20 second walk. There are plenty of places to eat, drink and shop close by and several banks like barclays are around the corner. We chose this hotel for the location and also because we wanted a room with cooking facilities as eating out is very expensive and not always good quality in the tourist trap areas. We basically got off a few stops away at metro Liceu to buy our food at the Boqueria market. The hotel staff are all very professional and friendly. The cleaning ladies always made sure we had a clean and tidy room to welcome us back and the price was reasonable although increased on friday and the weekend. August is cheaper, but only if you enjoy the ferocious heat! Our room had cable TV and Sony DVD sound system (free internet and printing is downstairs opposite reception). The bed was very comfortable as were the plumped up pillows. The only slight down side was the noise of the traffic, but that was overcome by closing the windows and the metal blind and switching on the air con to cool the room down when it was too hot. Overall, we would definitely come back to this lovely hotel. A little tip - if you cannot speak Catalan just speak English, as I offended a passionate Catalonian by speaking Spanish! 9/10 for hotel!", "Date": "September 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Manchester, UK", "Title": "“Perfect Hotel, Great Location, Excellent Friendly Staff”", "Author": "daniellexx88", "ReviewID": "UR43624541", "Content": "We booked our holiday via Expedia, this was where we came across this hotel. We managed to get it for a good deal for staying for 5nights along with getting flights came to around £250each to me that was really good :D Staying in this hotel was excellent. The rooms were spacious, modern, very clean and comfy. Our room had a small kitchen which was to our surprise but was excellent for when we wanted a light bite to eat. The bathroom was spacious white and very clean which is always a good thing... We had a very powerful shower so that was great too: D The bed was comfy however we did request a double but got to singles pushed together however I read on another review so expected it.. It wasn’t a problem though. It’s about a 2 minute walk from Les Corts Metro station which was ideal for us as we were always out and about visiting the sites. It was a nice area and felt safe at night which is always a good thing when coming back from Rambalas after midnight. There were a few cafes near by and a supermarket less than a minute away which was hidden in a department store, so again great if you want a light bite. The area was quite business walking in the direction of the Avad Diagonal, however if you like posh shops there’s a few good ones there. It was also about 15-20min walk from the Neo Camp stadium where Barcelona play so ideal if your going to see a match as its just the right distance to walk without it being in a rough area. There was a free computer within the hotel... it was a bit slow but it was free so i was not complaining... one thing was to note it didn’t seem to allow you on website's which require a login aka Facebook I imagined this as it was a shared computer and they would probably have more problem if people forgot to log off etc.. I would defiantly consider staying in this hotel again when visiting Barcelona. The staff were also really helpful, friendly and approachable which always makes a big difference...", "Date": "September 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Athens", "Title": "“Pros & Cons”", "Author": "VickyZo", "ReviewID": "UR34922772", "Content": "Pros: Very clean, that's important. Quiet. The receptionists and stuff really really polite and helpful in anything we asked. PC with free (though VERY slow) internet accion at the lobby. Very near( 5 minutes walking) to 2 Metro stations and a Mall, if you care for shopping. Cons: It's ok if you don't mind staying a bit away from the center(you need 10-20 minutes by Metro to reach Las Ramblas) The breakfast was not bad(bouffet), but for a four-star hotel, it could be a bit better. We asked for a room with double bed and we got one with two single beds joined together. But I can live with that.", "Date": "July 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "HK", "Title": "“Roomy”", "Author": "antartoo", "ReviewID": "UR31458084", "Content": "The room was large and cozy. 5 mins walk from the metro stations (but we couldn't find a lift to the underground for the Les Corts, we had to carry our luggages up the stairs) 5 mins walk to the department store as well (where there is a supermarket in the basement) The stoves in the kitchen heat up slowly so we didn't bother to cook in there.", "Date": "June 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Porto", "Title": "“good relation price/quality”", "Author": "PortoLiberty", "ReviewID": "UR28729935", "Content": "Good location, next to the Dexeus Institute, Corte Ingles an Metro station (les corts). If you want to go to the famous Ramblas only take the metro and leave at Catalunya station. Decoration need some refreshment, but the room was very clean. You have in the apartments, a little kitchen, that is ok if you don't want to spend money at breakfast (10 euros/day). Near the hotel, we recomend some restaurants to dinner: Mussol, just 100m from the hotel and La Botiga, also a few steps from the hotel. Don't forget to visit the Palau de la musica and if possible see one of the flamengo shows. In resume, good value for the money (good relation price/quality)", "Date": "April 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "S Wales", "Title": "“It was fine - I'd stay again”", "Author": "drc225", "ReviewID": "UR22497628", "Content": "Stayed for 3 nights at a rate of GBP95 per night (incl breakfast) in early Dec. The conference was at the Hilton (about 5 mins walk away) and the conference rate at the Hilton was a lot higher. Its in a good location (if you want to be in that part of town) and a perfectly good hotel - despite the reviews :~) Some points to note: The hotel provides a discount for the car parking facility next to the hotel. But it still cost me 22+ euros for the night (only had a car 1 night). The room was great but too hot and adjusting the temp didn't appear to make much difference. The water pressure was extremely high. Turn on the shower and the head promptly flies up (under the water pressure) and shoots water all over the towels at the end of the bath. 1st night I dried myself with a hand towel. It would be a minor thing to prevent this with a better quality shower head fitting and I can't understand why they don't. There were several wifi networks around. I found one which let me on free - no idea whether it was legit or not. The 2nd night I got back after a hard day at 8:00pm and found the room hadn't been made up. The soaking towels where where I'd left them in a pile under the sink. A call to reception sorted it. Breakfast buffet was adequate. A reasonable selection of cold meats and cheeses. The hot stuff look 'tired'. If it wasn't in the rate I'd have gone out as it costs 10 euros. Smoking: there were ash trays in the room but there was absolutely no trace of smoke and I have a very sensitive nose for smoke. The only time I notice anything was the last morning when there was a vague smell of smoke in the corridor. No iron or coffee making facilities in the room. A perfectly fine stay and I'd be happy to stay there again. It would have had four stars except for the shower and room make up issues.", "Date": "December 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sunderland", "Title": "“ideal for the football stadium”", "Author": "Gill1Scott", "ReviewID": "UR14909385", "Content": "We chose this hotel based on its proximity to the Nou Camp, as we were taking our son to a match for his 18th birthday - with that in mind I would say it was a good choice. It was just a short walk to the stadium and it definately saved the hassle of trying to journey back into the city centre on public transport after the match - the queues for the metro after the match were huge. Although it is not in the city centre, it is only a couple of minutes walk to Les Corts metro - and most of the main attractions and the city centre itself were therefore only a short trip away - we certainly didn't feel out on a limb. The hotel was also about a minute away from a large El Corte Ingles store and the upmarket shops on the Diaganol. There was a good choice of restaurants on the Diaganol - we had lunch in one and it was packed out with Spanish people - always a good sign. The rooms in the hotel were large and spotlessly clean - slightly outdated, and more 3 star than 4 star, but perfectly ok. The bed was also huge and comfortable and there was a sofa and coffee table in the 'living area'. There was a huge breakfast buffet, although this did not seem to be topped up during service, so it ran out of things later on. We found the reception staff to be helpful and friendly. I would recommend this hotel for the more budget conscious traveller or for any footbball goers!", "Date": "April 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London", "Title": "“Not bad at all - if you don't want the beach too often”", "Author": "Shards0007", "ReviewID": "UR14811584", "Content": "A bit late in writing my review, but was compelled to complete it ... This was a weird hotel, set in the finance district within walking distance form the Nou Camp, it provided us with a great base for our holiday - though not too clever if you like beach holidays. After the initial shock of discovering where we were, we found it a superb place to stay; - hotel was clean and usable with all mod cons we required - local shops gave us more insight into Barcelona than staying further in town The only downside were the reception staff - they were about as useful as a \"chocolate teapot\" - but this was fully compensated by the restaurant staff. Finally, I'd recommend that you buy tube passes for the week ...much cheaper than a cab and much more cost effective than a daily pass. Enjoy!", "Date": "April 5, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Ireland", "Title": "“4 *- I don't think so!”", "Author": "Ireland08Ireland", "ReviewID": "UR12194618", "Content": "We decided to book Atenea for a three night stay in December as it had received fairly good reviews, was convenient to the metro and provided breakfast. Unfortunately, we were very disappointed with what we found, yes the hotel is very convenient to the metro, but that was about its only positive feature. The hotel is very dated and the curtains and carpets in the rooms could do with a bit of a scrub. Although the rooms had kitchens, unless you bring your own kitchen utensils with you this is not a major advantage. On the plus side the sheets were clean and we were provided with clean towels every day. The walls in the hotel are extremely thin, as well as becoming familiar with our neighbours' (above, below and beside) nocturnal habits, we could also smell smoke from other rooms. Breakfast was a bizarre affair, granted during our stay breakfast was served in a different location from the norm, but this did not excuse the complete lack of organisation. The room consisted of mainly large tables, seated for about 8 people, so we had to share with other groups. On the first morning we had to wait until bowls were washed to have cereal, on the third morning our cereal was soggy by the time we got spoons. The toaster did not work and the hot food was luke warm. Barcelona is a great city, with plenty to offer everyone but if I was to visit it again I would certainly not stay in hotel Atenea.", "Date": "January 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Halifax, United Kingdom", "Title": "“Great staff, great hotel”", "Author": "boonerz", "ReviewID": "UR10066496", "Content": "First off, this review is written bearing in mind the fact I paid £308 (should have been about £340 on hotelopia.co.uk but I found a discount code) for 5 nights in a double room with my girlfriend at the Atenea. I think people should state how much they pay on here, not to brag, but because what you pay dictates what you expect and therefore how you review. The room was clean and a decent size, but don’t expect an apartment, ours was more like a bed-sit, but this is not a criticism. Small kitchen, adequate bathroom, sofa, very large double bed, TV, everything you need. The other reviewers who criticize the lack of cutlery, crockery and pans etc just needed to ask at reception for whatever they needed as they were more then happy to have plates and cutlery sent up to our room. The food in the restaurant was ok. The gastronomic menu was fairly good value at around 23 euros each, nice tapas and then main and postres. The staff were very friendly with good english and the bar waitress makes great sangria. The location is 15 mins walk from Nou camp, which was good for us as we went to a match. It's also only a couple of minutes walk from Les Corts metro station. We were a little worried about safety on the metro but found it to be very good. ATMs near by too. The Mussols restaurant near by was nice enough, but other than that you probably need to get a taxi to eat out. All in all we really enjoyed our stay at the Atenea. The hotel was fantastic considering the amount I paid and would have been good even if it had cost more. Just a note on pick pockets in Barcelona: I carried a bag across both shoulders and kept it on my hip in front of me, and we had no problem. Stick to the main streets, dont wear a bag on one shoulder, be aware of who is around you (particularly on La Rambla) and you will be fine", "Date": "October 11, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Gilroy, CA", "Title": "“Great place”", "Author": "mickip13", "ReviewID": "UR8076689", "Content": "Stayed one night at hotel prior to boarding cruise ship. Great location near train station from airport and to ship. (Cheap transportation $) Very helpful bilingual staff, clean and away from hustle and bustle of La Rambla but easy to hop on train or HOHO buses . Wonderful place to feel the city and the awesome people. Good resturant near by. Breakfast buffet included in room charge was excellent. Will return for sure. Found through TripAdvisor and booked with Venere.com. Look for discount code.", "Date": "July 8, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Wales, UK", "Title": "“Girly holiday”", "Author": "MissWales82", "ReviewID": "UR7970010", "Content": "Stayed for 4 nights on a city break with a friend. Large room, efficient and friendly reception desk. Staff were a bit miserable at breakfast. Easy access to city centre via metro.", "Date": "June 23, 2007"}], "HotelInfo": {"Name": "Aparthotel Atenea", "HotelURL": "/ShowUserReviews-g187497-d231504-Reviews-Aparthotel_Atenea-Barcelona_Catalonia.html", "Price": "$88 - $219*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Joan Guell 207-211</span>, <span class=\"locality\"><span property=\"v:postal-code\">08028</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "231504", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/85/04/90/twin-superior-room.jpg"}}