{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hereford, England, United Kingdom", "Title": "“Really good hotel”", "Author": "Mike S", "ReviewID": "UR128459073", "Content": "Clean, safe and very helpful staff. Ideal for the Nou Camp.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bombarral", "Title": "“real nice , employes , breakfast and rooms.”", "Author": "Belisa_12", "ReviewID": "UR127718857", "Content": "Nice location close to real good shops, not far from tourist places , bus in freint doo also.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Noisy, but comfortable”", "Author": "Dulcinea_del_Tob0s0", "ReviewID": "UR126334365", "Content": "The hotel sits atop a busy going out area, but the room was modern and nice. I would have liked to have seen a double bed, but the hotel staff did say (and showed me) that double beds were based in much smaller rooms, therefore when they gave us the choice to change, we declined. It was about 10-15 minute walk to Las Ramblas, and not necessarily very well communicated with a close underground/bus stop, therefore do not choose this one if you do not like walking. I thought the area was nice, and I took my partner to a few restaurants that I had researched around the area that seemed really nice. And were really nice. I did not choose the breakfast option, as being from Spain I prefer to find pattiseries and small coffee shops to have breakfast at than a hotel, so I cannot comment on their food.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Good hotel with excellent service”", "Author": "yyosetya", "ReviewID": "UR125761550", "Content": "Our stay was very pleasant as the staffs were very helpful in serving our requests. A good plus for us with WiFi included making our communication with family at home easier.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Phelan, CA", "Title": "“Compact, but all there”", "Author": "BGericke", "ReviewID": "UR120803185", "Content": "We just had one night in Barcelona and the Hotel Zenit was perfect. The rooms (and elevators) are very small, but make excellent use of space. The bar and restaurant were fine and the location offers other dining and drinking choices, as well as ATMs, drug stores, etc. I found the staff to be friendly and helpful. Part of the reason I selected Zenit was that it seemed close to the port and we were getting on a cruise ship the next day. I was a bit taken aback to find the taxi ride was nearly 20 minutes and the price pretty high. If you want a great downtown location with a reasonable price and good amenities this may be the ticket, but it is not close to the port . . . and perhaps no hotels are.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Galway, Ireland", "Title": "“Great place to stay”", "Author": "jessiemacni", "ReviewID": "UR120246442", "Content": "Slightly off the beaten track. Metro close by and within walking distance of placa de catalunya. Had very pleasant stay in hotel. Plenty little bars in area- very reasonably priced for wine and beer. Would definitely go back to this hotel.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“A bit out of the way and with UNRELIABLE Air-Conditioning”", "Author": "Visphot", "ReviewID": "UR119322759", "Content": "This is one hotel that is let down by its location and the misleading way (for those unfamiliar with Barcelona) its proximity to major tourist attractions is decribed on-line. It is quite a walk to take the bus which takes you to La Rambla and the nearest metro is not near by any stretch of imagination. The hotel itself is efficiently managed. The people at the front desk during the daytime are pleasant and informative, though they are often too hard pressed to attend to you promptly. The rooms are clean, well-maintained and comfortable. Where the hotel really falls down is its air-conditioning system. Zenit seems to have some rule for turning off the air-conditioning halfway through the night. But this is not so bad as when the air-conditioning fails. Our last night (24 September) was particularly miserable because the air-conditioning was non-functional from the evening itself. When we complained about this problem in our room (No.405), we were informed the air-conditioning had failed for the entire fourth floor, that the night-staffer at the front desk was not an air-conditioning mechanic, that he did not know how to get hold of one and that, therefore, there was nothing he could do for an entire floorful of distraught residents. The weather was hot and opening the windows let in street and traffic noise. The hotel made no effort to change the room or give a rebate for this extremely uncomfortable experience. We shudder to think what staying in this hotel would mean in the peak of summer.", "Date": "October 15, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Outstanding location, clean, decent place. Friendly staff.”", "Author": "stubby_galavant", "ReviewID": "UR118030953", "Content": "Have stayed twice over an 18 month period, and I have always found it to be pleasant. Nothing really bad to say. Sounds from the other reviews though, that you should be cautious and double check all your booking details!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Loved it all, & would definitely go back again :)”", "Author": "Damdoom81", "ReviewID": "UR116833661", "Content": "This hotel was just as we expected :) .. The lobby was small yes, but the staff are very friendly & cheerful .. The hotel looks new & well maintained .. The room was big enough for us & clean, although I would've preferred a better view .. I'm glad there was an AC, cuz the weather was very hot during our visit! The bathroom was nice & very clean & hot water was available all the time .. Didn't eat there, so can't comment on the food quality & value .. The hotel was a walking distance to many bus stops, which was amazing .. Plus, it's only 5 minutes walking from a 24 hours supermarket, which was also very useful :) .. I loved it, & surely recommend it ..", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Braga, Portugal", "Title": "“Nice, clean and close to everything”", "Author": "HelderBCarvalho", "ReviewID": "UR115859242", "Content": "The hotel is in a quiet street but close to the Av. Diagonal and Pl. Francesc Macia, wich has lots of buses and is 10 min walking from La Pedrera. One good thing, the bus turistic stops at Francesc macia, wich is very good if you want to use it. The hotel is very clean, staff is very simpathic, on our last day they let us leave the bags till 18.00h so that we could keep visiting the city. Room was good, warm and spacius, we had the baby stroller, and still had a little table if we wanted to eat something.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Los Angeles", "Title": "“The help needs help”", "Author": "McCritic", "ReviewID": "UR115379878", "Content": "The saving grace of this place is it's proximity to a huge grocery store. The rooms are fairly typical of a modern place, which is good. We were shorted on towels and getting new ones was surprisingly difficult. The older guy at the front desk was just plain rude a couple times and the food at the restaurant was pretty bad. One of the shuttle drivers for the San Fermin festival was lazy and not timely. Skip this place for other options.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“Efficient and nice hotel.”", "Author": "Marcel_Guadalupe", "ReviewID": "UR110755775", "Content": "At first hard to find hotel(city wise). After that it's efficient and easy to get there. Price is just about right for the room size.", "Date": "May 31, 2011"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“Be carefull for making a reservation of hotel Zenit Barcelona”", "Author": "tukthai", "ReviewID": "UR99542351", "Content": "i would like to warn all guests who want to book room at hotel Zenit Barcelona. I booked two rooms at hotel Barcelona from Feb 13-16,11 through internet. I remember that i cancelled this booking before the deadline unfortunately It found that one room was cancelled and another room wasnot cancelled Once i knew I overseatelephoned to hotel and explained the errors from internet and cancelled one week before 13 Feb,11 Anyway hotel Zenit did not help or listen any explanation and still surcharge for wholed peiod (3nights ) and the cost of cancellation is Euro 1000. We knew that this is policy but i did not have any attention to hold this room i understanded rooms were cancelled i try to explain to hotelZenit but i did not received any helps and understanding from hotel I feel upset and i feel unfair which i paid at EURO 1000 without any using the services or any rooms from hotels I tried to negotate to reduce some cost of cancelletaion but this hotels are still charged for whole amount I would like to warn all guests and i did not want any one to face the problem like me and i emailed to warn to everyone to be carefull whe n you make a reservation with hotel Zenit You will not get any problem like me.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“We had an amazing time! Great location, VERY CLEAN!!”", "Author": "pSyHE", "ReviewID": "UR94573230", "Content": "Fantastic place in a centre of Barcelona,however still very quiet. Perfect location,just of the Plaça Catalunya, where bus to/from airport goes. 2 seps away from La Rambla. Lovely and very helpful staff. 2 little things that could be improved- have an iron and ironing board upon request and offer a larger selection of food for breakfast. We used to shop next door for cheese and ham and bring it down for breakfast. I guess always a soluction. Also, perhaps a little fridge in a room would be a great investment (the staff was very keen to keep all our bottles in their fridge at reception, sometimes though you just would like to have it with you,cool,without the need to face checking in people,who haven't started their holidays yet:). Such a detail though that I will definatley come back. I just couldn't believe how big and clean the room was. Oh,and the balcony!!Best surprise ever:) Great hotel.", "Date": "January 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "New York City, New York", "Title": "“They Overbooked US..and sent us to a dirty 2 star hotel with no reimbursement”", "Author": "modernartobsession", "ReviewID": "UR80058104", "Content": "AVOID This HOTEL.. Unethical Management, which was otally unprofessional. We went to check into Hotel Zenit Barcelona at 11pm on Friday.. for the room we had already paid @ $260..for 4 nights. They said they didn't have a room for us.. and without any remorse.. called a taxi sent us to an old dirty limited service hotel on a noisy block which charges much less (like under $150) for our 4 nights. This all happened WITHOUT refunding our money or the room rate differential. Phone calls to the hotel manager were not returned. They totally wrecked our vacation in Barcelona...as it was a busy weekend and most nice hotels were already booked up. We're still dealing with the credit card company to get our money back.", "Date": "September 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "cumbernauld, scotland", "Title": "“Relaxed and comfortable stay”", "Author": "dave1967", "ReviewID": "UR77385419", "Content": "Got a ggod deal in the hotel. The hotel itself is very quiet, well equipped and comfortable with rooms air conditioned and roomy enough for my purposes (helping my brother celebrate his 40th birthday), Check in/put was fine and staff helpfull. Best thing about the hotel? Peace and quiet and sound proofed rooms. Its the best I have ever slept in a hotel. The location was good and again suited our purposes. I suppose a closer Metro station than Diagonal would have been handy but that would be splitting hairs. The hotel is about a 10 minute walk from Diagonal Metro which was no problem for us. Diagonal is a nice street to walk down - no hassle, nice architecture, parokeets in trees etc. We partly chose the hotel for its proximity to Gracia as we wanted to go to the Festa Major de Gracia (I would thoroughly recommend visiting this August festival). All in all an excellent hotel for the money I paid.", "Date": "August 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Carlisle", "Title": "“Very nice hotel”", "Author": "jenwightman", "ReviewID": "UR64983865", "Content": "The hotel was bright, clean and modern and in a nice area. The breakfast was excellent but the evening meal wasn`t so good. The room was lovely and had everything you would expect from a 4 star hotel.. The best part of the stay was the helpful friendly staff, especially on reception. They couldn`t have been more helpful and made us feel welcome.", "Date": "May 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "USA", "Title": "“So quiet and restful, and in a fantastic neighborhood”", "Author": "UsaMarty", "ReviewID": "UR63955148", "Content": "I just loved my 6 nights at the Hotel Zenit Barcelona. I had been traveling around Spain for about 9 days at that point, and the first thing that struck me was how quiet my room was! I had probably the smallest room in the place, and it had no view (looked onto an airshaft), but the almost complete lack of noise was just what I wanted. The room (small but nice) and bed were extremely comfortable, the bathroom lovely and quite spacious, and the modern decor of the place very soothing. It was also very clean. I absolutely fell in love with the Gracia neighborhood, close enough for a walk to the sights, good public transit connections, and just a lovely, local neighborhood feel to it, with great places to eat, shop, use the internet (internet cafes are cheap!), people watch, and hang out. El Cortes Engles (nearby on the Diagonal) has a terrific grocery store where I can buy my main requirements for travel (sparkling mineral water and apples) cheaply and in great quantity!", "Date": "May 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“great hotel”", "Author": "windowseat", "ReviewID": "UR48879417", "Content": "First time in a hotel in Barcelona,because when on private leisure trips i prefer to rent a flat in Barcelonetta.The company we work for reserved the Zenit Barcelona and i didnt expect much because i didnt know the area.Really nice place.Decent size room on fifth floor with balcony facing the street.So you are not locked into air con hell.The window insulation keeps a lot of the traffic noise out,still we were able to hear the city,which we didnt mind.Marble bathroom,modern and warm interior.Breakfast ok,but if its not included in your rate i would recommend that you find a place around the corner.There are a lot of nice bars and cafes in this neighbourhood and its not very touristy so you will mix with locals.We bought lots of spanish specialities in the food departement of the nearby corte ingles for on room picknick.very pleasent check in,would come back for sure!", "Date": "November 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Wallington, UK", "Title": "“A neat package in a quiet part of town, but close enough to centre”", "Author": "flylight2", "ReviewID": "UR44624047", "Content": "We don't like huge hotels, & didn't need 5 star as we were more keen to see the sights than the hotel, so although this one was apparently virtually fully booked, it was quiet - inside & out. It was clean, helpful pleasant staff, nice rooms (although ours were compact) good breakfast, and handy location close to buses on the main through road, the Ave. Diagonal, they let us leave our luggage there as our flight back home wasn't until very late in the day - which was really nice.", "Date": "September 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Montréal, Québec", "Title": "“Really great hotel!!”", "Author": "missbo", "ReviewID": "UR17735048", "Content": "We were quite surprise by this hotel! It was not too expensive (summer 2007) and it was really pleasant. It is located in a very quiet neighborhood less than 10 minutes away from a subway station. The restaurant was very good and the staff of the restaurant really friendly. Room was clean, modern and big for a European hotel! We really enjoyed our stay and will return at the Zenit next time we go to Barcelona.", "Date": "July 9, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "kiwi in Spain", "Title": "“food poisoning in the hotel”", "Author": "kiwialgeciras", "ReviewID": "UR16435556", "Content": "my wife and I both suffered mild food poisoning during our stay at the Zenit Hotel Barcelona,due we are certain, to constantly re heated food in the hotel restaurant. After our experience and the negative way we were treated after filling in the complaint form (hoja de reclamaciones) we would strongly advise against staying in this hotel.", "Date": "May 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Nice surprise”", "Author": "mala-Janka", "ReviewID": "UR10079970", "Content": "I stayed in this hotel 3 nights in October with a friend of mine. When I booked the hotel I was a little bit concerned about the location as it was quite away from the famous La Ramblas. However, when we finally arrived at the hotel it was a wonderful surprise as the hotel was in a fantastic location amongst several interesting shops and restaurants. Plus it was not far from the part called Gracia where we spent most of the evenings. The hotel was really clean, staff very helpful and friendly and the breakfast really generous in choice. I would definitely recommend this hotel for short or longer stay. It's a little bit pricey, but worth it.", "Date": "October 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "italy", "Title": "“great hotel!!!”", "Author": "marci11", "ReviewID": "UR8382321", "Content": "Great hotel! I stayed in this hotel in august 2007 and everything was fine. The rooms are small but very clean! Fantastic!", "Date": "August 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Oxford", "Title": "“Lovely hotel”", "Author": "marmite77", "ReviewID": "UR7419231", "Content": "I stayed in this hotel for three nights in April 2007. From Muntaner station, it is a five-ten minute walk down a hill - which means that, if you want to travel by Metro, it is a five-ten-fifteen minute walk each morning UP a hill! However, there are buses nearby and not uphill (and a travel pass covers trains, trams and buses) but we found that travelling anywhere by bus, with all the traffic in the city, meant losing an hour of the day. The hotel itself is really lovely. It is set in a residential area, which means that many of the people around do not speak English but they were all very friendly and happy to help with directions. It also means that you feel as though you are getting to see the real Barcelona. The hotel staff themselves do speak very good English and are also very friendly and happy to help. The room was clean and inviting and had extras (all wrapped) such as a sweet each evening, tissues, a toothbrush and a comb. Each room had a balcony - there were eight floors and two lifts available. We did not eat at the hotel during our stay - we are sure it is very nice but there were lots of other places to try within easy walking distance. We had a very enjoyable stay here and would be very happy to return.", "Date": "April 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "West Yorks, UK", "Title": "“Good Place to stay”", "Author": "chillitotes", "ReviewID": "UR6589870", "Content": "My husband I stayed at the Zenit Barcelona for four nights over Xmas 23 - 27 Dec 2006. The hotel itself was nice and modern with a nice bar area and restaurant. We booked through Booking.com and they had a special offer on that meant we had breakfast included. The breakfast buffet was really good, it included cereal, fruit, Spanish meats, tortilla, bacon & eggs and some really nice pastries. The waiting staff where really nice and friendly, spoke excellent English and even attempted to help us with our Spanish which is a work in progress. The room was nicely decorated, very quiet and had excellent climate control. My only criticism would be that it was a little on the small side and I suspect that it was probably a room that was meant as a double for single use. It didn't matter that much though because we were hardly ever there. A previous guest reviewed that it was to far from the centre but we found the public transport that served the area to be really good even on Xmas and Boxing Day. Getting to the hotel from town, you can catch the number 14 bus from Catalunya square, just outside the El Corte Ingles. The bus stop is right outside the hotel. To go into the centre you can walk over two blocks to Calle de Calvet and catch the 14, this bus even goes down Las Ramblas, to Barceloneta and to the Cituadella Park. Alternatively there are two buses that travel town Calle de Muntaner. You can also walk up Santalo and catch the FGC to Catalunya Square. We bought the 5 day metro, train and bus pas which cost €20 each although I think I would be tempted to get the T10 ticket next time which allows you ten journeys and only costs €6.00. If you want a really useful website for Barcelona info, accommodation and an excellent map go to bcn.es", "Date": "January 13, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "ireland", "Title": "“Not bad”", "Author": "dgosul", "ReviewID": "UR5909348", "Content": "Stayed here 2nd Oct.€8 in Taxi from nord station.Dinner wasn't great, breakfast was ok.Used Taxi's to get around as they were pretty cheap.Rooms ok not massive , was clean, looked pretty new.", "Date": "October 4, 2006"}], "HotelInfo": {"Name": "Hotel Zenit Barcelona", "HotelURL": "/ShowUserReviews-g187497-d231531-Reviews-Hotel_Zenit_Barcelona-Barcelona_Catalonia.html", "Price": "$104 - $238*", "Address": "<div class=\"amenFloat\">", "HotelID": "231531", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/1e/ff/46/double-zenit-room.jpg"}}