{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "puerto rico", "Title": "“Worst hotel ever!!!!!!!”", "Author": "xtreeemzbar", "ReviewID": "UR103139923", "Content": "Arrived having booked online after seeing pics of rooms etc. the area around hotel is like a slum. I could live with that. Checking in was like fawlty towers.4 people 2 rooms and 30 mins later we got the key. Walked in what could loosely be called a room and nearly passed out. It was no more than an ex storeroom with beds thrown in. Dirty walls, aircon falling off wall, kitchen. checked it out and shut the door and never looked in again. bathroom was very dated but cleanish. Was there to watch Champs league so no time to find another hotel. Spoke with reception and the guy told me its normal in spain to show pics of best room etc. Then spoke to him in Spanish as i live in Gran Canaria and he admitted it was not normal and sorry etc etc. After game went back to room and slept in clothes, well tried to sleep as the room door was so badly fitted it rattled all night. In the morning the receptionist moved us to another room but only after i asked for a claim form. (always a good tool to get better service) New room 1000% better but still a disgrace. please dont think i am a complainer as this is the 1st time in my life i have ever changed rooms and i have stayed in some dumps. This is meant to be a 3 key hotel. i would find it hard to even rate this as 1 key. The whole hotel is a disgrace and shame on any booking agents that sell this hotel. Do yourselves a favour and dont touch this place with a barge pole.......", "Date": "April 7, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Irvine, CA", "Title": "“Very disappointing”", "Author": "zinlover47", "ReviewID": "UR2756233", "Content": "We stayed here while visiting our daughter who was studying in Madrid via SMU's semester abroad program. We chose this hotel because it (1) was one of the few we could find near her apartment, (2) seemed to have what we needed, (3) was advertised through the American Airlines travel website and had a reasonable rating. Given the price of $283 per night for a two-room \"suite\", we were very disappointed. (1) The location is scary-looking and riddled with graffiti. (2) The check-in person did not speak a word of English. (3) Walls were not real clean in the rooms and had some unrepaired minor damage. (4) TV screen is only about 14\" diag. and gets only one English speaking channel (BBC). (5) There was minimal counter space in the bath and the glass shelf over the sink was unusable because the anchor screws were loose, causing the shelf to slant down at a 10-20 degree angle. (6) The air-conditioner in the adjacent suite produced a horrible vibration that used our bedroom wall like a loud- speaker. I got almost no sleep one night because of the noise. We asked for another room but were told the place was full. (7) The in-room water heater was insuffcient for 3 people to take consecutive showers, even though our suite was designed for four occupants. (8) You get no wash cloths, only towels. We got only one mini-bar of soap per two persons, and the soap is replaced only by request. (9) My other daughter, who stayed longer in Madrid, spent her last few days in another hotel (Tyrp something in Plaza de Santa Ana I think) and had much nicer accomodations for about $120 per night for a single. I'm sure you can do better for the price than we did!", "Date": "October 18, 2004"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great Place but out of the way”", "Author": "tmmsshep", "ReviewID": "UR1636404", "Content": "Went on Expedia to get a hotel for a night before my return trip back to USA. Since we had an early flight, we wanted to stay relatively close to the airport. Expedia had a price of $69 usd a night. The hotel was extremely clean with a kitchenette, refrigerator, sink, stove and microwave oven. Hotel is located in a blue collar type residential neighborhood. It is about three blocks from the metro. The staff are very friendly but do not speak much english.", "Date": "February 6, 2004"}], "HotelInfo": {"Name": "Apartamentos & Suites Internacional", "HotelURL": "/ShowUserReviews-g187514-d231627-Reviews-Apartamentos_Suites_Internacional-Madrid.html", "Price": "$52 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Calle Luis Cabrera 37</span>, <span class=\"locality\"><span property=\"v:postal-code\">28043</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "231627", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/03/d5/03d53bbd3fd6b661d69ef45bd9ceec871large.jpg"}}