{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Nice staff, perfect position.”", "Author": "ChicagoBulls33", "ReviewID": "UR122769015", "Content": "We stayed at Hotel valle for 6 night during Xmas holidays: very great time in Rome. Hotel Staff was very kind and helpfull, rooms was clean and big enought for us, perfect position, few steps from anywhere, great value for our money a really good budget hotel in the city center.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Crete, Greece", "Title": "“2 stars hotel!!!!”", "Author": "kiriapapi", "ReviewID": "UR121495081", "Content": "We booked it for 4 nights . The windows of the room were not possible to be closed. We noticed at the reception , but as they told us, they were fully booked. We stayed there on December!!! can you imagine to go back in a frozen room, as the windows were open al the time,day- night ??? The breakfast , so poor, even we tried to have variety, and we went for breakfast an hour before it has been finished,the croissant, the apple pie,the cake were disappeared. The second morning we complained at the reseption, as the stuff of the \"dinning\" were from Bunglades, not spoken english , or italian, they sent him to buy a croissant from the next shop and he thrown it on our face, very unpolite!!! if you like , such treatment , you can pay for this hotel........ good luck!!", "Date": "December 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Chichester, United Kingdom", "Title": "“Bed bugs”", "Author": "Grant K", "ReviewID": "UR119598586", "Content": "Poor hotel. Nice staff and great location but bed bugs ruined it for us. No atmosphere as no bar or common area.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Stay away”", "Author": "Terry0754", "ReviewID": "UR119148242", "Content": "Location is great and rest is down hill from there. I was booked in the parent company hotel, Antico Palazzo and prepaid. On arrival my room was given to someone else and I was downgraded to this dump of a 3 star. Double room was so small I have been in walk in closets with more room", "Date": "October 10, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“\"THE HOLE\"”", "Author": "Frank E", "ReviewID": "UR118537312", "Content": "We booked this hotel from its website it looked very nice. As soon as we arrvied i knew we had been fooled the foyee of the hotel doubles as the dining area. Our room was tiny and cramped after the second night the air con stopped working and we could not leave the window open because of noise . They kept promising to fix it but to no avail hence the title \"the hole\" where prisoners who break prison rules are sent.", "Date": "September 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Good location but not clean”", "Author": "zteu", "ReviewID": "UR118158292", "Content": "The location is excellent, five minutes on foot to cavour metro station. The neighbourhood is nice and there are shops nearby. The rooms were of an acceptable standard but unfortunately the beds were home to bedbugs which ruined our stay.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Service": "3"}, "AuthorLocation": "usa", "Title": "“A perfect place in rome but”", "Author": "cellofool", "ReviewID": "UR115713924", "Content": "the lobby is incredibly small and narrow. The breakfast area is an extension of the lobby and with more than 3-5 people eating at one time is a train wreck. While we were there the air conditioning was not working and the shower ran so slow that it overflowed onto the bathroom floor. High Ceilings, beautiful colors, windows that open onto the street, close to a metro stop and bus line, helpful staff, adequate breakfast.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Thessaloniki,Greece", "Title": "“Nothing special”", "Author": "ntemis81", "ReviewID": "UR114895737", "Content": "It is a hotel which is lucky due to location! Near to Colosseum! The service is poor and it has a very small room for breakfast! The room is clean but not comfortable for group of 4 persons", "Date": "June 30, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Dromore, Ireland", "Title": "“The worst budget hotel that I've ever been to”", "Author": "denzell393", "ReviewID": "UR110081799", "Content": "I stayed in Hotel Valle for three nights as part of a group tour from Ireland just before Holy Week 2011. Like many budget city hotels, it had a very small reception area which certainly made it difficult to check in eighteen people, with others trying to squeeze their way out onto Via Cavour. I was asked to share a room with three others from the group on the third floor. The room was poky, in fact it had two small double beds for the four of us. It was simply unacceptable. I would liken it to a prison cell, with a tiny porthole for a window with an uninspiring view of a dark courtyard. We had to phone our tour company to complain and in fairness, it was agreed that I would be given a single room on the same level. I was initially content with that. The single room was no bigger than my broom closet at home. It was like solitary confinement, dark with the only window being in the toilet, which was equally tiny. In fact the shower head was directly above the toilet - how bizarre. By far the greatest problem with this hotel is that it seems to be the #1 choice for regional Italian primary schools bringing their kids to Rome for the first time. There were three other groups staying at the same time as ourselves - mainly of children aged 10-14. My room was adjacent to that of some of the planet's noisiest girls - chatting, screaming, fighting, giggling, slamming doors, running into the early hours of the morning, all of which was echoed through the membrane-thin walls. I complained once to a very embarrassed teacher: but her efforts at calming the hyper children down was futile. I resorted to the age old act of firing in my iPod at full volume just to help me sleep! The lift was also unacceptable - it was of an old design - there are no stairs except the 'prohibited' fire exit. The lift was so slow and when the other school groups were about, it took min. 5mins to get into the wretched thing. Breakfast was fine, typical Continental but it wasn't fair that we actually had to arrange with the Italian schoolteachers a breakfast rota, as there weren't more than 10 tables. All told, it was a terrible place and this has been reported to our tour operator. We paid over the odds to stay centrally and even with that in mind, Hotel Valle wasn't worth it. If you can get this place dirt cheap and are staying for one night max. - maybe coming back late and leaving early, you'll probably not mind how bad this place is. But otherwise, shop around a bit more. These people need to get their act together.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Armagh, United Kingdom", "Title": "“APPALLING”", "Author": "lll4", "ReviewID": "UR106821003", "Content": "The rooms were small and dank. Some looked out over a shaft, not fresh air. There was one lift, no stairs, to transport people and with 3 school groups staying there, it meant long waits. The breakfast was adequate but with long queues as there wasnot enough seating. Although single beds had been requested, some members of our school trip were expected to share double beds.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Honolulu, Hawaii", "Title": "“Gross.”", "Author": "trekker808", "ReviewID": "UR84804714", "Content": "When we first got into the room, certain parts of the carpet were wet and other parts were dirty with some sort of white powder. The lighting in the bathroom was horrible and for good reason, the shower was hardly clean. It was so dirty that I used my flip flops in the shower. The beds were uncomfortable. The rooms are quite small. Great location, near to train station, subways and colosseum.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Avoid it if you can!”", "Author": "guyrlac", "ReviewID": "UR84104593", "Content": "In June, I reserved a room for two, for three night for September 2010. I was biking with a group in Tuscany and a night was scheduled at this hotel on the way back through Rome and I thought it would be convenient to stay at the same hotel on the way in as well as on the way out of Rome. A week before my departure, I received an e-mail from the hotel saying they had had water problems and could not accomodate me. A reputable hotel would have said that while they couldn't accomodate me they could make arrangements at a hotel nearby if I so desired. Since they made no such suggestion I did not believe their water problem and figured this was just a way of getting a better rate. I had obtained the reservation at a substantial discount price three months before. On such short notice, it cost me 100 euros more a night to get a room elsewhere in Rome. (In retrospect, I'm glad we had to get a room elsewhere). When we did come back to Rome from the biking trip around noon on Sunday October 10th, 2010, we stayed at Hotel Valle through the group reservation. While we had asked for twin beds for my adult son and I, we were getting a double bed. I had to almost fight with the clerk to finally get twin beds (all they had to do was set-up separate beds with separate bed sheets. When they agreed, they then told us they only had one bed cover? Why they just didn't switch room with another couple desiring a double bed is beyond comprehension since most of our group containing 12 conventional couples hadn't yet checked-in. Up the elevator, the smell was not pleasant and things did not improve in the hallway or in the room (I've seen bigger closets than this room). The small 12 inch TV was old, the colour in the picture was gone, and there was no remote available. When we asked for Internet, we were told it was 10 Euros for three hours, which we found was three consecutive hours whether you used it or not. (Grand theft). Other hotels charged for Internet in our three weeks in Italy but only when you used it! When we asked for something at reception, they were always on the phone, typically personal conversations, and we were given the impression of interfering with their personal lives. The Chinese say that people with long faces should not open shops; they shouldn't work in the service industry either. We had to walk over 30 pieces of luggage in the room where all the luggage had been placed to recuperate our own luggage!The next morning, breakfast was the worst I have ever had in a european hotel in 40 years of travelling. Half the service plates were empty and the cheese they served was plastic wrapped industrial slices!!! The coffee was awful and most of us went next door to finish breakfast; it was that bad. They did not accept our credit cards for Internet and only accepted cash...I wonder why??? The hotel is well located on Cavour street just walking distance from the Coloseum and Palatine Hill but it is also a noisy street which is not the best for sleeping. I will not go back there and I doubt the biking service provider will return to this hotel given the bad feedback from everyone.", "Date": "October 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Gulfport, Mississippi", "Title": "“Solid value hotel. Great location, everything you need, but no frills.”", "Author": "JohnWayne12", "ReviewID": "UR79223535", "Content": "Our stay was very good and exactly what we expected. I would describe Valle Hotel as an adequate hotel with a great location. Room was clean (although the carpet and comforter were old, giving it somewhat of a shabby feel). Breakfast was not spectacular but plenty decent (Hard boiled eggs, slices of processed cheeses and processed meat (maybe bologna?), rolls, cereal, yogurt, coffee). Bed was plenty comfortable, room was quiet, and air conditioner worked well. Staff was very helpful and nice. But don't let them book you anything with Greenline Tours, as their tours are very over priced and mediocre compared to the other ones available. If you need a clean, comfortable, and cheap place walking distance to a lot of sites, this is a good option.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great location but thin walls! Overall had a good stay”", "Author": "Mimiwu", "ReviewID": "UR73045049", "Content": "The Valle hotel is in an excellent location, minutes from Temini station (handy if your flying from Ciampino airport as you can get a private bus to and from the airport to Termini for under €4) also 10 mins walk to the Colosseum. Only problem my room was on the first floor, next to the lifts! The hotel is small and walls super thin so you can hear when people are waiting for the lifts or coughing in their room. The room was standard, bed comfortable and it was a nice touch with the mini bar to store your drinks. One thing, the air condition is controlled and turned off half way through the night which isn't great when it's 30 degrees at night. I had an issue with my key, but overall I would recommend the Valle, it's a good 3*. One thing I wouldn't recommend is travelling to Rome in July unless you can stand walking around in the blazing heat!", "Date": "July 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "rome", "Title": "“All you need from a hotel in rome”", "Author": "ashdon101", "ReviewID": "UR69663463", "Content": "This hotel was in an excellent location as it is only a few minuites walk from termini station and the colloseum. We didnt expect to be so central to most of the main attraction sights. The hotel itself had all the basics. Our room was good and clean with an excellent new bathroom but the decor of the room itself could do with a refresh. The bed was cumfortable and we slept very well. Our room didnt have a good view as it looked out onto a very small coutryard but this contributed to us having very quiet, undisturbed nights oposed to facing onto the street. We had no problem with the service and would suggest it as a good base for a visit to rome.", "Date": "July 4, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Great Location. And this is it.”", "Author": "NJunzo", "ReviewID": "UR67628321", "Content": "Valle Hotel has a superb location at Via Cavour, being a few blocks away from Rome’s Termini Station and within walking distance to some of the city’s most important landmarks such as the Colosseum, the Palatino, the Campidoglio and Fontana di Trevi. However, we would not stay at it again due to a number of flaws and details that were bothering us day after day: 1) The room we stayed at 1st floor was small and dark, and it was possible to hear the subway (line B) running right below us from time. 2) The tiny, suffocating breakfast area was just beside the front desk, with no physical separation between them. During the peak hours in the morning, people trying to check-in/check-out mixing-up with people standing in line waiting for a table really did not motivate us to start our day in such environment. 3) Staff seemed to be in insufficient number. One night I called the front desk to request for a bath towel but there was no one to deliver it to our room because the receptionist was alone during that shift. After being “invited” to unsuccessfully look for clean towels in another 2 empty rooms (just to find them soiled) the receptionist said he could do nothing as he was not supposed to leave the reception. In the end I had to dry myself using my wife’s wet towel ! My advice: stay here only if location is ALL it matters during your stay in Rome.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Good Location”", "Author": "MisterFlight", "ReviewID": "UR64189566", "Content": "We stayed here for 2 nights and chose it partly for its location and price and also for its reviews. We flew in to Fiumicino Airport and caught the train into Rome Termini Station (14 euros) which took about half an hour. We had a suitcase on wheels each so elected to walk to the hotel from the station and along the Via Cavour (the busy road that the hotel is situated on), which took about 10 minutes. The train stops about half away along the very long platform and we made the mistake of exiting the station at this point. The road beside the station is quite busy and the pavement/sidewalk is very uneven here until you reach the Via Cavour. TIP - stay in the station after getting off the train and walk to the end of the platform to the station concourse before leaving the station. If it's your first time in Rome then there are two types of pedestrian crossings across the busy roads - one with lights and one without. If you use a crossing with lights then wait for the green light and avoid jaywalking as there are hundreds of mad motorcyclists waiting to knock you down. If you use a crossing without lights then nobody will stop to let you cross until you start walking across it. Wait for a lull in the traffic and set off but don't stop once you start crossing. You'll find that traffic will stop for you and will even drive past you as you are crossing so don't stop!! On to the hotel. We had room 115 which was at the back of the hotel overlooking a courtyard. I wouldn't have liked a room at the front as the main road is noisy and I'm a light sleeper. Our room was extremely quiet though in the morning the occupants of the next building used to get up early and you could hear them talking in their apartment. Our room was a twin with two small beds that were quite hard. The room was small, the shower was good, the room generally clean. I found it OK for just the couple of nights but would prefer a softer bed if staying longer. There was no safe in our room though our friends next door did have one so we shared that. The guy on the front desk was efficient though not particularly sociable. We left our cases at reception on the morning we left as our flight wasn't until late. No charge for that. Breakfast was a buffet of cornflakes, cheese and meat, hard boiled eggs, rolls, croissantes, cake, yoghurt, tea, coffee, orange. It was fine for us and we stoked up every morning before setting off. The hotel has wi-fi but no computer but the bar next door has an internet facility upstairs which cost about 1.50 euros for about 10 mins or so. There are plenty of restaurants in the vicinity - we ate both nights in a restaurant opposite the hotel and slightly up the hill, sitting outside. However, you get pestered regularly by people trying to sell you flowers, soft toys, umbrellas, etc and are a bit of a pain when you are eating. The colisseum is just 10 mins down the road. We walked to the Vatican instead of taking transport but on reflection it would have been better and quicker to take a city tour bus, which goes along the Via Cavour and you can get on and off at most of the main sights. There is a metro station down the road but we didn't use it. If you go to the Vatican, go up to the top of the dome. You can either walk up the 800 odd steps or take a lift and walk up 300 steps. It's not difficult, only costs about 7 euros and the views are great.", "Date": "May 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brooklyn, New York", "Title": "“good place with caveats”", "Author": "nycdawg81", "ReviewID": "UR62980020", "Content": "I had a decent time at Valle Hotel. I stayed 4 nights during a vacation for about $180 a night. I had room 302. Initially we had room 118, which was SMALL. They had a queen sized bed in there and I could barely walk around it. I had booked for a two double beds prior and asked for it to be honored. They did honor that and switched me to room 302 that was huge compared to 118. It may have been twice as large. Long story short, if you get a small room, do NOT hesitate to ask for another room. It appeared to me that the rooms on the 2nd and 3rd floor were renovated and may be larger. But that is speculation. Having said all of that, 3 things were wrong in my room. The piece that holds the shower handle up was broken along with the blow dryer handle. The bathroom doorknob was a little wonky but not broken. I let the concierge person know so that I wouldn't be charged and I wasn't. Breakfast is decent. Nothing fancy but you get hard boiled eggs, pound cakes, cereal, juice, milk, coffee, tea, bread. Had better and had worse. Front desk were pretty helpful but one person only spoke Italian proficiently. The rest I encounter spoke english as well. Location is pretty decent. 10-15 minute walk to the Colliseum. 5-10 minutes away from Stazione Termini. 20-30 minutes walk to Spanish Steps. 15-25 minutes to Trevi. I basically walked all Rome from this point. It's not city center but walkable for a young guy like me. Restaurants around the hotel are not too great. I used a \"lonely planet\" guidebook for guidance. All in all, I do recommend the place if you can deal with the hotel's shortcomings.", "Date": "May 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Denmark", "Title": "“We will for sure come back here again”", "Author": "GrandpaDenmark", "ReviewID": "UR61234301", "Content": "We, my wife and I stayed at Hotel Valle from 11 march 2010 for a whole week, and it was and from the very first minute and until we left, we only met a friendly, helpfully staff, specially in the reception with advice where to go. The room was not big, but cleaned up every day, and the breakfast was super. The hotel is located near Colosseum and in walkingdistance to even S. Peters and the Vaticane. There is plenty of good restaurants in the neigbourhood. We can recommend Hotel Valle and will love to go back there some day Doris&Birger Denmark", "Date": "April 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "melbourne, australia", "Title": "“small clean hotel good value for money”", "Author": "Diana1205", "ReviewID": "UR60374264", "Content": "The hotel was very clean and tidy, small but had everything you would need. Previous review was right about reception staff one was excellent couldn't do enough and the other gave answers like he wasn't really interested. Location was very close to every thing. For the money you are paying it is an excellent choice.", "Date": "April 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Sydney Australia", "Title": "“Great location”", "Author": "Dermo31", "ReviewID": "UR54461419", "Content": "Whilst the area might not look great it makes up for it by its location so close to Termini Station and, at the other end of the street, the Colisseum, etc. The porter (I think his name was Jean Paul) was fantastic. Recommended restaurants for us and these proved to be great and not too pricey. He could not have been more helpful and other staff were pleasant. Facilities were average - bathroom well kitted out. However I found the room a bit dark and think they could spend a bit more on lighting. Breakfasts were more than satisfactory but the breakfast area was quite small and narrow so when there were lots of people having breakfast at the same time became a bit crowded. But that's not too much to complain of.", "Date": "January 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "paris", "Title": "“do not accept room 112!”", "Author": "andialex", "ReviewID": "UR52524537", "Content": "We booked this hotel for 4 nights. The reviews read on TripAdvisor were mixed but we took a chance anyway given its location. Asked for a triple at least 5 weeks in advance...they tried to change us to residence which I heard was not good at all. Anyway, the people there are nice UNTIL you ask for something and then they get all steely-eyed and not nice at all. Room number 112 was a small cave-like room, dark, smelly, no light. They say it is a quadruple but if you pull out the bed noone can get to the toilets. The breakfast is all artificial (fake juice, fake cheese, fake ham, packaged everything) with hardly any room to breath. we finally changed to Room 118 which was much better - small but at least there was light and you could breath and the bathroom was a touch bigger. We wont go back.", "Date": "January 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Desert Hills, AZ", "Title": "“A great location.”", "Author": "RovinRatties", "ReviewID": "UR52498343", "Content": "Service: Depended on who was at the desk. One was very responsive and helpful, another continued to watch TV (TV was sitting on the check in desk turned to very loud volume) while trying to answer our questions. The first room we were in had no heat, none. We were told how to set the thremostat, but the unit would only run for a few seconds. The next day we transferred to another room. The heat was working in this room. But the room connected to another and at the crack of dawn the people and their children in that room began screeching and talking loudly. The bathroom was clean and well stocked with toiletries. The fire exits confused me. It appeared that the fire doors closed off the part of the floor where our room was from the emergency exits. The window of our room opened into an air shaft. The breakfast room looks nothing like what is pictured on the website. The breakfast is adequate and the coffee is great. The location is very convenient for sightseeing. One night we walked about until 2:00 AM. The neighborhood looks a little seedy and at the start felt unsafe, but in our experience it was very safe.", "Date": "January 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Portsmouth, England", "Title": "“THE PLACE TO STAY”", "Author": "Accipitus", "ReviewID": "UR47544189", "Content": "This hotel is brilliantly situated for a visit to downtown Roma. Turn left out of the hotel and you've got the Metro (100m), turn right and a short walk up the hill takes you to Termini station. Buses and taxis are everywhere. It;s a short walk down the hill to the Forum and Colosseum (grab a cappucchino at the Bar Venzia, on the corner opposite the Metro, best in the area). ATM halway down on the right, takes all the major cards. You can go anywhere from here. As to the hotel, rooms were clean, fresh towels daily, ensuite small, but hey, how much time are you spending in there? Oh, plenty of hot water. No tea/coffee making facilities when we were there but you can get it brought up to your room, go to sleep with a vino. Receptionists' English better than mine and all the staff we met were polite, friendly and helpful. We've re-booked for July 2010 already. Tips: Tabacchis - you will see this sign a lot, not just a tabacconist, get your Metro/bus tickets, stamps, phone cards and a few other things here, but beware, a lot of them are closed on Sundays so get everything you are likely to need on Saturday. Good 'supermarket' , the Elite, on the left walking down the hill, just past the Metro, again, closed on Sunday. All else fails, turn right coming out of the hotel and there is a Korean supermarket a few doors up, more expensive than the Elite. Beer is expensive in the bars here, but you can stock up in a supermarket cheaply (the hotel rooms have a fridge). Crossing the road, it's not the cars that will get you, it's the scooters, you have been warned. I could go on and on but I'll just say the we are the wrong side of 55 (but young and definitely active) and this place was perfect for us. Looking forward to getting back.", "Date": "October 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "SPAIN", "Title": "“quiet place”", "Author": "DSF2009", "ReviewID": "UR38488457", "Content": "I've been in Hotel Valle during a business travel. The name was grateful for me , because sounds like in Spanish language. The situation for my business was fantastic. One of the recepcionists called Raffaelle was very friendly and nice. He helps me in the knowledgement of Rome and recommends me good places to dinner. The room was enough spacious. The breakfast is in the reception and you can see the news on TV, it's a good breakfast for me similar to Spain, where I live. Good service, cleaning of rooms. A good name for the place... Very near from the Termini train Station, about 5 minutes, perfect to trip without take a taxi. Thanks to the recepcionist who take care of the clients with indications and recommendations, very useful.", "Date": "August 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "genlaroche", "Title": "“Friendly Staff and Great Location”", "Author": "genlaroche", "ReviewID": "UR36170727", "Content": "I stayed at hotel Valle for 4 days this summer and I would go back any time. First, the staff was very nice. You are always welcome with a smile when you come in :) It was my first time in Rome and Raffaele, one of the front desk guy, was very helpful pointing me to good restaurants in the neighbourhood and the great places I should go visit. The free breakfast in the morning is simple but was sufficient for me (croissants, yogurt, coffee, juice, cereal, cold cuts...). For a fee you can have internet access in your room (10 euros for nonconsecutive 2hr). The location is also good: 10 minute walk to the Roma Termini and 10 minute walk to the Coliseum. I wasn't sure at first if the neighbourhood was safe enough for a woman at night but after the first night I always felt very comfortable walking by myself back to the hotel. I walked everywhere from the hotel but there is are two metro stations close by.", "Date": "July 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Houston", "Title": "“Great location, free breakfast....”", "Author": "jellndell", "ReviewID": "UR33836884", "Content": "Hotel Valle was always easy to locate after a busy walking day in Rome. It was near a major metro rail and only blocks from the Collosseum. The European breakfast was more than enough for us to start our day and we were even able to pack some snacks away in our day bags. We were always greated by the staff who answered our questions in English amazingly enough. This small hotel is quiet and the street below didn't seem to get bustling until late morning. By European standards the rooms are a sufficient size with clean bathrooms. The rate was decent for the location and breakfast is included!!!", "Date": "July 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "L'Aquila", "Title": "“Beware of Residence Monti”", "Author": "frnz65", "ReviewID": "UR33628589", "Content": "I booked a self-catering apartment at Residence Monti (via dei Serpenti), which is a dependence of Hotel Valle. The apartment was supposed to be the biggest (the n. 301) and was described on the web site as 'luxury apartment' and 'finely refurbished'. Actually, it has a series of drawbacks, and namely: - the bathroom is right under the roof and you can barely stand - the shower works badly - the air conditioned is just too weak to cool the entire room, and surely not the bed zone which is in the upper side - the furniture is old and kind of dusty - the whole apartment gives a feeling of shabby and somewhat dirtish So I decided to leave, as the description was not consistent with the reality. The hotel kindly offered to show me other apartments, but I refused, doubting that the standard could be different. So they insisted I should pay one night as penalty, which I did, not having the time for arguing. On the positive side, the apartment is rather big, and the staff of the hotel is kind.", "Date": "July 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Buckinghamshire", "Title": "“Nothing negative about this hotel”", "Author": "Jonkar", "ReviewID": "UR29153267", "Content": "Like Annie Derry from Northern Ireland I too booked this hotel and panicked when I read other reviews. I nearly changed the booking but am so glad I didn't. The hotel was in an excellent location and the only time we used public transport was when we went to the Vatican on the metro. I travelled with my husband plus our daughter and her partner. We caught the Leoardo Express direct from the airport to the Termini and walked the short distance to the hotel. The rooms were spotless and had everything we needed. The showers were good,clean towels every day and the beds very comfortable. I'd requested quiet rooms so we were at the back of the hotel, I would think it might be a bit noisy at the front as it is on a fairly busy road. Yes, the dining room was compact and one morning when we came down it was full but we just went back to our rooms for 10 minutes and when we returned there were plenty of free tables. There was a good selection of food including cornflakes, yoghurts, cheese & ham etc and all constantly replenished. The staff all spoke English and were extremely helpful. We both had one bath sheet and one of those funny Italian 'waffle' towels but as soon as I asked they changed them straight away. I would definately recommend this hotel and would certainly use it again.", "Date": "May 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Good position, above average conditions”", "Author": "Eric87", "ReviewID": "UR26039753", "Content": "This hotel has a privileged position. If you're travelling to Rome, you're probably going by plane. In this case this is the perfect place to check in. Its position as you can see on the map is on Via Cavour, the street which links Termini to the Colloseum. Via Cavour is a very large and important street in Rome, it's the main acces to the Colloseum. About the hotel's features, everything was alright, the rooms were big, a small problem about the soundproofing which didn't really work, meaning that the window did not close very well, and you could still hear the outside house. Fortunately, we were in \"low season\" so it wasn't that much noise :) In the bathroom you have the hairdryer, we had a room with shower, which worked just fine. In the room you have the minibar, the ironing board, air conditioning, which by the way, worked perfectly, a flat screen tv (not too many channels), two closets, a safe, and some very interesting night stands made of marble. Hotel service was good, room was clean...if I ever return to Rome, i would certainly pick this hotel again for my resting hours!", "Date": "March 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Northern Ireland", "Title": "“Clean, fantastic location”", "Author": "DerryAnnie", "ReviewID": "UR25263930", "Content": "I booked this hotel and then checked trip advisor. I panicked when I read some of the reviews and rang my travel agent to cancel. I'd left it a bit late - I couldn't get my second choice of hotel and the others were far too expensive so we stayed with Hotel Valle and headed off expecting the worse. HOW WRONG WE WERE! For starters we couldn't believe how close it was to the bus and train stations. Secondly upon arrival we were greeted politely in English, our bags taken and the receptionist apologised our room wasn't ready and recommended the restaurant across the road - which was lovely. We came back and were shown to our rooms - both rooms were small but clean and fresh, shampoo, hair dryer, tv, etc. What a relief! The location is superb and we felt safe at all times, clean towels everyday! Rome is fabulous. I will definitely be back and will be staying in Hotel Valle.", "Date": "February 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Northern Ireland", "Title": "“For the money you can't beat it”", "Author": "babsNorthernIreland", "ReviewID": "UR24162772", "Content": "Im just back from a weekend break in Rome with 12 other girls! We stayed in the Valle and for the money its a good wee hotel. Thankfully for the other guests we all on the same floor with no other guests! I was sharing with a friend and when we went to our room it was very small, with a double bed instead of 2 singles as booked. There was no problem changing, we just had to go to another floor, which was not a problem. The room was a good size and spotless. The bathroom was small but the shower was great. The guys on reception were very helpful and friendly, arranging taxis etc. The only negative thing I would say is, the room could have been warmer and the fridge didn,t work. It is a short walk to Termini Station and the Colosseum (10 mins). We were here in January, and got blazing sunshine for the whole weekend, warm enough during the day just to wear a jumper and jeans. because of this we walked everywhere. The Vatican is probably the furthest away attraction and took us about 30 minutes to walk, but you do pass other sights on the way. Piazza Navona is a good place to eat at night, but please, please be wary of men offering to show you a good nightclub. It happened to us and we were charged €180 for one bottle of vodka and 13 mixers!!! That was £180 as when we were there it was like for like money ways! Also the club charged €25 for one vodka and coke! Other than that we didnt find the prices too bad. If I was to return to Rome I would book the Valle again, no problem. one other point, even though there were 13 of us the checkin was extremely quick and stress free, about 10 mins in total!", "Date": "February 3, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New Zealand", "Title": "“Not a good choice in Rome”", "Author": "FastHelen", "ReviewID": "UR21190015", "Content": "This apartment is part of Hotel Valle - just around the corner from their main hotel. I have travelled a lot but have never stayed in such dreadful accommodation when I was paying three star prices. The sheets and towels were clean. Nothing else was. The blankets were filthy and torn. The bedspreads were so dirty that we didn't even want to sit on them. Some of the plates in the cupboard were unwashed. The upstairs shower worked but flooded so badly it ran down the stairs. The downstairs shower didn't work. The toilets didn't flush properly and you know what that means. It appeared to have been furnished out of a second hand shop - all sorts of odd and mismatched pieces. There was hardly any outside light in the rooms. There was graffetti all over the outside walls - need I go on. It was a Sunday so only one person on the desk so they were unable to be very helpful. Needless to say we did not stay our five nights but checked out the next day. Hopefully we will get a refund. We simply could not stay there, it was too awful.", "Date": "October 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "offaly", "Title": "“valle experience”", "Author": "OffalyOdie", "ReviewID": "UR16913532", "Content": "found the location to be brilliant for the colloseum, literally 5 minute walk.. 1 minute walk to metro so you can travel very easy from it.. room was basic, comfortable but a bit small, shower was very small but did the job, room was cleaned every day.. hotel porter on nights was very very helpful... half spanish half Italian - great help.. overall i would recommend it for location and price..", "Date": "June 14, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Kent, England", "Title": "“Good hotel for the money”", "Author": "Mcsquane", "ReviewID": "UR12853037", "Content": "I stayed at the Hotel Valle in September 2007. Let’s get the negative stuff out of the way first. I booked through their website which offered a number of services that were not available: no bar, no room service and no safe in the room. If you’re after the services they advertise you may want to check with the hotel direct – especially if you need the babysitting. And if you have a room that overlooks Via Cavour – be warned, it can be very noisy because of the amount of traffic throughout the day and night. I wanted to do the negative stuff first because the lack of a bar is not really a concern. If you fancy a nightcap close to the hotel just pop into the Café Valeone (my preferred choice, really nice owner) or the Café de Brasil, both stay open till 11 o’clock (the Shamrock Pub, near the Forum, stays open till 2 am if you want to make a night of it). The hotel was clean. My room was a fair size with an excellent bathroom. The staff was really helpful and friendly. The continental breakfast wasn’t bad either. Nice selection of cheese, meats and cereal. For the price – the Hotel Valle can not be beat. The hotel’s location is excellent. Station Termini is a 10-15 min walk away – which is just not great for the trains, but also for the Terravision shuttle service to and from Campino airport. The Roman Forum, Palatine Hill, The Collessium and Museo Capitalone are at the end of Via Cavour – a 10 minute walk away. The Panthelon, Spanish Steps, Arc de Augusta and Trevi Fountain can easily be reached on foot too. I walked to the Vatican from the hotel and that only took 25 leisurely minutes. And to be honest, you’ll miss out on a lot not walking. If you do want to take the metro the Cavour stop is about 200 metres away. There is also a large post office 300 metres from the hotel (though you can buy stamps from most the tobacconist shops too).", "Date": "January 21, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Iasi, Romania", "Title": "“A good hotel”", "Author": "IASI-Romania", "ReviewID": "UR11453977", "Content": "It's a nice hotel, very near from metro station, the pesonell is ok, the room it's not very big, but it's clean, The main problem is the noise, if you have the \"luck\" the have your room's windows with the view in the main street, wou might hear some noise during the night or in the early morning. The breakfeast it's not very much, but it's enough. The main advantage is that the hotel is situated in the central way of the city and if you want to visit Rome, it is a good place to stay.Enjoy it. Vlad&Emilia Romania - IASI.", "Date": "December 10, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Glendale, AZ", "Title": "“Horrible Customer Service”", "Author": "Peloumon", "ReviewID": "UR8281014", "Content": "I had the opportunity to take my 14 year old daughter to Rome for vacation. Upon check at the Hotel Valle they asked for and kept our passports. We stay for 4 nights. Upon checkout I was not given our passports and I forgot to ask for them as I am not accustomed to this practice. My daughter and I proceeded to Florence to continue our vacation, when I noticed we had forgotten our passports. I called the Hotel Valle and they were aware that they had forgotten to give me my passports. I asked if they could overnight them to me and I would pick up the cost. The front desk person gave me the number to DHL shipping and suggested that I initiate service. I contacted DHL, they do not accept anything other than cash or an Italian credit card. I contacted Hotel Valle again and asked if he would pay cash and charge my credit card for the shipping charges. It appeared as though he was trying to avoid any expense of money or time on his part . The front desk person had to ask the director and asked if he could call me back. On his return call, he said the director had approved shipment but that they would have to charge a hefty service fee. In frustration and on Principle, I purchased a train ticket for my daughter and I ,back to Rome (I couldn't leave her) to pick up the Passports. A whole day was ruined and it was costly. You would think that under the circumstances, they would have been more accomodating. What an inconvienence ! Don't stay here if customer service is important to you!! Peter Marquez", "Date": "August 2, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Hotel Valle”", "Author": "BennieB", "ReviewID": "UR8239449", "Content": "We booked an Italian tour package from home, and needed to book a room in Rome for our first night and our last night in Italy. We stayed at Hotel Valle for both nights. The first night, was great, nice spacious room, with 2 beds, also had a lovely marble bathroom. Our window looked out onto Via Cavour which was nice. I thought that the front desk staff could use some lessons in customer service! Breakfast was quite good, but the dining area was very small, hard to accomodate a large number of guests. It was great to be within walking distance of so many historical attractions as well as Termini station! When we returned from the southern coast to spend our last night at Hotel Valle, it was a very different experience! Our room was horribly small and cramped and smelled like rotten cabbage! The bathroom was so small, you could barely move around in it, and the shower/bath was very tiny. Our window looked onto some kind of courtyard of an apartment of some sort behind it where the occupants made lots and lots of noise! Overall, I guess I would stay there again, but would insist on having a room that faced the road instead of the courtyard!", "Date": "July 26, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Good Location - Budget Hotel”", "Author": "PoppyH13", "ReviewID": "UR8204789", "Content": "Just returned from a 5 night stay here in a triple room, shared with 2 of my friends. The \"triple\" room consisted of 2 single beds pushed together and a camp style bed stuck against the trouser press in the corner of the room next to the door to the \"outside balcony\" which was a door with a dodgy handle and no lock that lead to a noisy area outside the room beside the air condidioning units overlooking the dusty dirty back yard of the hotel, it looked like it was the only room to have access outside. Although i do feel the hotel was value for money as we did not pay much at all for being the busy season but it could do with a serious makeover and in my opinion is not 3-star or 3-key standard. Our room was on the 1st floor at the furthest away end of the corridor (room 118) and was not adequate for 3 adults sharing. We also had a problem with the air conditioning in the room during the last couple of days which we reported twice to reception, it cut-off and a spanner and code flashed up on the panel. They did not send anyone to look at it and just said they would over-ride the cut-off and that it would be ok and were not really interested. We were not happy with this at all so had no option but to switch it off which was not ideal in a small hotel room with the outside temperature at 95 degrees!!! We had 1 dusty wardrobe with 5 hangers between us. The whole room smelled of dampness and there was damp visible on a wall in the main room and also in the bathroom and a de-humidifyer was beside the fridge under a table. We did however pay extra on our last day for the use of a single room to shower before our flight home and the condition of the single room we got (305) was far superior than our triple room. Breakfast was very basic but adequate and always a fight for a table, we gave up one morning and went elsewhere. The woman in charge of breakfast was very nice although did not speak a word of English but was by far the friendliest of all the staff !!! If i was to return to Rome i would consider staying here again as it was cheap and in a fantastic location, few minutes walk to the Metro station Cavour on the B-Line and walking distance to the Colosseum which is by far the most popular attraction. It was also walking distance (15/20 mins) to the main train and bus station Termini (when we eventually found our way) I'd give Valle 6/10 overall but would say there is room for improvement.", "Date": "July 20, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Not a bad hotel”", "Author": "JulieIreland", "ReviewID": "UR7710672", "Content": "The location of this hotel is really good. Very close to a metro station, and about 10 minutes walk from the Colosseum. The room was clean, but quite small, and could do with a make-over. The staff were not very friendly (a Buon Giorno was usually out of the question). However, they were efficient. The breakfast is very good. Do get to the breakfast room early - it's pretty small and you may have to queue for a while if you get there late. I would recommend this hotel for the location.", "Date": "May 29, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Perth, Australia", "Title": "“Loved it!”", "Author": "Calytrix", "ReviewID": "UR7303389", "Content": "Excellent location close to everything - if you don't like walking, metro station is 3 minutes away. Very quiet room, clean, well maintained. Fantastic deep and long bath tub. Breakfast is served from 7 am to 10 am - rolls, butter, cheese, jams, cereal for those who preferred it – very adequate and plentiful. Staff at the reception all speak good English. They are friendly, helpful and make you feel welcome. Maps and business cards of the surrounding cafes and restaurants are available from the lobby. Chauffeured service to the airport can be arranged at the reception and costs exactly the same as taxis. A note to those who prefer posh faceless huge 4 star monstrosities – you probably wouldn’t like this place if a bide in the bathroom is more important to you than sincere friendliness of staff. We will stay there every time we travel to Rome.", "Date": "April 10, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Tadley, Hampshire", "Title": "“Nice...BUT.....”", "Author": "Tadleytraveller", "ReviewID": "UR7276301", "Content": "After a night in a nightmare hotel, we went in seach of somewhere better. We stayed here as there was no-where else. The Rome marathon was on the weekend before we arrived and I think there were people staying a few days as most of the hotels in the area we were staying (Cavour road, near the Colloseum) had no vacancies. We were unfortunately left a bit out in the cold & so after being told that the only room available at the Hotel Valle was 'Very small' (I seriously thought - it really can't be that small, can it? - but in their favour they did warn us & let my partner see the room before we commited) Trust me it was little more than a broom cupboard....one single bed (which my partner & I had to share) a view which was simply the middle of the building (4 walls!) and walls paper thin. I am not joking. If you stay here the teeny room for ONE person on Floor three just oposite the lift is really quite terrible. But at 80euro's per night it was reasonoble for a single traveller I guess. On another note the staff we excellent, English speaking, helpful! Our bathroom was lovely too, small and otherwise known as a 'Wet room' I think there wasn't a shower curtain & the water got to the stage where we had to lay towels at the doorway to stop it flooding the bedroom...the loo also got soaked while showering and I think it was made for giants (although judging by the size of the room & the bed I'm not so sure!) my feet were pretty much dangling while sitting on the loo, and I really am not that short! 5ft 3\" ish. The TV did have a couple of English speaking channels both News, CNN or something. There is also a hostel located on the floor above the top floor of this hotel and I think Saturdays are PARTY NIGHTS!! If was booming from above until 3AM! When we tried to complain to the 24hr reception he said there wasn't much he could do as the property didn't belong to them..... :-( not good. But don't get me wrong it seems like we had a terrible time and that I am just a moaner. Believe me, I am a backpacker through and through so am used to some pretty bad things. But our experience of the hotels in Rome really was not great. However I must say if you are willing to spend a small fortune on a fab hotel - DO IT! you probably won't regret it and I am thinking that if a double room was available at the Hotel Valle on a lower floor I would simply be singing it's praises but this wasn't the case, please don't let it put you off, Rome is an amazingly beautiful city and well worth the visit just investigate the accomodation thoroughly before you book.", "Date": "April 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "nelson", "Title": "“relaxed in valle”", "Author": "rolythegoalie", "ReviewID": "UR7179504", "Content": "stayed at hotel valle for 7 nights,only 15 minutes from termini,and in good walking in distance to all sites.5 minutes to metro. staff nice and polite and helpful.room was small but cosy,view was not so good back yard.breakfast was between 0700 and 1000.bit of a rush at certain times,only around 10 tables.best time to go either 0700 or 0930.plenty of food to eat and a good selection.all and all quite a good hotel to stay at.", "Date": "March 17, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Great city break”", "Author": "Boutye", "ReviewID": "UR6594105", "Content": "Just back from a 4 day city break in Romewhere we stayed at the Valle Hotel. A lovely homely hotel, very clean although fairly small room even though we had upgraded to a superior. Buffet style cold breakfast was good compared to other Italian accommodition we've been to and you could eat as much as you like. The hotel was very central to all the attractions - 5mins from the Colesseum and 50m from the Metro. It only took us a leisurely 15mins to walk from the Terravision bus stop on the other side of the Terminus. We took the 110 hop on/off tour bus which proved a great success. It's 13 euro for a day which meant you could see all the attractions lit up at night. We ate at the Chinese Restaurant next door which was friendly and nice and at the Pizza/chicken restaurant opposite the hotel - check your bill if eating here! All in all a very good hotel and would certainly recommend it.", "Date": "January 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Good and bad in Rome.”", "Author": "Popeye&Mozzie", "ReviewID": "UR6162709", "Content": "The location of the hotel was excellent but we had a few problems. We stayed for five nights in October. Unfortunatley the lift broken down for three of those nights so it was up and down the stairs. At one stage the fire escapes were also locked so there was no way to get out. Not good!! We got a discount of 6 Euro for the inconvienience. It should have been much more. Staff were having continual arguements with visitors over the issue in the dead of the night which kept me awake. The rooms were small but adequate and they had that stale water smell most of the time. Breakfast was good but you had to queue up for some time when the dining area was full so allow extra time if you have tours to catch. Overall, Rome was fantastic and the location of the Valle is tops but they need to get thier act together. I would recommend this hotel but with some caution.", "Date": "November 21, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "cambridge", "Title": "“great location, okay room”", "Author": "louisedave", "ReviewID": "UR6110064", "Content": "The location was immense, 5 min from Colosseum and Termini, also a fantatic Chinese resturant next door. The hotel is a few minuites from some really expensive hotels which is good. The rooms were very small but you get what u paid for i guess. Also take my advice dont get a taxi we got done by the taxi driver but even without that a taxi will cost 50 euros when u can get a return bus trip from to the termini for 10 euro! dont miss the wednesday paupal service in st peters to get a good photo shot of the pope!", "Date": "November 12, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Diego", "Title": "“Nice boutique hotel”", "Author": "NewEuropeanTraveler", "ReviewID": "UR5826279", "Content": "We enjoyed our stay at Hotel Valle. The receptionist spoke English which was a tremendous help. The rooms were small, but clean. Location felt safe and we were in walking distance to the metro and train station. Couldn't figure out to work the flat screen TV. Bathroom was big for European standards. Shower stall was the tiniest I've ever seen. Free continental breakfast every morning. We had breakfast there on our last day. Better to have breakfast somewhere else. There was A/C which is very nice to have in September when it was still hot. Lost power in the middle of the night, but they had a circuit breaker in the room.", "Date": "September 22, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "North Vancouver, BC, Canada", "Title": "“Can't beat the location!”", "Author": "lil_amsterdam", "ReviewID": "UR5794204", "Content": "My husband & I stayed 3 nights at Hotel Valle during our honeymoon. We received relatively friendly service from front desk & breakfast staff (Romans are not known for their friendliness). Our room was large by Italian standards, & had a small but acceptable bathroom. (The 4' tub was a little difficult to manage.) The TV offered 5 English channels - all of them news channels. We could watch BBC, CNN, Asian CNN ... we were definitely caught up with world news by the time we left! The furnishings were older, but the room was clean upon arrival & cleaned daily. The proximity to everything is unbeatable - less than 5 minutes' walk to the Colosseum; ~10 minutes' walk to the Stazione Termini; less than a block from the subway. Even the Vatican is in walking distance - bring a good pair of walking shoes!", "Date": "September 12, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Greenville, Pennsylvania", "Title": "“Okay, but musty”", "Author": "nenaghgirl", "ReviewID": "UR4345987", "Content": "the rooms were very small; the window had a view of a wall, and it smelled pretty funky. However, it was adequate enough and it is close to termini. All in all, it was fine but nothing great.", "Date": "January 11, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Belfast", "Title": "“An absolute disgrace”", "Author": "A TripAdvisor Member", "ReviewID": "UR4051042", "Content": "I picked this hotel after seeing it featured on Ulster Television as part of their short breaks abroad. The presenter who stayed here said nothing to indicate the quality of the hotel but cited it as being in a central location. On arrival in my hotel room, I could not believe my eyes. I had paid almost £600 to stay here on a bed and breakfast basis and my room was nothing better than a cell! It was extremely dark, far too hot (with no working air conditioning unit) and the breadspread was filthy. In addition, there was only one window which was so high up so as not to be reached. The ensuite bathroom was also very small and there was not always hot water available. Over the course of my stay it became obvious that the bed linen was not being changed either. Despite its central location, I would NOT recommend this hotel to ANYONE! I have travelled quite widely throughout Europe and USA and this was definitely the worst accommodation I have ever encountered. Would not even consider it for £20 per night.", "Date": "October 25, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Rooms": "3", "Value": "5"}, "AuthorLocation": "england", "Title": "“nothing as good in price range”", "Author": "lowem", "ReviewID": "UR3337630", "Content": "The area seemed rather seedy on arrival because there is graffiti everywhere but much of Rome is covered in graffiti. This hotel is very central . Walk to termini for number 64 ( jam packed) bus for The Vatican. Most other sights walkable from the hotel and get the metro (to Caviour) back after seeing the sights . Watch out for pick pockets on bus or train. We went in early March and there was nothing comparable for the price at that time of year-I searched the internet. Room was at the back (quiet) small but with a very comfortable king size bed , newly refurbished with a lovely (bijou) marble bathroom. public areas very nice . Reception and breakfast room very small but hey you only have breakfast there. No complaints @ 40 euros pppn in the centre of Rome ... unbeatable.", "Date": "April 6, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“Good value, easy walking distance of Termini”", "Author": "BingoTodd", "ReviewID": "UR3166159", "Content": "~This is a small, friendly and clean hotel. It is walking distance from the Termini which is where the airport buses stop. All major sights within walking distance. Disappointed we had only a shower - but it was a really good shower, the bathroom was immaculate and in spite of the freezing temperatures in Rome, our room was lovely and warm as we could adjust the temperature ourselves. Very quiet at night in the room. Some nice reasonable restaurants nearby for evening meal. Staff helpful. Good value for money.", "Date": "February 6, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Wales, UK", "Title": "“Location, location, location”", "Author": "A TripAdvisor Member", "ReviewID": "UR2830512", "Content": "I stayed 5 nights at the Valle in mid September 2004. A smallish single room, but decent bathroom, very comfortable bed which did alot to compensate for some traffic noise outside. (Didn't disturb me THAT much). The worst thing was that the room was next to the lift shaft, and it took me two nights to work out that it was the noise of the cables - not people shifting furniture! Breakfast was adequate - no more, and the public rooms VERY small, but the staff were friendly, helpful and spoke a variety of languages. On the positive side, you are 10 minutes from the Forum, Colosseum, Trevi Fountain, Piazza Venezia etc, etc. Try getting a hotel room near Trafalgar Square for this price!", "Date": "November 17, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Budapest, Hungary", "Title": "“Family stay in 2* Residence in Rome”", "Author": "A TripAdvisor Member", "ReviewID": "UR2787047", "Content": "We stayed 3 nights in the \"residence of the hotel\". To be objective, it is not easy to find an accomodation, which has 2 (preferably: 3) rooms, where you can split, particularly to have 2 bathrooms, centrally located and fair in price (at least for the Rome yardsticks). The residence is probably converted from a garage, with a space above it. They connected the two with a stair. The residence has a separate entrance from the hotel (just around the corner) with a direct entrance from the side-street. It was a fairly good taste when they made the interior (should have happened some 10 years ago), but the time, and the use has worned it pretty much. You have to count with having no TV reception, to have planty of noise (due to poor quality of window and door insulation), and some humidity from the basement can be sensed on the walls. We have higher demand for the cleaniness than what you get there - even if the towels are nice. Have a good stay, but don't forget to bring extra ear-plugs with you. Good luck.", "Date": "October 26, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“self catering apartment”", "Author": "A TripAdvisor Member", "ReviewID": "UR2499156", "Content": "This review is for the one self-catering apartment available...The apartment is located around the corner from the hotel and has a seperate secure entrance. The advantage is that you can come and go as you please and don't need to stop by at the front desk or take a lift. The keys and room were ready for us when we arrived. The apartment appeared to have been recently redone with nice floors and excellent bathrooms by european standards. The apt. is two stories with a large bedroom upstairs and a loft twin bed and smaller bathroom. The room was advertised as a two bedroom, but this is not the case. There are 2 twin beds downstairs. You can book this room on ryanairhotels or octupustravel. The rate was very reasonable for a family of 5. We would of had to book 2 rooms at the hotel for the number of guests ($$$). The area is questionable as others suggested although we had no problems. The upstairs is loud from street traffic if you have to have the windows open. The lack of windows makes the unit very dark and musty. The comforters were the only part I wished they cleaned or changed. The sheets and towels were very clean. Housekeeping did a great job and we found the front office to be very helpful. When we needed an extra fan, the housekeeping brought it over quickly. There are two grocery's very close (which was fun to shop for new food). The restaurants and gelateria nearby were very good. The train station/metro was reasonably close to get to everything quickly (5 minute walk). If you have small children, no port a cribs are available. A plus is that the place is built out of solid concrete, we didn't have to worry about the children crying at night or horseplaying. Would I stay here again?? probably not...but we did need a big place and didn't want to spend over $200 US a night for accomodations. This is the only place I think this is possible. Based on that alone, I think the place is satisfactory.", "Date": "August 28, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "New York, NY", "Title": "“Almost gave me a bad impression of Rome!”", "Author": "GetawayNYCGirl", "ReviewID": "UR1736644", "Content": "This Hotel was just OK. The best thing was that they have a great breakfast. However, the staff is just OK. They were only moderately friendly and seemed very disinterested. Also, rooms were not very clean. Discovered \"bodily fluids\" on our comforter. YUCK!!! Also, located near the Termini, which is an extremely sketchy area. The place is a 3 star. When I return to Rome, I will just invest in a 4 star! Would not return to this hotel again. But I love Rome anyway!", "Date": "March 22, 2004"}], "HotelInfo": {"Name": "Valle Hotel", "HotelURL": "/ShowUserReviews-g187791-d231929-Reviews-Valle_Hotel-Rome_Lazio.html", "Price": "$106 - $243*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Cavour 134</span>, <span class=\"locality\"><span property=\"v:postal-code\">00184</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "231929", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/cd/d3/cdd30177f007bc8cf2f11e0a1c1811f22large.jpg"}}