{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Stourbridge United Kingdom", "Title": "“Charming hotel well placed for the sights”", "Author": "MartinR_9", "ReviewID": "UR127711067", "Content": "I visited this hotel with my wife for a four night city break. I had read earlier reviews and upon arrival was a little concerned when we were assigned room 90. However, the room turned out to be fine. As others have commented the room was a little small but by way of compensation it had doors leading to a tiled garden area the same size as the room. Perfect for sitting and relaxing. The bed was very comfy and in contrast with some European hotels there were additional pillows available. The bathroom was clean and well equipped if a little cramped, omitting the bidet might have been advisable. Towels were changed everyday. The television only seemed capable of being tuned to one channel (RAI2) so offered little in terms of entertainment. There are no tea or coffee making facilities but as seasoned travelers we took our own. There was a mini bar in the room. Overall the room was adequate as you do not go to Rome to sit in the room all day. The location of the hotel is excellent and sights such as the Spanish Steps, Trevi Fountain, Colleseum and the Forum are all within easy walking distance. Take some comfortable shoes though as the streets are cobbled and often uneven. The Metro is also an easy walk and offers excellent value though it is crowded at peak times. There are bars and eateries within a ten minute stroll of the hotel so the lack of such a facility in the hotel is not a major drawback. We found it more enjoyable to get out and mingle though we were lucky to have excellent weather throughout our stay. The breakfast offers a good choice and items are regularly replenished. The room is cramped. We elected to eat on the terrace though in March this can be a little chilly first thing. The staff were helpful and friendly and all had sufficient English to assist us. I agree with other reviewers that the decor is in need of some update but I found the hotel charming and would not be loathe to return although the 4 star rating is probably a little high.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Rated two stars above reality !!”", "Author": "scorpio7935", "ReviewID": "UR126058751", "Content": "The hotel was average at best, in no way was it four star though it did serve it's purpose. The staff were courteous and mannerly but certainly not over friendly. The hotel's decor was tired and shabby and the rooms small but adequate to sleep in. The shower was ok with hot water though the shower was supposed to deliver a variety of modes it could only be best used on one. The towels were changed everyday and the beds made but the furniture was dusty and not cleaned until we cleaned it ourselves. There was no bar facilities in the hotel and the breakfast area was cramped when all the guests arrived at the same time for breakfast. It was quaint in appearance but to achieve it's four star rating it would need a complete overhaul and facilities would need upgraded and the standard of attention to detail would need to be improved massively. As it stands with the four star rated I could not honestly recommend this hotel to anyone. A very average hotel with two star rating at best.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kaunas, Lithuania", "Title": "“My impresion about the hotel Viminale”", "Author": "Giedre751", "ReviewID": "UR126007605", "Content": "I booked my stay in this hotel from 6 of March until 10 of March. The booking of my room worked well. The check -in worked excellent. I was satisfied with the cleaning. The breakfast gave me a good start of the day. The staff was there for me when needed. The check-out worked excellent ! I am very thankful to Fabrizio ( directore) . He was very profesional . He takes care about the guests . All the time he was interested was everything ok ?! I felt myself very good ! I was with my little son and I got all information I needed! Perfect english language! A lot of information about the famous places we could to visit. Very polite person! I will recomend this hotel to my friends , I will choose that hotel for my next comming. Thank you , Fabrizio !!!", "Date": "March 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Not 4 Star”", "Author": "Samboti", "ReviewID": "UR126006991", "Content": "Very disappointing for what is meant to be a four star hotel. Hotel is tired and very shabby. Bedrooms are small and bathroom had mould in the shower. Also you could smell sewers in the bedroom and we were on the fourth floor. Breakfast area very cramped. No bar facilities in hotel and nowhere to relax properly. Would not recommend this hotel as completely overrated for what we paid for.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“Very good location but that's it”", "Author": "Mo-Oxford", "ReviewID": "UR121977939", "Content": "Stayed four nights in this hotel with our 2 yr old boy. Room was very tiny even though we'd advised we needed a double room with a cot. There was no cot for the first night. Service wasn't bad but they didn't seem too hurried to do anything for you if you asked. Walls of the room were very dirty and smelt damp. Definitely not a 4 Star hotel maybe a 3. We travelled through a lot of Italy and all the other hotels were fantastic. Would I stay here again? In all honesty probably not.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Balzan, Malta", "Title": "“Good Hotel located in the centre of Rome”", "Author": "Trevordg", "ReviewID": "UR120560273", "Content": "I booked this hotel because the one I usually stay in, the Sistina was packed. The Hotel is located about 5 minutes walk away from the Sistina and just a few minutes from Termini train station. The front desk staff were always extremely polite and very helpful. The room, albeit not the largest was also comfortable and clean. A definite plus is the free wi-fi in the Hotel and the excellent connection. Also, the downstairs lounge area is very comfortable to work in whilst the terrace on the fourth floor provides for some great views. A downside was the fact that the Hotel was full when I was there and at breakfast time there werent enough tables to accomodate the guests.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“You Probably want to check some other options.”", "Author": "gablans", "ReviewID": "UR120315224", "Content": "Pros: 1. Breakfast 2. Location is not bad Cons: 1. It sits on an alley, very dark at night, next to a trash dump on the left. 2. The front desk personnel think they are the very best hotel in the world. 3. There's no hot water in the shower 4. The A/C didn't work, just made a lot of noise. I stayed in Rome for a couple of days. Guess was OK but no way I'm staying here if I'm back.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Good location; a polite, clean and reasonable experience.”", "Author": "Lfretters", "ReviewID": "UR119582306", "Content": "We stayed for four nights in two rooms with our 6 & 8 year olds. It was absolutely adequate for our needs and the location for us was perfect. We walked to most things from here, found very nice, good value restaurants for evenings out and were close to the metro and buses when we needed them. We found the hotel service polite; rooms clean and functional and breakfast good. Okay with kids but not overtly kid friendly. As my 8 year old summed it up 'not amazing but good'.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bucuresti", "Title": "“Good hotel”", "Author": "CristinaBucuresti", "ReviewID": "UR119464347", "Content": "I spent 4 days in this hotel. Is a hotel well positioned.Personally all the objectives we have visited on foot, including the Vatican. The room is small, but has all the necessary:bathroom, shower, bidet, tv, hot water. Breakfast is varied and very good.Internet in the room is ok. Negative :the smell of the room and bathroom is old,the atmosphere of the dining room (recommend a musical background ),staff not very friendly", "Date": "October 19, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Read This Before Booking”", "Author": "getoutthere_Toronto", "ReviewID": "UR119045170", "Content": "My husband and I stayed 5 nights at this hotel after coming off of a Collette tour. When we first arrived we were told we had a room on the lower level of the hotel with a large private patio garden. While true there was a large private patio, the room was the worst I have ever seen in Europe. The smell of mould hit you as soon as you stepped off the elevator and got alot worse when you entered the room. The room itself was small with only room for one bedside table as the bed was pushed up against the wall. The bath room was nasty and had black mould under the rim of the sink - yuck! They had stuck a battery operated spray air freshener to the wall to try to cover up some of the stick but the batteries had long since died. We aired out the room for 2 hours without sucess and then tried the air conditioner which only made things worse. For the first time in history we went up and requested another room. We were told they were booked and we could not move until the next day. The front desk staff was not surpised, I suspect they get complaints about this room all the time. When booking make sure you are given a room on the first floor or higher. Do not accept a room in the \"basement\". Our room number was 96, if your room number starts with a \"9\" find a new hotel. The next day we were moved to the second floor to a small but mould-free room without a balcony. Had I been given this room off of the start my review would be different...but I wasn't. There is a nice public patio on both the 4th and 5th floor and the breakfast was average. You are able to eat your breakfast on the patio or indoors which was nice. On our last morning there I was unable to get any water pressure in the shower, not even a dribble. Not sure why, didn't have time to ask as we were catching a flight. The location is good about a 10 minute walk to the colosseum and 20 minutes to the spanish steps and trevi fountain. There are in room safes and they offer a private shuttle to the airport for $45 Euro.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Missouri", "Title": "“Long awaited Italian vacation”", "Author": "djsolomb", "ReviewID": "UR118456482", "Content": "The Hotel was nicely located. The staff was not very friendly! The rooms very extremely small and the air conditioned only worked in 1 of the 2 rooms we booked. We ended up leaving the hotel 3 days early to find something more suitable. A disappointment.", "Date": "September 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Dublin", "Title": "“Well placed in Rome”", "Author": "redheadd12", "ReviewID": "UR115698554", "Content": "Myself my husband and son stayed in this hotel. The staff are very friendly and helpful especially Aymon who was always there with advice and information. Nothing was too much trouble for Aymon and I cannot praise him enough. The hotel is very well placed for transport links and is in a quiet and safe district for famillies. The hotel is clean and the sun terraces are lovely, one for breakfast and two others for just relaxing on.The rooms are compact but that is too be expected for the price you pay.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "wooler", "Title": "“charming, perfect location for sightseeing”", "Author": "itchyfeetwooler", "ReviewID": "UR115583962", "Content": "Very reasonably priced hotel in a quiet area of Rome but within easy walking distance of bars and restaurants and all the sights. 10-15 minutes to Coloseum, 10 mins to termini station. Lovely well kept public areas, loads of character. Our room was down some steps from the reception area, not the biggest and a bit ragged around the edges but this added to the charm. Spotlessly clean. Safety deposit box. Bathroom obviously newly done and superb. (Loo, basin with loads room for toiletries, bidet, bath with overhead shower and hand held for hairwashing.) Well stocked fridge, contents very reasonably priced. Not often found to be cheaper here than out of hotel. Maid service daily. Air conditioning which was a god send. Best of all was a wonderful large private terrace with table, chairs and a swing seat. A bonus in a city centre hotel. Ideal for relaxing after a busy day sightseeing. Breakfasts plentiful, self service, lovely fresh pastries, fruit, meats and cheeses, yoghurts etc could be taken either inside or on a lovely terrace. Sadly fitness centre seemed to be out of use, but if you tramping around Rome all day that exercise enough. Staff all very helpful and pleasant. Nothing too much trouble. We could not recommend this hotel enough.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Genk, Belgium", "Title": "“Amazing!”", "Author": "Francogoeshollywood", "ReviewID": "UR115044452", "Content": "Hello, I visit every year Rome, I have done a lot of hotels in Rome but this hotel Viminale was excellent, very charmy, very good position, very calm and safe neighberhood. A lot of bars, restaurants in the neighberhood of the hotel. Near by metro, bus, excellent connection! You can walk to the Colosseum from the hotel or take 1 stop with the metro. People at the desk are very helpfull, they gives you correct information. Room was piccobello but a little bit too small, very good bath room. It was a great trip to Rome, I can recommend this hotel to everybody. We loved it and comes back every year!", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "The World", "Title": "“EXCELLENT HOTEL, CENTRAL LOCATION, THE BEST”", "Author": "WorldHeritage711", "ReviewID": "UR114634216", "Content": "We stayed in this hotel for 2 nights, it was GREAT. The location was central, the rooms were nice and clean, and most importantly for us was the free WI FI internet in the room. The breakfast on the outside terrace was just another lovely experience, it was delicious and tasty. When we will come back to Rome, we will definitly stay in this hotel again.", "Date": "June 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Richland", "Title": "“Great hotel in a great location”", "Author": "RTandRT", "ReviewID": "UR113332945", "Content": "About threee good blocks from Termini, on a very quiet street across from a government ministry. Close to restaurants, attractions, metro, shopping, supermarket nearby. Morning breakfast is excellent. Nice lounging space, but no hotel bar. All staff were very friendly and helpfull. I have no problems recommending this hotel.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“not a 4 star hotel...maybe a 2 star,look elsewhere.”", "Author": "constant-traveller28", "ReviewID": "UR109822047", "Content": "i stayed here for 6 nights a week ago,and couldn't wait to leave . I chose this hotel due to reports i read on here,and am seriously disappointed. The reception staff were rude and have no customer service. I have a lot of complaints about this hotel,but to just mention a few, we had no hot water for 2 days and with that also no apology! Our safe didn't work properly and we were made to seem as if this was our fault! The room was absolutely filthy,and wasn't cleaned properly the whole time we were there,behind the fridge there was dust about 2 inches thick! the bed was soo uncomfortable,i didnt sleep well the entire week,and the list goes on. There are soo many other hotels in this area,you're better off elsewhere. Staying here ruined my rome experience,don't let it ruin yours.", "Date": "May 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great location, nice staff, Great place to stay in Rome”", "Author": "BustersDaddy", "ReviewID": "UR108918208", "Content": "This hotel was recommended to me by a Delta flight attendant and it proved to be an excellent choice. They arranged for a hard to get event before we got there. Very helpful, nice room, good breakfast.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Great option in the heart of Ancient City”", "Author": "teddw2ds", "ReviewID": "UR107971836", "Content": "Hotel Viminale was a great option for us, travelers who expect good service and a touch of class, but don't necessarily need high-end luxury. The rooms are very spacious and clean, the location was excellent, right in the heart of the Ancient City, but not too noisy or busy. The hotel staff was amazingly attentive and helpful.", "Date": "May 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location, value and service”", "Author": "Tomeve", "ReviewID": "UR100521555", "Content": "Staff were very helpful and welcoming - the concierges are fluent in Italian (naturally!) French, English and German and probably other languages too! The self service breakfast bar contained a wide selection of foods. Our double room whilst not enormous had ample space and a super kingsize bed. The bathroom was large. Our room in common with the other hotel common areas was scrupulously clean. Overall impression of a well run hotel. Hotel is well situated for the sites with Colloseum, Trevi Fountain anfd Spanish Steps all within a 15 min gentle walk. And good quality restaurantrs within short walking distance too. Liked best the quietness of the location least liked bot staying for a bit longer!", "Date": "March 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ferndown, United Kingdom", "Title": "“Definitely no longer 4 Star - but still a good deal!”", "Author": "Sean_and_Kathryn", "ReviewID": "UR95393384", "Content": "This hotel may have once been 4 Star, but I'm afraid that time has eroded it down to the 2-3 Star range. Nevertheless it was still value for money. Our arrival was somewhat comical (my fault for not booking the right room) and Fernando - while efficiently surly - was more than pleasant it dealing with our request for a room change (in a hotel that was 95% full!). We originally found Room 406 WAY too small and were moved down to the basement room 95 ... now, here's a little tip - if you're going in the summer and are a smoker, REQUEST this room. It has it's own little secret - a private courtyard (I believe Room 90 is the only other one with the same facility). If, however, you go in winter, avoid the basement like the plague - it is FREEZING and the Aircons only appear to be able to cool the rooms down. We eventually ended up in room 312, which more than adequately addressed our need for comfort, space and a livable temperature! Breakfast is basic continental - if you go towards the end of the 3 hour window you run the risk of facing a Gallic-style shrug when the more popular items have run out. The Coffee was, however, the worst we experienced in Rome! For a coffee-holic like me that was somewhat traumatic! I took to going to the local coffee house at the top of the road (3-4 minute walk) to get my fix! Location-wise the hotel is well placed: 5-10 minutes walk to the Termini (although we chose to walk everywhere for the 3 days we were in Rome), 15 minutes to the Colosseum, 20 to the Trevi Fountain, 35 to the Spanish Steps and a gentle 50 minutes stroll to St Peter's Square in the Vatican. This review is skewed marginally on the positive side, but I find myself unable to say that I would recommend it to a friend - I think my friends' tastes are somewaht more discerning than mine (except maybe in friends!). To be fair, if I returned to Rome, I don't think I would stay at the hotel again. Or be willing to pay as much as £60 a night again ... I can HIGHLY recommend the three local Ristorantes we went to for our three dinners: Trattoria il Tettarello (Via dei Capocci), L'Esquilino (Via Cavour 87) and L'Archetto (Via Cavour 195) - all within 5-6 minutes walk. Warning : when going to the Colosseum, AVOID Ristoro della Salute - some dude in a shiny black penguin suit will coax you to a table, serve you your coffee (at a Fiver a pop!) and then whack you with a £5.00 per person \"cover charge\" - quite simply a RIP-OFF!", "Date": "February 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Best location, nice rooms, fun area”", "Author": "jkjetsetters", "ReviewID": "UR94370848", "Content": "We stayed here for 3 nights at the beginning of a 10 day trip throughout Italy. The location could not have been better. Although hard to find at first, we later realized that it was close to a lot and one of the best areas to stay in near the Colosseum. We literally walked everywehre from here, did not take bus or taxi once (we are in our 20's and love exercise!). When we first checked in, we were early, but our room was ready and in fact the concierge let us look at two different rooms to choose which one we wanted first! We chose one on the bottom floor that had its own balcony with table, very cute. The rooms were good sized and private, we never heard much noise and were able to leave the windows open at night due to two layers of windows and curtains. The breakfast was nice, small room and everyone seems to be very quiet. We met up with my friend and her fiance and their family and they loved the hotel as well. There was one small issue, but we dealt with it. I am not sure if it was from my suitcase or not, but there were a tiny bit of ants in and around the nightstand, but that did not phase us. The rest seemed to be very clean. The concierge was helpful in advice on how to get around and where to eat.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pacific Palisades, CA, USA", "Title": "“Well priced, well located and caring”", "Author": "sestopiano", "ReviewID": "UR85413298", "Content": "This hotel was recommended by a travel associate. Stayed there two nights, on each end of our stay. Only a ten minute walk to Termini, the train station. A few good restaurants within 5 minutes were recommended by the English-speaking staff. Room 318 is a great double room with a small balcony, but even the \"basement\" room was adequate size(the second night of our stay). The price was adjusted to reflect the lesser quality room on the second night. Breakfast was quite good and I would definitely recommend this hotel and plan to use it again myself.", "Date": "October 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Exeter, United Kingdom", "Title": "“Ticked all the right boxes”", "Author": "Lymebayers", "ReviewID": "UR81216810", "Content": "The hotel was in a good location, we walked to all the major attractions. We found the hotel reception staff both helpful and friendly. The size of the room was adequate, quiet and clean, however the air conditioning was not working, but we had no need of it on our visit of 1 week as it was quiet enough to have the windows wide open and of a pleasant temperature. Breakfast was adequate with a good continental variety. We would stay here again.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Tromsø - Rovaniemi", "Title": "“Things lost from room while out!”", "Author": "Goofey74", "ReviewID": "UR73325249", "Content": "During our stay, things dissapeared from our room. The housekeepers put things away here and there - and things disappeared from the room. When adressing this issue to the front desk - the reaction was like \"too bad for you\". You cant lock all things in the safe, so some things have to stay in the room. This isnt the hotel to do this. The front desk answered that the housekkepers havent touched anything. Of course they would answer so, else they'll loose thems job. I sent an email to the hotel office after returning home about this issue - they didnt even bother to answer me. Stay somewhere else!", "Date": "August 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Michigan", "Title": "“Perfect Location!”", "Author": "acorn1028", "ReviewID": "UR73115448", "Content": "Despite having an extremely difficult time finding the place, once we reached the Hotel Viminale we were delighted. The hotel had charm, an excellent breakfast, and was located within walking distance of many landmarks and restaurants. While the staff was not overwhelming friendly, they always answered questions, supplied information, and greeted us formally whenever we came or left the building. Our rooms were adequate, looking out over an old church and flowering gardens. We used the common area on the rooftop to enjoy wine in the evenings as well as coffee in the mornings. The only downside was that our friend's room had a poorly working air conditioner. We were able to walk to the Forum, Coliseum, and other notable landmarks such as the Trevi Fountain. There were several inexpensive restaurants nearby, offering variety of choices for meals. Shopping was also available- even an open air market a half a block down the street. All this for one of the cheapest rates we saw for a hotel in Rome!", "Date": "July 31, 2010"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Not our greatest experience...”", "Author": "Cfresh255100", "ReviewID": "UR73073869", "Content": "Not our greatest experience, hotel was in a good location close to all of the major sites. We found the front desk employees to be generally unhelpful and felt at times like we were intruding. The system of leaving your keys at the desk when you leave needs a bit of a rethink - at another hotel they had a similar idea however they gave you a card that you provided to the front desk to get your keys back on your return. In one instance we handed our keys over to the front desk and as we were still in the lobby the employee went to give another traveller our keys to our room. This was concerning as the safe in the room did not also work. Also Internet was quite expensive (5 euro for 30 minutes) Positives were the breakfast was the best we had whilst overseas.", "Date": "July 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Devon", "Title": "“Culture trip to Rome with friends”", "Author": "MovingArchitect", "ReviewID": "UR66532365", "Content": "The hotel is located in a reasonably quiet street (for Rome which is generally very noisy) with easy access to a range of reasonably priced restaurants and places of interest (very near Santa Maria Maggiore and Termini. The rooms were of a reasonable size, beds firm, nice bathroom and each had a small fridge bar. No restaurant but breakfast had a reasonable range of meats, cheeses etc, small choice of cereal - corn flakes and muesli, fruit, bread and pain ou raison etc. Tea and coffe was from a machine but to get the best ask the 'maid' who will make it in a tea pot or your coffee separately. Breakfast room small but if the weather is nice it was good to eat on the adjoining terrace. A 4th floor terrace was nice to drink wine late afternoon (you bring it in) after walking the sights. You could do a lot worse from what we saw. Restaurants - ask the receptionist who was helpful for the first night. Generally we found plenty for betwen £110 - £120 for 4 people inc. wine and water and all very friendly. The location is a reasonable one taking about 10 - 15 mins to the Colosceum and other places of interest. Went to Terminii and caught the underground when we went to the Vatican museum. There was a long queue there - 1.5hrs - but we booked on line before we left UK and went straight in. We walked every where, did not use transport and went up a different street each time seeing more than most (take a copy of a street map and mark where you have been with a high lighter). We went by Easyjet and got a taxi into the city (and back). The city council control the fares at 30 euros, just confirm it with the driver before you get in, and that proved the best way in.", "Date": "June 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "nashville, tn", "Title": "“Great hotel in convenient location”", "Author": "nashvilletraveler1", "ReviewID": "UR66032752", "Content": "We stayed at the Hotel Viminale for 3 nights in May 2010. Great hotel! The staff was very nice and our room was very clean. It was a small room, but normal sized compared to the other European rooms we stayed in. The location isn't right next to any of the sights, but is reasonably convenient to everything (approximately a 15 minute walk to almost any of the big sights in town). This was a very good value for the money---we had initially booked on orbitz for around $180/night, but the rate dropped and we were able to rebook for $122/night. (Even $180 was a great deal considering how expensive hotels are in Rome, so we were amazed at the great rate we wound up receiving!) The hotel staff was very friendly and breakfast was good. Also, there is a good restaurant just a 2 minute walk away from the hotel that was recommended by the staff--Restaurant Tema. Very good! The only negative things I could say are that it isn't just next door to any major site (though it's reasonably close) and that the bed was definitely a little too firm. Great hotel! I'd recommend!", "Date": "June 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Maastricht, The Netherlands", "Title": "“Great location, pleasant hotel but a bit old fashioned”", "Author": "Deirdre_NL", "ReviewID": "UR61024248", "Content": "The hotel is located within walking distance of all major sights (we did not use any public transport during our three day stay, partly also thanks to the lovely weather). It is a small and pleasant place. Staff is friendly and the (cold) breakfast is fine (there is a self-service coffeemachine, but cappuchino was made on request; the breakfast room is very small, but in the summer I think there will be more place when they open the terrace) . Our room was big enough and the high ceiling and the small balcony made it a nice place to be. However, there are some draw backs that would make me look for another hotel next time: there is no internet connection in the rooms, there are no English tv-channels and the bedding is with a sheet and blanket. But otherwise it is a very nice place. Great plus of the hotel are the two roof terraces.", "Date": "April 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“Really nice hotel”", "Author": "Elfita", "ReviewID": "UR58208155", "Content": "A good quiet hotel located in the centre of Rome, very close to the main Termini station. The rooms are small but I think it's a standard in almost all Rome hotels. Breakfast is included in the price and it was really very delicious and rich in choice.", "Date": "March 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Nicosia, Cyprus", "Title": "“Good choice”", "Author": "Traveller-Cyprus", "ReviewID": "UR52063158", "Content": "Excellent location, very close to Santa Maria Magiore and close to Colosseum. Within walking distance from Termini main bus, metro and train station. Good room facilities, good breakfast (cold buffet) with satisfactory choice. Staff polite and ready to help. Hotel in a quiet area, next to ministry of Interiors (police everywhere near the hotel something that increases safety). No restaurant, bar etc. Overall, a very good choice for spending some days in Rome.", "Date": "December 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Novi Marof, Croatia", "Title": "“Great location, close to attractions”", "Author": "Traveler_S_79", "ReviewID": "UR49406309", "Content": "I stayed in this hotel for three nights. Great location minute away from Santa Maria Maggiore church, 5 min. from Termini station, and 10 from Trevi fountain, Colosseum... Hotel is clean and in quiet area, good for families. Our room had a large terace. Great breakfast. Would come back...", "Date": "November 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Doha", "Title": "“Again? Why not!”", "Author": "wifeandhusband", "ReviewID": "UR46056901", "Content": "We stayed in Hotel Viminale for 5 nights in the second half of September. Before we had a big investigation through web, Viminale was our final choice, just because we were tired of reading reviews, calculating costs...etc. By chance, Viminale was what we had expected from a hotel. The best of all is its location. It is just so near to many important places such as; Termini? May be 7 minutes.Colosseum? May be 15 minutes... Bus station? Just on the main street ahead. Safe and good location, no problem at night. Well lit street, a good Napolese restaurant at the corner of the street. Lets continue with the cleanliness, Although we had no problem about hygene I wish the hotel were much more well kept. Clean towels, room cleaning everyday... What should I ask for more? Rooms are a bit small but it is okay, feasible space. I liked the bathroom very much. Value is just okay, we made a profit on our budget because it was cheaper than we had expected to spend on Rome hotels from our budget. Breakfast: Cereals, youghurt, ham, cheese, milk, orange juice, jams, chocolate cream, tomatoes, eggs, fruits, cake, croissants, bread, butter, tea, coffee and hot chocolate... What else may I need? There is a coffee machine which serves hot water, hot milk, capuccino, hot chocolate all together. The reception is helpful. Wireless for a small charge. As I see from hotel comments, generally I come up with the critics about the elevator size and carrying the luggage. Yes the elevator is small and yes you carry your luggage, but if you are in Rome just to discover the city, these little details may not disturb you. We were all relaxed about it so we did not have to give tip to bellboy for carrying our luggage on the elevator to one floor up. The hotel is best for budget travellers who wants a clean and nice place to stay... Not a romantic getaway !!! It also has a small fitness centre. Shortly, the hotel is good, comfortable(2 extra pillows in the wardrobe with a blanket), clean... The breakfast is very fine... If I go to Rome again and the price is still below the others, I will definetely choose Viminale without hesitation.", "Date": "October 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Nottingham", "Title": "“Ideal base in Rome, Clean, air conditioned, good location”", "Author": "lg_1982", "ReviewID": "UR39936709", "Content": "Was a little bit dubious when we looked on Google earth at the location of the hotel, but was pleasently surprised on arrival, we walked from the Termini Station where the airport shuttle dropped us off and found it very easily, and was only about 10 minutes walk. There was plenty of space for the 2 of us in the room, and the bathroom was all new. We had a balcony on our room, which didnt have a great view but it gave us somewhere to sit with a glass of vino in th evenings. Breakfast was also much better than expected after reading reviews, lots of fresh croissants, bread, cheese, ham & cereals etc. We booked a hop on hop off bus through the hotel but this was through Green Line at 30euros for 2 days but you can get this cheaper if you go up to the Santa Maria Magorie Tourist Information (5mins). Hotel staff friendly but on the one occasion we asked about a restaurant we had passed overlooking the collesseum, they couldnt give us the name or any details and didnt try to find it for us. There was no bar or restaurant in the hotel other than the mini bar in the rooms and breakfast. (no tea & coffee making facilities in room either) All sites were walkable from the hotel but we used the bus, to get us around as it was so hot! I would recommend the Viminale to anyone looking for a decent place to sleep, and a base at a fair price in Rome.", "Date": "September 6, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "toronto", "Title": "“staff tried to please ,however hotel needs serious upgrading”", "Author": "tiuleuropa", "ReviewID": "UR28289418", "Content": "stayed for one night in April 2009 ,the staff was helpful,however the rooms (even given the age of the hotel) need upgrading . breakfast was good ,overall does not deserve a 4 star rating", "Date": "April 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Good choice”", "Author": "Bagrov", "ReviewID": "UR26649969", "Content": "Excellent hotel with nice atmosphere. They seem to do renovations and it created a funny effect: in our room (5th floor) the bathroom was new and excellent, which made the room look a bit shabby (it was nice and clean but not new). Otherwise good - the staff was friendly and nice.", "Date": "March 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kuala Lumpur", "Title": "“Enchanting Rome !”", "Author": "CherryPie88", "ReviewID": "UR24360410", "Content": "We called an afternoon of the week before our arrival to this charming hotel in order to ask some info. From this point on the staff were very helpful with directions, and also by arranging the pick up at the airport, setting up travel arrangements for two tours, and booking a table at a nearby restaurant which was excellent (in the area there are many good ones at better prices if you compare with those next to the main tourist sights ). The location is excellent, it is in a quiet street, but so close to everything. Next to Interior Ministry (the Home Office), so we felt safe, and at about 15 mins to the Colosseum and at comfortable walking distance to the Trevi fountain . It seems they are upgrading the hotel as we saw renovation works going on. Anyway our room was clean and the bathroom had a fairly powerful shower. We had a mini bar, a free safe and air-con was OK. The breakfast served by a nice and funny old man, was more than enough to keep you going until lunch. It was a buffet with juices, milk, bread rolls, cereals, boiled eggs, fruits, cold meats, slices of water melon, cake, etc… . There is also has a small garden area for breakfast. We enjoyed the roof. The hotel has 2 roof terraces with lovely views over the city. I personally love the sunset moment. The reception staff were mostly friendly. They allowed us to leave luggage in the hotel throughout the day on our last day so we could pick it up later without dragging it around the city all day before our flight back. The hotel also has a gym but we already walked so much ! My own rating for this hotel is four stars. We would certainly recommend it. Overall we found Viminale was a pleasant place to stay for a decent price in an expensive city. Definitely would love to return to this enchanting city to explore more MAGIC it has to offer!", "Date": "February 8, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Nicosia", "Title": "“Very disappointed!”", "Author": "LoveToTravel1210", "ReviewID": "UR20445903", "Content": "My general comments about this hotel are that it is an old hotel that needs to be refurbished urgently. The bathrooms are moldy and the carpets look disgusting. They also need to do something about their housekeeping. Our experience of the Viminale consisted of the following: We arrived late in the afternoon from Florence, and after some time waiting, during which we did not know what exactly the problem was, they informed us that they had lost our reservation. After waiting for almost 2 hours for them to figure out what to do, they gave us a room in the basement for the night, with the promise to change us in a different room for the rest of our stay. The room we had to stay in had not been cleaned in ages and it smelled of urine. The next day they moved us to a different room which was big, but as I mentioned above very run down. The breakfast was good and the location not bad, but the staff was indifferent. Not a good experience!", "Date": "September 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hamburg, Germany", "Title": "“would come again”", "Author": "eimsbuettel", "ReviewID": "UR19939178", "Content": "The viminale was recommend to me by girlfriend and she was right. Within walking distance of the Colosseum, Termini and metro the hotel is as well inexpensivce as something special. The staff are very kind and helpful: I forgot my bathing suit there and they sent it to Germany! Our triple bedroom was nice and clean and the bathroom recently installed and very clean. Air condition was excellent at 34°C outside. The roof terrace offers a nice view of the city. The breakfast is ok but could be optimized. We all would come back!", "Date": "September 9, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Tring", "Title": "“The Viminale is querky but great”", "Author": "rrbenn", "ReviewID": "UR19736968", "Content": "If you don't mind querky and a bit outdated, this hotel is fab. It's inexpensive and within walking distance of the Colosseum. The staff are absolutely fantasic and were so kind to us. Yes the rooms are interesting and indeed of updating but they are clean. The roof terrace doesn't have much interest in terms of a bar but there is a nice view of the city. The continental breakfast was lovely. Overall, I loved this hotel and it was definitely a cut above the plastic hotels we get over here.", "Date": "September 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stirling, Scotland", "Title": "“Brilliant Location”", "Author": "Johkat", "ReviewID": "UR19223010", "Content": "Brilliant location about 5 mins from the Termini Station and literally on the doorstep of St Marie Maggiore. and the colleseum. We were in Rome for four days and nights and everything was within walking distance of the hotel. The hotel itself was pretty basic and needed more modernisation but was clean and pleasant enough for all the time we spent in the room. It has a fridge and air conditioning and the roof terrace is a real bonus after a long days walking its on the 4th floor so maybe best to ask for a room on that floor. The breakfast was cold but with plenty of choice of cereals, drinks, breads, cheese, meats and fruit etc. All in all a great break in Rome - watch out for the steps in the Dome at the Vatican they are not for the faint hearted! And best to book onto an escorted tour of the sistine chapel to avoid the queues and also the commentary the guid provides is far better than trying to work your way round yourself. Enjoy!", "Date": "August 22, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Wouldn't return - Rotten breakfast, Rude Staff.”", "Author": "Glasgowtourist08", "ReviewID": "UR18877941", "Content": "LOCATION: Good location, handy for metro. Next to Italian Interior Ministry, so felt very safe at night as lots of police patrolling. Lots of restaurants around. Be careful cashing travellers cheques - very high commission charged (up to 17%). There is an American Express office next to the Spanish Steps which will change them for no commission. ROOM: Room was pretty clean, but was dusty under beds. Bathroom was clean and recently installed. The decor was pretty tired - wallpaper torn, carpets could've done with a good clean. STAFF: The night time staff were very friendly and helpful, whereas the day time staff were the opposite. In particular, Salvatore was extremely rude. We complained about the breakfast (see below) but he refused to take us seriously. Treated us very rudely and began to ignore us, refusing to speak to us - not very professional at all! BREAKFAST- Absolutely dusgusting! On the first morning, we went down to breakfast (just after 10am - it was open until 10.30 on sunday). The staff were beginning to pack away breakfast although we were told it was open for another 30 mins. The food was off. There was a bowl of kiwi fruit which was rotten (it had big black marks in it and was mushy) and literally crawling with flies (about a dozen). I decided to give this a miss but my girlfriend had a bowl of cereal - the milk was sour and very hot - it was obviously milk from during the week which hadn't been refrigerated properly. As mentioned before, complaint not taken seriously. Had to buy breakfast outside the hotel every day.", "Date": "August 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Helpful Staff”", "Author": "BobcatSeattle", "ReviewID": "UR12102486", "Content": "We stayed at the Viminale the first week in October 2007. It was our first time in Rome. The staff were all very helpful with directions and setting up travel arrangements for tours. The breakfast was adequate and the coffee the best we've had in a long time which is quite a compliment since we're from Seattle. The location is excellent. A comfortable walking distance to the Colosseum, Trevi and main bus station. Our room had a balcony with a nice view. The bathroom tub was a little smaller than what we were used to but very deep. The bed was comfortable and the room kept clean. I would definately stay there again.", "Date": "December 30, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Sussex", "Title": "“Shame about the bathroom”", "Author": "DenmanSussex", "ReviewID": "UR11183412", "Content": "Good position for visiting \"Old Rome\". Bed linen and towels very clean. Staff friendliness and breakfast acceptable. The room was a good size if a little tired. Hotel was let down by the bathroom which was very shabby (but clean).", "Date": "December 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "eccleston", "Title": "“would use the hotel again”", "Author": "cindigirl", "ReviewID": "UR10206525", "Content": "found the hotel clean and well kept, lift worked all the time. staff very friendly and helpful. our room had good comfortable twin beds and full working shower. room was clean. we were lucky our room was adjacent to one of the roof balconeys. on arrival had problem with door locking, reported to the desk and workman attended very quickly and solved problem. we stayed 4 nights, although the breakfast was average, there was a lot of it. next time im in rome will be staying there.", "Date": "October 21, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London", "Title": "“Disappointing 5th oct 07”", "Author": "LondonKittykat", "ReviewID": "UR10044172", "Content": "Having read the recent reviews before travelling, we thought that the hotel would be OK. We found the hotel to be in a good central location, very close to Colosseum and with easy walking distance of most attractions. Unfortunately that was the only plus for us the minuses were Reception staff very unfriendly and not helpful Breakfast boring, fresh debatable, No room service or bar area - mini bar in your room but no glasses. Bathroom dirty ,no shower, just hand shower head. Room - beds were both camp beds. Not very clean and smelt of tobacco. Wardrobes were shabby, safe had no instructions, Cable TV was just MTV. We knew we would be out most of the time whilst in Rome but still wanted to be able to go back after a hard day walking and sight seeing to relax, that's what we wanted from a hotel we did not find this at the Viminale.", "Date": "October 5, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oxford", "Title": "“Nice hotel good location”", "Author": "Cookie1973", "ReviewID": "UR8658537", "Content": "We stayed in this hotel for 3 nights. Only 10 mins walk from the Termini Station which is where we got a train to, from the Fiumicino Airport, and only took 30 mins and runs every hour. Great location for most of the major sights. Our room was probably in the lowest part of the hotel, but was fine, good size and we had our own little garden with table and chairs and swing! Room and bathroom were clean but the bathroom could do with a bit of an overhaul. One major downside was that we were woken early (6.30) by the noise from the boiler room which was right next to our room! Breakfast was nice, with a good selection of cereal, meat, cheese and fruit etc. Generally the hotel was good and the location great. The front desk staff though could be a little friendlier (perhaps they don’t like the English!!).", "Date": "September 5, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cambridgeshire", "Title": "“Just the job for a short break in Rome”", "Author": "Jase_Cambs", "ReviewID": "UR8521073", "Content": "6 of us stopped here for 3 nights and found the hotel to be ideal for what we wanted to use it for - somewhere to sleep, get changed and take breakfast. The hotel is a few blocks from the main station (Termini) and is pretty easy to find. Checking in was straight forward with no problems. Our room wasn't massive, but it was clean, had a mini bar, a safe and a fair bit of storage space as well. The bathroom was clean and the shower fairly powerful (although the temperature seemed to fluctuate a bit!). Breakfast was continental buffet style, cheeses, meats, yoghurts, fruit, cerials etc and there is room in the hotel as well as an outside terrace where we ate which was great. We found some good places to eat in and around a few blocks of the hotel, there is a nice place as you walk out of the hotel and turn right at the end of the street. Overall we found the Viminale to be a clean, safe and great place to stop for a decent price in an expensive city.", "Date": "August 28, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Essex", "Title": "“Ideal Location, Helpful Staff”", "Author": "SadieZ", "ReviewID": "UR8284371", "Content": "Hotel Viminale is just a 10 - 15minute stroll from Termini station (do not believe the taxi drivers that accost you as you exit the station; \"30-40minutes walk,\" they cried)! The walk to the hotel can take you past Santa Maria Maggiore (well worth the visit inside), and once checked in, sites such as the Colosseum or Trevi Fountain are about a twenty minute walk away (and that was in 36degree celcius heat). The hotel staff were all helpful and friendly; the breakfast provided a good selection of meats, cheese, cereals, fruit and fruit juices. Even though the rooftop terrace advertised on the website was not used when we stayed, the terrace on the first floor was still a nice location for a civilised breakfast. The only slight downside was that, although our particular room was of a reasonable size (a twin on the lower level), it could have done with refurbishment (tired decoration) or at least a really good clean (under furniture/around the shower exterior). Also the shower leaked and was extremely small - be warned: drop the soap at your peril! But we went to Rome to see the sites, not to spend time in a hotel room, so we were not too fussed about these little flaws. We would stay here again and would recommend it based on loaction, breakfast and staff alone.", "Date": "August 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "North Yorkshire", "Title": "“Very impressed......”", "Author": "jdspedd", "ReviewID": "UR8077063", "Content": "We stayed in this hotel for 3 nights at the begining of July 07. The location of this hotel was within walking distance of the termini and many eateries. On arrival at 7.30pm the hotel receptionist booked us a table at a recommended nearby restaurant which was excellent. Breakfast had a good selection of foods and again extremely pleasant staff. The room was a reasonable size and very clean - the maid came in every day. We are glad we spent time reviewing the hotels before we left and we were not disappointed in any way with this hotel. We would definately stay here again", "Date": "July 8, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "london", "Title": "“Be careful”", "Author": "vza69", "ReviewID": "UR7827814", "Content": "Booked a stay in this hotel 2 months in advance through lastminute.com and received confirmation of my reservation within a couple of days. I don't know why I did, but I decided to telephone the hotel about 3 weeks before I was due to arrive to see if everything was ok. To my horror they denied any knowledge of my reservation, and it seems lastminute.com and other travel agents simply fax orders to hotels without confirming receipt. Lastminute.com and the hotel eventually sorted things out (after much time and expense spent on my part) and the hotel said everything would be fine. According to their website they were now fully booked up so I suspected I may be in for a surprise when I turn up, but had no option but to take their word for it. When I arrived at the hotel I was told that there was a 'burst pipe' in my room and everyone elses rooms were fine so they were putting me in Hotel Torino (owned by the same group), which is down the road. Reading reviews on this site, I know Im not the first person to have had problems or have found the hotel double booked etc. If you are going to stay in this hotel, I'd definitely phone them very soon after booking before its too late.", "Date": "June 10, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Derby, United Kingdom", "Title": "“good place to stay”", "Author": "Rach1971", "ReviewID": "UR7724329", "Content": "We stayed at the viminale hotel from 23rd to 26th of May 2007. The hotel was clean and rooms very nice, simple and comfortable and cleaned every day we was there. The bathroom was very nice and had a hairdryer, which worked well so there is no need to pack one to take with you. There is a TV in the room should you want to watch that rather than explore Rome :) but the only English channel was MTV, although some of the programmes were translated to Italian. Breakfast comprised of fresh breads and pastries and cold meats. there was also a collection of cereals and fresh fruit to choose from. with tea or coffee. The breakfast room itself was pleasant and the man who works there serving coffee's and arranging tables was always very happy and friendly. Location was good. Nearest to the colosseum and imperial forum and was a pleasant walk to all other attractions, although taxi's can be ordered from reception. We had no problems checking in or out of the hotel. Overall a good place to stay in Rome and we would definitely recommend it to anyone.", "Date": "May 31, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "greater manchester", "Title": "“Finally! A room with a view!”", "Author": "ruth&rich", "ReviewID": "UR7639050", "Content": "After checking out this hotel on tripadvisor we were really nervous about what this hotel would be like. However, when we got there all our negative thoughts were blown away. The staff were helpful and friendly enough. Our room was clean and bigger than most we have stayed in. The bathroon was larger than most. Only negeative was that the air con didnt seem to be working. This, however, was no hardship as we spent little time in our room. The breakfast was very good. How the poor man who was serving us coped with some of the guests I will never know!! All in all I really liked the place & would DEFINATELY recommend it. We will consider staying there again if we go back to Rome.", "Date": "May 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "England", "Title": "“Good location, basic hotel, friendly staff”", "Author": "Yeemei", "ReviewID": "UR7347108", "Content": "Stayed here over the Easter Weekend and overall was satisfied with our stay at the Viminale. Although it is not in the best area of Rome, most of the major sights were within walking distance and taxi rides towards the Piazza Navona area were quick and cheap. Hotel was opposite a ministry building which was patrolled all day so we felt very safe. We had a room near the lift which was probably one of the noisier areas of the hotel so avoid these if you can. Rooms were small but well equipped and clean. Bathroom was quite spacious and had a good powerful shower. Mini Bar tariff was surprisingly cheap. Breakfast was good with a wide choice of pastries, cold meats, cereals and juices. Staff were friendly and more than willing to cater to our requests. It was a good base for our stay in Rome and would consider staying here again.", "Date": "April 13, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Belfast,Northern Ireland", "Title": "“enjoyed my stay”", "Author": "MARILYNWILLIS", "ReviewID": "UR6815949", "Content": "I stayed in this hotel end of August 06 it was a late booking due to my return flight being cancelled. I stayed for just 2 nights. Although the decor of the hotel is a little tired it was clean and had a really good breakfast. I found the staff to be friendly and the location was great. The hotel is in a very quiet street. My single room was quiet small and the Bathroom even smaller but this did not detract from my enjoying my stay. I would consider staying here again.", "Date": "February 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Devon", "Title": "“Very good for what it is”", "Author": "wyvern76", "ReviewID": "UR6797852", "Content": "We booked a double room here pretty much expecting it to be average accommodation - especially having read some of the reviews on this website. What we found was a perfectly reasonable hotel right in the centre of Rome within 5 minutes walking distance of most of the major sites. The accommodation was no more than adequate but for the price thats all we expected. Rooms were cleaned everyday which made up for the room being a bit dirty to start with. Breakfast was totally acceptable and varied enough to suit different requirements. Communication with the staff was not always brilliant but with a friendly approach the language barrier was overcome and we received a couple of good recommendations for local restaurants and a few minor problems or queries were quickly overcome. This included the simple but hugely beneficial favour of being allowed to leave luggage in the hotel throughout the day on our last day meaning we could pick it up later on rather than drag it around the city all day before our flight back. I guess the conclusion to our stay was that the hotels location is its main advantage but with good pricing and associated basic facilities it was the ideal base we wanted for our three day stay. Willing to recommend it as long as you dont expect a 5 star stay for £60 a night.", "Date": "February 15, 2007"}, {"Ratings": {"Service": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Manchester", "Title": "“Great location”", "Author": "moochabout", "ReviewID": "UR6594814", "Content": "I would recommend this hotel as a medium priced, clean comfortable stay in a very central location. The room was decorated to a high standard and the cold buffet breakfast was very good. We felt very safe in the area day and night. The hotel is authentic Italian and not obviously touristy, there is little information displayed for tourists, but the staff will give basic information if you ask.", "Date": "January 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Wales", "Title": "“Hotel Depression”", "Author": "ObliF", "ReviewID": "UR6307975", "Content": "My wife and I went to Rome for my wife's 40th birthday. The hotel is in a good location with easy access by foot to both the Coliseum and Termini Station. The room we had was clean. On arrival at the hotel both our passports were taken of us even though we argued strongly that it was against our government’s advice. Our room was very small, claustrophobic and quite depressing. The two male staff that worked on reception obviously hated their job and this came out in their attitude towards us. We did not experience any nastiness but we did not feel welcome to the hotel. They both seemed disinterested in anything they did. The male in the breakfast room on the other hand was friendly and jovial. If I ever go back to Rome I will not consider using this hotel again unless I had to.", "Date": "November 30, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "England", "Title": "“Very dissapointed”", "Author": "Julie74", "ReviewID": "UR5930575", "Content": "I booked this hotel as a surprise for my husbands 30th birthday and I was very disappointed. The room had broken handles on the drawers, the wardrobe wouldnt shut and the bathroom wasnt dirty but needed a refurb! We took our 10 week old baby and requetsed a cot, which was old and tatty and Im glad I took my own bedding for her! They advertise as having great views from the roof garden, which is what swayed me to book this hotel - I was VERY dissapointed with this, they lied!!! There were always police outside aswell!! On the plus side though, the breakfast staff were rally nice and the choice was quite good. The lobby of the hotel is as described in the brochure, it is lovely but the rest of the hotel needs updating. Its in a great location though and took about 20 minutes to reach the Colloseum on foot. I wouldnt return to this hotel and wouldnt recommend a friend to go.", "Date": "October 9, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Belfast, Ireland", "Title": "“Unpleasant experience”", "Author": "Spide", "ReviewID": "UR5516864", "Content": "We had just returned to Rome at the end of a wonderful two week honeymoon in Italy. Hotel Viminale despite its 3 stars was terrible. The member of staff working on reception was rude and unresponsive even when spoken to in Italian. Our room was very old fashioned and the air conditioning did not work. It was 38 degrees outside and didn't cool down much during the night, sleeping was impossible. The general decor was dated and the paintwork was shabby. Both staff and the hotel need updated. This was particularly disappointing as we have stayed in many excellent hotels in Rome and have found 2 star hotels to be of a good standard.", "Date": "July 27, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Michigan", "Title": "“Location vs cost”", "Author": "A TripAdvisor Member", "ReviewID": "UR5143602", "Content": "The location is easily reached from the Termini and the directions given were clear to follow even in a new city. The service was abrupt but not in a rude fashion as some reviews have alluded to. Breakfast was adequate with cereal, yogurt, cold meats, etc available. The condition of the room was mediocre. The main room was in need of updating but was not dirty. The bathroom was small but within size expectations of the area. However it was in severe need of cleaning. The shower was moldy and did not drain properly at all. The floor was dirty when we checked in... Overall the quality of our stay was not worth the amount of money. This was the most expensive of the places we stayed on holiday by far - and the least appealing. We will not be returning.", "Date": "May 16, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Knutsford, Cheshire", "Title": "“Great Location. What you expect for the money”", "Author": "A TripAdvisor Member", "ReviewID": "UR5067603", "Content": "We have no quibbles with the hotel at all.Having read some of the reviews on the Hotel Viminale we were ready for any minor problems that may have occured. As it happened we did not encounter any at all. The Hotel is in a superb location for everything you need to see or do in a few days in the city. You can walk to about anywhere of interest within 15 / 20 minutes and the metro is only around the corner which gets you into the Vatican City within 5 stops. We found in general that Rome prices were a bit of a rip off 10 euros in one place for 2 caffe latte. But we found the cheaper and better places after asking around. One great place to try for a great selection of wine and fantastic cheese board (they have a selection, Mild, Medium, Strong which the latter comes with a wonderful side dish of local honey to help with the digestion. The place is called \"Cavour 313\" and is at the forum end of the via cavour. As you walk up the via cavour from the forum it is on the left hand side. Only a small entrance so watch out for it. All in all though we enjoyed our stay at the Viminale and found the staff pleasant and helpful. The breakfast waiter there must now be the most famous in Rome and long may he stay there. Just to add that we also enjoyed the fact that the hotel is on a side street that due to the location near one of the Ministry buildings is under vigil from the carabineri 24 hours a day and is nice and peaceful. A good nights sleep can be had with hardly any traffic noise which is a blessing in Rome.", "Date": "May 14, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "2"}, "AuthorLocation": "Philadelphia, PA", "Title": "“Location Location Location”", "Author": "von_levi", "ReviewID": "UR5005467", "Content": "The hotel itself is nothing special. Rooms are tiny, a bit rundown, and mine had an odor. The breakfast was decent. The location on the other hand is excellent. Just about everything to see and do in Rome is within walking distance (the Vatican is a bit of a hike, but that's about it). The train station is about a 7 minute walk. The hotel's close proximity to Santa Maria Maggiore and Via Cavour (which cuts through the city down to the Forum) make it easy to find your way back to it, especially at night. While there are no restaurants in immediately surrounding it, if you walk 5 minutes in any direction you'll find many. If you're just using the hotel as a place to sleep at night, you'll be very happy with it.", "Date": "April 24, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Houston, TX", "Title": "“Horrible hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4997036", "Content": "This was by far one of the worst hotels I have stayed in. The staff is rude, uncaring, unprofessional. The night clerk yelled at us twice and I'm sure he cussed us out in Italian. The first room we had was awful. The walls and the carpet was stained. Mismatched furniture. An awful, baby blue comforter that did not match anything in the room. The wook was cracked and looked like it was being eaten by termites. No mirror in the room. The tub had not shwer curtain or door. There was not hot water the first morning, for which they were not in the least apologetic. However, I consider ourselves lucky since some of the reviews I read stated they had no hot water during their entire stay. We got moved to a better room with a non-working safe that I asked them to fix and they never did. The cleaning was horrible. We got back to the room the first night. The bed looked like the made had just pulled the covers up and smoothed them over. The towels were on the floor. The day front desk clerk was the only person who was at all helpful. All the night clerks were unfriendly and rude. One of them yelled at us twice. There are two good things I can say about this hotel. Location is OK. It is close to the Termini station and close to two metro stops and many bus stops. It is a 15-20 minute walk to the forum and the colluseum, but once you figure out the busses/metro, you can be there in 5 minutes. The breakfast was good and they man in the breakfast room was nice.", "Date": "April 23, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "watford", "Title": "“Great location, average hotel”", "Author": "mrsBC", "ReviewID": "UR4615888", "Content": "We stayed at the Hotel Viminale in March and found the location to be excellent for getting round to all the sights, as well as being located a short walk away from the Metro. Upon arriving at the Termini station we asked taxi drivers how to get to the Viminale and found them to be unhelpful, suggesting that we should jump in the cab and for 25 euros they would take us there. Given that it was late in the evening we finally managed to haggle our way down to 15 euros. The journey took no longer than 5 minutes - a mere stones throw! A lesson for us, were in future we would phone the hotel ahead and arrange for a taxi - so not a fantastic start! Reception staff were very professional and efficient, to the point that they could be percieved as being quite cold. We were given a room on the 1st floor, and the room was of adequate size. The bathroom was tiny, with a shower door that didn't quite shut, it had seen better days, but overall it was clean and presentable. Again the main room was clean and presentable, with a TV, all italian channels bar one, which was BBC world news. The bed was extremely uncomfortable, and both me and my partner would wake up each morning feeling that we needed a good stretch to iron out aches and pains from the restless nights sleep. We then realised that the bed itself was a camp bed! Breakfast was good, plenty of meats, bread, cereals and juice and staff would come over and ask if you would like tea or coffee. I did find the waiter to be very rude - and did not have personal experience of this until our last day. He seemed to be over familiar but not in a charming or friendly way but quite sarcastic. My italian is very good and noticed that he seemed to be more abrupt with guests who didn't speak the language. On our last day we had to come down to breakfast very early and were one of the first guests to enter the area - whilst helping ourselves to the breakfast I requested if we could have two teas. With that he began to sneer at me and sarcastically responded \"what do you think i'm doing?\" I could not believe that he would speak to a guest in this way and suggested to him that maybe he got out of bed on the wrong side. He then composed himself and tried to make a joke of it saying that he had not won the lottery and that's why he wasn't his best. As previously mentioned, the hotel was in a very good location and it was a quiet area. We were amused by the welcome pack, as it gave description of the hotel Viminale and had pictures which did in no way resemble the hotel we were staying in! The hotel has seen better days and is in need of a lick of paint. However, given the location, breakfast and cost which was very reasonable, thanks to the price comparison tool we used on TripAdvisors website, we enjoyed Rome!", "Date": "March 14, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Birmingham UK", "Title": "“A fab trip made even better...”", "Author": "James-Bear", "ReviewID": "UR4602195", "Content": "I felt that i just had to write a review of this accommodation as the staff and hotel were so good and it was such a joy to stay there.My partner and i arrived there from a late flight well after midnight and we were made so welcome on our arrival and the staff couldnt have been more helpful.The rooms were well above the average italian fare and if you have travelled to italy before you will know what i mean.The room we stayed in was of average size but had a lovely kingsize bed,plenty of storage space,desk and tv and felt very luxurious with high ceilings,plush curtains and drapes and although the bathroom didnt have a bath it came with a wonderful walk in shower and the decor wouldn't have been out of place in a 5star property!!The morning buffet breakfast always set us up well for a days adventuring around rome and is suitable for all tastes,cereals,fruits,cold meats etc etc and the coffee is to die for and the staff once again brought a smile each morning we dined there.The location couldnt be better either as you can walk to the colloseum,pantheon,trevi fountain,and much more within 15-20mins which is the key to seeing rome,a decent location..Overall my girlfriend and i are already planning a return trip to rome and most definitely back to the viminale!! By the way for a wonderful and affordable start to a break try using a company called shuttle direct for a private transfer,very affordable and use fabulous mercedes limos!!have a great trip wherever you go,you wont be disappointed.", "Date": "March 12, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Charlottesville, Va. USA", "Title": "“great room and great location”", "Author": "cheffybehre", "ReviewID": "UR3762980", "Content": "This is a fantastic place to stay! We took a walk after checking in and 5 minutes were gazing at the colloseum. The hotel was great; we had a beautiful room, lovely breakfast each morning the staff was very professional. When we visit Rome we will stay here again.", "Date": "August 15, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Wirral, Merseyside, United Kingdom", "Title": "“Basic hotel in a good location”", "Author": "A TripAdvisor Member", "ReviewID": "UR3744879", "Content": "Our room was quite small and the bathroom didn't have a shower as such but the air conditioning worked a treat. We bought our own dinner and ate on the roof terrace, which has fabulous views, and this really made the hotel worth it for us. We only stayed one night and so were quite happy but i'm not sure we would have liked to stay any longer, as a few reviews have said, it definitely needs a face lift!", "Date": "August 8, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Stockton on Tees, England", "Title": "“Average”", "Author": "A TripAdvisor Member", "ReviewID": "UR3724706", "Content": "We arrived at a different hotel at 1.20am. Upon arrival, we were told, as I have now realised has happened to others, that we were actually booked into the Hotel Viminale which was a 5 minute walk away as it is a chain of 14 hotels. The guy on reception only works there one night a week and was fairly new so didn't really know a great deal. We asked if they could book, and pay, for a taxi for us, as at this time in the morning didn't fancy walking to try and find the Viminale. He reassured us it was only 5 minutes away and gave us a map (although he had difficulty himself trying to find the street on the map). We started to walk but gave up and got a taxi (who also got lost!!!). Upon arrival at the Viminale, the receptionist was rather uncourtious and snappy and didn't give us any information about the hotel other than breakfast was between 7.00 and 10.00. The room was a fairly decent size (although the bathroom wasn't big enough to swing a cat). The toilet seat in the bathroom was falling off, and the doors in the shower cubicle seemed to be falling to bits. The bed wasn't particularly comfortable either. I think the main water pipes ran somewhere through the walls of our room as each morning there was the sound of gushing water constantly for about an hour (presumably where people were getting up and having showers/flushing toilet chain etc), it sounded like there was torrential rain outside!!! There was also a generator type noise which went off every few seconds which became rather annoying. We didn't find the receptionists to be particularly helpful, although the waiter at breakfast seemed like a nice chap. As we hadn't seen any reviews, or an overview of this hotel as it wasn't the one we were supposed to be staying in, we didn't know anything about the terraces either, or any of the other facilities it had to offer. We found one terrace on the second morning, but didn't know about the other 2 that the overview online seems to mention. However, we didn't want to pay a great deal and this is a good priced hotel, and is in a great location, the only complaint would be the noisy room, the unfriendly staff, and the mess about upon arrival in the early hours.", "Date": "July 31, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Staffs, England", "Title": "“Good hotel in great location”", "Author": "A TripAdvisor Member", "ReviewID": "UR3693111", "Content": "Have just returned from the Viminale Hotel in Rome. The hotel was great, in need of a little facelift, but overall we were really pleased. The room was a decent size with a reasonable view, bathroom was more than adequate and everything was very clean. The hotel terraces were great for drinking cheap wines from the local supermarket on a warm evening after a hectic day !! Breakfast was simple but you could eat as much as you wanted, cold meat, cereals, juices, breads etc, enough to keep you going for a day sightseeing. We found all the staff very pleasant and helpful. The location was absolutely brilliant, all the major sights were within walking distance. Would not hesitate to stay here again.", "Date": "July 22, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Loved it - would return.”", "Author": "A TripAdvisor Member", "ReviewID": "UR3455148", "Content": "The hotel offered great service to us and we did not have one complaint. Our room was clean and spacious. The staff were courteous and still offered breakfast even though we were quite late on occasion. The terraced area was great for morning cappuccinos. There was a gym area downstairs, I have a feeling some of the previous reviewers did not ask what facilities where available at the Viminale. The hotel is set on a quiet street and if you take the short walk to the centre of Rome, along the same street you will find an awesome restaurant \"Da Robertino's\" ristorantidiroma We watched some Grand Prix with the owner while eating delicious roast lamb and my partner had fresh pasta - wow. I cannot understand the negative reviews posted, I can only assume that some travellers expect five stars for the price three, and my own rating for this hotel was four stars - would return without question.", "Date": "May 10, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Kent, England", "Title": "“No expections are good expectations...”", "Author": "Parren75", "ReviewID": "UR3251243", "Content": "Our stay was from Feb 28th-March 3rd 2005. We had booked through Expedia to stay at another hotel within the group (Hotel San Guisto in Piazza Bologna), after making our way to our booked hotel, we were told by reception that there was a problem with overbooking and that they were sending us to stay at Hotel Viminale, another hotel in their chain. They paid for our taxi there which turned out to be a fun ride. As a result we had not read any reviews and had no expectations of Hotel Viminale, which after now reading them was probably a blessing. We were happier with the more central location though. The place is definately in need of a face lift. They were doing a lot of work on the place while we were there, but it didn't keep us awake, etc. They had also just put in a new lift (the wrapping on this new lift was never even taken off while we were there). Our room had a rotten view and you couldn't throw a cat in it as it was so small. It had a black and white TV that only got BBC news in English, a tiny fridge that worked well, a so so comfy bed, and what looked to be a fairly decent European bathroom on the surface. The heating didn't seem to work as it should, so we were either freezing or too warm. Every time we showered it flooded the bedroom. It smelt damp and rotten every time we came back to the room, but we just opened the window every time to get rid of the smell. We did report the flooding a few times, a nice chap came along to look at the situation, he didn't speak English though and nothing was ever done. We were only there for 3 nights so didn't worry too much, it was their problem more than ours, we only got wet feet a couple of times. The staff at reception ranged from bright, cheery and helpful, to rude and nasty. On a brighter note, our rooms were cleaned well and restocked every day. The breakfast was average, nothing special, but filled you up. The male waiter was very funny, pretending to complain when you asked for Cappucino. He was entertaining though and one of the highlights. Looking at the hotel online now....I can say that the advertised gym was no where to be found. We are also disappointed that we didn't know prior to our stay about the roof terrace, it looks like there is a nice view from the shots posted online, but we never ventured there as we knew nothing about it until we got home and looked at this site. We also never saw a bar at this place as it seems to say exisits on the hotel's webpage. We ate at the restaurant on the corner one night and found it very nice, reasonably priced and yummy. Most of the patrants were residents of the Viminale. Quite a few locals ate here, but they were always sat at the back of the restaurant in the pizzaria and it made you feel a bit left out, but it was a pleasant enough place to eat and very tempting as only a stone's through from hotel which was good after a hard day of siteseeing and sore feet. The location of the hotel is fantastic, you can walk to all the main sites and the M, Termini, etc. is 5-10 mins away. Overall, we can't complain too much. We got a very cheap deal online and feel we had our monies worth. Afterall, when you are in a city like Rome who needs a fab hotel, you should only be sleeping in it with everything there is to see in the city.", "Date": "March 4, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Frederick, MD", "Title": "“just OK”", "Author": "A TripAdvisor Member", "ReviewID": "UR3097171", "Content": "We stayed at Hotel Viminale from January 13th-20th. Was afraid how the hotel would be after all bad reviews came popping in right before we left. We had a room facing the front of the hotel. It was too small! and I mean really small!! I was gonna cry when I first walked in! It had a small t.v., fridge, and too soft of a full size foam bed! It smelled of mildew a little bit. The shower pressure was pretty good, although the soap dispenser is just disgusting! We did not touch that at all!! The maid cleaned our room everyday, changed the towels and removed the trash. Breakfast was just ok too; few selection of meats, pastries, cheese, cereal, juices, etc.. and I think the coffee was pretty good. You could also order cappuccino. The waiter joked around with us sometimes.. The front desk weren't too friendly, but helpful if you ask them questions ( they all spoke English). Actually, Luigi was one of the nicer ones! Overall, the hotel was just OK. It's within walking distance to most of the beautiful spots in Rome. Take the metro if you can, it only costs 1 Euro per person/per ride, instead of taking the taxi which could cost up to 10 Euros. We don't recommend the restaurant just a few feet down the street from the hotel. Go to Via Cavour, there are a lot of restaurants to choose from, especially Roberto's, great wine and Osso Bucco!", "Date": "January 29, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New York", "Title": "“Would stay there again”", "Author": "A TripAdvisor Member", "ReviewID": "UR3007022", "Content": "I too booked my stay at the Viminale before the bad reviews started coming in, so I was a little nervous coming in from the airport as to what to expect. I need not have worried. My room was spacious, airy and clean; the bathroom also was spacious, with a full-sized bathtub (truly a luxury after a day spent tromping the streets of Rome1), the breakfasts were plentiful and quite decent, and the staff was very friendly. There is a terrace upstairs which I would probably enjoy more in warmer weather but it was nice to have anyway. And we were within 15 mintues walking distance of everything we wanted to see except for the Vatican, which is still walkable distance, as long as you're not in too much of a hurry.", "Date": "January 14, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Mateo, CA", "Title": "“Wonderful hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR2878248", "Content": "I have stayed at the Viminale Hotel several times over the years. The rooms are clean and comfortable and the staff is friendly and helpful. The hotel is on a quiet street and within walking distance of the opera house and many historical sites.", "Date": "December 13, 2004"}, {"Ratings": {"Cleanliness": "3", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Fairfax, Virginia", "Title": "“wonderful”", "Author": "A TripAdvisor Member", "ReviewID": "UR2854157", "Content": "The Viminale was great. The staff was multilingual, courteous and helpful, especially at breakfast. We had a nice room with a king sized bed and an extra single bed. The man at the front desk gave us tour information, wake up calls and helped us with tasks such as making a phone call, getting a taxi and mailing postcards. We would definitely stay there again. The location of the hotel was great! We were able to walk to many sites such as the Colosseum, the Roman Forum, the Spanish steps, piazza novona, the Pantheon, and Trevi fountain. It's a short bus ride to the vatican, St. Angelo's castle and the basilica of St. Peter. Plus, it is a five minute walk from Termini station. There is a nice little restaurant on the corner and a street market and a bank just up the street. Our only problem was finding the hotel in the first place. (Although it is a short distance, we had no directions.) When you leave Termini station, go right until you find Via Cavour. Go left on Cavour and then right on Via Torino OR on Via Agost. de Pretis. Lastly, turn left on Via Cesare Balbo and the hotel is on the left just past a restaurant.", "Date": "November 29, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "St. Louis, MO", "Title": "“Wonderful 3* hotel in great location!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2828507", "Content": "Ok, I just returned from a 6 night stay at the Viminale. We booked before all the bad reviews came popping up. After reading them the last month or so, we were scared of staying there and considered paying more to stay at a different hotel. I'm so glad we didn't. Room - We had a room facing the front on the hotel. It was nicely decorated and had enough space for 2 people with a fair amt of luggage and we still had room to move around. The room was cleaned every day. New towels, soap, trash emptied, and it was vaccuumed. The soap dispenser in the shower was gross, but I always bring my own soap anyway so that was not a big deal for me. The fridge worked and kept our drinks cold. The water in the shower was really hot. The bed was mushy, but comfortable. Public Rooms - I thought they were nicely decorated, many plants, clean, drab, yes, but the buildings are so old there and we were only there to sleep so we didn't care. Staff - They were typical, not overly friendly, but when we needed something, they did what they could. All in all, I would definately stay there again and recommend it to anyone. The location was awesome and the rate we got on Expedia was fair.", "Date": "November 16, 2004"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Warrington, PA", "Title": "“What A Dump!”", "Author": "ElJayBee", "ReviewID": "UR2769277", "Content": "By far the worst of four 3-star hotels we stayed at during a 2-week trip to Italy in early October 2004. On the plus-side, the hotel is located conveniently to Termini Train Station -- about a 5-10 minute easy walk (even with luggage). That's good if you don't want to deal with taxis or the Metro. The Colesseum was only a 15-minute walk away. And, even though the hotel is located in the busy train station neighborhood, off of Cavour Street, it is actually on a small, quiet side street, making for a peaceful sleep. The breakfast was pretty good too, with a selection of cold cereals, fruits, juices, yogurts, cold meat & cheese, plain rolls and pastries. The highlight of breakfast was eating outdoors on the patio, surrounded by plants. On the down-side, the whole property needs a good steam-cleaning and painting. It's pretty drab in the public spaces and a little smelly in parts. Our room was smallish, but typical for that class of European hotel. The bed was large, but with a mushy foam mattress and a big piece of wood between the mattress and box spring. The walls of the room were stained, as were the carpets, and the wallpaper was peeling and completely ripped off in some areas. All of the furniture and woodwork (doors, etc) were scuffed, dirty and chipped. Mold was growing on the bathroom door and on the drop ceiling tiles in the foyer area of the room. The bathroom featured soap dispensers like you'd expect to see in a highway rest stop. The dispensers were broken and contained no soap. On our last day, no bar of soap was provided. The wand-style shower head made showering difficult, especially since there was no shower curtain. The bathroom walls and floor had a nice, shiny tile, but the other fixtures, especially faucets were old and corroded. I would not stay here again, nor would I recommend it to anyone.", "Date": "October 20, 2004"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Scotland", "Title": "“Dreadful experience”", "Author": "A TripAdvisor Member", "ReviewID": "UR2695550", "Content": "The most awful hotel I have every stayed in. Apparently there had been a flood there in September and one of the floors had been closed. When we arrived there was still a damp and musty smell. The rooms were sparsly furnished with furniture that did not match and would have been better suited to a bonfire. We were there for three nights and had no hot water so we couldn't have a shower. Altogether an experience which I would not like to repeat. Ironically the hotel was very central for all of the sights in Rome but this did not make up for the poor quality.", "Date": "October 11, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "NY, NY", "Title": "“Could Comment If I Actually Even Stayed In the Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR2606025", "Content": "Very Very shady Hotel. Same story as the poster before. My husband and I arrived. Instead of a welcome, he was busy flipping through papers and then just stared at us like we landed from Mars. Upon giving our name, he looked at a \"LIST\" and starts of saying there is a Problem. GREAT! Proceeds to tell us about a \"FLOOD\". I had read that \"FLOOD\" really translates to \"OVERBOOK\". He goes on about how there are no rooms because of this flood so he is shifting us to another hotel. That was totally unacceptable to us since we were there bright and early. We also suggested that we can leave the luggage and come back when people would have checked out. He said, it is not possible. So I blew a fuse and said - FLOOD? You mean OVERBOOKED. He denied it, acted very shady, made a phone call - had some guy come and take our luggage to another hotel. Not even an apology - NOTHING. With attitude like that towards customers, I wouldn't book there ever again.", "Date": "September 28, 2004"}], "HotelInfo": {"Name": "Hotel Viminale", "HotelURL": "/ShowUserReviews-g187791-d231925-Reviews-Hotel_Viminale-Rome_Lazio.html", "Price": "$92 - $265*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Cesare Balbo 31</span>, <span class=\"locality\"><span property=\"v:postal-code\">00184</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "231925", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/a9/dc/a9dc6451d32b4c7efc3536d3c1f0b8404large.jpg"}}