{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Jerusalem, Israel", "Title": "“The worth birthday trip ever”", "Author": "nathpek", "ReviewID": "UR126185898", "Content": "I hate to begin a review like this, and generally my reviews are positive ones. I always checked 10 times the details and verify with all the blogs that exist before choosing a place. So we reserved this hotel as a birthday trip for my husband's 50th birthday for 7 nights. The first 2 nights were alright the hotel is very clean, the room was nice with a view to the garden - but for the fact that on the second day they inform us we had to move to another room (we had 2 reservation one from mid September and one from mid November and they had a problem with their planning - the 2 reservation were made 3 1/2 months before!!!!).They could have inform us sometime before so I could choose if to keep the booking or choose another hotel. And then the choc and we understand why all the problems: the hotel was booked completely by groups of high-school teenagers from Italy on a study trip, 50+ teenagers alltogether in the breakfast room, on the stairs... We were move to a room the size of \"Harry Potter cupboard\", so that they could maximize the occupation of the other rooms. The breakfast in the morning was dreadful. I think even the staff was shocked.This hotel is presented as a boutique hotel, not an youth hostel. In three words: don't stay there.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth", "Title": "“Triple room top marks”", "Author": "Candodis", "ReviewID": "UR122432930", "Content": "The much maligned stairs were not an issue for us as we were given a room around the corner from reception. Though you do have the steps at the entrance to contend with. To be fair, most of the places we have stayed in have had at least 5 stairs. But a ramp may be helpful alternative. The hotel itself is elegant and spotlessly clean. The triple room we booked had an adjoining room, which was a big plus. This was great as it allowed privacy for our 17 year old. We thought the breakfast was more than adequate, by European standards. There was a coffee machine in our room, but could not figure out how to use it. A down side of all European hotels as opposed to S.E Asia is that no tea or coffee making facilities are provided. So if you want a \"cuppa\" out of hours, you pay for it! I booked through booking.com and emailed the hotel to get directions as we were arriving from Tegel, at night. I have to say their response was precise right down to timing of trains and buses. The Wifi was patchy,but we did get two passwords so we could use more than 1 device. Overall, we were happy and would definitely stay again. We used the laundry service and found it reasonably inexpensive.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "izmir", "Title": "“Very convenient location and nicely designed”", "Author": "refia", "ReviewID": "UR121958385", "Content": "Located just a few meters from the Uhlandstrasse metro station. You can access anywhere in Berlin without taking care of weather, whether it is cold, windy or really hot. Rooms are nicely designed, taking care of the original atmosphere of the old building. Reaching our room was a bit tricky, had to go upstairs with our luggage and breakfast could be better but I strongly recommend this hotel for touristic stays, if you can carry your own luggage.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellent location, but challenging stairs”", "Author": "Katrin09", "ReviewID": "UR121846512", "Content": "I picked the Augusta for the location which is excellent, with easy access to different parts of the city. The reception is not on the ground floor, so anyone with a large suitcase will struggle up the stairs. I had booked and prepaid a superior double room, but was put up in a minuscule room at the back (no 49), not even with a writing desk, but after complaining, was transferred to a slightly better room (no 10), but definitely not a superior room. The rooms and hotel were impeccably clean. The reception staff friendly. I liked the breakfast table, which varied and of good quality.The wifi worked more or less. No Bar or Cafe.", "Date": "December 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Really nice hotel”", "Author": "SuperGirl20", "ReviewID": "UR117987915", "Content": "It was a little boutique hotel but very nice. Clean nice staff (Well the guy on the first night wasn't very helpful!) but everyone else was. Front desk staff pointed us in the right direction when we wanted to head out & see the sights. Rooms were nice, big & comfy! My sister is allergic to the feather pillows & they happily changed them for us - no hassle! I would recommend this hotel and would consider staying here again as it was very central to everything we wanted to see :)", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Roumania", "Title": "“Very good”", "Author": "Pesticu", "ReviewID": "UR117828827", "Content": "A quiet atmosphere, varied breakfast, large rooms and clean. Even a small garden near the hotel there, but beautiful, where you can eat well and drink a glass of wine in silence. The hotel is located close to commercial area. I'll definitely return to this hotel.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great value”", "Author": "JLYzerman", "ReviewID": "UR116022751", "Content": "(Got a good deal. 100 euros from 155 on hotels.de.) Very pretty and well maintained old hotel, very clean. Necessary upgrades were done. Friendly, professional and helpful staff. Guests that we encountered seemed upper-middle class young men or women traveling together and families. Very quiet inside. Didn't manage to wake up for the breakfast but it seemed as though those who were leaving the beautiful breakfast room were happy. Great location, quiet street off of bustling Ku'damm but with no traffic noise at all. Highly recommend!", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Excellent hotel with great staff”", "Author": "robbin29", "ReviewID": "UR113053340", "Content": "Everything was excellent - close to banks, shopping, buses, subway & restaurants. The staff was very helpful. The breakfast room was roomy and friendly and the food selection great. Coffee and beverages were available all day. Lovely furnishings. Be sure to choose that one for your stay in Berlin!", "Date": "June 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Comfy,warm,better than a cookie cutter hotel”", "Author": "woodsrule", "ReviewID": "UR87044861", "Content": "My husband was attending the MS Conference in Berlin. I booked Augusta Hotel as it was more friendly than a standard hotel. He was very happy. The service was brilliant, the staff are very friendly,the rooms are so comfortable. The location near the Zoo was central. There is WiFi,breakfast but no room service. There are hundreds of restaurants around. This hotel is a find and any visit to Berlin would be rebooked here.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Diego", "Title": "“Very nice choice”", "Author": "SanDiego99", "ReviewID": "UR70820479", "Content": "The hotel and staff were very nice. And if you choose the Fasanenstrasse neighborhood of the old West Berlin, it is very well located with lots of good restaurants, stores and activiity. We found ourselves cabbing it quite a bit over to the Unter den Linden area. But you can always pick up the Hop On Hop Off bus across from the AugustaHotel.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bergen, Norway", "Title": "“Great location!”", "Author": "killemom", "ReviewID": "UR69650233", "Content": "Our room was overlooking the Ku´damm, and location could not be better! We also had a small balcony, and since the temperature was rather high, that was great :-) U-bahn just a few steps away, and getting around the city was easy. The room was spacious, clean and the bathroom faboulus! Breakfast was very good, you could have a pot of tea, instead og a small cup! The rolls tasted exellent, and totally fresh! Special thanks to Lars at the reception, he was the nicest guy ever! Always helpful and serviceminded, even thou it was very busy for him at times! thank you Lars! It was like coming home when we met you behind the desk! The only minor problem during our stay, was that internet was very slow. If I was staying for buisnis, I would have demanded better. But since this was a lleisuretrip, and I didn´t need internet much, it was no big deal.", "Date": "July 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "st. louis", "Title": "“Excellent location and value in Berlin”", "Author": "omioklahoma", "ReviewID": "UR59955107", "Content": "We stumbled upon this hotel in Berlin and were so glad we had. It's a bit quirky getting to the rooms, requiring two elevators. The hotel is surrounded by professional offices. The rooms are like stepping into a 40's movie, complete with balcony overlooking the street. We were quite pleased with the hotel and the location.", "Date": "March 30, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Perfect for Busines travellers”", "Author": "LiliyaK", "ReviewID": "UR50830509", "Content": "Perfect location, very good service and breakfast. The minus is only an elevalor", "Date": "December 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Helsinki", "Title": "“Nice hotel, nice area”", "Author": "xsusa", "ReviewID": "UR39696497", "Content": "Hotel Augusta is a very charming hotel in a good location. It is situated near Kaiser William Memorial Church, the KaDeWe department store and the Zoo station (meaning very good public transportation). Nearest metro station (Uhlandstraße) is within 100 meters and there is also a bus stop very nearby where you can catch a bus 109 to Tegel Airport. Hotel has a great breakfast, everything very fresh, best I had on this trip which included five different hotels. There was a wi-fi connection available, not very fast though and I'm not sure if it was available in all rooms. They gave me a ticket with a 24 hours free access, and it could be used during my whole stay (three nights). Overall a very enjoyable stay, just don't believe the phrase \"All rooms can easily be reached by lift\". There is a lift, but at first you have to climb like thirty steps to reach that lift, and then it only takes you between floors. This was not a problem for me, but for people with real disabilities this could be a big issue.", "Date": "September 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "melbourne", "Title": "“Very Pleasant”", "Author": "mg_barker", "ReviewID": "UR33787737", "Content": "We found this hotel to be in a great spot, nice staff, clean and pleasant, an older style hotel. The only negative thing was we booked a room for 3 adults, which included a queen bed and a single. The single definitely was only suitable for a toddler. It was a slat bed and when anyone sat on it, the slats moved and mattress fell onto floor, not comfortable at all. We moved mattress onto floor and slept on it there, much more comfortable. They really should invest in better single beds..... but otherwise a nice enough hotel.", "Date": "July 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "cork", "Title": "“good location, lovely room, overall nice hotel”", "Author": "corktrav", "ReviewID": "UR25182544", "Content": "stayed here for four nights in one of the suites which is basically just an extra big room. the room was lovely, beds were comfortable, nice bathroom with seperate shower. breakfast was as good as to be expected from a three star hotel with a nice selection. the location was convienient, with easy access to the u-line and s-line. overall a good experiance. the room was very clean, slightly limited access wise, with a few steps to deal with, but not a problem for us. I particularly liked the way the room was furnished. Obviously some thought had gone into it. Again, for a three star, we were quite impressed.", "Date": "February 26, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Connecticut", "Title": "“Looks Lovely, but Beware the Bait and Switch”", "Author": "Rexaford", "ReviewID": "UR16447664", "Content": "Overall experience was not the worst I've had - but pretty close. Be sure to get EVERYTHING in writing, so you receive all you expected and paid for - even if that means being insistent with the staff (who are brusque at best and downright rude at worst). Location is great; excellent neighborhood near fashionable shops, restaurants, and transportation. Non-smoking rooms really were non-smoking, which was perfect (and unexpected in Europe). Now the catches we experienced... We are seasoned travelers. We reserved two months in advance directly with hotel via email for our two-person, nine-night stay. Requested and were confirmed with a particular number \"Superior\" room, quiet, non-smoking, with in-room w-lan. After a 12-hour travel day, we arrived to check-in and were inexplicably assigned to a lesser room with a small bed. When we informed the staff of their mistake and explained we could not both sleep in the small bed (although we are both average sized), we were told there was \"nothing else available,\" despite the written confirmation we presented to the very person who corresponded with us. When absolutely pressed (she herself did not offer a single option or apology), she reluctantly said we could switch to the promised \"Superior\" room after the first two nights. With a large convention in town, we had no choice. These non-German speakers were simply too exhausted to argue. Incredibly, the staff tried to force us to pay the Superior room price for these first two nights and only relented after we disputed with our credit card. When we finally were able to move to a Superior room, the staff tried to shoehorn us into one without a shower (tried to sell us on the \"beautiful jacuzzi tub\" which is not all that appealing to these business travelers, especially given it is about the size of a thimble). We were willing to believe that this bait and switch was simply the result of a one-time misommunication with us, until we saw the very same thing happen to at least three other parties at check-in over the course of our nine-day stay. Coincidence? I think not. Finally, after two nights and two moves, we were allowed to take the actual room that we actually reserved. First morning, shower drain was VERY slow. Second morning, it was clogged completely; we could not shower without water overflowing onto floor (no tub - just shower). We reported to staff that shower was totally unusable and plumber (or at least Drain-O?) was needed. Staff never attended to this, despite repeated requests, and never acknowledged the issue unless I raised it. Finally, in desperation, I myself disassembled the drain and cleaned out a four-inch hairball (not ours). No, my friends, this definitely was NOT my most positive hotel experience. Shower worked just fine after that! Other issues: We were careful to request a quiet room and were confirmed with same; but neither the initial smaller room (facing courtyard) nor the promised Superior room (facing Fasenanstrasse) was quiet by any stretch of the imagination. Hotel touted the \"new\" fourth floor featuring in-room w-lan, but in-room w-lan was non-existent in either room; not sure whether the other few rooms on \"new\" fourth floor really do have it, as advertised. Hotel site claims that \"all rooms have...Internet\" (which I suppose is intended to mean a landline?) but neither of our rooms had any kind of land-line Internet access. Hotel site also claims there is a \"large breakfast buffet,\" but we found a hot chocolate machine and a table of meat that was picked over by 9am. Site also says there is a \"small safe in every room,\" but our lesser room did not have one. We found no in-room temperature controls, other than small bathroom heater. Very warm in room, even in May.", "Date": "May 27, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "london", "Title": "“Very mixed blessinbg”", "Author": "woodwander", "ReviewID": "UR15470148", "Content": "Not a good recommendation. It is well situated just off the Kurfurstendamm. The staff are pleasant. The room was pretty. Bathroom lovely but what they do not tell you is that they also accept parties of schoolchildren who take every available table for breakfast. With just one hot drink machine available, if you are unlucky you have to queue for your coffee, perhaps behind ten children. The reception is on the first floor and although there is a lift at street level, there may be masses of kids using it so you have to walk up. And the lift only stops between floors so you have to carry your luggage up some stairs anyway. They say there is as a safe in every room. None in ours. Phone not working either. They also pretended that they had no idea that parties of children were booked in - that it was an agency's doing. Hard to believe especially when the second group in four days arrived.", "Date": "April 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Utah", "Title": "“Clean Hotel but small rooms”", "Author": "roberts331", "ReviewID": "UR14035977", "Content": "I booked this hotel and paid before arrival for nine nights. The hotel is great with clean rooms and great breakfast but the rooms are very small.I got a standard room and in pictures on the website it shows a very big room which is not the case. Am still staying at this hotel as of now.", "Date": "March 4, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "milan", "Title": "“take care”", "Author": "aiace", "ReviewID": "UR13830184", "Content": "take care about rooms because they have different type : our room was very noisy and old style furnished compared to the closer one. We spent the first night without heating system and they didn't accept to reduce the entire balance from the original quotation. The \"concierge\" has been really unpleasant with us and they don't accept the american express even if we have booked with the amex code. Avoid the hotel because at the same price you will easily find a best location at the same price.", "Date": "February 25, 2008"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "dundee", "Title": "“very nice”", "Author": "ronni-michelle", "ReviewID": "UR3942351", "Content": "I give this hotel an average rating because it is not upscale, but it is clean, pretty, well-run and cared-for. I completely disagree with the elderly couple who didn't like it. I stayed there in the summer of 2004 and found the staff very helpful, my tiny little room was all that i needed, clean and sweet. fruestuck (breakfast) was lovely. i love the german breakfasts! If you want to stay in west berlin, this is a lovely place. i just felt i had to defend it.", "Date": "September 27, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "uk", "Title": "“Lousy Hotel”", "Author": "SlaviaPraha", "ReviewID": "UR3653669", "Content": "We have recently stayed at this hotel and found the whole experience horrible, and certainly the worst value for money we have had for many years. The staff were unfriendly to the point of being ignorant. They were also extremely unhelpful. We are senior citizens and had to find our own way to our room, carrying our luggage first up a flight of stairs from reception to a lift which went down to a courtyard. We had to go up three floors, leave the lift, go down a flight of stairs and along a corridor to our room. The room was facing the courtyard which afforded no privacy at all when using the bathroom. We were also asked not to put toilet paper down the toilet, which we found to be a disgusting request. At night there were generators continually buzzing in the courtyard making sleep difficult. Perhaps the worst experience was that staff entered our room when we were out during the evening and left the door open, fortunately nothing was stolen. Breakfast was from 7am to 10am. If you are down in the breakfast room later than 8am most of the buffet was gone, and was not replenished. The hotel does not have a bar. All in all, I cannot advise that you stay in this hotel. There are many better value hotles in Berlin.", "Date": "July 10, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great Location”", "Author": "artcat", "ReviewID": "UR3523441", "Content": "I walked to the hotel from the Zoo train station and found the hotel just off a main street (Kurfurstendamm) with lots of restaurants in the area. There is also a U-bahn station just around the corner. The room was small, of course, but clean and quiet as it faced into the back courtyard. The staff were friendly and helpfull, and all I spoke to understood English. Although an excellent value, the Augusta might not be ideal for everyone. There are stairs to the reception on the first floor. Also my single room only had a shower. I prefer that myself, but bath-lovers may not.", "Date": "June 3, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Sehr gut!”", "Author": "michiganmarlon", "ReviewID": "UR3518511", "Content": "I very much enjoyed my may 19-22 stay at the Hotel Augusta, a charming small hotel in a superb location right off the Ku'Damm in exciting Berlin. The hotel is on Fasanenstrasse, a relatively quiet, fashionable street less than a half block from the commercial carnival that is the Kurfurstendamm. The hotel has a small charming lobby a flight of stairs up from its entrance. The rooms are cozy, well-decorated, bright and very comfortable. Bathrooms are compact but more than adequate, with glassed in showers. The beds were very comfortable, and the courtyard rooms - which we had - were very quiet. The breakfast room was bright and cheerful, with a very good breakfast buffet that included plenty of croissants, danishes, fruit, cold cuts, eggs, cheeses, good coffee, tea and juices. The location is great - right off the Ku'Damm and a half-block from the Uhlandstrasse U-bahn station. If you're taking bus 109 from Tegel Airport, just get off at Uhlandstrasse and walk around the corner. The Kaiser Wilhelm Church, Zoo Bahnhof train station, the KaDeWe department store and the broken chains statue are a very short walk away. Berlin's other great attractions can be quickly accessed by the excellent public transportation network.", "Date": "June 1, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Kentucky", "Title": "“Best place to stay in Augusta”", "Author": "A TripAdvisor Member", "ReviewID": "UR2629143", "Content": "We recently stayed at the Augusta Towers Hotel and Convention Center (formerly the Sheraton) and were very pleased. The lobby is impressive, the staff is friendly and helpful, and room was comfortable and spacious. We would stay there again. There are many wonderful places to eat in the neighborhood, so I would recommend exploring rather than eating in the hotel.", "Date": "October 7, 2004"}], "HotelInfo": {"Name": "Augusta Hotel", "HotelURL": "/ShowUserReviews-g187323-d232612-Reviews-Augusta_Hotel-Berlin.html", "Price": "$92 - $215*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Fasanenstrasse 22</span>, <span class=\"locality\"><span property=\"v:postal-code\">10719</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "232612", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c1/65/c16502079dbd65652c46edc8c20c6b828large.jpg"}}