{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "", "Title": "“Great hotel for a large group, but if travelling on your own, stay somewhere closer in.”", "Author": "Jefftm", "ReviewID": "UR127198665", "Content": "Hotel is quite a way out of town and located in a residential district. Good German restaurant within a few minutes walk and laundries, both self service and drop and pick up are only 10 mins walk away. Regular trams are only 5 mins away along with a ice local shopping centre. Hotel caters for large groups and was crawling with school groups. But all seemed to be handled well with minimal fuss and delays.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Volgograd, Russia", "Title": "“1-3 night stay”", "Author": "mynthon Posted by an Oktogo.ru traveler", "ReviewID": "UR126168379", "Content": "The location of the hotel is about 20-30 min with the tram from Alexanderplatz and it takes 5 min from tram stop. There were a few large groups of school kids staying here and they were very noises. The hotel is a former dorm, so that's what the rooms look like. The view from my room was of a disused house littered with rubbish. Good audibility in the rooms. Given the price, the hotel is on an acceptable level.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“A place you can stay only to sleep.”", "Author": "kingrudy", "ReviewID": "UR123949695", "Content": "I stayed here for 3 days for my 15 days germany tour..this is previously a hostel..and that explains why the rooms are not that up to standard like a one star hotel at least.No phones in the rooms.No smoking in rooms if u smoke they will \"avenge\" your action with an €80 fine.You cant use their electricity freely..no charging of phones watsoever..the staff are fierce looking Germans except some staffs from the F&B side.The chefs is very good.The food is marvelous.I give 5 stars for the restaurant staffs.No stars for front office staffs. A short walk to the Alle shopping centre..take tram M6 to Alexanderplatz..so everythg is good.But just remember..this is previously a hostel and expect some hostile experiences.Rate my review:)", "Date": "February 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Maastricht, The Netherlands", "Title": "“Nice rooms, a little far from the city”", "Author": "janet r", "ReviewID": "UR118698737", "Content": "Nice hotel, enjoyed our stay overall. The staff was helpful and informational. The tram stop is about a five minute walk from the hotel which is great during the daytime, not so great at nighttime since there is essentially no street lighting. There is a small shopping center near the hotel but very few restaurants. Good value, would stay here again if on a budget.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "San Jose, California", "Title": "“Its average - You get what you pay for”", "Author": "Raj018", "ReviewID": "UR82541359", "Content": "The hotel was fine, the staff friendly, they suggested the Berlin welcome card (on a side note this is very usefull for anyone spending 2 or more days in Berlin). Also the 8 euro, they charge for the breakfast is soooo totally worth it. The meats are delicious and it is enough to fill you up until 4 or 5 in the evening, and both me and my wife did just that. Now, the only complain we had was the location, the website suggested it was 15 mins away from the city centre. However this is the reality - it will take you about 7 mins or so to walk to the nearest train station (S Bahn) and one train will take you to Alexanderplatz in 15 mins. From Alexanderplatz you have the options for connections via U Bahn and other modes of transtport. So in reality it will take about 30 to 40 mins for you to get to the centre. But overall this hotel was clean and nice, it is more of a hostel with an option of a pvt bathroom. Good for budget travellers who need a hotel with no frills and basically a place to shower and crash for the night.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "envbecky", "Title": "“Like a delinquant youth centre, but with worse beds!!!!”", "Author": "envbecky", "ReviewID": "UR59758183", "Content": "I have just got back from a stay at this hotel - I am doing an MA course at university and I was there on a field trip tos study Berlin. (in a large group of full time and part time students - many of us however study part time and have full time jobs. The hotel is located a very long way away from the centre of Berlin, and took over 30 mins when on the tram to get to Alexandereplatz. There were three of us sharing a room for 3 night, but alas there were only two actual beds and 1 small fold out sofa bed with a mattress that was the thinnest I have ever seen on a sofa bed. The shower althogh good is in the tinyest cubicle with no space to wash properly. The rooms mini bar consisted of a bottle of sparling water (no fridge) left on the shelf which cost 2.80 euros. This aside the worst thing about this hotel was the other guests. When we arrived there was a group of roudy italian girls swearing and smoking and generally being noisy. The hotel seemed to be oblivious to the noise and showed no signs of asking them to calm down. I guess they were 16-18 years old but several of them were served at the bar. They shoved us around in the lift and were just out of control. But they didn't annoy me as much as the shool kids doing a field trip for economics as they were chanting, drunk as farts until 4am every morning. Again they didn't seem old enough to be served in the bar but were getting drunk every night and I saw them purchasing beer without any checks. One of them spoke to me (I think he was trying to chat me up until I pointed out that I was 30 which is why I know it was a school field trip). The bar ran dry for us every night, and we were about the last people to be served by the bar staff who were particually cold to us, I am guessing this was because we were actually old enough to buy beer. There was a group of junoir school kids that were running riot banging on doors all evening and messing about with the lifts all night and squealing. Breakfast was very average, the bar too small - and full of drunk children. All in I am sure its calmer in a young offenders institute which is what this hotel felt like and I really wouldn't recommend staying here unless your 15 years old and want to get drunk with no questions asked. My only hope is that my University got the hotel rooms really cheaply - as stated there were only two actual tiny single beds in our room. I wouldn't recommend this hotel to anyone at all apart from school kids - who will be fine to just go wild ! Anyone else - I recommend you avoid it like the plague and head somewhere else. If I wasn't on a uni feild trip I would have checked out on the first night and paid whatever it took to stay anywhere else. It is officially the worst hotel I have ever been to .... ...... really!!!!!", "Date": "March 28, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“Gymnastics trip to Berlin”", "Author": "PhilipRD", "ReviewID": "UR49275205", "Content": "It doesn't look much from the outside and the rooms are a bit plain, but the beds are comfortable and the dining room and bar areas are nice", "Date": "November 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sheffield", "Title": "“Best Hotel On The Planet”", "Author": "DustBunnySheffield", "ReviewID": "UR26771668", "Content": "Third time we've stayed in about 18 months and would not think of staying anywhere else in Berlin. It is clean, comfortable and welcoming. The staff are efficient and friendly and the breakfast is excellent - lots of choice, well presented and good coffee! The bar is always open and is great for a last drink before bed - good night's sleep in warm comfortable room. The first time we also overlooked the factory but saw it as part of the history of the area rather than an eyesore. (I guess it depends on your general outlook on life.) For some people the 20 minute No. 6 tram ride to/from Alexanderplatz may be an arduous trek but to us it was fine and full of interest - especially when a guy boarded with his fridge. I can't think of anything negative to say about Hotel Kolumbus and can't wait to visit again. What a find.", "Date": "March 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Enkhuizen, The Netherlands", "Title": "“not too bad!”", "Author": "diana56", "ReviewID": "UR16390099", "Content": "I was in the hotel as a teacher with 78 pupils.It was value for money and the youngsters were suprised about the rooms and about breakfast.I would not suggest it for individual travellers who long for luxury, but for more or less low budget and for schools it's perfeect!", "Date": "May 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Melbourne", "Title": "“Not my favourite Hotel”", "Author": "Eur0peanVacati0n", "ReviewID": "UR14994190", "Content": "We stayed here for 2 nights with some German friends. The Hotel is very average. I wouldn't reccommend it. It is a long way from the centre of Berlin and a long way from the main tourist attractions. It is about a 5 plus minute walk to the tram stop and then another 30 minutes by tram into Alexanderplatz. We ate dinner at the restaurant and it was OK but the breakfast(included in the room rate) was fairly ordinary. There were a few large groups of school kids staying here and they were very noisy, especially in the middle of the night!! The view from our room was of a disused factory littered with rubbish. I think this Hotel is mainly used by large school groups. I would recommend that if you were visiting Berlin to see the sights, you would be better off to stay closer into the Centre.", "Date": "April 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Urbana, Illinois", "Title": "“Average”", "Author": "RickyC", "ReviewID": "UR8026416", "Content": "We just stayed at this hotel with a group of high school students. I have mixed feelings about the hotel. Pros ------- Staff is relatively friendly and most speak English fairly well. Restaurant serves decent food. Rooms are fairly spacious. Cons ------- Very remote location. Closest public transportation is a 5 minute walk to a tramway, not the subway (U-bahn). Ride to Alexanderplatz is approximately 30 minutes. This is a residential neighborhood so not much to do. There is a small bar/restaurant in the area that is awesome. The hotel is a former dorm, so that's what the rooms look like. Beds are hard as a rock and my back ached every morning.", "Date": "June 29, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Brisbane", "Title": "“Loved it!!!”", "Author": "plunk07", "ReviewID": "UR4024018", "Content": "This hotel is fabulous!! The outside of the entrance is painted in funky colours of blue and red and the foyer is nice and bright and big. The staff were very, very helpful and friendly and always wanted to help. When we checked in they were fully booked so they upgraded our room from basic to comfortable at no extra cost! The room was also very colourful and large. It had a small hallway leading into the bedroom where there was enough space to store our suitcases. The bedroom was very large and had huge windows looking out to the street. It was also very clean. The bathroom was big, although the shower was tiny. The buffet breakfast was nice and plentiful with fruits, cereals and rolls. The only downside to staying at this hotel was that it was booked out with school groups when we stayed there, although they weren't very noisy and didn't bother other guests. This hotel is great and has a laid back feel to it; the colourfulness of it gives it a hostel feel, although the quality is well above hostel quality.", "Date": "October 14, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Somerset England", "Title": "“Enjoyed”", "Author": "A TripAdvisor Member", "ReviewID": "UR837989", "Content": "Though it is a small hotel it is in what was the former East. The hotel was clean the food was good and for the most part the staff were great, there was one or two that let them down, bar staff being one. I think I know a good wine from a bad wine by now. The hotel is in a resedential area, transport connections are not far though and no doubt there is an abundance of taxis. Go for coffee and cake its seems to an institution and is great. If you go about Easter time its like Christmas all over again. Loved the German people they couldnt do enough to help. We are planning on going back in the near future. when we were there, there was a few Russian folk about, but they didnt even return my good morning or hi or smile. Thats my aim to have coffee with someone Russian.", "Date": "January 17, 2003"}], "HotelInfo": {"Name": "Hotel Kolumbus", "HotelURL": "/ShowUserReviews-g187323-d232608-Reviews-Hotel_Kolumbus-Berlin.html", "Price": "$50 - $118*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Genslerstrasse 18</span>, <span class=\"locality\"><span property=\"v:postal-code\">13055</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "232608", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/6e/f5/6ef50cf940e1654a810cdfba2ca4df421large.jpg"}}