{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“One word will suffice: SUPERB!!”", "Author": "Classicalfanatical", "ReviewID": "UR127759375", "Content": "I cannot fault this hotel! It was superb. The staff helpful and friendly; the breakfast buffet delicious. The fascinating furnishings in the foyer and other areas added to the intrigue. I had an extremely comfortable twin room too. A really superb quality hotel at an excellent price! Can't recommend it highly enough!", "Date": "April 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Romsey, Hampshire, England", "Title": "“Good Hotel with friendly staff and good breakfasts”", "Author": "sheila34", "ReviewID": "UR127120551", "Content": "We were a group of ten ’older’ ladies. The rooms were clean and the beds comfortable. The hotel is on a busy main road, so ask for a quiet room if you do not like traffic noise. Also email the hotel beforehand if you definitely want twin beds – we arrived to find that the travel agent hadn’t specified this and it took some time for the harassed staff to re-organise. There is a lift, but the doors open onto half-landings, so that there are twelve steps up or down onto the corridors. There is an excellent cooked breakfast and a simple lunch on offer in the restaurant. We went across the road to the excellent Dalmatia Grill for all our evening meals. The staff in the hotel were very helpful and printed out exact directions on how to get to various places. Ask them to include details of the return journey – we had big problems finding our way back from Potsdam as there were no officials to ask on the station platforms. The bus stop for town is outside the front door and the no 48 goes direct to Lustgarten where one alights for Museum Island and the Dom/Cathedral. Soon after arrival we walked (20 minutes) to the Potsdammerplatz station information office to buy a three day bus pass from the information office, but It might have been easier to have bought it on the internet beforehand! The Technical museum is twenty minutes easy walk away. It is huge and ideal for the last day if one’s bus-pass has expired.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tromso, Norway", "Title": "“Nice hotel with friendly staff and traditional german food.”", "Author": "KarlKarlsson", "ReviewID": "UR125668371", "Content": "Had a meeting for a group of nine persons for three days. Real value for money in business package with conference room. Real \"homemade\" German food in large tastefully portions. Expect some noise in rooms facing the street. The business rooms had a lot of space. This hotel is a real alternative to standard hotels, the hotel have soul!", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“Cosy and different”", "Author": "Diana L", "ReviewID": "UR124794599", "Content": "We stayed for a week during my 50th birthsday, and it was altogether a very pleasant experience. The staff was professional and very helpful. When we had to see a doctor, the staff arranged one nearby which we could see right away. The breakfast was very good; german style, and the tea was delicious, served in a samovar! The room was cosy and very tidy, and the cleaningpersonal discreat. Due to cold weather we had almost all of or eveningmeels on the hotel. In the beautiyful Jugentrestaurant we had a vary of very good german style dishes: gulasch, wienerschnitzel and more. As smokers we really enjoyed the smookingroom furnished with thick red velvet curtains and sofa. The location was very good with a 15 min walk to Brandenburger Tor, and five to Potzdamer Platz.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Carmona, Spain", "Title": "“Comfortable hotel to have a nice Vacation”", "Author": "Teodoro F", "ReviewID": "UR123523816", "Content": "This was a great hotel to stay for my visit in Berlin. Most of the staff was very helpful during my stay. When I say most it's because there was one receptionist who was always mad or not people friendly. The room was small but comfortable. Furniture was old but rustic. They had internet available at the lobby and a restaurat with great Berlin style cooking. My room was facing the back yard which it was nice and quiet. Breakfast was included in the price, it was nice to eat good cheese in the morning. Even when I was about to leave the night before they were helpful if my flight was canceled, but over all it was great, thanks to the staff of Isabel, Judith and Max.", "Date": "January 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Moscow, Russia", "Title": "“Definitely 3 star!”", "Author": "travelqueen059", "ReviewID": "UR123244412", "Content": "This was a nice hotel for the price. Elevators stopped 1/2 floor off. Furniture looked more second hand than antique. Chairs in sitting area felt as though they really need re-upholstering and the bed in the bedroom was two twin mattresses on a queen frame. Most of the staff was great, with exception of older gentleman that served dinner. Breakfast was good, no variety though, the same food every day for 5 days. On the plus side: The bus was right outside the door and made touring very easy, breakfast was filling, and beer was cold. Good enough for the price.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London", "Title": "“Altberlin review”", "Author": "Katy W", "ReviewID": "UR122969742", "Content": "Charming hotel with lovely fire in to relax next to with a beer. Room was comfortable. Back of building was falling apart and in great need of attention. Shower leaked everywhere as the curtain and bath mat insufficient. Staff very grumpy. The breakfast could do with a revamp as was very limited and when we asked for extra eggs we were greeted with a hostile \"no\". Berlin as a whole was an interesting place but for us lacked in atmosphere and character. The Berlin Wall of course was captivating (what was left of it) but if you are looking for a more cultural Germany experience, with people watching, great food and lots to see, you are better off going to Munich.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Palm Beach, Florida", "Title": "“Great City / Airport Hotel”", "Author": "Oliver J", "ReviewID": "UR119432294", "Content": "On returning from a trip to the Island of Usedom I stayed a night at thei shotel and was very happy! It was very clean, very friendly staff and they do serve an early breakfast! The location is also excellent, just 15 minutes from the airport and at the same time there are many restaurants in the area, just minutes walk. You feel like you are in the city but it is so close to the airport. Next time i will stay two or three nights as it is such good value form money and explore the city from here.", "Date": "October 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "London", "Title": "“Quirky, but good hotel”", "Author": "GregoryRagroll", "ReviewID": "UR115978133", "Content": "If you want a modern hotel where all the rooms are the same, this is not for you. All rooms are different, the hotel seems to be a couple of buildings joined together with a lovely courtyard inbetween. There are odd artifacts dotted around the corridors - mannekins, bicycles etc. There is a lift. The hotel is well situated near the Sony centre and Potsdammerplatz. The bus service is brilliant and there is a stop right outside the hotel. Staff were friendly and informative. Breakfast is only average, plus if you get down in the last hour, they tend not to replenish stuff so choice becomes limited. There didn't seem to be enough staff at breakfast when we were there. Berlin is brilliant and this is a convenient hotel to use as a base.", "Date": "July 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "North Yorkshire", "Title": "“Wonderful hotel”", "Author": "GeorgeNorthYorkhire", "ReviewID": "UR113136763", "Content": "Located on the Potsdamer Strasse, not Potsdamer Platz, the hotel photo is a bit minleasding. However, the hotel is ideally situated to explore Berlin. There is a bus stop outside the hotel or a 10 minute walk and you are at the U-Bahn. There is a superb buffet breakfast with more than enough to eat - cooked eggs with mushrooms (omlette style), bacon, tomatoes, olives, pickles, cold meats, cheeses, bread (still warm), croissants, various jams, fruit juices, mineral water, coffee and or tea. Enough to you sustain until dinner. Rooms are clean, but insist on a room which does not overlook the main road, which carries traffic 24/7, unless noise is not a problem. That said we did get used to it by the second night or third night and stayed a week.. No problems with going out at night, area felt perfectly safe and the hotel is situated in an area of excellent value restaurants. Visit the Wintergaten Theatre Club, its just 3 minutes walk from the hotel. All in all an excellent value, traditional old berlin hotel.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "scotland", "Title": "“great base for exploring Berlin”", "Author": "eurotraveller010", "ReviewID": "UR109210116", "Content": "The hotel was selected for us by German travel agency DER and they got our tastes exactly right. This is a friendly, characterful, well-run hotel which, on the deal we got through DER, offered very good value for money. Don't be put off by the immediate surroundings, which are rather run down The AltBerlin is only 10 minutes' stroll from many of the city's biggest cultural attractions, from the Philharmonie to the Sony Center, and from the KulturForum to the TierGarten. The hotel was originally three 19th century apartments, and has kept a number of original features. The rooms are all furnished in Wilhelmine style, and are quiet, clean and comfortable. There's an attractive restaurant which serves huge breakfasts and excellent evening meals, and a charming inner courtyard, which many of the bedrooms look into. A nice touch were the Berlin beers awaiting us on arrival. We stayed seven nights very happily and would go back like a shot.", "Date": "May 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Gateshead", "Title": "“Old but perfectly acceptable”", "Author": "HaigGateshead", "ReviewID": "UR108221624", "Content": "We only stayed a few days but found Hotel Altberlin staff to be friendly and helpful, without exception. The bus stop is just outside which made travel from and to the airport very easy. We found it within easy walking distance of most of the attractions we wanted to see. Yes, it is old but the food was good and there was plenty of it and the staff were very friendly and eager to please. This is not a \"plastic\" or \"cardboard\" hotel but one with real character.", "Date": "May 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Huddersfield, United Kingdom", "Title": "“Sehr Gut”", "Author": "kokapeli", "ReviewID": "UR103810339", "Content": "Very good traditional hotel, full of character. Very nice rooms, excellent buffet breakfast and good a la carte menu in the evening. Traditional Prussian menu. Efficient staff. Very convenient with two buses running outside one connecting with the main station.", "Date": "April 12, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "maidenhead", "Title": "“Traditional German Hotel”", "Author": "sueuk_8", "ReviewID": "UR90073135", "Content": "traditional hotel which could be hard to find in Berlin. Convienent locatation, bus stop outside to all tourist sites and nearest u-bahn station. I found the staff very helpfull with any questions we had. The rooms were small but very clean and adequate for the amount of time you spend in them. Breakfast is included and is excellent in a very cosy dining room with lots of choice. My only complaint would be when we arrived on Sunday the bar was closed and it would have been nice to have been able to get a coffee or a drink without having to go out.", "Date": "December 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kitchener, Canada", "Title": "“Convenient location, accommodating staff, comfortable rooms”", "Author": "ConsuellaBB", "ReviewID": "UR81653129", "Content": "You can enjoy an outdoor enclosed patio, a drink at the bar, and a substantial variety at the buffet breakfast. Rooms are clean with the coziest duvets. An elevator (which many downtown old buildings do not have). Staff were always willing to look up something on the internet for us - we wanted to go kayaking and found an outfitter by a lake outside of Berlin - a 40-minute train trip ! Bus is right outside the door and the hotel is within a 15 minute walk to great restaurants in and around the Sony Centre in Potsdammer Platz. When in Berlin be sure to buy a 72-hour transit pass at the airport - It will take you as far as a train trip to Potsam's palaces and the 1936 olympic stadium.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "united states", "Title": "“Would not recommend to tourists”", "Author": "sheree40", "ReviewID": "UR76195716", "Content": "Very disappointing. Staff rude, unaccomodating. Spoke broken english at best. NO airconditioning. Had to switch rooms first night due to shower spraying wildly all over the bathroom, flooding the floors. Asked for birthday cake for my husband's birthday on arrival and was not there, no apology, no nothing. Staff would complain if they had to go out of their way to get a fork for you. Definitely not tourist friendly, especially if you are not German. Felt very unwelcome during entire stay. Great location however.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Albury, Australia", "Title": "“Would stay here again”", "Author": "JH-Australia", "ReviewID": "UR68214083", "Content": "I really enjoyed my stay at this hotel. My room was on the 3rd floor overlooking the courtyard. It was a large room with a roomy bathroom and a separate room with a desk, wardrobe and bar-fridge. The breakfast (which was included in the room price) was excellent. It was buffet style with a range of options. It takes about 10mins to walk to Potsdamer Platz or 5-6mins to walk to Kurfurstenstr. U-Bahn station. I would definitely recommend others to stay here.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“visit to Berlin”", "Author": "ChemicalAli", "ReviewID": "UR67216795", "Content": "The Alt Berlin hotel is situated in a reasonable location, walking distance to most central places of interest, if you are fit. The hotel is clean, the breakfast is substantial, but the staff are terrible, unfriendly and cold. The manager and barman would do better if he tried to smile. Not a lot to ask. I would not repeat a visit to this hotel. Advice to staff, try another job.", "Date": "June 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Texas", "Title": "“good location but not so good hotel”", "Author": "Becky9903", "ReviewID": "UR50320202", "Content": "I stayed 2 nights at the Hotel Altberlin. The room was small, I was on the third floor facing Potsdamer Strasse, and found out that you can hear EVERYTHING going on in the street, and it is a busy street. My bathroom was small too, which is to be expected, but the hot water was very unreliable, it would go from hot to ice cold back to hot in the course of one shower. Not fun! There is a restaurant and a bar in the hotel. The parking was very complicated and not handy for getting car in and out for use. Potsdamer Platz was one block away, easy to get there walking. It was OK but I would not stay there again. Not worth the price, which I paid over $120 a night for a 3 star that was more like a 2 star...", "Date": "November 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Ticked all the boxes”", "Author": "ragdan", "ReviewID": "UR50227495", "Content": "My decision to stay here was influenced by previous reviews on Trip Advisor and the price! The hotel is in a great and convenient location. There is a bus stop right on the doorstep, it's a short walk to pick-up the Berlina tour bus & a 10 min walk to Potsdamer Platz. The staff were very helpful. The decor is authentic and quaint. The rooms were comfortable, warm and spacious. We were really impressed for the price especially as it included breakfast which was very good. You do have to ask if something you want has run out but despite the slight feeling that you are causing an inconvenience, they will get it for you.", "Date": "November 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "LANCASHIRE", "Title": "“A great little hotel”", "Author": "DRACSS", "ReviewID": "UR37692169", "Content": "I have read a lot of negative reviews concerning this hotel, and wish to put the record straight. It has a great location, only a 6 minute walk to u-bahn kurfurstenstrasse, 10 minutes walk to pottstamer platz, or catch a main line bus directly outside of the hotel. If you want a yankee type plastic and shinny hotel forget this one, the decour, staff, and restaurant are the original Germany settings. The staff were great, old time dressed, and free internet IS ALWAYS available at reception counter, manned 24hrs. The food , again, was plentiful, original and wholesome. The hotel does have a lift , though it was a pleasure to walk up the wide stairs and admire the huge doors. The hotel is decorated throughout with antiques of German origins. The rooms are more than adequate with plenty of storage. No bath but good showers and plenty of toiletries You want real German hospitality, then visit the Altberlin", "Date": "August 14, 2009"}, {"Ratings": {"Overall": "2.0", "Location": "4", "Service": "2"}, "AuthorLocation": "The Hague Holland", "Title": "“Hotel was overbooked, so it was a big disappointment”", "Author": "denhaag1971", "ReviewID": "UR35961417", "Content": "We selected this hotel for it's location via booking.com. Because my flight arrived very early I tried to arrange an early check-in but was double disappointed because the hotel was overbooked. The receptionist told me because of a computervirus (?) our booking didn't come through, so she offered another hotel (Best Western Steglitz). This hotel turned out not to be bad at all, but the location was quite remote. To be honest I don't believe the computervirus-story for multiple reasons, especially because I had read about simular problems with Altberlin in the years before. With only a booking of 1 night you know you are the kind of customer they refuse in the case of overbookings.", "Date": "July 27, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Boston", "Title": "“Okay, but not great.”", "Author": "dnjoudrey", "ReviewID": "UR34439174", "Content": "Overall our experience wasn't too bad, but there were some issues. We were in a ground floor room on the courtyard, but the room was small and awkwardly laid out, and the bathroom was ridiculously cramped. It was a \"quiet room\" on the inner courtyard, but the courtyard is a fairly active place in the mornings and in the evenings. It was undoubtedly quieter than rooms on the street side, but the maintenance staff's dragging of the garbage cans to the street early in the morning woke us up several days of our stay. The heavy courtyard doors also made a lot of noise when they slammed shut. The fact that people can smoke in the courtyard limited when we could open the windows. At times, the windows needed to be open because there was no air conditioning. The service was also inconsistent. The women on staff were pleasant and helpful. The men on staff were rude and seemingly perturbed by our presence. The location of the hotel was good. It is an easy walks to major sites and transportation was convenient. While we liked Kreuzberg, Schoneberg, and Prenz'lberg better, the Tiergarten/Potsdamer Platz area wasn't too bad; just a little touristy. The restaurant was fine for a meal or two, but I would plan to eat elsewhere (great Turkish restaurants in Kreuzberg) most of the time.", "Date": "July 11, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Washington State", "Title": "“Good location, but poor service that led to hours of hassle”", "Author": "KMDesigns99", "ReviewID": "UR28823345", "Content": "We decided to stay in this hotel for the location, which overall was good. We had easy access to bus and symphony hall. The front desk service was inconsistent. During the morning helpful young ladies provide excellent services and advise for getting around Berlin. At night and on the weekend we had difficult and unhelpful young men. I am writing this review because we did have difficulty with our bill. There was an accidental double charge. It took over 3 months to clear up and the hotel was totally unresponsive until the last month. At that point they refused to review their records. We prevailed through our credit card company and finally got the charge removed. This billing hassle was not worth the experience. I wish I would have listened to the previous trip advisor reviews and stayed elsewhere.", "Date": "April 26, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "spain", "Title": "“Not the best place to be in berlin”", "Author": "lunita71", "ReviewID": "UR8260346", "Content": "First We found cockroachs \"on the bed\". We asked for another room and they complaied and we even had to show the cockroach to the person in charge. Afteralls we got another room, quite noisy by the way. We treatment was very rude and breakfast was not very well. Having known all we spent the first night we very kindly asked to stay another two nights but changing the room. The person in charge was ok with the idea so the next day we asked for the number of the other room and she denied the question. So we have to argued with her and finally she accepted to do that. The other room was so quite nevertheless the shower was broken. Apart two people from the hotel the treatment was not very ok and they don´t resolve problems properly. I know quite well hotels in Berlin and the are usually clean, cheap and have nice people.", "Date": "July 30, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Oslo, Norway", "Title": "“A mixed pleasure”", "Author": "MOnica9", "ReviewID": "UR5984485", "Content": "This hotel has some charm, with it's old fashioned furniture. Thank God our room was on the first floor as there is no elevator. Breakfast was good. There is a restaurant, which we decided to try one night, but it was buffet only. The kitchen was closed that night, so they had no a la carte. The food was nothing special at all,mostly cold dishes, not recommendable. The room and bathroom was modern and comfortable. The negative things was the noise from the street, and the desk staff. The girl at the desk the first day was lovely. But the night receptionist was very unfriendly and not helpful at all. He barely spoke or understood a word of english.The day we were leaving (very early in the morning), he didn't seem to know the prosedures for cheking out guests. He seemed very confused about everything. He asked for 66 euros although the room was prepaid. When I asked him for an explanation he didn't seem to understand. He just pointed at the reciept and said something in german that non of us understood. We had no choice but to pay the 66 euros even though we didn't know what we payed for and the reciept didn't say anything about what it was. And when we asked if he could call a taxi for us, he didn't say a word, he just made the phone call and said something in german that non of us understood a word of. This was a very unpleasant experience. Aside from that, the room and bathroom was exeptionally clean, and the beds were good. I don't think I will choose this hotel the next time I am going to Berlin (a wonderful city by the way).", "Date": "October 22, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cyprus", "Title": "“A pleasant Surprise!”", "Author": "ATcyprus", "ReviewID": "UR5802570", "Content": "My wife and I stayed at the Altberlin at the end of August 2006 for 3 nights. After recovering form the first \"shock\" of having to climb to the third floor (no lifts!), and coming to terms with the medieval motif of the reception, we discovered our hotel to be really above average in all respects, and certainly good value (note- try to book over the internet, as advertised prices at reception are much higher). Breakfast is excellent and dinner is very good value. Staff is helpful and rooms are comfortable. In terms of location, it is very central and within walking distance to underground stations, the Philarmonic Hall and Potsdam Square. If you dislike stairs, make sure you ask for a lower floor room. For guaranteed tranquility ask for a room facing the inner quad. The hotel owner makes a special effort to transport you to Berlin of 19th century. One very important aspect is that the hotel is small, which makes it cosy.", "Date": "September 15, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Some charm, lots of noise”", "Author": "CameronBailey", "ReviewID": "UR4468166", "Content": "I stayed 2 weeks at the Hotel Altberlin, mostly during the Berlin Film Festival. It's a very convenient 10 minute walk to Potsdamer Platz, which is the hotel's chief virtue. It also has a somewhat stagey old-world charm, with lobby and restaurant decor from the early 20th century. The wait staff in the restaurant even wear Weimar-era costumes! One big problem: I woke up every morning to the sounds of doors slamming. A combination of large, heavy doors, weak hinges and thin walls mean that noise might be your strongest memory of this place.", "Date": "February 18, 2006"}], "HotelInfo": {"Name": "Hotel Altberlin", "HotelURL": "/ShowUserReviews-g187323-d232610-Reviews-Hotel_Altberlin-Berlin.html", "Price": "$67 - $187*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Potsdamer Strasse 67</span>, <span class=\"locality\"><span property=\"v:postal-code\">10785</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "232610", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/dc/21/73/front.jpg"}}