{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Braintree", "Title": "“Clean, basic hotel, close to Camp Nou”", "Author": "Gary T", "ReviewID": "UR127476070", "Content": "The hotel is ideal if you're looking for a clean, basic hotel, close to the Camp Nou or if yo're looking to do Barcelona for one or two nights on a budget. It is very close to the Metro and takes about 15 minutes to get to Plaza de Catalunya/Ramblas Away from the football ground there are a few small tapas bars and a McDonalds if you like that sort of thing. It is also very close to the Metro. I've now stayed here twice and although I like my comforts, I'll return here when going to watch the football and just want a cheap, clean bed for the night. Just remember you are not paying Ritz prices so don't expect Ritz style accommodation.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "East Kilbride, United Kingdom", "Title": "“I'll be back”", "Author": "Big_G_From_EK", "ReviewID": "UR124243792", "Content": "I used this hotel in early February 2012 for a long weekend in Barcelona with my 11-year-old son. The reason I booked was price and proximity to the Camp Nou (We had tickets for a game on the Saturday night) It was warm, clean and had friendly staff. Comfortable beds with sheets and blankets that were expertly made each day - we'd a bit of trouble getting the sheets back!! They were fantastic to sleep in. Yes, there was a bit of noise in the morning, with doors banging and people talking but you're in a hotel - what do you expect. Be warned - it's VERY basic and fairly cramped. If you are looking to spend some time in your hotel, look elsewhere. If, like us, you are only using it to sleep in and keep your stuff, then I'd highly recommend it. It's less than a 10 minute walk to the Camp Nou and a 5 minute walk to the nearest Metro (Callblanc). And there's a fantastic little pizzeria just around the corner with a McDonalds and a lovely bakers in close proximity. The lady who checked us in was very pleasant, laughing and joking with my son in near perfect English. All other staff were friendly and smiling. I'd use this again for further Nou Camp/Barcelona trips.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Location": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Only if you spend most of the time outside”", "Author": "Skepticus2", "ReviewID": "UR116686337", "Content": "I agree with most of the comments but would like to add that breakfast was bad and too expensive if not booked with the room (€ 8)", "Date": "August 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Very noisy 'staff'/ Els empleats encarregats de la neteja \"mold ruidos\"”", "Author": "xicanes", "ReviewID": "UR89971599", "Content": "Spent seven days/six nights at Hotel L'Alguer! Loved the location! Located on a very quiet street with hardly any traffic except for an early commuter or two! Within just a few steps from a Metro station. But one can also walk all the way to the Plaza Cataluna (the heart of Barcelona) It may take an hour and maybe asking 'how to\" a couple of times! Twice during my stay I had to go to the front desk at about six o'clock in the morning to ask the receptionist what was \"all that raucous about\" Twice, I was given an empty stare and a \"what do you mean noise, Sir\" kind of question as if I were dreaming or figuring the noise being made by the 'help in charge of the up-keep'.. They talked just as if they were in the middle of the Ramblas! No regard whatsoever for the \" Do Not Disturb Sign\" Other than that helpless and hopless night receptionid(s) the room was clean, somewhat comfortable and the bathroom was adequate. Would have no objection in going back if for nothing else, for the simple fact of its proximity to a metro station.", "Date": "December 16, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Washington, DC", "Title": "“If you require anything that requires interaction with management, be warned”", "Author": "thomasjhancock", "ReviewID": "UR50629156", "Content": "My friends and I booked a room at this hotel on our way home from a cruise. When we arrived, we were met by a very old, bitter, and acrimonious lady. Due to some mix up, there was they had only received a reservation for a 1 room for 2 people. We told her it wasn't a big deal and just to double our bill for another room. However, she refused, saying we would have to pay an exorbitant rate for the second room. Mind you we been at the hotel for about an hour and not a single person came or left, so anyone heard of supply and demand? We disagreed with paying this much higher rate and decided to split up -2 of us stay at this hotel and 2 others stay at another hotel around the same area. However, she said she would not allow anyone in our group to stay at a different property and if we didn't pay this exorbitant rate for a second room with her, we would not be allowed to stay in the room we already paid for either. She said she would not refund our money (booked online earlier in the week) and we would be out of luck. I would NOT recommend this hotel under any condition. These owners have an anti-western vendetta and outright say they don't trust younger people \"like us.\" For the record, I am 25. There are a lot of hotels and hostels in and around Barcelona. Try staying there. The price may be appealing but they'll get you in the end.....", "Date": "December 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Orlando, Florida", "Title": "“Good location, but not much else”", "Author": "mrmun", "ReviewID": "UR11683233", "Content": "My wife and I stayed at Hotel L'Alguer for two nights in December 2007. We booked the hotel through Priceline.com, and paid about $60 per night. The hotel is in a good location, only a few minutes walk from the Collblanc station on the L5 metro line. The metro is cheap and easy to use, and getting into the city centre (Ramblas, etc) requires one change and takes around 15 minutes. The area around the hotel is quite lively too, with many shops and places to eat (including McDonalds, though this was closed on Saturday). The front-desk staff were helpful, providing information and maps. There's also an internet-connected computer in the lobby, which is free to use for guests. Location aside though, the hotel was disappointing. The entire hotel only has three rooms with double beds, which are allocated on a first-come, first-served basis, so there's a relatively high chance you'll be stuck with two single beds. The rooms are small, and feel quite dark and gloomy with the lighting. There are windows and blinds, but we kept these closed as it was cold outside. The bathroom is small, and the shower was awkward to use. The water temperature had to be adjusted using the hot and cold taps, and a turn too much of either tap would result in scalding hot or freezing cold water. It gets easier after a day or two of use. The TV was small, only had one channel, and that was in spanish. The remote control didn't work either, though with a one-channel line-up, it wasn't really needed anyway. Although I probably wouldn't stay here again, it's not bad for a budget conscious traveller in town for a few days who isn't planning to spend much time in the hotel.", "Date": "December 19, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "North West", "Title": "“Basic but clean”", "Author": "LH2006", "ReviewID": "UR5831317", "Content": "My husband and I stayed at Hotel L'Alguer in Barcelona for 3 nights in September 2006. Although it was adequate, I would describe it as a hostel rather than hotel. The room was very small but had all of the essentials and the bed was comfortable and everything was clean. It is located quite far away from the main city centre but has a metro station around the corner which has a direct line to the centre (takes about 10 mins). I would recommend this hotel for those on a tight budget or students. Also, we had booked it as bed and breakfast but when we arrived they said it was on a bed only basis and therefore had to buy breakfast each day.", "Date": "September 24, 2006"}], "HotelInfo": {"Name": "Hotel l'Alguer", "HotelURL": "/ShowUserReviews-g187497-d232785-Reviews-Hotel_l_Alguer-Barcelona_Catalonia.html", "Price": "$67 - $109*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Passatge Pere Rodriguez 20</span>, <span class=\"locality\"><span property=\"v:postal-code\">08028</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "232785", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/e7/4e/e74e9a8ac1afa4d2b8e492a5ffa55e0b7large.jpg"}}