{"Reviews": [{"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“OK for short stay / stop-over, unprof. staff”", "Author": "Waterfall84", "ReviewID": "UR124244536", "Content": "+++: - Good price (low-season): 35 EUR for single room... in Rome! - Building is old (it is Rome, so what to expect) but well kept and very clean. - Free wifi that works very well. - (Single) room is tiny but enough for 1 person. - Compared to many Termini budget accomodations, it is a hotel of its own, so it has independent and easy to find entrance. ---: - Location is a bit far off Termini (about 1km) but there is a tramway station next door and an underground station (Vittorio Emmanuelle) like 500m. away. True it is not the best area in Rome, but it is not dangerous by any means as some other reviewers assumed (it is Rome's informal Chinatown so it is really glamourous but not bad). - Had an argument with the night keeper about taking the key out. While I understand they don't want guests to take them out (just to avoid duplications or losses), I don't like leaving the key on the hotel since I have rented that room for 1 day. The doorman was unpolite and rude arguing about it.", "Date": "February 7, 2012"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Brussels", "Title": "“Nice choice for a citytrip”", "Author": "SnowInBrussels", "ReviewID": "UR117666000", "Content": "Clean, well-kept small hotel with extremely friendly and efficient staff who gave me good advice on getting around. Further to walk than I thought but close to bus routes (nearest metro station was closed due to works). Take 105 bus from Pza dei Cinquecento (Termini) and get off at 4th stop (Via di Porta Maggiore) and Via A Grandi is just across the street. Good bus links to centre and Trastevere from Pza di Porta Maggiore nearby. Not many restaurants or bars in the immediate area but there is a supermarket within walking distance. Individual air-conditioning - a godsend in August. More than adequate Italian breakfast served on the terrace - great start to the day. I want to come back here!", "Date": "September 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kaatsheuvel, The Netherlands", "Title": "“Warm welcome”", "Author": "Klijn", "ReviewID": "UR76934648", "Content": "We had a wonderful stay at hotel Ducale to celebrate our wedding anniversary. The personel was very friendly and helpful. They even congratulated us with our anniversay, eventhough the booking was made months before, how wonderful! We enjoyed our breakfast outside in a wonderful small, covered terrace. Breakfast is being served (toast, croissant, cheese, jam, hunny and hazelnut spread). By choice hot drinks, cereal and fruit. It is simple but complete and enough to start the day. Rooms are very clean, comfortable, complete and spaceious. Large bathroom. Hotel is easy to reach from metroline Vittorio Emanuele (one stop away from Termini) in just 5 minutes by foot. We never felt unsafe in the neighbourhood. The room with balcony made our stay in Rome complete. We thank the staff once again for this wonderful gesture! We for sure book hotel Ducale when we return to Rome.", "Date": "August 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Good base for exploration.”", "Author": "GSKorelys", "ReviewID": "UR67069331", "Content": "We booked the Hotel Ducale the day we walked in, as we arrived in Rome and decided to \"wing it,\" so I think we did very well considering the circumstances. It's about a 10-minute walk to the main train station, which was the reason we found it in the first place. The staff at the hotel are all wonderful, smiling, friendly people. This is very appreciated. Most of the staff spoke English and even asked us to help them with some of their vocabulary, which was fun. Our room was in the basement portion of the building but still had high ceilings so I did not feel claustrophobic. The rooms are very, very small and the bathrooms are even smaller. There was, however, self-controlled AC (much appreciated), a large refrigerator, shelves in the bathroom, and a massive wardrobe for unpacking. The bathroom is teeny. If you're a normal-sized person, be prepared to change the temperature of your shower every time you turn around. Two people attempting to pack at the same time will bump into each other a lot. I think we could have gotten this place for less than 80 Euros a night if we had booked in advance. The breakfast was typical Italian fare, but good, the coffee was strong and the service out on the patio was pleasant. The staff were very helpful in recommending tour companies, places to eat, etc. There is a large supermarket about 5 minutes' walk away and we bought snacks there and kept them in the fridge, which was very convenient. You can walk to the Coliseum in about 20 minutes and we did not feel unsafe at all. I would stay there again.", "Date": "June 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Clean, comfortable, good value”", "Author": "mkb952", "ReviewID": "UR65903254", "Content": "Stayed here for 5 nights while on an extended trip in Europe. Found the hotel to be very clean and well kept. You never know what to expect reading some other reviews. A little farther away from some attractions but within easy walking distance.15- 20 minutes to Termini train station, 25 min. to Coliseum and 10 min to subway station. Easy walking to main attractions or take the east-west subway. We found the subway to be a great way to get around. Did not feel uncomfortable walking around the area but as in any city be aware of your surroundings. If in Rome would stay here again.", "Date": "May 31, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "NYC", "Title": "“Dont stay in the Basement”", "Author": "RRR25", "ReviewID": "UR52771673", "Content": "I traveled to rome for 3 days during 12/31- 01/04, the Hotel is not a 3 start hotel, try a 1 star. It is about 25 minutes walk from the train station. The area isnt the best in Rome, its pretty dingy and smelly. In other words its in the hood. The hotel doesnt have an elevator, so pack light. The check in was fine, the concierge was really nice, but the night concierge has no personality. Once we got to the room, which was located in the dungeon. I was fortunate to get the room in the basement. I open the door and it smelled good at first, i noticed the plug in air freshner, which isnt a good sign. i then proceeded to the bathroom located at the back of the room, once i opened the door, i relaized why the air freshener was there. The smell of wasnt the nicest, the bathroom had spots of mold, the shower area was about 4'x4' so if your a medium built person by all means good luck taking a shower. i asked to change rooms and my request was denied. Blankets were old and smelly. The good thing that came out of this was that i was forced to explore more of rome, so i would have to go back to the hotel. Also if you have allergies, please bring medication. Also no outside call.", "Date": "January 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Switzerland", "Title": "“Good value!”", "Author": "Swisstraveller75", "ReviewID": "UR34067301", "Content": "Nice hotel, about 10 min from metro, easy to find. No elevator, but we knew that. Very friendly and helpful staff. The room was nice and clean, and not noisy, even if it was on the street side. Bathroom was big and clean. The room was cleaned daily. The only negative point is the breakfast : very very small room, and no choice : they give you a croissant and toast, only orange juice, coffee and tea to drink. But it was no big deal. I think it's a good hotel for people who don't want to pay too much and stay not far from a metro.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "wolverhampton", "Title": "“Great choice for quick stopover”", "Author": "juliemtalbot", "ReviewID": "UR16832995", "Content": "We stayed at the Ducale for one night before catching our return flight home. For the price it was good value for money. Clean, comfy rooms of a decent size (i've paid twice the price for rooms half the size in Rome). Staff were really helpful and spoke good English. Had to check out at 7am so couldn't have breakfast as it isn't served until 7.30. I agree with previous comments about the location being a bit 'dodgy' it was the first time i've felt a bit uneasy walking around at night - never felt this in Rome before. Overall, if you're looking for a short break as a stopover you can't go wrong but I wouldn't stay here if my main purpose was to sight see and soak up the atmosphere of the eternal city!", "Date": "June 10, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Herts", "Title": "“Cheap and simple base to see Rome”", "Author": "ljb26", "ReviewID": "UR14263978", "Content": "It was very cheap for its location. The place was clean, the staff met us at the door and took our bags. The breakfast was simple, but the effort was nice and they definitely didn't have to do it for the price. We were near the front door, and the walls are very thin so can hear alot, like the doorbell, but people seemed considerate. Room was a bit pokey. All in all though it was good, not for a romantic stay in a room, but as a reasonable base to see Rome and not spend loads (59 Euros a night). The area I didn't find as bad as some have said, but I can understand why you wouldn't want to walk there as a single girl maybe. Manzoni station is five minutes away, 15 minutes to the Colosseum and 10 or so to the Terminii. It is on the other side of town from some of the evening life, and the tube doesn't go everywhere but that's not to say there is nothing on that side of Rome also.", "Date": "March 13, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Framingham, MA", "Title": "“Enjoyed our stay at Hotel Ducal”", "Author": "roamin7", "ReviewID": "UR10093991", "Content": "The room was clean and of regular size. We even had a nice balcony. Shower in the bathroom was rather small. Staff was great and very helpful. As other reviews indicated, a quick walk to Termini or the Coliseum was no problem. Hotel is not in the greatest neighborhood, so if travelling alone use caution.", "Date": "October 17, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Roanoke", "Title": "“OK, low price”", "Author": "carmenrome", "ReviewID": "UR7209948", "Content": "My boyfriend and I stayed at Ducale twice last November, first for 3 nights; we went south for a few days and then came back for 2 more nights. First, the price was very good for the hotel with breakfast included. On our last night the hotel made a car reservation for the airport for us and the guy was there exactly on time. That was 50 euros well spent. The hotel is 15 minutes from the train station. When exiting the station make a left and keep walking for about 12 minutes or so and then the street the hotel is on will be on your right and you should be able to see the sign from the main street. Location is so and so, not the best, not the worst. The minibar is only half way full, so you can store a few things of your own in the fridge. Also, the minibar prices are cheap. We kept getting stuff out of it every day. When we left for Capri we paid for the 3 days plus mini bar stuff and she didn't have the right change and did not charged us for a few items. The breakfast was OK, the only thing I did not like is that they were charging extra for cappuccino than for coffee, and since the breakfast is free, it should have just been free also. The guy at the reception during the day was fantastic. Every time you would ask for directions of any sort he would get out a map and mark the places and give you the maps. I wished I would have known that before. I bought a map of the city at the station for 5 euros. His were better (they were marked) and I still have them. The night clerk, a black guy was OK, a little bored all the time. Over all, for the price, more then OK and Rome is just as fantastic every time. A true joy. By far the most beautiful city on earth.", "Date": "March 23, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Italy", "Title": "“Best time ever in Rome!”", "Author": "Andrew06", "ReviewID": "UR6804883", "Content": "I booked an Hotel on bookhotelsinrome named Ducale and the place was just fantastic, cheap and comfy, good rooms and food!! Great time in Rome guys!", "Date": "February 17, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Hertfordshire, UK", "Title": "“Great for a city break!”", "Author": "Rogoashear", "ReviewID": "UR6552607", "Content": "A nice hotel near the Termini rail station (15 minute walk) and the centre of Rome (15 minutes in another direction!). It was great value for money, most of the staff spoke fairly good english and were very helpful. The Rooms were comfortable and nicely decorated,we stayed in two different rooms (as we visited Rome on either side of our trip) so we got to check out more than just one!! It seemed like you either got a big main room with a smaller bathroom, or a smaller main room with a bigger bathroom and a balcony. The breakfast was very simple, just toast and yogurt, as well as coffee and orange juice. A great hotel to use as a base for exploring this incredible city!!", "Date": "January 4, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Berlin, Germany", "Title": "“Not for women travelling alone”", "Author": "Peemoeller", "ReviewID": "UR6107396", "Content": "The people who work at Ducale are very nice. Other than that my stay had a lot of problems. I got room 107, possibly the smallest hotel room I have ever been in which only fit a single bed a closet and a table. Not even enough room for a chair. The window was blocked by the cabinet and it was very claustrophobic. I was unhappy at the thought of staying in that room for the four nights I had booked. At night the area is not so great. Street lighting is not good and there are many men out drinking on doorsteps. To get to the (only) closest restaurant is a five minute walk and the subway is beyond that. Otherwise there is no other street activity. I was followed home by a an Italian man who was a little too friendly. Since I was unhappy I checked out early. This was not much of a problem and I was treated with respect, but unfortunatley when I got home I found that they had charged my card over 800 eu (by mistake ?!) in addition to the room charge. I am still clearing this up with my credit card company. I wish I could have given this place a better review since the people who worked there were very nice and accomodating, but it just didn't work out and I would not recommend it to any single person for fear they would get room 107 and definitely not for single women. The neighborhood is just too desolate. Finally how can you make an 800 euro mistake?", "Date": "November 11, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“Really nice family hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4823659", "Content": "My boyfriend and I stayed in this hotel in Feb 2005, we both work in the hotelbusiness and we have really enjoyed it in this hotel. The staff was really nice, Its really worth what you are paying for!", "Date": "March 31, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Amman, Jordan", "Title": "“I hated the rude owners... too small”", "Author": "A TripAdvisor Member", "ReviewID": "UR4000471", "Content": "The owner was very rude. A forigner receptionist wanted to make me pay for my room twice, giving me hard time. The room is terrible: 2 mX 1 m...just unbelievable. I hated to go back to my room every night. The breakfast was so funny .... not enough for a 5-years-old child.", "Date": "October 7, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Oerlinghausen, Germany", "Title": "“Good hotel for a smal budget”", "Author": "trip-and-trap", "ReviewID": "UR3994596", "Content": "We - 3 Persons - have been 3 nights sept. 30. to oct. 3. at hote ducale, rome - statione termini -. This is the 2nd house of hotel ducale. This hotel is only on a 5th floor direkly opposite from statione termine and it can be reached from airport by shuttle to statione termini very easily. It has only a few rooms and a small reception together with the breakfast area, but o.k. Staff is friendly an speak well english. Roms are o.k., big enough and clean. Breakfast o.k. If you pay cash anstead credit card then you receive 5 % discount on prices which agreed. So far a good hotel for a short stay.", "Date": "October 5, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "allentown, pa", "Title": "“great budget hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3527393", "Content": "I agree. The location to the train station and collesium were great. For the price we paid the room was sufficient. After all, we were did not travel (from America) to Rome to spend the day in a hotel room.", "Date": "June 3, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Waynesville, NC", "Title": "“Great Value”", "Author": "A TripAdvisor Member", "ReviewID": "UR2438409", "Content": "Hotel Ducale was a great value for the money - a quick 15 minute walk from the Forum and Coliseum, a quick and tasty breakfast, and a very helpful staff.", "Date": "August 10, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Klettgau, Germany", "Title": "“Good value for the money”", "Author": "A TripAdvisor Member", "ReviewID": "UR1807666", "Content": "I cannot share the opinions of ther reviewers before me. The tram and bus station is just 100 meters away, but still this seems to be too far for some american tourists. The area is not worse than any NY-area, and you only have a fifteen-minute-walk to Colosseum. The rooms are freshly renovated and very clean, I even had a balcony, what more in this priceclass? Staff was very friendly and breakfast sufficient for European stomachs, of cause not for an American! Very recommendable.", "Date": "April 21, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Sydney", "Title": "“Fine, just a little noisy.”", "Author": "JecaSydney", "ReviewID": "UR1650007", "Content": "Stayed there in December 2003. Room was clean and spacious enough. Only complaint was the noise - next door bathroom and traffic. Night / breakfast staff friendly, reception bit ordinary. Breakfast was basic and enough to get you started for the day. Good coffee. Distance from Termini is about as far as you would want to go walking with luggage. Area is not the best but still felt safe. Good little clothes and food market, and supermarket close by for the budget conscious.", "Date": "February 15, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Minneapolis, MN", "Title": "“You Get What You Pay For”", "Author": "A TripAdvisor Member", "ReviewID": "UR1544971", "Content": "I stayed here and was not impressed from the moment my taxi dropped me off. It's in a miserable area of Rome and not at all convenient for catching public transportation. Upon entrance, the common areas appear adequate and clean, however, my room was awful. The room was no bigger than a typical bedroom closet and there was no phone or cable tv as my reservation suggested. The room I was in was next to the lobby and loud in the evenings. The sheets were always clean, but the bed was lumpier than any rollout cot I've ever slept on in my life. If I was any older than 24 I might not have been able to get out of bed in the mornings. The bathroom couldn've been cleaner and I had a nasty case of ants on the floor after I accidentally knocked over a bag of potato chips. YUCK! After tiring myself seeing the sights of Rome all day, I wish'd I had spent a few more bucks on a better hotel room. I didn't want to spend more time than required in this room and I couldn't wait to leave it! The man who checked me in at the front desk wasn't exactly friendly, however, the other staff I encountered were amiable. The continental breakfast was passable. I would not recommend this hotel to anyone.", "Date": "January 10, 2004"}], "HotelInfo": {"Name": "Hotel Ducale", "HotelURL": "/ShowUserReviews-g187791-d232855-Reviews-Hotel_Ducale-Rome_Lazio.html", "Price": "$51 - $145*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4, Via Achille Grandi</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "232855", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c8/34/c8342c53b0a8168bb2d6b437c33147496large.jpg"}}