{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Nottingham, England, United Kingdom", "Title": "“Best Western Trafalgar Madrid”", "Author": "Philip S", "ReviewID": "UR128573688", "Content": "Stayed one night prior to leaving for the airport very early next morning. Booked a single 'smoking' room. Very small but contained everything you could expect for a 3 star hotel. I was on the 7th floor and the room did have the advantage of a quite large balcony with views over the city. The bathroom was clean and well equipt with toiletries. I arrived on a Sunday evening and the bar was closed but hey, there are plenty nearby. Did not eat at the hotel because of time factors, the dining area did look pleasant though. The satff were friendly, welcoming and much more than just helpful.", "Date": "April 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Simple, clean hotel with compact rooms and great free wifi”", "Author": "Whifty", "ReviewID": "UR125900664", "Content": "Stayed here for 4 nights and the hotel was spotless, small rooms, TV, balcony, good wifi, hairdryer etc. Pleased i stayed here. No fridge and safe in room has a charge. Looks like a new apartment is about to be build next door which could cause a lot of noise very soon.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Marseille, France", "Title": "“Good hotel, courteous service.”", "Author": "jonnym127", "ReviewID": "UR125720942", "Content": "Clean, well kept hotel, and courteous staff. We stayed for six nights, the hotel was between two metro stations which made it easy to go easily around the city of Madrid. The rate was reasonable, about 86 euros a night for two in a double bed. Very quiet area. The breakfast was not included, and was not worth paying 5,40 euros per person because the quality of a good breakfast was not there.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Alford, Lincolnshire", "Title": "“Good Value Hotel”", "Author": "JamesV92", "ReviewID": "UR125459109", "Content": "This is a good value hotel, in a good neighborhood in Madrid. I stayed here because it only cost €60 and was an affordable option when going to watch Real Madrid at the Bernabeu. The hotel, though right in the centre of the city, is close to two metro stations - Quevedo and Iglesia, which offer quick links to the airport and all major attractions. There is a good supermarket and other shops nearby as well as a reasonable choice of restaurants. The room I stayed in was of very high quality and the bed very comfortable, I was particularly impressed with the quality and cleanliness of the bathroom.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salamanca, Spain", "Title": "“Hotel en Chamberi”", "Author": "supersabio", "ReviewID": "UR123698270", "Content": "This hotel is situated at 50 metres from the Plaza De Olavide, one of Madrid's hidden treasures, whose surrounding streets are full of delightful bars and restaurants.The hotel is very close to two metro stations. The hotel is very well managed, from the welcoming and helpful reception to the well equiped rooms.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Coventry", "Title": "“Good Hotel in Downtown”", "Author": "EngineerCoventry", "ReviewID": "UR120299080", "Content": "Small rooms but really clean and modern, about two minutes walk from two metro stations. Only one English channel on TV, CNN, staff were friendly and helpful, but the noise from adjacent rooms did disturb me occasionally and you pay €1 each time you use the room safe which can become expensive No service apart from breakfast in the restaurant at weekends, but there are plenty of good cafes nearby. Would stay there again.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Cheap hotel in Madrid downtown”", "Author": "igorek", "ReviewID": "UR119813762", "Content": "One night stay: only to sleep. Was amazed by expedia.com special rate of $57 including taxes (no breakfast). Clean, simple decor. Nice, friendly, knowledgeable staff, was escorted and shown the room upon arrival. Free wi-fi, though rather slow. Small room ~130-150 sq.f. The only one drawback is paper thin walls. I had earplugs and you may need too. Great neighborhood with lot of bars/clubs etc. couple minutes from subway.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Rocky Point, New York", "Title": "“very modern and clean”", "Author": "irisheyes67_11", "ReviewID": "UR119638495", "Content": "Stayed only for 1 night but the hotel is in a central location. Very clean,modern and staff was friendly. However, they are not too fluent in english. Downstairs hosts a cafe with basically a continental style breakfast. Hard cooked eggs,jamon,salami and cheese. A few pastries and toast. Coffee is amazing! At this time in 2011 price was about 6 euro. The baths were large and clean and modern. Same for the beds. Free WiFi was a plus.", "Date": "October 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Mysore, India", "Title": "“Small and Clean Hotel”", "Author": "Selvakumar1971", "ReviewID": "UR115378390", "Content": "Small room and bathroom, enough for me as I was on a business trip, very clean with a balcony, helpful staff, free internet, close to the metro and walking distance to many good food places, taxi is available as you step out of the hotel entrance,", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Very helpful and friendly staff”", "Author": "KKatherine", "ReviewID": "UR115376720", "Content": "We arrived off an overnight bus and got the first metro into town hoping to stay at the Ibis. The staff there were really rude, unhelpful and uncaring, quoting us a higher price than we had seen on the internet and saying there would be no rooms available for hours. So we walked around the area until we found this hotel and a lovely helpful man on the desk who invited us to sit in the foyer while he tried to organise a room that we could use as soon as possible. After less than a half hour wait we were in a lovely clean comfortable room. There was free wifi available in the room and a lovely bath and it was a really great last night in Spain The man on the desk was helpful every time we needed anything and in the morning wished us all the best and said goodbye as if we really had become friends. So different from the Ibis experience We didn't use the restaurant simply because we were either out or sleeping!", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Lethbridge, Canada", "Title": "“Low risk of having problems”", "Author": "walter6504", "ReviewID": "UR114791923", "Content": "We stayed for 8 nights. Good points: clean room, room is spacious, bed is in good shape, wall-mounted LCD TV, free Internet, good air conditioning, desk w/ chair in room. Bad points: (1) guest directory says to call 24/7 for free coffee/tea brought to your room. When I called the desk manager told me to go to the snack bar when it opens. I am one of those people who really wants coffee 1st thing in the morning. Bummer! No way of making coffee/tea in room. (2) Weak English ability among staff, making communication a bit difficult for those of us who cannot speak Spanish. Other info: (1) snack bar on bottom floor. Coffee is 1 euro/cup. (2) Location not in city center but in more residential area which we liked. We found a coin laundry mat a couple of blocks away. You are about a 4 block walk from three different Metro stops. (3) plenty of services in area like hair salons, restaurants, grocery store. (4) not a good location for a jogger.", "Date": "June 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“A very good hotel”", "Author": "Freebornade", "ReviewID": "UR106402136", "Content": "I have used this hotel on a monthly basis for the last three years. I usually stay for five or six days. I work close to the hotel, so it's very convenient. I really can't complain. I've stayed all over the world, and of it's type, at the price you pay, it's an excellent hotel. The staff are always helpful and friendly. The rooms are always very clean The wireless internet is now free, and works well. The breakfasts arent five star. But you wouldn't expect it. It's self service. Very informal. They have variety and you can eat as much as you like. The best rooms are on the 6th and 7th floors..I usually stay on the 7th. They have good balconies. They've recently been refurbished with flat screen TVs etc. There can be noises from the street. So usually, the higher rooms are better. There are a few rooms without windows, facing inwards, which are very quiet. In general, the noise isn't a problem, with Friday and Saturday nights being worst. This is a problem with most Madrid hotels, so don't let that put you off. Overall, I'm happy here. And I'm sure you will be too !", "Date": "May 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vienna, Austria", "Title": "“Value for money, good option in Madrid”", "Author": "schaefer1010", "ReviewID": "UR89416588", "Content": "The Trafalgar is loceated in Chamberi, one of the best residential areas of Madrid, close to a nice plaza. Three metro stations are within walking distance and lots of restaurants and bars arround. The rooms are basic but clean and efficiently equipped. Dont expect too much from the breakfast, the coffee is terrible, better take one in the bars arround. The only thingthat could be complained is the small lift for too many persons.", "Date": "December 9, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Nice hotel, great location for the right kind of traveler, lovely service”", "Author": "funonaboat", "ReviewID": "UR84806984", "Content": "We really enjoyed our stay at the Hotel Trafalgar. The rooms were nice and clean, and the people at the front desk were really nice and helpful. Our favorite part was the location, which is a little bit away from the mobs of the tourist center and afforded a relaxed, leisurely vibe to the whole trip. The beds were not the most luxurious ever, but we slept well enough. Only bummer was the 4 euro charge for wireless.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“This hotel provided great value and excellent service.”", "Author": "michaelpom", "ReviewID": "UR81600142", "Content": "Upon arrival, the very diligent porter carried my cases to reception and after check-in also took them to my room. The room and bathroom were clean, well appointed and comfortable. The room had a balcony, which looked onto a relatively quite street. The day was very hot, but the airconditioning worked effectively. Internet connection was available at reasonable cost and worked well. Breakfast was included, and the overall cost (€82) was excellent value.", "Date": "September 30, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“ok”", "Author": "MaraF", "ReviewID": "UR57029727", "Content": "Nice hotel, with good facilities and near to the main access to the city centre.", "Date": "February 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great value for money”", "Author": "Canonica", "ReviewID": "UR30225244", "Content": "I paid just over €50 per night for a single occupancy room. It was perfectly clean and comfortable and surprisingly had a deck the same size as the room. If you're just looking for a base to stay in Madrid and don't intend on spending much time in your room I would certainly recommend this. Also, the area around the hotel is very interesting, and if you're just sightseeing for the weekend will ensure you see beyond the main sights of Madrid.", "Date": "May 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "houston, Texas", "Title": "“best value ever - fabulous hotel - rooms - personnel”", "Author": "wendymar007", "ReviewID": "UR28512031", "Content": "Couldn't have asked for a better place to stay. At the end of the street, a children's park surrounded by Tapas bars of all varities - safe, friendly neighborhood. Close to subway. Walking is what you do there and we walked everywhere with easy to read hotel map. Caffeteria breakfast better than bar around the corner and free. Rooms surprisingly large and clean, appear recently remodelled. Openable windows for fresh air. Elevator for convenience. Stayed in same room for a month while in Madrid and also touring around Spain.", "Date": "April 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "north wales", "Title": "“A review by a visitor from UK.”", "Author": "johndnorthwales", "ReviewID": "UR16429367", "Content": "Have used this hotel on five visits to Madrid in three years & am due there again in August. I find the rooms clean & well provided although CNN (as the rival TV English-language channel to BBC World) is positively pathetic & repetitive. You should go for a room with an outside view - my worst room faced over a back yard, was tiny but the bathroom (again small) was the one redeeming feature as they are well fitted. The rooms have been of good size for a single visitor - you can always ask for a larger. Breakfasts you get used to as a continental snack - service always polite/helpful & you can always get seconds. Well situated for walking and shopping and not too far from tourist areas by metro/bus/taxi. Will always have competitive rivals if you have more money to spend.", "Date": "May 27, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "United Kingdom", "Title": "“A small, old, dusty, penny-pinching hotel”", "Author": "Pinky_and_Brain", "ReviewID": "UR15225167", "Content": "Even if you find what seems like a cheap rate at the Trafalgar, do yourself a favour and take your money elsewhere where it will get you something larger and more modern and comfortable at the same price. There's a HUGE choice of hotels in Madrid (many of them very new) so wasting your cash here is madness. ROOMS: I stayed on the top floor in a small room that looked like the furnishings and doors hadn't been changed since the late 70's or early 80's. Everything looked old and very worn out. There was dust on the floor in the room and in the bathroom, which was never swept away for the nights we were there. -No mini bar -No tea or coffee making facilities, or ironing board -Television had only 1 non-Spanish channel -The telephone had an enormous amount of static when I used it to speak to reception. I could hardly hear what the person was saying to me. -You needed to pay 1 euro to use the in-room safe ! So, what that meant was that every time you needed to open the safe (to get your mobile phone or digital camera or passport) you would have to pay again (and again, and again) to close it !!! The only good thing about the room was that it did have a balcony which was nice...watch out for the low railing if you suffer from vertigo or have hyperactive children !! Perhaps the rooms below the top floor were in a better state but from the brochure photos it doesn't look like it's much improvement. COMMON AREAS: -Reception consists of a small desk with no more than ONE member of staff on duty at most times. (Be aware that almost ALL hotels in Spain always will ask you (and often, but not always, anyone else staying in the room with you) for your passport, identity card or driving license.) -Room keys are still the old metallic type, which need to be left with reception whenever you go out of the hotel during your stay. -The common area carpets looked quite dirty -The lift (elevator) is small and has buttons and decor from the 1970's -Hotel brochures and website says the hotel has a bar - but this is very misleading as it is part of the basement breakfast area and is NOT open in the evening. -I sent the lady on reception into meltdown one evening when I asked for a glass and some ice . She needed to call the security man to go downstairs into the bar and get me one and gave me the ice in a plastic bag which you usually find in hotels for dirty laundry. The plastic laundry bag was new and clean but is that any way to hand a paying guest some ice over the reception counter ???!!! BREAKFAST: Breakfast is served in the basement in the \"bar area\". The inclusive breakfast service and food on offer was as cheap as you can get. -Only ONE member of staff runs the whole operation from behind the bar. -The cutlery was just thrown in the centre of each of table (on the cheap paper placemat - the kind you get on a MacDonald's plastic tray) without putting the cutlery straight in any form. -Each person gets only ONE coffee and ONE orange juice IF you ask for one from the barman running the show. -Much of the \"buffet\" consists of cheap supermarket plastic wrapped cakes -The rest of the \"buffet\" is bread, croissants, cheese and salami - that's it ! -The breakfast area has a SECOND entrance up a flight of stairs onto the street for the general public !!! This means that while you are eating breakfast, people who are not staying at the hotel come down the stairs and sit at the bar to order coffee and sometimes start smoking too ! I have never heard of a 3 star hotel doubling its guest breakfast area as a bar to the public ! This shows you how desperate they must be for cash ! LOCATION: Hotel is located on a street corner away from the tourist areas of Madrid in a residential quarter of the city. It's more or less midway between 2 metro stations - one is \"Quevedo\" on the Red coloured metro line number 2, and the other station is \"Iglesia\" on the turquoise coloured metro line number 1 which will take you directly to the city centre station of \"Sol\". You'll have to take the metro or walk for 10-20 minutes before you find any restaurants in the evening. The quiet, safe location has to be about the only good aspect of this place. As you will have probably noticed (if you've been to Madrid before or have been reading the Tripadvisor reviews for most hotels in the city) Madrid is a very noisy city 24 hours a day. You will get a quieter room here (as far as outside noise is concerned) than most other hotels in the city BUT you still have some traffic to deal with, and the very annoying artificial bird chirping noise the traffic light makes when it goes green for pedestrians (which it does every 2 minutes or so) ! ON THE 3 STAR RATING OF THIS HOTEL If you needed any more proof that the star rating system for worldwide hotels is utterly worthless (as a general guide for travellers of what standards to expect) then look no further than the Best Western hotels of Madrid. The Best Western Trafalgar claims on its website and brochures that it is a 3 star hotel. It's not... by any standard. Giving it 2 stars, or even one and a half, is way more accurate... ...and yet ! In contrast, one (of many) of the Trafalgar's best western sister hotels (also in Madrid) the Best Western Atlantico on Gran Via (which we also stayed at - see my other review for a full comparison) is ALSO classified as a 3 star property ! But the 3 star Atlantico is of a 4 to 5 star standard in an early 20th century high rise building with larger and diversely decorated rooms, more staff, better services, and an excellent ALL-YOU-CAN-EAT-AND-DRINK breakfast buffet which is amazingly cheap. (Without limiting you to one orange juice, one coffee and plastic wrapped cakes like the Trafalgar) How can these two properties be in the same hotel chain and be both classified as having 3 stars when they as different as night and day ?!?! To top it all off...I cannot believe that even the \"Lonely Planet\" Madrid City 2006 guidebook recommends this place. With so much choice in Madrid for hotels of all classes how could they recommend this small run-down throwback to the 1970-80's??!! (As a side note I found the 2006 Madrid guidebook full of errors. I usually trust Lonely Planet guidebooks but this time it was full of outdated information and blatant errors.) During my stay in Madrid we also were in the Best Western Atlantico and The Holiday Inn. Both hotels which we have also reviewed on Tripadvisor under this username and can recommend without any hesitation. Save your money and do yourself a favour and stay away from the Best Western Trafalgar. ----------------------------------------------------------------------------------------- GENRAL TIP ABOUT PAYING FOR THINGS IN SPAIN Be aware that many retailers in Spain will ask you for your passport, identity card or driving license if you pay for something with a debit or credit card. However, I managed just with a photocopy of my passport so keep this mind if you don't want to risk losing your ID by having it with you all the time. ...", "Date": "April 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Ithaca, NY", "Title": "“Friendly Staff, Great Location”", "Author": "Al-Burj", "ReviewID": "UR5942960", "Content": "This hotel is in a safe, clean, neighborhood in Madrid. I had a single room with an ensuite bathroom. By American standards this room would be considered tiny. From my travels around Europe this type of small room for single travelers is very common. Besides being small, the room was very nice and the bathroom was large enough and very manageable. The best part of the hotel was the staff. A woman with long dark hair was at reception when I checked in. Much to my relief she spoke English very well since she lived in New York City for a few years. In addition to speaking English, she was very friendly and helpful and was able to direct me to my bus the next day, where I could buy stamps, the nearest internet cafe, places to get food at a good price, etc etc... The included breakfast was pretty standard fare, but the quality of the items was pretty good. For the price I paid I was very happy with this hotel and will probably use it again the next time I am in Madrid.", "Date": "October 11, 2006"}], "HotelInfo": {"Name": "BEST WESTERN Hotel Trafalgar", "HotelURL": "/ShowUserReviews-g187514-d232808-Reviews-BEST_WESTERN_Hotel_Trafalgar-Madrid.html", "Price": "$72 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Trafalgar 35</span>, <span class=\"locality\"><span property=\"v:postal-code\">28010</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "232808", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c1/7f/c17faa1e9829a3fb339f6deed895732c5large.jpg"}}