{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“what a shi....hole !”", "Author": "Swiss_traveler_70", "ReviewID": "UR127883688", "Content": "Awful the worst hotel EVER !!! First impressions count ! upon arrival ! Hole in the door, mattress was like a trampoline, curtains nailed into the wall but did not close in the middle, room was dirty, hair on the floor, hair on bed, a bogey inside the bed sheet (a souvenir from the last guest). We were upgraded to the suite on the 5th floor (yeah right), a better room who had wires coming out of the wall, 2 broken camp beds with springs on the floor, and a funny smell. At least the curtains closed :) oh yeah forgot to mention, when i told the funny guy at reception about it he was not shocked or surprised about the services provided. I do not recommend it at all !!!", "Date": "April 14, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Santarem, Portugal", "Title": "“A good hotel in a very good place”", "Author": "Andreia R", "ReviewID": "UR127857574", "Content": "I stayed there with some friends and we were pretty impressed with the quality of that place because we've read some bad reviews before we booked the stay, and ended up thinking that it was a good choice to stay there. I think the only bad thing was that the staff was not very polite: they even had the nerve to scream at some of my friends. On the other hand the rooms were always very clean and tidy. We always had hot water and clean towels. The breakfast included is modest but also good: we had milk, juice, coffe, (great) croissants, regular bread, jams and butter. I also have to say that it is a very quite place, good for those who want to rest. Because it is near the termini station, it was very easy to catch the bus and subway, and that's so helpfull you cannot imagine. Overall I have to say that I recommend this hotel, but only if you are looking foward to not spending much and willing to stay in a modest place.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Greenwich, London", "Title": "“Good base for couple or family on a budget”", "Author": "butlen", "ReviewID": "UR127575189", "Content": "The hotel is a bit tired, but the staff were friendly, water was hot, very quiet room and clean. Its not a modern hotel, but for the price in the middle of a major city I'd say it was worth it.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Barry, United Kingdom", "Title": "“You get what you pay for”", "Author": "DoctorH30", "ReviewID": "UR124492639", "Content": "Central location, but shabby rooms. 'Breakfast' is coffee, rolls & jam. Fine if you want to be near the station, go sightseeing, and crash out when you return, but the discerning would do better to spend a little more and stay in one of the better hotels just round the corner in Via Carvour. Overall loved the short trip to Rome, saw most of the main sights, and even managed to take a train ride to Florence and Pisa. Got a bit fed up of touts trying to sell me guided tours of attractions that are either free or cheap to enter, the guys who won't take no for an answer if you don't want to buy a rose, or a photo, or an umbrella, or a tacky souvenir of whichever monument you're at, but am getting resigned to dealing with that more and more wherever I go these days. Just such a shame to have to.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Melbourne", "Title": "“Underwhelming in most regards”", "Author": "PabloNeo", "ReviewID": "UR119250856", "Content": "Other than a couple of exceptional cleaning staff, the whole experience was underwhelming. Breakfast is a complete waste of time and the rooms at best could be described as functional. Bathroom was slightly better than the quality of the hotel room itself. The hotel was excessively warm and airconditioning in our room barely functioned. Yes, it turned on and made some meagre attempt at cooling the room but was clatteringly noisy which would keep all but deep sleepers awake I'm sure. Nothing of any real note would entice us to return.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Sydney", "Title": "“Not the ideal holiday stay...”", "Author": "Tahlia M", "ReviewID": "UR119172765", "Content": "Definitely not the place to book if you're looking for a decent hotel experience. The lift was absolutely tiny and didn't fit all our luggage, so my brother had to carry half of it up four flights of stairs. Staff at front desk seemed disinterested, and were not very helpful. The shower spurted water all over the place and was a ridiculous contraption to try and use! We were there for five days and didn't get a single hot (or even luke-warm) shower. I also ended up getting sick and when my mum tried to call the hotel from Australia, to pass on a message to me, they refused and hung up on her! The only good thing was its proximity to the bus and train terminal.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Quisisana hotel rome”", "Author": "Rose C", "ReviewID": "UR119140794", "Content": "The front entrance was nice but as we got to our room we were quite hesitant. The elevator barely fit us along with our suitcases.!!! Porter appeared slightly intoxicated...the people in the next room as we were leaving to check out said they had bed bugs...we were grossed out as we thought maybe they were in our room also.....as we left they asked for money (ones sitting at front desk) ..hotel located in a 'shoddy' area close to the termini...told we had to park our car so far away & pay...not true...we came late at night and got a spot right infront of hotel & did not have to pay....scammers", "Date": "October 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "St. John's, Canada", "Title": "“Ants & Mould!”", "Author": "ckearney78", "ReviewID": "UR118660672", "Content": "Please don't book your stay at this hotel....the only thing good about it was it was a 3 minute walk from the bus terminal. For starters, the first room we were given had ants crawling around on the carpet. We immediately asked for another room without carpet. This room had mould on the walls and water leaking from the air conditioner that was mounted on the wall above the door. Everything was sticky and we just felt dirty there. When taking a shower, water leakedf from out of the wall adjacent to the shower. We had to use up every towel we had! The shower curtain was full of mildew as well. We had a 13\" tube t.v. that didn't work properly....the list goes on and on... Nothing is upkept. The ruins at the Forum were in better condition than our hotel! Breakfast was no better. To drink, all was offered was tea, coffee and lemonade (not fresh but the kool-aid kind with sugar and water), croissants from out of a box, buns, and cornflakes.", "Date": "September 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Horsham, United Kingdom", "Title": "“Good for overnight stop”", "Author": "Roy T", "ReviewID": "UR117072331", "Content": "The hotel was good if you only require somewhere for one night stay. Though the hotel is basic, the rooms were clean, the staff were welcoming and friendly. On the down side was that the breakfast could have been a bit more adventurous.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Castellon de la Plana, Spain", "Title": "“We paid for a hotel and we slept in a B&B. Very impertinent.”", "Author": "mage_11", "ReviewID": "UR115948798", "Content": "I booked a double room for 4 nights in this hotel and, when I arrived, the receptionist told me that I had to sleep in another \"hotel\" opposite the Quisisana Hotel because the air-conditioning was broken and some refurbishments were being made in the rooms. I complained, but they told me it was the only option... So I stayed in the other \"hotel\". I was dirty, with unpainted walls and dark. The rooms were alright, but they had nothing to do with the ones of Quisisana Hotel on the web. The following morning I went to the Quisisana to have breakfast and I realized that the air conditioning worked perfectly well and that the dining-room was full of guests from very different nationalities. I complained once and again, but I did not have any solution. I was alright in the B&B, but it was not for what I had paid. The guy at the reception was impertinent and rude, since he did not even try to listen to my complaints, claiming he did not speak Spanish, nor French, nor English... NOR ITALIAN!!! He just did not want to listen to us. He said to me that all the Spanish want to sleep at Quisisana and that's why they don't have any room left and they have to place them in the B&B. So, in the end, I had to believe it was a matter of racism rather than because of a breakdown... I got so disappointed. I could not believe what that man told me. That was super rude!", "Date": "July 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Middlesex", "Title": "“It's a base centrally based, but don't expect much”", "Author": "Ruthy75", "ReviewID": "UR109490569", "Content": "The reception area is well presented and the staff appear friendly enought. There was an initial hiccup with the room as they originally couldn;t find the key to the room then they offered us a double instead of a twin, but his was easily resolved.. \\the room was clean and beds comfertable enough, the t.v was broken and there was only one light in the bedroom, and no bedside lights, and there was no shower curtain. A piece of advice for any future guests take your showers early cause the water soon gets cold. Breakfast is a choice of rolls, sweet soft rolls (in a packet) and some stale tasting cereal. they offer long life milk and a weak pot of tea, also a packet of biscuits. Plus points is its very close to the main termini, so getting around is very easy, but beware the area has a lot of homeless people after dark. If you want somewhere cheap, band asic to stay this is your place, but don't expect much more and you won't be dissapointed.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Old and need some works done”", "Author": "littleanna777", "ReviewID": "UR109243787", "Content": "The hotel looks nice on the pictures, promising lovely spacious and clean rooms. Our room was tiny, it was clean, but very old and wallpaper was covered in spots and dirt. Breakfast was a joke, one old bread roll, as hard as a brick and a croissant which was chewy and not very nice. We only came for breakfast once as decided to stay in bed after. Overall the hotel was okay for 3 nights on a budget, location is quite dodgy, near the train station, but close enough to walk to Coleseum and centre. Reception guy was nice, even though he charged me 5 euro for the Internet which only worked for half an hour.", "Date": "May 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“You get what you pay for”", "Author": "constrictor12345", "ReviewID": "UR103987400", "Content": "Not clean, not dirtty. adequate for somewhere central to sleep and shower whilst exploring Rome. Skip the breakfast option if you can, very basic with better food and coffee available in cafe's 100m away at reasonable cost. Staff ok and helpful", "Date": "April 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sofia, Bulgaria", "Title": "“Great location,simple,cheap and clean!”", "Author": "Staneva", "ReviewID": "UR97178431", "Content": "Very nice hotel,with great value .Quiet place ,very clean room,polite stuff.For me end my family that was the right hotel!Great location and good price!", "Date": "February 19, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“What a Dump!”", "Author": "TheHotelAfficianado", "ReviewID": "UR88826945", "Content": "Terrible experience....if location is the only thing you are looking for...then this is your place. If you want a good night's rest, a decent meal in the morning, a staff that is helpful...then search elsewhere. The bathroom never got hot water, the toilet was right under the sink -- so you couldn't even go to the bathroom in comfort, the windows never shut properly and all you heard was NOISE from the outside street below...and you were freezing because of it. The wallpaper was coming off the walls, the bed sheets had hair from another person's visit, the bathroom door did not have a knob to shut it properly, and of course there was no room to put your luggage anywhere. Very small accommodations. I could go on and on...but I think this picture presents itself. I jsut wish I took photos so you could see for yourself...I just did not want to remember what a dump it truly was! If this had been in the US, it would have been condemned a long time ago.", "Date": "December 2, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Rome, Italy", "Title": "“abbiamo trovato bastanca bene”", "Author": "nuru_10", "ReviewID": "UR79131216", "Content": "I like the hotel because its very close to station,from here we can vist all of manuments in center of rome very esily with tram, bus also subway line at the same time it very convenient to go airport with tran,I think if any one want to enjoy the city he can be choesd above hotel.", "Date": "September 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Madison", "Title": "“Disappointing, smoky and not terribly clean”", "Author": "Fairw00d", "ReviewID": "UR76887745", "Content": "Stayed here with my extended family in three rooms. Two reeked of cigarette smoke. We were offered Glade as an antidote. Breakfast was horrible--stale corn flakes, overly sweetened croissants in a plastic wrapper. There were ants on the breakfast table. My father's room did not have hot water. Staff helped us book a tour...very nice but a fountain of misinformation. Tour was hard to find at the Vatican. Etc. We chose it for proximity and it is very close to the train station.", "Date": "August 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cambridge, Canada", "Title": "“Wow! Great hotel, great service, great location”", "Author": "BethlovesRome", "ReviewID": "UR66948802", "Content": "The client care at this hotel is phenomenal. It is very honest, very safe, very personal. It is a very close walk to the termini and the metro - about a 2 minute walk if you leave the termini by the correct exit - the termini (Metro) is a great way to get around. Many of the famous places you will want to see are within walking distance. The staff are a great help with what to see and where it is. The hotel is very clean. It is old and the rooms are small but certainly adequate. The hotel is charming. We will definitely always uses this hotel when we are in Rome.", "Date": "June 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tipperary Ireland", "Title": "“Very helpful staff”", "Author": "kazTipperaryIreland", "ReviewID": "UR66343757", "Content": "Just home from Rome, the best thing about this hotel was def the staff very helpful and friendly. they couldn't do enough for us. Ive read the bad reveiws they are totally not true yes of course the rooms are old you are in Rome everything is old ,yes they could be modernised a bit. as for the Tvs not workin I didnt even turn ours on again your in Rome! why would you watch TV. The computers are not fake the guy at reception even checked locations for us on it. One bit of advise would be not to expect too much its value for money. the location is excactly where the say it is just around the cornor from Termini. so thanks to Sam and all the staff had a great holiday. karen n Michael", "Date": "June 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“VALUE FOR MONEY”", "Author": "asifwarsi", "ReviewID": "UR64864039", "Content": "\"I think the Hotel was fantastic.... ITS 3+ Star, almost 4 star...the hotel's location was fantastic... Overall the hotel was pretty good.\"", "Date": "May 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "South Yorkshire", "Title": "“great hotel,great location amazing staff,simple and clean”", "Author": "Gemma123046", "ReviewID": "UR64852162", "Content": "I stayed in this hotel on the 13th May 2010 for 3 nights, i travelled with my partner,parents and younger brother. We had a double room and a triple room. The rooms were very clean and this was the same throughout the hotel. The breakfast in the morning was very satisfactory and the staff are amazing. They are so helpful and couldnt do enough,whether it be securing your valuables or giving you advise or directions around this amazing city. The hotel is literally minutes away from the terminal station. There is ample resatuarants in the area with very reasonable prices. Great hotel ignore all the other review, if you just want a simple hotel that is clean in a great location this one ticks every box. Great value for money and i would definitely stay here again!!!!", "Date": "May 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Atenas", "Title": "“Worst Hotel Ever|”", "Author": "Tolislaura", "ReviewID": "UR52642204", "Content": "Worst Hotel Ever!!!!!!!!!!! It should be a Hostel or a 1 star Hotel. Definitely not a 3 star hotel!!!!! Everything is image. Even the reception has fake computers! The rooms are old, the building must be at least 50-60 years old, the breakfast is ridiculous, all TV´s are broken or not tuned (and we are talking about 20 year-old tv´s), furniture in the room is not only old but disgustingly dirty, when you have a shower you wake up the whole corridor (and the same when any other guest does!!!), hot water takes about 15 minutes to arrive!!, and humidity is all over the walls.", "Date": "January 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "wales", "Title": "“central and staff helpful”", "Author": "Alison65", "ReviewID": "UR46444660", "Content": "Rooms slightly dated, but clean and bathroms clean with good shower. Breakfast basic but as mch as you wanted. Good restaurants around the area and saved taxi form airport. Good size room whic i did not expect in rome.", "Date": "October 10, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "australia", "Title": "“Very poor hotel”", "Author": "happywearytraveler", "ReviewID": "UR10004894", "Content": "My husband and I stayed at this hotel in August of this year, and I have to say it is the worst hotel we have ever stayed in! We came across this hotel by chance as it is near the station. When you walk in the lobby looks very nice, but when you get upstairs it is a completely different story, the whole building is in a state of disrepair. We had to look at three rooms before we could find one that we were prepared to sleep in The receptionist takes payment fot the room upfront so that you can't walk out when you see the rooms! In my opinion the lobby is set up to look lovely to hook unsuspecting travelers. We would never stay at this hotel again.", "Date": "September 25, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "staffs", "Title": "“not as bad as some suggest”", "Author": "ewar166", "ReviewID": "UR8822837", "Content": "found the hotel to be not as bad as some reviews on this site suggest ,the room was clean and tidy. . where there were a few issues was the bathroom , toilet seat broken but this was soon replaced with a new one . shower curtain was mouldy towards the bottom but again this was replaced with a new one. staff were friendly. . . i wouldn`t call it a 3 star hotel but it does its job.", "Date": "September 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“I'll stay here again!”", "Author": "No1Fox", "ReviewID": "UR8120412", "Content": "Found this hotel by accident after leaving horrible B&B after just one night. For same (cheap) price, got quiet large room with air conditioning and breakfast was included. Breakfast choices were reasonably good. My friend said the coffee was the best she'd had the whole trip. Let us leave luggage in early morning when we arrived. Very friendly, helpful staff. Allowed us to eat early when we had to leave early for tours. Located near main train station. Told us how to find Bus Shuttle which goes to airport. Plenty of restaurants nearby. Shower was \"in tub\", but no shower curtain or door - no my preference, but OK under circumstances. Had the best light-resistent windows I've ever seen. Had a nice quiet room with comfortable beds!", "Date": "July 15, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "San Juan", "Title": "“Absolutely, the worst hotel in Rome if not in Europe”", "Author": "SinceroSanJuan", "ReviewID": "UR6809364", "Content": "I want to share my story about this hotel by copying the letter I sent to Cheap Tickets which is the company I used to book this hotel. This could have been the worst experience in my life since I was traveling with my wife and daughter and we had planned this vacation for one year. Thank God we found another Hotel after the first night. After this experience, I called Cheap Ticket pleading for a refund but nothing happened. PLEASE, PLEASE, don't stay at this hotel. You could do much better at any other hotel. The following is copy of the letter .... I'm a very frustrated and dissapointed custumer. I booked this hotel since february of 2005 for three nights. I checked in at the hotel Quississana on june __, 2005 and it was a nightmare since day one. <the room was filthy, shower didn't work, doors didn't close properly and they even had insects inside the room. We asked for other room but the ones they had were the same. I had to stay the first night (june __) because i had no other option (other hotels were full). Luckily i find another hotel (Hotel gioberti) for the second and third night. I told the manager (Mr. Fabricio) that i wanted credit for these two nights and he said there was nothing he could do and that the only thing i could do as to call Cheap tickets regarding this issue. I'm very very frustrated about the whole thing and feel totally unable to do anything. I hope you can help me to get a refund for those two nights because i paid a lot of money ($784.94) and i only got a nightmare for it. Actua! lly, i found ou that the hotel rate was only from 90 to $100 a night and i ended up booking it for almost 3 times that. PLEASE, PLEASE help me !!! I want to stay a customer of CHEAP TICKETS but need your assistance. I will be staying tonight and tomorow night at the Gioberti (tel. ____________) room 220 (i think that's the room number,if not ask for Rafael _____ and Angela_______ which is my wife). I will try to call you tonight if i'm lucky and can find a good phone line connection. Thank you much .... sincerely ... Rafael ______", "Date": "February 18, 2007"}, {"Ratings": {"Check in / front desk": "2", "Overall": "1.0", "Location": "4", "Value": "1"}, "AuthorLocation": "holland", "Title": "“do not stay in the Quisisana hotel!!”", "Author": "SophiaHolland", "ReviewID": "UR6533770", "Content": "We stayed in the Quisisana hotel between christmas and new year. When we arrived, everything looked great, but when we got past the lobby, we were merely shocked.....the stairway looked like a stairway from a cheap youth hostel, cigarettes and empty bottles of beer were scattered all over the place. The room was even worse...the temperature was 30 degrees c. and we couln't do anything about it, because the airconditioning system (also heating) was broken. The windows had bars on them and the fact that our room was at the end of a small hall and the cigarettes, made us afraid that we could actually be trapped in this room in case of fire. There wasn't any warm water during our stay . Fortunately Rome is a beautiful city and we were captured by its magic, next time we will stay in another hotel!! (and check this website before booking a holiday)", "Date": "January 1, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Sydney", "Title": "“Worst Hotel Ever!!!!”", "Author": "Sydney1973", "ReviewID": "UR6344543", "Content": "My fiance and I had the unfortunate luck of staying at this dive of a place. Where do I start with all the problems: - lousy air conditioning - the beds were like trampolines - breakfast was a joke - poor attitude of the staff When I complained the staff were rude!! Avoid this hotel at all costs It is not 3 star - would't even call it 1 star!!!!!", "Date": "December 7, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Oxford, UK", "Title": "“Awful hotel”", "Author": "LAWDAC", "ReviewID": "UR5959674", "Content": "Please avoid this hotel at all costs. How on earth it is classed as a three star hotel I do not know. I have stayed in a far better 1 star hotel that charges the same price for three nights that the Quisisana charges for one. No wonder this was the only hotel left in Rome on our arrival. The quality of the rooms was very basic. On arrival the hotel looks as you would expect. Clean, marble reception. However, get past this and you will see it for what it really is - a dump. I feel well and truly ripped off spending a night here. Walking up to the rooms (the lift was incredibly tiny & slow) to the fifth floor you begin to feel as if you are staying in some filthy, run-down hostel, not a 3 star hotel this claims it is. Fag butts were littered up the stair well, graffiti covered the wood work in the lift area, holes in the celing. It is truly awful. Getting to our room was not much better. A wet stain in the corner of the room, no shower curtain in the bathroom. Overall it was shabby and I really believe the Quisisana should either be reclassed or they seriously need to shut this place and spend some money on it. Please do not stay here. We paid 160 euros for the pleasure. Never again.", "Date": "October 16, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Chesterfield", "Title": "“Slum of a Hotel!!!”", "Author": "CarrabianCool!", "ReviewID": "UR5579696", "Content": "We stayed at the Hotel Quisisana for a short break in Rome. It was supposed to be the most romantic weekend of our lives, as my partner proposed whilst on holiday. Rome was amazing, we enjoyed every second of our holiday, OUTSIDE of the Hotel. The photos on the website are a JOKE! Once you get past this staged lobby, it really does get considerably worse.. there was no carpet on the stairs, their was graffiti all over the walls as there looked to have been no wall paper for quite some time. There was electrical wires hanging from the wall where there should have been lamps, if you were lucky enough to find a lamp the shade was ripped. There was a gapping hole in the wall where the electric mains were kept, as well as other numerous holes. We only found this website by chance after booking for the Hotel Quisisana, we tried to change hotels but had no luck. After consideration we decided to give it a go. What a big mistake. The staff were unfriendly (we never did find out what time breakfast was, and became to afraid to ask!), the room had not been made from the last guests stay, so we had to ask the maid to clean it, the wardrobe and air con' was broken and the pipes of the hotel banged long into the night.... well at least we thought it was the pipes! It all became very amusing and it still became the most romantic weekend we have had. Rome is fantastic, but stay away from this hotel!!!!!!", "Date": "August 8, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Hull, East Yorshire", "Title": "“Possibly the worst hotel in Rome???”", "Author": "holidaysuitcase", "ReviewID": "UR5297658", "Content": "This 5 day trip to Rome was booked back in March 2006 for myself and my mum as a treat. We were highly looking forward to it having never been to Rome before. We had booked a twin room but on arrival discovered we had been allocated a double bed instead of two singles! We complained to the receptionist but were told that it was the only available room left in the hotel that night and to come back in the morning. The next day we were moved to another room which although did have two single beds, was in appaulling condition. The wallpaper was hanging off the walls, the door was unsecure and it was flithy. Breakfast was advertised as being of a continental style but we have never had such a lack of choice in any other European hotel we have stayed in. All it consisted of was cups of cornflakes (no bowls in sight!) and awful dry pre packed croissants. The coffee was also disgusting! The staff were all unhelpfull to us during our stay and non of our concerns were addressed. We would never stay here again and it should be avoided at all costs!!", "Date": "June 4, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Not for everyone, but if you need a place to sleep and a little extra, it's fine”", "Author": "A TripAdvisor Member", "ReviewID": "UR5145525", "Content": "Not a bad hotel, not a great hotel. It is officially a 2 star hotel, not 3 as was erroneously mentioned in another review. Close to major transport hub, but my guess is this would be considered a rather seedy location for some. However, if you planning on going all over, there is a straight shot to anywhere from the nearby Termini Station via bus, tram, taxi or subway. Plus getting to and from the airport is an absolute snap, with practically front door drop off. While the hand held shower is listed as an amenity, it actually is quite a pain. It would make sense for those with 3 arms, but for us normal folks, it's a bit inconvenient. The problem is that, it is exclusively hand held, i.e. no fixture which means a little bit of carelessness can send the water flow right into you change of clothes and getting clean while managing the shower head can be quite the juggling act. I'm not sure what they mean by satellite TV since we only had 3 channels. Not really a problem though because you're not in Italy to watch TV. Some of the staff were quite friendly and others a little grumpy. Tell your friends if they wish to contact you in your hotel room, Italian should be spoken. Otherwise you're liable to get hung up on. Don't expect a lot of English, but rather just enough to get you into your room and perhaps a glass of wine in the cafe. Though the night clerk will probably be asleep if you get back to your hotel after midnight, don't feel bad about waking him. He will let you in with a smile on his face. The phones have no direct dial to the front desk, so if you forget to leave a wakeup call before bedtime, you either make a local call to the hotel from the line(if you can figure out how to use it), or run down to the front desk in your jammies. If your planning on getting back late, esp. on friday or saturday, prepare for a little \"color\", as pushy prostitutes and drunken teens will be noticable, if not a complete spectacle. The included continental breakfast was delightful, and definitely worth getting up early for. They will give you American Coffee(an extreme rarity in Italy) or whip you up an espresso or capuccino if you ask. Italy is not known for inexpensive hotels but all in all, for the traveler at heart, the Hotel Quisisana is completely satisfactory, if a little overpriced. For someone who is used to being pampered and off your toes, you may want to look elsewhere.", "Date": "May 17, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Tennessee", "Title": "“Pathetic excuse for a hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3554536", "Content": "Hotel Reservations in the train station told us this was the only room left in Rome. They charged 160 euros for a 60 euro room. They made us pay upfront, which should have warned us. I've never stayed in a shabbier place. It was actually scarey. Trim ripped off doors and windows; trash in halls; lightbulbs missing; phone didn't work; dirty curtains and stained bedding; beds were just metal cots with foam rubber mats; air-conditioning did not work and we told them twice, but they just shrugged. This hotel makes Rome seem a scam.", "Date": "June 14, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Midlands", "Title": "“STAY AWAY!”", "Author": "David_T_Williams", "ReviewID": "UR2623196", "Content": "Shame we did not see the reviews before we went. Ignorant unhelpful staff, unsafe and unsecure rooms and associated areas. Looks like a refurb of 2 buildings opened up to bring it into one hotel started some time ago and they ran out of money. Absolutely filthy bedrooms, homeless people lodging on the top 2 floors, changed rooms twice. Have digital photos of evidence if wanted send e-mail to stevie2201@hotmail.com DO NOT BOOK HERE!", "Date": "October 6, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "york UK", "Title": "“Disaster waiting to happen”", "Author": "A TripAdvisor Member", "ReviewID": "UR2525299", "Content": "Once past the reception the illusion stops. Shoddy rooms, wiring hanging out of walls, broken windows, small side exit continually propped open, access for anyone. Do not be mislead into booking here, we were offered another room after 1 night, this had no plaster on the bathroom ceiling. This hotel needs some serious inspection by health & safety esperts urgently. Travel Agents now dealing with my compensation claim, if anyone wants photographic evidence please e-mail me.", "Date": "September 12, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "UK", "Title": "“A poor quality hotel”", "Author": "TrenthamUK", "ReviewID": "UR2316855", "Content": "Hotel Quisisana is described as a 3 star hotel with a number of room facilities. Close to the station it seemed like an ideal tourist hotel for our recent trip to Rome. The reception area was fine. The rest of the hotel was in a state of disarray as it seemed to be undergoing renovation. However, there were no apologies for any inconvenience or information stating this was the case when we booked. We felt in the way as we got grumps from staff if we wanted to use the lift (we were on the 5th floor) and they also wanted to use it (it only held 2 people). Not the friendliest of hotel staff. In the room, the TV didn't work, light bulbs needed replacing, the hairdryer didn't work, the shower (lovely hot water) had to be hand held, the shower curtain needed throwing away. We complained when the air conditioning broke down and although it was seen to, it hardly gave out any cold air. We went to the 4th floor to investigate what we thought must be a bar (as we heard music and chatter) but were told that it was a hostel. However, the bed and towels were clean and it provided us with some humourous moments - but we won't go back.", "Date": "July 23, 2004"}], "HotelInfo": {"Name": "Hotel Quisisana", "HotelURL": "/ShowUserReviews-g187791-d232836-Reviews-Hotel_Quisisana-Rome_Lazio.html", "Price": "$73 - $168*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Filippo Turati 45</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "232836", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/bd/8e/bd8ee4474f48e2f40cd77ac2facaf27f3large.jpg"}}