{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "lancs", "Title": "“lovely hotel”", "Author": "bigmanjoe", "ReviewID": "UR128240898", "Content": "On arrival was given a quiet room overlooking the piazza as requested by e-mail, very clean,large bed. Breakfast was plentiful ham (off the bone) delicious cakes, cereals, cheeses tea/coffee ample to start the day. Staff very helpful, the only negative is the fact that after a day walking in rome it would be nice to have a cuppa in your room, no tea/coffee making facilities in the rooms. We had a drink one night in the bar however, drinks were expensive, If they lower the prices and put a little background music on in the bar it would have a better atmosphere, and people would have a tipple before retiring.Staff very helpful and friendly. The hotel within walking distance to the termini 15mins, Barbarini Piazza/Spanish Steps/Trevi Fountain 20mins, however, Vatican 30 mins one way and Colleseum 30mins other direction. but much better walking than taking buses which get stuck in traffic you might as well walk. Felt very safe area and walking around at night was not a problem. Lovely gelato shop called CARUSOs just down the street from the hotel 2mins away benches to sit outside and eat your ice-cream with the locals. Will stay here again on returning to Roma.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Olympia, Washington", "Title": "“Great location, great hotel”", "Author": "leeomalleyring", "ReviewID": "UR128183684", "Content": "My wife and I stayed in Rome in March (great time for Rome) and picked the Hotel Londra and Cargill due to its location (a couple of blocks from the US and many other embassies). This was a great launching point for Rome at a very reasonable price. The staff was very friendly, the room was large and clean, and breakfast was included. Great restaurants and trattorias (sp?) are all over the place. If you're up for a good day's walk, you can pretty much cover everything from the neighborhood we stayed in. I highly recommend this hotel for its overall atmosphere, price, and location. Would stay there again in a heartbeat.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "St.Andrews, Scotland", "Title": "“A very pleasant stay!”", "Author": "Shinysides89", "ReviewID": "UR128100606", "Content": "First class service in this hotel - reception staff were courteous and helpful, and the breakfast staff ever ready to bring you a coffee of your choice. The breakfast was good (continental, buffet style affair), so make sure and eat your share before your day exploring Rome! The rooms are spotless, comfortable and very spacious, and due to the quiet location we slept soundly even with the window open. The hotel sits just on the outskirts of the Centro Storico, meaning it's within easy walking distance of the Trevi Fountain, Pantheon, Piazza Navona and Campo del Fiori. It's also within 5-10 mins from Repubblica metro station, meaning the Colosseum, Vatican and anything further afield are also very close! One slight negative was the A/C in our room either didn't work very well or not at all, hence the 4 star review. As said, the hotel is in a quiet enough area that you can sleep with the window open, but this will probably be a problem if you're travelling in summer - make sure and ask for a room with functional A/C. Altogether, a really great hotel, and wouldn't hesitate to go back!", "Date": "April 18, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "San Diego", "Title": "“Stay here if you're up for a gamble...”", "Author": "dgines", "ReviewID": "UR128029727", "Content": "I stayed here on four different nights under the same reservation. 2 nights of which, were in the same room. Every night was a different price, every night was different than the price quoted at the time of reservation.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Tampa FL", "Title": "“Didn't realize Londra means London”", "Author": "Ric S", "ReviewID": "UR127767885", "Content": "It took us a couple of days to figure out the reason why there were so many westerners hanging out in the lobby. If we wanted an English themed experience, we could have just gone to London. If I were a Brit, it would be the equivalent of me going to another country to stay at hotel Tampa, Florida. Don't get me wrong, there were no replicas of Big Ben, or portraits of the royal family to marr the experience. In fact, the decorations and furnishings were in good taste. What really matters is the location, service, comfort, and how many mini bottles of top shelf shampoo the housekeeping staff will provide before cutting you off. Four in our case. Not bad. Four stars is what we bargained for and four stars is what we got. No complaint there. Nothing too fancy, but nothing spectacular either. The staff were attentive and friendly enough, but I have to downgrade their transportation and tour knowledge. They were close but usually off a bit on most suggestions regarding venue hours of operation, and where to catch a particular bus, or train to get you places. But they ranked well above average for giving directions using their handy dandy tourist map. You don't really need their input on restaurants as they are everywhere and seemingly all good. You can get great service before 8, since Italians generally eat and socialize later in the evening. Prices vary but almost all have menus posted. And yes, it is possible to go a whole week eating almost exclusively pasta and pizza and not get tired of it. Bon appetite! The hotel is located in a relatively quiet mixed commercial/residential area on the eastern edge of historic Rome. A little away from the main sites, but not far enough to be a real inconvenience. We basically discovered you could practically and literally walk around Rome, and only require transportation to get places quicker. If you have two marginally operational legs and kneecaps you could better experience the flavor, sights, and sounds of the Eternal City by walking. NO HEELS LADIES! WOW! The first and only time we took a taxi (to the Vatican, most amazing BTW), the guy must have taken the really really scenic route, because it seemed after some experience that we could have walked the distance in almost the same amount of time. The weather was perfect in Mid March and all we needed was a light jacket during the early morning and evening. Highly recommend the direct transportation private driver service to and from the airport. Well worth the Euro. DO NOT take the metro (Termini) if you have more than a backpack, unless you want a real adventure. Rome is definitely for lovers. ENJOY!", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Excellent hotel, very helpful and friendly staff.”", "Author": "NeuroOrbit", "ReviewID": "UR127744232", "Content": "An excellent hotel, the staff on reception are very friendly and helpful. Rooms are nice, modern,clean and there is no traffic noise or anything to prevent you getting a good nights sleep. Breakfast is also very good, particularly the great selection of cakes and pastries! The hotel is well located near the Termini rail station, though its pretty easy to get around all of Rome just by walking.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Good Location, Friendly Staff”", "Author": "freedman121", "ReviewID": "UR127416141", "Content": "Stayed here for three nights with a family of four. The hotel is within walking distance to a lot of the main tourist sights such as the Spanish Steps and the Trevi Fountain. The hotel is located down a side street so it was pretty quiet at night. A lot of cabdrivers recognize the name of the hotel which is good too if you don't speak Italian. Overall a nice hotel, clean, and certainly functional - nothing very exciting or original, however.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Roquebrune, France", "Title": "“Good for Business trips”", "Author": "Draupnir", "ReviewID": "UR127298044", "Content": "As usual in Italy hotels are overrated, and Londra and Cargill confirms the rule. Hotel is clean, and rooms are comfortable however old fashioned, beds are ok and staff is kind and helpful, breakfast buffet is not huge, but with good quality cakes. Ask to the waiter for cappuccino.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Dartford, United Kingdom", "Title": "“Lovely hotel. Close to everything, but not down a busy, noisy street. Perfect location. Lovely staff.”", "Author": "Prudence D", "ReviewID": "UR127041494", "Content": "Hotel Londra & Cargill was in a perfect location in Rome. On the outskirts but not too far from anything major. Walking distance from the Vatican, Colosseum and all other main areas of interest. Staff are very helpful and friendly. Traditional Italian breakfast served at a reasonable time for early birds and those who like a little lay in. All in all a lovely hotel and would definitely return. €3 per person per night needs to be paid to the hotel when checking out. This is a fee they have.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh, Scotland, United Kingdom", "Title": "“Fantastic Hotel!”", "Author": "loopea", "ReviewID": "UR126820246", "Content": "We stayed in this hotel for 4 nights for the weekend of the Scotland v Italy 6 Nations match and I cannot fault it! It is a 10 minute walk to the Metro but if you arent prepared to do some walking then Rome isnt for you!!!! The bedrooms were spotless with fantastic huge comfy beds! The staff could not be more helpful. We made use of the hotel pick up and drop off service to the airport as well and I have to say it was worth the 45 euros! The driver showed us all the sights on the way to the hotel and gave us some good advice about being a pedestrian in Rome!!!! Breakfast was fantastic, loads to choose from, and the blood orange juice was divine!! Every night we would come back in from our evening meal and sit in the bar area and have a drink, and even this was made special by the gentleman working at the bar who would bring it to your table along with some little nibbles. Would highly recommend this hotel to anybody coming to Rome, and indeed if we come back, we will definitely stay here again! Thank you for making our stay so pleasurable!", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Just what you hope it will be”", "Author": "Peter M", "ReviewID": "UR126091661", "Content": "My partner and I are just back from a 4 day stay at this hotel and we have NO complaints whatsoever. The staff are polite, helpful and caring. The bedrooms are spotlessly clean with comfortable beds. The breakfast (don't know what other reviewers are going on about) was excellent with a huge selection of cheeses, meats, breads, fruit and cereals. The hotel is located in one of the smarter parts of Rome with lovely surroundings. Even in early March the trees were heaving with ripe oranges. The location is quiet, which is just what you want in Rome and yes you have to walk a bit but Rome is a city for walking as there is a fantastic find around every corner. We will SO be going back to Rome and will for sure stay at this hotel.again.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A great stay in a great, affordable hotel”", "Author": "Isabelrose", "ReviewID": "UR126085460", "Content": "I stayed here with my boyfriend for 2 nights. I got the room on a deal on last minute.com for a great price. The hotel is perfect! 10 minute walk from the termini train station so getting from the airport to the hotel is easy! A ten minute walk to spanish steps, 15 minute walk to trevi fountain. And not too far from other attractions. We walked everywhere (apart from to the Vatican where we got the metro from Spanish steps). Walking is a great way to see the beautiful city so we did not mind. The staff were all very helpfull and give u a very useful map on arrival pointing out how to get to all the attractions. The area is quite which is nicer I think then being in the tourist hustle and bustle. The bed was huge and bathroom clean. I would definatly come back here next time I go to Rome. Especially if u get a cheap deal on last minute.com. Very impressed. Our deal was 380 pounds for return flights from heathrow and 2 nights stay at this hotel for 2. Great deal!!!", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good hotel - average location”", "Author": "Krinkles28", "ReviewID": "UR125418275", "Content": "I wanted to give this hotel an accurate review based on service, cleanliness and affordability. It ticks all those boxes for sure. The rooms were clean and the staff were helpful. However, it is let down by the following: location, breakfast and the fact that smoking is allowed in some rooms. The location is about a 15 minute walk to the closest metro station and after a full day of sightseeing, the last thing you want to do is trek up the hill (especially at night) to get back to the hotel. It is also difficult to find in and of itself - especially when my booking confirmation told me it was on Via Veneto - it is not. The breakfast had too many sweet things (not for me that early in the morning) and not any hot food which would have been nice. There was cold meats and bread and cereal but not much variety. However, it was included in the room rate and you could find something to eat at the very least. Because smoking is allowed in some rooms, the smell drifts a bit but never came into my room so I guess that was fine. The staff were always helpful and friendly and it is clean and well presented so I would recommend it if you are looking for a cheaper hotel and don't mind not being centrally located.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Fantastic hotel in a stunning city.”", "Author": "Mmmeenu", "ReviewID": "UR125080715", "Content": "My review is very late, my mum, sister and I stayed here for a week last August, but now that I'm thinking of returning to Rome I just had to review this place. I thoroughly checked the reviews on here before booking our room and was a little mislead by people saying that Termini was just a 10minute walk away and therefore very convenient. We found that Termini is probably 20mins away in the glaring August heat and definitely not the nicest part of Rome to be in at night trying to get back to your hotel. The nearest bus stop is just two minutes away on Via Piave but we found buses do not return to that road from Termini, only go in that direction so in the evenings had to go a little further. Taxis can be pretty expensive so we stuck to the buses and found the easiest thing to do was walk from the hotel to Via Veneto, which takes about 10minutes and from there you can get buses to most of the attractions. The beautiful Villa Borghese is also just a few minutes further past Via Veneto. Like I said, getting back to the hotel at night was unpleasant as no buses go directly to this area so we first needed a bus to Termini and then another from there, I'm sure there is an easier way but that's how we did it. Because of this I did not think I would return here when visiting Rome but the location can be overlooked because of the fantasticly huge rooms! Our room was on the 6th floor and as there were 3 of us we expected a double bed and a seperate single, however, the double was so HUGE that all 3 of us slept in it with room to spare. The bathroom was very clean, well equipped and the shower was exactly what you needed it to be after treking around Rome for the day. The room had lots of space to move around in, with a table and chairs, although like other people have said, tea making facilities would have been greatly appreciated. The breakfasts are ideal if you do not mind missing out on hot food, which I didn't for the first few days but after a while the pastries and cakes can become sickly. You can order eggs etc at an extra price, but not sure its very fair to charge approx €6 for it! The air conditioning unit in our room began leaking after the first couple of days so we had to be moved which we were really annoyed at...until we found we were being upgraded to a suite to make up for the inconvenience! Again, the room was huge, with a seperate living room and dinning area and we had the beauiful terrace/balcony that you can see on their website. The staff were very helpful, especially the gentleman who helped us move rooms, although there was another older gentleman at reception who seemed out of sorts. The hotel is great value for money, especially compared to the rest of Rome and no doubt if it was situated furter in the centre we would not be able to afford it. When we first arrived at the airport we took the shuttle bus to Termini but on the way back we chose the hotel's car service which was €45 I think. Unbelieveable comfy stay, hope to return here in June. Would recommend to those who prefer the quite and like generous rooms. We opted not to go for guided tours as they were stupidly expensive (€50 pp for a 2 hour tour of the trevi fountain and spanish steps?!) so its best to get a good guide book and research bus routes upon arrival. Thank you Londra and Cargill, cannot wait to see you and Rome again soon!", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London", "Title": "“Vict4”", "Author": "Vict4", "ReviewID": "UR123900034", "Content": "The hotel suited us perfectly. Clean room and bathroom, on the small side but with nice views onto buildings and a palm tree also quiet. It is not too far from the sights but taxis were necessary and are quite expensive. The staff were extremely friendly and helpful. Breakfast was only lacking in fresh fruit which would be a good addition to the buffet. I imagine that it would not be so good at the height of the tourist season as the breakfast room is on the small side and the bedrooms might be a bit noisy. We would stay there again.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Gravesend, United Kingdom", "Title": "“Not A 4 Star Hotel”", "Author": "Sandra H", "ReviewID": "UR123302597", "Content": "In our opinion this is not a 4 star hotel may be 3 stars at a push!! On a positive note, we should mention that our room was kept clean and the bed was very comfortable. Only cold fare was on offer for breakfast, which is fine if you like cheese and ham with rolls or cakes, we appreciate that the europeans don't do the 'British breakfast' but from our experience there is usually some form of hot food on offer!!! We found the location of the hotel ok but, we don't mind walking, therefore we would not recommend for anyone do is disabled or cannot walk very far!!! I'm sure we will go back to Rome again as it is a lovely city however, we would not return here again but would ensure that found a real 4 star hotel!!!", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“Very nice hotel”", "Author": "RichC001", "ReviewID": "UR122420948", "Content": "This was a very good hotel. Front desk staff were very friendly and helpful. Room was well equipped, large and was cleaned to a high standard each day, and all other areas were well maintained. Breakfast was varied and plentiful, but staff bringing tea and coffee were slow and inattentive. Hotel was about 20 minutes walk from the train/bus station (Termini), and about 45 minutes walk from Rome City centre.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brussels, Belgium", "Title": "“A place to stay in Rome”", "Author": "Barbora_11", "ReviewID": "UR122353094", "Content": "Looking for a good hotel in Rome for a good price is as difficult as trying to find a needle in the hay. However, Hotel Londra and Cargill is the one. Elegant, spacious and clean with big rooms, it is a truly 4-star hotel for an excellent price. The breakfast room is a bit small and you got to watch out for your table, but breakfast is rich. You do have to walk a bit but walking in Rome is part of your stay. It takes about 20 minutes leisure walk to the Spanish Stairs. The only thing to keep on your mind - eating facilities are limited in the vicinity of the hotel so have your nice lunch or dinner in other parts of Rome.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel with massive rooms!”", "Author": "Deviljopo", "ReviewID": "UR121911382", "Content": "Picked this hotel based on the reviews on TripAdvisor - which I must say were spot on - and have never been so delighted! Booked the hotel and flights via Expedia and got a great deal for a short 3 day trip in Rome. Hotel We arrived at the hotel earlier than expected and earlier than the check-in time of 2pm however the receptionist managed to sort out a room for us which was ready straight away. He also gave us a handful of maps and guided bus tours and pointed out all the major attractions and how to get to them all. The bellboy then took our luggage to our room for us which was unexpected seeing as we only had 2 pieces of hand luggage - still nice though! The staff were extremely helpful throughout our stay - even allowing us to print of our pre-booked tickets to the Vatican for free. The hotel also has free wifi throughout and use of a PC in the massive lobby! The Room We got a room on the 3rd floor which was huge and came with most facilities you would expect/need. The bellboy even helped us set up the in-room safe which was great.The room (other than being huge) was very nicely decorated and modern with a flat-screen TV, telephone, really lovely bathroom (with bath) and two massive single beds! There aren't any tea/coffee making facilities in the room, as mentioned in previous reviews, but we brought along a little travel kettle, tea and cups so managed to get around that. There isn't a mini-bar in the room, instead there is a small fridge which came in handy for the milk (there are quite a few small supermarkets to get the milk from). We didn't really watch the TV much so I can't comment on the channel selection, however we did manage to find Sky Sports which showed a couple of the Premier League games live. The beds were extremely comfortable although only 1 extra pillow is provided in the room - we called for an extra one which was brought up to us pretty quickly though. Food/Breakfast There isn't a restaurant in the hotel but there are plenty of eateries nearby the hotel (highly recommend Trattoria Cadorna - 2 mins walk) and of course in the main sightseeing areas - most don't start serving dinner until 6/7pm. The hotel does offer a small snack selection including omelettes, toasties and things like that though. The breakfast is included in the room price and I have to say that I can't fault it! Yes, it is a continental breakfast - so no hot food - but there is so much cold food on offer that this never became a problem. It is a buffet -style breakfast and so you can pretty much help yourself to as much as you want! Chesses, ham, bread, cereals, fresh fruit, cakes (!), yogurts, juices are all there and are constantly being replenished until 10.30am when the breakfast ends. There are also hosts which come and serve the hot drinks and clear away the tables etc. They are also happy for you to take extra to makes lunches with which I would recommend as eating out around the sightseeing can be unnecessarily expensive! Location The hotel is a little bit out of the hustle and bustle of the main city but still within easy walking distance of the major attractions. 10mins walk to the Termini station where you can get on the Leonardo Express which will take you straight to Fiumicino airport (airport-hotel in less than 1hr). From here you also have access to both metro lines. Barberini metro station is also about 15min walk from the hotel. Trevi Fountain - 20mins walk, Spanish Steps and Piazza del Popolo about 40mins walk or 2 stops on the metro from Barberini. We visited pretty much everything in the 2 1/2 days we were there without difficulty. The area itself is a really nice residential area with quite a few lovely restaurants/trattorias nearby. Via Veneto is also around 10-15mins walk away and is definitely worth a visit - albeit a bit pricey on the restaurant side! All in all it is a brilliant hotel with great staff and we are already planning our next trip to Rome and will most definitely be using this hotel again!", "Date": "December 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“good for bussiness and fun”", "Author": "Pblue2001", "ReviewID": "UR121892462", "Content": "We need two rooms. They were clean and we had a great balcony. Both rooms had a fridge in them. Odd connecting rooms lock myself out you could not leave the doors open to each other. They open to the hallway were there was a third door you could close from the rest of the rooms it was at the end hallway. My wife and kids had a great time in Rome while I had business meetings in their conference room very nice. Breakfast had every thing but eggs and bacon. Still good. Great location center of everything. Walking distance even for an American like me.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Quebec", "Title": "“Rome for a milestone”", "Author": "Boing-Boeing", "ReviewID": "UR121780700", "Content": "My husband offered me Italy for my 40th birthday! We booked this hotel after reading reviews and were delighted with our choice. Everything was perfect and exactly as advertised and reviewed by fellow TripAdvisors - attentive and friendly staff, clean and spacious room, delicious and varied breakfast each morning, plus free WiFi Internet. Location is slightly excentric (near Porta Pia), but it is probably quieter for that same reason. We felt very safe at night in the neighbourhood. About 10-12 minute walk to Barberi Stzn, and 15 min to Termini. Many buses run on Via Piave (two minutes from hotel), and reach the main sights, or at the very least Termini station, so if you have a Roma pass or a day ticket, you can spare yourself some walking. We'd go back without hesitation.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Ideal base for Roman adventure”", "Author": "soodynum", "ReviewID": "UR121393157", "Content": "We stayed here in for 3 nights starting on 30th Nov 11 and I have to say it was absolutely prefect as a base for exploring the city. In advance of us arriving I emailed to ask if we could have a private car pick us up at the airport and this was done within 24 hrs and I was emailed back with confirmation. On arrival at the airport we were met by our driver who helped with out luggage and then whisked us off into the city for our first sites of Rome. He took the scenic route on the way to the hotel pointing out all the places of interest and landmarks. Very impressed. We were met at the door by a very pleasant bell boy who assisted with our luggage again and were swiftly checked in by very pleasant desk staff. They pointed out where we were on a map that they gave us and circled all the points of interest and the various Metro stations etc. The rooms were spacious and clean and the double bed was enormous, I was even able to sleep far enough away from my girlfriend to stop her smothering me in the middle of the night, even her snoring seemed somehow distant!!!!! The breakfast is typical Italian fare and the cakes, cereal etc are enough to set you up for the day. Getting about is easy and Barberini Metro is around 10 minutes away walking, you walk down past the impressive American Embassy and various Pizzerias and Coffee Shops. Barberini is also next to the Trevi Fountain. All in all a great base and a very comfy bed, we will be back and I have just told my parents to stay here when they visit Rome in Feb........ I don't think you can get any higher a compliment, a guy telling his mum whe to stay. I will def be back myself. Thanks to the staff. PS Rome is immense!!! A wonderful city of fusion.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Very good hotel and excellent location”", "Author": "ScienceGuru", "ReviewID": "UR121380887", "Content": "We arrived at the hotel at around 11am and although our room wasn't ready yet (you can check in early if your room is ready) but our luggage were kept safe while we went out exploring. The doorman (a different one each day) was very helpful and friendly. The reception staff were mostly friendly (as it was my first introduction to Italy I am not familiar with Roman manners or etiquette so not sure if sometimes when I found something as being less friendly it is actually just the Roman way. This theory was reiterated outside of the hotel when smiling to passing Italians and they would just look at me strangely and mistrusting. Don't let this put you off please as this was the minority.). The lobby and bar area was really nice and romantic type decorating and paintings. The bar staff were really friendly and helpful as well. I know no Italian and she was happy to give me a small crash course. Breakfast: I found breakfast interesting, suitable, and so tasty. You get a selection of cold meats (gorgeous), cheese (soft and hard cheese), butters, jams, several types of different roles, cakes and tarts (strangely), fruits, cereals, etc. Also, they do lovely cappuccino. You do help yourself to breakfast and the staff does your tea and coffee but they are so lovely, helpful, and professional. Room: The room was big and so was the bathroom. The bed was huge, possibly the size of 2 double beds put together and comfortable. The TV has many channels but you will be very lucky to stumble on an English one that wasn't BBC or CCN news. (I love coming back to a show or a good movie in bed after a busy day out). The room is very comfortable and does come with a safe. There is also air conditioning (which is turned off during winter which turned out to be rather warm actually but opening the window gave a suitable amount of breeze and fresh air in the room. The bathroom was very good and comfortable and has a bath (with low shower head for washing hair), over bath shower (fantastic water pressure), toilet, bidet, large basin area, heated towel rails. The bathroom was clean apart from some hair on the bidet and on the bath but that could be the cleaner’s hair. The room is very quiet and the room was very clean. When you leave the hotel you do need to give in your room keys though (still keys not the card system which is fine). It is located in a very good area and there are loads of restaurants in the area that are very good. (I thought there was a restaurant in the hotel but it seems not). If you walk out of the hotel and turn directly left and directly left again, walk up this road and keep going, on the right there is a pizzeria and if you walk a bit further on the corner of the next street there is a pub restaurant called Brancaleone no: 170-172 Via Sicilia and they do authentic Roman food. It was amazing and the choice was good. The staff speaks English well and they are happy to make suggestions for you. We had 2 fantastic meals there and one of them they had home made pasta as a special (Sunday night) it was the most amazing pasta I have ever tasted. From the lettuce, tomato, bacon fat fried croutons, and buffalo mozzarella salad to the first course of pasta and the second course of meat dishes, it was amazing. My husband also had a pizza there that was so healthy and delicious. It had the normal thin crust pizza base then covered with leaf, cured beef cold meats and parmesan slices. Delicious. Another good restaurant we tried was in the next street closer to the hotel called Ristorante La Cantinola No: 16 - 18 Via Calabria. It is a fish restaurant (you'll see the live lobsters in the fish tank in the front window at 120 Euros each) but the rest of the menu is not that expensive, the food is great. This is a very Roman restaurant and only 1 of the staff there speak English but that was fine. There was less choice but where the steak was very expensive in the other restaurant, it was very affordable in this restaurant and extremely tasty. Just remember if you like your steak cooked medium, order well done or very well done. In the same road is a brilliant Irish Pub called St Patrick's Irish Pub no: 30 Via Calabria (there must be one in each country), the staff are so friendly and the Guinness is fantastic. The sights are walking distance from the hotel. The Termini station is about 20 minutes walk, the Spanish steps and about the same for Barberini. The Trevi Fountain is about 30 minutes walk back but do yourself the favour and walk around a bit, you see so much more than on the bus. We took the Green Line tour bus from Barberini (one of their stops) and bought tickets at the hotel (they cost the same price really so feel free to buy a ticket at the stop. Tickets were reasonable and you can buy one trip, 24 hour, 72 hour, and so on tickets for the bus. We bought a 24 hour ticket and could jump on and off the bus where we wanted to go see sights and we found this a lot easier as we didn't know where to find the sights anyway and they do give you a bit of information via headphone commentary on the bus. I found the commentary a bit mediocre on this bus as it was either given too late when leaving the sight or at a time when you have already passed the sight that they are referring to so have no idea where it was or what it looked like (from my Blackberry travel app called 'Ultimate Travel Guide' - extremely useful for all the sights, culture and so on - that the reviewer on this app found the same) but there are at least 3 other buses using similar routes that may have better commentary. A lot of the sights were free including the fountains, St Peter's Basilica and the Pantheon. The Vatican City cannot be entered by the public so you can only see St Peter's, go up to the tower dome of the Vatican above St Peter's Basilica (also have the view inside St Peter's) for 5 euro with the stairs or 7 euro with the lift. There are also very clean toilets on these grounds to use free of charge. About a 15 minute walk around the walls of the Vatican to get to the Vatican museum, (I think it was about 15 euro each to go in and decided not to) this includes Michelangelo’s famous ceiling painting in the Sistine Chapel. A word of warning, we got off the bus and walked towards the Vatican and was stopped by one of the many offering guided tours of the sights (you will find this at each historical site) and she offered 80 Euros for 2 people on this guided tour...I think you will find by adding up the 15 and 5 euro it would have cost anyway to see what can be seen around the Vatican the guided tour is rather overpriced. The Coliseum was amazing but the queue here is very long. There are 2 queue's one with guided tour and one without. Standing in the queue, we decided it would be a better option to just pay the extra for the guided tour which means skipping the queue and it wasn't that expensive either...we didn't use the tour but skipping the queue was well worth it. You also buy audio tours from this queue which in hindsight would have been another good option.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nagoya", "Title": "“Comfortable and Convenient”", "Author": "onthegoNagoya", "ReviewID": "UR121311576", "Content": "We had a regular room and it was enjoyable. Big enough for 2 people, bright and sunny. Be Advised the regular rooms do not come with the picture perfect patio /balconey shown on the website. Clean hotel and the staff were pleasant and helpful. There was no coffee maker in our room, nor mini-bar, but there was a mini-fridge. No room service to speak of, but when I called for ice and extra hangers they were delivered quickly. The twin beds were comfortable. The en suite bath/shower had a western-style shower head as well as a european hand-held type. Soap and shampoo were provided, but no conditioner or Kleenex. The buffet breakfast was included and it was very satisfying. The hotel is in a nice area and walking at night in a group was safe. Easy walking to plenty of shops and restaurants. If you only have a few days to explore-take one of the bus tours first. Look for the leather shops-wonderful items and you can bargain!", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Top of the line”", "Author": "Pal H", "ReviewID": "UR121255583", "Content": "Great hotel on a good location in Rome. My room was fantastic with a sofa, two chairs and a table. I also had two balcony's.The staff is nice and quick to help. We had a conference in the basement and the dinner the hotel cooked was amazing. Six courses and they all tasted great. It is not cheap but worth the money to stay here.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good value for money but disappointing facilities for so called 4* hotel”", "Author": "HavvaS", "ReviewID": "UR121194637", "Content": "We recently stayed at this hotel because the reviews were excellent. However, you would think for a 4* hotel they would have room service and restaurant to at least have evening meals or even hot snacks. The staff although trying to be helpful, failed on a few occasions. Asked where the nearest restaurants were they sent us off to a couple of places nearby where there were no customers what so ever. Not even any locals (even though in a built up residential area). When we asked about maybe having a pizza delivered to hotel. They did not know of any Pizza delivery services. How strange is that in Italy. The hotel was very very quiet, few staff and very few clients with no more than 15-20 people at breakfast. No toast/eggs or any hot breakfast, just continental. Apparently they do not have a kitchen is this large hotel. The location was a bit out of the way, 40mins walk to spanish steps and centre, and about 15 mins taxi ride for 10 Euros. Would we stay there again? No. May consider going there again if they put in a restaurant and it is more lively, and not 'dead.' Its a nice hotel if you want all the things we didn't as above. Again we would say good value for money if you dont mind being away from it all with hardly any facilities.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“good location,breakfast”", "Author": "Nkbasnet", "ReviewID": "UR120954600", "Content": "we stayed in the Londra and Cargill for 3 nights from the 14 to 17th Nov. I booked the hotel because of the good reviews it received and I was not dissappointed. We arrived around 12 and were told our room was not ready yet and the receptionist told us that we could go to Via Veneto for a look which was a few blocks away. We were very tired and waited for our room to be ready. It is in a nice part of Rome with major headquarters of banks and embassies around it. Our room was nice and big room and my only greivance is the lack of a kettle and tea making facility in the room. Rome was mild during the day but quite chilly in the evenings and I longed to have a warm tea before I went to dinner or came back from one. Once I was desperate and bought a takeaway tea in one of the shops nearby and the receptionist looked at me with surprise. I hope he realised that some people like a hot drink frequently.Also this being a four star hotel, I naturally assumed there would be one. Other than that, everything was fine, the breakfast like someone mentioned before was very Italian with lots of Italian pastries but good enough to last through to lunch. the hotel is in a very good location but it can be quite a maze in the beginning. It took us a better part of our trip to get used to the narrow roads but once you get around it is very close to the main attractions by walking and even closer by bus. I would suggest getting the bus map rather than only a map of rome since the bus service is much quicker and cheaper and much better connected to all parts of Rome than the metro. If you're getting a Roma card then the bus and the metro are free but it might not be suitable for everyone so I would encourage a little more research into getting a Roma card to since it costs 25 euros each. The nearest metro is the Bernini which is about 10 mins away and the bus is 2 mins away to all the attractions from via Settembre. All in all it was a wonderful trip, Rome is a beautiful city and the hotel was very nice. Nice decor, polite staff and conceirge. I would definitely stay here again.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Amazing staff, lovely hotel, great location”", "Author": "StormAVG", "ReviewID": "UR120907475", "Content": "I have just returned from my short trip to Rome as my birthday treat, stayed in this hotel for 2 nights. It's a really lovely hotel, warm atmosphere, beautiful enterior. Room was nice, big & clean. I have to say a big thanks to the staff as I asked for a nice view from the room and I got it. After exhausting travelling I was feeling very tired & hungry, so I asked at the reception where I could have something to eat & rest. I was recommended trattoria 'La Pentolaccia' for lunch and wasn't disappointed - delicious food, great service.. Breakfast in the hotel is also good - there is plenty for everyone's taste. In the evening you can sit down, relax and enjoy your drink at the bar... I must say, barman Pavio is one of the nicest, most professional people I've met - his service is superb! (Please pass my huge thanks to him!) Overall a very pleasant stay and if I am in Rome again I will definitely stay here again. Yours sincerely, Audrone Vikonyte-Gedzeviciene", "Date": "November 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“A comfortable & affordable stay”", "Author": "ph2769", "ReviewID": "UR120865883", "Content": "We booked a two night stay at the Londra & Cargill directly online. We got a good rate which included a welcome drink. We arrived at the Hotel at 12pm, as we were early our room was not ready which was fine, and we left our luggage with the porter. When we returned to the Hotel, our luggage had already been taken to our room. Unfortunately the room we were given, 209, had a large damp patch on the bathroom wall and the whole room smelt musty. We asked for a different room and the helpful reception team moved us to another one, 207. This room was much better, and was very clean and comfortable. We asked for extra pillows, but were told that none were available. This was annoying, as the pillows provided were quite thin, and a second one each would have been appreciated. The breakfast was good, and was very Italian with lots of sweet pastries and cakes. I would advise going early, as it gets quite busy and the tables fill up at the weekend. The Bar was very pleasant, and was a relaxing place to have a drink before going out for dinner. The Hotel is an easy walk from Termini, approx 20 minutes with luggage, but there are taxis and buses which pass nearby. One thing which did cause some irritation was the Roma card. We asked the reception on arrival if they sold this, and were told that it didn’t work and wasn’t worth purchasing, so we took their advice. It was therefore very annoying to see other people using this card successfully both at the museums and the metro system. Whislt it only resulted in us spending approx 11 euros each more, it was annoying that we were told not to bother with it.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Lovely, Perfect Location ...”", "Author": "chelsea_lea", "ReviewID": "UR120578523", "Content": "Stayed here for 4 nights last week, my boyfriend booked this hotel for my surprise Birthday present and i must say i was quite worried as hadn't read any reviews myself or anything. Honestly had nothing to worry about! Looked lovely outside and in, and was in a great location (took a couple of days to get used to the side streets though, but that's part of the fun)! Check in is 2pm, but we arrived at 10am and asked to just leave our bags there, but they said that our room was reay and let us check in right there and then which was a great touch! Very friendly reception staff with really good English, they gave us a map (which was our absolute lifesaver while sightseeing) and highlighted all the attractions and how to get from / to each one which was really helpful. Room was really nice, HUGE comfortable bed and nice bathroom .. had no problems with shower or anything like that. Didn't eat the breakfast as just stuck to lunch while out sightseeing so can't comment on the quality of the food. There are some really lovely little restaurants to visit within walking distance and the receptions taff will be happy to recommend somewhere and make you a reservation. We preferred to walk into Barberini (about 10 minutes down Settembre) and found our favourite bar - Pepe's Bar where we could sit outside under the heat lamps and had table service for cocktails and wine. There are some beautiful restaurants there too. All in all a lovely hotel, if i return to Rome(which i hope i will), i will definitely stay here again.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Quiet Location, Nice Surprise”", "Author": "boboakville", "ReviewID": "UR120401517", "Content": "We had visited Rome and stayed in this area before. It's a good location, within a 15 minute walk from Rome's Termini station (if you like walking or it's a short taxi ride). With suitcases, I'd suggest the latter. On arrival, the hotel staff were courteous and helpful. Our room was available immediately, having arrived just after 1pm. The room was clean and the bed comfortable, although after a day of walking in Rome, it doesn't really matter. The staff were always available to answer questions, give directions or recommend local family owned restaurants. We ate 2 times of our 4 nights at the Ristorante Cardorna. There's also a great gelato place down the street - I Caruso. The hotel is within walking distance to most of the main tourist sites.The Metro is within walking distance as well. We found that the hotel area was quiet at night, being in a government office/embassy area. We'd stay here again.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“6th time here just love it”", "Author": "Rick S", "ReviewID": "UR120201337", "Content": "This is an under rated hotel. Great value good big rooms great friendly staff who go the extra mile to make your stay memorable. Great variety of food all easy walking or staggering as the case may be. The sights of Rome are easy walking from the hotel but if your driving you might want to check on parking. If you like to cook check the spice shop (il genovino d'oro sensorial food) just around the corner and the cheese shop next door to the spice shop.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "kent", "Title": "“First trip to Rome and not disappointed”", "Author": "Susan L", "ReviewID": "UR119983386", "Content": "This was our first trip to Rome and was booked through Last Minute. As I make most of my decisions based on reviews, I checked out Londra and Cargill first before booking. This hotel was brilliant - from the first sight when we entered the square to when we walked out the door coming home. The welcome was great and all the staff were courteous and pleasant. Breakfast was great - very filling, lots of cakes, pastries, cold meat, fruit, cereals etc. We did not have to ask about trips and what to see as I had already pre-booked our tickets to the Colesseum and the Vatican Museum (done to avoid queues which were long even in October). Our room was on the 6th floor and was large and comfortable, with a huge bed. Everything was lovely and clean. The walk from Barberini was pleasant and even at night we felt safe whilst out walking. Rome is a dream and we loved it and the Londra & Cargill.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Great Hotel”", "Author": "TangerineOtley", "ReviewID": "UR119854290", "Content": "Can't recommend this hotel enough. Everything went perfectly - staff were great, breakfast couldn't be faulted (plenty of food, always being replenished so not too sure why other reviewers have complained about it), and the room excellent. If you're going to this hotel or another locally, whatever you do avoid a 'restaurant' called Henry Cow... had a meal there and it was terrible! Apart from that place the other two local restaurants we visited were very good and reasonably priced. After a long day sightseeing I'd recommend an ice cream from the place just round the corner from the hotel - can't remember the name but it makes its own! Getting into central Rome is walkable if you like walking (it's uphill on the way back so beware after a long day in Rome) but there are lots of buses going to the main areas or to Piazza Barberini for the Metro Line A or Termini for mainline trains. I'd recommend a trip to Trastevere in the evening - it's easy to get there and back via bus and tram changing at Argentina (the tram terminus).", "Date": "October 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "donegal", "Title": "“Exceeded expectations”", "Author": "DonegalNewboy", "ReviewID": "UR119582445", "Content": "Booked due to good ratings on tripadvisor and we were not disappointed. Booked a triple room with a extra bed and we were lucky to be upgraded to a junior suite with outside terrace. We arrived early and were delighted when our room was available for us to check in at 11.30. Meaning we could start our sight seeing early. The reception staff were extremely helpful and knowledgable and spent 20 minutes going through the map and explaining sites and transport links etc etc. The hotel is within walking distance to many attractions, the longest walk was to the colosseum which was a 30 minute stroll. Bearing in mind we were walking with 3 children and a baby. The breakfast was excellent for a continental and set us up ready for a long of enjoying rome. Upon check out we were greeted with an exceptional thunderstorm and horredous rain, the poor doorman was so so wet but still provided excellent service to ensure we didnt get soaked through whilst getting into our transfer back to the airport. We will definitely stay here again when we return to Rome next spring", "Date": "October 22, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Ashford, United Kingdom", "Title": "“Nice hotel in a good location”", "Author": "Acornlady10", "ReviewID": "UR119328554", "Content": "This is a nice hotel in a good location. The staff on reception were efficient and helpful. The room was nice, very clean and comfortable. Breakfast was ok. Very good staff on at breakfast time, clearing tables quickly and serving teas and coffees promptly. and frequently replenishing the buffet. We had breakfast in the room one morning and it arrived spot on time. The bar and lounge area lacked atmosphere, some background music would have been good. We thought the hotel a little expensive for what it was, but then Rome generally is a bit pricy. Take plenty Euros! We had a fabulous time in this wonderful city. PS Beware taxis trying to rip you off. Get a price before you get in!", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "canberra", "Title": "“Excellent Value and Location”", "Author": "terry m", "ReviewID": "UR119281441", "Content": "4 couples stayed here for 2 nights and it was perfect. Good price, quiet location, near good restaurants, 10-15 minutes to metro and attractions. staff helpfel and friendly. Rooms large and everything worked. Highly recommend", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vienna", "Title": "“Perfect price value relationship”", "Author": "ViennaBeatrix", "ReviewID": "UR119130539", "Content": "The room was wonderful. The location is close to the centre of Rome and close to main bus and metrostations. The service is perfect, very friendly and helpful. Good continental breakfast. The only small minus was the waterpressure in the shower (room in the 5th floor) Overall we can warmly recommand this hotel", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“50th Birthday in Rome”", "Author": "Bogendthatch", "ReviewID": "UR118930647", "Content": "A family short break for six that was spectacular and after reading some reviews of this hotel we were concerned that maybe we,d be disappointed,nothing could be further from the truth. We were treated so well, anything they could do to help from an iron and ironing board to help with how to get to all we wanted to see. We walked everywhere, saw everything but recommend a Sunday in the park 10mins from the hotel,views to the Vatican,rowing on the lake,football with the locals, rickshaw riding and a lovely lunch. We really were impressed with how warm and friendly everyone was and how cheaply we could see all these historic sights as most are free. Would definitely stay at the Londra and Cargill again.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Shannon, Ireland", "Title": "“Great value for money”", "Author": "gabbiperrozzi", "ReviewID": "UR118844034", "Content": "We stayed in this hotel for three nights. Overall a fantastic experience staff very helpful and courtious, hotel spotless, room large by roman standards, breakfast free with the package that we purchased fantastic. Something to bare in mind with this hotel is that it is located in the government area of rome and the american embassey is just a 5 min walk away. This area is beautiful and lots of nice restaurants just around the corner from the hotel and far more reasonably priced than those that are loacated in the centre. Saying this is is a nice 15 to 20 min walk to the trevi fountain. And about 10 min walk to barbarini metro station which can bring you to all other attractions in the city. This would be my one and only complaint of this hotel. Overall we would return and would recommend to friends.", "Date": "October 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Londra & Cargill, a pleasant suprise”", "Author": "Payster", "ReviewID": "UR118788140", "Content": "We stayed here for 2 nights in September 2011. Great location - I believe its near the government offices, so it was quiet at night and we felt very safe. We actually had a king sixed bed which is a pleasant suprise for Europe! The breakfast was included and was fine to get you through to lunch. The room was quite big and the bathroom and room were very clean - it was a comfy bed too. Good for a few nights stay, but if you can afford something more expensive and you have a longer stay, you may want a hotel you can come home to and relax - the balcony did not have a view - meaning the stone railing on our balcony came up to our chins and we're not that tiny. Overall, very nice.", "Date": "September 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Very Nice!”", "Author": "Lovetocruise21", "ReviewID": "UR118664166", "Content": "We stayed here one night after our cruise and enjoyed it very much. It was clean, nice sized room, comfortable bed and had a very nice breakfast in a dining room with beautifully set tables. They also had a cafe type bar for snacks & coffee. It was close to the public bus line as well.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "glasgow", "Title": "“Lovely place”", "Author": "rabmania", "ReviewID": "UR118545003", "Content": "We stayed here in 2005 and loved it.Now it's had a refurb and is lighter and more modern. Staff delightfully friendly, room spacious and well-appointed- what's not to like? A 492 bus gets you back here from Via del Corso, but you can walk it too.", "Date": "September 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Norfolk", "Title": "“very good for the price”", "Author": "rmdbfn", "ReviewID": "UR118446280", "Content": "Me and my wife stayed here for five nights and found it a pleasent experience. The hotel had all the necessities, was clean, had pleasant staff, wifi, ac ect. The location we found very good although we are very keen walkers. If you find walking difficult etc you might find some of the attractions out of easy reach, especially as as rome has some of the worst kept pavements I have ever seen, but this was mostly out of the tourist areas. Breakfast is a bit naf but this is how I rate all continental breakfasts, my wife was satisfied with croissants, yoghurt, cake and cereal.", "Date": "September 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "newport s wales", "Title": "“great hotel”", "Author": "nicksull_11", "ReviewID": "UR118336332", "Content": "went to rome for our friends wedding, saw the reviews for the londra & cargill and were not disappointed with our choice.room was fantastic, hotel staff were very friendly and very helpful and couldn,t have done anymore to make our stay more enjoyable a real credit to the hotel .hotel was situated in a nice quiet area and only 20 to 30 minutes walk from most of the main attractions.plenty of local eateries and a great ice cream shop just a minutes walk away.would definately recommend this hotel and would not hesitate to stay there again. mr and mrs sullivan s wales.", "Date": "September 19, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Average. Once upon a time it might have been good.”", "Author": "Tl1983", "ReviewID": "UR118233822", "Content": "Staff are not massively friendly. They definately don't seem to be the brightest. Hotel lacks any real charm. Rooms do a job. A hotel for business in my eyes", "Date": "September 17, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Lymington", "Title": "“Excellent! Would definitely stay again.”", "Author": "Dodie B", "ReviewID": "UR118202293", "Content": "Stayed in this hotel for four nights with my son. Exterior of hotel smart and well cared for. Made a good first impression. Twin room supplied as requested was spacious and clean. Staff very friendly and helpful. Only slight negative was the breakfast, some fresh fruit rather than tinned would have been much appreciated. No problem walking to most of the main sights, only used taxis on one particularly hot day. Lovely, authentic restaurants nearby. Attractive, quiet location.", "Date": "September 16, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "wexford", "Title": "“Fantastic!”", "Author": "joanWexford", "ReviewID": "UR118167036", "Content": "My husband & I stayed here for two night's and it was just the most perfect hotel, we were in Rome for leisure/sightseing, The Londra & Cargil was ideally located and we found we could to walk to most of the attractions, there were lots of restaurants in close proximity... But the best part of the Hotel was were the Staff! they could not have done more for us, helping with tours & transport and any information we wanted they were more than happy to help us.. Thanks for a great stay", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Canberra, Australia", "Title": "“Quiet location easy enough to get to main attractions”", "Author": "Nbonoz", "ReviewID": "UR117902703", "Content": "We found the hotel nice enough. Nothing grand but our room was really spacious and had comfortable beds. It was clean. It is in a quiet little piazza with a nice Roman feel to it. To get to the main attractions we waited 5 minutes in the lobby while the concierge called a taxi. Taxi's were cheap and nothing is more than 10 minutes away. Breakfast was basic continental. Nothing hot but enough variety. Nice to escape the busy areas at the end of an exhausting day with peace and quiet. The surrounding streets were nice to wander down as they weren't touristy at all. A nearby gelateria was delicious.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sunnyvale", "Title": "“Absolutely fabulous!”", "Author": "Carol L", "ReviewID": "UR117660625", "Content": "The service by the staff was wonderful - very accommodating. Location great. Fabulous breakfast included with the room. I actually can't find anything negative to say about this hotel and would recommend it 100%.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Very good hotel overall”", "Author": "BKQ_1", "ReviewID": "UR117292994", "Content": "This hotel is well located in a nice and quiet area with good access to Termini station. The morning - afternoon front staff were just average while the afternoon - eve staff were great. Overall our experience there was great except its breakfast offerings; lack of hot food and options.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "2.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Ok Hotel but Staff are a major problem”", "Author": "EllaG C", "ReviewID": "UR117148104", "Content": "I stayed in this hotel with a family member in August 2011. The Location of the hotel was amazing, very close to the Spainish steps, Ville Borghese and lots more must see sights. We found that we could walk to them all, which was no mean feat in the August sun! The problem I have with this hotel is the staff. After the first day, they were rude and ignored us. When we asked for help about getting to certain locations, they weren't very helpful at all and gave us the bare minium of information. I ended up avoiding asking reception for help because of their horrible manner. When we went up to the reception to complain about a soiled blanket that had been left on my bed, we were met with a frosty reception and not offered any sort of an apology. The room was fine, clean (apart from the dirty blanket) and had air con which was brilliant. Breakfast was average. When we were checking out the staff were again very rude and I was scowled at by one of them, which made me very uncomfortable. Also just a heads up for would be travallers- theres a city tax for tourists staying in hotels, 3e per night. We didn't know this so just passing it on in case anyone else didn't know about it. Also don't ask the staff for any recommendations of places to eat- when we asked we were sent to a very expensive snobby restaurant. Just look around yourself- you'll find lots of brilliant little places to eat very near to the hotel. Watch out for the staffs attitude. Plus this hotel does not deserve a 4 star rating based on the treatment we received there. Tip- go and visit the Keats Shelley Museum- its a little gem and well worth a look. (its by the spainish steps)", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Perfect stay in Rome!”", "Author": "Mastersgeek", "ReviewID": "UR117054946", "Content": "My husband and I stayed here in July 2011 for 5 nights. The lobby is beautiful and very new, and the staff are always helpful and available! The rooms were comfortable and clean, with dual fixtures in the tub. The bathrooms were tiled and so classy. The rooms were also very soundproof, not that it was needed, because the street is quiet. I spent lots of time in the room relaxing and found it spacious and comfortable. There is a wonderful authentic home-made gelato store around the corner, the best I ever had. It's so popular with the locals that the menu isn't even in English, but it's worth it to just pick a couple flavours and see what you get! Just look for the crowd outside! The hotel staff arranged transportation to the airport which was affordable, comfortable and professional. The breakfast was terrific, with lots of cakes, pies, cereal, baked goods and fruit. I would definitely recommend this hotel to friends and family!", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Norfolk", "Title": "“Friendly and helpful staff”", "Author": "668ozzy48", "ReviewID": "UR116937247", "Content": "We enjoyed our stay. The front desk staff were very friendly and helpful, especially with help and advice about day trips, and booking taxis. The rooms were clean and had efficient air con, which is a bonus in Rome in August!", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "New York", "Title": "“The hotel is fine... but watch out for the front desk staff.”", "Author": "MoniqueSR", "ReviewID": "UR116390198", "Content": "If not for the accommodating and friendly porters, dining room and housekeeping staff, I would have given this hotel a 1-star. It has the WORST FRONT DESK staff I have encountered in my years as a traveller. Three out of five were arrogant, unwelcoming, not helpful, and very rude. We were a big family group of nineteen. We had stayed at this hotel four days prior to our Tuscan vacation.The plan was to go back to Rome and stay another 9 days for more shopping. Only five from the group returned, but shortened our stay to 4 nights. The bed was a bit slouchy, nice bathroom and room, very clean. I had a view of a pocket garden. Location is average, quiet. There are a few trattorias nearby, a cheese shop, a great gelateria, frutteria and a couple of salumerias. It's a 20 minute walk to the Spanish Steps. Not quite central, we had to call for a cab often. Unless something is done about the attitude of the front reception staff, this hotel does not deserve its 4-star rating.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Amazing Hotel”", "Author": "RR2981", "ReviewID": "UR116210632", "Content": "I went to Rome this past week for my boyfriend's birthday and we stayed at Londra and Cargill. I had requested for a spacious room and wasn't dissapointed. The staff were exceptional. They spoke very fluent English and were always ready to help with queries. Only point to note it is a good 15 minute walk to Termini station but the weather was beautiful so it wasn't a problem. I will definitely go back to Londra and Cargill if I go to Rome again.", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "staffordshire", "Title": "“Brilliant”", "Author": "AliG25", "ReviewID": "UR115890493", "Content": "I booked a 3 day break to Rome as a suprise for my husbands 40th birthday and was rather nervous cause he usually deals with holidays. We arrived at the hotel and was greated by smiles and polite staff who opened the door, sorted our booking out and took our luggage to our room. The room was very comfortable and a nice temperature due to the air con., my only critisism, with liking a cuppa it would have been nice to have tea making facilities in the room. The reception staff were very helpful with really good english. The food was lovely and the lounge area comfortable but drinks at the bar are pricey but no more than the rest of Rome which is very expensive. The walk into Rome was about 10 mins but it is an enjoyable stroll after a nice evening out.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Ridiculously disorganised staff. Never returning.”", "Author": "londonj1", "ReviewID": "UR115631701", "Content": "I stayed with my family at this hotel for 4 days, thinking we would enjoy a short break exploring sights in and around Rome for the first time. How wrong this was. Indeed, the breakfast was comprehensive (only cold dishes were included) and the rooms comfortable, as would be expected of a \"4 Star Luxury Hotel\" in a major European city. Free wi-fi was a plus. Otherwise, little springs to mind which would suggest such a service. The location is neither \"unbeatable\" nor \"in Rome city centre\", as advertised, a good 15 minutes' walk from the Spanish steps, and 10 minutes from any metro station. Not once did we eat well within walking distance of the hotel. Upon arrival, the reception had great difficulty finding our names on the system, initially making it seem like our fault- we hadn't made a booking for that day. We thought nothing of it, as they eventually sorted it out. The next morning, we were told the Roma passes for each of our party (4 in total) that had been booked and paid for with the rooms were not available, as the city had run out of passes a few weeks ago. This pass offers free use of all transport, free entry to 2 museums and reduced entry thereafter, and usually would cost €25 each. Again, we were extremely unimpressed with the disorganisation of the hotel, having given them months of notice with an early booking. To appease us, the receptionist offered us 2 baskets of fruit; hard graft to equate to 4 €25 passes, but better than nothing we thought. On the penultimate day of our stay, with promised fruit yet to materialise, we had to approach the desk to find out what had happened: they had forgotten. Alas, checking out, the greatest fiasco yet. We'd arranged previously with the hotel that we would travel ourselves to a sight close to the aeroport, and at 17.45 a hotel car, with our luggage in, would meet us at said sight to take us to the aeroport. Silly us for not discussing the price, a ludicrous €95, particularly when the service to the aeroport would have only cost us €45. By adding under 6km to a 31km journey, we would be charged over double the price. Hotel Londra & Cargill didn't seem to understand such absurdity, even trying to stretch out on Google Maps the 6km. After an hour of stasis, they finally relented and the manager arrived at the desk, who immediately offered to lower the price to €60. Not entirely happy, but already an hour of our last day in Rome wasted, we relented and left. So we waited at 17.45, just where we were told. And we waited some more. Until at 18.15 we placed this international call to the taxi driver, only to be told he was still in Rome, would be another 45 minutes, and had never travelled here before. Missing our flight had never before seemed such an apparent possibility. And, surprise, when the driver finally rolled up at 19.00, heavily sunburnt, we learnt again the hotel was to blame: they had told him to pick up the luggage from the hotel at 17.45. If it wasn't us, this would have now been hilarious.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great service, average location”", "Author": "katieellawarren", "ReviewID": "UR115425008", "Content": "Stayed here for 3 nights earlier this month and would recommend it based on the service of the reception staff, and the room size. However, if i was to visit Rome again, i would choose a more central location as in the July heat, this is not as near to the landmarks as other reviews would suggest and if you only have a few days to visit then you could be better positioned to save your feet!!! Breakfast was average, Rome however was stunning!", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dayton, Ohio", "Title": "“A great find in Rome”", "Author": "NCSTATEGUY", "ReviewID": "UR115156728", "Content": "First time staying at Londra and Cargill and I will be back. Much of this review will echo others, but I guess that just shows consistency? Great location in a quiet neighborhood. A bit hard to find for our cabbie, but once we learned to use the hotel map to show them, it became much easier. There are several really good restaraunts within a 2 minute walk from the hotel. We did not make it to all of them, but had great meals all around in the ones we did try. There is an outstanding gelateria 1 minute from the front door that is just packed at night. I know because I made it a mission to be there every night. There is a nice cheese shop and little grocery right across the street. The Termini station is a pretty easy 10-15 minute walk. Via Venuto is just around the corner, but with it comes much higher prices for everything. We had a pleasant walk to the Spanish Steps and Piaza Navona (sp?) It was 100 degrees that day so we cabbed back. Only E 6.50!! Well worth it. Our room was very nice, especially by Italian standards. Very spacious with a modern bathroom. (hint: ask for a room on the courtyard side. The street side can get pretty noisy at night) The bar is just average and priced much higher than surrounding venues. The continental breakfast is good if included in your price, but not worh paying for. (As another reviewer noted, this is for a fact the Delta Airlines crew hotel in Rome) The staff does a great job in helping with any type of arrangement and their English is excellent. I have stayed at many hotels across Italy and this is one of the nicest overall. Great neighborhood, service and rooms. What more can you ask for?", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Minneapolis", "Title": "“Good location, good value”", "Author": "bdouty", "ReviewID": "UR114996302", "Content": "Spent two nights here, clean modern rooms and bathrooms. In a quiet area, it is an easy walk to quite a few nice restaurants (we enjoyed La Pentolaccia and Lo Stil Novo) and to Via Veneto, and we also walked to the Spanish Steps/Villa Borghese area without too much trouble. Decent breakfast in a nice dining room - appeared to be the Rome base for Delta pilots and flight attendants, as they filled the dining room both mornings.", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Romania", "Title": "“Hidden Gem”", "Author": "Dipnomad", "ReviewID": "UR114891367", "Content": "This place is tucked away a bit, but in a very good location, close to Via Venetto and Villa Borghese and surrounded by many tasty restaurants. The staff was extremely friendly and helpful, and the breakfast was great! The room was very nice and large for Europe. Overall, a great stay!", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Kennett Square, Pennsylvania", "Title": "“A very good hotel well located in Rome”", "Author": "D_Baggy", "ReviewID": "UR114691907", "Content": "We stayed at Londra and Cargill in Rome for four nights. The hotel was within walking distance of the train station in a quiet, affluent neighborhood. Our room was very large and airy with modern furnishings and decorations. The room was well lit through two large windows, though the view out of them was only of residential rooftops. There were several very nice restaurants within easy walking distance. The metro was about a ten minute walk. The staff was helpful and friendly. Breakfast was a typical continental buffet. This was the only hotel where we stayed in Italy that had fast, free, reliable WiFi access that actually worked.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great hotel & great location!”", "Author": "LizA179", "ReviewID": "UR114337570", "Content": "My husband and I just got back from Italy. We stayed in Rome for a week at this hotel in an upgraded room suite. The room was modern, spacious, always immaculately clean and tended to on a daily basis with towels and crisp white linens. The hotel staff was also very friendly, courteous and helpful to us throughout the week. We loved the location because it was within a short walk to the subway, shopping and other tourist attractions and yet it was tucked away from the main streets so it was quiet and relaxing. Our experience was very positive and we highly recommend this hotel.", "Date": "June 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great service.”", "Author": "farmerwaydee", "ReviewID": "UR112701276", "Content": "I stayed here with my wife and her parents for a week. The staff were excellent and the facilities very clean and well equipped. Continental breakfast was good. Locstion is good for most sites with good bus and metro favilities in reach.", "Date": "June 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Peachtree City, Georgia", "Title": "“Wonderful hotel...great staff”", "Author": "Jimbo-PTC", "ReviewID": "UR112601856", "Content": "Stayed here with 2 other couples...from the doorman, to the front dest, to the bartender, very attentive staff. They were always ready to help with travel plans, and made good suggestions which we incorporated into our visit. Very professional staff. Rooms were spotless, nothing but good things to say about our visit.", "Date": "June 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "", "Title": "“Quiet, modern amenities”", "Author": "ChiGal12", "ReviewID": "UR111790541", "Content": "My husband and I just got back from a trip to Rome. We decided on this hotel based on other tripadvisor & expedia reviews. We stayed here for 7 nights. The location is just outside of central rome, but an 15-minute walk to piazza republica & termini station. We took a train to the Colosseum, Florence & another day to Frascati. So access to Termini was great without dealing with all the noise that's by the station. Ended up taking a cab to vatican due to a strike of the Metro - so be sure to check with the front desk, they'll keep you posted.Vatican is accessible by train too. Walk northwest and the Villa Borghese and Borghese Gallery are closeby. It's on a quiet street in a neighborhood and seems like a business district too. saw a lot of bank offices. The room itself was great. It has all the modern amenities including wi-fi. The bathroom was a great size (and modern!) especially by European standards. The room was a good size with a King size bed two night-stands a desk and lots of walking room in between. We did not feel cramped at all. They had breakfast everyday (included in your reservation) which also helped us save money. It was a pretty good selection of food. We ordered cafe americano everyday and they serve it with steamed milk....so good! Front desk staff spoke English very well. They were all helpful in mapping out directions for us, calling for a cab or car service. Bell & waitstaff were all friendly - most speak English too. We found a darling restaurant...nothing fancy, but they were so friendly and the food was great. Dinner for my husband and I was about 65 Euros including wine, appetizer, 2 entrees, 2 dessert. It's called Ristorante La Cantinola - will write a separate review under restaurants. It's on Via Calabria. Another good one - was Taverna Flavia. If you like seafood, order the grilled calamari...so good! Definitely recommend it! It's a little more expensive ($265/night plus rome city tax - 3 euros per person) than others but worth it because we felt so comfortable during our visit. I hope we get another opportunity to go to Rome again and if we do, we'll stay here.", "Date": "June 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Great location, comfortable rooms, beautiful area”", "Author": "AndrewReese", "ReviewID": "UR111656350", "Content": "The hotel was nice. It had a small bar downstairs and a very nice breakfast in the mornings. There were some great restaurants just around the corner and the best gelatto that I have ever had in my life is less than a half of a block away. They also helped us rent a scooter while we were there. It was a bit frightening at first, but after a few hours, it was lots of fun to have a scooter in Rome. They were very helpful in getting us around Rome as well. The best part about this hotel was the location. You are in this beautiful neighborhood but only a few blocks from one of the main fountain round abouts. the price for the value was really great. they also had free internet. That does not sound like a big deal in the states, but in Paris where I was paying more than 600 dollars a night and still had to pay 22 Euro (Almost 35 dollars per day) for internet access, this was a very nice feature of the hotel.", "Date": "June 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Modesto, California", "Title": "“Clean and comfortable, and roomy”", "Author": "caliprof", "ReviewID": "UR111256440", "Content": "We stayed here in a superior room at the end of a hallway, which overlooked a quiet courtyard. The room was spotless, and it and the bathroom were large by city standards, and had everything we needed as a home base for our two-weeks' visit. The staff was relatively helpful and very businesslike and professional, and competent in English around the clock. Breakfasts consisted of mostly pastries, cereal and ham and cheese sandwiches, with coffee of all varieties, though we heard the waiter say eggs were available at extra cost. It was adequate, though it didn't compare to the lavish breakfasts we had at hotels in Venice or Florence in other vacations. One thing that makes me recommend this hotel is the \"green\" ability in place: electricity is saved by placing motion sensors in the hallways, so lights only come on as you walk through, and each room has a slot where you place a special key when you enter the room that enables the electricity. When you leave the room, you have to remove it, and all the electricity is disabled for that room. The savings must be terrific! I wish American hotels had this. There were several excellent restaurants within a few small blocks, and an extremely popular gelateria is half a block from the door, though it was always overflowing with locals. Main streets are nearby, the Via Veneto is a short walk away, the Borghese Villa and its huge park are very close by, and we comfortably walked to or from most tourist areas in the city, except for the Vatican, which is a bit far. (The hotel is located in the northeast quadrant of most tourist maps.) It was in a safe area, well-lit at night, and very, very quiet for sleeping. All in all, I can easily recommend this hotel for tourists from anywhere. A few airlines had flight crews that regularly stayed here on layovers, if that's any indication.", "Date": "June 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Excellent choice”", "Author": "Chksrgn", "ReviewID": "UR110034047", "Content": "This was in an excellent location- quick 10 min walk to the Termini, and central to most everything else. For Europe, the room was quite large, and the neighborhood was quiet and quaint. The hotel staff was pleasant and helpful, and the free WiFi throughout the hotel was convenient. I would ABSOLUTELY!!! stay here again, especially for the affordable price.", "Date": "May 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Lovely Hotel!”", "Author": "Clarever", "ReviewID": "UR107704067", "Content": "Really enjoyed the stay in the Londra and Cargill hotel. The area is lovely and quiet, and there is an amazing Gelateri just two seconds from the hotel, heavenly ice cream. 3 very good restaurants just around the corner, perfect when we came back from touring the city. The room was located at the very end of one of the corridors and it was really quiet and peaceful. Great breakfast, if you like your cake you'll be in heaven. Will definitely go back and would highly recommend. The location is excellent, 15 - 20 mins walking to main attractions, but the streets are so beautiful on the way that its part of the adventure.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Brilliant location”", "Author": "pafrost", "ReviewID": "UR106843513", "Content": "What a wonderful hotel - excellent and helpful staff and great breakfast. No evening meals but with 2000 Italian restaurants on the doorstep why would you want to eat in a hotel. Easy location for main tourist sights and main station; safe area being close to British and American embassies. Taxis available within 2 minutes to all parts of the city (maximum fare we paid was 12euro to the Vatican).", "Date": "May 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Retford, United Kingdom", "Title": "“Lovely location, staff professional and friendly, nice room and breakfast”", "Author": "Frisko78", "ReviewID": "UR105175352", "Content": "Location was perfect, only 10 minutes from the metro, but quiet and with nice shops / restaurants all around it. Very peaceful. The staff at the hotel were professional but also friendly - they made us comfortable so we asked them for advice when needed. When we had an issue with some noisy guests, they sorted it out quickly and efficiently. Breakfast was lovely with plenty of choice, and several waiters looking after us throughout.", "Date": "April 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Fantastic Hotel”", "Author": "Vaniades", "ReviewID": "UR103084670", "Content": "We spent three fantastic days at the Londra e Cargill hotel. The place is close to Via Veneto, at walking distance from the Spanish Steps, and Trevi Fountain. The area is very quite and nice, surrounded by elegant buildings. The hotel room was incredible: we had a bedroom a large bathroom and a living room. All very clean and modern. Buffet breakfast was included: very good quality food and nicely presented. The staff was very helpful in answering queries and organising transport to the airport. We travel extensively and stay in luxury hotels. We definitely highly recommend this hotel.", "Date": "April 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Excellent hotel, pleasantly surprised!”", "Author": "D_Nicole85", "ReviewID": "UR101265564", "Content": "I can't say enough positive things about this hotel. We were accommodated with a fantastic room (though, the TV was really tiny.. but you don't go to Rome to watch TV), lots of space in the room as well as the bathroom. The halls were lovely, the elevator spoke in Italian/English, and the complimentary breakfast was some of the best food I had the whole trip. The afternoon/evening staff was extremely helpful and friendly, and the location was great. Very close to Termini station (though we were majorly scammed by the taxi, for a 5 minute ride he took the scenic route and charged us 28 euro for a 5 - 8 euro ride!!), and Barberini station which will get you the metro to all of the sites. We saw a lot of crazy things in Rome, and it was wonderful to have a safe haven to go back to. I definitely plan on staying at this hotel every time I go to Rome.", "Date": "March 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Manama, Bahrain", "Title": "“Courteous front office and housekeeping staff”", "Author": "Arpetizor", "ReviewID": "UR98163265", "Content": "We we had booked 1 Suite (4 persons) + 1 triple room from 16/07/10 to 20/07/10.We booked this through the internet . We were greeted by very courteous front office staff. Since we had booked a triple room we expected the room to be spacious but initially we were given a very small dingy room with barely any light which was on the 4th floor. Later they shifted us to a larger room which was very spacious, airy and had a lot of light. the house keeping staff was very courteous as well. The breakfast which was included with the room rate was not much to talk about. Al lot of cold cuts and more of a ready to go breakfast. The bar had a very helpful lady bar tender but the bar closes i think by 10 pm. The location is not too bad since there are lot of bus and tram stops everywhere but we choose to use the taxis. Very nice home made gelato shop right next the hotel. There is no 24 hours room service. The restaurant is only open for breakfast. The hotel staff are very willing to arrange for taxis wherever you want to go.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great hotel - much better than I even expected”", "Author": "lineofsight", "ReviewID": "UR96805226", "Content": "Booked hotel through the hotel website (group of 6). I also booked transfers through the hotel website. The transfer booking was a bit confusing as the website asked us to contact the hotel with flight information once the online transaction was complete. On the confirmation e-mail the only contact information was the hotel phone number and a generic \"info@\" e-mail address. I coordinated through e-mail the transfer details. I learned that the transfer is not actually charged when you reserve the rooms, but is billed on checkout. I can not say enough about how professional and well handled my transfer was, even with an itinerary that changed requiring a change in arrival date. The free hotel breakfast was amazing and far above anything else I have experienced in Europe. No eggs and bacon but meat, cheese, pastries, cakes, cereal, yogurt, fruit, milk, five differnt juices, coffee, expresso, capuchino, tea and Great breakfast service! We gladly left a tip for our breakfast waitress each morning. Hotel front desk personnel speak excellent english and are above and beyond helpful with tourist info, restaurant reservations and recommendations, transportation help, reliable prompt wake up calls and provided all around great service. Rooms were nice, very clean, sheets were pressed, bathrooms had hair dryers and a voltage converter built into the wall (still need an adapter to the standard Europe two prong plug). Soap and shampoo were provided and plenty of high presser hot water. The towel warmer was a nice touch the ladies in our group appreciated. Location is in a nice quiet neighborhood with a few very good restaurants nearby and a gelataria around the corner. A 10 minute walk gets you to the Metro. 15 minute walk to Trevi Fountain (nearest big tourist attraction).", "Date": "February 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Tipperary, Ireland", "Title": "“Lovely hotel with exceptional staff”", "Author": "shazd039", "ReviewID": "UR92781253", "Content": "This hotel is about 10/15 mins walk from the nearest Metro stop but does have a bus stop round the corner which will bring you to the metro. While its not dead centre of everything, its within very easy reach with the excellent transport system. It is worth staying purely for the exceptionally friendly staff who went way out of their way to be friendly and extremely helpful with tourist info/directions etc. They recommended and booked restaurants for us each night, which was wonderful and no question was too much to ask of them. This service to us made our visit twice as enjoyable and we could not fault this hotel and would def. recommend it highly.", "Date": "January 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Washington DC", "Title": "“Classy hotel in a central, quiet and convenient part of old town Rome”", "Author": "nymphaeus", "ReviewID": "UR90501576", "Content": "Hotel Londra & Cargill is located in piazza Sallustio, which is a lovely square a short walk (15 mins) away from Termini railway station. In the piazza itself, the ancient half-buried riuns of the \"horti sallustiani\" (Roman gardens developed by the historian Sallust in the 1st century BC) make a magnificent and a little-understated display, surrounded as they are by parked cars and many apartment buildings. The area is very lively and offers plenty of restaurants. As far as the shops are concerned In this sarea it will be easier to find a dry-cleaner or a electrician than a pair of Gucci shoes ... But this only makes it more interesting and authentic. The hotel is elegant, formal, and very well maintainted, with fairly sized rooms for the Roman standard and classical furniture, fit for a romantic weekend or a business meeting. I nave made it in time to the breakfast room, but was very happy to pick and choose among the many bars located less than a block away from the hotel. At night the area is very quiet and removed from the buzzing noise of scooters and tourists in the more central parts of the city.", "Date": "December 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belgium", "Title": "“Just great”", "Author": "Fodara", "ReviewID": "UR90136973", "Content": "I stayed at the hotel just a few days ago. Great location for an affordable price. Staff extremely helpful and polite. Rooms (mine looked a bit like a small apartment with a sofa, a separate room for clothes and huge bathroom) are great. I was on the 1st floor in a room overlooking a garden/terrace therefore no street noise. No problem with internet and also great breakfast. I will go back to Rome for work and surely from now onwards I will stay at this hotel.", "Date": "December 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "cardiff", "Title": "“Pretty Good, although WI FI was an issue.”", "Author": "seivad79", "ReviewID": "UR88826540", "Content": "Stayed at this Hotel for one night at the end of November 2010. From what I experienced it was a pretty good priced hotel. Rooms were clean and warm, Bathroom was nice and the staff were very helpful and polite. Breakfast was not out of this world but what is expected in Rome. The only thing which I didnt agree with was the WI FI access. The website states free Wi Fi through out the Hotel, however as soon as you get into the lift up to the floors I was'nt able to pick up any wi fi options. A small point I know, however if you are relying on Wi fi for the bedroom you will have to re locate to to foyer.", "Date": "December 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Berlin, Germany", "Title": "“Very solid value for Rome”", "Author": "Worldwanderer67", "ReviewID": "UR88697494", "Content": "This hotel is a good value for Rome. Located not too far away from Via Veneto and handy for Termini without being a \"a hotel behind the station\" in a safe and quiet location. Despite our early arrival we were shown to our room after a short wait. It was immacculate, fitted with a new marble bathroom and a comfortable bed with crisp linen, of a reasonable but not too big size and nicely decorated with a certain class. Luggage was delivered promptly. A good continental breakfast was served the next morning by very welcoming staff. We left the hotel with the impression that these people were proffessionals who know their job. What else can you ask for?", "Date": "November 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“great hotel in the business area of rome”", "Author": "citygirl033", "ReviewID": "UR87973639", "Content": "a group of 8 have just returned from a trip to rome. hotel was very nice, clean and hotel staff were very friendly. breakfast was sufficient, continental only but plenty of it. Its a 10 minute walk to republicca metro, where you can access all areas. there is a few restuarants in the area, but quiet other than that. we bought the 48 hour hop on/off bus for 20 euro. its a good way to see the sights and to get to know the city. you can get your tickets in the republicca area, you will see the buses there. ours was the red bus, 110. i would recommend a separate tour for the vatican. be careful though, we were conned. we were approached by a tour guide who offered our group 20 euro a head for the tour. they omitted to tell us that it is a further 20 euro into the vatican. we waited about an hour and a half in the very heavy rain as they were getting more people for the tour. we had to go to their office on the way to the vatican to pay the money. if you dont want a tour guide, i would recommend that you go to the vatican at around 15.00 as there are no queues and buy your ticket there for 15 euro. you can but before you go on the vatican website. the restuarants around the vatican are rip-offs. so please avoid. the sistine chapel is not open sundays.", "Date": "November 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Ok for Quiet Out Of the Way Hotel”", "Author": "CindyRella_10", "ReviewID": "UR86578033", "Content": "This hotel is close to Borghese and therefore out of the way for most of the must see attractions in Rome. It's situated in a business district, so restaurants within walking distance are not always open at night, but that makes the streets quiet at night. The front desk was cordial, and the breakfast adequate. Rooms were good, and the bathroom was nice. I would not recommend this based only on the location - it is blocks from the nearest Metro and a 15 minute walk from the Termini.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "munich", "Title": "“Nice hotel in a quiet part of Rome”", "Author": "ifbourg", "ReviewID": "UR81103211", "Content": "The hotel has modern, big and clean rooms. The staff are friendly and helpful. The breakfast is saitisfying. As ti concerns its location,the hotel is next to the Villa Borghese., about 15-20 minutes walk from the nearest subway station, though there are bus stops nearby. So, it takes place in a quiet, relaxing neighbourhood but it is a bit far from the main attractions of Rome like the Colosseum, the Tiber river or Vatican City", "Date": "September 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“If you find a good deal in their web site, don't hesitate: take it!”", "Author": "FabioColletto", "ReviewID": "UR78923658", "Content": "I decided to book this hotel directlty from their web site when I found a 3-nights weekend package for about 90 euros per night. I believe it was the best deal I could have done for our stay in Rome. It's a very good hotel with a decent breakfast (included in the price). It's a big hotel used by some airline crews was well, so don't expected to be treated as you were in a family run tiny hotel. Nevertherless, some of the staff was king, they booked the restaurants I asked and gave some brief directions when we asked for. We got a room in the corner, which was really big for europeans standards. The bathroom was also large, including a good bath tube. The location was very good for what we were looking for: in the city center but not in a very touristic area. We took about 10 to 15 minutes walking to the main toutistic attractions and some times to a bus to get back. There are also some good restaurants near by and a excellent \"gelateria\": Il Caruso!", "Date": "September 9, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great value with breakfast included”", "Author": "Travelers804", "ReviewID": "UR71956344", "Content": "Londra and Cargill offers comfortable rooms with comlimentary internet for an excellent value. The bathroom is spacious and offers quality bathroom products. We enjoyed a great breakfast buffet with a variety of options and good coffee. The mattress and pillows were very comfortable, but the comforter was thin and a little scratchy. The location is within walking distance of the Spanish Steps, but it is not a short walk (20-25 minutes). The air conditioning worked well, which was a must during the summer. The hotel staff were just okay. Their directions were minimal and they didn't offer additional information. They did their job, but didn't go beyond the basics. The wait staff at breakfast were much more accommodating than the front lobby staff, who at times made us feel that we were inconveniencing them when asking for support with transportation. Overall, we liked our stay at this hotel and would stay again on a return trip to Rome due to the great value.", "Date": "July 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Avoid in July- the air conditioning is the rooms is useless !!”", "Author": "July2010_16", "ReviewID": "UR71556615", "Content": "Have literally just returned from a trip. It was our wedding anniversarry. The hotel looked great on the internet and we thought we were getting an excellent deal. We travelled club from London Heathrow so were looking forward to a bit of luxury- we got this all the way, but not at this hotel !! The staff were OK, but don't go out of their way to help. The chap on reception even directed us in the wrong direction to get tickets for the bus to go to the Vatican !! The main thing about this hotel however is the lack of air conditioning in the bedrooms. The temperature in Rome at the moment is about 41 degrees and the air conditioning in the rooms is useless so I would definitely avoid this hotel in the heat. Also, the pictures on the internet are better than the real thing so don't be mislead.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "athens", "Title": "“this hotel made our stay in rome unforgettable!!!”", "Author": "nikifotiou", "ReviewID": "UR67089894", "Content": "From the moment we arrived the people at the reception made our day since they upgraded us to a suite. the hotel is located in a beautiful location , very quiet, with nice buildings (mostly embasies) , beautiful traditional restaurants & cafes just across the road. The hotel is just 15 minutes walking distance from all the major city attractions and via de l corso where all the shopping is very happy with our hotel choice! in the room we also had free WiFi access sooooo ....... we will definetely be back!", "Date": "June 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cambridge, England", "Title": "“Quiet location”", "Author": "melbourne237", "ReviewID": "UR65346400", "Content": "We stayed in a junior suite and was not disappointed. Very large room with two large patio windows that opened up onto tiny verandas, but was very welcome in the heat of the day. Very clean hotel and room. No internet connection. The location is very quiet and peaceful and therefore you have quite a walk to get anywhere central. If you want good shopping, don't head for the centre but to the other shopping area some 5 minute walk away in the opposite direction. Its where the locals shop and far better prices. Excellent restaurants there too. An excellent hotel if you want to get away from the crowds and noise but a bit too far from the centre.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Colorado", "Title": "“Nice hotel, Good location”", "Author": "ColoradoFlipflop", "ReviewID": "UR58329813", "Content": "I stayed there 3/8/2010 -- 3/10/2010. The hotel was perfect for what I wanted to do. It was within walking distance, 20 minutes of the Fontana del Tritone and from there 10 minutes of the Spanish steps and from there 10 minute walk of the Fontana di trevi.The bus line on Del Corso will take you to the collisium for the fare of 1 euro. It is a 5 minute bus ride. Then retrace your steps back to the hotel. You will run into 2 super markets following these routes back to the hotel. small but they will do. 1 1/2 blocks from the hotel on Piave you can catch the bus to Termimi station,it is a 7 minute bus ride.for 1 euro. The best food is in the Tritone square. Hotel was clean and we felt safe.", "Date": "March 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "washington DC", "Title": "“Good location for tourist visit to rome”", "Author": "Stevep5553", "ReviewID": "UR57018318", "Content": "Hotel is located in quiet district very safe and quiet though about 15 min walk to the center ( a bit of a hike), Rooms are however very clean and you can get a very good rate fro the standard of the hotel and buffet breakfast is included. Room are average European size , not frill in the hotel , no dinner restaurant although lots of options nearby to eat. A good base for exploring Rome but you need to be prepared to walk. I would use again if in Rome.", "Date": "February 24, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Prague", "Title": "“Nice rooms, nice location - don't eat there, service could be better”", "Author": "LudoPrague", "ReviewID": "UR53742325", "Content": "Nice location, quiet, rooms are ok. This hotel doesn't have a proper restaurant, they hire catering from external companies and this is not good. We had a group of 70 people and the food was constantly cold + service not good. We also had an issue with the rooms, around 10 of us were put to other hotels as they had a crew from Delta airlines that had not left the hotel. We did our booking weeks in advance and the hnadling of that issue was really poor, some people got upset and the hotel has done nothing as a compensation...really a pity because otherwise, the hotel is ok", "Date": "January 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "5"}, "AuthorLocation": "St. Paul", "Title": "“Nice rooms, quiet street”", "Author": "wrldtrvlrStPaul", "ReviewID": "UR53611759", "Content": "My room was lovely, more spacious than I anticipated, and had a large bathroom. Very clean. Located on a quiet street. It is true that it is quite a hike to walk to attractions, but it's Europe. Put on your walking shoes and just go. Would recommend- nice find.", "Date": "January 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“A Nice Hotel”", "Author": "P16", "ReviewID": "UR15185548", "Content": "The Hotel is Fine. Nice walk to most historic locations in Rome. Reception staff were very friendly and helpful at all times. Rooms are a good size, comfortable and kept clean. Breakfast is not great. Limited selection of food to choose from. Otherwise a nice hotel", "Date": "April 21, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“nice place but not in the city”", "Author": "aysh", "ReviewID": "UR8828494", "Content": "We stayed in the Londra and Cargill Hotel between the dates 14-18 Sept. The place was OK. but is not very close to the city, should take a cab or a bus to go to the touristic places. There was a bad odor in room we first checked in. So we asked to change our room. The other room was fine and more spacious. The place is clean but need some repair in some places. The staff is helpful. OVERALL you may try to find some place nicer and closer to the city for the same price, if not that might be a choice...", "Date": "September 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Thessaloniki Greece", "Title": "“Nice clean and cozy hotel”", "Author": "gpissio", "ReviewID": "UR6555027", "Content": "I stayed with my family from 30th Dec. untill Jan. 3rd. Don't know about the price since we were travelling with a prepaid group trip, but the door price of 300euros seems a little opimistic to me as is the four star grade of the hotel. My complain basically based on the poor breakfast that they offer. Only ceareals,jam,honey and some salami and cheese.They charged me 7 euros for an extra omelet!!! After all Rome is a very expensive city... !!! Anyways the stuff was helpfull and friendly, rooms were very clean and spacious with the bathroom being very well equiptped.The location of the hotel is pretty closed to Via Venetton thus is the Spanish Steps too.It is recommended for travellers and for businessmen.", "Date": "January 5, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Istanbul", "Title": "“Walking distance to the center”", "Author": "chipman75", "ReviewID": "UR6550690", "Content": "We have stayed at this hotel from 30th of December and has just turned last night on the 3th of January. During our stay, the room service,the cleanness of the rooms and the helpfull manner of the guys in the reception was great. We have stayed at the room number 112 and there is no view but you do not go to a holiday to stay at the hotel room. And I can surely tell that it is just 10 min to the Spanish Steps and other central locations by foot. I think you have to try.", "Date": "January 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Newcastle upon Tyne", "Title": "“Good Value Hotel”", "Author": "Gosforth_Ultra", "ReviewID": "UR5539408", "Content": "Booked the hotel through venere and for 100 Euros a night it was an excellent deal. Rooms very spacious and nice (could have done with a bit of a more effective AC mind you!) and we found reception staff friendly enough. It's a little out of the way, but not as far as it looked on the maps - maybe a 30 minute walk to the Trevi/Pantheon? Breakfast good, all in all I'd recommend it. As another tip, there is a FANTASTIC little restaurant on the Piazza Sallustio. I don't remeber it's name but it is owned by an ex-jockey and there is a picture of a horse in the window (!!). The food and atmosphere was magnificent and very affordable - seek it out!", "Date": "August 2, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Drumcondra, Ireland", "Title": "“Loved the Londra Hotel Rome”", "Author": "Vales", "ReviewID": "UR4986264", "Content": "We loved this Hotel It is in a safe and quite area The reception staff were excellent, very friendly and knowledgeable The breakfast buffet was good Juice, Cereal, Fruit, Breads, Ham and Cheese etc The rooms were nicely decorated fresh and clean and the bathrooms a good size for Rome modern and clean We stayed on the 5th floor They have a bar in the lobby and have a light menu available There is shopping near-by, a branch of Rinacentre there is a good Alimentari Wine /Meat, a Veg/Fruit shop and a fantastic Cheese Shop around the corner(ideal for a summer pick-nics) The hotel is within walking distance of the Galleria Borghese/Villa Borghese There is a small number of nice local restaurants, *Restaurant della Mairoi Via G. Carducci* packed with local office workers at lunch time, not much to look at but oh! the food, look for the review from the Times on the Wall or ask for advice at reception as there is one very close to the hotel that is awful, (Al 56) also near-by Wine Bars + a Jazz Bar. A 10 Euro Radio taxi ride Inc pick-up charge and tip took us anywhere we wanted to go to from this hotel", "Date": "April 18, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“A nice little find!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2580749", "Content": "This was our first internet booked holiday and we were a little cautious as the price appeared cheap compared with hotels with less stars. We need not have worried. It was a short distance to the centre of Rome but, being built on a piazza in the financial district, we felt safe and it was a very quiet location. We felt that it was a definite advantage being just outside the centre and it was only a couple of minutes walk to a bus stop to the railway terminal/bus station. There was air conditioning and the towels and linen were changed daily. The reception staff were friendly and helpful and the breakfast was a buffet which consisted of a juices, cheese, ham, yoghurt fresh and tinned fruit, rolls and croissants.", "Date": "September 17, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Boulder, CO", "Title": "“Would not recommend”", "Author": "A TripAdvisor Member", "ReviewID": "UR1428885", "Content": "A very nice hotel within walking distance to many of the sites of Rome. Located in the financial district; this is ideal for the business traveler. The downside of this hotel was the rudeness of the front desk staff which tried to create the feeling they were doing us a favor when we arrived.", "Date": "October 30, 2003"}], "HotelInfo": {"Name": "Hotel Londra And Cargill", "HotelURL": "/ShowUserReviews-g187791-d232853-Reviews-Hotel_Londra_And_Cargill-Rome_Lazio.html", "Price": "$140 - $319*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">18 Piazza Sallustio</span>, <span class=\"locality\"><span property=\"v:postal-code\">00187</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "232853", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/98/1e/981ed076ac408b8002044762678c1a1a8large.jpg"}}