{"Reviews": [{"Content": "Worth A Try - But My wife and I stayed here for one night after seeing the hotel a few weeks earlier during a visit to Florence. At 90 Euros for the night it was not the cheapest hotel in the city but it certainly was far from the dearest. We were impressed by the room and the bathroom on first siting but then discovered that there was no airconditioning. My enquiry at reception was met with that room does not have airconditioning but no offer to move us to a room that did. We have stayed in cheaper hotels in Florence that had airconditioning and I was staggered that in this day and age a hotel that charges 90 Euros a night has rooms that do not have aircon.The tariff included breakfast but it was a pretty ordinary offering. The hotel is quiet, very clean and well located. If we go back to Florence I would be happy to stay there again but only if we are provided with an airconditioned room. If booking I urge you to ensure that you are provided with an airconditioned room.", "Date": "Dec 12, 2008", "ReviewID": "UR132233208", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3", "Value": "2", "Rooms": "2", "Location": "4"}, "Author": "Robboc"}, {"Content": "Value for Money Helpful staff - they speak good English,friendly but not pushy - professional. Clean rooms, central location. Furnished in good taste - rooms/bathrooms not too big, but practical. Breakfast nothing fancy, but you would not expect that from a 3* in Italy anyway - nice REAL coffee. Booked 8 rooms directly with hotel - reservations answered my request within 2hrs. We were a group of friends traveling with a 9 seater van (35 euro/day for parking ) , spent 3 nights in the hotel. Don't expect rooms with a view or jacuzzi in the bathroom, but you will get value for money. Hotel is honestly described on their website. Disregard bad reviews - Boccaccio gives the appropriate service!", "Date": "Nov 28, 2008", "ReviewID": "UR905582914", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "cro_erika"}, {"Content": "Great location We stayed one night, it was really easy to find which was a big plus in our opinion as we had luggage and with it only being five mins away from the train station, made it great. It was nice that on their website it gave good directions on how to reach it, not many I researched did. The room was clean, the shower bigger than most of the others we encountered in Italy. The hotel receptionist was very helpful, giving directions. I had read that it could be noisy, but with the window closed, and the air conditioner on, we didn't hear anything and had a good nights sleep. I definitely would reconmend this hotel.", "Date": "Sep 9, 2008", "ReviewID": "UR732045826", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "yvonnecolebert"}, {"Content": "Overpriced hotel in a poor location The hotel Boccaccio is a decent little hotel right next to the train station, the room was very clean and had air conditioning, TV and a very basic mini bar.FOODThe breakfast was very basic, a very simple continental breakfast, stale bread and croisants, cereal and a selection of jams. It did the job of easing your hunger, but for 拢100 a night I expected more than this.My main criticism though was by far the coffee. Let me just say that almost any Italian would be ashamed of this. It was weak and tasteless. As anyone who has been to Italy before knows, the Italian coffee is outstanding and I was really looking forward to my morning coffee, it was such a dissapointment.LOCATIONIts excellent for getting to and from the train station, but the hotel is a fair distance from the main part of town (the old part), a 15-20 minute walk. This may not seem too much, but Florence is a hard city on your feet, there are so much tourists and the roads are so small and the very busy traffic mean that a 15 minute walk is a little tougher than usual.Also the part of the city is not somewhere where tourists should really be hanging out at night. Dont get me wrong, its not terrible, but its also not somewhere where you should let your guard down late at night.STAFFThe staff were very good up until the last day. My girlfriend had an accident where she knocked here head on a bathroom window, she ended up being taken to hospital by ambulance and having stitches. The guy at the reception was very good in getting the ambulance, but after we got back from the hospital he said we needed to leave the room immediately as new guests needed to check in. Seeing as my girlfriend had just lost a fair amount of blood and needed a lie down desperately (all of which he had see), I was not too pleased as you can imagine.OVERALLI have to say I cant put my finger on why I didnt like our room, it had everything, except a view, was clean and fairly comfortable beds, but I always had trouble sleeping there. Also there was a lot of noise outside our room and we were at the back of the hotel, the front is facing the main road to the station and was very noisy so the noise is probably an issue for most rooms.We paid 拢100 (Sterling) per night, and I thought for that price it was too much. Very average hotel and I wouldnt stay again. There are much better in the old part of town than this one.", "Date": "Sep 17, 2007", "ReviewID": "UR403142695", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "2"}, "Author": "SimonJGeorge"}, {"Content": "Wonderful boutique hotel! Excellent little hotel. Easy walk from the train station and all central attractions in Florence. Staff was very helpful and courteous. Great shower, small room but comfortable. Little balcony off the room. Small breakfast but adequate. I would stay there again. Fantastic bistros and trattorias within 2 blocks of hotel.", "Date": "Jul 19, 2007", "ReviewID": "UR111964122", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "AcaciaChicago"}, {"Content": "Perfect Florence Hotel on a Budget! We stayed at Hotel Boccaccio for 4 nights in March 2006. It was perfect in all respects - (i) within walking distance of the train station, but in a safe area, (ii) rooms were immaculately clean, (iii) free breakfast was a great way to start the day, (iv) staff was very friendly and spoke english, (v) it was in a great location that allowed us to walk anywhere in Florence and (vi) it was only about 90 euro a night. When we return to Florence we will definitely stay at Hotel Boccaccio.", "Date": "Apr 15, 2007", "ReviewID": "UR705793473", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Nokomis_Traveler"}, {"Content": "We enjoyed our stay We had 3 nights here in February. A great location (just a 2 minute walk from the main Florence SMN railway station). Excellent value for money. Clean and spacious bathroom. A small but comfortable room. An adequate breakfast included.The best thing about this hotel was it is a few doors down from a FANTASTIC PIZZERIA!!!! - serves really great Italian food at extremely reasonable prices. The best Pizza and Pasta ever. Visited mainly by Italians so I thouroughly recommend that Pizzeria where we ate every day - on the same side of the road as the hotel. If we are every in Florence again we will stay at this hotel.", "Date": "Feb 16, 2007", "ReviewID": "UR310289741", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "NewZealand-7"}, {"Content": "Mediocre room, convenient location Stayed here with my husband for 3 nights in November. We booked directly on their website since they only charge payment upon checkout as opposed to other sites that require immediate payment.The location was pretty convenient for us. It is very close to the Santa Maria Novella train terminal. We flew into Amerigo Vespuci airport and took the Vol In Bus (sp?) which drops you off half a block away. Another reason this was convenient for us was we got a rental car from Thrifty which was about 3 blocks away. Overall, hotel was clean, room was small but sufficient. Comes with small mini fridge which we used to keep our own drinks and yogurt cold. there is a small shop called Raja's in the nearby alley way that sells beverages for a fraction of the minibar price. We also got icecream cones from there for late night cravings.Breakfast buffet was very simple. Some rolls, ham, cheese, cereal and yogurt. Nothing to write home about but nice that it was included.", "Date": "Dec 1, 2006", "ReviewID": "UR476629235", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "4"}, "Author": "marzypan9"}, {"Content": "Fantastic Hotel! Fantastic Hotel. Stayed for six nights and had a fantastic time. The hotel staff were among the friendliest i have ever seen. One of the guys on reception took me up to Fiesole at night to see the most amazing view, they offered to upgrade me on the last night, and they offered me a bottle of chianti as i left. Fab,, fab, fab would recommend and will definately stay there again.", "Date": "Aug 22, 2006", "ReviewID": "UR462179722", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "englishteach"}, {"Content": "Stinking Room; Be Careful This was a bad hotel with which to do business. I booked two rooms through a hotel website with a credit card guarantee. It's always best to ask to see the room before you accept the key and sign in and pay. I didn't have the benefit of doing this because I traveled during high tourist season and wanted advance reservations.I was given one room designated non-smoking with a sign on the door number (106). The second room (101) stunk so badly that it burned my eyes and made me gag. I asked for a different room because it was so unacceptable but I was denied. The clerk would not go check the room. We all squished into one room. I did not accept the key to 101 nor did I stay in the room, didn't ask for additional towels and did not stay for coffee (left at 6:30am). The morning clerk would not check the room either and insisted that the rooms didn't stink and charged me for the room at checkout. I didn't sign the slip. The charge went through my bank for both rooms. This is bad business. Judith.", "Date": "Jul 25, 2006", "ReviewID": "UR144832257", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "judyskis"}, {"Content": "Great I thought this place was great, very nice updated room, two blocks from the train station, within a 5 or 10 minute walk of everything. Good value for the money.", "Date": "May 3, 2006", "ReviewID": "UR684591866", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Hotel Boccaccio!!!! We thought this was a very nice hotel. The rooms were better than we expected. The bathrooms were really clean, and the shower closet had great water pressure. The staff spoke English and were quite friendly with making dinner reservations or suggesting restaurants. The location was great, pretty much in the middle of everything. Plus breakfast was included every morning. For about 100 Euro a night, you'd be hard pressed to find anything better. I will recommend this hotel anyone I know traveling to Florence.", "Date": "Mar 27, 2006", "ReviewID": "UR265956197", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Nice Hotel This small hotel is very well decorated and maintained. The staff were helpful and friendly. The rooms were good sized as far as European hotels go. It is within easy walking distance of the main train station. when we were there they were doing major recontruction of the nearby streets, and this was a bit of a nuisance. Like many downtown hotels the street noise can be an issue if you prefer to sleep with windows open, but they had a good heating and air system, so closing the window was fine. The included breakfast was very good, and plentiful.", "Date": "Dec 7, 2005", "ReviewID": "UR451546233", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great Location Very well located hotel close to main train station at a good rate. Great place to stay for a few nights, the staff were helpful and took us in at very short notice. Being happy with your hotel makes the holiday more enjoyable and we really enjoyed Florence.", "Date": "Dec 1, 2005", "ReviewID": "UR440982889", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Location, Location, Location Hotel Boccaccio is a nice hotel -VERY close to the train station. The staff is wonderful and the breakfast is fine. The rooms are quiet, if pretty small. On the block is a wonderful, ancient perfumory and for the younger crowd, a hip, Irish tavern.", "Date": "Nov 22, 2005", "ReviewID": "UR259999786", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "Dr.X"}, {"Content": "Wonderful Hotel       Nice bed", "Date": "Oct 19, 2005", "ReviewID": "UR676560366", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "rhlinva"}, {"Content": "Enjoyed my stay I really enjoyed my stay at this hotel. It was in a good location, the staff was very friendly and helpful and the rooms were clean.", "Date": "Oct 16, 2005", "ReviewID": "UR558508426", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "LAGuy90019"}, {"Content": "Great stay!       Room", "Date": "Oct 13, 2005", "ReviewID": "UR495937359", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "cmenter"}, {"Content": "Good Location This hotel is VERY close to the train station. In fact, it is right around the corner. The bathroom was large and the room was small but everything was clean. It was a bit of a walk to main attractions, but not having to lug our luggage a long way made up for it. The staff was nice and the breakfast was good. Not a fancy place, but I would recommend it.", "Date": "Sep 29, 2005", "ReviewID": "UR283799325", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Excellent Location and a very comfortable Hotel We just returned from our long Italy trip and we stayed for 3 days in Florence at the Boccacio hotel. This is a great 3-4 star hotel situated within walking distance of the Train station (Firenze Santa Maria Novella)yet not on the adjoining street so you don't feel as if you are near it. It is very comfortable and the rooms are good size.It also has good air-conditioning and soundproof windows-which are an absolute must in this city.Besides, all the staff spoke good English and gave us excellent tips about travelling and sight-seeing both in Florence and also for our trip to PISA. The breakfast was also the best amongst the 3 hotels we stayed in Italy. We would definately go back to this hotel again. It has its own website so check it out.", "Date": "Sep 2, 2005", "ReviewID": "UR774588410", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "GAUKUJ"}, {"Content": "Close to the Train Station with friendly staff You can literally see the station from the front lobby of the hotel! The hotel staff is extremely personable, helpful and fluent in English. They gave us good recommendations of restaurants, sites and night clubs. The internet is cheap and breakfast is free. The only strange thing was the smell in our room which they claimed was the spray used to cover up cigarette smoke. A great value for any traveler!", "Date": "Aug 22, 2005", "ReviewID": "UR777242026", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Boccaccio would be ashamed! I booked this hotel for my mum and aunty whilst they were on a tour of Italy. My mum was taken ill and collapsed in Rome; she's still in hospital as I write this E-mail. I called the hotel immediately and informed them of the situation - explaining that she couldn't make it to Florence as she would need to abandon her vacation and return to the UK. The hotel had the audacity to send me an E-mail back saying that they'd have to charge one nights stay. I was utterly appalled by their lack of compassion. It's obviously apparent from their actions that the owners of this hotel have no morals or sympathy for their guests. I instructed my credit card company to decline the payment - although its looks as though the hotel must of debited my card as soon as they found out - when I checked my statement they'd deposited money from my card. I鈥檓 now pursuing legal action. Please think twice before dealing with this bunch of cowboys.", "Date": "Jul 20, 2005", "ReviewID": "UR670192799", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "-1"}, "Author": "markrandom"}, {"Content": "Great home away from home in Florence Our three day stay in Florence was made very pleasant by staying at Hotel Boccaccio. The write up for this hotel is truely correct in every way. Florenceby.com gave the most photos and description and that was important to me when making my decision on where to stay while in Florence. When I arrived at the train station with two heavy suitcases, I was happy to see the location was truely only 5 minutes away by foot and the walk was really easy.There where three of us in our room... two adults and 18 year old daughter... so room size was important. Room #108 was our room and although it was a perfect size for two it also did the job for three. The high ceilings made the room feel more spacious. We had a balcony and a very large ensuite with a jacuzzi which I enjoyed after a long day of sight seeing. The hotel has recently been renovated so everything was very fresh and clean. The staff at the front desk were very accomodating. We used the terrace twice on the first floor during the evening. Once for a picnic and the other to just sip wine. They provided us with wine glasses, cutlery and plates which was so perfect. The terrace faces the side street below but is screened so you feel quite private.Breakfast was more than you could ask for. Great coffees, juices, rolls and croissants, cereals, cheese, cold cuts, selection of jams. A great start to the day. Location was easy access to the Duomo and the museums and for shopping. There are many restaurants around the hotel so one did not have to go far. We did not have a car so this location was important.On the side street there was a small grocery store which was convenient for getting bottled water which was a third of the price from the main core of the city. They also had a nice selection of wine and beer...perfect for the terrace. The staff at the front desk and the breakfast room were very friendly. Stephano at the front desk ..always with a pleasant greeting and a beautiful smile was always there for us and helped in every way. This family run establishment was a real great find and I highly recommend it to anyone visiting Florence for a few days or just one night.Also one suggestion...book your tickets for the museums ahead of time. The line ups are very long and the tickets are sold out fast.", "Date": "Jun 29, 2005", "ReviewID": "UR534355620", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "rosemaria"}, {"Content": "A Gem! Just returned from Florence where I spent 3 nights at the Hotel Boccaccio. I couldn't have been more pleased with my experience! The hotel is just steps from the Santa Maria Novella train station, and is located within walking distance to most of Florence's main attractions: Medici Chapels, L'Accademie, San Lorenzo market, Duomo, etc. There are numerous cafes, restaurants, snack bars and pizzerias, not to mention numerous internet spots (though I opted for convenience and used the lobby PC). The staff is pleasant and helpful; when I mentioned I wanted to find out about a specific tour to the Chianti region, they sent me next door to a travel agency (which does, I believe, have some association with the hotel). In minutes I'd gotten a tour booked for the very next day. The hotel also made advance reservations for me for L'Accademia. A great convenience and time-saver for what appeared to be just a $2-3 service charge. Breakfast offerings included cold cereals, rolls, cheese, ham, juices, coffees, tea and was more than enough to last through a day's sightseeing. My single room was spotless and the A/C functioned well (good thing as it was about 90!). Shutters kept out both noise and heat. I also enjoyed (in the cooler hours) the pleasant first floor terrace. One of the nicest hotels I've stayed at in Europe!", "Date": "May 31, 2005", "ReviewID": "UR313013006", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "cls223"}, {"Content": "Stay here!!! Great hotel, location and price! This is a great place to stay if you're travelling by train. As you walk out of the right side of the SMN train station you cross the street, walk to your left and then make a right and you can't miss it! Less than 5 minutes walk. The staff is really friendly. The hotel is super clean. Our room was towards the back of the hotel and if you opened the windows there was some noise but tolerable. We normally kept them closed and shut any noise out and turned on the A/C. Overall the hotel was great and will return on our next visit.", "Date": "May 31, 2005", "ReviewID": "UR607583868", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great place to stay! Spent 3 nights at the Boccaccio in Florence in a triple with 3 beds. This made the room a little tight with all our suitcases, but still comfortable enough. It's close to the trainstation which is a grea location: short walk to Arno river, right near Santa Maria Novella and into the rest of town. The front desk staff was wonderful, especially Stefano who gave us 3 wonderful dinner suggestions and made our reservations. Right down the street is a wonderful sidewalk caf茅 called Grotta de Leo where we had lunch twice.I would definitely recommend this hotel: good location, nice clean comfortable rooms, great staff!", "Date": "May 28, 2005", "ReviewID": "UR563702022", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "PJS"}, {"Content": "A Fabulous Find My daughter and I stayed at Hotel Boccaccio for five nights beginning on May 9, 2005. The hotel exceeded my expectations. The photographs and reviews didn't do justice to the hotel. The hotel has recently been renovated and is both charming and elegant. We had room 108 which has both a balcony and whirlpool. The high ceilings add to the spaciousness of the room which had enough floor space for us to do our Pilates stretches simultaneously. The bathroom was beautifully appointed and equally roomy.The location was fantastic. We were 10 minutes from the Duomo, 5 minutes from the San Lorenzo Marketplace, and 15 minutes from Uffizi Gallery. We had a bakery/cafe across the street, the train station down the street, a travel agency next door, a place to make international calls two doors down, and a laundromat at the end of the block. The shutters and double paned windows helped to soundproof the room though light sleepers might find the traffic a problem. We had access to the internet in the lobby and the terrace down the hall. The breakfast room was airy, and the assortment of cold cereals, rolls and croissants, ham, juices, and wrapped baked goods made a substantial meal. Cafe au lait was excellent. The menu stayed the same each day, but one could hardly expect more for the price. Our hosts were the best I've ever had...even in 5 star hotels. They were gracious, accommodating, and knowledgeable. They offered us wine, expressos, and real conversation. Everyone at the front desk was beyond personable and helpful. They made reservations for us at restaurants that were topnotch but reasonable, helped us with arrangements for side trips, and made our stay in Florence perfect. We stayed in a hotel in Rome that was ranked #7, but Hotel Boccaccio was by far the better one at #40. For a 3 star hotel, Hotel Boccaccio is a fabulous find.", "Date": "May 27, 2005", "ReviewID": "UR786312375", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Lovely hotel, perfect in every way. I stayed at this hotel for two nights - 27-29 April 2005. I was away on business and knew that I wouldn't have much time to myself so I was looking for a hotel that was in the heart of the city centre and also near the location of my meetings. This hotel ticked all the right boxes. Two minutes walk from the station (if that) and within easy reach of the main bus terminal....a 22 Euro taxi ride from the Florence Airport.The staff were wonderful - inconspicuous yet attentive. My room was lovely - I was in room 107 - large and spacious (luckily, unlike the previous author, it did not smell of smoke though there were ash trays in there for smokers). The bathroom was huge and had a jacuzzi, a standard head shower and a shower with jets that came out from the wall!!! My room was cleaned very well and all of my possessions were set out nicely in the bathroom on return from my day. With the thick windows and the shutters closed, I heard nothing outside and had to set my alarm to wake me up in the morning.The breakfast room is unfussy yet has everything you need - from coffee (very strong), tea and fruit juices to cereal, yoghurt, croissants and toast. It set me up well for the day.At just 90 Euros per night including breakfast (I booked directly with the hotel), I thought that this hotel was excellent value for money and will return there for a city break with my wife in a couple of months time.", "Date": "Apr 30, 2005", "ReviewID": "UR516141757", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Adequate accomodations close to train Upon arriving in Florence by train, we were pleased that the directions to the hotel were accurate, and if you follow them, you really can't possibly miss the hotel. It's easily within 5 minutes walk to the train, and even wheeling large suitcases wasn't inconvenient. We arrived before noon by train, and were pleased to learn that our room was already available for the day, so we were able to drop our luggage and freshen up before departing for our days adventures. We'd e-mailed ahead requesting reservations for the Ufizzi and Academia and we were pleased to find that the Academia reservations had been made and were waiting for us at checkin (we waited too late for Ufizzi reservations, and was no fault of the hotel). We stayed in Room 101, which was conveniently located near the elevator. Upon entering the room we were assaulted by the thick smell of cigarette smoke, presumably from the previous guest. While this wasn't overly troublesome, it was very strong, and I'm more used to smoke free room, but then this was Europe. The room was quite quaint (polite way of saying SMALL). There was barely room to move around the room with luggage in it, and the bathroom was small as well. After returning from our days adventures and preparing for bed, I managed to find a number of small glass shards on the floor with my foot. While there wasn't any major damage, I was surprised with both the number of pieces I found, and the fact that they'd not been noticed and cleaned up. The room was quiet during the night with the shutters closed. However, there was also a very loud, persistent pounding that we began hearing at 8am. It sounded construction/renovation related, but seemed quite early for such loud work to begin, and was pretty annoying.In all, the hotel was convenient to the train station, value priced at 115 Euros, and served us well for our single night stay, just don't plan on sleeping late in the morning.", "Date": "Apr 28, 2005", "ReviewID": "UR673261523", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Mixed Experience After much research on this site, we chose to stay at the Boccaccio in Florence based on its price and positive reviews. Four of us stayed for three nights in a triple (two adults and two very young children) and we had a mixed experience. On the positive side, the hotel was very clean. The staff was nice enough and the breakfast was all we needed. On the negative side, our room was very small for a triple and the hotel was in a more sketchy part of the city than I was led to believe by the reviews. It was not horrible, but it was not somewhere that we wanted to be in any longer than necessary. Also, our room was VERY loud, despite the double paned glass windows and our view of a side street. The noise continued every night until about 2 a.m., and made a good night sleep impossible. Also, for the 142 Euro that we spent on the small triple, we would have been better off crowding into a double in a nicer, quieter part of town.", "Date": "Apr 20, 2005", "ReviewID": "UR333464398", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Hotel Boccaccio convenient for travellers We stayed at the Boccaccio beginning of April 2005. Very conveniently located near the railway station and bus service to the airport. Room was nice and clean, staff very friendly, breakfast adequate. The only negative was that the bed was too hard to be comfortable at least if you suffer from arthritis which is my case.", "Date": "Apr 13, 2005", "ReviewID": "UR104577109", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Fantastic We spent a few days here in September 2003. What a wonderful hotel and fantastic staff. The service we received was fantastic. Our room was lovely, very comfortable. We will certainly stay here again.", "Date": "Mar 15, 2005", "ReviewID": "UR967961984", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "bevchris"}, {"Content": "A beautiful little boutique hotel! Stayed here during Nov. 2004 for our honeymoon leg in Florence. It was so much more than we expected. By far the best hotel we stayed at in Italy. We had a superior room which was immaculate and quaint. There are flowers and art all over this small little hotel and a wonderful staff. The best thing is that it's literally a 2 minute walk from the train station. So if you are going by rail, this is a great place. We just rolled our suitcase right up to the front door. You will not be disappointed and we would definitely stay here again.", "Date": "Feb 11, 2005", "ReviewID": "UR251448772", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "You've got to stay at Hotel Boccaccio Really, it has been nearly a year since we went to Florence and Rome and I can't get you off of my mind! The Hotel Boccaccio was sooo conveniently located and the best shower ever!!! So much for what I had been told of Europe. The shower was better than many here in the states. The brothers that own the place were very friendly and welcoming. The breakfast buffet was the best! I was very happy, and felt right at home. I miss Rome, I miss Florence and I miss the Hotel Boccaccio :)", "Date": "Jan 20, 2005", "ReviewID": "UR183766670", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Bocaccio is a great, convenient hotel Highly recommend staying here if you want convenience, cleanliness and a nice staff which is very helpful. Parlor rooms are very impressive, the breakfast is good and the rooms are comfortable and nicely decorated. Nearness to the train station is also a plus. One will not be disappointed. I will return again", "Date": "Jan 5, 2005", "ReviewID": "UR790408210", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "slimK"}, {"Content": "Good deal hotel for travel with train I stayed this hotel from 11/27 to 11/28 with standard room and 11/29 to 12/1 with superior room with my wife. Hotel is very close from train station and good for travelers to use train. Standard room was a little small but enough space, but beds must be small for American or European peoples. But everythings were well arranged. Superior room was bigger than standard room and only difference was with Jaggzy or not. From their floor map, one of superior room is along the busy street. I stayed exactly that room but I didn't unconfortable because of I fell asleep during my travel with busy travel plan. They provide breakfast and there were bread, serial, ham, cheese, enough for morning meal. Florence provide us a good meals and wines, so we don't worry about hotel's breakfast.", "Date": "Dec 14, 2004", "ReviewID": "UR334703956", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "YAKRS5"}, {"Content": "A decent place We spent three nights here in November. You can see the hotel from the front of the train station, which was great since we only had a little luggage. Our room had high ceilings and a decent bathroom. Although we were told we were given a quiet room, there was noise from the others buildings. Perhaps this was because it was a weekend, but we slept with earplugs (we are light sleepers). Breakfast was okay. The hotel is next to a travel agency, which is great if you need to book a tour. The first night, we did notice a slight sewer smell. I guess this could be a problem if it was warm and the windows were open, but since it was very cold we had everything closed. Florence is full of people out walking, and we felt like we were able to travel by foot everywhere in the city from this hotel.", "Date": "Dec 8, 2004", "ReviewID": "UR160086210", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Charm, comfort, and best location for local travel We had a very good experience here Nov. 4 - 9. Recommended by friends in hometown who had stayed in Spring 2004. Clean, comfortable beds, great bathroom, and noise-proofed windows. Staff could not have been more fun, friendly and helpful. Breakfast room is lovely, filled with morning sunshine, and very ably serviced by sweet, quiet Maria. Nicely renovated and decorated, more than we'd expected at such a reasonable price. Loved cheap interenet access in hotel. Best feature is proximity to Santa Maria Novella square (and beautiful church), lots of restaurants and caffe's, plus steps from local and regional bus depot, and main train station. Could not have been more convenient for anyone traveling on their own rather than on a group tour. Plus, not more than ten minutes to Duomo, and of course, stopping by at San Lorenzo open-air market.  Way to go, Boccaccio!", "Date": "Dec 3, 2004", "ReviewID": "UR877005031", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Nice Hotel We stayed at the Hotel Boccaccio in Florence for 2 nights and the location was very good - not far from the Duomo. The staff was friendly and the hotel was clean. A good experience.", "Date": "Dec 3, 2004", "ReviewID": "UR516714104", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Stay here if you want a rash as a souvenier! STAY AWAY FROM THIS DUMP!We stayed at the Boccaccio Hotel in Nov 2004 for 2 long nights. I couldn't wait to get on this website and share my feelings since our experience was so bad. The hotel is in a shady part of town, pretty far from main attractions and the street its on is really dirty...but so is most of the city. I think I would have liked florence better if I could've gotten some sleep while there! The bed was extremely uncomfortable, the sheets were like paper and were very old. There is a 13 inch TV on a desk in the room. It is really dark too. The room had an awful smeel, so bad, they have to give you an air freshener so you can breath! Please don't try to save money by staying here...spend a little more and stay at a 4 star while in Europe b/c it can ruin your trip if you can't sleep while there. PS I have had a rash since I stayed there, and it still hasn't gone away...THIS PLACE IS NASTY!", "Date": "Nov 22, 2004", "ReviewID": "UR513645718", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Hotel Boccaccio a Delight! We stayed at the Hotel Boccaccio in October of 2004. The staff was charming and friendly, and the service was excellent. My husband was ill there and they went out of their way to entertain me in my downtime in the hotel for the two days while he recovered. The rate was reasonable for the room we had, which was a superior, and it was a nice size for a European hotel. The jacuzzi tub was new and the bathroom clean and in good order. The rooms are soundproofed, so I'm unsure as to the guests who thought it too noisy, perhaps they didn't understand how to use the shutters in combination with the double paned windows. When both were shut tight, there wasn't a sound from the street except the occasional unavoidable European sirens, and we slept like babies. The hotel is a block away from the train station, so one could walk if your luggage wasn't too difficult to drag around. We chose a taxi anyway. We were able to walk everywhere we wanted to go. The only place we took at taxi was to Piazzale Michaelangelo for the view since it was at night. We were able to walk to the Pitti, the Uffizi and the Accademia and back with no problem.They even have a convenient internet station in their lobby and I found breakfast to be above average for the usual European hotel fare. We stayed for 5 nights, and will definitely return!", "Date": "Oct 18, 2004", "ReviewID": "UR286443306", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "Mzscahlett"}, {"Content": "Convenient, Clean and Friendly We stayed at Boccaccio for two nights mid sept and it was in a perfect position to view Florence and very easy to find from train.The rooms  bathrooms where very clean and modern without losing character. The bedroom had high ceilings which made it seem alot more roomy than some hotels.The staff are very friendly and helpful, with two great restaurants recommended, which they happily booked for us :-)I found the bed to be too hard, (i guess that's better than too soft) so had trouble sleeping, but apart from that the room was very quiet at night.One other thing i will add is that like soo many old cities it can get a little stinky in the drains, so i did notice a smell when we got back to the room at night. Our friends where staying in a room at the same time as us and they where on level 2 (we where on 3) and didn't have this problem at all!On the day that we where leaving i saw that they have airfresheners in the power point that you can turn on at your pleasure, so that probably gets rid of any smells!Overall we all had a great stay at Boccaccio and would highly recommend this to all! Enjoy!Cheers", "Date": "Oct 5, 2004", "ReviewID": "UR241905724", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Pipaya"}, {"Content": "I agree...it's a gem I agree with all the other reviews....this hotel is great. I wanted to stay close to the Rail Station and this hotel is only 2-3 minutes away. The bus station is about 75 feet from the front door, so it's very convenient to use as a base for touring Tuscany. The center of Florence is a 15 minute walk. Many restaurants are close by. My single room was furnished simply, but extremely clean. The bathroom was spotless and very modern with excellent lighting. The room had a refrigerator and safe in the wardrobe. I liked the breakfast assortment and the room itself is pleasant. The staff was very friendly. There is reasonably priced internet access in the lobby. I would definately stay in this hotel again.", "Date": "Sep 13, 2004", "ReviewID": "UR701174235", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "SoFLTraveler"}, {"Content": "Hotel Boccaccio -Delightlful! Hotel Boccaccio was excellent and I highly recommend it. The front desk staff (spoke English) was very helpful, friendly and professional - they made museum reservations, stored our luggage and phone ahead to our next hotel to resolve a problem for us. The recently redone room was adequate size, quiet, new, very clean and bright - with a nice bathroom with shower. Public rooms are limited but nice. Continental breakfast was good - cappucinos, croissants, cheese, ham, cereal and yogurt. Location is safe, convenient - easy walking to most sites, one block to train station, with good restaurant (Leo) and a laundry nearby.", "Date": "Sep 4, 2004", "ReviewID": "UR669670449", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great Hotel near the Train Station We stayed at the Hotel Boccaccio for two nights in June 2004, and loved it. It's located very close to the train station (you can see it from the top of the steps outside the train station), making it very easy to walk there with our luggage (and saving cab trips). Although close to the train station, this meant it was a 10-15 minute walk to the Duomo and other sights. We liked the location a lot, but others might find it too far away. While sometimes neighborhoods around train stations can be less than ideal, this area seemed fine/safe to me, though maybe not as nice as areas closer to the main tourist sights.We arrived early (before noon) and they actually had our room ready - this was very nice considering we'd taken trains from the Rome airport and could use a break. I don't think rooms would always be ready that soon, but even if not, they would have let us store our luggage there until later.We had a double superior room - I don't know what more this had than the standard double, except for maybe a larger room and upgraded bath/shower. Our room (107) was spacious (even by US standards) and very clean. Looking at the fire escape floor plan, the rooms appeared to vary a great deal in size, and this looked like one of the bigger ones. Although we're often sensitive to noise, we noticed no problems with noise from outside or from adjacent rooms - we did hear noise from the hallway a couple of times, but with so few rooms per floor, this was very rare, and short-lived. Our room faced a side street, so maybe other rooms would be noisier?The bathroom had one of the coolest showers/bathtubs I've ever seen. It was a jacuzzi bathtub with a shower that had both an overhead (removable) sprayer and jets that would shoot from the side. It closed with an almost airtight seal - even with hot showers, it did not steam up the bathroom. The bedroom included a closet, an armoir (with electronic safe inside), a TV (didn't use), a minibar, etc. I don't remember there being a lot of tabletop space, though there were nightstands and I believe a desk. No alarm clock (I didn't encounter these anywhere in Italy - I wonder why?). The bed was very comfortable. The air conditioning worked well, although it seemed it might not stay on while we were out of the room (taking out the room key turned off all the lights, maybe all the power). The floor was hardwood, which probably helped explain why they could keep the room so clean.The staff was very helpful, and the person who checked us in was extremely friendly. There was an internet access terminal available in the lobby, but it listed charges. I assume this is mainly for people who use it for a while, since we used it once for ~10 minutes and they didn't charge us. We only ate one breakfast there (as we were running late for our train - nice to be so close to the station!), and it seemed fine: breads, cereals, juices, and ham and cheese.Overall, we loved the hotel, and had no complaints whatsoever. We'd almost certainly stay there again, if we're fortunate enough to return to Florence.", "Date": "Jun 28, 2004", "ReviewID": "UR263925576", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "jkeyser"}, {"Content": "good deal This hotel was an excellent find. It only has three stars but it really was comparable to other four stars we'd stayed at in Italy. Our room even had a jacuzzi! Also, it's very conveniently located near the train station and Santa Maria Novella.", "Date": "Jun 27, 2004", "ReviewID": "UR526075526", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Reagonable, convenient base for Florence VERY easy to find, less than three minutes (counting the traffic light) and only about 200 years from the train terminal. It was nice to get rid of our luggage so quickly. The lobby was small but nicely decorated, and the clerk always friendly and helpful. Our first floor (second floor for those from the US) room was comfortable, with a recently renovated bathroom. The air conditioning worked well. The TV was small, and the remote didn鈥檛 operate, but that was a minor inconvenience. There was a table, but because of the layout, our medium suitcase wouldn鈥檛 fit on it. We put it on the floor, and there was enough room that it wasn鈥檛 in the way. They were upgrading the small, common patio outside of our room. When it鈥檚 done, you鈥檒l be able to step out of a patio door in your room right onto it. The breakfast room was bright, the food standard, and we received a warm welcome from the attendants. I鈥檝e read some reviews where people thought the hotel noisy, but we honestly didn鈥檛 notice. The Duomo and San Lorenzo church areas were about a 10 minute easy walk; take the short cut under the train station. The price we paid was very reasonable, making this hotel and its location something I鈥檇 recommend to anyone looking for a sensible and comfortable base to visit Florence.", "Date": "Jun 25, 2004", "ReviewID": "UR298809529", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "IrishRoverDub"}, {"Content": "Very Good Hotel I was traveling for 6 weeks in Europe with my two children, and Italy was the last stop on our trip. I actually wanted a hotel that was near the train station, and since the hotel got good reviews on tripadvisor I thought I would try it.We booked a triple on an upper floor. I requested an upper floor since they had a lift. We didn't have much of a view but we were on the side street and not the main street in front of the hotel. We didn't hear much noise other than motor scooters. I think you'll hear motor scooters in any hotel room in Europe though.Someone mentioned that the beds were really hard, but we found them to be just fine. We enjoyed firm mattresses after another hotel we stayed that had very saggy mattresses. The room and bathroom were spotlessly clean. The maids did a very thorough job every day of changing the sheets, going over the bathroom, mopping the floor, providing towels and soaps, etc. The air conditioning system worked great. We didn't want to open the windows because it was quite warm when we were there in June, 2004. There was a wardrobe but no drawers. Lots of hangers and extra blankets in the wardrobe though. The staff was very friendly to my children.Breakfast was very good. They had good coffee and tea, croissants, ham and cheese, yogurt, and an assortment of cereal and crackers. Orange and grapefruit juices were also available. The breakfast room was light and airy....classical music played softly in the background. The staff was very friendly and accommodating.The hotel is near the train station, but not right next to it. Just a couple of streets away. We never felt unsafe. There were always lots of tourists and locals walking around. We were a tad off the beaten path in terms of sights, but since everything is within walking distance we never felt that we were too far away. I was actually glad that we weren't near the hustle and bustle of the Duomo crowds. There is a small bakery/restaurant across the street and also a good pizza/pasta place down the block.We did use the travel agency next to the hotel. Some of the hotel people were working in it when I went in there to make train and museum reservations. (You have to have reservations to get into the Uffize, the Academmia, and a few other places.) I also dealt with the woman who works their regularly. Luisa was her name. She was very cordial and friendly to me. I had no problems.We would definitely stay there again. Another plus for us was our room had a small refrigerator. It was stocked with drinks (alcoholic and non-alcoholic) for you to purchase. We had put a bottle of our own water in the refrigerator and then the maid charged us for it. I politely told the desk that it was our bottle, and that we hadn't opened theirs. I said the cost was only 3 euros so I didn't want to make a big deal of it. He immediately thanked me for telling him and he said he would take it off our bill...which he did.There is Internet access at the hotel...a tad pricier than the Internet cafes around the corner. We just went around the corner, but if you didn't feel like going out late at night you could use the connection at the hotel.Cheers!", "Date": "Jun 22, 2004", "ReviewID": "UR913014109", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "A great find! This hotel is close to the train station, sometimes not a plus, but in this case, it was well-located and very comfortable. The hotel staff were quite thoughtful and the rooms very comfortable. I would suggest requesting a quiet room away from the street noise. Breakfasts could have offered more variety--we stayed for 6 nights so they got kind of boring. The service was very good and for the price, this hotel really was a bargain.", "Date": "May 28, 2004", "ReviewID": "UR167091786", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Charming small hotel with high standards! We stayed at this hotel for 2 nights, March 9 and 10, 2004. The staff is very friendly, helpful, and accomodating. We had two twin rooms on 1st floor. I believe they were considered superior. The rooms were a bit small, but very nice. The bathrooms were exceptionally clean and looked new. Wooden floors, nice linens, soundproof rooms (we had the 1st floor overlooking the intersection and still slept soundly). Very clean and polished common areas. Breakfast room was spacious and immaculate. Basic yogurt, cereals, juices and rolls for breakfast. We were able to get morning coffee around 720am, no earlier. There's a restaurant across the street with sandwiches, breakfasts, light meals. Deli style. Our favorite restaurant (and the price was right) was about 5 doors away. It's a pizza and pasta restaurant. We ate there twice. Super. The train station is 3 minutes away. In Florence you walk everywhere so this hotel was the right price and a fine location. We wanted to be near the train station for a quick side trip to Pisa on day 2. Would stay here again.", "Date": "Mar 25, 2004", "ReviewID": "UR335448402", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Acceptable, but noisy Very close to the train station, but not close enough to the parts of Florence you want to see. Noisy, busy part of town. Rooms are clean and roomy enough. Breakfast was good (not great). I will try a different hotel next time I go. It was value priced, but I'd pay more for a more convenient, quieter place.", "Date": "Mar 23, 2004", "ReviewID": "UR993281401", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "loved the location We stayed at the Boccaccio early March and for the most part enjoyed our stay. The front desk personnel were friendly and tried to give directions and suggestions for restaurants. room was very clean, and bath was fine. It would of been nice to have some type of drawer space, we had to keep most of our clothes in our suitcase for 5 days. Continental breakfast was the same everyday, rolls, cereal, ham, yogurt, cheeses and pastries. The cappuccinos were very good. My only real complaint was the travel agency next door. I did not find the girl in charge very helpful and she tried to sell us a trip that we did not agree to purchase. She was nasty when we cancelled. great location for traveling in and of the train station and only a few minutes from the Duomo. For 90euro a night, it was fine and we would probably stay there again.", "Date": "Mar 17, 2004", "ReviewID": "UR690828288", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Charming We loved this charming small hotel, the staff were so pleasant and made our stay most welcome. It is acceptionly clean and completely restored. The travel office next door also helped with planning tours during our stay. We would go back in a heartbeat.", "Date": "Feb 15, 2004", "ReviewID": "UR248128937", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great Hotel This hotel is a real find in a city where good hotels can be very expensive. The rooms are small but very elegant and comfortable. The breakfast is basic but very nice and kudos to the staff for their friendliness. We were always greeted with a smile at breakfast. I cannot remember the name of the very friendly gentleman at reception but he was extremely helpful. The surroundings are not that great BUT it is a stone's throw from the station and with heavy bags you'll be very thankful for this. Also, Florence is such an easy city to walk around in that most of the famous sites are an easy walk from the hotel. I recommend this hotel very highly. I paid 140 euros for a family room. For Europe that's a steal.", "Date": "Feb 1, 2004", "ReviewID": "UR864585513", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Good hotels Good hotels in florence in term of quality and price.", "Date": "Dec 5, 2003", "ReviewID": "UR204955301", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "A nice little find in Florence Having being in Florence a few times before, my partner and I decided to take a two day side-trip from Rome to this newly renovated hotel on November 25th.This spotless and elegant hotel has a lot to present. The lobby and our room are marbled floors, damask bedcovers and draperies, nice wood panels, beautiful wallpaper, smart furnishers, comfortable beds and clean bathroom, especially the strong pressured shower (no running water out of the shower stall), and all the amenities and beyond of what a three star hotel can offer. Not to mention the welcoming and accommodating staff.The inviting breakfast room displays fresh linen tablecloths and a nice selections of ham, cheese, yogurt, jam, cereal, juices, milk, coffee, assorted breads and simple silverware and dishes.Just with a block and a half from the train station. This is also great if you are taking side trips to Siena, Pisa, San Gimignano, etc. Only 15 minutes walk to the Duomo and the Uffizi Museum about the same. No matter where you stay, you have to walk to visit Florences landmarks.On our next trip to Florence, we will certainly come back and unquestionably recommend the Boccaccio Hotel.", "Date": "Nov 30, 2003", "ReviewID": "UR392067681", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Good, but not great... The best thing about this hotel is its location....5 minues walk from the stationThe worst thing about this hotel is its location...due to the closeness to the station you are in the midst of all the traffic and noise/air pollution caused by the traffic.A good basic hotel to use as a base camp to see Florence..but not recommended if you are looking for a romantic or peaceful hotel/location.", "Date": "Nov 18, 2003", "ReviewID": "UR802567665", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "This is a great place! I spent 5 nights at the Hotel Boccaccio -- 11/1-5/2003 -- and found it extremely convenient and comfortable. I was able from there to walk everywhere I wanted to go. My single room and its private bath, though small, was spotlessly clean and nicely furnished, and I appreciated the TV. The presence of a lift was a great help with the luggage. The climate-control system worked very well. The English-speaking staff were very friendly and helpful (they even waited with straight faces as I tried out my poor Italian on them). The breakfast room and foods available were delightful. The one thing I might have wished for is a less-busy location; my room was located right over a busy intersection, and while the noise was minimal when the windows were closed, I couldn't open them for air without getting lots of noise and traffic fumes (I'm sure there are quieter rooms). The price was right, and I'd gladly recommend this hotel and go back to it myself.", "Date": "Nov 14, 2003", "ReviewID": "UR691434351", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "kmsquared"}, {"Content": "Nice place - Reasonably priced and very convenient The Boccaccio is an excellent place in its price range. Staff is very helpful. Breakfast is good and rooms are very clean and well appointed. Ask for one in back on upper floors and you will have partial views of Florence and surprising quiet. Rooms are euro-sized eg small, but in this price range that seems normal. Location is literally steps from the train station, but once inside you would never know. You can happily come into town on the train and never need a car or taxi. Its an easy walk to any of the historical sights. A nice base for exploring Florence.", "Date": "Nov 10, 2003", "ReviewID": "UR925139133", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "runningpie"}, {"Content": "Almost Great, but That Bed #65279;The Hotel Boccaccio is a great place for those who, like me, use Florence as a home base for taking day trips to other Tuscan cities. It is a walk of less than 5 minutes to the train station, and even less to the bus station. Although the location isnt the most picturesque, your are only around 5 minutes from the Il Duomo, and another 5 to the Uffizi. Everything in the hotel is small; the lobby, the elevator, the rooms, and their views. We did have a mix-up on our room request, but it was handled quickly and without fuss. It has a nice breakfast room with a nice, substantial breakfast selection. All of this is fine, but the one drawback that would give me pause in enthusiastically recommending it were the beds, which were hard. We joked that they were simply sheets over a piece of plywood. If this doesnt bother you (it didnt bother me much), this would be a good place to station yourself for travels through the region. If you are looking to stay just in Florence, I probably would look someplace else.", "Date": "Nov 9, 2003", "ReviewID": "UR621662365", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great Stay! Just got back from a 2 night stay at this hotel. Dominico, the desk clerk was helpful, and informative. Our room was large and comfortable. Plus, they have thick double pane windows to block out the Vespa noise, and the air conditioning was great! Breakfast was great too. Had two problems though: They gave our reserved jacuzzi room to someone who was staying 6 nights (they adjusted our rate), and we packed up on our check out day, and went for one last walk to the Duomo. When we got back to the hotel at 9:30 am from our walk, the maid had taken everything out of our room and they had it locked up in the storage room. They just assumed we didn't need our room until 11am. So don't pack up and leave your room on last day.", "Date": "Sep 8, 2003", "ReviewID": "UR627994943", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Excellent hotel This is an excellent hotel, easily the best of the ones we stayed in Italy.Nice and helpful staff (they let us store bags both before checkin and after checkout).Clean, decent sized room (we booked a double) with a/c that worked!Good shower and plumbing in bathroom. Clean towels and sheets.The breakfast spread was decent but could be better.This is very close to the main station and so easy to catch trains (for day trips) and buses (to visit the city though you can easily walk to the duomo and other sights).We'd definitely stay there again!", "Date": "Sep 2, 2003", "ReviewID": "UR200046562", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "My favorite hotel in Italy! Absolutely loved this hotel, we stayed for three nights in May 2003 and would definitely recommend it without hesitation. It's a beautiful little hotel, very clean, and they serve a nice breakfast. However, what was outstanding about this hotel was the service - the staff is so kind and helpful.", "Date": "Aug 19, 2003", "ReviewID": "UR355005423", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Hotel Boccaccio, Florence Thank you for rating the Hotel Boccaccio so highly, it certainly deserves it ! I am just back from 7 nights in Florence. Hotel Boccacio is like many Italians - clean, friendly, and very good looking! As it is a small hotel, it is very quiet. My room was very well decorated and furnished and had good air conditioning.It may be a 20 minute walk from the centre of Florence, but I found this to be an advantage - it seemed to be considerably quieter at night time than the centre, and it also has the main bus and rail station on the doorstep - Great for trips out - I went to Fiesole, Sienna and Lucca. (All reccomended!)The staff are very friendly and helpfull - I will certainly go back there when I return to Florence.", "Date": "Aug 15, 2003", "ReviewID": "UR270698321", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Wonderful experience here!   showReview(1149173, 'full');", "Date": "Jul 26, 2003", "ReviewID": "UR236023258", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Very nice place and great breakfast!   showReview(1143324, 'full');", "Date": "Jul 22, 2003", "ReviewID": "UR188155938", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great hotel for a great price.   showReview(1121479, 'full');", "Date": "Jul 1, 2003", "ReviewID": "UR827855354", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "This is a super hotel   showReview(1071417, 'full');", "Date": "Jun 6, 2003", "ReviewID": "UR910186203", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Very pleasant hotel   showReview(995980, 'full');", "Date": "May 15, 2003", "ReviewID": "UR449112461", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Friendly Helpful staff   showReview(926936, 'full');", "Date": "Mar 31, 2003", "ReviewID": "UR305855825", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "GREAT STAY IN FIRENZE   showReview(917248, 'full');", "Date": "Mar 14, 2003", "ReviewID": "UR821095789", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Ottima struttura da consigliare...   showReview(22864292, 'full');", "Date": "Dec 16, 2008", "ReviewID": "UR296248686", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Buono ma con un neo       1", "Date": "Dec 14, 2008", "ReviewID": "UR357972902", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "3"}, "Author": "romynaland"}, {"Content": "Viaje a Florencia con mi pareja...   showReview(22823048, 'full');", "Date": "Dec 2, 2008", "ReviewID": "UR901001863", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Ci siamo trovati...   showReview(22256280, 'full');", "Date": "Nov 21, 2008", "ReviewID": "UR437422962", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "da tornarci   showReview(21965069, 'full');", "Date": "Nov 18, 2008", "ReviewID": "UR375593683", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "RexF"}, {"Content": "Cet h么tel est vraiment...   showReview(22232872, 'full');", "Date": "Nov 12, 2008", "ReviewID": "UR541465123", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Proprio carino, personale molto...   showReview(21617056, 'full');", "Date": "Oct 20, 2008", "ReviewID": "UR652923749", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Tutto ottimo,dalle camere...   showReview(21391965, 'full');", "Date": "Oct 14, 2008", "ReviewID": "UR740397316", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Superata ogni aspettativa...   showReview(20329083, 'full');", "Date": "Sep 7, 2008", "ReviewID": "UR905560442", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "3-Tage Kurztrip um einen...   showReview(18411230, 'full');", "Date": "Jun 29, 2008", "ReviewID": "UR981798320", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Hotel tres bien plac茅, j'ai pu...   showReview(16732224, 'full');", "Date": "Jun 2, 2008", "ReviewID": "UR185531784", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Hotel muito bem localizado, ao...   showReview(17571427, 'full');", "Date": "May 29, 2008", "ReviewID": "UR517123473", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Lo unico 茅 que est谩 ubicado en...   showReview(17571426, 'full');", "Date": "May 27, 2008", "ReviewID": "UR227370512", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Tres bon sejour a florence a...   showReview(16725069, 'full');", "Date": "Mar 14, 2008", "ReviewID": "UR971959209", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Abbiamo passato un buon weekend...   showReview(16725814, 'full');", "Date": "Mar 4, 2008", "ReviewID": "UR575147077", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "L'hotel 猫 pulitissimo e il...   showReview(14227082, 'full');", "Date": "Feb 7, 2008", "ReviewID": "UR449904395", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Perfetto Boccaccio   showReview(13123949, 'full');", "Date": "Jan 30, 2008", "ReviewID": "UR787293769", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "4"}, "Author": "genge"}, {"Content": "Soggiorno di una sola notte...   showReview(13138180, 'full');", "Date": "Jan 10, 2008", "ReviewID": "UR288586561", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "El hotel est谩 como a cuadra y...   showReview(12651290, 'full');", "Date": "Dec 21, 2007", "ReviewID": "UR980183051", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Albergo in posizione...   showReview(12649236, 'full');", "Date": "Dec 10, 2007", "ReviewID": "UR610526930", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Hotel con encanto. Al menos mi...   showReview(12648453, 'full');", "Date": "Dec 6, 2007", "ReviewID": "UR951228455", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Albergo molto carino e pulito...   showReview(11390287, 'full');", "Date": "Nov 27, 2007", "ReviewID": "UR657029969", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Perfecto para alojarte si...   showReview(11390289, 'full');", "Date": "Nov 24, 2007", "ReviewID": "UR594471020", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Questo hotel nel cuore di...   showReview(11390288, 'full');", "Date": "Nov 24, 2007", "ReviewID": "UR856814273", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Hotel de tres estrellas muy...   showReview(12648775, 'full');", "Date": "Sep 2, 2007", "ReviewID": "UR198359550", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Il soggiorno presso questo...   showReview(11390292, 'full');", "Date": "Aug 19, 2007", "ReviewID": "UR701229705", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Mon 茅pouse et moi sommes partis...   showReview(11390291, 'full');", "Date": "Aug 15, 2007", "ReviewID": "UR814999467", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Hotel tr猫s bien situ茅, en plein...   showReview(11390286, 'full');", "Date": "Mar 17, 2007", "ReviewID": "UR773127971", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Hotel comodissimo alla...   showReview(11390294, 'full');", "Date": "Dec 3, 2006", "ReviewID": "UR731791894", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Tres bon sejour personnels...   showReview(11390295, 'full');", "Date": "Sep 28, 2006", "ReviewID": "UR599844914", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "El hotel est谩 situado cerca de...   showReview(11390296, 'full');", "Date": "Aug 4, 2006", "ReviewID": "UR271585176", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Pas de facture pour le garage...   showReview(11390297, 'full');", "Date": "May 29, 2006", "ReviewID": "UR725021831", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Bel h么tel proche la gare et de...   showReview(11390298, 'full');", "Date": "May 18, 2006", "ReviewID": "UR108967662", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Sistemazione soddisfacente, in...   showReview(11390299, 'full');", "Date": "Apr 29, 2006", "ReviewID": "UR711470372", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Sehr gutes Hotel in der N盲he...   showReview(11390301, 'full');", "Date": "Feb 20, 2005", "ReviewID": "UR298617637", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Perfetto soggiorno a...   showReview(11390300, 'full');", "Date": "Feb 20, 2005", "ReviewID": "UR373951142", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Finalmente un hotel per cui la...   showReview(11390302, 'full');", "Date": "Jan 17, 2005", "ReviewID": "UR459809535", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Decisamente soddisfatto per...   showReview(11390303, 'full');", "Date": "Dec 12, 2004", "ReviewID": "UR346088986", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "H么tel tr猫s bien situ茅 (脿...   showReview(11390304, 'full');", "Date": "Jul 20, 2004", "ReviewID": "UR673061178", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Come congressista l'ho trovato...   showReview(11390305, 'full');", "Date": "Dec 7, 2003", "ReviewID": "UR678176861", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "L'hotel 猫 molto carino, ben...   showReview(12871376, 'full');", "Date": "Dec 1, 2003", "ReviewID": "UR625601505", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Hotel con encanto situado...   showReview(11390306, 'full');", "Date": "Sep 2, 2003", "ReviewID": "UR750124509", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Es necesaria una mejor...   showReview(11390307, 'full');", "Date": "Aug 16, 2003", "ReviewID": "UR774655771", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Magnifico hotel,situado muy...   showReview(12871486, 'full');", "Date": "Jul 21, 2003", "ReviewID": "UR752978850", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Wir haben zwei N盲chte im M盲rz...   showReview(12650717, 'full');", "Date": "Apr 15, 2003", "ReviewID": "UR150974371", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Hotel muy centrico y bien...   showReview(12650499, 'full');", "Date": "Mar 26, 2003", "ReviewID": "UR109952217", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "El hotel est谩 reci茅n...   showReview(12650531, 'full');", "Date": "Mar 11, 2003", "ReviewID": "UR742580617", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Accoglienza e servizio...   showReview(12650237, 'full');", "Date": "Feb 3, 2003", "ReviewID": "UR747576013", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "L'albergo corrisponde alle...   showReview(12649722, 'full');", "Date": "Jan 8, 2003", "ReviewID": "UR180149452", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "2", "Location": "-1"}, "Author": "lass="}, {"Content": "Dal punto di vista qualitativo...   showReview(11390308, 'full');", "Date": "Dec 10, 2002", "ReviewID": "UR193729736", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Va bene cos矛: ORA FACCIO LE...   showReview(11390309, 'full');", "Date": "Sep 7, 2002", "ReviewID": "UR583651863", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Tout c'est tr猫s bien pass茅 et...   showReview(11390310, 'full');", "Date": "Aug 21, 2002", "ReviewID": "UR444593824", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d232968-r22682042-Hotel_Boccaccio-Florence_Tuscany.html", "HotelID": "232968", "Price": "$148"}}