{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kampala, Kampala, Uganda", "Title": "“COMMENDABLE FACILITY”", "Author": "Alexander K", "ReviewID": "UR126127999", "Content": "Stayed at this hotel (8th March 2012) in transit from JFK and I frankly commend their service; great job guys. The rooms are nothing fancy but, clean, quiet and with fairly comfy beds. Its pure relief after a long-haul flight, to get a descent bath and some sleep. Noticed their niche is with transit passengers; so it would probably help if you requested for a room on the 4th Floor. Way better that sitting at the airport for hours; waiting for that connecting flight! R. KAKOOZA", "Date": "March 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Amman, Jordan", "Title": "“Nothing special”", "Author": "YousefOmar", "ReviewID": "UR125614333", "Content": "Stayed overnight waiting for an Emirates flight. Room is basic. clean. nothing fancy. comfortable bed. Very noisy corridors. Used the dinner voucher and had food at the main restaurant; food was nice. Paid for the wired internet in the room. I don't think that you should stay here unless stay is provided by Emirates for a connection flight.", "Date": "March 4, 2012"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“What a horrible place to stay”", "Author": "hocknod", "ReviewID": "UR124652029", "Content": "I got bumped from an Emirates flight and put here for the night (I'm sure this is not an uncommon occurrence). This place was horrible. The rooms were like prison cells - plain, white, cement walls, cruddy & uncomfortable beds, and no wireless internet. Seriously? Is it 2012 or 1995? Then they had the audacity to charge for WIRED internet. There is really nothing redeeming about this place except for it's proximity to the airport, so...yeah, there's that. Avoid.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Riffa, Bahrain", "Title": "“Minimal but Suitable”", "Author": "bmattar", "ReviewID": "UR124327486", "Content": "I was transfered to the Copthorne via Emirates Airline when my connecting flight was rescheduled. The hotel provided me with transportation to and from the airport (5 minutes away), it was very old and not renovated, but the room I was given was very clean. The linens were clean and even the bathroom had few and limited toiletries. The towels were worn out but clean. In addition, they offered me the room with 3 meals and a snack (although I was only there for four/five hours). I would stay here only under the same circumstances next time. The hotels is mainly used for transiting passengers and is far from main attractions in the city. One suggestion is to have a gift shop where stranded passengers like me can buy a change of clothes or a toothbrush as their luggage is half way on its way to London.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "poland", "Title": "“bland dormitory”", "Author": "keijo", "ReviewID": "UR122501145", "Content": "stayed in emirates assigned accommodation for 10hrs. agree with earlier reviewers, ask for a room near the lift. the furthest rooms are quite far away really. but if you're just looking to crash it's not so much of a problem. tried the room service, it was prompt and helpful. no free internet. plenty of channels on TV, good shower. not enough staff at checkin desk, takes ages, hence a tip for dubai stopover passengers; try to get ahead of the queues all the way throughout the process from immigration to your room. if you're at the back you may spend good half an hour waiting for your room. choose your seat on the shuttle bus strategically so you can be the first one to rush out.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Very good overnight with Emirates”", "Author": "JalanHidup", "ReviewID": "UR121978556", "Content": "Part of the overnight package with Emirate. Room and bathroom are clean, basic. Long and narrow room, without any good view. Food is nice and plentiful. We arrived at night and staff had been helpful and courteous. Getting out from the airport was longer than expected, but staff from emirates/hotel try their best to accomodate group of us. If you need overnight rest before continuing long journey than this is worth the free service from Emirates compare to staying at the airport or suffering extended long journey in the economy class. We had time to take tours around Dubai before getting to the next flight. Will really consider using this hotel/service for the next long journey. We stayed on 11 Nov 2011.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Only for Emirates nightovers”", "Author": "meetjoeblack", "ReviewID": "UR121928068", "Content": "I stayed there because of Emirates misconnection. Not far away from the airport by free shuttle. Its not an hotel to expect comfort. Basic food, basic rooms, not clean but not dirty. But its better than sleeping at the terminal", "Date": "December 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ituporanga", "Title": "“Good Hotel and Nice Food”", "Author": "Fabiano_Schmidt", "ReviewID": "UR121760822", "Content": "I have stayed for two days and one night at this hotel during my Business trip to Índia. They have a very good location, near the airport and a very nice food. Easy to get into downtown with taxi (just in front) or Metro (5 min. walking).", "Date": "December 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Location": "3"}, "AuthorLocation": "Canberra Australia", "Title": "“Free with Emirates layover of more than 8 hours”", "Author": "DRMB", "ReviewID": "UR119027485", "Content": "This was included as part of the ticket from Larnaca, Cyprus to Sydney, Australia because of the 10 hour layover. But it is not entirely \"free\" since the ticket price was higher than say One World with Roayal Joradian and Quantas from BKK. And frankly speaking, I would have avoided Dubai altogether but Royal Joradanian do not fly every day to Larnaca. Dubai airport has now outgrown its original concept and it is overcrowded, difficult to walk with huge distances to go to get to passport control and then out to the free bus. It is made worse by the long queus for the passport check by the lazty local government officers who prefer to chat to each other than stamp your passport. So it easily takes 1+ hours to get out to the Emirates bus then another 1/2 hour when the bus arrives because there are not enough staff to checkin a full bus load. Then a long long LONG walk to the room only to fiind the card does not switch on the power because it is too transparent to be active. So another 10-15 mins to get someone to come with a different card that works to get lighting. Then the shock of the long narrow small and very smell room, with a toilet seat that did not fit properly, and no BBC or CNN on the TV. So for a 4 hour rest plus a shower it is debatable that this is worth it. The shower was also ackward as it was a handheld affair hanging very high on the wall but with no adjustment, so water sprayed everywhere. However, breakfast was OK, limited range but plently of it with very friendly and courteous staff.. .", "Date": "October 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Skip if you can”", "Author": "Nicole_711", "ReviewID": "UR118445284", "Content": "Reason for staying at airport hotel is to break the journey and it is even sweeter when Emirates airline paid for it. But after a lovely 2 weeks in the Spanish cities - beauty everywhere - it almost tarnished the memories when you are faced with plain starchy sheets, no care for interia decorating, not friendly smiling staff ..... Rather fork out $100 to maintain the holiday standard and have pleasant memories until the end.", "Date": "September 22, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Service": "3"}, "AuthorLocation": "Hobart, Tasmania", "Title": "“Good for overnight with Emirates”", "Author": "Hobartgirl", "ReviewID": "UR115142019", "Content": "Had a long stop over and as part of Emirates benefits they will pay for hotel accommodation, food and transfers. Arrived at 1am so did not see much of the hotel or use its facilities. Staff were friendly even at this hour. Room was comfortable with minimum amenities. One small thing of shampoo. You have to phone for the hair dryer when you need it and it is delivered to the room. Handy store in lobby - sells toiletries etc that are small enough to take in the plane. Beats sitting in the airport for 10 hours.", "Date": "July 8, 2011"}], "HotelInfo": {"Name": "Copthorne Airport Hotel Dubai", "HotelURL": "/ShowUserReviews-g295424-d2331543-Reviews-Copthorne_Airport_Hotel_Dubai-Dubai.html", "Price": "0", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Airport Road, Casablanca Street, Al Garhoud</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span> <span property=\"v:postal-code\">PO Box 13018</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "2331543", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/2b/da/64/standard-room.jpg"}}