{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Quiet alternative if you don´t mind being out of the centre”", "Author": "raqueluchi", "ReviewID": "UR127727820", "Content": "If you just read the word \"Rome\" when booking it, you will hate being so far out of the centre, but if you read a little bit before you go, you will know that this is by no means a Rome city hotel. The reception staff don´t roll out the red carpet for you, but neither are they rude. They happily gave us all the informatin we needed, and this was the only hotel on our trip that allowed us to check in and access the room before the usual 2 or 3pm for which we were very grateful. We parked with no problem in the parking under the hotel which was free of charge. Our room on the 5th floor had wonderful views over the local countryside, was extremely quiet and, OK, it had no shower curtain but it´s quite easy to shower without getting everything wet and the room had everything we needed and was spotlessly clean. To get into the centre of Rome you need to walk to the bus stop (3 mins) then take a bus to Laurentine metro stop (10 mins) then take the metro which can take you directly to the colosseum for example (15 mins). OK, you don´t have ancient Rome on your doorstep, but at the same time, you have a wonderful quiet night´s sleep, peaceful views over local countryside, a 15 min car/taxi ride to Ciampino airport (for which I was grateful when catching a 6:30am flight) and a price which reflects this. These days we all pay different prices for a hotel room, depending who we booked it through etc etc. so I can´t comment on what others paid, but for the price we paid for our room, excluding breakfast, we could have stayed at the Aran Pak for 4 nights for the the same price as one night in a city centre average hotel. It¨s all down to personal priorities and I really don´t mind half an hour of public transport and a quiet hotel if it means I still get to enjoy all the sights of Rome as anyone else.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Jeddah, Saudi Arabia", "Title": "“So Far to Be Good”", "Author": "Mohammed_Reda", "ReviewID": "UR126509562", "Content": "Aran Park Hotel is located in a quiet suburb of Rome away from the city centre and the main attractions. PROS: Clean Rooms Cons: Failing Internet connection, Remote Location, Small Rooms, No kettle for hot drinks.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Rome, Italy", "Title": "“A calm and clean hotel”", "Author": "Gerard M", "ReviewID": "UR125395013", "Content": "we are staying as a part of trafalgar tour, in the Barcelo Aran Park. the hotel is in a green calm area of rome next to the ring road. rooms are clean, spacious and offer a beautiful view on the country side. breakfast is quiet nice and generous, with coffee and juices served from machines. The quality of the service is ok, and we got all the help that we needed from the staff. The payed shuttle bus offer a good service to the city center. the hotel is some 30 minutes by bus away from the city center, and the traffic is a problem( all rome is like that)", "Date": "February 29, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Rome, Italy", "Title": "“Ok the hotel, stuff not ok at all...”", "Author": "Tourmanager81", "ReviewID": "UR124764264", "Content": "I stayed at Aran hotel a couple of times. The hotel is very far from downtown Rome but in itself is good. I woud not say that the hotel has problems but the stuff and the receptionists are very arrogant and not helpfull at all! They act like you disturb them with your presence.. really bad attitude. The only one at the desk that was nice and helpfull was a guy that I am pretty sure is not Italian, I guess is from South America. One negative aspect is the breakfast: it is always poor; when something finish it takes an hour or so to have more...", "Date": "February 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Pembroke Pines, Florida", "Title": "“Off the beaten path”", "Author": "edump2", "ReviewID": "UR121380272", "Content": "This hotel was beautiful. The rooms were clean and the hotel well kept. Front desk staff seemed confused, but eventually processed our reservation. My biggest issue is that the hotel is located too far from the center of Rome. You are better off staying in a smaller hotel near the center of town. This reservation was made by a travel/tour company. We weren't staying lond and had been to Rome before so It wasn't a big issue on this trip. First timers to Rome should consider staying \"in town\".", "Date": "December 4, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Too far away”", "Author": "taos55", "ReviewID": "UR120728624", "Content": "This hotel was part of the tour package but we were not too terrible exited about it. We were not able to turn on the air conditioner in our rooms even after several notifications to the from desk. The last excuse they gave me was the a/c could not be turned on due to security reasons. Never was able to figure that out. But the lobby was at a very nice temperature all the time. There was no free WiFi access. It cost me 7 Euros (almost $10US) per use at the comfy lobby. My sister and wife both had very unpleasant incidents with the restaurant personnel also, very sad; not to mention the not too friendly hotel staff. The worst part of the whole thing was the distance of the hotel to the center of Rome. We needed to take a bus and the subway for this half hour trip. The nearby restaurants were not too close neither. My best advice, do your homework before booking this hotel.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Ok”", "Author": "Katerigetti", "ReviewID": "UR120568168", "Content": "We stayed at the Aran park during our trafalgar tour in Italy, the hotel is just fine, the rooms are clean, and we asked for one without moquette so we were allocated a room on the 5th floor, that we found just great. Breakfast was served at the roof top restaurant, it was croudy but just fine comparing with the other hotels during our trip. Staff was cordial and helpful. And the bartender wad excellent ( try his bloody mary)", "Date": "November 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Pretty Basic”", "Author": "Aubrey L", "ReviewID": "UR120415716", "Content": "Hard to believe that this hotel has 4 stars. My room was basic and had no desk to work from. TV small and old. Cobwebs in the lampshade and the plug release in the basin had lost its knob and was difficult to pull. The wardrobes appeared locked so I lived out of my suitcase for 2 days. Nice veranda but no furniture out there. The bed was firm and I slept well. The buffet on offer was poor and and looked and tasted as if it had been left there for hours. Dessert was chocolate cake, take it or leave it. I ate out on my second night. No problem with the staff who appeared friendly.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "1", "Location": "3"}, "AuthorLocation": "California", "Title": "“Seems nice, but not really. TERRIBLE on our second stay.”", "Author": "thegizzywiz", "ReviewID": "UR119778251", "Content": "Stayed here twice as part of Trafalgar tour, in the beginning for 2 nights and on our last night before departing Rome. On our first night, we had car service take us from FCO airport to the hotel. It took the driver some time to find it as it really is in a secluded, but nice area. Nice lobby and dining area. Staff pretty indifferent, maybe even rude, took some time to find our reservation even if we were under Trafalgar. I think it's because our last name was misspelled. I asked for two keys and the one guy kinda shouted, \"One key!\" Ok, I guess my husband and I can survive with one key for two nights. Got to our room, and despite the negative reviews.. the room was actually nice and clean BUT it smelled terrible, like an old man who smoked was just there. We opened the sliding door and let the room air out. Nice cool breeze accompanied with what sounded like a karoake bar or club singing nearby... complete with a dog howling! We actually enjoyed the entertainment. Otherwise, it's a very quiet neighborhood and very private with trees surrounding the hotel and balconies that are separated by glass dividers. We went down for dinner and we just assumed it was buffet only. Looked delicious, but was terrible. 25euros. The hostess wanted us to pay cash and didn't seem to understand the concept of charging to our room. After dinner, we had to walk with her to the front desk to clear that up, and it seemed like the guy had to explain the concept to her. Hmmm.. kinda weird for a place that is FULL of tour groups, with this kind of lack of knowledge and zero English (which is forgiveable). But it seems like this is how it is at this hotel. Walk up to the front desk and everyone seems to avoid you and no one really acknowledges you and then they all have to look at each other if you make a simple request. Did I say the food was terrible AND overpriced? Our stay was pleasant enough, with breakfast being pretty good, the room/bath clean even if stinky and the a/c worked during a couple of really hot days in Rome. The tour director admitted that even they often don't get the help they need to run the tour smoothly at this hotel compared to others on our itinerary, and attributed it to the fact that this hotel has LOTS of tour groups come through it. But you would think they should be appreciative of the business and at the very least pretend to be in the SERVICE industry. C'mon, 5-6 people behind the front desk and no one knows anything or wants to check on what you need? Okay, fine. We're tourists and we're crowding your beautiful city while wandering around with our cameras around our necks. Anyhow, that first stay would have earned a 3 out of 5 on the rating scale.. but my stay included one more night, which was our last night of our tour. Fine, we understand that the elevators are slow and that the luggage doesn't get delivered as fast here as the other hotels so we are willing to carry our own bags off the bus so we can change for dinner. Yay, that our hotel keys are ready for our rooms and it's okay that our TD was the one who had to yell out our names so we can retrieve them quickly (unlike our hotel in Venice whose front desk guy passed them out cordially) and it's okay that I was assigned the very last room in the longest hall.. but what was NOT okay was.. that this room seemed to be UNDER construction still, will plaster chips here and there, the carpet barely vaccuumed of the dust created by the repair done to the air ducts, which had no use since the a/c DID NOT work at all during this hot day. Unlike our first stay, the bathroom was filthy and moldy, and the room was seriously dusty, as if it had been abandoned for a while. I wonder if I could've breathed in some asbestos. It's like these rooms were opened up last minute to fit us in, evident by the hallway dust that only seemed to start at the last few doors. It's like these rooms were roped off or covered with plastic, only to be torn down when they found themselves short of rooms. I might have been correct because we later learned that the Roman police had booked up the hotel to full capacity because of the pending protests that evening. The only reason I didn't change my room was because I knew it would probably be like a root canal and that I had to get ready for dinner and i had an early morning flight and figured we'd be there for only a few hours. Plus, it would've taken me at least 15 minutes to get to the front desk. It was so filthy. I couldn't wait to leave. Oh, and the tv was unplugged which was more evidence that this room was closed off for repairs. Plugged it in and it finally worked when we fiddled with it. Btw, you can never ring the front desk from the rooms.. I guess when you're part of a tour and your room is prepaid, you can't ask for anything unless you take the trek downstairs ,only to find no one really wants to help you. I'm not the type to complain about trivial things (like only 3 channels on tv or no mints on my pillow), esp. when they are part of the culture but these are basics that a customer should be entitled to when checking into a hotel: cleanliness and service (even if cold.) Tour companies really should be diligent about checking the hotels that they use for their paying customers. I didn't give this hotel the lowest score because the first stay I had was good. BTW, the second room was at the end of the hotel where they demolished what used to be a parking structure. I'm not sure how much more dust that would have kicked into the room while the sliding door was open. I agree with a previous review that the staff seems DISorganized and is in dire need of training, especially if they will be dealing with many tour groups at once.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Burnie, Australia", "Title": "“Hotel nice, staff disorganised and disinterested”", "Author": "Archer_011", "ReviewID": "UR119341672", "Content": "I stayed at this hotel on a Trafalgar tour. Situated about 20 minutes from the centre of Rome, in an area full of high rise apartments on the outskirts of an industrial area. The hotel is modern and new. The foyer area is vast, with a bar off to the side. The decor is quite pleasant, although the flooring strange for a hotel, being lino throughout the hotel other than the bathrooms, which are tiled. The lifts are slow given the amount of people trying to get to their rooms to the amount of lifts, being two. The rooms are not overly large, but are adequate, the bed is too large for the size of the room, but are quite comfortable, and there is also a balcony, where you can put your washing out to dry. The bathroom is quite luxurious, including a bidet and toiletries, the hand towels are strangely like tea towels. Internet access is €5 for twenty four hours if you can get someone on reception to serve you. Big mix up with room numbers, with some rooms being allocated twice, and some cards not working when we returned from an excursion. Breakfast was poor compared to some other European hotels, being continental, however only whole fruit and no fruit salad and the selection was much less on the second morning. We wanted to have dinner at the hotel on the second night, however dinner service did not start in the restaurant until 1930, and it was either a buffet or the al a carte which we quite expensive, or toasted sandwiches from the bar for €8.00, however they could only do one type. We found a Japanese restaurant round the corner which was reasonably priced and very nice. This hotel is ok, but very disorganised.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Beirut, Lebanon", "Title": "“Home Sweet Home”", "Author": "Paul S", "ReviewID": "UR119334844", "Content": "Simply one of the best hotels i've been in. Excellent service and extremely friendly staff not to mention the delicious food they offer. The rooms are always clean and the location of the hotel is by itself a real advantage.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Malmö, Sweden", "Title": "“A hotel for tour groups”", "Author": "J_travel75", "ReviewID": "UR119331325", "Content": "The hotel is certainly aimed at tour groups, with coaches lined up outside at night. The check in staff were almost surprised when I and my colleague wanted to check in without being part of a tour group. Check in was very slow. Staff seemed very confused, unwillling to help, spoke little English and were even indecisive about whether breakfast was on the bottom floor or on the 7th floor. The hotel is a 20 Euro taxi drive from Colosseum. However, they had a shuttle to a subway station (against a fee). The room was small and charmless but clean and quiet at night. The bathroom was also clean. The large balcony could have been nice but was without even a chair. Breakfast consisted of yogurt, fruit, pastries and white bread. I would not stay here again, mostly based on the location and the reception at check in.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Lebanon", "Title": "“\"A really excellent stay at Aran Park Hotel\"”", "Author": "Nathalie H", "ReviewID": "UR119320907", "Content": "I stayed in Aran Park Hotel for 4 nights and was impressed with the hotel. The staff were so friendly and attentive and made me feel really welcome. An excellent stay would go back and recommend to others.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Beirut, Lebanon", "Title": "“just amazing”", "Author": "Roy G", "ReviewID": "UR119315813", "Content": "it was really an amazing experience, i just felt like home, friendly and professional staff, excellent food and good hospitality...", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Beirut, Lebanon", "Title": "“waiting for my second visit!”", "Author": "Carole E", "ReviewID": "UR119314316", "Content": "The hotel was perfect for a relaxing holiday. The staff were efficient , polite and extremely hard working, particularly the bar staff. The public areas of the hotel were pristine and modern. The rooms were kept clean. The beds were made daily and the towels were changed daily.. The food was fantastic!!! I realy enjoyed my time there with my mom and sure i will visit the hotel a second time !", "Date": "October 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Traverse City, Michigan", "Title": "“Would not stay here again”", "Author": "sandy g", "ReviewID": "UR119205169", "Content": "It sounds like Trafalgar tours are the only guests at this hotel! We did not have a problem with the cleanliness of the room but most of the front desk staff was not helpful, to say the least. When we asked for another key the staff almost accused us of wanting to steal a key. One friendly front desk person did refer us to a nice restaurant in the area. Traveling to downtown Rome via bus and subway was quite a feat, very inconvienent location! I'd say Trafalgar needs to check out these reviews and select another hotel!", "Date": "October 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Ohio", "Title": "“Okay for Tour Group”", "Author": "CBGolfers", "ReviewID": "UR118497425", "Content": "This hotel was part of our package with Trafalgar tours. It was okay, but nothing special. Far from historic part of city, but not bad if you are with a tour group. Elevators were very small...only about 4 people without luggage.", "Date": "September 23, 2011"}, {"Ratings": {"Location": "3", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Jersey", "Title": "“Yuck!”", "Author": "ChildOfTheSixties", "ReviewID": "UR118180295", "Content": "Yes, it was very nice that we had a two room suite. It was also delightful to find that we had a huge balcony. But it was FILTHY. I'm talking disgusting. There were \"those kind\" of hairs in the tub, on the bidet, and on the sheets, and mysterious stains on the floor. Our key card did not work after three returns to the front desk, I guess four times are a charm. :/ There was a room service tray outside the room next to ours that remained there for two days, and only was picked up after we complained about it possibly attracting bugs. The light switches often did not turn anything on, and we never could figure out how to turn on the sconces. There were lights installed on the balcony but again, no switches turned them on. Front desk staff was unable to recommend a pharmacy open 24 hours when the one around the corner closed at 6 pm. Would not recommend.", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“GOOD VALUE FOR MONEY”", "Author": "Annalien K", "ReviewID": "UR117124273", "Content": "We have stayed at this hotel on the 12th and 13th of August 2011, the rooms were comfortable, the food was great, if you go to Rome to view your room then you have a problem as you only sleep there for a couple of hours a night! There is so much to see in Rome and the hotel is located in a good area and the balconies of the apartments nearby are beautiful to look at whilst driving there. We went with Trafalgar tours and can recommend this tour operator to anyone as it was the BEST ever! Well organised and would love to go back to Rome.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Orlando, Florida", "Title": "“TOO FAR FROM ROME...CLEAN AND NEW HOTEL....”", "Author": "Shelleybeth", "ReviewID": "UR116087858", "Content": "this hotel was part of our package deal with trafalgar tours while in rome...it was very far from the historic are of rome... it was clean, and somewhat new..but unless you are on a tour group and have but transportation to shuttle you, i would not recommend it...", "Date": "July 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Moscow, Russia", "Title": "“Would not recommend”", "Author": "PragmaticCinderella", "ReviewID": "UR109103806", "Content": "Stayed 4 days in this hotel during business trip. Was chosen because of located not far from office buildings. Small rooms, location in the middle of nowhere, every evening had to spend 30 euro for taxi from city center. The most awful - in this hotel lots of groups normally stay for 1 night within bus country trip. every evening - 5-6 buses! Real mess! It means that they leave hotel early morning, and you are waked up by terrible slams the doors loud noice! it was really terrible!", "Date": "May 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Amsterdam, Netherlands", "Title": "“My home away in Rome”", "Author": "Viking54", "ReviewID": "UR88841454", "Content": "This hotel has become my \"permanent address\" in Rome for the last 4 years, with 3-5 visits annually. Need I write more? Outstanding value for money: Large, very clean rooms with \"fullsize\" balconies, pleasant and serviceminded staff, English and French spoken at the reception, very quiet at night, large free parking space with guarded gate, even fresh country air - some 10 km. from the historical centre of Romeandn half of that from the business district of EUR. What more can one reasonably ask for anything close to this price? (American visitors should note that Italy is in Europe, where it is not customary to have things like coffe machines and microwave ovens in hotel rooms - that's what apparthotels are for...) . For tourists travelling without a car there is the disadvantage that the locaton is outside central Rome, and connecting to the historical centre by public transport is somewhat awkward. This is the only reason I haven't recommended this hotel for mature couples and families with children, amd only provided they don't have a car available. On the other hand a hotel in the centre with the same level of comfort would cost so much more that the price difference would cover the costs of a rental car for the stay, even if one travels alone. Personally I therefore prefer to stay at this very comfortable hotel, very quietly located in its own little private park at the edge of a small, green, newly built suburb to the south of central Rome close to the historical Via Appia Antica, and spend the money I save on the room on a rental car to explore any part of Rome or the surroundings at any time of day or night, with total freedom and mobility.", "Date": "December 2, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Sao Paulo", "Title": "“Stay somewhere else!”", "Author": "MiyaSaoPaulo", "ReviewID": "UR83044116", "Content": "If you can, avoid this hotel. It is not worth staying: too far from Rome main attractions and businesses, There is nothing around the hotel! You feel like you are not in Rome, you just feel you are in the middle of nowhere...", "Date": "October 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Coleraine, United Kingdom", "Title": "“avoid this hotel”", "Author": "gosia28", "ReviewID": "UR81518326", "Content": "nice hotel, far away but good bus and metro connection. small rooms. horrible breakfast - only bread, egg and bacon. fresh juice and coffee. very,very not friendly staff. i have decided booked this hotel even I read bad reviews, but these people were right. I am travelling a lot, few times in Italy and Rome, but this hotel was awfull!!!!!!!!!!", "Date": "September 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Hillsboro, Oregon", "Title": "“Average European Hotel”", "Author": "cruisenut2001", "ReviewID": "UR72238875", "Content": "We stayed here two days before our Trafalgar tour started. I knew from reading previous reviews that this wasn't the best hotel in town. This hotel does cater to tour groups, but we also meet several couples from around the world. I can say this is an average hotel after being in the other hotels Trafalgar put us in. Of the seven hotels we stayed in only the hotel in Vienna had air conditioning that cooled below 24C. Some of the hotels were in locations that didn't have public transportation. So this wasn't a bad hotel. We bought a daily metro pass from the tobacco store and caught the bus to the subway stop. Took the subways to the Spanish Steps and walked our way to the coliseum. We're used to public transit so the location is ok. All the elevators we used in Europe had a mind of their own and Aran Park's were no different. Although the hotel was okay, the price for the room makes this hotel a bad value. Yes, the room was not vacuumed and neither was the room in Venice. I would recommend this hotel, but with conditions: price, non-summer stays, and a European state of mind.", "Date": "July 25, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Johor Bahru", "Title": "“Think twice before u choose this hotel”", "Author": "thecancer", "ReviewID": "UR71145123", "Content": "I stayed there with Trafalgar group a week ago. Overall, the 3D2N was a horrible and upsetting experience. Firstly, the group check in was slow. The two hotel lifts at lobby were small and slow - a lot of us had no choice but to take the staircase to Level 5 and 6!! Secondly, when I called the reception counter to borrow an iron, the male receptionist was so rude and told me there's no iron in the hotel! Oh my god, this is the first time I ever heard of a hotel without an iron. I wonder did he understand English or he just unwilling to help. Basically, most of the staffs in the hotel were not friendly. I wonder is it because we are Asian? The hotel location is so weird and remote - it takes 20-30 mins to reach the city area. Luckily we travelled with the Trafalgar bus, or else I bet we have to spend quite a sum and time in taking public transport. The only good thing about the hotel is they have a big balcony in the room, that's all. Overall, nothing else to remember about the hotel except the feeling of being scorned by most of the staffs during the 3D2N. Think twice before you choose this hotel - unless you prefer to be upset by the unfriendly treatment.", "Date": "July 16, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "San Francisco, California", "Title": "“Dirty and Nasty”", "Author": "Mickey4510", "ReviewID": "UR70322119", "Content": "This is a hotel set up to handle large group tours yet they appear to hate all groups. The air conditioning did not work in many of the rooms. There was a used condom on the floor in our room for days - I kid you not (it was NOT from us). I do not think they have a vacuum cleaner.", "Date": "July 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "SF, USA", "Title": "“DO NOT STAY HERE--THEY HATE EVERY NATIONALITY”", "Author": "originofalphabet-com", "ReviewID": "UR69713302", "Content": "Do not stay here--they hate every nationality. Our tour guides hated them, and they're Italian.", "Date": "July 5, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Atlanta, GA", "Title": "“Horrible Experience”", "Author": "dawgtim", "ReviewID": "UR61253485", "Content": "We travelled to Rome with 30+ colleagues for a meeting and this was a nightmare. The people who work at the hotel treated us as if it was an inconvenience to talk to us. We had the following issues: 1) The wireless connection did not work the majority of the week. 2) The change machine did not work and the hotel staff refused to provide change (so we could use their vending machine) 3) The hot water in the room did not work the second night and we were offered a bucket of warm water if we wished to take a shower. 4) We were overcharged $118 Euros, and we could not be provided an invoice until we paid the bill. 5) The hotel staff would not provide a 2nd key to the room, even though my spouse was staying in the room and not part of the business trip. It was horrible! The location is terrible. It's a $25-30 Euro cab ride to anything worth seeing. I would not recommend this hotel to my worse enemy!", "Date": "April 13, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "greece", "Title": "“HELL”", "Author": "terrykastoria", "ReviewID": "UR59306748", "Content": "I wouldn't recommend this hotel to ANYBODY. I've never seen a staff that is so fascist, very rude. The worst people ever, they made us feel like we were on probabtion. We were there on a school trip from Kastoria, Greece. We were very excited that we were going to Italy. We didn't cause major problems, but of course when you have 100 kids between the ages of 17 and 18 I could say we were a bit loud, what with all the excitement of being there and all. THEY ACTUALLY CALLED THE POLICE ON US FOR DOING NOTHING. They almost took us in, and for what???? TRYING TO HAVE GOOD TIME. There is not ONE positive thing to say about this place. DO NOT STAY THERE. Worst time ever", "Date": "March 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "USA", "Title": "“Stay somewhere else”", "Author": "Seasoned_traveler132", "ReviewID": "UR59135142", "Content": "I don't believe that this is a four star hotel. It is on the very outskirts of Rome essentially in the countryside (hence the Park in the hotel's name). The front desk staff are rude and unhelpful. The food is TERRIBLE, and you are in the middle of nowhere, so there are no local restaurants to attend. The bathroom smells, the TV is the size of a postage stamp with no movies, and the bed is rock hard. There are no amenities (the fitness room is closed most of the time), no swimming pool. There is no business center despite the fact we came for a conference. For unclear reasons, the place is swarming with police carrying side-arms and machine guns....this does not engender a feeling of safety. There have got to be better hotels somewhere else. A Marriot, a Holiday Inn would be better than this place. How did this hotel get four stars?", "Date": "March 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Campinas, SP", "Title": "“Excellent hotel - Far from Rome's center”", "Author": "Couplecamp", "ReviewID": "UR57436178", "Content": "As the most of the other reviewers already said, this is an excellent hotel but far from the sightseeing points of Rome. The room that was given to me was very spacious, clean, with a large balcony, AC, flat LCD TV and coffee maker. The bathroom was superb for european ones and towels, soap and shampoos were constantly renewed. To reach the center from the hotel, you'll need to get a bus to the nearest subway station and afterwards a train (subway) to the main part of Rome. All this journey takes around 30 minutes. The hotel is located in a good and safe neighborhood, even during the night. There are some restaurants and small shops near the hotel. By the way, there's a very good japanese restaurant near the bus stop. Tip: buy your bus tickets at the newsstand at the side of the bus stop if the \"tabachi\" were closed.", "Date": "March 1, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Good hotel, but far away from the city centre”", "Author": "Experimentee", "ReviewID": "UR51933940", "Content": "I stayed here for two nights with a tour group. The rooms were a good standard, very clean, with decent sized rooms and big balcony. It had facilities like a clothes line in the bathroom, although it still had an old small CRT TV. The buffet breakfast was on one of the higher floors and was good with a lot of variety. The location was in an outer suburb far from the city centre, but the surrounding area was quite nice, with many trees and plants, and a local supermarket a short walk away.", "Date": "December 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "1"}, "AuthorLocation": "UK", "Title": "“OK”", "Author": "touristuk_09", "ReviewID": "UR31466765", "Content": "We did not like the location as it was too far from Rome. The rooms and service was pretty decent. If you have the travel arrrangements sorted out, then its a good deal.", "Date": "June 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "1"}, "AuthorLocation": "UK", "Title": "“Good hotel. Away from Rome.”", "Author": "Trav_9", "ReviewID": "UR28461495", "Content": "Firstly, the hotel. It was a good sized room with a big balcony. Views arent that great. Looks out onto an industrial area. AC is there but they switch it off at all times. You are asked to open the doors if you call the reception and complain about the heat. But thankfully, that wasnt a major problem when we were there. Location was an issue. Its located atleast a 30 min drive away from Rome.", "Date": "April 21, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "houston", "Title": "“worst possible idea for a conference in rome”", "Author": "renaldoc", "ReviewID": "UR22375906", "Content": "i was there for a conference in november , this hotel is to be avoided at any price 1- a companion has to pay extra 2- very far from the metro station and from the bus station 3- almost 10 euro to go to or from the metro to the hotel 4- avoid the shuttle service that the hotel provid to the airport it is a ripoff, order your own there are several companies in rome or book the cab on your own. 5- there is absouletly nothing to do in this hotel and the area around is resedential 6- the hotel provides a shuttle servise to metro station free but it is always late and stop at 5 pm and runs once an hour 7- the beds are uncomfortable and are twin size only.... 8- food is horrible at dinner 9- great breakfast", "Date": "December 2, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "London", "Title": "“Hotel from Hell”", "Author": "Reviewer111", "ReviewID": "UR21451606", "Content": "The hotel industry in Italy is obviously virtually unregulated. How this hotel can claim any stars at all is beyond me. It's dishonest and misleading. They should at least be challenged for false advertising as the description is misleading to put it mildy. The hotel is at least half an hour out of Rome, it's near nothing of interest. Awful location. On checking in, your date of birth is demanded. When i asked why this was needed and what it would be used for, they simply kept repeating that they needed it. The rooms are tiny and grubby and very brown, even so, the carpet and bedspreads clearly need a good clean. The bathroom tiles were cracked and broken. There was a hole in the wall where the tap was coming away from the wall. Water was TEPID, just what you need after a long day. There are only 2 lifts and they are always busy, you have to queue for it and most of the time people simply used the fire escape stairs. A colleague had money stolen from his room. Breakfast was absolutely average. Don't go there as it will spoil your perception of Italy", "Date": "November 1, 2008"}, {"Ratings": {"Overall": "1.0", "Value": "1"}, "AuthorLocation": "Barcelona", "Title": "“Worst hotel ever”", "Author": "Mulen", "ReviewID": "UR20286582", "Content": "As a business traveller I sleep out in hotels all over Europe more than 100 nights a year. This is by far the worst experience I have ever had on a hotel. Dont even know where to begin, but the worst part is the very, very rude personnel, from front Desk to Restarant, I did not see even ONE smile for 5 days. Hotel is located ridicously far away from anything. A maintenance man walk straight into the room, with my wife sleeping, even though the \"DO NOT DISTURB\" sign was on. Restaurant is far too expensive and waiters are so rude, I had to finish fast to leave. No Internet in the room and the wifi-connection in the bar is not working, but they still charge you 5 euros a day. The rooms where cold and beds hard as rock and we were told that they couldnt turn the heat on. Half of the elderly people of an american tourist bus tour got ill during their stay due to cold conditions in their rooms. By all mean, I would always avoid this hotel and if I have to give them one star it would be for the fitness facilities in the basement, which btw is not open during the weekend.", "Date": "September 22, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Singapore", "Title": "“Good Hotel. ABSOLUTELY PATHETIC Service”", "Author": "mehulvk", "ReviewID": "UR18632757", "Content": "We stayed at Aran Park hotel for 1 night in June 2008. We liked the hotel room but the service was absolutely PATHETIC. One particular incident that I would like to recall: We had dinner at the restaurant located on the 7th floor. We were very annoyed at the attitude of the restaurant manager. He is the most rude person I have met in the hotel industry. He had absolutely no manners. Since we had reached 5 minutes before the opening time, he very rudely asked us to leave. When we came back, he was again very rude in allocating a table to us. When my wife told him that we are vegetarians and so if he could recommend any dishes, he insulted us for being vegetarians. It was none of his business hurting our sentiments on dietary constraints. Moreover, the hotel is located in the middle of nowhere so commuting is a big challenge. Highly avoidable.", "Date": "August 5, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Surrey", "Title": "“never again”", "Author": "ramlosa", "ReviewID": "UR16986804", "Content": "We stayed for six nights at Aran Park Hotel while my husband attended a conference at Nuova Fiera di Roma convention centre. The hotel is a LONG way from the convention centre. You need to catch a bus-metro-train-bus to get there. The hotel is too far from Rome if you are a tourist. You need to catch a bus to get to the metro (I had to wait 45 min for a bus) and then take the metro to central Rome. The staff at the front desk were neither helpful nor friendly. No tourist information was on offer, not a single leaflet in the entire hotel and nobody could inform you about a tourist office. The beds were very uncomfortable and the bathroom looked tired and not very clean. This is NOT a hotel for anybody who wants to visit Rome and enjoy the sights.", "Date": "June 17, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "san jose, ca", "Title": "“bad location for tourists; front desk in eve bad service”", "Author": "aimetravel", "ReviewID": "UR14467848", "Content": "husband and I stayed here as part of a trafalgar tour in sept 2007. I do NOT recommend this hotel to tourists. Location was extremely out of the way. Front desk service in evening was nonexistent. no shower curtain. We did not purchase all of the Rome optionals on our tour so we navigated the public transit by ourselves without speaking any Italian (we had a GPS). To get to the nearest metro station you had to take a bus, it is not within walking distance. Pros: hotel was clean and furnishings look newer that's about it. Cons: these far outweigh pros so I do NOT recommend this hotel to any tourist VERY BAD location, have to take bus to get to train station, then take subway into Rome tourist areas/attractions. train station appears a bit rough with all the graffiti etc though we came back in the dark and didn't get mugged Bad front desk service in evening, the man did not want to even speak to you. Answer to every question was, \"No.\" He was reading and appeared to be upset I was even there. front desk during day was ok though. No shower curtain, as other reviewers noted. No way to avoid water all over floor of bathroom. buffet breakfast total chaos to find an avail seat and get food, long lines, too many people at once. only thing worth eating were the croissants.", "Date": "March 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Reading, UK", "Title": "“No good for anyone - except coach parties”", "Author": "Hibit", "ReviewID": "UR13792606", "Content": "The problem is that this hotel is no good for anyone. For the business traveller it is away from the main business areas and off a main road - so getting taxis or buses to the office is a problem. It also only has internet in the lobby. For tourists it is a long way from the main tourist areas, in an area with poor restaurants (taxi ride need to some pretty good ones) and the restaurant is poor. It is fairly big and coach parties have their own transport, so its OK for those big groups. Its clean I guess, but that's the only thing to recommend it. Its a shame as the staff seem generally positive.", "Date": "February 23, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "2.0", "Value": "3", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Eau Claire, Wisconsin", "Title": "“Poor choice for tourists”", "Author": "dickersn", "ReviewID": "UR13123704", "Content": "This is a nice hotel but it is a business hotel. It is NOT a good choice for tourists or for groups. The location is in suburban Rome, several miles outside the city center. Getting to central Rome using public transportation is a major hassle. The closest Metro station is 2 or 3 km away. To get to the Metro station you must walk several blocks to the bus stop and wait for a bus that may never come. The busses are unreliable and they don't run late at night. The hotel claims to offer a shuttle to the Metro station but don't count on that either. If you arrive hungry you are out of luck. There is no food (not even a grocery store) within walking distance. The hotel restaurant is expensive and is only open during meal hours. The front desk staff told us that the downstairs bar serves sandwiches but the staff at the bar said no. After several trips back and forth between the front desk and the bar the bar getting conflicting information each time the bar staff reluctantly showed us a menu and made us a sandwich. Most of the front desk staff was polite but there was one very rude desk clerk. I was in charge of a large group of travelers and we had booked about 50 rooms in this hotel for 4 days. Everything was paid in advance. One would think that the hotel would be happy to have our business. They were not. They treated us as if we were an inconvenience. I'm sure their business travelers get much better treatment. It is okay that they prefer business travelers to tourists but if they accept our reservations and our money they should give us equal treatment. I have had some wonderful experiences in hotels and Inns in Rome. This was not one of them. If your intent is to visit central Rome this is not the hotel for you.", "Date": "January 30, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Caracas", "Title": "“could be a lovely hotel if....”", "Author": "Jamdowner", "ReviewID": "UR10119800", "Content": "Our stay at the Aran Park came at the end of a hectic Euro. bus tour ( Iberojet ), & we'd anticipated staying ( at last ) in a comfortable, modern hotel after having had some nightmare experiences along the way. I like the building's appearance & it's located in a quiet neighbourhood. The building obviously is in need of a bit of sprucing up to make it what it could be--- a comfortable place to stay away from Rome's hustle & bustle. Our check-in with the group went well, & the surprise came when we opened the door to our room. It was so small, with the smallest single beds I've ever seen, separated by a lone small round table. Our reservation was for a double room for my husband & I, & I suspect they tried passing off a single with 2 single beds, as a double. There was absoultely nowhere to leave toiletries in the bathroom as there was just a sink , no countertop nor shelf, & the mirror was about to fall off the wall. In the room itself, there was no cabinet, therefore nowhere to rest one's bags except on the floor. There was 1 chair in what should've been a double room. After 4 calls to the front desk, a staff member eventually arrived, (this about 2 hours after our check in), to see the condition of the room & confirm the mirror's partial detachment from the wall. We were eventually assigned a double room, but had to go to the desk to collect the key. The room was like a room should be, with a cabinet & counter top, plus there was a place in the bathroom for toiletries. Unfortunately there was no shower curtain therefore the floor got wet. I like the balcony, which offered a change from sitting in the room. Fortunately in the true double room there were 2 chairs, so we enjoyed late evenings or nights sitting on the balcony enjoying the cool, fresh air. The hotel could be lovely should attention be paid to details like the lack of a shelf in the bathroom ( in what I suspect is a single room ), & cabinet space in the room. They might want to consider adding a little colour to the rooms too...the grey & white combination ( a little blue's there too ), is a bit dreary. Overall, I like the place, but was upset by the unnecessary hassle encountered by having been assigned a ridiculously small room & having to wait 2 hours after a long, tiring trip, for a change. Another negative is that one has to go to the lobby to obtain internet access.", "Date": "October 18, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Montreal, Canada", "Title": "“Good experience to Aran Park Hotel”", "Author": "Sunshinesea", "ReviewID": "UR8614925", "Content": "Hi! our stay at this hotel was generally very good. Fist : Location the location could be hard to find, I agree! Maybe 10 to 15 minutes by car from the 2 nearest exit of G.R.A. of ROMA. This hotel is estimated time 30 minutes from both airport (Fiumicino or Leonardo Da Vinci). A suggestion : find it by day, when you could ask to local your direction.... or find with a GPS. This hotel is located in a quiet neigborhood. It's a 5 to 10 minutes ride by taxi to neareast subway station (Laurentina). After a 20 minutes ride of Metro to central Rome. (the taxi cost 10 Euros per ride). The hotel lobby is nice and well furnished. The reception frontdesk service depends of the people. Better service during day then night. The people at the front desk have a very bad attitude on our arrival (it seems they don't like we booked our trip throug priceline and paid less.... and was rude for this reason). But during the morning they called a taxi for us and smiling. The room is ok, clean, large and practical. The 7th level restaurant is good. The free continental breakfeast including few choices, More then other hotels in Italy. pastry, bread, jams, ham, scambled eggs, oranges juices, cereals, milk , coffee made on order (expresso, Cappucino), and a nice environnment for the breakfeast with nice view. The dinner is expensive (mostly for business travelers). The choice is good, but some dessert (like Tiramisu...) are not worth the 9 Euros. The wine list is also expensive, no house wine. In fact : our last evening dinner (to this hotel) was the more expensive of our Italy stay, and was ok, but not exceptionnal. This hotel is a good place to stay for a last night - previous night to go at the hotel if you have a car. You could park your car in the free parking. (safe place). And you're not too far from highway for your departure and you don't need to expect the Rome city center driving. This hotel was full of tourism bus arriving for this kind of situation (last night before the airport! and returning at home). I", "Date": "September 3, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "O.C., California", "Title": "“Awful!”", "Author": "LovetoTravel067", "ReviewID": "UR8266473", "Content": "This hotel is awful! They do not believe in service at all. The bathroom tiles, where the shower is located, were full of mold and mildew. I asked the front desk to have maintenance clean it and they never did. A shower curtain does NOT exist, so when taking a shower, the water gets all over the floor. As for breakfast, it is awful! If you like runny scrambled eggs, then you will enjoy it. During breakfast, you are not allowed to sit where you want. If you do not sit where the waiter wants you to, he will yell at you. The waiter wants to sit you with others (strangers), probably because he does NOT want to work. The service is just plane awful in this hotel. The hotel is far away, in fact too far from the central city, Rome. The overall experience is horrible.", "Date": "July 31, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“An oasis of calm - for the seasoned traveller, not the tourist”", "Author": "MediterreanFlair", "ReviewID": "UR7706704", "Content": "I've just stayed one night at the Aran Park and felt very, very comfortable there. There are some points, both positive and negative, which confirm some of the reviews on various websites: - The hotel claims to have a \"Shuttle Service\" - but this is from the nearest Metro station, not the Airport(s) - The hotel's street address is spelt incorrectly on some websites and taxi drivers could not find it on a map. It should read \"Via Riccardo Forster\", not \"ViaRiccardo Foster\". - As a mature woman travelling alone, I started out on quite an adventure to get to the hotel by train, metro and taxi. Including the time to gather this information on arrival at the airport, it took more than 1 1/2 hours before I reached the hotel from Fiumincino by which time it was almost dark. - But, next morning I had a really nice taxi driver who took me exactly where I wanted to go - window shopping in Via Condotti, Spanish Steps, etc. in about 15-20 minutes at a cost of only EUR 16. - Considering that I had paid a deep discounted price of only EUR 89 for this 4-star hotel - easily less than half the price of city centre Rome, a couple of taxi fares were well worth spent in my opinion - This hotel is definitely oriented to the Italian business population and not the international tourist. There were a couple of small organised travel groups in the hotel though. The reception staff were inattentive, but the restaurant staff in contrast very helpful. - As it was late evening when I arrived and the restaurant was closing at 22.30 hrs., I just ordered a small starter - a delicious Greek salad - and a couple of glasses of wonderfully chilled Prosecco. At a very reasonable price of EUR 10 for the salad and EUR 4.50 for the Prosecco. Other items on the menu seemed appropriately priced, not overly expensive as some critics have written. - I was given a spotlessly clean room, with a large balcony with exactly the beautiful view over luscious gardens and picturebook Italian surroundings shown on the Internet. The air conditioning worked fantastically well. All in all, this hotel made a really positive contribution to my very successful short super last-minute trip.", "Date": "May 28, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "California", "Title": "“Tourist beware!”", "Author": "MartyCalifornia", "ReviewID": "UR7428753", "Content": "Travelers beware - This hotel is not for the tourist. The hotel is too far from the City and the run across town is not worth it. The hotel staff is more interested in the Italian business guest than the tourist crowd. The tourist is pretty much a nuisance and begrudgingly served. Sleeping accommodations were 2 stars at best. The rooms were clean, beds were hard and pillows at a premium. The hotel staff was not courteous and at best could be described as INDIFFERENT! Bar service was slow, drinks weak but most of all very much lacked hospitality. The restaurant staff was worse, the food and presentation was pitiful! Over the entire hotel staff was not guest service oriented. No hospitality to be found in this “4 Star Hotel”. Shuttle service every 30 minutes - Try 1 hour 15! Lobby decor – A blind mans garage sale frenzy (Asian meets African with dried/dead floral arrangements). Rose garden – a handful of rose shrubs do not make a \"Rose Garden\".", "Date": "April 24, 2007"}], "HotelInfo": {"Name": "Barcelo Aran Park", "HotelURL": "/ShowUserReviews-g187791-d233375-Reviews-Barcelo_Aran_Park-Rome_Lazio.html", "Price": "$59 - $142*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Riccardo Forster 24</span>, <span class=\"locality\"><span property=\"v:postal-code\">00143</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "233375", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/4b/a4/43/barcelo-aran-park.jpg"}}