{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Banbridge, United Kingdom", "Title": "“\"A very disappointing four* hotel\"”", "Author": "209955Asq", "ReviewID": "UR128007698", "Content": "A great need for refurbishment throughout the hotel. Black mould or dirt on window frames in breakfast hall. Bedroom while cleaned and fresh linen everyday was tired looking. Noisy at night. The Shower had no curtain and it was impossible to use without having the bathroom like a wet room. Unable to get any refreshments even though bottles were on display. I was very disappointed with breakfast not a good experience for example - the tea/coffee and hotwater were from the one dispenser and all tasted the same - terrible. Bread just white not fresh, fruit -apples or oranges not nice I could go on. Along distance from the centre of Rome however bus service was ok but too far", "Date": "April 16, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Rotterdam", "Title": "“Worst hotel ever!”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR126507454", "Content": "Terrible hotel!!! Worst hotel I ever stayed at and DEFINATELY not worth 4 stars, at the most 1 star although I hesitate if they even deserve a star. Rooms are dirty, once we arrived, after checking in we had to go downstairs to ask if they could clean our room. Hairs of the people before us in the bed and bathroom, mould everywhere in the bathroom, shower was to discusting to shower in, television didn't work, toilet leaked, everything was old and it seemed as if they had not cleaned the room for the last year. Unfortunately we booked for 5 days and in these 5 days they did make up the bed (if you leave your room before 09.30) but never cleaned the bed so we were lying underneath the same sheets for 5 days, and that for a 4 star hotel?!? Bed's are as hard as the floor and all exist out of 1-person beds so you can hardly call it a double bed. If you have any issues with your back I would definately not advise this hotel eather. Breakfast was terrible too and service? I think they have never heard of the word service before. Regarding the location, it isn't nearby the city at all, the hotel isn't even on the tourist map that's how far away it is from the city center. At least 45min. to the center and there is only 1 bus going there a few times per hour. The hotel is in the middel of a neighbourhood where there is nothing to do at all. We will NEVER EVER stay there again and advise anyone NOT to eather. It's a shame that this website represents this hotel, the foto's aren't even like the hotel looks at all. It is really a waste of your money and time!!!", "Date": "March 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Helsinki, Finland", "Title": "“A lot better than expected.”", "Author": "Sami K", "ReviewID": "UR126065414", "Content": "I have to admit, after reading these reviews I would have changed my hotel if it just were possible. However, I was really pleasantly surprised to see that my hotel room (and supposedly the whole 4th floor) appeared to be recently renovated. The room was spotless, and the bathroom all shiny and clean with marble decorations. Also the third floor was being refurbished during my stay (march 2012). Contrary to some earlier reviews, there was free WI-FI available in all rooms (just ask for the password at reception). You only have to pay if you want to use the computers in the lobby. Still, I would rate this hotel as a 3-star at best. But for this price, I doubt I could have found anything better. The location was bearable, Termini station easily reachable by bus 360 with seemingly short intervals. There is also a quick (only 2 stops) train connection to Piazza del Popolo from the train station (Acqua Acetosa), about 5-10 minutes walk from the hotel.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Huge disappoitment. Choose other place!”", "Author": "Zdekal", "ReviewID": "UR124254212", "Content": "Hotel is situated in a very calm residential location, 40min walking from the center. There is just one bus coming here from the trainstation with unexpectable times, however, thats not such a problem. Generaly, the accomodation is very unpleasent and makes you angry so often that I really recommand to bypass this swamp. Starting with rude, unhelpful receptionists, the rooms are dirty and without real blankets. If you ask for one extra, you get the kind of prison grey blanket which have problem even to touch. Bathroom was mouldy with dirty shower blanket. Walls are very weak, so get psyched to hear everything from your neigbours. Breakfast seemd to be OK, until you taste the only cheese they serve - uneatable and every day the same. It sounds like deep hole and it realy is. Do not jump to the trap of nice pictures. The hotel is definatelly not 4 stars. It has qualities of 1 maximum 2 even with the beautiful upholsteries.", "Date": "February 7, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Durban, South Africa", "Title": "“Beautiful hotel, disappointing room and far to travel into town”", "Author": "Jennavm", "ReviewID": "UR124003472", "Content": "The hotel was lovely but our particular room was disappointing compared to other 4 star hotels (may have just been a cheaper room). The staff were somewhat cold and there was only PAID wifi in the lobby. It was a long way into town with not much around the hotel at all. The hotel itself is gorgeous however.", "Date": "February 2, 2012"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0"}, "AuthorLocation": "Phoenix, AZ", "Title": "“Good hotel with two minor problems”", "Author": "DocMartens", "ReviewID": "UR117994277", "Content": "Good hotel for Europe. The rooms were clean, large (Europe wise), and the breakfast was very good. The only complaints I had about this hotel was the lack of WiFi (only in the lobby) and it's location. It was quite a ways from the city center and locally, there was not a lot around. I was on a student educational trip so I'm not sure about the cost vs ammenities. At times there where many high school students walking around the hotel. Most in the lobby using the WiFi. The roof does have a very nice sitting area for relaxing and drinks if you so partake. Good hotel overall but if I was not on the educational trip, I would have picked someplace closer to the city center.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Moscow, Russia", "Title": "“Average hotel with no special advantages”", "Author": "baiyzet", "ReviewID": "UR115771769", "Content": "Stayed at the hotel for the weekend. Overall, the hotel does not produce the worst impression. Staff at the reception friendly and always willing to help. The hotel has a terrace on the roof from where the evening you can have a good time for a bottle of wine. The rooms are cleaned every day and towels changed even. Disadvantages of the hotel: - very inconvenient to travel by bus, you wait an hour and not wait for the bus (onli №360) - taxi from Termini train station is 10-12 euros - we have a room air conditioner worked poorly, it was stuffy at night. - not Free Internet", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Albuquerque, New Mexico", "Title": "“Quite pleased”", "Author": "U_s_Myr", "ReviewID": "UR115092924", "Content": "Rooms are comfortable and clean. There were no complaints from our group of 25 people. The dinner was enjoyable and the breakfast excellent. Good eating facilities. Lovely rooftop views especially at night. An old hotel, but it maintains it's elegance. Some curtains could be replaced in the lobby. Good service. Would recommend.", "Date": "July 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "2"}, "AuthorLocation": "southend", "Title": "“very disappointed”", "Author": "disappointedSouthend", "ReviewID": "UR104562281", "Content": "Initial impression very good. Couldn't open room door without hitting wardrobe. Wallpaper peeling off walls. Many holes in wall where rewiring had taken place but old boxes not filled in. Black mould in shower and all around mirror in bathroom. Large amount of dirt and filth between sink and worktop,hadn't been cleaned in months. Advertised as having satellite TV. Could only get 5 channels and only 1 English speaking channel. Reported theft of phone probably from room, reception staff showed distinct lack of interest, Asked for details of local police station and the knowledge of English quickly faltered. NO FIRE ESCAPES. Fire alarm button on our floor indicated as out of order. Never a 4 star. Probably an excellent hotel 25 years ago but extremely poor maintenance and decoration have seriously damaged the quality of this hotel. Seems to rely on school parties for income. I would also query some of the distances they give to major attractions. Most are 2 bus rides away and take probably 30 minutes. Taxi to Pantenon which is apparently less than 3 miles cost 15 Euros. Also had an ant infestation in bathroom. Wanted to use internet to block stolen phone but they wanted 5 Euros for the pleasure. Stayed for 5 nights and never saw the bar open once.", "Date": "April 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“There are better hostels than this 4 star relic from the past”", "Author": "Dpf_10", "ReviewID": "UR86549215", "Content": "This hotel is a disgrace and the worst I've ever stayed in. Threadbare, dirty, poorly furnished, surly service, the shower leaked everywhere, the toilet seat was broken, the walls are paper thin and to cap it all the breakfast was beyond a joke. I should have known it would be bad when the taxi driver on the way said that it was in a very nice area but it needed some attention from the owners. If you are taller than 6ft then avoid a single room or else sleep on the floor. The authorities that bestow stars in Italy should hang their heads in shame.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Tartu, Estonia", "Title": "“3,5 hours spent checking in - worst service ever!”", "Author": "kristi84", "ReviewID": "UR71738174", "Content": "We arrived with a group at 10 p.m and after 3,5 hours of waiting for a functioning room and listening to the administrator having a panic attack, we fell asleep at 3 in the morning in a room that has a broken toilet.", "Date": "July 21, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Moscow, Russia", "Title": "“Rooms - nothing special, service - rather bad, meals - extremely poor!!!”", "Author": "AnnetMoscow_Russia", "ReviewID": "UR70717164", "Content": "Stayed at the place this spring... It looked nothing alike to a 4-star hotel in Rome. The rooms are small, staff is absolutely unfriendly, breakfast and dinner were never served on time. I liked the neighborhood but it is too far from the city center.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "eindohven", "Title": "“Not healthy atmosphere with lot of foul smell in the rooms and staff non coopertive”", "Author": "chaitanyaEindohven", "ReviewID": "UR67768798", "Content": "i stayed in the hotel from 13th to 16th June . the staff at reception is very rude ,non- cooperative. The rooms having foul smell .", "Date": "June 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "scotland", "Title": "“4 star 50 years ago”", "Author": "ScotlandJazzy", "ReviewID": "UR62973858", "Content": "Hi, We were caught up in the recent volcano disruption and managed to land up here! We couldn't re-book our original hotel and spend £468 euros on 3 nights here.Suspect they were cashing in.The breakfast was stale and the coffee was rotten (unheard of in Rome)The room and hotel may have been 4 star 50 years ago,but no longer.We did have a decent terrace though,which was one saving grace.Avoid if you can!", "Date": "May 1, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "london", "Title": "“Do not stay here under any circumstances”", "Author": "gummo0808", "ReviewID": "UR35640322", "Content": "Poor location, too far from the city centre. Surly, unfriendly staff at reception unwilling to help in any way. Rooms are old, crusty and unclean. Aircon failed to work in most rooms at all times. How it manges to claim a 4 star status is beyond me. Stay anywhwere in Rome but here!", "Date": "July 24, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "London", "Title": "“do not stay here”", "Author": "John1662", "ReviewID": "UR35602178", "Content": "The rooms are terrible with awful beds, in two of our rooms the air con was broken and the staff certainly don't care. There is nothing to recommend at all.", "Date": "July 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Norwich", "Title": "“Absolutely Appaling avoid like the plague”", "Author": "WhingingPomme", "ReviewID": "UR31483970", "Content": "The staff at the Hotel Hermitage thought that they were more important than the guests. Their attitude was disgusting and rude beyond all measure. At one point I found the cleaner lecturing my 10 year old son in Italian, putting a finger in his face and shouting at him. The bar never opened, not once during our 3 day trip! How this hotel has a 4 star rating is beyond my comprehension. The breakfast was appalling, stale bread, dirty cups. This hotel was shocking.", "Date": "June 3, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "UK", "Title": "“Not up to its standards”", "Author": "difficultUK", "ReviewID": "UR26786971", "Content": "This was recommended to us as a very comfortable hotel offering luxury. Well, it certainly was dated . The service was extrememely disppointing. The staff was inefficient and often with bad manners. I have no idea what the name of the hotel used to mean, but it certainly should not be offered as a luxury hotel these days.", "Date": "March 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Cardiff", "Title": "“Decent hotel for a decent price”", "Author": "BigWillCardiff", "ReviewID": "UR19200520", "Content": "I treated my girlfriend to three nights at the Hotel Hermitage. In contrast to some of the other reviews, we found the staff helpful and friendly, the room of a decent size and quality (although the shower cubicle was broken and the room smelt a little musty initially) and the breakfast typical of most other mid-price European hotels we have stayed in. The bus stop is only 2 minutes walk from the hotel, with the drive into central Rome taking about 15 minutes and costing just one euro. The views from the roof terrace are impressive, but when we were there the bar was not open. The surrounding district is quiet and elegant, with several pleasant restaurants and shops, and we both felt safe walking around late at night. I would certainly recommend this hotel for travellers on a budget.", "Date": "August 21, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "rsprouleny", "Title": "“Hated This Place”", "Author": "rsprouleny", "ReviewID": "UR14697875", "Content": "Stay away. The first room they gave us smelled so bad I thought something had died there. The next room only had one plug for the TV and refridgerator; take your pick, but only one at a time. Turns out that it didn't make any difference since the fridge was broken. The room was filthy. Ignor the Hotel's website: miles from the central city, nothing nearby and no in-room safety deposit box. This place is not a good deal.", "Date": "March 31, 2008"}, {"Ratings": {"Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Floral Park, NY", "Title": "“Overall, worst choice ever.”", "Author": "CRotella", "ReviewID": "UR14487781", "Content": "The “Grand” Hotel Hermitage is labeled as a 4 star hotel, and from the looks of their very selective website, it appears so. As a guest in this hotel, let me inform you, ignore that website totally. The room I had was very small, which I won’t really complain about, but it was lacking some things such as: working heat, remotes for the television and tissues. The most important thing lacking was a safe. I repeat, there is NO SAFE in any of the rooms in the hotel. The rude desk staff informed me that it was 5 Euros a day to place something in their safety deposit box. I will also mention here that my bag, on the first day, was moved, opened, and looked though by the cleaning staff. I had read a review from another guest who stated that his bags were also given a once over. The rooms were not filthy, but not a standard of clean that I find acceptable. The glasses in the room were dirty, as was the shower, and just about everything in the bathroom. My balcony consisted of stained outdoor carpeting, and a broken table with no chairs, and a perfect view of the hotel next door. There were no windows in the room, only the door to the balcony (which could not be fully opened.) The breakfast consisted of cold hardboiled eggs, coffee, some hams and yogurts. It was not good, but other than the eggs, not terrible, except for the fact that every piece of silverware was dirty, as were the glasses and most of the plates. The hotel is in a suburb of Rome, and is miles away from any attraction. Again, do not believe their website. I was lucky enough to be with a tour group who bussed us into the city. If not you would have to take expensive cabs. This suburb did not exactly feel safe either; I do not recommend walking around by yourself past dark. Overall, I would rate the “Grand Hotel” a 2.5, or 3 star, but somehow it is a 4… On my trip to Italy I stayed in 4 hotels, 2 of which were 3 stars, and those two far, FAR, surpassed the Grand Hotel in every way. My advice is, please, stay somewhere else. If you still want to give it a shot, you’ve been warned.", "Date": "March 24, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "3", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Milan, Italy", "Title": "“Stay away!”", "Author": "colbuck", "ReviewID": "UR10910993", "Content": "I agree with other fellow travelers: this hotel is terrible! I don't know where it got its 4 stars rating from. It's not more than a 1-star place! My room was very small and definitely looked old. The bathroom was clean but required uergent refurbishment. Breakfast was very poor. Luckily I slept here only one night, checking it late in the evening and checking out at 7.30 a.m. the next day!", "Date": "November 19, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Brussels", "Title": "“Who administer the granting of hotel stars in Rome?”", "Author": "Al_Bwana", "ReviewID": "UR10001064", "Content": "As this hotel was booked through the organisation that was arranging the conference I was attending in Rome, I did not have any input in choosing the hotel. When we got to the hotel (which is really quite far out of town), we were told we were being transferred to another hotel in the chain for one night. Not being difficult people, we readily took the taxi that they paid for and were transferred to Hotel Eliseo (from the same Leonardi Hotels chain). It was ok for 4 stars, but more on the 3 stars level. The following morning we were transported back to the Hermitage, where our room was not yet ready, so we were allowed to leave our luggage behind the reception while we went back into town. When we returned at 11 p.m. and asked if our luggage was moved to our room, the concierge seemed quite amused by the idea that they could actually have placed our luggage in the Room once it had become ready! Not seeing a remote control for the air conditioning, I called the reception but was told that they had the remote, but I would have to speak with the manager the following morning! So, no alternative but to leave the window opened! Wall paper was also peeling of the walls - Definitely not four star quality. The bathroom is so small that my legs were almost upto my chin when sitting on the toilet..... The shower head would fall off the hook each time the water was turned off. At breakfast, the coffee was cold, and when one of the guests asked for hot coffee, the waitress became very upset and pushed her trolly against the wall. This was really a scene out of Fawlty Towers! In short, avoid this hotel if you can, but then again, the others in Rome might not be much better .....", "Date": "September 25, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Montreal", "Title": "“Sleeping in a closet...”", "Author": "EmanuelleMontreal", "ReviewID": "UR8282105", "Content": "I was at the end of my trip in Italy and Rome was our last stop. I was not expecting much given that I am travelling alone and as a single traveller you always end up with the worst hotel rooms ever even if we pay a surcharge….. That said my room was so tiny that when I wanted to be able to walk in the room I had to put my luggage on the bed. In the bathroom there were little bugs that were getting out of the shower drain…that I had to cover all the time in order to prevent them to come in the room…. When I saw that I was a little bit discouraged and I asked if I could change room… then it was my second shock….and so much for the empathy and for the hotel employees willing to help you…After that I tried to compose myself, realizing that at the end of the day I was only there to sleep and eat in the morning. There are absolutely no services offered in this hotel other than the breakfast in the morning. Employees are not courteous at all, every time you were asking them something you always felt that you were bothering them….somehow I was happy being there in May at the beginning of the tourist season thinking about those poor tourists that would come in July –August…..The hotel location is not ideal and very far from everything, yes there is a bus station in front the hotel that brings you downtown but it takes at least 30 min to get to Termini station… In conclusion avoid this hotel don't even consider this one for any reasons…", "Date": "August 2, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Tennessee", "Title": "“Wonderful place to stay...”", "Author": "Pegsels", "ReviewID": "UR8020564", "Content": "Hotel was quaint and in a quiet, residential area of town yet 15 minutes from all the action. While a bit dated, the rooms were very clean and pleasant. We were able to sleep with our window open as the weather was nice. Breakfast was great with something for everyone and good coffee. Staff was pleasant and helpful, even arranging a pedicure with a local salon. Open air market was a short stroll away and we had lunch at one of the open air places there. The main street, Via Parioli was nearby with a number of nice restaurants. For a great meal, La Scala is a must! We were the only \"non locals\" there (always a good sign) and it was so good that we went two nights in a row. Try their buffet- lots of great, real Italian food and the ice cream was fabulous. Would definitely revisit and recommend this hotel.", "Date": "June 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Fort Lauderdale, FL", "Title": "“A pleasant surprise”", "Author": "design_CEO", "ReviewID": "UR7284751", "Content": "This was my first trip to Europe, so I didn't know exactly what to expect. I did some homework beforehand, and much of it was true. If you are expecting American style amenities, you are going to be disappointed. I don't know about wi-fi, but there are two computers in the lobby that have internet access. It's 3 Euro for 30 minutes. When I travel, the hotel is just a place to sleep, change clothes, and freshen up. I didn't travel thousands of miles to look at a hotel room. There are some nice cafes just a short walk from the hotel. I found the staff to be pleasant. They speak enough English to provide information and interesting small talk. The only legitimate grievance I have is the water temperature in the shower. Other guests concurred with me that it doesn't get hot enough. The hotel is in an upscale neighborhood, and it is very quiet at night. I felt very safe walking around at night. The main metro terminal is only a 20 minute bus ride. Yes, it's far away from the \"Disneyfied\" tourist attractions, but that's not always a bad thing.", "Date": "April 5, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Galway", "Title": "“Terrible Hotel”", "Author": "Eirnet", "ReviewID": "UR7196524", "Content": "Only stay here if you have to. We were promised new, polite staff - central location - good spacious rooms. It was awful. It's miles from the centre of Rome, no bar or restaurant, rooms are tiny. It has nothing going for it.", "Date": "March 21, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "UK", "Title": "“Avoid at all costs”", "Author": "StewieZ", "ReviewID": "UR6801657", "Content": "This is an awful place. Stayed here for 2 nights in February, the worst 2 nights I've ever spent in a hotel. The staff are extremely rude and unhelpful (they don't seem to like English speakers), rooms are dirty and in dire need of refurbishment, and the bathrooms are tiny. The window next to the bed in my room was actually coming away from the wall, so it was permanently open. Don't bother trying to phone reception to ask any questions, they just put the phone down on you. The reception seems quaint on arrival, but don't be deceived, it's a horrible place. I didn't even venture to breakfast, goodness knows what was on offer. There are some nice restaurants at the bottom of the hill, but the hotel is some distance from the centre of the city, so not be the best area to base yourself for seeing the sights, but if you want my advice NEVER stay here.", "Date": "February 16, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Sevilla", "Title": "“this hotel is a bad option”", "Author": "Ayante", "ReviewID": "UR5828687", "Content": "It doesnt value the money you will pay fot it. I can not understand how this hotel can be a 4 stars hotel: two stars would be enough. Anyway, if you decide to book it avoid twin rooms: beds are horrible. Another handicap: city center is far and is difficult to reach it by public transport. Taxi:10-15 euro. staff behaviour ok. LDG, España", "Date": "September 23, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Quite a nice hotel after all!”", "Author": "belladonna73", "ReviewID": "UR4478104", "Content": "I stayed in the hotel for 4 nights with a friend. To be quite honest I was really dreading it after reading the reviews about it. However Im pleased to say that it is not nearly as bad as I had read about. Overall I found the staff pleasant, when we asked for directions into the town they drew us maps and pointed us in the direction of the bus (which is very near to hotel) and to the train station which is about a 10 minute walk. (down hill from hotel) We stayed on the 7th floor and we had a balcony with a nice view of the city. The bathroom was clean and their was plenty of showers. We had a slight problem with the sink but it was sorted out quickly - when we reported it. It was very hot at night but as soon as we voiced this the heating was turned down. The breakfast was adequate as you could have as much as you wanted. The entrance is very nice and the roof top terrace is beautiful. It's a shame that the bar doesn't operate as this would add to the hotel overall.", "Date": "February 22, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Windsor, Berkshire, England", "Title": "“Not 4 Star”", "Author": "Julie1953", "ReviewID": "UR4455972", "Content": "This hotel is definitely not 4 star. Half an hours bus ride from Termini station/town centre. Nowhere to go if you arrive late in evening, as there is no bar or restaurant. No room service as advertised. Breakfast consists of meat and cheese, one cereal and pastries. Carpets were peeling off wall. Would not recommend this hotel at all.", "Date": "February 13, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "New York, NY", "Title": "“A cruel joke for a hotel”", "Author": "shadow2x", "ReviewID": "UR4396091", "Content": "What can I say. This was by far the absolute worst hotel we've ever stayed in while in Europe. The hotel staff were rude, incompetent, condescending, and belligerent towards the tourists who are simply looking for advice on where to eat and how to get there. Our tour guide told us later that the staff there are not paid very much money, which could possibly explain for their extremely offensive attitude towards foreigners (speaking Italian won't help, as they still tend to ignore you). The only transport out of this hotel into the heart of Rome is either a taxi or a bus stop up the road. The problem is that the bus system is erratic and inconsistent. You may get to Rome via the bus, but good luck getting back to the Hotel. The return bus is lost in space somewhere and no one knows why. Getting back may cost you about 20-30 euros via cab. The room itself was cramped, cluttered, smelly, and quite uncomfortable. The beds were like brick cushions, the sheets were paper thin, and the pillows were weak. Carpets in the room were peeling and the wallpaper was laughable. The bathroom was deplorable. There is no normal shower with curtains, as you have to hold the detachable showerhead with one hand and wash your body with the other in this small 2x2 tub as if you were in a third world country. Obviously since there is no shower curtain, water gets spilled all over the floor. Not my problem, since the Hotel wasn't smart enough or were too cheap to put a basic curtain above the tub. To top it off, the radiator was broken which left the room scorching hot. The knob to turn it off was broken of course, and no one from the staff was willing to come up and fix it -- so we were stuck with leaving the window open all night which didn't help much. Do not believe the fancy pictures from other websites. The majority of the rooms in this building are just downright disgusting. Do yourself a favor and book a hotel closer to town with a decent rating.", "Date": "January 29, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Sheffield, UK.", "Title": "“Worth the money”", "Author": "hardacre", "ReviewID": "UR4365574", "Content": "Stayed here for 5 nights this Jan a few moans but nothing holiday breaking, Heating stopped working, one night, so they move us to a room with a balcony. Breakfast was buffet style, with plenty of rolls/cheese/salami/fruit/corn flakes/tea/coffee/juice and french toast to help you through the day. The hotel is about 3 miles north of the main attractions, but there is a bus stop 100yards up the hill, which takes about 20 mins, to the termini. But this did mean we were out all day, and only really slept in the hotel, without a chance to go back and change for the evening, but there are plenty of bars and irish pubs to relax in before going for a meal. There is also a small shop just up the hill and to the right (on the same block), to get provisions. The roof terrace has a good command of the area, with views of the dome of St Peters. Would stay there again, as the booking through lastminute was £50 a night, which is a bargain compared to other hotels.", "Date": "January 20, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Rooms": "2", "Service": "1"}, "AuthorLocation": "London", "Title": "“definitely NOT a four star”", "Author": "A TripAdvisor Member", "ReviewID": "UR4074480", "Content": "I booked this for my husbands birthday and we were both disappointed. Most of the reviews I had read complanied about the staff - we are no exception to this. The reception staff in particular were unhelpful and on occasions positively rude and grumpy. The hotel is in severe need of refurbishment - the reception area is about the only part of the hotel that is ok - the room was tired and dated back to the 60's in its decor, small and tight although clean as was the bathroom. The bed was hard and the only positve thing about it was the quiet - we heard no noises as the district is quite a way from the centre although easily accessible by bus or taxi. We were not impressed by breakfast - lots of staff - no service, hard bread every day and hardly any choice - definitely a problem if you have kids. The bar area never opened and the feeling is one of unfriendliness. We would never go back - I am amazed at the star rating. Maps were available but the hotel wasn't on it, questions about getting a bus were answered by \"get the No360\" without saying we had to first obtain tickets from the machine outside the bus-stop. This is a three or two star hotel by average standards.", "Date": "October 31, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Derby", "Title": "“Great Value”", "Author": "A TripAdvisor Member", "ReviewID": "UR3895675", "Content": "Just returned from a 5 day break in Rome having stayed at the Grand Hermitage located in Pirioli (a posh residential area). The hotel was very clean and comfortable, the rooms were great and the service good too, the breakfast was great value for money and the location was very good, a 5 minute walk to the bus stop into Rome, a really great Cafe where all the Italians go for lunch and late night coffee and ice-cream. About a 10 minute walk into Pirioli where there were at least 3 good restaurants all great value for money. We found the hotel great value for money, a great location and would stay there again, having read other reviews of this hotel before we arrived, I think people must remember that in Italy the star rating is so much more different than in other european countries and to get a standard equvivilant to back in the UK you have to go 5 star plus, it's that's simple- I'm afraid that's just Italy!!!!", "Date": "September 12, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "nottingham, england", "Title": "“we loved it”", "Author": "A TripAdvisor Member", "ReviewID": "UR3888418", "Content": "I have just returned from rome, having stayed at the grand hermitage. there were a group of us. we all had lovely rooms, very clean. linen was changed and we had clean towels everyday. the breakfast was excellent value for money. it was easy to access via the 360 bus from the statizone termini. the bus stops at the terminus on the way back which is just a short walk from the hotel. so it's pretty straightforward. bus tickets are 1 euro from any of the little newshops. or you can can get them from the ticket machines. they are great value as you can use them all day on any metro bus at the termini. i was really worried when i had read the reviews as my friend had booked hotel and it didn't sound good. we all said we would definatley go back. it really isnt as bad as some of these reviews make out. i have stayed at far worse and paid alot more in the past!!!", "Date": "September 8, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "2", "Rooms": "2"}, "AuthorLocation": "London", "Title": "“A little tired!”", "Author": "AndyH76", "ReviewID": "UR3677938", "Content": "Most of the reviews read seem to sum the hotel up pretty well. It basically isn't a great hotel but is cheap and it's certainly a case of 'paying for what you get'. We ended up paying about €75 per night (through last minute) which was very good for a quiet location near the centre of Rome. We ended up spending very little time at the hotel but the breakfast was fine (as long as you expect the typical Eurpoean breakfast - i.e. cereal, rolls and juice) with the AC being put to good use Travelling was not too much of an issue as we got a daily travel pass (€4). catching the regular bus was easy and after a 15 min ride arrived at the main tube station - giving us access to all we needed", "Date": "July 18, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "sweden", "Title": "“The Hermitage - a sad story in a nice sourrounding”", "Author": "snyggve", "ReviewID": "UR3640428", "Content": "Staying a week in Rome at the Hermitage was a sad experience! Although situated in a nice and quiet sourrounding - the Parioli district - the hotel didn't seemed such a nice place. The room itself was OK, with a working AC, but a bit untidy and unfresh. The hotel facilities seems to be a sad story - the bar did not serve anybody on the whole week, the cleaning of the room inproper, no changing of the linnen in the whole time, changing of towels only after us remarking the need if it, and the breakfast principally a joke. Unfriendly personel in the breakfastroom did not exactly gave you a warm welcome and a joyful start of a new day. The worst was however the majority of the personnel at the reception, who everytime we went in and out - leaving and fetching our key - seemed disturbed and appeared think guests are a pure disturbance in there work (they managed too seem occupied in very much work all the time - God knows with what.) The older gentleman who was cleaning in the lobby was a nice exception, always smiling and a polite difference to the rest of the very self-important receptionist. We do wonder who they think are their real wage-payers...? Probably a mecenate of their own - apparentely not us guests! In the district we can recommend the resturants Celestine and La Scala in the lower part of Via Parioli. The Rossini at Piazza Ungheria is also a good choice. In both cases; be there before 20.30 to be sure you get a table. Its also a nice area to come \"home\" to after the busy city center, and the air is somewhat better. The Bus 360 is freqent from morning to midnight and a weekly travel card which also covers the underground is only E 16 for seven days. To sum it up - if you can stand the rather sad, dull and unhelpfull personel the hotel can be an alternative. If so, look out for discount prices. Our room was said to be E 200 a night - wich would have been daylight robbery. Our discount price was about E 80/night - and even that is a bit to much in our wiew./MCH", "Date": "July 6, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Hull Yorkshire", "Title": "“We liked it”", "Author": "Thespandlers", "ReviewID": "UR3623058", "Content": "We stayed three nights bed and breakfast and thought it good value. Breakfast was excellent,eat as much as you like with endless supply of juice and coffee.The room was clean and air conditioning worked very well. Bed linen and towels were changed daily.There is an excellent roof garden. The hotel is by no means near the centre of Rome but the no.360 bus runs every 10 minutes and an unlimited travel day ticket is 4 Euros.The management/reception staff were not over friendly but the waiters and room maids were always polite and helpful.", "Date": "June 30, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Liverpool England", "Title": "“4 star what a joke!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3572504", "Content": "Reception staff surly and very unhelpful throughout entire stay. We asked for some basic information on arrival, i.e. map, directions to centre, a hand gesture and a torrent of italian from a member of reception who was fluent in English was the short response before resuming his telephone conversation. Stayed in room No 502A, tiny room, in need of a good clean, bathroom reasonable except for an abundance of mould. Could hear every movement and sound from adjoining room. Bar closed throughout entire stay, when enquiring about a drink we were referred to room minibar. Roof garden a total joke, unlit and a hazard after dusk. Lifts a death trap, got caught in the doors on a number of occasions. Either a long trek or a taxi ride into town. We have travelled extensively and were disgusted by the fact that this hotel could posture as a four star establishment when it does not even merit two stars.", "Date": "June 17, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Rooms": "3", "Service": "3"}, "AuthorLocation": "Finland", "Title": "“i liked it”", "Author": "Vasabor", "ReviewID": "UR3427403", "Content": "I was a bit worried after reading these reviews and so I was pleasantly surprised to find out that the hotel was actually very comfortable. Reception stuff was polite. Rooms were quite small and surely the air conditionig in a bathroom was a bit too loudy but you got used to it. The view from the roof terrace is magnificent. The hotel is far from the center of the city but it was nice to come back to a peaceful hotel. Transportation is not a problem, bus nr 360 goes quite frequently between 5.30-24.00 and most of the time it is not even that crowded. From the bus stop is only 200 m to hotel. The restaurant and the bar aren´t open but there is restaurants and bars in Piazza Ungheria just about 10 minutes walk away. So I recommend this hotel if you are looking for a nice peaceful hotel where to sleep. But if you want something more from a hotel you better look for someplace else. But then again who wants to waste time in a hotel when there is a beautiful city to be seen?", "Date": "April 30, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Dunfermline,Scotland", "Title": "“Not Too bad!”", "Author": "Bryan47", "ReviewID": "UR2782785", "Content": "My Wife and I visited for four nights early October and were pleasantly surprised at the standard of our room although admittedly the decor was tired and needs a refresh but we found it very clean. The reception staff were not overly helpful, short and to the point but we found a lot of that attitude in the city. We were on the seventh floor and had a large roof terrace with nice views, breakfast was pretty plain but as much as you want. The Hotel is far out and you need two buses to get to most places but we found it nice to come back to a quiet hotel after experiencing busy down town Rome during the day.Watch out for pickpockets, we saw one at work on the 64 bus to St Peter's square,apparently this route is particularly bad for them. Luckily once he knew we'd noticed what he was up to he got off at the next stop.Sightseeing highlights for us were St Peters (make sure you go to the top of the dome-stunning views!), the Colisseum, Sistine Chapel and Piazzo Navona(nice restaurants in the square). We would go back to this Hotel but it's a three star not four.", "Date": "October 24, 2004"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Calgary, Alta", "Title": "“Good value for the money”", "Author": "A TripAdvisor Member", "ReviewID": "UR2517057", "Content": "Like the previous reviewer I almost cancelled after reading these reviews, glad I did not. Its not the Ritz, but for what they charge its pretty good. First, its simple to get to. When you arrive in Rome ignore the hustlers trying to sell you Limo service for 70 Euros-I considered it but they lost credibility with me when I asked them to show me this hotel on a map. They claimed it was off the map! Take a bus or train to Termini station(main bus depot) then catch bus 360 Muse(not Zama). Stay on until the end of the line. When you get off there is a picturesque little park with a small bistro selling lattes and gelato. It offers a spectacular view from its outdoor patio. Right out of the park, next right and you are at the hotel. About 4 minute walk. We arrived on a hot August night and the first thing I saw was a decrepit air conditioner on the wall that was obviously unservicable. I was about to storm down to the desk when I noticed a brand new A/C unit above the door, complete with remote. Worked like a charm. The neighbourhood is charming with winding narrow streets and an excllent selection of restaurants.", "Date": "September 7, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Lancashire, UK", "Title": "“Really not as bad as the reviews here”", "Author": "A TripAdvisor Member", "ReviewID": "UR2505357", "Content": "I tried to cancel this hotel following the reviews written here and I could only do so by paying twice as much, so decided to try one night and see. The room was lovely, the beds were comfy, the AC worked (although the mini bar did not). The front desk staff were friendly and very helpful and the roof terrace was blissful. Admittedly, the bar staff were non-existent but we used a local off licence and took our own wine to the roof terrace. We went as 2 couples and all 4 of us were glad we had booked the Hotel.", "Date": "August 31, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Avoid this hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR2332930", "Content": "This place is bad. We went into our room and it looked okay untill we saw a dead roach stuck on the wall, it was downhill from there. The rooms are small; furniture is old and looks dirty. At a 4-star hotel you expect to get your towels and sheets changed daily, not at this hotel. The maid did come for room service but all they did was pick up the towels from the floor and hang them up and make our beds!!! Not once did they change our towels or sheets in the 7 days we stayed there. Our air conditioner did not work, we told the front desk and they came down to \"fix\" it and all they did was turn on the fan and said it was fixed. When we complained they said it was low on gas and that they would fix it after the weekend, Monday, Tuesday came and nothing, I don't believe they ever had any intention of fixing it. Avoid this hotel!!! Another thing, it is not close to all the main sites in Rome. There is a bus stop a block away, but generally I had to wait for the bus for about 10-20 min, then it was another 20-25 min bus ride to Termini Station, where you then take another bus to your final destination…so not very convenient. The hotel itself is bad, not worthy of its 4 star rating; I stayed in hostels with one star rating better than this, where they actually changed your towels everyday.", "Date": "July 29, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Awful Experience in a horrible hotel!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2329923", "Content": "We stayed at the Hotel Hermitage a month ago and were extremely disappointed with the experience. This hotel is definitely not a four star hotel, and I would not classify it as anything above a two star hotel. It is very far from the center of the city, and you have to take not only a bus but the metro to get to any of the major sites. The room was dirty, the bed felt like I was sleeping on a wood board, and the bathroom had moldy tile and smelled awful. We also had small bugs crawling around the bathroom as well. We actually had to move rooms at 2:00 AM on our last night because our air conditioner was not working and it was dumping water all over the floor. (It was also about 90 degrees and very humid.) When we went to the front desk to request a room change, they argued with us for about 10 minutes before agreeing to give us a new room. I would not recommend this hotel to ANYONE and I only wish I had read the other warnings before booking our reservation.", "Date": "July 29, 2004"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Northern, Virginia", "Title": "“Fawlty Towers without the Humor”", "Author": "A TripAdvisor Member", "ReviewID": "UR2301062", "Content": "The Grand Hotel Hermitage in Rome does photograph well--the hotel looks very nice and the rooms look nice, the roof garden is nice; however, the walls are thin. I found that generally the staff was rude, unfriendly, and unhelpful throughout our stay. Maybe they were just overworked in the heat of the summer. For example, when we got to the hotel the AC did not work (the air initially felt cooler); it was very late and we were so exhausted from our flight we waited to get it addressed in the morning. In the morning we asked the manager at the front desk to look into the AC; when we got back in the evening nothing was done. I went down to the desk and asked about it and the manager got the building engineer who told us that the AC was low on gas (I could have told them that). They knew the situation and did nothing; I then politely demanded a new room. With a 4-star rating I was expecting 4-star quality. As another person mentioned the \"double\" bed was in fact two single beds and mattresses pushed together. This would not pass for average in the US, I expect more from a Motel 6. The breakfast buffet was good except for the quality of the juice (very watered down)--better than continental since there was good rolls and sandwich meat and you could get cappuccino. The hotel is not exactly near the city center so you need to get familiar with the 360 bus and its connections. The local neighborhood was quiet and peaceful and you may want to go to the near by shops to buy your water since you will need a lot during the summer. The bus service in Rome is really great so you do not need to take the taxi unless you want to be picked up at the door. Finally, if you ever watched Fawlty Towers then you may have an idea of the management staff--since you are the guest being affected it is not nearly as funny as watching Basil Fawlty. one last thing, I do feel that they do not like the people who book via the internet.", "Date": "July 15, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London, UK", "Title": "“Terrible, never again!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2190483", "Content": "Summary: terrible rooms with paper thin walls (you can hear a quiet conversation in the adjacent rooms). Some rooms are smelly with cockroaches. We arrived to the hotel just after midnight. The scene at the reception counter was simptomatic of our stay: an enraged man banging his fists on the counter, demanding a different room. I thought that this guest was about to have a stroke, and the meek boy behind the counter probably thought the same and gave this man a key to a different room. When the man stomped away and we had a chance to present ourselves in front of the boy, he said that he realised his mistake because he gave the man a key to our room and the hotel is fully booked. So we got the room about which the man complained earlier. Before we went to the room, another guest has arrived at the desk, asking to change the room. This time, the lady said that the room is so smelly, she is affraid she could pass out. The boy said that she already changed the room once, to which she replied that she had to, when cockroaches started crawling all over her as she went to bed. With this introduction we went to see our room. Around 1am, with the only room available at this hotel we did not have much choice. Needless to say, the room did not look like any of the 4 stars we have stayed at previously. Two tiny beds, leaking shower. At least it did not smell and we did not see any roaches. The problems restarted in the morning. At around 6am, a large group of hotel guests was gathering to leave for some organised tour. Although they spoke in hushed tones, I could hear every word, until they left at around 7am. After that the cleaning ladies arrived, who never shut up, so we just go up and went to have breakfast. Since many people were checking out that day, we were given a different room, which on the face of it, looked a lot better than the first. Unfortunately, the quality of the walls was the same, and some nice Japanese ladies in the next room, probably suffering from a jet lag kept talking through the night and did not react to the requests to keep quiet (it was 3am) passed on to them through the reception and my personal request - I also think that the problem was that they could not speak any of the languages I tried with them other than Japanese (which I do not speak) and since they were talking quietly, they probably could not understand what the problem was. At the end, my wife just started banging on the wall with her shoes at around 4.30am and it surprisingly worked. So we got some good sleep for about 2.5 hours, until the cleaning ladies arrived. All in all, a dreadful experience, waste of money and absolutely spoilt weekend in Rome.", "Date": "June 15, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Dreadful”", "Author": "nickanddan", "ReviewID": "UR1853071", "Content": "Stayed at the Hermitage 22/04/04-25/04/04. What a dreadful place, i don't know what sort of standards some of the reviewers are used to, but to say that it is not bad is the biggest understatement of the century. The truth is that the Hermitage would struggle to reach 2* rating in the UK. The staff were ignorant, the decor was in serious need of refurbishment and the room was not very clean. On arriving i ran my finger along the window ledge to reveal it was thick with Black dust!! It was also the nosiest hotel i have ever stayed in. We were awaken on all 3 nights of our stay at around 2AM by Italian residents shouting at the top of their voices as they returned to their rooms and we were disturbed in the day by workmen outside our room re-plastering the ceiling! The breakfast was poor - completely self service, plates were not even cleared and the orange juice was vile. The bar did not seem to be open at any time during our stay and on top of that probably the most annoying fault was the absence of a good supply of hot water, it appeared that the only time the hot water was consistent was in the middle of the night. Those that like a hot shower before breakfast, think again! The only good thing i can say about this hotel is the location, Parioli is a lovely traditional region of Rome, relatively uninhabited by tourists and yet only a 20 minute efficient bus ride to the centre. You will probably need to take a taxi to the hotel from the airport but be aware not to get ripped off like we did, a taxi direct from Leonardo Da Vinci airport to the hotel should cost 50 Euros. Having said that if you prefer the authentic way of travel, it is cheaper to get the train to the Termini station and then take the number 360 bus to Plaza del Muse, the hotel is around the corner from Muse which is where the bus terminates. My advice though is to find another hotel in Parioli. You have been warned!", "Date": "May 2, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Solihull, West Midlands", "Title": "“Not that bad”", "Author": "A TripAdvisor Member", "ReviewID": "UR1687028", "Content": "Having read all the reviews of this hotel I was quite concerned that we had booked this. We found the hotel to be very clean, and rooms were very comfortable, we were on the 8th floor and did not have any problems with sewerage smells, staff not very helpful, would not recommend the restuarant we were sent to by the staff called OLD AND NEW, this was appaling. Having stayed in numerous hotels this was adequate.", "Date": "March 2, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Bedford, England.", "Title": "“long distance travel”", "Author": "A TripAdvisor Member", "ReviewID": "UR1683407", "Content": "Having just returned from the Hermitage in rome the hotel is never 4* 2-3. Rooms are clean but small staff are helpfull but not attentive thier is no tea making facilities no sky in rooms the rooms a a bit noisie in the morning but the biggest disapiontment is its location we booked this hotel on the basis that it was a stones throw from the treve fountain to hit the fountain from the hotel you would need a rocket launcher and probabaly a bus trip Thier is only one bus that goes to the hotel the360 unless you walk to the main junction at pirorli where there is a good selection,", "Date": "February 29, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "UK", "Title": "“Smelly Hotel Hermitage”", "Author": "A TripAdvisor Member", "ReviewID": "UR1658414", "Content": "We stayed at this hotel this weekend for the rugby and had to move rooms at midnight because of the overpowering smell of sewage on the 8th floor! We were then transfered to the smallest room you can imagine. There was no wardrobe and we had to climb over our suitcases to get round the bed. Not very impressed.", "Date": "February 17, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Ayrshire, Scotland", "Title": "“not as bad as the other reviews say”", "Author": "A TripAdvisor Member", "ReviewID": "UR1623706", "Content": "We have just returned from a weeks stay in this hotel and found it to be everything we were looking for. After reading the reviews on this site I tried to change my booking but should not have been put off. The hotel was in a quiet area out of the city, there was a regular bus service into town and we bought a 16euro weekly ticket which does the metro too. The staff in the hotel were always very pleasant and helpful and the rooms were lovely and very clean. There were some lovely restraunts within walking distance which had excellant food at very good prices. All in all we had a great holiday and would definately return to this hotel again.", "Date": "February 1, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Cambridgeshire, England", "Title": "“Never again!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1439095", "Content": "The worst hotel I have ever stayed in, in my entire life. We were a group of 42 pilgrims from the UK and were obviously not welcome, the staff were rude and unhelpful; requests for help or assistance were ignored, messages not passed on. the rooms were small and smelly. I will never stay there again. Rev P Maddison", "Date": "November 6, 2003"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "St. Ives, Cambridgeshire, UK", "Title": "“Pilgrimage”", "Author": "A TripAdvisor Member", "ReviewID": "UR1436015", "Content": "I have stayed in many hotels throughout the UK, Europe and the Middle East & Africa. Without doubt this is the worst of all of them. The food was terrible, the service was non-existent and the management staff were surly and uninterested in anyone or any problems. The rooms were shabby and not at all what was described in the their brochure. A complete disaster.I would suggest that anyone thinking of staying at this hotel to reconsider it and stay somewhere else.John Sayer", "Date": "November 4, 2003"}], "HotelInfo": {"Name": "Grand Hotel Hermitage", "HotelURL": "/ShowUserReviews-g187791-d233378-Reviews-Grand_Hotel_Hermitage-Rome_Lazio.html", "Price": "$67 - $164*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Eugenio Vajna 12-18</span>, <span class=\"locality\"><span property=\"v:postal-code\">00197</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "233378", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/f0/ce/f0ce6406171c75da9bb3c549ce5483a542large.jpg"}}