{"Reviews": [{"Content": "Wonderful Beautiful room, wonderful staff, noisy on the street front but thats Venice, get used to it or wear earplugs!! Breakfast was just ok but we didn't care.Would definately stay again. Thanks Tripadvisor!!", "Date": "Oct 25, 2007", "ReviewID": "UR717847476", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "3"}, "Author": "canuckpump"}, {"Content": "Great Little Hotel This is a great hotel to stay in and is very central to the train/bus station, the river and main tourist attractions.Hotel Collodi is a 10 minute walk from the train/bus station and the directions supplied were very good.The hotel is very clean with spacious bedroom and en-suite. The bed was very comfortable and I must say the standard was very high and just as good as some larger 3 star hotels.The staff were very helpful and took their time with directions and suggestions as to places to eat etc., which were very good.There are plenty of places to eat and drink close to the hotel and a wonderful food market in the mornings, a must to see.The breakfast is typical continential self service, but with plenty of choice.A bit thank you to Hotel Collodi and their staff.", "Date": "Sep 14, 2007", "ReviewID": "UR370770393", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Simms2006"}, {"Content": "Hotel Collodi Charms I stayed at this hotel in June 07. It was a nice little boutique hotel. I had a room on the second floor that felt very safe, was clean and airy and spacious for European hotels. The best parts about the hotel were the wonderful staff, the air conditioning and it's proximity to everything. Around the corner was a fantastic restaurant called Za-Za's with 2 outdoor patios where you could people watch. Down the block was a huge outdoor market where I picked up some gorgeous scarves. It was a 15 min walk across the river and a 10 min walk to the train station. There was an internet cafe right around the corner and the hotel has numerous travel books and brochures that you could borrow to plan your next day's adventures.I went to Florence for the food. One block away is the massive San Lorenzo market where I tasted wonderful vinegars and picked up unique pastas and risottos to bring home. I also went on wonderful food tours with The Accidental Tourist and Florence Walks  Tours. [--][--]The only disappointment was the hotel breakfast. They offered mostly pre-packaged biscuits, buns and coffee from a machine. It was a letdown after the wonderful breakfasts in France. Overall, this is a nice little hotel to act as a home base for your visit to Florence.", "Date": "Jul 7, 2007", "ReviewID": "UR587860543", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "CalgaryFoodie"}, {"Content": "Make your reservation now! We just got back and have to say that one of the best parts about this hotel (and there are Many good parts!) is the manager, Giovanni! This gentleman is helpful, friendly, kind and goes wayyy beyond the call of duty to make sure you will enjoy your stay! The hotel is Very clean and the rooms are nice, Ours was large and like many hotels in europe, the rooms are all different, so if you have special requests, let them be known in an email to the hotel ,well in advance. There is a tiny elevator that is a big help. The location is great and you can walk to so many places from here. Be sure to let them make your museum reservations before you arrive, they will do so at a minimal cost that is well worth it! Go eat lunch at Zaza a restaurant that is only 2 or 3 blocks away and easy to find with their help. Sit in their outdoor dining 'tent' and enjoy! Make time to eat dinner at Ciro and Sons(near the train station) on their honeysuckle vine-filled patio for a wonderful meal, service, and just great people! (and the profiterole dessert is awesome too!)Hotels in the United States can definitely take a few lessons from the management, customer service level, overall hospitality, and cleanliness of Collodi!", "Date": "May 16, 2007", "ReviewID": "UR615745480", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "CupcakeToo"}, {"Content": "Looking For an Hotel to stay in Florence? - Look No Further!       Yes, Pinocchio lives here :))", "Date": "Oct 23, 2006", "ReviewID": "UR654977605", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "emeraldandscarlet"}, {"Content": "Definitely the place to stay when in Florence; Relais Santa Croce Four of us, on a private tour, loved our stay at the Relais Santa Croce. The rooms reign supreme with comfortable beds, huge luxurious bathrooms, flat screen large t.v.s and divine amenities. Everyone of us is going to return there as soon as possible. The decor and comfort of the hotel makes it a 5 star rating and outstanding in every way, along with friendly and caring service! The hotel is new, so the word hasn't gotten around, yet, but I highly recommend this hotel. The location is superb, also.  Returning in March '06  - Edmond, Oklahoma", "Date": "Sep 21, 2005", "ReviewID": "UR219999114", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "El hotel est谩 muy bien situado...   showReview(17602166, 'full');", "Date": "Jun 3, 2008", "ReviewID": "UR908387950", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Premier s茅jour 脿 l'hotel...   showReview(11343752, 'full');", "Date": "Nov 10, 2007", "ReviewID": "UR258306813", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "DE NUESTRO VIAJE A FLORENCIA EN...   showReview(11343753, 'full');", "Date": "Jun 1, 2007", "ReviewID": "UR368399777", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d233492-r10315044-Hotel_Relais-Florence_Tuscany.html", "HotelID": "233492", "Price": "$189"}}