{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“pretty hotel, quiet location, friendly”", "Author": "ken b", "ReviewID": "UR124352170", "Content": "i booked this very pretty looking hotel on the lido part of venice, for myself and partner on our first trip to venice,.the hotel turned out to be great, it looked very nice from the outside, with its beautiful garden. the rooms were comfortable and clean, the staff were friendly, polite and helpful at all times. we slept soundly each night and went down to a nice breakfast each morning. the hotel is situated in a delightful part of the lido, that is about 15 to 20 minute walk from the water bus , that takes you right in to the centre of venice on the grand canal. the walk to and from the hotel to the water bus was very pleasant , passing by some lovely streets and canals. there are nice restaurants and cafes near by, if you want to eat locally. the hotel more than lived up to my expectations, and i would certainly recommend it to family and friends, or to any one that wants a peaceful stay in what is a very nice part of venice. ps.. if you have not been to venice yet, GO' , its an amazing place to visit, i am longing to go back soon.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kiama", "Title": "“Excellent value”", "Author": "Number7Kiama", "ReviewID": "UR121235555", "Content": "Nice comfortable room, we actually had 2 rooms, big bathroom, nice buffet breakfast, lovely little town, 15 min train ride to catch to Venice, nice to come back to after a hectic day in Venice, nice restauraunts and bars, not a touristy town. Excellent value with plenty of free parking.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Beautiful cozy feeling”", "Author": "Aalahazrat", "ReviewID": "UR117906577", "Content": "In a very serene and beautiful part of Lido island. The hotel gives a very cozy feeling and the service and warmth of e staff only adds to the feeling.", "Date": "September 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good value hotel away from the hustle and bustle of the main island”", "Author": "martin8777", "ReviewID": "UR106489167", "Content": "This is the second time my partner and I been to Venice and the second time we've stayed on Lido. If you're unfamiliar with Venice, Lido is a separate island from where the main tourist spots like St Mark's Square are but is easily accessible by Vaporetto. A number of Vaporetto lines terminate at Lido, they are very frequent and there is even a night service running until 4am. Hotels on Lido are generally a lot cheaper than on the main island and will be quieter and less touristy. The Meridiana is a 15 minute or so walk from the Vaporetto stop in a quiet area a short walk from the beach. The shops and cafes in the town centre are a ten minute walk too. We were given the Casanova room (I don't think he stayed there though) which was a nice size with a very comfy bed and a very nice bathroom. Also in the room was a minibar with space to put your own stuff in and a safe. Our room also had a little conservatory with a table and chairs to sit own on which was lockable. The hotel stated they had free wifi when we booked but in reality it was just the first 15 minutes free with the price rising to a whopping â‚¬2 per 15 minutes after that. We only used 5 minutes of the free allowance on my ipod touch but when we tried to log in again later it said we'd used all our free allowance already so presumably it doesn't log you off the wifi despite disconnecting the connection which may be worth bearing in mind for mobile device users. Breakfast wasn't included when we booked and was â‚¬5 per person extra. We paid for breakfast on our first morning but didn't think it was worth the extra cost and went to a local cafe the next morning instead. The hotel breakfast was a fairly standard continental spread with bread, ham, cheese etc but not a great deal of choice and they also only had vending machine coffee which is a deal breaker for us. As we were going to a wedding that weekend, I needed to iron a shirt and expected to just pick up an iron and ironing board from reception like pretty much every hotel I've ever stayed in round the world. Not here though, the receptionist informed us that they don't allow guests to iron their own clothes for safety reasons and that this was common practice for hotels everywhere and they had a laundry service available instead. In fairness, they did iron my shirt very quickly and far better than I ever manage myself at home and it only cost â‚¬4 which is a small price to pay for not having to do housework on holiday. Overall, we were very pleased with our stay especially as we were staying over easter weekend and everywhere else in Venice seemed to be charging a small fortune. The room was very pleasant, quiet and comfortable and the staff were all very helpful. If breakfast is important to you, skip their disappointing offering and head up the road into town where there's a choice of cafes to get a decent espresso and croissant or similar.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“centrally located”", "Author": "gkk207", "ReviewID": "UR82744566", "Content": "the hotel is 10 mins by train from Venice mestre station. the staff is very friendly and the service is reasonable. the rooms are good considering the money put in. dining place is very big and good varieties of food", "Date": "October 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Peterborough", "Title": "“Great hotel for a short break on the Lido”", "Author": "darrenposh", "ReviewID": "UR78637961", "Content": "I booked this trip very late, 48 hours before travelling and at the height of the season in August in Venice and on a budget, beggars couldn't necessarily be choosers. However, we found this hotel to be fine for our needs. Rather than go straight to the hotel on arrival we took dinner first, meaning that by the time we found the hotel is was close to 1am, but the night porter was friendly and efficient, as were the rest of the staff. We chose the Lido because we knew we were going to spend more time on the beach than in Venice itself so was delighted to find that the hotel is literally 30 seconds from the beach. The hotel has access to some of the huts on the private beach but as they are shared, two thirds of them have views of, erm, other beach huts and there is a not insignificant charge for them we chose not to bother. There is nothing to stop you going on to the private beach without paying for the hut and just putting a towel down which is what we did. The private section is relatively deserted compared to the public section about a kilometre away or so. Back to the hotel...there was one problem on arrival where the shower spewed more water up and out of the cubicle rather than in it, but this problem was sorted following a reminder or two. The clean, well maintained room had a minibar, which I guess didn't get used much...as we found that more than half its contents were out of date, some going back to 2007! We left these out with a note and they were replaced without fuss. Breakfast was extra but we didn't bother with it, partly because we weren't always up and about in time but also because we quite like to go to a bar en route to where we are going, and get a real cappuccino and a nice fresh pastry. A great value, no frills hotel in a great location for the beach.", "Date": "September 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Uneven Experience”", "Author": "agentrr", "ReviewID": "UR66661441", "Content": "La Meridiana is located in Lido outside of Venice. Travel to and from Venice is easy but make sure you get the appropriate public transportation card to save money. The area is residential- very relaxing and the beach is very close. The room is large. The breakfast room and grounds are above average.The beaches are more for sunning than swimminng. Everything was ala carte. Unlike most hotels they charges for a continental breakfast, they charge for using their computer and they charge for bicycles(that is if they were working in the first place). The rooms need some renovation. We had issues with the locks and the TV. Tthe plumbing and tile work need upgrading. Our biggest complaint was that we had prebooked an extra day. We had sent an email(got no response) and when we arrived the Director would not make any adjustment. We were very dissapointed.", "Date": "June 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "london", "Title": "“not what we expected”", "Author": "rdclondon", "ReviewID": "UR66427717", "Content": "Firstly let me say that as far as hotels go I am pretty easy to please and often read reviews and wonder what people are complaining about. I wouldn't normally bother to write a review, but as I selected La Meridiana on the good reviews posted and not one poor one amongst them, I wanted to share our experience. La Meridiana seemed to fit the bill, small friendly hotel and not too formal, good price via Last Minute and on the Lido where we wanted to be. The decor was as we expected from previous Italian hotels of this rating, a bit dated but functional. The room was OK for what we paid but maybe the management should consider upgrading the TV channel options for foreign visitors, even if it is only a news channel. The first problem was when we took the spare pillows from the cupboard and realised that the covers had not been changed. Only one glass for the mini bar and the plastic cups were never replaced after the first day. Only small matters I know and easily rectified , but when all added up and it becomes a pain. On our second night it was quite warm and the mosquitos were about with a vengence , so we had to leave the windows closed. As the room temperature crept above 26 degrees we tried to switch on the air conditioning. It would not run and the digital display was telling us that it was held off due to internal temperature.We reported it to reception who promptly came up and pressed a few buttons before telling me that he would go down and reset it lower to allow it to come on. After about 15 mins we hadn't heard any more and it was still not running. At reception there was a different man there who just gave me a replacement door card (dont know why they left it for me to chase it up!). Anyway, guess what, that didn't work either and when I went down again he just shrugged his shoulders and said \"I dont know\" probably didn't care either. It appears that from their central computer they can hold off the A/C by inputting a high minimum room temperature, so we spent the night sweltering. The info on the hotel also makes a big thing about the garden area. Well, the plastic seats and tables in the garden had obviouslybeen left out throughout winter and little or no effort appeared to have been put in to clean them, it all resembled a ramshackle beachside cafe that had not opened for the summer. Things didn't improve on checking out either. I had booked via Last Minute and paid in full. When I checked in they kept the voucher and accompanying info. As I handed my room card back I was told that I hadn't paid and the figure they were asking for was about 35 euros more than what I expected. They were adamant that they had not been paid and as I didn't have the info any more I was on the verge of handing over my credit card. A flash of genius and I asked them if I could use their internet to get the details from my e-mails. They agreed but as the internet did not work I had to ring the UK to ask my son to check for me. The result being that yes I had paid and the amount they had claimed was 35 euros too much. By this time the receptionist had obviously realised and suddenly was apologetic and confirmed I was correct. This may all seem a bit trivial but on a short 3 night stay it all mounts up and takes the shine off your trip. On the good side, it is reasonably priced (assuming you get what you think you are paying for), breakfast was adequate as it was only 5 euros each and the hoteli is near the beach and a pleasant walk to the ferry terminal. Would I come here again, no I dont think so, it wasn't a dive but I am sure there are other similar type of hotels that are better.", "Date": "June 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Quiet little hotel in out of season beach area of Venice”", "Author": "RJTLondon", "ReviewID": "UR62488001", "Content": "Great little find prompted by lastminute.com, on a room only rate. Located on Lido di Venizia area, which is a popular beach area in the Venice lagoon, but very quiet out of season in April. About 10 mins walk through the shopping streets from the ACTV vapo stage (quite a bit further from Alilaguna vapo stage). Or take the local ACTV bus down the beach road. Well appointed room at the top of the building, facing away from the beach (lower rooms have balcony). My tip--Skip the Alilaguna boat from the airport or the ATVO airport bus--ACTV is nearly as quick and cheaper unless you have lots of big luggage. Get an ACTV 12 hour pass at the airport, or a longer term veniceconnected card online (can get tickets delivered at any ACTV ticket machine), take bus ACTV (Orange) 5/5D from airport to Pz Roma, then get vapo 1 or 51 from Pz Roma to Lido. On your last day, reverse the route, stopping to put your luggage in the left luggage at the train station for the last few hours in Venice.", "Date": "April 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Brasilia", "Title": "“Great value”", "Author": "RCOLLOR", "ReviewID": "UR62440990", "Content": "Very friendly personel, free internet wi-fi, good room. Clean. Far from Venice center though and a long walk to the nearest Vaporetto. Located in a very quiet area of the Lido.", "Date": "April 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "NYC", "Title": "“beautiful hotel, at great price”", "Author": "asdfadsf", "ReviewID": "UR59881446", "Content": "clean, large room, with AC and free wireless. beautiful hotel and nice staff. getting to the main islands from Lido took 30-45 minutes... but this was actually a nice touch, taking the ferry like that gives you tons of great views. this was the nicest budget place i stayed at in italy and i'd stay there again.", "Date": "March 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "West Midlands,", "Title": "“Fantastic value and character.”", "Author": "LargeWestMidlands_", "ReviewID": "UR46514024", "Content": "I spent three nights at the Albergo, it was fantastic value for money to the extent I stayed an extra night. The location was fine in that it was a two minute walk to a private beach 10e a day.The Vaporetto station was a fiteen minute walk and a further fifteen minutes to St. Mark's Square.I obtained a three day pass which was good value. Rooms were comfortable and the gardens relaxing for breakfast and a late night drink in preference to the ridiclous prices for a beer in the city-7e virtually everywhere.The local bar was a bonus in selling local beer for 7e per litre which was the best I had in Italy.", "Date": "October 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Kobe, Japan", "Title": "“Surprisingly Very, Very Nice!”", "Author": "kobekeith", "ReviewID": "UR39284810", "Content": "I ended my 5-week trip to Europe here. I had stayed in San Marco for my first 6 nights in Venice and then left for Tuscany and then came back to Venice for my last few nights before flying out of the country. It was a nice change of pace from San Marco area. And the price was less than half of what I had paid across the lagoon. My room had 2 single beds and a big terrace with a table and chairs and lounge chair. I was surprised at how nice it was. I did not expect a nice view and the big balcony was a bonus. The bathroom was small but clean so I had no problems there. The air conditioning worked very well. The breakfast was decent. The staff was very helpful and friendly. There was an elevator! (another bonus for my suitcases) The beach was maybe a 5 minute walk down the street. The water bus was a hike though so keep that in mind. I bought a water bus/ regular bus pass so then I could take the bus from the water bus when I was too lazy to walk. That cut the walking time in half. It was a very quiet street and a relaxing place to stay. San Marco became very hectic after 6 nights. The other 3-star hotels near the water bus stop on LIDO were not nearly as nice as this place and the others had no character like this one does. I checked rooms in 4 hotels before deciding on this one. It was well-worth the longer walk. I liked my hotel in San Marco very much but had I known about this place, I would have saved several hundred dollars and been just as happy. A Fortuni lamp would not have seemed so expensive in addition to hotel bills!!!", "Date": "August 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Texas", "Title": "“The best place I have stayed in Italy, and one of the best in Europe.”", "Author": "Sammie_9", "ReviewID": "UR33394473", "Content": "If you are willing to travel the extra distance from the train station or the airport, this place is well worth the trip. Its quiet charm was a pleasure after a day of sightseeing in Venice, and there is regular boat service from Piazza San Marco to Lido. Excellent restaurants nearby and a good breakfast at a reasonable price. Very welcoming staff.", "Date": "June 28, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Atlanta, Ga.", "Title": "“They won't bend over backwards for you here”", "Author": "starbanter", "ReviewID": "UR30524672", "Content": "The hotel itself is fine; a 30s building with some nice features - incredible terrazzo floors and lovely patio garden. Breakfast was nothing to get excited over- warmed over cornettas, cereal, rolls, the usual melba toast and jam, yogurt (pretty good yogurt). Breakfast isn't until 8am, and if you want coffee before that you will be charged for it. And its from a machine! One push of a button (there was a bar with an espresso machine but nobody operated it). I rented a bicycle from them and had to pay for a half day, even though it was already 4:30 and I only wanted it for an hour. They have an old computer in the lobby area but you will pay extra for that too (5 euro an hour). The other thing we found unsettling was that the gate is locked overnight (we had been told it would remain open). The people on Lido were the most unfriendly of any we encountered in our tour of Italy, and everything on the island is extremely expensive. The beach is also locked up overnight, and covered with tiny cabanas. You cannot even see the water from the road- its like you're shut out. You will feel like a tourist. What is very cool about Lido is that everyone gets around on bikes. But if I go back, I will not stay there, I will pay more to stay on Venice or look around elsewhere.", "Date": "May 22, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Kolkata, India", "Title": "“How to go to La Meridiana from Venice S.L. Rly.station”", "Author": "Dr_B_Maitra", "ReviewID": "UR29921028", "Content": "Come out of the Station and cross the Grand Canal either by the Vaporetto (No. 1) or just walk to your right and you come across a newly built footbridge and reach the other side of the station where you will find a bus terminus. Take either the buses going for Treviso or Venezia (names of these destinations are written on the buses itself). Alight at the Mogliano Veneto stop. (While travelling keep a look on the right side and you can see the hoarding of the Hotel.) The rooms are fabulous compared to the price you pay and breakfast is not that good. The rooms are spacious and airy and bathrooms are a luxury compared to the disastrous european standards.", "Date": "May 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "California", "Title": "“Enjoyed our stay at La Meridiana”", "Author": "cdeame", "ReviewID": "UR23793332", "Content": "We enjoyed the peace & quiet on Lido - it was a nice respite every night after busy Venice. Vaporetto service to Venice was convenient. The hotel rooms, while small (as expected) were clean. Wallpaper a bit dated. It lived up to the expectations created by reading the other reviews, and we would definitely stay there again.", "Date": "January 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Ireland", "Title": "“Pleasant hotel”", "Author": "Kathleen37", "ReviewID": "UR22978440", "Content": "Very pleasant hotel. I got an exceptionally good rate, and although the room was furnished with not the best standard of furniture (old and quite battered) the room was very, very clean, which is paramount. Staff very pleasant, and nice outside space. I like the Lido and if you want the beach, then you are only a 3 min walk away. Getting to Venice proper is no problem, 3 stops on the bus, or a pleasant 10 min walk to the vap stop. I would stay here again.", "Date": "December 24, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Ontario, Canada", "Title": "“Charming garden and good location.”", "Author": "Nana888", "ReviewID": "UR17812039", "Content": "My husband and I stayed 6 nights at Albergo La Meridiana on the Lido in Venice. On the positive side, the hotel was conveniently located only a few minutes walk from the beach and it was within a short walk to a little convenience store and the vaporetto stop. The common areas of the hotel were nice, and the outdoor area/garden was beautiful, making it a very charming setting for breakfast in the morning. On the not-so-bright side, the breakfast itself was not good (watered-down orange drink as \"juice,\" and a self-serve automated coffee machine that didn't function properly during our entire stay.) Our room was reasonably clean and very well air-conditioned, but it had carpet, which is in my opinion inappropriate for such a damp, humid place as Venice (we noticed a moldy smell in our room). Overall, it was a great location and had a charming outdoor set-up, but the room itself wasn't impressive, and we went to the nearby cafe on the beach for good cappucino and pastries for breakfast. The Lido area itself was great; beautiful beaches and a relaxed, quiet atmosphere, with easy access to Piazza San Marco in Venice.", "Date": "July 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“Great little hotel”", "Author": "LivLondon", "ReviewID": "UR15710689", "Content": "Nice surprise! The hotel is located on Lido Island (where Venice film festival is held) and was a nice hotel, our room was pretty large, two single beds plus couch (own large bathroom). Breakfast was standard Italian breakfast, it did have warm croissants though, which were fresh and amazing! Staff were always helpful and hotel was clean. Was a bit noisy during the night though. Hotel is about a 10-15min walk to the vaporetta's, but there are buses that also make the trip.", "Date": "May 6, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Restful experience”", "Author": "judithO", "ReviewID": "UR10585409", "Content": "I stayed two nights in October and everything was fine. Much cheaper than staying in Venice itself but easily accessible by vaporetta. From the airport it costs 12 Euros to go by alilaguna. A 5 minute walk from the airport to the port and then about 20 minutes walk from the Lido pier. There are buses but I found the distance quite walkable. It is worth buying a pass for a day or more to get around. The hotel itself is clean, comfortable and the room is large for a European room. There is an elevator. Breakfast was buffet style. Staff helpful. I would recommend this hotel to other travellers.", "Date": "November 4, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“Nice Hotel”", "Author": "Bo C", "ReviewID": "UR10208786", "Content": "We spent two nights at this hotel and overall, we were very pleased. The hotel is on Lido Island and we used the waterbusses to get to and from Venice. The hotel ground is nicely landscaped; staff speaks good English and is very helpful. Our room is roomy and clean. However, there was no shower curtain in the shower, no Internet access in the room and the TV was very small. Breakfast was great though. When we left the room to go to Venice, I left my laptop with the front desk and they did a great job of keeping our stuff for us. For the price we paid, we were happy with the accommodation and would consider staying there again.", "Date": "October 21, 2007"}], "HotelInfo": {"Name": "Albergo La Meridiana", "HotelURL": "/ShowUserReviews-g187870-d233893-Reviews-Albergo_La_Meridiana-Venice_Veneto.html", "Price": "$87 - $198*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Lepanto 45</span>, <span class=\"locality\"><span property=\"v:postal-code\">30126</span> <span property=\"v:locality\">Venice</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "233893", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/32/1c/c2/entrata.jpg"}}