{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“Best Location and Decoration !”", "Author": "PaspawisaJ", "ReviewID": "UR127719305", "Content": "Its location is not far from the express boat pier, perfect for walking if you have old people in your trip. In the morning you will hear the bell ring from the church which located nearby. there is a little canal in front of the hotel ( better than the grand canal if you dont like loud noise from the speed boat and etc.) The decoration is better than i had expected ... It looks more expensive than the money we have paid ... Everything was clean and staff was very helpful .. Thump up for Antico Doge", "Date": "April 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“The beautiful Antico Doge”", "Author": "Rita A", "ReviewID": "UR126059910", "Content": "Antico doge is a beautiful, really well located (5 min from Rialto bridge, 15 min from San Marco and with a vapporetto stop close) and very clean hotel. The staff is helpful and the breakfast complete and served in a lovely room. The decoration is tradicional and both the inside and outside of the hotel are clean and well preserved. The street in front of the hotel is busy during the day but not to much at night and there are good bakeries and ice cream shops in the surroundings. Perfecto!", "Date": "March 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Staffordshire", "Title": "“Perfect for the discerning traveller”", "Author": "sandiebstaffordshire", "ReviewID": "UR125339616", "Content": "This is a small but excellently run hotel in the Cannareggio region of Venice, just a ten minute walk from Rialto Bridge and around the corner from bars and restaurants in Strada Nuova. It is situated by a quaint bridge and on a landing stage for water taxies and gondolas. The hotel is decorated in a typical old Venetian style. We stayed in a superior double (the green room pictured on the hotel's site), overlooking the old bridge and the square and I can imagine that in the high season it could be noisy. It was decorated to a high standard and linen was changed every two days and fresh towels daily. As is usual in Europe there were no coffee/tea making facilities but we had no problem with our travel kettle. Breakfast was served from 8.00 till 10.00 and the breakfast room is rather small with mainly tables for 2 as the hotel is not really suitable for children. The breakfast had, as is usual in Europe, a limited choice of cereals, fresh and tinned fruit, yogurts, cheese, meat, a selection of rolls and cake, fruit juice and an excellent coffee machine giving unlimited coffee of varying types. It had a hot water facility if tea was required. The staff were professional, efficient and friendly. A bijou hotel, convenient for all areas of Venice and perfect for the discerning traveller.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chateaugiron, France", "Title": "“Nice place, getting old, and very expensive”", "Author": "Michel G", "ReviewID": "UR124948262", "Content": "Styaed there during the Carnival, but 280â‚¬/night is far too expensive, even at that time of the year. Our room was OK for a family of 3, although the extra bed was really tiny. Place is really over heated though.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "New Jersey", "Title": "“A great boutique hotel!”", "Author": "TravelWiz43", "ReviewID": "UR122410504", "Content": "Charming boutique hotel. It is a three star hotel so don't expect room service or things like that. The hotel is located in walking distance to all the significant landmarks of Venice. Room we had was very nicely decorated with good style. Breakfast wasn't bad. I would certainly stay there again.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "La Roquette-sur-Siagne, France", "Title": "“Great hotel in great location!”", "Author": "SuzieMcE", "ReviewID": "UR121803562", "Content": "We stayed in this hotel with our two young children for 3 nights. The hotel is perfectly located for exploring Venice with Rialto bridge a few minutes walk away and the water bus stop very close by. The room we had slept 4 and was spacious and luxuriously decorated. Bathroom was lovely and clean too! Reception were always very nice. Only downsides was the breakfast was quite limited in choice but still fresh for what was there. Would not hesitate to recommend this hotel!", "Date": "December 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Travel companion was terrible but the room made up for it!”", "Author": "36countries", "ReviewID": "UR121281788", "Content": "This is a very unique hotel in an ideal location. Small, private and full of character...we stayed in a \"superior deluxe\" room which had a tall ceiling, the bed in the mezzanine and a pull out sofa and desk. The furnishings and decor were not fresh and new...but fit well with the style and location - a sort of suedo-renaissance look with jacquard tapestry and flecks of gold. It felt like being in past it's prime palazzo which is exactly what it was! And with it's lovely location in front of a small canal and curved bridge, it really was romantic and fun. the breakfast is average but who cares? The dining room was a gilt masterpiece and the staff was lovely. We visited with friends staying closer to San Marco and their room was half the size and nearly twice the price. Go for it...you won't be disappointed. I love trying out new places but if I go to Venice again, I'll stay here. It ticked all the boxes and really did transport me in time.", "Date": "December 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kenilworth, England, United Kingdom", "Title": "“Excellent Hotel, superb location”", "Author": "Justin M", "ReviewID": "UR119909827", "Content": "We were looking for a good quality hotel, with a luxury interior and good location for our honeymoon. This hotel was exactly what we wanted. Staff were extremely friendly, superb location with everything within 10 mins walk. The room was very well equiped, bit querky with quality fittings. The breakfast was fine, not brillant but set us up for the day. 10/10 We had a 'Superior DeLuxe' room which was split level.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "thessaloniki", "Title": "“a very charming,romantic,so Venice hotel!”", "Author": "ThessalonikiMaria", "ReviewID": "UR119561394", "Content": "At first it is very easy to find it ,very close to San Marco and all the major attractions in Venice.The vaporeto station is less than 5 minitues walk from it.Very helpful staff,the room is big considering that most of the hotel there have very small rooms,the bathroom was also super,the furnitures were all antiques,we felt like we were living in the Venice of the 18 century,a very warm hotel with great breakfast in a fantastic room.There was no elevator but it was no problem as the whole atmosphear of the hotel was amazing.If I'll visit Venice again I'll definately choose to stay to Antico Dodge. As for the price it was a little more than other hotels in other countries but I believe in Venice all the hotels more or less are a little more expensive,it surely worth it!", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Very pleased with our stay”", "Author": "LondonWilbur", "ReviewID": "UR118932292", "Content": "Recently stayed for three nights. Very clean rooms with tasteful decor. Staff were professional and friendly - we arrived very late in the evening and were still made to feel welcome and it wasn't a problem. Staff always helped us with our directions, questions etc. Rooms were quiet. For us the hotel was well located and everything we needed for a very pleasant trip to Venice.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Great hotel if you're not on a budget”", "Author": "Tabaki2010", "ReviewID": "UR118689342", "Content": "Hotel is located inside beautyful medieval palace and is maintained well. Hotel interiors are just magnificent. You feel yourself like a doge in his palace. Breakfasts are tasty and quite varied. The staff is very friendly and helpful. Hotel location is well balanced between being close to San Marco Sq. and Rialto and being far from the crowds. There are plenty of restaurants and shops nearby. Vaporetto stop is few minutes far. The only disadvantage is that the hotel is slightly overpriced which is common in Venice however.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“True Venetian Experience!”", "Author": "CraigAndSam", "ReviewID": "UR118335170", "Content": "Great hotel with loads of Venetian charm! The hotel is beautifully decorated and has a lovely homely feel. The room was incredibly clean and tidy and very comfortable. Staff were polite and helpful. As soon as we arrived we were taken to our room and when we left we were able to leave our belongings at the hotel while we continued to explore the city. The hotel is less than 5 minutes from the Rialto Bridge. There is a canal directly outside the hotel with gondolas and the works right outside in a lovely setting. There are some restaurants and shops very nearby. The breakfast is basic - cereal, croissants, breads and meat etc, juice and teas and coffees - but to be honest, it is plenty good enough! All in all, this hotel is in a perfect location to explore the city - you could not ask for a better location really! The only reason we did not score this a 5 out of 5 was due to two little random things that may not happen to anyone else. Firstly when we went down to breakfast, there were no tables and we had to wait until someone else left which left us feeling a little awkward hanging around! In fairness, as soon as a table became available the lady working in the breakfast room could not have been more helpful in clearing the table and making us feel at home. Secondly, the first night the TV randomly turned on at 5am! We turned it off and it turned itself back on a little while later (just as we were nodding off to sleep again!). Problem solved by pulling TV plug out of the socket to ensure it didn't happen again, but nonetheless annoying. Despite these little things, this was one of the best trips ever. Lovely hotel, excellent location in a beautiful city with loads to explore!", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Manchester", "Title": "“A wonderful stay”", "Author": "SmilingHappyFamilies", "ReviewID": "UR117821472", "Content": "Sumptuous, cosy, clean, good location. Stayed during our honeymoon in 2005 and would go back tomorrow! Highly recommended.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Appleton, Wisconsin", "Title": "“Pleasant One Night Stay”", "Author": "JudgeDon", "ReviewID": "UR116498628", "Content": "My wife, our 2 adult daughters, and I stayed here for only one night but it was very pleasant. We had enough room for the four of us. The beds were decent and the breakfast was good. The staff was very accomadating as we left our luggage with the desk on the day we left so as to complete our visit. Good restaurants nearby and we had no trouble finding the hotel. Just look at a map before arriving. Very close to sites and water bus which was economical with an advance ticket purchased on line. Save some money with Nozio when reserving on line. Good value overrall.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Gibraltar", "Title": "“Best hotel in Venice”", "Author": "GCas", "ReviewID": "UR116222184", "Content": "Situated in the middle of the city with easy access to Rialto and San Marco. Lovely quaint hotel with traditional Venetian feel. Good size room, clean and well equipped. My two teenagers loved having a their room in the mezzanine. The hotel staff are friendly and helpful and it is especially nice to be greeted each morning at breakfast with your choice of coffee by Lenedora.", "Date": "August 3, 2011"}, {"Ratings": {"Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "NYC, USA", "Title": "“Worst place I've stayed in Italy”", "Author": "Ness219", "ReviewID": "UR115715663", "Content": "If you don't mind feeling like you're sleeping in a noisy alley, this is the place for you. I personally have never experienced such horrible accomodations. There's not a moment of peace or relaxation in this place and the noise level is irritating enough to ruin what's left of my vacation. I asked for a change of room, but was told there were none free. There's also no elevator and I had to drag my suitcase up a lot of stairs, both to get to the entrance of the hotel, and also to my room. There was no bell hop when I arrived and there were a bunch of suitcases around the entryway that were apparently left by other travellers who didn't want to wait for the bell hop to show up. I am giving this place 1 star, because it seems clean, though it's difficult to tell with the really dim lighting. I'm very sorry I came here and can't wait to leave tomorrow.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“Perfect Location”", "Author": "Nader-Sherry", "ReviewID": "UR115273788", "Content": "The hotel location was very good, breakfast was nice with a pleasent lady serving us, receptionist cooperative and helped book water taxi, the air conditioner in our room was not really good, but the room was clean and the bathrooms were also clean. The location was perfect.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "san francisco", "Title": "“exceptional location, room and staff”", "Author": "masaru_mayumi", "ReviewID": "UR114769533", "Content": "Our family of four stayed in the Suite Falier at the Hotel Antico Doge for four nights. Room 102 has a very interesting historical background and elegant ambience with high ceilings and period furniture. There is also a modest, yet special balcony overlooking the small canal in front of the hotel. From the room, we awoke each morning to see locals beginning their day on the Campo Santi Apostoli. Below, workers unloaded produce and wine from their boats and couples glided past on morning gondola rides. The church bells ringing in the nearby bell tower were calming. The continental breakfast was served in a very lovely room and we looked forward each morning to those relaxing moments, knowing that the day ahead would often be filled with much touring and shopping. At the end of a full day, the jet tub was definitely a welcome respite after all of the walking we did while we were in Venezia! Hotel Antico Doge is about a five minute walk to Ponte Rialto but it is also in a location that allowed us to explore some of the quieter streets and alleys of Venezia. A short stroll will get you to the S. Sofia traghetto crossing (by gondola- 0.50 Euro) of the Grand Canal which lets you off at the Mercato di Rialto. Just a few steps further is the Ca' d'Oro vaporetto stop. Piazza San Marco is a pleasant 15 minute walk from the Hotel Antico Doge. Both Manuela and Sara at the reception desk did fantastic jobs of graciously helping us with our dinner reservations, rebooking tours and scheduling a \"last minute\" water taxi ride on a very rainy day to Piazzale Roma and our rental car parked at the San Marco garage. Get off at the Ca' d'Oro vaporetto stop to access the Hotel Antico Doge and you will avoid carrying your luggage over the many small bridges leading from the Ponte Rialto stop to the hotel. We reserved and prepaid for the Suite Falier over 6 months prior to our visit and this turned out to be one of the best decisions we made for our three week vacation to Italy!", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "", "Title": "“Security”", "Author": "Gioia011", "ReviewID": "UR113689707", "Content": "We have travelled extensively and have NEVER encountered such a breech of safety ! Spent 4 nights at this hotel. After the first night we went touring from 10am to 2pm, during that time all of our luggage including contents of THE SAFE were removed without permission or advance notice to another room ! Jewelry, cash and passports were left in an envelope on the desk. I was APPALLED at this procedure given the fact that we still had 3 more nights at the hotel and we also had booked a 2nd room for family members to join us for 2 nights. ! Most unsettling would never reccomend this hotel if you value the safety of your valuable posessions !!", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Salzburg, Austria", "Title": "“An absolute winner!”", "Author": "Skarlett123", "ReviewID": "UR113497703", "Content": "What a gem of a place hotel Antico Doge is. It starts with the staff, who are some of the most pleasant, welcoming and helpful staff we have met in Italy. We were very happy with our room, which looked out on to the bridge crossing the canal outside. We were not interrupted by outside noise at all. The room was very quiet and the air-conditioning lovely. The location is great as you can arrive by water taxi at the Ca D'Oro landing and walk up the street, no more than 10 minutes. Lots of restaurants in both directions. We could easily orient ourselves in the city where getting lost is easy, as the hotel is not that far from the Rialto Bridge, and many local signs point to the Rialto bridge. Breakfast on par with a typical European breakfast. The brekkie room a but small so in busy times you might wait a little. We found a supermarket in the area which helped us to purchase snacks. Yes, we would recommend this place indeed. We thank the staff for their welcoming demeanor which always sends out a good vibe for a hotel. Wifi access is not free but once purchased you can access devices in your room.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location and superb room”", "Author": "AlliR101", "ReviewID": "UR107937606", "Content": "We stayed for 3 nights in room 107. It was small but comfortable and very clean. Our 'double' bed was two single beds pushed together, and it was little annoying to have the two beds separate during the night, but that was a minor complaint. It overlooked a court yard and while sometimes youngsters played football in the courtyard during the day/early evening, it was quiet and peaceful at night so we slept well. The staff were friendly and very accommodating. Breakfast was sufficient with a good variety of different foods on offer. The location and decor of the hotel were what made it so special. Being in the heart of Venice was magical and made the trip unforgettable! It was easy to get from the airport to the hotel with our luggage. I would happily stay here again and would recommend it to everyone. It's great value for money!", "Date": "May 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Attrractive rooms, great location but very noisy”", "Author": "katliv", "ReviewID": "UR104927760", "Content": "The rooms are well-appointed, good location, and gracious staff at Antico Doge make the hotel appealing. The breakfast (included in the price) is offered in a pleasant room. However, the noise from the street and foot traffic on the bridge made it almost impossible to sleep. If you plan a stay at Antico Doge, just don't request a room overlooking the bridge or canal.", "Date": "April 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“wonderful find in the heart of Venice”", "Author": "carstef", "ReviewID": "UR98176542", "Content": "We had an amazing time, huge room, spa bath. Very Quiet, we had a rear room. The staff were really helpful and polite, suggested places to eat, drink and even organised tickets for us. We actually met up with 2 sets of friend and they also were very happy with location and rooms. We had breakfast included and it was a nice start to the day, thanks to the dining room staff who were nice and friendly. I would recommend it and stay next time.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great location, nice rooms”", "Author": "P-tosh", "ReviewID": "UR90167034", "Content": "The hotel's really nice. It was easy to find and had a great location. Five minutes from the Rialto bridge and 10 from St Mark's. Our room was large, clean and nice. The bathroom was also large and clean. Breakfast area was also nice with a good buffet. The price for the room was great. We, however, went at the wrong time to Venice -- it was cold, rainy and flooded. And that put a damper on the experience. Not the hotel's fault though. The staff was generally helpful and nice, but we were annoyed that the only option they suggested for us to get to the airport was a private water taxi. That's 125 euros and there are a lot of other options. The water bus is as quick and costs just 15 euros/person but the person at the reception had no interest in helping us figure that out. They did not have a schedule at the desk either. Maybe they are used to folks who don't mind spending that much on a water taxi. Figuring it out took away an hour of our time on our last night in Venice.", "Date": "December 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Springfield, Missouri", "Title": "“Beautiful room with a canal view”", "Author": "Shay4954", "ReviewID": "UR86575639", "Content": "Elegant room, very large with a canal view. Beautiful breakfast room and common areas. Convenient location but away from the the frantic pace of St Mark's. We got onto the gondolier ride just outside the hotel entrance. Helpful and professional staff.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Avoid the \"free trip to Murano\"”", "Author": "MsElaineyS", "ReviewID": "UR85792601", "Content": "Lovely, elegant hotel in convenient yet quiet location, but do not take them up on their offer of a free water taxi trip to Murano. We were taken directly to a glass factory on Murano; watched a demonstration; taken to the showroom and sold very expensive glassware that hasn't arrived 7 weeks later. We were then taken directly back to the hotel. No opportunity to see the rest of Murano. I am sure the hotel received a very substantial kick-back from our sale.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "highland park, il", "Title": "“Great neighborhood away from touristy Saint Marco”", "Author": "nachalgirl", "ReviewID": "UR85514567", "Content": "This was our sixth trip to Venice. We like to stay in neighborhoods where there are residents. This was a nice one. The hotel is nice, clean, and comfortable. Breakfast buffet was very good. The concierge was helpful. They could use better reading lights next to the beds.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hallandale, Florida", "Title": "“Wonderful place to stay in Venice”", "Author": "tvlnut", "ReviewID": "UR80970786", "Content": "I traveled to Venice this summer with my sister and elderly mother. The location of the Antico Doge was perfect for us as it is in the heart of Venice and we were able to walk everywhere. When my mother was tired it was easy to take the vaporetto to the Ca D'Oro stop as the hotel is just a few short blocks from the stop. The hotel itself is lovely, an old palazzo decorated in typical Venetian style. The rooms are large and spotless; the bathroom was modern, with a jacuzzi tub; and the breakfast was typical with cheeses, yogurt, cereals, cakes etc. I would definitely recommend this hotel to anyone and plan on staying here again the next time I'm in Venice.", "Date": "September 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ljubljana", "Title": "“Great hotel”", "Author": "LjubljanaTurist", "ReviewID": "UR77008792", "Content": "I have just left Venice and Antico Doge hotel.Hotel has TOP location just few minutes walking to main atractions and shoping streets (for some).Stuff is extremly friendly (the man took all our bags to the room and out afrer check out).Room was triple with a big double bed and a normal third bed,bathroom was big and clean with nice shower cabin.We had room to the street and with closed windows there was no sound coming in,so we have slept as baby.Brekfast is usual hotel brekfast,with yogurts, jams, honey, ham and cheese,bread,milk,.....nothing special but good. It is top 3 star hotel on top location and I would go there again.", "Date": "August 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Alton, Illinois", "Title": "“perfect location and absolutely lovely hotel!”", "Author": "julie h", "ReviewID": "UR76571564", "Content": "we had a room for 4 and were upgraded to a balcony room which overlooked the canal. There was a gorgeous 4 poster canopy bed and 2 single beds for our two children. A/C was great in the hotel! Breakfast was perfect - European style with pastries, breads, meats, cheeses, juice and coffee. This hotel was super clean and super gorgeous and very Italian. The location was just perfect and close to lots of shopping and restaurants. St. Marks Sq was a bit of a little walk but mostly because we kept getting lost! Venice was very hard to navigate even with a map so this was not the hotel's fault! The staff was super nice also. Wifi was available for a small fee and worked perfectly.", "Date": "August 23, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sydney, Australia", "Title": "“Cute and Cozy”", "Author": "Bella2105", "ReviewID": "UR72129536", "Content": "Good location, comfortable rooms, great service and the breakfast was great. We had a split level room as we had four people staying, which was a bit odd. But overall a lovely hotel. I would also recomend the juice bar around the corner, best drinks in Italy!", "Date": "July 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "austin", "Title": "“Elegant entry, wonderful service”", "Author": "cruzanheart", "ReviewID": "UR65009644", "Content": "We arrived from the airport so had to make our way to the hotel from the Rialto Bridge. We arrived at the spot quickly and stood looking around, finally spotting the name on a gold plaque on the wall of a building. We were THERE! Coming from the Ca D'oro stop, there is a large crimson awning with the hotel name, but from Rialto it's not so obvious. The wide marble entry is bright and welcoming. Desk personnel were very helpful with restaurant recommendations, train schedule print outs at all hours. The breakfast is a terrific buffet with table service for coffee, cappucinno, fresh linens, heavy silverware. Our room was quiet and comfortable with a view onto a nothing to write home about courtyard but some, for the same price, have views over the canal with gondolas awaiting passengers. We liked being a bit away from all the thicker crowds at Rialto and St Mark's, but it was really a short walk to either. CaD'oro traghetti stop is just around the corner and is a great .50Euro ride over to the other side of the Grand Canal and market.", "Date": "May 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“A wonderful stay in a very special place.”", "Author": "UKRAINEKIWI", "ReviewID": "UR63079621", "Content": "My husband and I initially booked into a hotel around the corner (sister hotel of Antico Doge) but because of works they relocated us to the Antico Doge. Well, I think we hit the jackpot! The Antico Doge hotel is immaculate, a gorgeous, sumptuous boutique hotel with a feeling of yesteryear. Our room had fabric dusky pink wall coverings, the bed was so comfortable, and the bathroom spotless. Breakfast was a very generous affair with pastries, cereal, bread, ham, cheese, yoghurt, juice and freshly made strong coffee. Even the breakfast room was gorgeous with it's chandelier and again fabric wallpaper in soft pastels. The hotel is in a perfect location - so central and yet hidden away from the crowds. We would thoroughly recommend this hotel.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Loughborough, United Kingdom", "Title": "“Perfection!!!”", "Author": "Shopaholic2010", "ReviewID": "UR61362645", "Content": "This was our 2nd trip to Venice and now looking forward to going back next year with the children to stay at thismost beautiful quaint hotel. Our room was stunning, location excellent....easy access from water bus with luggage, centrally located for St Marks Square, Rialto Bridge, restaurants, LV Shop. Staff, breakfast , cleanliness of room was all excellent! Looking forward to our next visit.", "Date": "April 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florence, Italy", "Title": "“Perfect in every way!”", "Author": "LJC33", "ReviewID": "UR55241875", "Content": "We stayed here for 3 nights between Christmas and New Year and our stay couldn't have been better! The staff were very friendly and helpful and made our stay very comfortable. We were upgraded to a superior room upon arrival, even though the Hotel seemed pretty full. Our very beautifully furnished room faced the busy square and small canal and while fairly noisy didn't stop us from sleeping. The building is very pretty, room clean and full buffet style breakfast a nice welcome from the frugal affairs usually served in Italy. The hotel is perfectly situated behind the Rialto bridge and only a 10 minute walk to St Mark's square. I would definitely recommend Antiaca Doge and have no hesitation in returning here.", "Date": "February 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Auch, France", "Title": "“Thinking of Returning”", "Author": "OldVespaBabe", "ReviewID": "UR55044678", "Content": "Great location. Lovely, comfortable rooms albeit a bit warm. Impeccable client service: from removing the plug from the jacuzzi tub (ooh la la!), to making reservations for the Doge Secret Tour, to giving directions, suggesting and making decent restaurant reservations (at which we were warmly received), providing free transportation option to Murano or the casino and, most importantly, patiently and diligently attempting to help out with a merchant problem AFTER we had returned to our home country. I was seriously impressed with their efforts considering they'd seen us off and couldn't be sure we'd ever return. For purposes of comparison (and indecision), we chose to stay at two different hotels in two different sesstiere during this particular visit. We had no regrets with either choice. The Antico Doge is a lovely hotel in a convenient, central, quiet location with great staff and their having jacuzzi tubs is the cherry on the dessert! No bar, lounge or restaurant other than the breakfast room, however it's absolutely regal. A super comfortable and well appointed room, good housekeeping, a decent breakfast, great location and helpful front desk staff...for their competitive rates it's not worth knocking yourself out looking for something 'better.' Thank you Sara and all your colleagues for a wonderful stay--see, we haven't forgotten you! We want to come back. A note for coffee lovers: DO NOT TAKE THE COFFEE AMERICAN. Ask for a cappuccino and just add sugar if you have to; it will more closely resemble COFFEE!", "Date": "February 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Perfect Venetian Value”", "Author": "IrisMB", "ReviewID": "UR50696339", "Content": "This hotel is beautiful. We stayed for 3 nights (72 euro per night) and were completely happy. We had a standard double room (114) which was quite large with elaborate Venetian decor. The bathroom was wonderful - large with a great shower. Our room had a small, ivy covered balcony overlooking a narrow lane (there are no shops or anything in it so it was very quiet). The location was within easy walking distance to the Rialto Bridge, St Mark's and the ghetto. It's about 15 minutes walk from the train station. The staff were delightful and very helpful. The hotel is non smoking. There is no lift but it's not a huge hotel so the stairs aren't a problem (there are staff to help with bags if necessary). Wi-fi is available but you will have to pay for it. Breakfast is available for 10 euro per person.", "Date": "December 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "oban", "Title": "“wonderful small hotel in a perfect location for seeing Venice”", "Author": "cruachanOban", "ReviewID": "UR50494162", "Content": "The Antico Doge is a lovely small hotel situated within easy distance of both St Marks Square and the Rialto Bridge, and unusually for Venice very easy to navigate to and from. The rooms are beautifully decorated and spotlessly clean, breakfast is really continental, coffee and cakes but they are good. One thing I would say is that our room was possibly the noisiest room I have ever stayed in, but it was a small price to pay for such a superb location and such friendly and helpful staff. Venice is expensive at the moment but when you wander the streets you appreciate that someone has to pay for the restoration and preservation of one of the most beautiful cities on earth.", "Date": "December 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“An Excellent Well Located Hotel”", "Author": "Dazc459", "ReviewID": "UR50347311", "Content": "I visited the hotel in November 2009, as a holiday for my partner's birthday. The hotel looked nice in the brochure, and we were not disappointed. The hotel is small, very well fitted in a typical Venetian style, and well placed fot the main tourist attractions whilst being in a very quiet location. Would highly recommend this hotel.", "Date": "November 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "atlanta", "Title": "“Romantic introduction to Venice”", "Author": "fkmAtlanta", "ReviewID": "UR48186074", "Content": "We loved our introduction to Venice -- we had a lovely rose-and-gilt room overlooking a side canal and the Apostoli Square. We felt truly \"Venetian\" as we watched the gondolas pass under our window. This hotel is tucked away from the larger hotels and crowds of the San Marco Square area, yet it is easy to walk to any place of interest and is close to a vaporetto stop should you tire. You won't feel like such a tourist, even though you can luxuriate in an air-conditioned room!", "Date": "October 31, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Berwickshire", "Title": "“very disappointed”", "Author": "Lily49Berwickshire", "ReviewID": "UR47564699", "Content": "After reading the reviews on he hotel we booked one night in the Falier suite which looked lovely. The staff were fine but the room was so dark there was not enough light and if you turned the lovely chandelier on the lighting was worse as there were only about 3 bulbs in it. We were kept awake all night as the taxi boats work all nights and had to stop outside the window to let people get off. The breakfast was very poor and we could none of us drink the coffee. All in all a very big disappointment. They could also do with a lounge area or at least somewhere for people to sit.", "Date": "October 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Elegant style, amazing staf service and good location”", "Author": "TorontoOntario1", "ReviewID": "UR47102796", "Content": "It is very easy to reach this delightful hotel by water bus or water taxi. The hotel itself retains all of the elegance of its historical past, with marble floors, and gleaming fixtures everywhere. But the piece that takes your breath away is the Murano chandelier over your bed. Really good breakfast service, good offering and well staffed. The staff Sara and Massimo were always ready to service - with ideas for restaurants and tours, arranging water taxis, etc.", "Date": "October 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Great location, sumptuous room - average breakfast.”", "Author": "IronMaidenYorkshire", "ReviewID": "UR46657204", "Content": "Stayed 2 nights in a fantastic room with air conditioning. Easy access to venice. Good local restaurants nearby. Shame the breakfast was average. Could do with nice lounge area. Helpfull staff.", "Date": "October 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Colorado", "Title": "“Beautiful hotel in the heart of a beautiful city”", "Author": "Jillsa2", "ReviewID": "UR46333520", "Content": "This was a great hotel with a great ambiance that definitely added to the atmosphere of visiting such a magical and unique city. Our room was great, and decorated beautifully. We had a four-person room with an upstairs loft and everything worked out great.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "lebanon", "Title": "“a very comfortable place and stay... the staff is very kind and herlpful...”", "Author": "pa2-44", "ReviewID": "UR39812589", "Content": "we spend 2 nights and everything was wonderful... rooms are very clean and the staff is very kind and helpful, especially Sara and we want to thank her very much. the hotel is very well located, about 10mn walk from Piazza San Marco and it's very comfortable and quiet. you will enjoy the breakfast and for sure we will come back to Venice and stay at Antico Doge...", "Date": "September 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Nice Reasonable Venice Hotel”", "Author": "WayMoTravel", "ReviewID": "UR34677372", "Content": "stayed 2 nights at the Antico Doge - very nice room- helpful staff- relatively convenient to canal stops. be prepared for some stairs.......close to rialto bridge...cool place to stay", "Date": "July 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Brazil", "Title": "“Great location, clean, comfortable and nice breakfast”", "Author": "Marcioxes", "ReviewID": "UR34468624", "Content": "I enjoyed a lot my stay! The hitel is close to the mains attractions, the staffs are helpefull, room clean and good breakfast. The only negative point is the small bathroom. But I don't care for it.", "Date": "July 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "milwaukee", "Title": "“A very lovely and comfortable hotel in a desirable area.”", "Author": "PSGSM", "ReviewID": "UR34339866", "Content": "We really enjoyed ourselves at the Antico Doge. We had a room for three and it was very clean and comfortable. Breakfast was tasty and the staff was very friendly and obliging. We would stay here again.", "Date": "July 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Stdbet", "Title": "“Wonderful hotel with a fantastic location ! Definately recommend this.”", "Author": "mic291", "ReviewID": "UR32416658", "Content": "Hotel was very nice, upgraded to the better Deluxe room which was excellent and strongly recommend!! We had a view of one of the waterways, excellent bed and the room was a great size. Bathroom was also great. Location was excellent, short walk to everything you need and the best of all was we were able to take a water taxi too and from the hotel!! Breakfast was standard for europe in that its fairly basic, but we ate outside of the hotel, why go to Venice to sit inside!!", "Date": "June 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Copenhagen", "Title": "“Perfect location, wonderful room”", "Author": "lottegine", "ReviewID": "UR32367591", "Content": "I am so happy I chose this hotel for a romantic weekend. 10 minutes walk to Rialto and away from the main tourist hub. Wonderful neighbourhood, and a truly beautiful hotel. I booked the Suite Falier, which is a lot smaller than it appears on the hotel pictures - but it was incredible beautiful. The balcony is wonderful. Breakfast was not so good, joghurt, bread and cakes - i really missed an egg. My boyfriend had arranged a special surprise in the room, and the hotel met his expectations 100%. I would definately stay here again - no doubt about it!", "Date": "June 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Cheltenham", "Title": "“Great Location”", "Author": "EmmaRad", "ReviewID": "UR31851121", "Content": "This hotel has a really great location for exploring Venice. We had a 'supierior room' which was fairly small but big enough for our visit, beautifully decorated and clean. We didn't have a view of the canal either but when you are in Venice you don't really want to stay in your hotel room! One point was that most of the staff were very very helpful and friendly except one girl who couldn't really be bothered to respond to us despite our broken italian. All in all a very enjoyable stay and I would recommend.", "Date": "June 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Wisconsin", "Title": "“Great location, but a little noisy at night.”", "Author": "LizEWisconsin", "ReviewID": "UR31239373", "Content": "This hotel was excellent overall. My husband and I stayed here one night before flying home after our cruise ended in Venice. The location was great; very near the Rialto Bridge and San Marco, and the direct water access was especially nice. We were able to be dropped off and picked up directly in front of the hotel by private water taxi, which was great as we had a very early flight out on Saturday morning. Overall the room was very nice; clean, nicely decorated, comfortable. My only complaint is that our room was on the corner of the building overlooking the main street on the way to San Marco and on Friday night the pedestrian noise was constant, and seemingly louder the later it got and the drunker the pedestrians were.", "Date": "May 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Perfect Venice Hotel”", "Author": "fivestargirl", "ReviewID": "UR30801266", "Content": "We spent three wonderful nights at this hotel and loved it. The location is perfect - a five minute walk to the Rialto Bridge and ten minutes to San Marco. Our room overlooked the canal and the small piazza across the canal. The room itself was lovely - spacious with a very nice bath. The hotel breakfast was wonderful and the staff extrememly helpful with information and making dinner reservations. We found this hotel to be one of the better values in Italy.", "Date": "May 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "ireland", "Title": "“perfection.....”", "Author": "cie027", "ReviewID": "UR30191917", "Content": "simply put... a truly brilliant small hotel, excellent in every way, well located, lovely rooms, and great allround !", "Date": "May 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Melbourne", "Title": "“Stuffy and claustrophobic room”", "Author": "Melbs_9", "ReviewID": "UR30188256", "Content": "We were welcomed by a lovely girl at reception who was very helpful and friendly. Unfortunately thats were the good parts ended. We felt like we had been placed in the attic. Our room was so stuffy and over-heated and had been cleaned with a carpet-cleaner that smelled terrible. The smell was so bad we had to sleep with all the windows open ( as the air con had been disconnected throughout the hotel) which meant that we had a million mosqitoes biting us while we slept. It was also very noisy in the street below our window at night. The breakfast was nice and the staff were lovely. The hotel is in a fantastic location. The decor is old and tired looking, and the pics on the internet make it look much nicer than it is.", "Date": "May 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "NYC", "Title": "“The perfect beginning to an Italian Honeymoon”", "Author": "NycTraveler25", "ReviewID": "UR27579998", "Content": "My wife and I spent our first 3.5 days in Italy at Antico Doge in Venice. This hotel was simply amazing. Its wonderfully decorated and has the European/Italian feel to it. our room was a duplex with the bedroom upstair and bathroom and main area below. The bathroom is great though narrow its got everything you need and is very clean. The breakfast was nicely varied and included in price. My wife is still talking about this hotel as it trully is a gem and as close to a b&b as you get.", "Date": "April 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Boston, MA", "Title": "“Great deal in a great location”", "Author": "stevebe", "ReviewID": "UR24312795", "Content": "Wife and I stayed there the first three days and the last 2 days of our Italian vacation. The hotel is located close to 2 water taxi stops and is easy getting to and from with luggage. The entrance is easily located off of a main piazza. Be warned that the hallway to the registration desk is very narrow and you have to go up a flight of narrow stairs to get to the rooms. So if you have heavy bags, ask for help. Rooms are classically decorated and very nice. This is not the Bauer so don't expect 5 stars. Expect a nicely decorated room with all the amenities you can expect in a city like Vienna. Beds are large, clean and comfortable. Bathrooms are nicely sized and decorated with tile and large mirrors. Water pressure was very good and the shower heads are set up high (I am 6'-3\" and my wife is 5' so this is a big deal to us). The staff is very professional, friendly and decidedly Venetian (don't expect lots of smiles and handshakes). Breakfasts offer a nice variety of teas, pastries and meats and the coffee was delicious. If you have a room facing the main piazza, expect a little bit of noise at night from walkers and revelers, but most of the hotels in Venice have this. We had a 2 story room the first segment and a superior room the second segment and they were both great values for the price. We booked directly with the hotel and got great deals both time. It's a 5-10 minute walk to St. Mark's and there are many very good and authentic venetian restaurants right near the hotel. The hotel borders one of the neighborhoods that Venetians live in so you can get some nice non-touristy cuisine and walk around and see how Venetians live. Overall, solid 4 star hotel.", "Date": "February 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“A jewel of a hotel”", "Author": "stocky2007", "ReviewID": "UR24058968", "Content": "We stayed 1 night at the antico prior to joining our cruise and can't wait to return. Hotel is situated in a good location close to the rialto bridge and within close proximity of shops resteraunts and bars. The room was stunningly decorated with venitian style as was the rest of the hotel, Bathrooms were modern and well appointed. The staff were friendly and extremley helpful. Buffet breakfast offered a good selection of items. Will be retuning when we visit Venice again", "Date": "January 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Houston, TX", "Title": "“great location, helpful staff”", "Author": "dcm58", "ReviewID": "UR22422472", "Content": "Venice is expensive. To enjoy any hotel in Venice, you must accept this and move on. Once you accept this, you will love the Antico Doge and find that it has a very reasonable price for a nice hotel in an excellent location. The best thing is the location. Some reviewers have suggested this hotel is \"right by\" Rialto (like this is a negative!). I would amend this comment to say that the hotel sits a perfect 2 to 3 blocks away (about a five minute walk). This means you can easily walk to Rialto without feeling like you are living in the middle of a tourist trap. The hotel is directly across from a canal and bridge and if you walk across the bridge away from Rialto, you will find yourself in a lovely and quieter residential area. So, in my opinion, this location offers the best of both worlds! The room was very lovely. yes, the actual room seems a bit worn, but I think this is partly because it is furnished in an old-timey way with antiques, etc. the bathroom, though small, is recently renovated and the shower is excellent! my family actually shared a superior deluxe room for two nights. this offered a bed in an upstairs loft and a downstairs bed. be warned that the downstairs bed is actually a sofa bed pulled out with an ornate headboard. this is NOT the most comfortable thing, but my husband and I did just fine on it. We paid 330E per night, but we stayed in October and this is one of the best prices we found! I thought the breakfast was lovely - definitely on par with other places we stayed in throughout Italy. The only draw back was the coffee. it was merely luke warm and the breakfast staff didn't seem to understand the concept of heating it up more when we asked. oh well. that's pretty much the worst I can think of to say about breakfast! The staff is extremely helpful and willing to recommend restaurants, etc. The hotel also offers a private boat service to and from the airport. As my husband and I were traveling with my parents and didn't want to risk getting lost, we booked the private car from the airport. it was insanely expensive, but such a nice private motor boat. We stood the whole way (through the sunroof) and absolutely love the beautiful view that greeted us. That being said, we simply had the hotel book a taxi for our return trip to the train station. it was half the cost! If I had booked a room 1 year in advance rather than the 5 mos. in advance I did, I might search around for a better room for the price. However, I would not hesitate to stay here again and recommend this hotel to others.", "Date": "December 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Richmond, VA", "Title": "“Beautiful Hotel”", "Author": "jcp07", "ReviewID": "UR22358131", "Content": "This was by far the most elegant place we stayed while in Italy. We had the least expensive room, but it was beautifully decorated with a coronet bed. The bathroom was tiny, but adequate. The breakfast room made us feel as if we were staying in a palace. The hotel has a small reception area, but no lobby. The only complaint we had was that it was very hot in our room, and our windows opened by slanting inward and only slightly. When I asked at the reception desk, they said the heat was not on, so I donâ€™t know where the heat was coming from. The hotel is in a busy location, but is convenient to the Rialto Bridge and other tourist areas. If youâ€™re staying for a week, it might be too hectic an area, but for a couple of nights it was fine. It also is a short walk from the Ca dâ€™Oro stop with only one bridge to cross â€“ a great help when you are carrying luggage. Iâ€™m sure there are more elegant hotels in Venice, but I doubt they would charge only â‚¬89 a night for a weekend in November.", "Date": "December 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stratford", "Title": "“Loved It”", "Author": "SnowyStratford", "ReviewID": "UR21734432", "Content": "I booked this hotel for 3 nights on the recommendation of a friend. And it was everything as promised, great location, super friendly, helpful staff and a very clean room decorated as only possible in Venice. The breakfast was very good. The price of the room included a free boat taxi ride to Murano which was lots of fun. And because we paid in cash we got a 10% discount so a twin room only cost 99Euros a night. This a a great place to stay in Venice!", "Date": "November 11, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "San Diego", "Title": "“Okay, but overrated”", "Author": "StevenDSanDiego", "ReviewID": "UR21159162", "Content": "I was enticed to stay at the Antico Doge by the overwhelmingly positive reviews here on TripAdvisor -- but, when I checked in, I was a bit disappointed. I didn't feel it lived up to the high rating. The hotel is okay; there is nothing glaringly wrong, but it is not the special place that people here have raved about. First, the location: the entry is right on a very busy walkway/bridge in Cannaregio, near the ridiculously crowded Rialto Bridge. There's a constant stream of foot traffic along the walkway, which is dark and dank. It's not exactly ugly, but there are a multitude of more attractive (and more quiet) spots in the district. Second, the hotel has no lobby. To me, lobbies are important. I want a place to relax without having to necessarily go up to my room. Antico Doge only has a long corrider, a small check in desk, and then a stairway to climb. It does have a very classic-looking breakfast room, and that's a positive, but it's not the same as a lobby. This was the biggest disappointment for me. Third, it's a bit on the shabby side -- the carpets in the hallways were a tad worn and the carpet in my room had some small stains. A tacky touch, they have plastic flowers in the corridor. Fourth, the room itself was plain. I booked a standard room, but when I checked in they told me I was being \"upgraded\" to a \"deluxe\" room. But it wasn't deluxe -- it didn't have the hardwood floors and view that I expected; indeed, it had no view at all. To be fair, there were some positives: the staff was friendly, the room was larger than I expected (maybe the size is why it was deemed to be \"deluxe\")and it was extremely tidy and clean; the bathroom was new and modern; the breakfasts and espressos were delicious; and (I suspect) the actual \"deluxe\" room really do have hardwood floors and amazing views, if you're lucky enough to get one. I just expected more for the equivalent of $190 euros (about $280) per night. My girlfriend seemed satisfied with the place, but when she found out how much it cost, she said, \"For this?\" A tip: if you want to stay in this area, consider instead Hotel Giorgione -- it's a bit more expensive, but it's a far better value: it has a large, beautiful lobby, with real fresh flowers; the breakfast area is outside and inviting; and the location, though only a stone's throw from Antico Doge, is much quieter, on an old traditional Venice street.", "Date": "October 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "NY", "Title": "“Lovely stay”", "Author": "Ellense", "ReviewID": "UR21146097", "Content": "Lovely hotel in a great area. Period furnishings, lovely breakfast room. Helpful staf. Would stay here again.", "Date": "October 23, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“Great Place to Stay”", "Author": "Ozzie75", "ReviewID": "UR19566483", "Content": "We turned up after being greeted at the San Angelo Pier. Very warm service and only too willing to help with any questions. Very quiet at night and in the middle of the day due to its great location tucked away in the back streets but only a 5 minute walk to any great Cafes, Bars and the Grand Canal. The only negative was the breakfast cosisting only of bread and Chocolate croissants. But what the hell your in Venice and ready to explore the fine cuisine not to lap up a cheap breakfast at your hotel:) Definitely would stay there again!!!!!", "Date": "August 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "nsw", "Title": "“Awesome stay”", "Author": "chrisbh77", "ReviewID": "UR19057727", "Content": "Fantastic hotel in a great location. We got an upgrade to the room with balcony overlooking the canal and square - fabulous. Only fault was the fridge in the room was too warm (a minor thing really). A great treat for anyone. The breakfast was continental, which I find a bit boring after 1 month away in europe, but plenty of choice none the less. I'd give this hotel and it's staff a near 10.... The asian cleaner was very helpful, waited around for us, and spoke great English. Good luck", "Date": "August 17, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Rural England", "Title": "“Our stay at the Antico Doge, Venice”", "Author": "EffandC", "ReviewID": "UR17561915", "Content": "You never know what awaits you when you turn up to your hotel - they all advertise how good they are, and we have often been disappointed. But we were genuinely delighted with the Antico Doge in Venice. Centrally placed, beautifully decorated and helpful staff, we loved it and if we can afford to go to Venice again (not a cheap city) we would certainly go back to this hotel. Our room (a junior suite) was bigger than we thought it would be, the ensuite bathroom was superb. The room was air-conditioned and made up discretely each day while we were out enjoying the sights.", "Date": "July 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Carlsbad", "Title": "“Loved the Location and Loved Venice”", "Author": "cmkblanke", "ReviewID": "UR17489729", "Content": "We stayed at the Antico Doge with our adult son and teenage daughter in June. The location was excellent, close to the Rialto and not far from St Mark's square. It's also an easy walk to get off the beaten path and explore the backstreets of Venice on the other, less touristy side of the Rialto (San Polo? area I believe). We stayed in a Junior Suite which was decorated beautifully in old Venice style. The bathroom was adequate and the air conditioning was great and definitely needed in Venice. There was a king sized sofa bed down stairs that was made up into a bed and two twin beds upstairs. I was immediately disappointed because I booked a room that stated 1 king and 2 twin beds. When I asked the receptionist she explained that all their king beds were the same and that our bed was NOT a sofa bed. Maybe Italy is different, but in America when you can fold a mattress with a frame back into a sofa, it is called a sofa bed. Additionally none of the beautiful king sized beds shown on their website appear to be sofa beds. For 330 euros a night (more than we paid anywhere in Italy, including Rome where we had a two bedroom apartment) it would seem reasonable to have had a comfortable bed to sleep in. Because Venice was so absolutely wonderful, we did not let a bed detract from our overall experience. We would definitely return to this beautiful city and possibly the hotel because of its excellent location. I would not stay in the junior suite again however. **Also... make sure you're aware of all charges when you eat out in Venice. When we ate at the canal side restaurant a few steps away from the hotel, they charged us 6 euros per person (24 euros total for table settings/linens, I believe they said). In other restaurants in Italy, we sometimes encountered a 2 euro per person service fee, but we never were charged this...", "Date": "July 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Best Hotel of our European Vacation!”", "Author": "jkramer1201", "ReviewID": "UR17320578", "Content": "We paid a little more than we normally would to stay here, but boy was it worth it! Our room was furnished with antiques. It was large, comfortable, and *air-conditioned*, and it actually had a room service menu, marble counters in the bathroom, enough outlets in the bathroom to be able to use a hair straightener (finally!), and my favorite, the rainfall showerhead. Plus, the shower actually had a bench and a shelf to set our toiletries down (none of the other showers at the other 4 vacation hotels had these). If it weren't for the bedet in the bathroom, I would have thought I was staying at a four-star hotel in the U.S. The location was great, walking distance to most everything, and the staff was accomodating. Gondoliers had set up right outside the front door, and the Rialto was just a five-minute walk from the front door. There's a terrific enoteca not far from the hotel, near Campo San Bartolomeo, called Enoteca ai Rusteghi that serves great, reasonably priced wine, and terrific cicchetti. The breakfast room was beautiful and the meal was fine-- it was the same breakfast we had at every other hotel: deli meats and cheeses, croissants, toast, muffins and cereal. I would definitely stay here again!", "Date": "June 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Savannah, Georgia", "Title": "“A little gem”", "Author": "FSHphd", "ReviewID": "UR16879464", "Content": "Hotel Antico Doge is a lovely small hotel with excellent service, pretty rooms and reasonable prices. We found the staff very accomodating, food nicely prepared, and location perfect. What a nice place!", "Date": "June 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Lovely, atmospheric Antico Doge”", "Author": "mmminla", "ReviewID": "UR16839652", "Content": "We stayed at Antico Doge in early June 2008 on our first trip to Venice. After a short vaporetto ride from the train station to the Ca' dOro stop, it is just a quick 2-min. stroll down a street to the hotel - very easy to find, and no need to leave baggage at train station. Just get the clear directions from the hotel staff via email before arriving and there's no way to get lost. It's in a lovely location on a side canal and in one of the more residential neighborhoods in Venice - nice to watch the locals on the promenade, walking pets, etc. while we ate at a cafe rather than noisy tourists. The hotel has lots of charm, little twisting hallways and beautiful decor - brocade on the walls, Murano chandeliers and lovely Venetian decor in the rooms. Note that the hotel doesn't have elevators. The bathrooms are sizable, with all modern amenities and lots of counter space. The bed was comfortable. The staff, while formal, is helpful and helped us make museum and opera reservations. I was interested in seeing an opera while I was in Italy and they recommended Musica al Palazzo - it was La Traviatta staged in the intimate setting of a palazzo - only about 50 guests positioned around the opera action, and each act was set in a different room. The soprano was remarkable and it was a very unique way to experience opera. All in all, I was very satisfied with Antico Doge in all aspects.", "Date": "June 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“Very happy with the Antico Doge”", "Author": "EnglandMary", "ReviewID": "UR16691840", "Content": "Spent 3 nights here with our two teenaged children and had a lovely stay. We had the Falier Suite which was beautiful and our children had room 101 (!) which was next door. The location was good and staff friendly enough. The only negative criticism I have is that these two rooms are at the front of the hotel overlooking a small canal and a busy square and there was a fair amount of noise from outside. We took it as part of the experience of staying in a busy city but it might annoy some people.", "Date": "June 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Utterly delightful”", "Author": "NinthCircle", "ReviewID": "UR16392319", "Content": "Very peaceful hotel a few steps from the Rialto bridge. Canal directly in front very convenient for either water taxi or gondola. Beautifully decorated rooms, air conditioning that actually works, and a great location in Cannareggio. Very close to Fiaschetteria Toscana and other non-touristy restaurants. Super helpful staff.", "Date": "May 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago", "Title": "“3 star hotel at 2 star prices”", "Author": "brett13sky", "ReviewID": "UR16090899", "Content": "We booked this hotel for 1 night in Venice and paid 75 Euros for a double w/breakfest. Great location, near the train station (which is important if you have ever been to Venice and been lost in about 2 seconds). The room was very nice, quiet (double pane windows), and AC. I definately would stay again and recommend.", "Date": "May 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Colchester, UK", "Title": "“Good Hotel, Great Location”", "Author": "GATFW", "ReviewID": "UR15474458", "Content": "The Antico Doge is located near to Rialto, we found it to be an ideal location, central for most if not all attractions. The staff were welcoming and helpful, the room was spotless, and beautifully furnished with the bedroom on a mezzanine floor. Bathroom was a good size and also spotless. Breakfast was a well presented cold table, which is fine for us - don't come here if you expect bacon and eggs. Overall, we were delighted and would not hesitate to return. General observation regarding Venice:- An unforgettable, unmissable experience - but probably one of the most expensive European cities we have visited, comparable price levels to Norway and Sweden - you have been warned!", "Date": "April 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Perfect location in Venice”", "Author": "heatheruth", "ReviewID": "UR15118784", "Content": "This hotel was recommended by friends who said it was worth paying what seemed a little over the odds - and they were so right. We were very happy with our choice. We paid EUR 225 for B&B per room in a superior room (we reserved a few months ago but they only took the first night's charge 15 days in advance, and we could have cancelled until then, which is always reassuring). We (three adult couples) thought it was a really excellent choice in terms of location - just on the edge of the very interesting Canneregio district but only five minutes from the Rialto bridge or fifteen from St Marks Square. It is also just a few vaporetto stops and short walk from Piazalle Roma if you are coming from Treviso airport. Our room overlooked the busy Campo but was never noisy and was really loverly in terms of decor and comfort, but with a modern bathroom with excellent multi-function walk-in shower. The individual thermostat meant we could keep the temperature as we like it - hotels are so often too warm. The breakfast room was delightful. There was a cold buffet (cereal, cheese, ham, rolls, etc) which was a bit limited but the croissants were always fresh and the coffee hot and strong, so we were quite satisfied. Also, all the the hotel staff were helpful and friendly, helping with restaurant reservations (important to reserve for dinner at decent restaurants, we found). We will certainly be back.", "Date": "April 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Beautiful, elegant, refined and centrally located”", "Author": "ProtonVehiCROSS", "ReviewID": "UR14841483", "Content": "Pros: - Close to Rialto bridge - Charming rooms and dining room; very clean, comfortable, and elegant; refined old-world luxury and style - Price was reasonable for Venice at about â‚¬110 per night in February 2008 Cons: - Hotel is 20-25 minute walk from the main plaza in Venice (Piazza San Marco), but makes up for that by being so close to the Rialto Bridge area Overall: - An outstanding hotel and I would stay here again", "Date": "April 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Great Honeymoon”", "Author": "happyinNYC", "ReviewID": "UR12533887", "Content": "We stayed in the Falier Suite and had an amazing honeymoon. The staff was very professional and helpful in every way. I was prone to locking us out of the safe and would call the front desk and have someone in our room in about 2 min. The location is great and has easy access to everything you may want to do in Venice. The room was always clean and the free trip to Murano was a nice touch. The only problem is that it can get a bit noisy at night and early in the morning, but you are in Venice....what else would you expect. Overall this was an amazing experience and we are very greatful to the wonderful staff and excellent management.", "Date": "January 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Carrickfergus", "Title": "“What a Great Place”", "Author": "CarrickRover", "ReviewID": "UR12337432", "Content": "This hotel is in an ideal location - 5 mins walk to the Rialto Bridge and a further 5 and you're in St. Mark's square. Bad news for husbands the route to both of these locations is littered with great shopping. Use the public transport system from the airport - bus and boat - and then a short walk to the hotel. The rooms are delightful - really well finished and furnished. The breakfast is typically european and fresh and tasty. Staff in the hotel are very helpful. Part of the deal we booked included a water taxi to the nearby island of Murano - a centre for glassblowing. take the trip and return by public boat. You must visit St. Mark's Square, the Bascillica and the Campanille (bell tower) and take a trip on a Gondola - barter for a good price - we were quoted 80 euros and 100 euros before taking the one at 60 euros which covered some of the Grand Canal and some smaller ones and some great tourist chat. Venice? We loved it!", "Date": "January 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Great stay, helpful staff”", "Author": "travelingtourist", "ReviewID": "UR11118365", "Content": "We stayed at this hotel in November. We had a great time at this hotel. The staff was extremely helpful and friendly. I loved the decor of the room, fit perfect with Venice. We stayed in a double standard room. My only compliant is that the bed is two twin mattresses pushed together. Other than that, the location was great. very easy to find once we got off the vaporetto. About a 5 min walk to Rialto and 10-15 to San Marco. When we return to Venice, I will definately put the Antico Doge on the top of my list of places to stay.", "Date": "November 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lanrelas, Central Brittany", "Title": "“Wonderful experience”", "Author": "Rob021", "ReviewID": "UR11114255", "Content": "We stayed at this hotel in April 2007 for my wife's birthday. We stayed for 6 nights in the suite overlooking the canal (Falieri) The facilities were excellent, we even received a bottle of sparkling wine one just to say thank you for staying! The staff were very freindly and helpful and the situation was very convenient for visiting the various sites around venice. We would happily stay there again", "Date": "November 28, 2007"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ann Arbor, Michigan", "Title": "“Fabulous hotel for the price”", "Author": "KEW15", "ReviewID": "UR10297848", "Content": "Venice is known for its pricey accommodations. Following Karen Brown's recommendation, we checked out the website of the Antico Doge and thought it looked almost too good to be true, given the room rates (and the attractive photos of the rooms). We booked top of the line - the Suite Falier (room 102) - and while it wasn't a suite (it was a huge room), it was terrific for a price that, we suspect, would buy only an okay room in most hotels in Venice. The bathroom was small but nice - modern in contrast with the period decor of the bedroom. (The reproduction 18th century furniture in the bedroom and living area was very nicely done, and the heavily beamed ceiling is fascinating, since the room is not perfectly rectangular.) Our view over a small canal with a bridge over it to a small piazza was lovely. The hotel's location was great - quite central to explore this adult playground of an island. The front desk staff (in the tiniest front desk area we've ever seen) were very helpful. Otherwise service is basic (e.g., no turndown service) but perfectly alright.", "Date": "October 24, 2007"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Wonderful Hotel”", "Author": "wendywicki", "ReviewID": "UR8726375", "Content": "I have been to Venice 5 times, all at different hotels, and for the price, I loved this hotel. After travelling through the rest of Italy, we were delighted at the size and modernity of the bathroom, we loved hanging out the window and talking to the gondoliers, and the location was the best part. It's away from a lot of the tourist fray and is a good starting point to explore the less visited parts of Venice. For those who complained about the noise, get earplugs! This is Italy not a library! I would stay there again in heartbeat.", "Date": "September 16, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Toronto", "Title": "“Very Disappointing”", "Author": "2York", "ReviewID": "UR8690232", "Content": "We booked a room for three people for four nights in early Sept. 2007. The booking was made to the hotel and room confirmation plus credit card details were confirmed. When we arrived, we were told that we had to go into one room for the first night and then change the following morning to another room. When I challenged this, the receptionist cooly said that it was created by a 'hotel situation'! We were not informed in advance of our arrival of this change. Needless to say, we were very annoyed having arrived tired and wanting to relax, unpack some bags and instead we could not unpack anything and had to move to a much smaller and not nearly as nice a room as the first one. They were completely unapologetic and even rude in discussing this inconvenience. When we arrived for the key to the new room the following morning, we were told that we had to move out of the present room at 11 o'clock but could not move into the new room until 1 o'clock. At this point, my husband stated that he was not leaving the room until the new one was ready! The people at the front desk are discourteous and not very helpful. We also witnessed another couple being rudely treated when they complained that the rate being charged was not the same as their internet booking. The receptionist was actually yelling at this couple and not listening to their explanation. The breakfast was very minimal.... nothing cooked and the same few choices offered every day. While well located, the hotel was also very noisy. But the main issue is that if you have a problem, even one created by themselves, the front desk staff will be rude, discourteous and may even raise their voices at you while dismissing your concerns.", "Date": "September 10, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Bondville, VT", "Title": "“Very Nice Hotel In Venice”", "Author": "starkfarm", "ReviewID": "UR8484080", "Content": "This was our second visit to Antico Doge; the first being in September 2005. While the rooms may be considered by some to be a little small, they are nicely appointed, and their recent renovation shows. Bathrooms are very modern...and very American, with a fully-enclosed stall shower. The continental breakfast is large, and served in a lovely room. Prices are very moderate (we paid $160 Euro). Conveniently located, the hotel is within a 5 - 10 minute walk of the to the \"Ca D'Ora\" vaporetto stop.", "Date": "August 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southwest", "Title": "“Great location”", "Author": "stants", "ReviewID": "UR8120689", "Content": "We've just got back from a five day stay at this hotel & we loved every minute. We booked a junior suite ( but we're not too sure that we were in one ). the hotel is in a great location, superbly decorated & the staff were very friendly & efficient. When you wake in the morning the church bells are ringing & you just feel that you're in Venice. We would definately stay here again.", "Date": "July 15, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "California", "Title": "“Centally located hotel in Venice”", "Author": "ElizaSF", "ReviewID": "UR7641784", "Content": "We spent two nights in a Junior Suite with a canal view at this hotel in early May. The hotel is easy to find and close to the Rialto Bridge and San Marco Plaza. This was our first stay in Venice so I don't have anything to compare it to but there was a fair amount of noise outside of the hotel. Although it seems that there would be noise outside of many of hotels so I'm not sure how significant this is. We didn't have a problem sleeping. The room was nicely decorated and clean. The bathroom was \"shower\" friendly. Breakfast was on the basic side but adequate. I would stay here again.", "Date": "May 18, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Seabeck", "Title": "“Nice hotel but DO NOT book a canal view room”", "Author": "SeabeckTraveler", "ReviewID": "UR7624305", "Content": "Unless you are a very sound sleeper and NOTHING wakes you up at night then book a room facing the canal. As many have mentioned the noise is terrible. Even though I closed the wooden shutters we heard noise ALL NIGHT/MORNING long. There are people walking/talking or boating with noisy engines. There were some that were singing loudly at 2, 3 and 4 in the morning. The rooms were decorated very nicely. The bathrooms were nice but on the small side. The rooms are decorated in a nice Venetian style. The breakfast was just basic. Some of the front desk people were nice and helpful. There was one woman that really should not be in a people oriented business as she didn't have the personality.", "Date": "May 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "los angeles", "Title": "“A nice experience”", "Author": "abbeau", "ReviewID": "UR7489718", "Content": "We just returned from our visit to Venice and found this hotel very charming and wonderfully located, though a bit on the expensive side. The staff was very nice and the breakfasts, if not imaginative, were suffcient. The only downside is it can be rather noisy if you leave the windows open; it is on the main route from the train station to San Marco and Rialto Bridge. There are a number of excellent restaurants within walking distance.", "Date": "May 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great place - recommend it !”", "Author": "ThibaultL", "ReviewID": "UR6801186", "Content": "I was looking for a hotel in Venice but there was so much choice, so I decided to opt for this one after much hesitation! I was not disappointed at all. We had a junior suite, with the sitting room downstairs and the bed upstairs. I chose this hotel because I wanted to stay in an old palace that had been restored and renovated with Venetian furniture - that's exactly what I got. Location - it's perfect. You can walk to alot of places but you can also take the vaporetto which is a great way to discover Venice. No need to spend a fortune on a gondola. We booked on the internet and got a great deal - we paid the suite for the price of a normal bedroom. The only thing was that it was extremely hot in our room and we couldn't turn the temperature down! Ok, the breakfast was not as good as some other hotels but there was ham, cheese, bread etc...That didn't really matter because we found great little places to have lunch and dinner.", "Date": "February 16, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "australia", "Title": "“Caution!”", "Author": "tynefield", "ReviewID": "UR6610547", "Content": "I spent some days at this hotel having booked a 'junior suite' via the internet/email. It is completely misleading of the hotel to advertise the rooms as suites which leads guests to expect a bedroom with separate sitting room. The junior suite at this establishment is in fact a double room. When I queried this with the receptionist her response was to say that there is a photo on the web site. The room was clean but there is little to recommend the hotel generally. Reception is unfriendly. The breakfast is mediocre although service in the breakfast room was kind and courteous. Views of the canal can be had if one stands at the window. The canal is unattractive and there is a good deal of street noise. Having visited Venice on many occasions I would say there are many better places to stay. I urge all prospective guests to read the hotel cancellation policy. I was caught four days into an eleven day stay by a death in the family. There was an inflexible approach and my credit card was invoiced for the eleven days despite the circumstances. Staff are highly skilled at the stone wall approach.", "Date": "January 17, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellent Choice”", "Author": "R1zzy", "ReviewID": "UR6479448", "Content": "Me and my Husband have just returned from two nights stay at the Antico Doge. The location of the hotel was great and very easy to find, from the airport we caught a bus to piazzalle roma (3eur each) and from there the water bus line 1 to Ca'd Oro (5eur each). We booked a double standard room and we were surprised with the size of the bedroom and the lovely traditional deco, the bathroom was of a decent size and the overall service was good. Rialto bridge and St Mark Square was 10-15 min walking distance and just near the hotel there was a number of nice shops, specially murano glass shops.. there was even a McDonalds near by for those like me who are less adventurous in trying new food and rather stick to what you know. The only thing in Venice that was expensive was the gondolas, the prices seemed to start from EUR80 onwards, we went on the gondola at St Marks square for EUR100 through the Bridge of sighs, Rialto bridge, Casanova's house and a few palaces, a definate must do! Overall we had an excellent time and i would definatly go back and stay at the Antico Doge.", "Date": "December 21, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Seattle, WA", "Title": "“Great Hotel”", "Author": "xxvvcc", "ReviewID": "UR6440412", "Content": "I have stayed in Venice several times but this was my first time at this hotel. It was nicely decorated and spotless. The staff were very friendly. The breakfast room was beautiful and they put out a nice spread. We had a junior suite and I wasn't crazy about going down the steep wooden stairs in the middle of the night to use the bathroom. We had a corner room and there was noise from foot traffic below but it wasn't too bad if we kept the shutters and windows closed. My only real complaint was that we never had hot water in the shower - it was lukewarm. I would stay there again because the location was great.", "Date": "December 14, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel - superb location”", "Author": "Legspinner", "ReviewID": "UR5903905", "Content": "We have just returned from a 3 day break at the Antico Doge and highly recommend it. The location is great, just a few streets north of the Rialto Bridge. This means you are close to the action but just off the very busy tourist route. The Strada Nouvo is a much wider street than most and means you can catch your breath and the nearby Vaporetto stop of Ca D'oro is not as crowded as many. Rooms are very clean and comfortable. Staff are friendly and helpful. We stayed in a Junior Suite which is great for 2, but can sleep 5 easily, with the use of the 2 sofa beds. Thus making it great value for money.", "Date": "October 3, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Salford, England", "Title": "“Enjoyed my stay here”", "Author": "PSuk", "ReviewID": "UR5799906", "Content": "We stayed in a Junior Suite for 2 nights. The room was spacious, beautifully decorated and air conditioned! I was worried about street noise having read previous reviews, but we couldn't hear anything on one of the busiest weekends of the year with the double glazed windows closed. Breaksfast was typical 'continental'. The staff were very helpful and all spoke English. Would I go back? Yes.", "Date": "September 14, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Victoria Australia", "Title": "“Best value in Venice”", "Author": "Chaloner", "ReviewID": "UR5778773", "Content": "Great location, great value. The 1st floor suite is great", "Date": "September 7, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Very good spot”", "Author": "ljud", "ReviewID": "UR5502382", "Content": "After a lot of brainstorming based on Tripadvisor reviews, I decided to land at the Antico Doge. A very good choice indeed ! The property is central, close to the Rialto bridge. Rooms are nicely decorated, the air conditionning working at full speed ! Breakfast pretty good, served in a lovely room, with classical music. The only disappointment would be the size of the tiny bathroom, and tiny shower...", "Date": "July 24, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Dublin", "Title": "“Great find”", "Author": "SMMB", "ReviewID": "UR5359816", "Content": "We stayed in the Antico Doge in mid May for 4 nights, arriving on a Thursday and leaving on a Sunday. We didnt arrive till almost 10.30pm and guy on reception was waiting for us, left check in till the morning and told us where we could go to get something to eat. We had a junior suite booked, room was beautiful although bathroom was a small (although long). The reception guy even carried my bag upto my room for me (and I'm in my 20's). We found the location great, two mins to the nearest waterbus, 5 mins from Rialto Bridge and lots to do in the surrounding area. Thoroughly enjoyed Venice and the surrounding islands - hotel is also well positioned for going to Torcello, Murano etc on the waterbus with the stop 5 mins walk away; we also used this stop to go back to the airport which was much easier than the bus/water bus option we took on the way in. Breakfast was limited but fine, although coffee was great. While there we did all the usual sights but one I can recommend is the secret itineries tour of the Doge Palace. You get to go off the beaten track, even into the roof to see the trusses. Well worth it. Would definitely stay in this hotel again.", "Date": "June 19, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Fishers, Indiana", "Title": "“Great location, wonderful detail”", "Author": "Mid-West12", "ReviewID": "UR5339232", "Content": "We stayed in one of the Jr Suites which was perfect for our short stay. I agree with the others, that the hotel did a wonderful job with the small details that really made us feel like we were in a time capsule. The breakfast was good and the front desk was always helpful- take their dining suggestions! If I had to find something to improve, it would be to tack down the carpeting, my poor wife almost did a head dive coming out of the bathroom.", "Date": "June 13, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Belgium", "Title": "“Good, not super”", "Author": "A TripAdvisor Member", "ReviewID": "UR5298990", "Content": "We stayed here the last week of May. The hotel is well situated, not too far from the \"water busses\". I suggest to take a junior suite. Is is only a little bit more expensive than an ordinary room, but is quite bigger. We stayed in a normal room and thought it was a bit too small, for sure the bathroom, were one couldn't go to toilet when someone was taking a shower. Breakfast was \"normal\" for an Italian hotel, but without any fresh fruit which was a petty.", "Date": "June 5, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "North Carolina", "Title": "“Loved the Antico Doge”", "Author": "survivorfan", "ReviewID": "UR5226097", "Content": "This hotel was expensive, but aren't most of the good hotels in Venice? We loved the Antico Doge. We had a junior suite and loved it. The bedroom is on a balcony above the living room and bathroom. The hotel was clean, and had a nice shower! We loved the tile shower and bathroom. The location of the hotel really could not be better. I enjoyed this area more than the area just around the San Marco square. However, the San Marco piazza is only a 10 minute walk if you don't get lost (which is impossible in Venice). No matter where you stay, you'll get lost. Period. But that's part of the fun. The hotel had a good breakfast that was included with the stay. There was a good spread of fruit, croissants, bread, jam, danishes, deli meat, cheese and other things. We enjoyed opening the window to let in the fresh morning air. The front desk staff was helpful in giving us a map, recommending a restaurant and holding our bags until check-in time and after checking out. I would recommend going to the hotel's website directly, rather than just rely on pictures at travel websites. They have a picture of each type of room they offer on their own website and more options than the travel websites.", "Date": "May 25, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Dorset England", "Title": "“Wonderful romantic suite”", "Author": "A TripAdvisor Member", "ReviewID": "UR5068082", "Content": "Just returned from a three night stay at the Antico Doge-we had the Falier suite which was even more amazing than it looked in the web site photos. Wonderful large room, with four poster, fabric lined walls, long balcony overlooking canal and bridge, with a water taxi or gondaler always passing by. No restaurant for lunch/dinner but lovely breakfast room and fresh breakfast buffet each morning. The hotel was exceptionally clean and looked as if (although totally inkeeping with the venetian classic style), everything was brand new. Great location, short walk to Grand Canal, either to Rialto bridge or Ca D'Oro. We would thoroughly recommend this hotel and particularly the Falier Suite which is worth the extra rate.", "Date": "May 14, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Chevy Chase, Maryland", "Title": "“Agree with prior reviews”", "Author": "jpisha", "ReviewID": "UR5034531", "Content": "Stayed at Antico Doge for three nights from April 19 through 21, 2006. I agree with most of the prior reviews here that the hotel is very clean, staff polite and helpful and for the money, the rooms are luxurious. We had a junior suite with a second floor where the bed was, which we thought was cool and made the room seem expansive. The central location is good -- very close to the Rialto Bridge but easy to wander off further into Cannaregio and more off the beaten path. I would stay there again.", "Date": "May 4, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Charlotte NC", "Title": "“Great Find in Venice”", "Author": "kmgfoodie", "ReviewID": "UR4972111", "Content": "We just returned from Venice this week and staying at Antico Doge. It really is a wonderful value and beautiful place to stay. We had a junior suite #112, fabric covered walls, draped king bed, a sitting area with a desk/daybed, minibar and a bathroom with shower. The room was SPOTLESS. The staff were all very nice and helpful. Breakfast was very nice and they would even make you a cappucino if requested. We had a VERY early flight departure and the front desk staff did everything to help us make sure our travel plans went smoothly including arranging for a water taxi at 4:15am! Can't say enough ~ we would stay again in a heartbeat!", "Date": "April 13, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Charlotte, North Carolina", "Title": "“Gorgeous, luxurious--great price for what you get!!!”", "Author": "nancyandashesh", "ReviewID": "UR4451151", "Content": "Hubby and I stayed for two nights at the end of July 2005. It's taken me a while to write this review, but I keep a travel journal so have lots of notes--and memories--to draw from. First, never go to Venice in July--the heat is so oppressive!!! But if you must, the Antico Doge is very well air-conditioned and was truly a refuge for us. Our room, 202, had silk tapestry wallpaper, the double bed was hung with fabric and tassles, exposed wood ceiling, burled walnut furniture, sofa, and mini-bar. Quite a spacious room! The bathroom was all marble with carved marble accents, even in the shower. Gorgeous room. The breakfast room is amazing: antique mirrors, painted ceiling, chandelier, silk walls, and you sit on gilt chairs at marble-top tables. The food was good: cereal, yogurt, pastries, rolls, cheese, ham, juices. Real china to eat off of!! Front desk staff very helpful, though not very knowledgable about close-by eateries. But they let us store our luggage downstairs after we checked out. Also, we had to climb two long flights of stairs to get to our room, so watch out for that. But the stairways are quite beautiful, so if you have to pause, there's lots to look at. We highly recommend this hotel and would definitely stay here again.", "Date": "February 10, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Beautiful Venice”", "Author": "A TripAdvisor Member", "ReviewID": "UR4333109", "Content": "Just got back from a wonderful break in Venice. What can I say that probably hasn't been said before! As for the hotel I trawled my way thorugh the majority of hotels on this site and took a punt on the Antico Doge. We weren't disappointed, the room was comfortable and plush, the bathroom was fantastic and the staff were a delight. The hotel is also located well for all major sites although to be fair Venice was a lot smaller than I expected. It's size however makes for a wonderful opportunity to take left and rights willy nilly and still somehow manage to come out somewhere you vaguely recognise. Go and enjoy Venice!!!", "Date": "January 9, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Beautiful Room, Moderate Price”", "Author": "washingtondcgirl", "ReviewID": "UR4256310", "Content": "We stayed at the Hotel Antico Doge in mid-November 2005, and found the accommodations reasonable for the price, and the staff extremely pleasant and helpful. We stayed in the least expensive double room, 110 euros per night for a double bed and private bath with shower. Although small, the room was well-appointed, with a desk, mini bar and small closet in addition to the bed and bathroom, which was very nicely sized for an Italian hotel. The rate also included a standard breakfast of rolls, cheese and yogurt, along with coffee and tea. The English speaking staff was very friendly, and offered to obtain tickets to local shows. (Do note that the opera tickets are for an opera \"demonstration,\" and not an actual show.) The staff also arranged for a private water taxi, included in the price of the room, to visit Murano island. Thanks to the directions included on the Web site, the hotel was very easy to find.", "Date": "December 22, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Nice choice”", "Author": "travel2b", "ReviewID": "UR4252609", "Content": "We had a junior suite overlooking the canal. LOTS of pedestrian traffic did not disturb us and added to the ambiance of a bustling Venice. All the many positive reviews of this hotel are justified, particularly the positives on the location. Ideal. Two things to be aware of: (1) there is no lobby. The desk is it. (2) We were not offered assistance with our bags, the key was handed to us and we were on our own. But those are two nit-picks. Oh, any restaurant in the immediate area is a good one. Ask at the desk. For a real dining treat try Da Fiore. The only Michelin starred restaurant in Venice. Worth every euro (expect 200 per couple, including wine)", "Date": "December 20, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "4"}, "AuthorLocation": "San Clemente, CA", "Title": "“Charming and Quaint, but beware of noise”", "Author": "KarenV", "ReviewID": "UR4147210", "Content": "The Hotel Antico Doge is a charming hotel, with pleasant staff and beautiful rooms. Our stay in October 2005 was enjoyable enough, except for one minor detail. We had the suite room that had a quaint balcony overlooking a canal and square.I loved the room...I did not like the noise. I realize that most rooms in Venice have street noise, but this room was directly above the 'freeway'in Venice. What I mean is that there are two main walkways that take you from one side of the city to the other that most locals and tourists use to 'commute' (they walk). Our room was just above a seemingly endless, constant throng of people from very early to late. I loved the view of the canal,the fabric covered walls,the jelly filled croissants, but in all the reviews I read on this site no one ever mentioned the 'freeway' under the front rooms. We used ear plugs and extra pillows and did just fine. Otherwise, a great time in Venice!", "Date": "November 28, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Watford, United Kingdom", "Title": "“Authentic venice in quiet but central location”", "Author": "happytime19", "ReviewID": "UR3512784", "Content": "Stayed three nights at end of May 2005. Chose this hotel from reviews on Trip Advisor and was not disappointed! Hotel is situated a very short walk from the Vaporetta stop (c'a D'oro) with local shops nearby. The hotel itself is in an old typically venetian building with a bridge and canal outside the front door and a campinale with clock and bell opposite! We had a Superior room which was extremely well decorated with material flocked walls , canopied bed and marbled shower room all in tones of pale cream/gold. We even had a tiny ivy clad balcony overlooking a side street. Continental breakfast is served in period decorated room with cupid murals on ceiling. Concierge was very helpful with map and one of them was the tour guide for the Grand Canal boat trip in the afternoon! Would recommed this hotel highly if you are looking for excellent 3* in good location (5 min walk from Rialto Bridge)", "Date": "May 31, 2005"}], "HotelInfo": {"Name": "Hotel Antico Doge", "HotelURL": "/ShowUserReviews-g187870-d233889-Reviews-Hotel_Antico_Doge-Venice_Veneto.html", "Price": "$171 - $363*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Cannaregio 5643</span> | <span class=\"extended-address\">Campo SS Apostoli</span>, <span class=\"locality\"><span property=\"v:postal-code\">30131</span> <span property=\"v:locality\">Venice</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "233889", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/0f/58/0f587613be5cd55829ebffd9d683cea51large.jpg"}}