{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Rating based on wifi and location”", "Author": "lbenjam", "ReviewID": "UR127540218", "Content": "This hotel was fine. The rooms were clean and I was happy with that. But wifi is limited to the lobby. Also, the location is not good at all. If you have a car you are okay, but it is a 12 minute walk (I counted it) to the metro. And the neighborhood is not scenic at all. I would not stay here again. The only reason I did was because my tour was booked here. Oh, take a cab from the airport if you fly in. I made the mistake of taking publich transit and it was not fun.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Perth, Australia", "Title": "“Far away from the city”", "Author": "loveducks", "ReviewID": "UR127506272", "Content": "I've stayed in this hotel as part of the Contiki tour. Personally I do not like this hotel and will not be my choice when I return to Berlin. But there's nothing wrong with it it just wouldn't suit into my preferences. The hotel is rather far away from the city but you can catch a train (about 1km-1.5km, i walk for 20mins) from the hotel on the main road. Its not a very well lighted road from the train station to the hotel so ladies be careful. The deco in the room is very old fashion and almost everything is old fashion in the room. There have 3 lifts and one is slightly bigger than the other 2 which is always a relief for people with big luggages or waiting to go into the lift when there's a big tour group. There is a restaurant and bar and breakfast is very good(good variety for a tour group) The shower is very tiny and the drainage is rather bad as the water doesn't seem to go down the drain quick enough, so after one shower, you have to wait for 10mins before the next one can jump in. the only good thing to me about this hotel is there is actually 3 supermarkets right across the hotel (one is about 5mins walk away). I've got very good service from the lady in the bar when I asked for hot water but the ladies at reception were grumpy.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, England", "Title": "“Basic but good”", "Author": "ace28", "ReviewID": "UR127349506", "Content": "The hotel is a short walk from the metro stop, which you have to rid to get into the centre of the city. But is on a couple of line so good transport links - esp. if you are coming into the Schonefeld airport. Hotel was clean and staff friendly enough. Rooms were a good size and beds comfortable. Very good for the price. There are also plenty of supermarkets around hte hotel if you want to pick up food.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "St Andrews", "Title": "“Ok”", "Author": "jl747-13", "ReviewID": "UR125535078", "Content": "It was a okay hotel. The two major problems with the hotel was the fact that they only had wifi in the lobby and the staff was not very helpful. It was also pretty far from the centre of Berlin. But, other then that it was fine. The rooms were nice, though if you stay here try to stay on one of the bottom floors. I was on the top floor and only one elevator went to the top so it took forever to get to my room.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "middlesbrough", "Title": "“Good base”", "Author": "spexMiddlesbrough", "ReviewID": "UR121946424", "Content": "We stayed here on a National Holidays ,Berlin Xmas Markets tour for 3 nights in November.It was a good base for all the attractions which were all easily got to via the Uber station at the bottom of the road.The hotel was clean ,warm and served its purpose,but we did feel the food let it down a bit,also they had put us on an 8pm dinner ,which was far too late. The bar area, was pleasant ,the staff were very nice even though their english was a bit limited,and we did not think it was overpriced.My gripe ,if it is one ,was that it was really a bit far for a short break by road,but that is National holidays fault for not pointing out the fact that on a 6 day break you only get 2 full days there,but thats not the hotels fault.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "scarborough", "Title": "“berlin hotel”", "Author": "kelly98", "ReviewID": "UR121618711", "Content": "Hotel good, clean and comfortable. A little out of town but OK if you have transport or use the metro. the cost was €30.00 for a taxi back from town. food was good and there was a good choice. bedroom walls are a bit thin we could hear everything that the people were saying in the next room.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Whitley Bay, United Kingdom", "Title": "“Comfortable hotel about 30 minutes from Alexanderplatz”", "Author": "FarEastTraveller33", "ReviewID": "UR121615035", "Content": "We stayed at the Globus City Hotel for three nights in December 2011 as part of a National Coach Holiday ‘Berlin Christmas Markets’ tour on a half board basis. The hotel is located in the old East German part of the city and thus the views from the rooms are not exactly awe inspiring, just your normal boring former Communist architecture. The rooms in the hotel are spacious and come with en-suite facilities, a TV and a hair dryer. Soaps come from a wall dispenser and the towels are a tad tired and rough. There is no mini-bar, fridge or coffee making facility. There are seven floors and two lifts which, can occasionally be quite busy, with coach parties arriving and departing. Reception and maid service are efficient and friendly. The half board option of buffet meals was satisfactory although on one morning the breakfast demand overwhelmed the staff and for quite a while, the tables were left uncleared and the food offer was not replenished. The hotel is located about a fifteen minute direct walk from Magdalenenstr U Bahn Station from where you can catch the U5 to Alexanderplatz for a single fare of 2.30 Euros. From here you can start your tour of the more architecturally rewarding centre of Berlin or catch onward trains, trams and buses.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Zagreb, Croatia", "Title": "“a bit far from the center but cheap and cosy”", "Author": "Ivek090", "ReviewID": "UR121395610", "Content": "if you have a car, I'd definitely recommend staying here because the hotel is affordable, comfortable and clean. however, if you're prepared to travel to the center by metro (around 25 min), it's well connected and we didn't mind it. our room was spacious and clean. breakfast was too expensive for our budget, but there are supermarkets across the street which was great. a kettle in the room would have been great. internet in the room is also pretty expensive, but at least it's free in the lobby.", "Date": "December 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Curitiba", "Title": "“Hotel bom”", "Author": "gabrielctba", "ReviewID": "UR118019836", "Content": "Hotel muito bom. Quartos limpos, amplos e , creio que, recém mobiliados. Há internet de graça no saguão do Hotel. Empregados atenciosos e educados. A localização do hotel é num bairro tranquilo com mini mercados ao redor, onde se pode comprar \"guloseimas\" e tomar café da manhã. Localização tranquila em área residencial, mas distante do centro. O metrô mais próximo fica a cerca de 15 minutos de caminhada.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "birmingham", "Title": "“Clean, cheap hotel”", "Author": "nataliabiggs", "ReviewID": "UR117347580", "Content": "My boyfriend and I are a young couple, travelling Europe on a budget. We found Hotel Globus to be very clean and suited our needs, as it was a basic hotel and the city centre was easily accessible by the tram. There is a Lidl and Netto opposite the hotel, which was handy for breakfast and drinks!!", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Ashford, United Kingdom", "Title": "“we loved Berlin and will be back”", "Author": "upallnight06", "ReviewID": "UR116644347", "Content": "arrived at Globus ramada Berlin late on weds 3rd aug as we had flown in from Brussels ,we caught the S Bahn from Schoenfeld to Frankfurter Alee and then got a tram for two stops and then had a short walk about 3 mins to hotel ,we had a warm greeting from reception dumped our bags in our rooms and popped downstairs for a quick beer with friendly bar staff, when you consider price of rooms we payed £180 for a triple room for three nights which was fantastic value,the rooms were clean and basic and opp hotel were two supermarkets to nip out in the morning and get breakfast rolls etc, we found the hotel to be a good base to explore Berlin as it was quiet and only a few U Bahn stops to Alexanderplatz,if you have the time get the elevator to the top of the Park inn hotel at Alexanderplatz for 3 euros as the view is fantastic, overall Berlin is wonderful great public transport just a few euros and you can travel for 24 hours on public transport and many great sites to visit , a lovely clean city with friendly people and for the ladies head to Wittenbergplatz [ U Bahn ] for the massive department store KA DE WE 8 floors inc the 7th floor for food and drink, will definately come back to Berlin and stay at same hotel", "Date": "August 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kingston-upon-Hull, United Kingdom", "Title": "“Agood clean & Friendly Hotel with large rooms”", "Author": "Ebbie44", "ReviewID": "UR89485014", "Content": "We stayed with Friends for a three day Christmas Market break . We found the Hotel very clean good food and in a quiet area Yes it was pricey but you are in a Euro Zone so we did expect it Water was 4.50 euros for a 75cl Bottle .would have liked a choice of Beers though. Staff were Friendly but the odd smile would have been nice .We enjoyed the Hotel which as been said is only 15 mins to 20 mins walk away . Disappointed with Markets though much prefer the larger ones than lots of small ones", "Date": "December 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berlin", "Title": "“Very good value hotel”", "Author": "originalbenutzer", "ReviewID": "UR70749867", "Content": "This hotel was the best value we could find in Berlin. Located very near to Frankfurter Allee it is also reachable for train-travellers. Friendly staff, helpful when we had for example to change the room. Breakfast is not included (12,50€ p.P.), can be worth it but lots of cafes outside for lower price. Rooms were simple but quiet. No bad surprises for your money.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "UK", "Title": "“Cheap, clean and relatively close to the city”", "Author": "colonelcrow", "ReviewID": "UR69755306", "Content": "Arrived thinking that the Ramada Globus might be in a dodgy part of Berlin or might be too far to the city centre (Alexanderplatz)...but it's not as bad as some reviews might have you believe. The hotel is a 10 minute (easy, one straight line) walk to Magdalenstrasse U-bahn stop, which has trains every 3 minutes into Alexanderplatz - another 5 minutes. It was clean, cheery and safe. The only downside was the lack of air-conditioning in the rooms, which for this particular weekend was a problem...but we opened the windows. If you want a £30 a night, clean, safe hotel and don't mind a wee walk, this is a good bet", "Date": "July 5, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Herts", "Title": "“THINK AGAIN IF STAYING HERE”", "Author": "gunnergirlherts", "ReviewID": "UR53388392", "Content": "We travelled with a group for New Year.The roms were hot,dirty and had fayed towles.The staff were rude and not very plesent. New Years Eve was a total washout.Everything was set up for the Germans. Nothing was done in English so we coudnt understand any of it.As Im disabled It was hard for me to get around and our room was a long way from the lift..There was nowhere to go outside the hotel as it is in the middle of nowhere and we woudnt have felt safe going out on our own anyway.This was not a plesent experence and a waste of money.It seems that Leger Holidays have not done there homework where this hotel is concerned.Give it a wide berth.", "Date": "January 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "uk", "Title": "“Leger and Ramada Globus, suit each other well, both awful”", "Author": "derizzoUk", "ReviewID": "UR52070640", "Content": "Toured Berlin area with Leger and stayed at this hotel. Unattractive but serviceable hotel too far from the sights. Clean rooms but stultifyingly hot. Can't open windows and turned heating off and put air con on full time. Still far too hot and couldn't wait to get out into the cold wind and snow! The food is really dire. Same tinned junk served day after day. Brussel sprouts served at so called Xmas dinner. No-one ate them so undaunted they put them out again, cold, on the hors d'oervres buffet! No-one ate them so they put them out again the next day. Unbelievable. Drinks very expensive, towels frayed and stained. Minimum service, minimum effort all round. Avoid both Leger and Ramada Globus Berlin.", "Date": "December 29, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Sydney", "Title": "“Very out of the way poor quality hotel”", "Author": "xdaisyj", "ReviewID": "UR41121626", "Content": "I stayed in this hotel for 2 nights as part of a large tour group. It is very far from the city, and you need to change trains to get into Berlin itself. It was a 30 minute drive by bus from the city to the hotel, so expect to take a lot of public transport. The hotel itself is quite run down and is clearly in need of renevating. The service staff were ok, but nothing special & were quite rude at times when retrieving things from their safety deposit box. They made a point of putting signs and notices everywhere to put everything in the safety deposit box as they except no responsibility for any theft, yet find it an annoyance to actually put your items in there. Breakfast was quite good. The major issue wiht the hotel for me was the bathroom was not thoroughly cleaned, and the access to the room was awful. The room was on floor 7 which only has 1 working lift that the porter used most of the time I needed to access it. There are only 2 lifts so you wait several times to actually be able to fit in one. Also, there was a massive school group staying on 90% of the rooms of level 7 when I was there, so they were running up and down the halls all evening, making it very noisy. I would not reccommend this hotel for its location especially, cleanliness, lack of features, and lack of effort by the staff to make the stay pleasant. The only convenience is the shopping centre acrosss the street.", "Date": "September 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Merseyside", "Title": "“Feeling hot, hot, hot!!”", "Author": "PeanutDotJU", "ReviewID": "UR18978374", "Content": "We stayed at this hotel for two nights as part of an Archer's tour of Eastern European Cities. On arriving at the hotel it was obvious that it had been converted from a block of flats but was not necessarily unattractive. The rooms were adequately decorated, the only problem being that it was 35 degrees outside and there was no air conditioning at all making it very uncomforable to sleep. It was too noisy to leave the windows open and in any case no air was getting through. The breakfast was ok mainly typical continental. The bar was very nice with pleasant, friendly staff. There is a Lidl supermarket directly opposite the hotel and this may come in handy if you aren't very mobile or keen on walking as there aren't many bars or restaurants in the surrounding area. There is a U-Bahn station approximately a mile away which has a direct line to Alexanderplatz where there are many bars and restaurants (Escados Steakhouse being our favourite!). Overall it is manageable for two nights but can leave you feeling tired due to a lack of sleep and a lot of walking.", "Date": "August 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“The Communist Lifestyle All Over Again”", "Author": "WNNX", "ReviewID": "UR14588626", "Content": "You will definitely feel that you are in East Germany when you venture to this property. It is so far from anything that it detracts from any positives the property may have. It took a 5 minute cab ride (6 Euros) just to get to the Metro/S-Bahn. On top of that it takes a good 30 minutes by Metro to get anywhere worthwhile. The hotel was spartan - no alarm clock, no coffee, not even washcloths. The staff was pleasant enough and they did try to accommodate needs. There was a bar in the lobby that was dingy and LOUD on a Saturday night when all the Poles, Italians and Dutch would kariocke to their hearts content. Overall, this hotel is just not worth it.", "Date": "March 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Plymouth, England", "Title": "“Christmas in Berlin 2006”", "Author": "gw4u", "ReviewID": "UR6539543", "Content": "I disagree with the previous writers. Rooms were clean and comfortable, well up to standard, at least they had two chairs to sit on. Food was excellent although it was a buffet service, this being constantly replenished. Waiter staff was also excellent with dishes being constantly cleared away. The only draw back I could see was it's distance from the Ubahn, though trams and buses were available nearby.", "Date": "January 2, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "", "Title": "“Hot, basic and in the middle of nowhere”", "Author": "A TripAdvisor Member", "ReviewID": "UR5458209", "Content": "I had the misfortune to room here during the World Cup, as all city centre hotels had been booked out, and we had to pay 275 Euros a night to stay here. It is a about 5 kilometres from the Mitte of Berlin, but is located in the middle of a former Eastern Bloc housing estate and industrial area. The rooms were spartan, but clean, but facilities were poor. Despite outside temperatures in excess of 35 degrees celcius there was no air conditioning, nor even a fan. The room was very noisy and smelt of smoke, despite being a non smoking room. The pillows and duvet seemed to be made of a man-made polyester style material making for a very sweaty and unpleasant sleeping experience.", "Date": "July 12, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "St Marys Bay, England", "Title": "“Tourist class transit camp”", "Author": "A TripAdvisor Member", "ReviewID": "UR1757057", "Content": "I had the professional misfortune to stay at this hotel three times in 2002 while working as a driver guide for a british touring holiday company. The rooms are fine, if a little unexciting. The bar is okay but as you would expect, quite expensive. For those guests who wish to use Berlins extensive U & S Bahn network, you have to take a fifteen minute walk to the nearest U Bahn station. MEALS in this hotel are a DISASTER ZONE. What starts as a well stocked buffet is quickly cleared by the first group of guests and because the buffet is too small, the staff can never keep up with demand. The food quality is also questionable at times, menus are also often repeated from night to night. My advice is to eat out, its far better than joining the hotel bun fight every morning and evening.", "Date": "March 31, 2004"}], "HotelInfo": {"Name": "Grand City Hotel Globus Berlin (ehemals Ramada Hotel Globus Berlin)", "HotelURL": "/ShowUserReviews-g187323-d233882-Reviews-Grand_City_Hotel_Globus_Berlin_ehemals_Ramada_Hotel_Globus_Berlin-Berlin.html", "Price": "$43 - $146*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Ruschestrasse 45</span>, <span class=\"locality\"><span property=\"v:postal-code\">10367</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "233882", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/b9/90/b9905587e550799c9573b58b377749a38large.jpg"}}