{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Sofia, Bulgaria", "Title": "“Not so bad, but far away from the center”", "Author": "Rossie_A", "ReviewID": "UR121661670", "Content": "The hotel is far away from the center of Berlin. It is suitable If you have engagements in this part of the city, but it takes one hour and a half to reach the center. The room was OK, but noisy because it looks to the street.", "Date": "December 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Antwerp, Belgium", "Title": "“Lovely !”", "Author": "evitab", "ReviewID": "UR115715148", "Content": "We really enjoyed our stay in this hotel ! The staff is very friendly , and the room was very clean . + The breakfast was totally great , there where many choices. We would definitely go back there .", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Sydney", "Title": "“Quiet location on the river”", "Author": "Travellingschel", "ReviewID": "UR115612240", "Content": "I had a room overlooking the river which made it a very quiet room for sleeping, and also interesting watching the various boats sailing by. The had little extra touches like biscuits, lollies, fruit left beside your bed, and the bathroom had many extra little comforts provided (not always seen in hotels). Free wifi available but only in the foyer for 30 mins blocks. Breakfast not included in the tariff I paid, but had quite a wide choice of food available. Restaurant downstairs. Staff very pleasant and spoke English. As mentioned by others it isn't very close to the town centre, but I noticed a railway station just walking distance.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Far away from city, uninterested staff, nice rooms”", "Author": "Dafne07", "ReviewID": "UR115611861", "Content": "First thing you need to know is that this place is in the middle of nowhere, surrounded by old factories and quite far away from city center. The staff wasn't overly helpful. The internet is for free only in the lobby and only on half an hour password coupons provided by the reception. The breakfast was ok, but not great. The rooms were spacious and clean and the bathroom was big with bathtub.", "Date": "July 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“No food or drink at 10pm.”", "Author": "Mark&Nic", "ReviewID": "UR82033086", "Content": "Stayed 1 night in September as part of a business trip. We specifically booked this hotel as it had free parking that would accept a large van and an on site resturant and bar as we knew that we would arrive late and would not want to go in search of food. The hotel is clean, tidy and has a great breakfast buffet, but when we arrived at 10pm, the restraunt and bar were both shut, the reason given was that there were too few guests to warrent opening them. this forced us to dump everything and head into town in search of food, which at 10:30pm on a Sunday night was thin on the ground. We eventually persueded a curry house to open a little later for us, stuffed our faces and went to bed. This lack of food and drink spoilt the hotel as otherwise, it was perfect. I might stay again, but if I can find better, I will.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Hamburg, Germany", "Title": "“A bit far away”", "Author": "mihailo", "ReviewID": "UR73161394", "Content": "Stayed in this hotel for 2 nights. The hotel is clean and renoveted like most of the NH hotels. Although the trip was private on the second day I had to print couple of work relayted documents. They had a room with internet, printer, etc. I paid extra of course, but everything was quick and efficient. The breakfast was simple, nothing special but the quality was good. The only problem was the distance to the city center. On that day S-bahn staff was on strike, we had to take a bus to get to the center, which took a while. During the night it is noit that easy to get there as well.", "Date": "July 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Helsinki", "Title": "“Good business hotel”", "Author": "keitai", "ReviewID": "UR57958198", "Content": "Room was clean and has everything else you would expect from a business hotel was well in place. Decent breakfast. Only minus is expensive wireless internet.", "Date": "March 7, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Great hotel, but feather pillows!!!!”", "Author": "stoddster", "ReviewID": "UR6445026", "Content": "We were aprehensive about staying in this hotel as we could not find much about the area of Treptow or this hotel, however our fears were not necessary. This hotel is lovely, definetily deserves its four stars. The room was spacious and clean, having all that was necessary and even some extras for a pleasant stay. However they had feather pillows which were not so good for myself and my friend as we are allergic. On asking for alternative pillows we received two more feather pillows. This was probably due to our lack of German, however this was uncomfortable and annoying. The suburb of Treptow is pleasent, about five minutes walk from the hotel is a shopping mall with many shops and a supermarket (and a MacDonalds). Next to this is the train station, which has frequent trains into the city centre or back to Schoefeld airport. Overall, our stay at NH Treptow was pleasant and I would recommend it to anyone who is looking for a small, clean and quiet hotel to stay in.", "Date": "December 15, 2006"}], "HotelInfo": {"Name": "NH Berlin-Treptow", "HotelURL": "/ShowUserReviews-g187323-d233992-Reviews-NH_Berlin_Treptow-Berlin.html", "Price": "$64 - $169*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Spreestrasse 14</span>, <span class=\"locality\"><span property=\"v:postal-code\">12439</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "233992", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/ec/34/ec346b6d30568460b50416710fb3c5bd6large.jpg"}}