{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Good Hotel”", "Author": "mmmc1067", "ReviewID": "UR133926202", "Content": "Our room was comfortable and nice. It is very close to the bus, or train. Nice neighborhood with good sports bars and restraunts.", "Date": "July 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Netanya, Israel", "Title": "“Very nice hotel with beatiful extended suites, that make this hotel the best among others”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR124650268", "Content": "Beatiful location, extended suites, daily clean-up. Once the problem with moving door in built-in wardrobe appeared and was immediately solved by staff. The staff is very polite, fluent in English and always is to our service.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Moscow, Russia", "Title": "“fine hotel”", "Author": "olga g", "ReviewID": "UR123126646", "Content": "Beautiful hotel, great room with internet access, bathroom and separate bedroom. We were surprised by the comfort, which, unfortunately, not able to fully assess due to a cold state upon his arrival from Barcelona. But! The restaurant fed us well, the lobby, we enjoyed an excellent television program about the latest fighting bulls, and forget about your problems, enjoying the peace and quiet in the room. And early in the morning to call a taxi left the airport. Just a wonderful hotel (and there is a bottom bar), be sure to return when we in Madrid. The only negative - a little bit far from the subway, when a suitcase.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Hamburg, Hamburg, Germany", "Title": "“one night”", "Author": "Marco B", "ReviewID": "UR121414992", "Content": "for business across madrid. The position is very good close to Plaza de Castlla. Rooms are large but kind of old style. Beds are ok. Wifi is for free, Breakfast is not the best even if there is a large selction of different things. I would say that the hotel is ok but it is too expensive ( i paid 100 €). People are friendly though and the service is excellent.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“I'd stay there again...”", "Author": "KathyAK99504", "ReviewID": "UR103705261", "Content": "I liked that it was a reasonably priced suite, with room to spead out. It was also within an easy walk of the train station, Chamartin, and to the metro, which gave us easy access to all of Madrid. The decor was worn, but clean. We had a problem with the toilet not flushing, but they came to fix it shortly after we called the front desk.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Very good service”", "Author": "Gerard5", "ReviewID": "UR77895652", "Content": "There was a misunderstanding about the room that we rented. I was sure that it was for three and they had my reservation for two person. So to accommodate us, they put us in a bigger room at no charge and without any arguing. The staff was great in all sense. This hotel is just 30 minutes away from the airport by metro which cost us (for three) 6 Euro. Cab's where asking 30 Euro for a 12 minutes ride. Very well located (between two metro stations). I recommend it to anyone. You can be sure that next year when we will pass thought Madrid it will be our place to stay.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent location, large suite and low price”", "Author": "wedwardes", "ReviewID": "UR67048844", "Content": "I wanted a hotel close to the Chamartin station but not on top of it. The Foxa 25 is just a short walk away and the feel is much nicer than the four star hotel on top of Charmartin station. Several good restaurants nearby. At Chamartin you have the Ave to Valladolid and Barcelona; there are the Cercanias trains there so 3 stops to Atocha for the Ave to Seville. For the airport best is Cercanias to Nuevos Ministerios (one stop) and another ticket on the metro to the airport. Less changing with baggage, much quicker and just a Euro more. Free internet was valuable. Room safe key costs €2", "Date": "June 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Essex", "Title": "“A fortunate find”", "Author": "amateurreviewer", "ReviewID": "UR65376577", "Content": "First time in Madrid, who knows where to stay, what reviews to believe. This hotel was a good find, unspectacular, but solid. It was just the right combination of value for us. It was clean, everything worked OK, breakfast was basic but alright, and the staff were great, especially when I lost my wallet somewhere in Madrid!", "Date": "May 26, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Foxa 25”", "Author": "ErinS7", "ReviewID": "UR47731832", "Content": "Hotel staff were very nice & helpful. Facilities were very nice, our room had a lot of space, it was great! Very close to Charmartin train station & bus services.", "Date": "October 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "cumbria", "Title": "“lovely hotel”", "Author": "gaudens", "ReviewID": "UR18944655", "Content": "booked direct to hotel and checked in straight away without a problem. Hotel was lovely but a little way out of centre, however metro is v close and cheap. Most staff spoke English and helped where necc. Taxi to airport is expensive (40 euros )but is standard price, only 6 euros on metro but didnt run during night when return flight was. Metro recommended only 7 euros for 10 tickets. Hotel room was cleaned everyday and beds were made. Room had seperate bedroom for myself and husband and our son (15 yrs) had a bed made up in the lounge area but was still seperate from main seating in lounge. Had v small kitchen but didnt use so cant comment. Beer garden was nice to sit in for a couple of drinks on a night.", "Date": "August 14, 2008"}], "HotelInfo": {"Name": "Suites Hotel - Foxa 25", "HotelURL": "/ShowUserReviews-g187514-d234289-Reviews-Suites_Hotel_Foxa_25-Madrid.html", "Price": "$64 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Agustin de Foxa 25</span>, <span class=\"locality\"><span property=\"v:postal-code\">28036</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "234289", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/e7/b2/e7b20fd4e0eb5f839ce927d7bd6d10f76large.jpg"}}