{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Not for the british”", "Author": "jon m", "ReviewID": "UR130628676", "Content": "I stayed there for 5 nights in May 2012, on my own, on a works trip, its mainly all spanish tourists no other british and no decent food, the breakfast bar is so small you get more then 8 people in it and you cant move, there was such a que for breakfast on the monday that i did not have any the rest of the week and the staff where rude. My room was ok, TV did not work and the decor is something from your granny's living room. when the people in the next room turn on the water for a shower/wash the pipes make a right noise and when you turn off the water it sounds terrible which is not good if you need to sleep. Personnally I would not stay there again, but if you are british and going to madrid ( not impressed with Madrid, Barcelona is much better and has a beach as well, and is set up for british tourists, unlike madrid, I did not find another british person in madrid) if your just going for a lads/girls holiday the hotel would be ok just for sleeping, but its not a place I would want to relax in.", "Date": "May 26, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Great location, nice home in Madrid”", "Author": "Ritva189934", "ReviewID": "UR119444261", "Content": "The name of the hotel is now Espahotel Gran Via. The location is excellent. Cleaning services have been excellent. They have washed up all dishes every day and the Internet has worked. We did make our own breakfast daily after the first morning. The restaurant was empty and the breakfast not very delischous. The buffet breakfast costed eight Eur. Also the internet costs eight Eur pro day. There are lots of steps when coming into the hotel, which is not very nice. But the location was so good that you hardly can imagine better. There are many really good restaurants near by, the sight seeing buses drive along Grn Via and to shopping areas only a short walking.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Quebec", "Title": "“Quality home at reasonable price”", "Author": "panasia", "ReviewID": "UR119081244", "Content": "We recently spent 4 nights at this hotel. Everything is OK: cleanliness, bedding, reception, location, price. This hotel is on the main boulevard, close to a lot of sites to visit, 2 minutes from metro station. If we are back to Madrid, we would be staying again at this place. Some small negatives points: AC is noisy, Wi-Fi is not free (3 Euro an hour!), and there is only one long pillow across the bed.", "Date": "October 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "TEL AVIV", "Title": "“I'LL BE BACK FOR SURE”", "Author": "PAULATelAviv", "ReviewID": "UR114991044", "Content": "The location is great,could not be more central.The room is big and clean,stuff very helpful(even more then in the other hotels). If you need any help,or just need tickets for flamenco show,you can ask at the reception,and you'll get all you need. I really loved the place,and I'll be back !", "Date": "July 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Overall great choice, some small improvements to make it brilliant”", "Author": "Too_Much_TM", "ReviewID": "UR88830688", "Content": "Agree with the other reviews regarding the excellent location, kitchenette, clean room, great size, enough cupboard space, grocery store at the bottom, lots of eating places, starbucks and mcdonalds all around What could be better: - My side of the bed was terrible (yes we realised that 1 side was ok and the other not!) had back pain from the hard bed. Ended up sleeping on couch which was better but not great. - although we were high up on Sat nite we could hear noise from street at night - no kettle or toaster. had to make toast in a frying pan! - housekeeping not available in the weekend?! happy with overall choice :) just speak to them before hand about a better bed", "Date": "December 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seregno, Italy", "Title": "“good choice near plaza de espana”", "Author": "papasote", "ReviewID": "UR84131512", "Content": "centrally located near plaza de espana - a lot of eating choice near the hotel, but you have to select very carefully - staff very helpful, they gave us the room few hours before check-in time without any problem or surcharge - when leaving you can leave luggage without any surcharge.", "Date": "October 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Canada", "Title": "“Good Hotel,Good Location”", "Author": "Jimmie09", "ReviewID": "UR48428085", "Content": "We had a very nice room at this hotel - tons of space! Staff were helpful. The breakfast had nice selection for a continental breakfast. Good location - close to Plaza de Espana - which we wanted. Restaurants, shops close by. Good place to stay!", "Date": "November 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Great location, but...”", "Author": "ms0758", "ReviewID": "UR11200288", "Content": "We stayed at the GranVia 65 (Espa) Hotel 4 nights in November. We are sorry to say that the only assets are its location and food prices in their restaurant. Check-in is on the first floor, no help with luggage despite several stairs that need to be negotiated. They helped with moving luggage from the check-in counter to the room (where there is an elevator). But on check-out there was again no help with getting the luggage to street level. The attendant just removed our luggage from the storage room and went back to the counter, although I was alone with 2 suitcases and 2 extra bags. We reserved a suite, but were given a studio (that was corrected after we complained). Our reservation was for twin beds, but we got a double, with poor, worn-out mattresses. The rooms were clean, living room had a good size, but bedroom was small. Except for the bed, the furniture was OK, but rooms could use a make-over. There was only one small TV in the living room, none in the bedroom (no English channel). The bathroom was good-sized with 2 sinks, but only had one of those wall-mounted hairdriers that take forever to dry shoulder-long hair while you negotiate the best way to hold on to the ever hotter plastic handle. Shower water was forceful, but the water temperature varied and due to the small glass door on the bathtub there was no way to keep the bathroom floor dry when taking a shower. It had a small kitchenette, but no coffee-machine or water heater, and we had to boil water in a pot for instant coffee that we bought around the corner. Internet connection or breakfast were not included despite the rather steep room price, and the wireless connection (on the 5th floor) was not reliable with frequent undesired disconnects, e.g. while responding to an email. Our plane left 6 hours after check-out time, but we were told that we could not stay an extra 2 hours without having to pay for a whole additional day. The hotel does not have a lobby where you could sit and spend the extra time waiting for an early evening flight on a windy, cold departure day. One would expect a bit more leniency from a place where you just spent 4 nights. All in all not recommendable compared to other hotels in the neighborhood.", "Date": "December 2, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Great hotel, pirce & location”", "Author": "A TripAdvisor Member", "ReviewID": "UR4619797", "Content": "Having stayed in a 4 star hotel the previous year in Madrid and found the room tiny, this was a refreshing change - the room was large and very clean. The addition of a small kitchenette was a great idea. The room service and mini bar prices were exceptionally cheap The location is great - within walking distance of everything and it was great value for money Our return flight back to the UK was cancelled and the hotel held a room for us and helped us with trying to phone the airline and via the internet to find out some more details - nothing was too much trouble We stayed an extra night and were given a suite at no extra charge Would definitely stay there again", "Date": "March 15, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "2", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Vancouver Island Canada", "Title": "“Great location and reasonable price for Madrid”", "Author": "Rockhampton", "ReviewID": "UR4455840", "Content": "I found the Gran Via 65 on the TripAdvisors website and totally agree with all that is presently published there. The location is very good, for those who want it, an internet cafe is a block away. Good basic VIP restaurant next door,for car rental Avis and Europcar are across the street. One odd anomaly was that we wanted to book our last night there (three weeks hence) before leaving to fly back to Canada but we were told that it would cost us 35 Euros more than we were presently paying because we got an \"internet rate\" for our original booking. So...yes you guessed it! I had to hoof up the street to the internet cafe and book my room on a computer on the hotel's website and sure enough got a cheaper rate than the front desk was prepared to offer. Go figure that one! Not only were they getting less money from the internet supplier but they also would have had to pay a commission too! Annoying, stupid and pointless!!", "Date": "February 13, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Providence, RI", "Title": "“#65 Gran Vía is a good location”", "Author": "BTPVDRI", "ReviewID": "UR3534757", "Content": "I agree with another reviewer who had a hard time figuring out the real name of this hotel. The sign on the door says one thing and the web sites say something else, plus the hotel desk is up one floor, so the street door does not look much like a hotel entrance. But it's there, at #65, and worth a visit. Comfortable rooms, and we used the kitchenette. Good service. They want to be paid upfront. Simple but adequate breakfast on the premises. It's an excellent location. The MadridVisión tour buses stop practically out the front door, it's an easy walk to the Palace, the Puerta del Sol, and the Plaza España. We also walked as far as the Prado, a decent hike but certainly not impossible for normal, healthy people.", "Date": "June 6, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Great location”", "Author": "Lukehead", "ReviewID": "UR1684750", "Content": "Not sure what the name of this hotel is - my itinerary said Apartamentos Gran Via, the brochure said Gran Via 65, the sign over the door said Espa Hotel. Whatever! It was a great location for walking to the cathedral, Plaza Espana, the palace, theatres, restaurants and one block to the Metro. Fish/fruit market one block over. El Corte Inglese and lots of shopping just a couple blocks away. Hotel room very nice - small kitchenette, nice marble bath with reaaaallly long tub for a full boby soak, great shower, 2 sinks. No view but no noise either. Breakfast room small but adequate. Limited menu but enough to get us going for the day and a place for a tinto vino after a long day in the rain. If you're planning a trip to Spain for the coming year, go in confidence that the Rain in Spain allotment has been filled for the year!", "Date": "March 1, 2004"}], "HotelInfo": {"Name": "Aparthotel Gran Via 65", "HotelURL": "/ShowUserReviews-g187514-d234286-Reviews-Aparthotel_Gran_Via_65-Madrid.html", "Price": "$59 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Gran Via 65</span>, <span class=\"locality\"><span property=\"v:postal-code\">28013</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "234286", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/da/86/da86bbe00b7953b505536cbfa18367258large.jpg"}}