{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wrexham, United Kingdom", "Title": "“great customer service”", "Author": "NerysJ66", "ReviewID": "UR137439737", "Content": "Located in a great area within easy walking distance of Plaza Santa Ana and Plaza Mayor. Arrived to find we were given a smallish room with views of air conditioning units but upgraded to second floor suite with double balcony within minutes - staff were all pleasant and happy to help with any questions we had. Would definitely stay there again.", "Date": "August 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Fabulous Hotel!”", "Author": "JimBobCam", "ReviewID": "UR136549719", "Content": "My mother and I have just returned from a three night stay in Madrid and what can we say...what a wonderful trip!! Being two women on our own we were slightly nervous about our trip however we had nothing to worry about. We got the airport bus to the Plaza de Cibilis which was only a five minute walk from the hotel. We followed the hints provided on this website and found the hotel easily. We stayed in room 401 and it was wonderful, really big and the air con was great - a dad noisy on Saturday night but it was only people having fun and not enough to disturb our sleep. We loved the little kitchen which was handy for breakfast. No complaints what so ever about the hotel. The location is very central and we didnt have to use public transport once - we also felt extremely safe walking around at night. The little tapas bar \"Viva Madrid\" on the same street as the hotel was a great stop for lunch and we would recommend a lunchtime sangria on Plaza Santa Ana.", "Date": "August 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“Great small hotel!!”", "Author": "m0therdaughtertrip", "ReviewID": "UR136436602", "Content": "I have been traveling to Spain for over 40 years and staying at this small hotel was a great experience. My daughter and I stayed for a week at the hotel. We felt welcomed and secured. Check-in only took about 4 minutes. We stayed at room 203. It was big, very clean and comfy. The AC worked perfectly. The room had a big bathroom with a tub, towels were soft and big; there was a seating area and a big bed in a separate room. The well equipped small kitchenette, safe, big closet and two small balconies were very helpful. Even though smoking was allowed in our room, there was no cigarette smell at all. The hotel is located very close to Plaza de Santa Ana, Plaza del Angel and Calle Huertas and, within walking distance to Puerta del Sol and Gran Via. The hotel has free wi-fi and at the lobby there is a coffee machine. I disagree with some of the reviews that affirm that it gets noisy at night. The balcony doors had 4 inches soundproof glass and thick wood shutters. We slept well and did not feel the noise at all. The staff was friendly and helpful regarding our wake-up calls, taxies and directions. I will recommend Suite Prado to all my friends.", "Date": "August 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hong Kong", "Title": "“Nice little hotel”", "Author": "miraclen", "ReviewID": "UR135165501", "Content": "I stayed on the penthouse on the fourth floor for 4 nights. The room was big and comfy. There was a seating area with sofas, a well-equipped small kitchen and a working table. The size of the washrooms varies. On the first night I stayed in room 402, it was huge, but it was much smaller in 403. It was basically quiet. I didn't find it noisy at all during my stay maybe because I was on the fourth floor. All the sights are within walking distance. Remember to go to Museo del Prado from 1800 to 2000 (every day) and save yourself 12 euros each for the admission. There were lots of people going there during the free admission hours but still I still managed to get in within 10 minutes. Lunch at Plaza del Mayor is just around 10-15 euros per person. And it is just a 15-minute walk from the hotel. The suckling pig dish in Botin Restaurant near the Plaza del Mayor is excellent. It is crunchy on the outside and juicy inside. It costs about 22 euros per portion (around 1/4 of the pig - good for 1 person but they can cut it into two pieces if you share). The sangria there is also great and tastes unique but is quite strong. Remember to make a reservation before you go because it is always full. Reservation can be made online through their website. I enjoyed Madrid so much because of my stay in Hotel Suite Prado.", "Date": "July 23, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Edmonton, Alberta", "Title": "“Terrific Hotel, Perfect Location”", "Author": "tamblers", "ReviewID": "UR133789382", "Content": "We were at the Suite Prado for a week. The room was very comfortable, more like an apartment. The staff were friendly and helpful. It's location, near the centre of old Madrid, along with very reasonable rates made it perfect for us.", "Date": "July 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Manila, Philippines", "Title": "“Loved our stay here”", "Author": "trecev", "ReviewID": "UR132705739", "Content": "We loved our rooms at the Suite Prado hotel. The suite was big with all the amenities that we needed in a hotel. Plus factor was the little kitchenette, which we used to heat our croissants and make our coffee. Bed was big and comfortable. We loved the little balcony where we could look down on the quaint streets of Madrid. Two thumbs up for the front desk staff. They were very helpful in giving directions and giving advice on where and what to do in the city. They even helped us print out our boarding passes. There are a lot of restaurants and bars within walking distance from the hotel. We had a hard time looking for the hotel though when we first arrived but once you find your hotel, navigating around the area is a breeze. There is also a small grocery just across the hotel where we buy our water, croissant, fruits, etc.. The restaurant beside the hotel also serve good food. It could be a little noisy at times since there are a lot of bars along the street but after the first night, we got used to it. I would truly recommend this hotel to other travelers.", "Date": "June 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lake Dallas, Texas", "Title": "“Tucked in around the corner from Plaza de Santa Ana”", "Author": "Missy P", "ReviewID": "UR132369623", "Content": "This is a charming little hotel in a great location in Madrid. The room was very clean, spacious and quiet. The front desk staff is what made our stay very special. They were so helpful with advice and directions. We needed assistance with our flights and the man at the front desk made all the calls, checked us in and printed our boarding passes! Staff is available 24 hours and the main doors to the hotel are locked at night. If you come in late, just ring the bell to get in. We were very comfortable here and loved being a short walk from lots of fun bars and restaurants!", "Date": "June 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Malaysia", "Title": "“Good location and price”", "Author": "humanH1N1", "ReviewID": "UR132359697", "Content": "After completion of booking (with booking.com) for 2 nights my card was debited and credited 100 euros the same day so I lose a few euros due to currency exchange difference. It seems this is the practice of some hotels and a complaint thru booking.com did not result in any refund from the hotel. I have no complaints with Suite Prado- Good price for a spacious clean triple room with adequate kitchen facilities, located near so many nice eating places. Santa Ana/ Puerta Del Sol all within walking range. At night streets nearby well lit and busy till late. Appeared safe to walk around till 11pm +. Sleep not disturbed by any noise. The receptionists were all cordial and helpful and spoke reasonable English. We had no problem finding the hotel as the taxi was familiar with Calle del Prado and Calle Ventura de la Vega.", "Date": "June 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oakland, California", "Title": "“Roomy, clean and great location!”", "Author": "Claudia M", "ReviewID": "UR131423218", "Content": "More modern than we usually like, but excellent! No restaurant at the hotel, but plenty in the area...Walking distance to all the places we wanted to go...just a couple of blocks to The Prado Museum and an easy walk to the Royal Palace...and I had a knee-length boot (cast) on one foot. The day we checked out, we weren't catching a plane until that evening and the hotel held our luggage for us. They were very friendly and accommodating. I would recommend it to anyone.", "Date": "June 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Felt at home”", "Author": "MarcusHBrisbane", "ReviewID": "UR130665645", "Content": "We booked early and were upgraded for free to the suite. Room was large and quiet with dinning room, tv room with 2 sofas and large bed and bathroom. Location was great. Staff are very helpful. We had 2 balconies. We'll stay here again for sure.", "Date": "May 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "York, United Kingdom", "Title": "“Suite Prado in wonderful Madrid”", "Author": "Aliye", "ReviewID": "UR129758948", "Content": "Suite Prado Hotel in wonderful Madrid! Visited this beautiful city with my partner for four days beginning of May, if you like city breaks this is for you! We stayed at Suite Prado a small hotel but which was very central for everything; the rooms were large with a lounge, bedroom, bathroom and a small kitchenette. It was clean and comfortable although the small kitchen needed attention, chipped cups and dishes….not nice! It is not the Ritz but you get what you pay for, if we go back again to Madrid we would stay there. Transport in and around Madrid is fantastic and relatively cheap, if you are over 65 you can get reduced rates on the tourist buses as well as some attractions. Parque Retiro is lovely as are the botanical gardens, l could go on as there is much to see however one more and that is Atocha Rail station, it’s worth a visit. Whilst there we took a trip on the Renfe train to Toledo, take the train and travel in comfort, there is a bus at the station to take you into Toledo or walk if you are energetic, a tourist bus is also available that will take you around various interesting sites. The station at Toledo deserves a mention, take a look it’s very interesting.", "Date": "May 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas, NV, USA", "Title": "“A Hidden Gem”", "Author": "Daniel L", "ReviewID": "UR128630916", "Content": "Our travel agent recommended and booked this little jewel for us for our short stay in Madrid. Tucked away on a narrow little back street, it's no more than a 15 minute stroll in one direction to the Prado, Thyssen-Bornemisza, and Reina Sophia Museums & the Botanical Gardens. In the opposte direction it's another 15 - 20 minute amble to the Puerto del Sol, Plaza Mayor and the Plaza Oriente/Royal Palace area. Lots of fabulous little toscas and restaurants all over the area, as well as easy walking distance to our two favorites, Casa Paco for the best steaks and El Sobrino de Botin for the best roast suckling pig. The hotel itself is quaint but very comfortable, clean and quiet. Very helpful staff who answered all our questions.. Would definitely stay here again and recommend it to others!", "Date": "April 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pordenone, Italy", "Title": "“A perfect flat to visit Madrid”", "Author": "CorradoD72", "ReviewID": "UR125387858", "Content": "The hall is very small but access the room and you'll be' happy. A real flat with a lot of space, nice bathroom, wide LCD tv, but, above all, you're located strategically to visit Madrid (only a brief walk to reach the Prado...) but, at the same time, you lie in a lively area for dinner and nightlife, without being disturbed by noises since rooms are well soundproofed. We didn't experienced breakfast because our rate was for sleeping only. The hotel can be reached easily from Anton Martin metro stop.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kendal, United Kingdom", "Title": "“Lovely hotel, excellent value for money”", "Author": "Happylittlebear", "ReviewID": "UR125360914", "Content": "Stayed 4 nights here. Suite was very spacious, clean and well stocked. No view unfortunately, but an external room could've been noisey over the weekend perhaps, so it was no consequence really. Would definietly recommend it, very central, easy walking distance to all main attractions in Madrid, fantastic bars/restaurants just round the corner, welcoming and helpful staff.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Excellent.”", "Author": "jeremybecker", "ReviewID": "UR124145048", "Content": "Well located within walking distance of all the main sights in central Madrid, we received a beautiful spacious suite (separate bedroom) with kitchenette, perfect if one doesn't like spending every meal eating out. Since we stayed a week, we were able to buy delicacies from one of the markets or small grocery stores, then return to the suite to relax. When we did feel like eating out there were masses of restaurants, bars and cafés of every style and category in the streets surrounding the hotel. Warmly recommended is El Lacon, right next door! The staff all spoke excellent English and were warm and helpful in every way. We highly recommend this hotel - and Madrid - to anyone looking for an urban continental break, with fabulous art museums round the corner!", "Date": "February 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Great place Great location”", "Author": "ManchesterJetsetter", "ReviewID": "UR123360762", "Content": "Great location, handy for every thing. 5 minute walk from Sol metro station Very clean, spacious rooms with very friendly staff Hair dryer in room toiletries provided including razor tooth brush and sponge! Breakfast can be arranged 9 euro each. Shop facing for milk wine water etc Top tips: Mark on map before you go that way much easier to find Great pub called fountain of gold (ora) down street with dunkin coffee on corner great drinks and free tapas", "Date": "January 20, 2012"}, {"Ratings": {"Location": "5", "Overall": "3.0", "Value": "5", "Service": "3", "Rooms": "3"}, "AuthorLocation": "San Francisco, California", "Title": "“\"Suite spot\" in Madrid”", "Author": "reyledda", "ReviewID": "UR118035343", "Content": "True to its name, we did get \"suite\" which consisted of a living room, bedroom, bathroom, and a hideaway kitchenette (which was a pleasant surprise - although we ended up not using it). The location is really close to the Prado and to great restaurants around the Santa Ana Plaza. Closest Metro is Sevilla (which is just one stop away from Sol). Overall our experience was great. Our suite was on the 3rd floor at the back, so it offered no views, but was insulated from any street noise. You do get the footsteps from the floor above you, but it was a minor annoyance. Not fancy, just the barebones, but it suited us just fine.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Frankfurt/Main", "Title": "“Friendly and good service”", "Author": "juncool", "ReviewID": "UR117945423", "Content": "It was a-few-day stay in this hotel during a hot summer time started. - To find the hotel : it's a quite difficult. Should see each door of each building. - Hotel : the reception welcomed us very friendly when we arrived in a late evening. Thanks to him, we could stay with cosy feeling. It seems an apartment building was renovated for becoming a hotel. When we visited there, a very old lady came and said that she lived there before. It was a nice story. - Hotel room : It's not new and felt not super clean (but enough clean) but enough spaces and comfortable. (stayed 4th fl.) The hotel kept the room temperature stably for us. Thanks! But people drank/walked outside loudly till early morning on weekend. If not open windows, it'd be ok personally thinking. - Room service : Seems nothing?! - Breakfast : At each room according to the reception, so we did not take it at the hotel. - Place of the hotel : It's in the millieu of Madrid and we can enjoy to eat, sightsee etc. easily.", "Date": "September 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kansas City, Kansas", "Title": "“Good location, clean room”", "Author": "bethandchuckd", "ReviewID": "UR108946756", "Content": "We stayed here in early May for 3 nights. It's a full suite, a lot of square footage with a small kitchen, sitting room, bedroom and bathroom. Great location for walking or taking the subway throughout the city. We walked a lot, but never thought any place was inaccessible. Never turned on the TV, but the bed was pretty comfortable and there were light blocking curtains/shades that allowed us to sleep until late in the morning. Other travelers commented on street noise which I could see being a problem. We were on the second floor and you could hear people in the restaurants below us. However, we downloaded a \"white noise\" app on our phone and slept like babies. That or earplugs would probably do well. Another tip for the Madrid subway we wish we would have known: buy a pass for a few days or however long you need. But if you're traveling with someone, just buy one and pass it to the person behind you in the turn style. We saw multiple people doing this on the subway and it would have saved us a few euros.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "ann arbor, mi", "Title": "“Terrific location and even better hotel staff.”", "Author": "mifflin99", "ReviewID": "UR103488881", "Content": "I was very, very pleasantly surprised with this hotel. The location is wonderful- easy walking distance to many landmarks. The hotel staff was particularly wonderful- professional, helpful, friendly and efficient. I couldn't have asked for more. The room (301) is terrific with a small kitchen, living room, separate bedroom and a small dining table. The street has many restaurants to choose from- La Trucha -right down the block- is excellent. The street was not quiet but the windows and shutters enable you to block out any noise.", "Date": "April 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“Good hotel in great location near prado; but can be noisy”", "Author": "mclpcm", "ReviewID": "UR102921620", "Content": "Pros: Good hotel, well organized room; near location; great value; nice in-room breakfast Cons: Can be very noisy depending on room; no restaurant in hotel; lift is very small", "Date": "April 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great location and nice rooms”", "Author": "sacullucas", "ReviewID": "UR93892605", "Content": "Location is great: close to the Prado museum and Puerta del Sol (check in Google maps always). If you have small kids, location is critical since they can walk much less than you. Rooms are spacious (for European standards) and clean. We are four and were very comfortable. The room we took has a kitchenette, but we didn't use it. The desk employees were helpful to us by giving indications. This is a good hotel, but it's not luxurious. It is very practical for a family. We were very pleased with our stay.", "Date": "January 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Nice staff but far from 4-star”", "Author": "michaelb119", "ReviewID": "UR90581666", "Content": "I'm not sure what qualifications gives a hotel 4 stars, but someone needs to reevaluate it. This is not a 4-star hotel. While the room was very spacious, it was tired and worn. I didn't care about that so much as the price was very reasonable and the bed surprisingly comfortable. What I hated was that wifi is advertised as a feature and it never worked my entire stay. Since I was also doing business, it was a prerequisite when I chose a hotel. Then, one night the elevator didn't work. The staff was very nice, but all you get is a \"sorry\" when something doesn't work. Sorry, but that's not good enough. If you stay here, get a good map because the place is also not easy to find. If you are looking for a place to just sleep and don't care about amenities (or an occasional broken elevator), you'll be fine. If you are expecting 4-star accommodations, you won't get it here.", "Date": "December 23, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Mission Viejo, California", "Title": "“Good location, nice staff...”", "Author": "reza92692", "ReviewID": "UR89284261", "Content": "We stayed 3 nites during Nov 2010 , wife , one teenager and one young one. There was 2 rooms , so kids took the sofa bed. Nice and big room. Bathroom was very clean. There is a small kithchen and a fridge. Helped us to cook breakfast , so saved some money not eating outside. There is a small convenience store right outside, wehere you can buy bread, milk, eggs and basics. The front desk staff was great and helpful. There is a Indian restaurent right outside, if you like curry and stuff. The location is fantastic, quite street in the middle of the city. Multiple metro stations closeby, you can walk to Prado museum, Plaza mayor etc. Will recommend it. The taxi driver got lost first day, so you want to know atleast some landmarks before you go there and tell it to the cabbie.", "Date": "December 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vienna, Austria", "Title": "“Very good, and I liked it, but...”", "Author": "Budapest09", "ReviewID": "UR83437602", "Content": "Definitely, needs some renovations, but not big ones. I had a very very nice corner suite (Room 302), and I guess it is probably the best ratio location / size / price you might get in Madrid. PLUS: Location, Size of Rooms Decent price, including breakfast Kindness of staff Very good beds MINUS I would avoid the rooms on courtyard, quiet but very dark! Noise inside the street, but when you close the window it is OK, and you are in the centre of Madrid! What would you expect! No international channels on TV !!! Kitchen needs renovation Room needs partial renovation Fungus on batroom joints You have to change to the next hotel for the Breakfast They have no clue about cooking scramble eggs. It is not an overcooked omelette cut in pieces! Hopefully, there was a nice spanish tortilla!", "Date": "October 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sportcity", "Title": "“No better value”", "Author": "RiuMan", "ReviewID": "UR83251244", "Content": "Although the amenities are sparse, this place was fabulous. It is on a street in a great location for those who want the ambience of Old Madrid and the convenience of being able to get to any destination within 20-30 minutes. It is located on a quiet street and our room had 3 balconies that gave us a 180 degee view of our neighborhood. The staff was warm and friendly beyond our expectations. This is not the place for you if you want to be pampered with luxury, but for my spouse and I it was perfect.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kiev, Ukraine", "Title": "“Perfect hotel for a very fair price”", "Author": "Wetrick", "ReviewID": "UR80148503", "Content": "We stayed for 4 days in this hotel with my wife and 3 years old daughter. The good things: 1. We came 7 am without haveing early booking (normal check in 3 pm) but got the room instantly! (My daughter was very happy) 2. The room is realy clean and big enough for us. 3. The TV was with all needed connection so i could connect my laptop via HDMI and watch favorite cartoons:-) 4. Free wifi all over the hotel. 5. My daughter need special diet, so we asked to make a soup - no problem and we haven't been extra charged for delivery of this soup to the room. 6. Cosmetics in the bathroom are very good. Rain shower also 7. The price is excellent. We've been last winter to Paris raddisson sas - it was terrible. Also they asked almost 600 euro per standard room with breakfast. The only bad thing was that almost all of the kitchen personnel was ill, so we could go to eat in a hotel.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“What a great surprise!”", "Author": "choclo_265", "ReviewID": "UR71250692", "Content": "We didn't have many requirements when looking for a hotel in Madrid, just AC and a good location. And what a great location it was. Coming from Barcelona we stayed in a prime spot and this was kind of tucked away and quiet which was such a relief. It has such a nice vibe to it. We reserved a basic room but somehow got a suite which was fabulous- marble bathroom with dual sinks, 10 ft ceilings, double doors, etc. The AC was a godsend sometimes it was too cold. The beds were awesome we slept so well. The people at the front desk were beyond helpful. When we got there a woman grabbed a map for us and circled everything important and told us the best way for everything. We were less than 15 minutes away (walking) from the museums, parque del retiro, puerta del sol, plaza mayor and about 20 minutes to the royal palace. It's literally in the middle of everything.", "Date": "July 17, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Aiken, SC", "Title": "“not worth the money”", "Author": "tomcataiken", "ReviewID": "UR15385146", "Content": "We stayed for one night at this hotel and were grateful it was such a short stay. Although clean, the hot water ran out after one shower and someone in the room next door SCREAMED for hours as we tried to sleep. Yes, the rooms are spacious and there are lots of little toiletries in the bathroom, but how about coffee for the coffee pot in the kitchenette? And certainly hot water would be a big plus!", "Date": "April 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Puerto Rico", "Title": "“Great Familly hotel”", "Author": "bmarques", "ReviewID": "UR8101631", "Content": "I chose this place based on reviwes and its location. It was GREAT! I traveled with my 2 kids (1 & 4 yrs.) and wife. The room was huge. More than perfect for families. We had our own bedroom and a living rm. for the kids. The bathroom was big & clean. I would recomend this place to any family. It is very close to the mos imp. sites, museums & train station. Lost of good nearby restaurants. A bargain in Madrid.", "Date": "July 11, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Merseyside", "Title": "“Looks recently renovated and is close to the Madrid action!”", "Author": "wirraldee", "ReviewID": "UR8071917", "Content": "We stayed for 3 nights in Suite 102 ,which seemed recently renovated with modern and quite funky furniture. Air-conditioned and with a small fridge, the accommodation is quite expensive albeit you get a bedroom and a good sized sitting room (that can take 2 camp beds so 4 can stay as we had). The location is great for all the bars and restaurants in the Santa Ana and Puerta del Sol areas of the city. No kitchen anymore in the suite which is no loss given the reviews I had previously read about the small size of the kitchen. Anyway there are plenty places to eat close by. We stayed midweek and the outside noise was not a problem as the room has double glazing and shutters.", "Date": "July 7, 2007"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Big room, clean, noisy”", "Author": "erichschlaikjer", "ReviewID": "UR5049261", "Content": "I spent last weekend here, two nights at about EUR 100 each. It was booked by some friends from the US on an academic trip with their daughter. Their room was a triple, but about the same size as mine. Their one criterion for choosing a hotel was that it have a wireless network, and they were assured that Suite Prado did have one. But in fact, they were just installing it, and it would be working \"soon, maybe next week.\" Oh, well. My room was big, and clean, though the furniture was worn. The bathroom was clean if smallish. There was some light from the windows (3rd floor). The kitchen was a surprise, but I used only the fridge for my manchego and chorizo purchases. It was supremely noisy. For some reason this did not bother me too much. Maybe the afternoon naps and then the heavy drinking and eating till 1am made me tolerant, but the noise really did continue at top pitch until 4am or so. There is some kind of sex-themed restaurant on the adjacent street, and you can imagine the crowds that that drew! Speaking of restaurants, the Argentinian steak place was great, but you need to reserve. The staff were friendly enough and spoke English ok. The location can't be beat in terms of museums and tapas-gorging.", "Date": "May 11, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "san antonio", "Title": "“bad experience!”", "Author": "susanwhite", "ReviewID": "UR4160480", "Content": "Just returned from a long awaited trip to Spain in early Nov. Had reservations for 8 nights at Suites Prado, but ended up only staying 1 night! We reserved a non-smoking suite, which the hotel supposedly offers, but all upholstery and the bed absolutely reeked of smoke.Staff claimed they had no control over this problem, even though there were ashtrays scattered throughout this \"non-smoking\" suite. We wanted a kitchen mainly for breakfast, but the kitchen was completely bare of essentials, which they will furnish only for extended stays. There is no table and chairs, only a desk with 1 chair! We did move to another suite, but were still unhappy, as all bathrooms, while well appointed, are extremely small. This property is advertised as 4 star, but we did not consider it above 3 star at best. However, all rooms were scrupulously clean, and the location is good. If you really want to cook, there do not to seem to be any good stores nearby. Beware of making reservations if you are not sure, because they will definitely charge you if you do not cancel ahead of time! We left with our luggage, not knowing where we were going to stay - a very bad feeling! However, we have learned to have back-up information. Ended up staying at the Liabeny, a wonderful 4 1/2 to 5 star property, which we would highly recomend for cleanliness, comfort, and service. Also excellent location. Keep on traveling!", "Date": "December 4, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Jensen Beach Fl", "Title": "“Great Location...Some Concerns”", "Author": "DonofJensen", "ReviewID": "UR2817245", "Content": "This facility is located on a pedestrian street about 1 and 1/2 blocks from Plaza Santa Ana. 5 minute walk to Puerto del Sol. Great area for Tapas and shops. Rooms at this facility are roomy if a bit worn. They are clean. There are no facilities here. Do not take a room on the street if you value your sleep. There is a disco directly across the street and several bars on this block. Had to change to an interior room after the first night and it was quiet.", "Date": "November 10, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "San Diego", "Title": "“There are better choices”", "Author": "Powell55", "ReviewID": "UR2204560", "Content": "Almost IMPOSSIBLE to find. Even the local cab drivers were stumped. The street in front of the Hotel is smaller then an alley. The best part was the location, near the Westin (and the action). But the room? YUCK! The \"Suite\" was smaller than a Motel 6, the carpets and curtains were filthy. The bathroom was so small, you had to step OVER the toilet to get in and out of the shower. The staff was helpful, but if you do not know conversational Spanish you may have some trouble. There is only one person on staff at any given time and the skill level of their English is hit or miss. While less expensive than the Westin, next time, I'll spend the extra bucks for an upgrade, or try my luck at the Best Western. We talked to some people who stayed there, and they were quite pleased. Believe me, it will be worth it.", "Date": "June 18, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Best Times”", "Author": "A TripAdvisor Member", "ReviewID": "UR1154575", "Content": "I was in Spain last month and I stayed at Suite Prado Hotel in Madrid. Apart from the location of the hotel which is excellent [near the center in St. Anna Plaza!] it is very well kept, beautiful room with a very nice veranda overlooking the busy streets. I was very impressed by this hotel although at first sight one would think it's not that modern but from inside it's renovated and small and clean..........simply what I needed to have a smooth and relaxing vacation. Thank you Suite Hotel Prado for making my vacation very memorable! Will I stay there the next time I visit Madrid???????? DEFINITELY!!!", "Date": "July 31, 2003"}], "HotelInfo": {"Name": "Suite Prado Hotel", "HotelURL": "/ShowUserReviews-g187514-d234290-Reviews-Suite_Prado_Hotel-Madrid.html", "Price": "$109 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">C/ Manuel Fernandez y Gonzalez 10</span>, <span class=\"locality\"><span property=\"v:postal-code\">28014</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "234290", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/b2/73/b2732d20588d5c4b265dbe149cb5ea464large.jpg"}}