{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Derbyshire", "Title": "“great hotel for a short break”", "Author": "JoolsDerbyshire", "ReviewID": "UR128006974", "Content": "Stayed at this hotel for 4 nights in April. Excellent central location. We didn't feel unsafe or initimidated at all even returning to the hotel at midnight. Stayed in room 102, triple room with 2 very large singles pushed together and a separate single. This room is at the front of the hotel with a small balcony onto the Rambla, excellent for watching the world go by. The Rambla was (as we expected) noisey 24 hours a day but the double glazed french windows onto the balcony did a really good job of keeping the room reasonably quiet even on the noisiest of nights!! The room was not large but clean and nicely furnished with all linen changed daily. Got a deal including breakfast which we all really enjoyed. Staff were really friendly and professional. I would not hesitate to recommend this hotel.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "England", "Title": "“Location, location, location!!”", "Author": "SDowns09", "ReviewID": "UR126099880", "Content": "Got an excellent deal including breakfast at this hotel. I knew the location was good and didn't really expect great things from the hotel. To be fair, it isnt luxurious; the room was small and the breakfast was adequate. However, it was quiet since we had a room at the back, spotlessly clean with daily linen changes and the staff were lovely. I would definitely stay here again and have no hesitation in recommending it.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Perfect place”", "Author": "Nicob81", "ReviewID": "UR123769728", "Content": "Very good choice: central location for touristic abricotier, restaurant, nightlife and shopping! Small rooms but great place.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great location, basic but clean”", "Author": "AgiCac", "ReviewID": "UR122534832", "Content": "Location is perfect for getting around, hotel and rooms are far from luxurious but if you are out and about all day you shouldn't mind ! Little expensive for the quality but it really is the location you are paying for.", "Date": "January 4, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Bludenz, Austria", "Title": "“great location for a good price”", "Author": "bruijntje0909", "ReviewID": "UR116649117", "Content": "Great location, friendly staff and a good price. We had a room at the back, so we didn´t hear anything from the street. The room was smal, but clean. I would stay here again, had a great time.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "portland or", "Title": "“very good hotel and location”", "Author": "lafrancesa33", "ReviewID": "UR116581999", "Content": "I stayed there for 4 nights, first clerk could not locate reservation but then found it on their new web site. Very helpful and courteous. Rooms are very nice, modern, good size, remodeled and very quiet facing the back street. Nothing to complain about and location is perfect just steps from the metro if you really want to be on the Ramblas which was extremely crowded at every hour of the day, but very central to visit the beautiful city or go to the beach.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Nicosia, Cyprus", "Title": "“Fabulous location, cheap and clean”", "Author": "IrenePal", "ReviewID": "UR114615437", "Content": "We went for a 5 day trip to Barcelona, and we love it due to the hotel offered us the elaxation we needed. It was near to metro station and near the main attractions for tourists and locals. Excellent due to value for money vacations. Recommened!!!!!", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Cobble Hill, Canada", "Title": "“Amazing little hotel in a fabulous location.”", "Author": "marlymac", "ReviewID": "UR113173365", "Content": "Location, location, location. Situated right on the Las Ramblas in Barcelona, this three star hotel offers just about everything you could want for \"The Barcelona Experience\". We stayed there from May 29 to June 2, 2011. Our room, #101, had floor to ceiling class doors which led to a a little balcony which looked over the action below. There were 2 chairs & a little table in the room as well as a desk & chair. In the bathroom, was a jetted tub. Outside our room, was a little seating area which was open to the roof skylight & was like stepping out of your room into a sunlit courtyard. What a nice surprise! The friendly & knowledgeable desk clerks were ready to help physically with luggage or anything else required. They helped us with the city tour bus, selling a discount package for the hop on, hop off bus. There was also a Flamenco exhibition you could get tickets for at the desk. Breakfast was available at the restaurant accessible through the lobby for a reduced rate of 6 euros, for hotel guests. The only issue we had, was the lack of a grab bar in the tub. 'Highly recommend this little gem of a hotel.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Third visit and still thumbs up!”", "Author": "beachedwhale", "ReviewID": "UR103525567", "Content": "We spent 4 nights here on this visit having previously visited twice before. Yes the rooms are fairly basic and the beds are quite low and not in any way luxurious but the rooms are clean and the bathrooms very spacious. We found the staff very friendly and helpful and have no complaints about our experience at reception. This hotel is in the best location in Barcelona, opposite the Opera House, beside the market and the metro and right on the Ramblas. For the price you pay and the location, I think it is very good value for money. I will definitely return and would recommend it to people who are not looking for luxury but good clean rooms in the heart of the action and atmosphere of Barcelona.", "Date": "April 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Superb location but very bad service”", "Author": "enelym1978", "ReviewID": "UR102868960", "Content": "Stayed at this hotel for 2 nights with a couple of friends. The location of the hotel is perfect. On the Rambla, next to the Liceu metro station. You're halfway to the sea front and to the center at Plaça Catalunya. Right next to the Barrio Gotico as well. Hotel is very simple, small rooms and small beds (twin beds) but just what you would expect from a 3* european hotel. The rooms and bathroom are clean though. The TV was not working all the time. I give it to you, you're not in Barcelona to watch TV in your room but when you want to put some background music or watch some news, it's annoying to constantly have a \"bad signal\" message and lose the picture. Now, the very negative point was the service, Worse customer service ever. The staff tried to rip us off twice. Once at check-in, because they cancelled the wrong room, they wanted, one of the person had to stay alone for one night in a twin room. Room charge was €150 and he paid €75 but the person at the desk asked for an extra €118 because of the single occupancy, because, you know, 75+118=150.... right? We argued about it, saying that it was their mistake if they cancelled the wrong room to start with. So they credited the money back. When I checked in the second day, my friends were out so I checked in and the front desk charged me €150 because \"the first person stayed in a twin room the first night, so I have to make up for the second half of the first night\". I was not too sure about it but paid it anyway, as all I wanted was to drop my bags and go out join my friends. When we returned, the person who made all the bookings complained again, saying that charging for the first night was not right, that they already tried to charge us for €118 more. Lots of arguments and discussions and eventually, they agreed to pay me back the €75. €150 for one night in a 3* hotel would have been indeed a bit steep. The staff did not care much about us complaining. We wanted a direct phone and email for the general manager and all they kept giving us was the general email address of the hotel, stating that \"this was the manager's private address\"... It's a good hotel but the service is so awful that I would NOT recommend this hotel to any of my friends.", "Date": "April 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Vienna, Austria", "Title": "“Not again”", "Author": "cschiefer", "ReviewID": "UR88030257", "Content": "Nearly no time left, we just booked a hotel in the center, which was not too pricy and went for the Flor Parks. We wanted a room with balcony and a higher floor. We ended up on second floor and the \"balcony\" was not even 0,5 square meters. Walls are thin like paper: You hear pipes, elevators, cleaning maids ( even if they are in other floor ), and other noises you have pay for somewhere else. The bed offered just a thin blanket, which was for November temperatures not sufficient. The first floor, which offers meeting rooms, TV room, bar is closed and seems to be on renovation. Besides the nice location not a place to be.", "Date": "November 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "herts", "Title": "“Huge disappointment”", "Author": "chickenjools", "ReviewID": "UR83372449", "Content": "I booked this hotel following favourable reviews from other travellers. On our arrival there was a fellow guest busily changing her room as the first was not to her liking. This didn't bode well but I was prepared to be open minded. We had booked a non-smoking room but weren't allocated one and discovered that the hotel was full so couldn't change rooms. The room was very small which I wasn't really too bothered about but it reeked of stale cigarette smoke. The bed was a very small double and the bedspread had several stains on it. They looked unpleasant. We found another bedspread in the cupboard which was clean so we changed it ourselves. The sheets had cigarette burns on them. To be fair, the hotel member of staff to whom we spoke about it was very apologetic but he was the only one who was pleasant throughout our stay. The other staff were indifferent to say the least. Although there was allegedly a bar (we always book a hotel with a bar) it was never open. There was no information in the room about the hotel so we didn't know what facilities were on offer. There was no instructions for anything. The bathroom was ok but very outdated and really needed to have been cleaned better. There were hairs in the bath - not ours! There were shampoos etc but the towels were old and thin and had definitely seen better days. One of our towels had a stain on which looked like mascara but we weren't sure. Our room was at the back of the hotel and looked out over a tree-lined street which was actually quite nice. I imagine a room on the Ramblas side of the hotel could get noisy. Ours was noisy from the sound of scraping of chairs on the wooden floor above. It went on until about 4 am. The plumbing system was also very noisy. If anyone in the next room flushed the lavatory or had a shower we heard the pipes filling for some 20 minutes and it was VERY loud. The restaurant doesn't appear to exist any more but there is a door from the hotel to the restaurant next door. We had breakfast there - once! It was terrible; the waiting staff were surly and the food was absolutely mediocre and very overpriced. It's a shame as this hotel is in a very good positiion and was probably once a very nice hotel. It needs updating and the staff need to learn something about the hospitality business. We're actually not given to complaining but felt we had to air our views about this hotel. Barcelona is a wonderful city and, if this hotel were up to standard, we would stay there again as the location is so good. We booked a standard double so mabe the superior doubles and suites are better but that doesn't alter the poor hotel facilities. On the whole it was a big let down and very over-priced. Wouldn't stay there again.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "belfast", "Title": "“Do not trust staff”", "Author": "donaldgregoryBelfast", "ReviewID": "UR80062762", "Content": "As my Tripadvisor profile shows we visit Barcelona regularly. I stayed here couple of years ago with a friend. On checking out we were asked if we wished our luggage held as our flight was late. I went to ask my friend who was outside having a smoke. For some reason I looked back and a member of staff had his hand in my hand baggage. I swiftly returned to the desk to retrieve my bags and the culprit never even seemed bothered by my return. On my return home I wrote to the hotel twice with the help of a friend who speaks reasonable Spanish. I never got a reply. I was only reminded of this while looking for a hotel in Barcelona for half term next month. It is an ok hotel but would I return? Not likely -too many security concerns", "Date": "September 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Limerick, Ireland", "Title": "“Ideal location overlooking all the activity on La Rambla”", "Author": "NPower_10", "ReviewID": "UR79858414", "Content": "We had a twin room overlooking La Rambla. The room was excellent and the staff were friendly and helpful. Close by I would recommend Le Quinz Nits restaurant on Plaza Reial just off La Rambla. The food was excellent and very reasonable. For a quick snack during the day try Conesa on Placa St Juame, which you will find if you go up Carrer de Ferran. You would often find queues outside both of these for obvious reasons. You will ger a large beer in a place called Zurich if you go across the road at the top of La Rambla for approx €3.30. You can add €10 to this price if you have a similar drink on La Rambla.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Excellent Location & Clean Room”", "Author": "Danglecherries", "ReviewID": "UR78468540", "Content": "This hotel is perfectly located right on La Rambla. In walking distance of where you commence the hop on hop off tours, the beach, the marina etc.... Rooms are small but spotlessly clean with air con. The bathroom was a nice size and again extremely clean. The receptionist was very helpful with directions. I cannot find any fault, I had a great stay.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Perfect for a hassle-free stay in the heart of Barcelona”", "Author": "Lochindorb", "ReviewID": "UR72902942", "Content": "Right in the middle of Las Ramblas, opposite LaCieu underground station, yards from wonderful cafes and a breathtaking fruit, veg and meat market with most of central Barcelona walkable. It's clean, well furnished and basic with good sized airconditioned and soundproofed rooms so important in Las Ramblas. Our first night was the night Spain won the World Cup, but no noise in the bedroom and the aircon was excellent. The reception area is small and we didn't have breakfast there, just room only. The staff are friendly and courteous. If you want peace of mind and not break the bank, we'd really recommend this hotel. Only one minor glitch - the room safe didn't work, but no problem. A note of caution, some street cafes in Las Ramblas charge outrageously, but the one two doors down on the right was perfect, long established and cheap (if you stay in the cafe). proper). Phil Beckenham", "Date": "July 29, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Nice Hotel in a great location, near a lot of things you want to do”", "Author": "2kids2carsnopets", "ReviewID": "UR67083364", "Content": "This hotel is directly on La Ramblas and could not be in a better location to see the city. It is very clean, the staff was friendly and helpful, the attached restaurant had a good breakfast (included in our price) and despite what we read, it was quiet. We were on the top floor with a small sunken patio with stairs that looked over the Ramblas. The Ramblas is alive with people all the time and is a great place to people watch. The Gothic district is an easy walk as is the waterfront. The tourist buses are at either end of the Ramblas. The beer in Barcelona is awful but the Sangria is great!!", "Date": "June 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "England", "Title": "“Couldn't have hoped for anything better”", "Author": "Purplegirl17", "ReviewID": "UR57733418", "Content": "We chose the hotel because it was cheap and it was on Las Ramblas. Perhaps because of that we weren't expecting anything grand but even we were pleasantly surprised. The room was spacious enough, with a comfy bed and attractive decor. The bathroom was clean and the shower was just the right strength. We were lucky in that we were given a room on the opposite side of the hotel to the main street, so we had no noise issues. I don't know what it was like on the other side of the hotel but I know it's a busy street even into the early hours of the morning. We were right in the cultural district and close to the harbour so great place to be and there were plenty of restaurants close by. I don't know what the reviews that have complained about the staff are all about. When we got there the staff were nothing but helpful and friendly. They recommended a really good restaurant on our first evening and were easy to talk to. Have already recommended this place to friends.", "Date": "March 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Romania", "Title": "“An excellent location and good Hotel.”", "Author": "Costash", "ReviewID": "UR56117775", "Content": "I would definitely recommend this hotel. It is quiet (as quiet that Las Ramblas can be), not pretentious and perfect if you want to concentrate on the beautiful city and all that it has to offer.", "Date": "February 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ireland", "Title": "“Excellent Hotel”", "Author": "Keenooh", "ReviewID": "UR53127088", "Content": "Really excellent, clean, tidy hotel, fab location. If I ever go back to Barcelona I will defo be staying in this hotel...", "Date": "January 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Fantastic Location, Spotlessly Clean, Efficient Friendly Staff!”", "Author": "tirconaillady", "ReviewID": "UR50625959", "Content": "If you are looking for a value, no frills, spotless hotel in the centre of everything then look no further. I couldn't agree with previous reviews that the staff are rude, we found them more than helpful and friendly throughout our stay-in fact I quite liked the fact that they weren't 'in our face'. They greeted guests politely on departure and arrival and if you had a query or needed help they couldn't have done more. The rooms, while being quite small, were spotlessly clean and sufficient. They suited us fine as we didn't intend to (and we knew we wouldn't ) spend much time in them anyway! When you step outside the front door of the hotel, you step directly on to La Rambla. Flor Parks hotel is located roughly half way along this street, withing perfect walking distance to most of the sights Barcelona has to offer. The only real fault I could find with the hotel was on our last morning as we awaited a taxi to the airport. We went into the cafe adjoining the hotel and i asked for a glass of orange juice for which I was charged over €5. However, I don't even think that cafe is operated by the same owners as the hotel so maybe its not fair to even mention that here! And as for David......Leave him alone!!!! :)", "Date": "December 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Brisbane", "Title": "“Excellent hotel perfect location great value”", "Author": "dimitri40", "ReviewID": "UR46495914", "Content": "We stayed at this hotel for 3 nights in september 2009.It was the perfect central location very clean and neat, close to everything. The Metro was 50metres away, the fabulous Boqueria Fresh Food Market 100metres away, the Tourist Bus about 300metres away. Although right on the Ramblas it was quiet at night in September. We were extremely happy with Flor Parks .", "Date": "October 10, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Vancouver, bc", "Title": "“Hotel phone scam warning !!!”", "Author": "freakydna", "ReviewID": "UR42560864", "Content": "Had a horrible experience here the day before we were supposed to leave. Basically the hotel tried to rip us off by around __200__EURO! for the phone bill. My partner speaks fluent Spanish and they were verbally abusive and we had to get some police from the street to explain the situation. After a lot of tears (or our side) and shouting the manager left saying that it was a \"computer error\". In Canada they would have been sent to court but I guess La Rambla is the wild west still, even the police were saying that we could basically just fill out an official tourist incident report (which we did) but likely they'll just continue this scam. They thought we were leaving a day earlier and would just pay the bill so that we could catch our flight but we fought it and spent the last day of our otherwise great time in Barcelona wasted on these [--]!! DO NOT STAY HERE.", "Date": "September 18, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "BUCURESTI", "Title": "“Worst hotel ever!!! Awful staff”", "Author": "MIHAELAPascan", "ReviewID": "UR40125583", "Content": "This hotel has nothing as an advantage but its location. My husband and I stayed at this hotel for one week and the staff were very very rude and unhelpful. There is a guy there called DAVID who charged us 120 euros for 60 euros worth football tickets - he is a THIEF or maybe i should say LADRRON in spanish.We booked with breakfast included but what they don't say on the site is that they do not have a restaurant of their own, so we got sent to the next door resaturant for an incredibly poor breakfast, not to mention being treated very rude. We asked for a plate from the restaurant and they asked 10 euros!!!! All the guys at the reception are rude and stupid. The hotel is not clean. DON' T STAY HERE!!!!!!!!", "Date": "September 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Worcestershire", "Title": "“why do other people get treated so badly ?”", "Author": "JimboWorcestershire", "ReviewID": "UR31431605", "Content": "We stayed at this hotel for two nights & cannot understand most the bad reports previously left. This hotel is literally in the centre of Las ramblas, 1/2 way between the harbour & Catalonia square...so book it if that's where you want to be. The reception staff were extremely helpful, perhaps this is because we treat them with respect ??? Everytime we asked for help or advice it was freely given to the point of them printing material which they found on line for us. The hotel was of a fairly good standard, certainly as good or better than 3 star in the UK. The room was a decent size, clean with a decent bathroom & small balcony overlooking Las Ramblas. I may be inclined to agree about the sound proofing in that we also had some \"banging on the wall\", BUT we had come in later than 3 am & I discovered that the \"culprit\" was a neighbour, not an hotel guest. Although everyone we had dealings with (bar 1....read on) were polite etc, the bad bits of our weekend break were: If you intend to eat & drink in the area, take out a 2nd mortgage. It really is a rip off (how about over 9 euros for a pint?), but if you go a few blocks away it is just expensive or go 1/2 a mile or so away it's quite reasonable. There is crime in the area, we found it quite amusing watching the hookers at work, & like someone has previously mentioned, we too were almost the victims of a pickpocket outside the hotel. The advice is like any large city be aware of the position you are putting yourself in.", "Date": "June 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Portage la Prairie, Manitoba", "Title": "“OK Hotel, Awesome Location”", "Author": "AmandaO25", "ReviewID": "UR27233660", "Content": "My sister and I booked this quick 3 day trip on lastminute.com. The reviews on tripadvisor weren't all that great so we weren't sure what we were in for... pleasantly surprised then by what we found. Certainly not a 5-star hotel but was clean enough. The only complaint about cleanliness is the stink of stale cigarettes that permeated throughout the hotel and that our bedding had old cigarette burns in it. Nothing to cry about though and we just opened up the large veranda doors to air it out. Shame how tiny the veranda was, you're not ever going to sit outside on a half-foot veranda but it was still lovely to be able to have the doors open for the fresh air. Staff was relatively friendly though I get the impression they get a lot of hobos/would-be-thieves coming in pretending to be guests as each time we entered we had to flash our guest card else they'd stare you down. Still, once we identified ourselves they were more than friendly and in fact very helpful. The area itself is fantastic though I'd never recommend eating on La Rambla but the hotel is situated in such a place that you can walk to one of a hundred fabulous restaurants in less than 10 mins. Just do some wandering! All in all a decent stay but I would likely not go back unless it was on sale.", "Date": "April 1, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "London", "Title": "“Far better places to stay then this hovel in a tourist trap”", "Author": "Londonbornandraised", "ReviewID": "UR24212940", "Content": "As a regular visitor to Barcelona I was a little dismayed to find my business contact had booked me into a hotel on Las Ramblas, the most commerical and touristy street of Barcelona, however I gave it the benefit of the doubt. I arrived just before 11pm and was greeted by three men in the lobby, only one one was behind the reception desk. Whilst ordinarily I would be delighted for someone to relieve me of carrying my luggage, something about the young man's attitude unsettled me. As a young female travelling alone safety and professionalism are a priority. The \"porter\" proceeded to take my luggage up to my room despite my protest that I was fine and was a little over friendly in conversation. He finally got the hint and left when I stood in the doorway of the room waiting for him to leave, this took a while as he was over the other side of the room! Once locked in my room I discovered the pillows were filthy with eye makeup and hairs and I couldn't bring myself to check the rest of the sheets - ignorance is bliss and with an early meeting the next morning I couldn't afford a sleepless night. The bathroom was standard, the walls and floors paper thin so if you're not used to noise you will get NO sleep and the tv is Spanish only. When checking out the next morning I needed to leave my luggage and was told this was fine, despite my protests I was given no receipt for my bags which concerned me greatly. When I returned some hours later I found them lying in the reception where anyone could have taken them. Barcelona is a fantastic city and I am a frequent visitor, but please don't waste your time in this hotel or indeed in this area. There are some great deals on apartments and hotels in much nicer areas where you're less likely to get mugged. Las Ramblas is definitely somewhere to stop on your trip but take the bus/metro/walk but for heaven's sake don't stay here and certainly not in this hotel!!!", "Date": "February 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Average Hotel”", "Author": "LisaS069", "ReviewID": "UR19523008", "Content": "Like others that have written a review on this hotel. It has a fantastic location almonst halfway down on the main stretch of La Ramba which is fantastic. I was very relieved that our room was at the back of the hotel not facing the main street as it was the start of the semi finals and finals for the World Cup and I don't think we would have got much sleep. I would suggest that when you check in that you make sure you check things like the air con to ensure it works correctly and that the Trouser Press is not broken. Their website says that all rooms come with an iron but they definiately don't have these. We had to suffer 2 nights without aircon which was horrendous as it was so hot. Slept with the balcony doors open which was fine the first night as it kept us cool but only because there was a thunder storm that night. Trouble is the next night all the mossies came out so my partner got bitten alive - I must have been very lucky that night. We finally managed to get a different room on the Saturday night for the last 2 nights of our trip and slept soundly thank goodness. If you go to Barcelona I would always suggest going around March/April or very early May but not later than that as it gets too hot to walk around and see the sights without having to get into a shop to cool down with their air con! One of the best things we did whilst there was get a 2 day bus tour from the place de Catalunya and did all 3 routes to see all the sites - expensive but boy was it worth every penny! Would I go back to this hotel - probably not as like to stay in other hotels in various locations of Barcelona!", "Date": "August 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Leeds, UK", "Title": "“Fantastic location.”", "Author": "SwissUK", "ReviewID": "UR15446136", "Content": "Hotel Flor Park is a modern, clean and stylish hotel (more of a travelodge really) situated in the absolute heart of Barcelona's lively La Ramblas district. The building itself is atractive and our room had a balcony which overlooked the stunning La Rambla strip. The rooms were spotlessly clean and the reception service was excellent and professional yet friendly too. The area is lively and noisey which is what you would expect staying in the heart of the city but the double glazing is so good you can't hear a thing with the windows closed. There is full air-con so overheating is not a problem. I would recommend this hotel to visitors who are wanting to be at the very centre of everything but if you wanted a more relaxing and luxurious hotel then perhaps look elsewhere. If I were to return to Barcelona I would book this hotel again.", "Date": "April 28, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Malaga", "Title": "“Great location but overpriced”", "Author": "FuzzyMalaga", "ReviewID": "UR8718739", "Content": "The location on La Rambla was excellent but the facilities were not worth the price charged. We booked superior room with advertised free internet connection (none). Room had small terrace with a step from the room almost one metre high, same height to get into shower/bath. 2 metre high wall on terrace so had no view of La Rambla and we had to pay for wifi which didn't work on our floor. Hotel was very clean but certainly not worth the money and we supposedly got a cheap price through Lastminiute.com. Not suitable for anyone who is not fully mobile.", "Date": "September 15, 2007"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“When location means everything”", "Author": "Ohjustpeachy", "ReviewID": "UR8038304", "Content": "Situated in the middle of Las Ramblas the hotel is perfectly located for everything! The double room was small, the bathroom was small and the tv was small but we spent little time there. It was a place to sleep and we slept very comfortably. The aircon worked - very important in summer. The staff were helpful, the communal areas were nice and the doormen at the entrance gave a feeling of security. Overall a great spot.", "Date": "July 2, 2007"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Milan, Italy", "Title": "“Good price for value”", "Author": "Garghenta", "ReviewID": "UR5296967", "Content": "Nice hotel, into the heart of Barcelona. Clean rooms. Miss the breakfast, however very good price for value.", "Date": "June 4, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Wexford, Ireland", "Title": "“Wonderful hotel, wonderful location”", "Author": "A TripAdvisor Member", "ReviewID": "UR4563720", "Content": "I've just returned from a 3 night stay in Barcelona and can highly recommend the Flor Parks hotel. I was lucky that I booked this through laterooms and got a fantastic deal of €62 per night for the room. This rate didn't include breakfast but that's no problem. The location of the hotel is fantastic, on La Rambla, across from the Gran Teatre de Liceu. The guy on reception (daytimes) was incredibly helpful - full of advice on where to go, where to shop etc. The room was quite big in comparison to rooms I've stayed in in Paris for example. It was also spotless with all the usual toiletries supplied and cleaned every day. Our room faced the front, overlooking La Rambla but, once the window was shut was very quiet. I would have no hesitation in staying at this hotel again on my next visit to Barcelona - and I will definitely be visiting Barcelona again!!", "Date": "February 28, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Dublin", "Title": "“Location Location Loaction”", "Author": "A TripAdvisor Member", "ReviewID": "UR4386916", "Content": "Located in the middle of La Ramblas and 50 metres from the Liceu metro station. Location is very central although there are theifs and drug dealers hanging around outside the hotel sometimes. But they are all over the La Ramblas. The staff were very friendly and helpful. They offered to organise football tickets and were helpful with the tours on offer. We were in a double room and paid €220 for three nights. The room was quite small but had a tv, safe, air conditioner, balcony facing the back, telephone and minibar. The bathroom was very spacious and the hotel provided toiletries, hairdryer and fresh towels everyday. The only thing is that the walls must be very thin as we could hear people talking in the middle of the night from across the hall. Continental breakfast which is served in a restaurant mext door was included in the rate which consisted of a small bread roll, a slice of ham, cheese and salami, a croissant, piece of toast, jam, butter, tea or coffee and freshly squeezed orange juice. I would definetly recommend this hotel to anyone.", "Date": "January 25, 2006"}], "HotelInfo": {"Name": "Flor Parks Hotel", "HotelURL": "/ShowUserReviews-g187497-d234568-Reviews-Flor_Parks_Hotel-Barcelona_Catalonia.html", "Price": "$116 - $377*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">La Ramblas 70</span>, <span class=\"locality\"><span property=\"v:postal-code\">08002</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "234568", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/21/bc/21bcb2e7109c605b3d0e749aa29f6d179large.jpg"}}