{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“The best location!”", "Author": "La-arana", "ReviewID": "UR128502428", "Content": "This hotel is located in the Barri Gothi, a block from the Cathedral and the Picasso museum, and a five minute walk from the Ramblas. It is also right across the street from a metro stop and about two blocks from the harbor. This makes it convenient to almost all the attractions in Barcelona. The hotel itself is clean and the staff are very friendly and speak excellent English. The rooms are small but contain a minibar and a safe. My window looked out over the old roman wall. My friend's room even had a computer for her use in the room. The hotel serves breakfast (at thirteen euros, kind of pricy) but other than that, does not have a restaurant. This is not a problem in Barcelona, where you can get great food everywhere. There is a bar if you want a quick cup of coffee or a nightcap. The front desk person also serves as the bartender. There is an Irish pub next door if you want to watch sports in a crowd or get tired of tapas and paella. The only drawback to our stay there was that they are working on the outside of the building and I was awakened by the work noise one morning. This is obviously only temporary and they did not start working until eight o'clock. I have stayed in other fancier hotels in Barcelona and this one was by far the most convenient and friendliest, not to mention easier on the pocketbook.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "chesterfield", "Title": "“laietana barcelona unhappy”", "Author": "stephen p Posted by an Easytobook.com traveler", "ReviewID": "UR128337265", "Content": "arrived in lobby to find fellow guest had been robbed in the lobby. first night slept in very small odd shaped double room - requested move on sight but no options available - view from window was scaffolding. Double bed was terrible - would expect to find it only in the cheapest of hotels - no weight, worn out mattress and totally uncomfortable. woken up by scaffolders. moved to alternative double room - bigger and better shape, but did not lose the scaffolding or alarm call from scaffolders. After 2 more nights could not wait to move elsewhere. And all of this cost around £130 per night. Definitely not 4 star.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“Great Location”", "Author": "kgoumas", "ReviewID": "UR128294536", "Content": "The location is great for people like us that want to walk arounf in the center of the city. It is true that the building has scaffolding at the back and that was a bit frustrating. It is also true that my romm (#508) was very small, but honestly I don't mind.... It;s central location is the major criterion for me. We didn't choose to have breakfast there, lots of places are available nearby to have a good coffee and eat something. The hotel staff have been very helpful (searching for info about train and buses in spanish only sites !). Definitely not a 4 star hotel...", "Date": "April 21, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London", "Title": "“Poor value for money, extremely noisy, unfriendly staff”", "Author": "gkgl81", "ReviewID": "UR127938334", "Content": "The hotel is a construction site, with scaffolding around most sides. Rooms facing the main road are extremely noisy, when I requested a change of rooms the staff claimed the hotel is fully booked and there is nothing they could do. It's probably officially a 4 star hotel, but I have stayed at plenty 2 or 3 star hotels that are way better value for money, just avoid this one. I booked very late and this was one of the few hotels with rooms left, so I didn't have much of a choice. Security also seems poor as the reception staff usually hides in a room behind the reception rather than stay at the reception. A few times we walked in without anyone noticing that we have entered the hotel. The rooms are tiny, the bed takes up most of the room and the wardrobe is unpractical. Location is great though, right near the old town, that's the only good thing about the hotel.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Close to the marina and 5 minutes walk to La Rambla”", "Author": "Msgamal", "ReviewID": "UR124097728", "Content": "Great experience, nice cosy lobby. Very close to everything or mainly la Ramblas and the Marina. Helpful staff", "Date": "February 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Extremely disturbing works being carried in the building”", "Author": "mgs_ltd", "ReviewID": "UR122723632", "Content": "Nice service, but the works are apparently not supposed to finish until 6 months.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Very central hotel”", "Author": "Orna P", "ReviewID": "UR121631598", "Content": "The best thing about this hotel is its location which is in the center of Barcelona. The stuff was really friendly and helpful, breakfast was excellent. However, we suffered a lot from the noise and traffic and on top of that the hotel is undergoing renovation and it is totally covered. Not such a great sight if you want to open a window.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Nice hotel - central location - not a building site!”", "Author": "Ray-Wicklow", "ReviewID": "UR120831051", "Content": "Just back from 2 nights in Laietana Palace. Nice Hotel and great location. Good value when compared with the expensive Las Ramblas. Check-in very smart, friendly and welcoming. Room overlooking Via Laietana - a little noise from traffic but not enough to cause any upset. Room very comfortable, clean, well presented and well serviced. Not sure about the earlier comment about the hotel being a building site? Yes the front of the hotel is covered in mesh, but so are a number of other premises on the street. Yes, visually not attractive, but absolutely no impact on the inside of the hotel or on how it operates. We arrived at lunch time on Friday last & there was absolutely no work going on or any building noise. Welcome at reception was excellent and lots of good advice provided. Value - €50 per person per night - which I think is great value - have paid considerably more on Las Ramblas, for lessser quality. Overall - nice hotel - would we go back? Definitely yes.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Harpenden, United Kingdom", "Title": "“Very Central for all areas!”", "Author": "Retneprac", "ReviewID": "UR119211900", "Content": "Excellently located hotel, a few minutes walk in any direction will take you to one of the sites, the port, La Rambla etc etc. Room was a good size, clean and tidy and over looked the paddy's bar at the rear. Couple of things we didnt like, on arrival at the hotel we walked into what we thought was an arguement between a guest and staff at reception, took them a while break off and greet us with a small amount of the hostility spilling over! Wasnt keen on the cleaners trolley being parked right outside the lifts, didnt affect anything obviously but took away the 4* atmosphere, they should call it a 3* really, couldnt see what made it a 4*. Didnt have time for TV, too much to do and see. Mini bar was useful and not too over priced with great Vodka! We were on the 2nd floor, you could feel the trains as well as the hustle and bustle from the city but it all builds the atmosphere. Wasnt anywhere near bad enough to stop you sleeping. We booked via Lastminute.com, we added a comment in the online comments box, didnt get a reply from either the hotel or lastminute.com. We requested a top floor room! Over all, a great trip and stayed in a very central hotel, excellent.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Excellent location, the rest is average...”", "Author": "Birans", "ReviewID": "UR119114526", "Content": "Rooms are quite small, average breakfast, very good service, amazing location. Overall- recommended.", "Date": "October 9, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“It is just close to the LA RAMBLA”", "Author": "KLFZ", "ReviewID": "UR118047453", "Content": "Clean Hotel and helpful staff but it is not a 4* Hotel, old loaction with small rooms with AC problems. But from the location perspective is an Excellent located hotel, Bus stop directly at the hotel door and drive you directly to Barceloneta beach and night clubs, Metro station is just 1 min walk, La Rambla street is 5 min walk, tour of Barcelona station is 3 min walk, breakfast and restaurents are just 2 -3 min walk, so many other attractions I can share if you send me your queries.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "dublin", "Title": "“Great location”", "Author": "tonyfitzsimons", "ReviewID": "UR116274644", "Content": "This Hotel is ideally located for exploring the city. The staff were helpful and courteous,the room was spotless and quiet. The breakfasts were delicious and would set you up for the day,very impressed. The only downside was the lack of entertaining English language channels on the TV, 2 news channels and 1 Eurosport was just depressing.", "Date": "August 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pine Beach, New Jersey", "Title": "“Excellent”", "Author": "eddie930", "ReviewID": "UR109663293", "Content": "During our stay in Barcelona we could not be pleased with the service we received! We were booked for a cruise in two days, and during our stay the staff could not be more helpful. Our bags were taken care of from the start to finish and our taxi was arranged for us to the port. We are going back next year and will be staying there again! Excellent location to everything! Very kind people who seemed to really care!", "Date": "May 24, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Godalming, United Kingdom", "Title": "“Great Location”", "Author": "NiceLadySurrey", "ReviewID": "UR108087321", "Content": "I stayed in the hotel for one night to have a two day sight seeing experience, it is very well located, five minutes walk from Port Vell and ten minutes walk from La Rambla, The room was pleasant, room 110, we have two large windows with a court yard view, nice double bed and lovely modern bathroom with a trendy walk in power shower with jets on. My only complaint is that the water pipes havent been insulated, something we take for granted in chilly England, the result being that everytime a toilet was flushed in the night you hear running water, which can wake you if you are a light sleeper, it was so bad that when I had a \"wee in the wee hours\" I thought that the toilet was stuck in flush mode. I got up to check and my disgruntled (tired) partner explined the issue and said that it had kept him awake. i dont know if this noice is in everyroom though. I however went back to sleep until late morning when there seemed to be some sort of road rage incident resulting in blaring horns, this was the only time I heard the noise from the road though. There is a nice Irish Bar called Dunne, right next door where you can get an all day breakfast if you are a late riser, they also show football and are very friendly. My favourite restaurant in Barcelone is Attic, on La Rambla for a civilised western style meal in the sun, however you can't go wrong anywhere with Tapas. The Open Top bus is a great way to get around the city, 23 Euro for a whole day, really worth while.", "Date": "May 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“terrible - one step above a hostel”", "Author": "iso1972", "ReviewID": "UR102469929", "Content": "hair dryer in room was filthy. room had one blanket even though we also had a cot for our son. when requested extra blanket we were told to go get more sheets from the cart in the hall. telephone was broken - did not work at all. when we asked for room service we were told we could order Dominoes pizza and that's all they could offer. upon checkout no one asked how our stay was or even said goodbye. he just took the card key. this is one of the worst hotels we've ever stayed in. no english channels on tv except bbc.", "Date": "April 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“Great location.. OK room”", "Author": "Smurfette081", "ReviewID": "UR102302555", "Content": "Hotel's exterior looks new new, friendly and helpful staff, free wifi. I had no problem sleeping while other reviews said it was noisy", "Date": "March 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brazil", "Title": "“Well located hotel, but not perfect...”", "Author": "BrazilAca", "ReviewID": "UR97548997", "Content": "Eurostars Laientana Palace is extremely well located! This is definitely the plus of this 4 star hotel, near all major tourist locations in Barcelona. The rooms are nice and clean. The staff is mostly friendly. However the room service is poor and there is no restaurant.", "Date": "February 22, 2011"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Lorraine", "Title": "“Disappointing”", "Author": "Life57", "ReviewID": "UR96761539", "Content": "Ok yes, it is indeed well located BUT : - Very very small and noisy room. If your neighbour shuts its door, it will wake you up for sure - Very outdated furniture - Bad matresses (springs..) - No luxury : No bathtub (despite pictures I saw on the internet), no fitness, no sauna Not a 4 star hotel", "Date": "February 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“EXCELLENT location!!!”", "Author": "wallamercedes", "ReviewID": "UR87774263", "Content": "We got very lucky and couldn't have been happier with the location of this hotel! The staff was very friendly and helpful, the rooms were very small, but nice and clean. It was close to the major attractions and metro stops. We had a fantastic time and this hotel was a good home base. Overall, we were happy with our stay and would recommend this hotel to a friend. One downside: The internet was somewhat slow, but had free wi-fi in the rooms.", "Date": "November 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lincoln, United Kingdom", "Title": "“A very pleasant hotel in an ideal location”", "Author": "bryceeooh", "ReviewID": "UR87518418", "Content": "Clean, comfortable and friendly. We stayed on the top floor with partial view of the night sky and the Barcelona architecture. The room was quiet with very little of the traffic noise thats often (unfairly?) referred to, was clean and fairly well appointed, but no kettle or coffee. The location is superb with easy walking distance to all places of interest, but also with a metro station 2 mins away. Breakfast was included in our rate and was worthwhile, particularly as the dining room was quiet, if small, but well stocked.", "Date": "November 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Charlotte, NC", "Title": "“Do not stay here”", "Author": "parisisthebest", "ReviewID": "UR79375562", "Content": "If you want to be woken up 10 times a night due to your room neighbor's conversations and slamming doors, this is the hotel for you. Good location, but there are certainly many hotels in this area of the city. We only ended up here out of desparation because our intended hotel was flooded and closed down by the city days before we arrived.", "Date": "September 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "ukswift88", "Title": "“Nice little hotel”", "Author": "ukswift88", "ReviewID": "UR77630533", "Content": "Stayed at Laietana Palace over bank holiday weekend with family (all 18+). After reading reviews on here we were a little anxious about the hotel. The hotel staff are friendly and welcoming on check-in, 2 of opur party of 6 had checked in a few days earlier and the front desk staff offered to change our pre-allocated rooms to the same floor. We decided to take 1 room on the same floor and 1 on the third floor... rooms 105, 305 and 107. Our room was 305 - the room was much better than we expected - the room was clean and not too small. The bathroom was also clean and of a decent size with a nice shower. On checking out the room plan on the fire escape details on the back of the door, it is clear that some of the hotel rooms are quite small. Rooms x04,x05,x07 are some of the smaller rooms. With x05,x06 are larger guest rooms, I would reccomend x06 as this is a corner room with 2 windows and appears to be one of the largest rooms on the plan. On the downside the beds were quite hard and there was a fair bit of street noise - but we spent little time in the rooms as there is so much to see!! There is a tube station very close to the hotel. The hotel is very close to Las Ramblas and in the Gothic quarter with lots of great tapas restaurants - would reccomend Taller de Tappas - very close to the hotel with a great variety of tapas dishes in a small square with street entertainers. Would definately stay here again if visiting the city - although if you are wanting to spend alot of time in the hotel maybe the smaller than average rooms and street noise may be bothersome.", "Date": "August 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Fareham, United Kingdom", "Title": "“Noisey”", "Author": "nexvilentus", "ReviewID": "UR72889063", "Content": "Had a room t the rear of the hotel facing the old city wall,I think, and it was still noisey from the main road at the front of hotel. The staff where lovely, helpful and polite and breakfast gave enough choice and set us up for the day of sightseeing. Service in the bar was great, more coke and vodka than vodka and coke! If it wasn't for the noise we'd stay again", "Date": "July 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“This is a business hotel”", "Author": "R0xford", "ReviewID": "UR72450900", "Content": "We were allocated a room (101) which was far too small for two people, when we threatened to leave - Room 102 was suddenly available, but the bed collapsed. We then moved to Room 103 which we stayed in but were not happy. The road noise drowned out the tv, even at full volume. The floor map (which was not in the previous rooms) showed it as a single room, as were the others despite being fitted with double beds. This explained why the wardrobes as well as the rooms were so small and totally unsuited to a stay of more than a couple of days. How this got 4 stars I don't know. We were on the smoking floor despite never smoking in our lives. This is suited to business people on their own, not holidays.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Berlin, Germany", "Title": "“not a 4-star hotel; barely 3”", "Author": "JamesJames1014", "ReviewID": "UR67240700", "Content": "This hotel has a great location but that's it. It's tired and run-down, the rooms are very small, many things needed repair, and (like many places in Barcelona) it was impossible to escape the outside noise. I was first put into a room on the top floor with windows only in the roof and no air conditioning. It did have a bath at least. I requested to be moved and ended up in a smaller room which was quieter (and the air conditioning worked) but no bath. Only stay here if you have to. There are far better and more atmospheric hotels in Barcelona. Avoid.", "Date": "June 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“Location very good - all other average.”", "Author": "MrT_Oslo", "ReviewID": "UR64038415", "Content": "The hotel is located perfectly in the city of Barcelona. It says on the front (and online) that this is a 4-star hotel. It is not. I have personally stayed at better 3-stars hotels in Barcelona. But it is not bad - just average and therefore a little less than one should expect from a 4-star hotel. Did not try the breakfast - we bought food at a nearby supermarket, kept it in the fridge over night and had breakfast in the room. Buying breakfast from the hotel was almost €14,- pr day - way too expencive. Bottom line: this is a ok hotel with a very good location - but there are better hotels in Barca.", "Date": "May 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“Excellent customer service... so helpful”", "Author": "rlwill3922", "ReviewID": "UR61905848", "Content": "Without a booking and rerouted to Barcelona, this wonderful hotel worked us in. The front desk staff were of the best that I have seen. The location is excellent. The tiled bathroom was real nice with good hot water. Towels were very nice and thick. The beds were comfortable after our rerouting ordeal with a long layover. I would higly recommend this hotel. We didn´t figure out about the air conditioning, but it was tolerable without it. The rooms are soundproof. Can´t say enough good things about them. So nice.", "Date": "April 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Belfast", "Title": "“Why all the negative reviews?”", "Author": "A_Traveller_89", "ReviewID": "UR60016187", "Content": "I stayed here for three nights, and my stay was very pleasant. Check-in was quick and the staff spoke English. I found my room very easily. It was 101 the first room on the first floor. I had three minor complaints about the room: It was small. It was like half the size of a Travelodge room in the UK. And the ceiling lights didn't work. The bathroom was very dark and I had to use this room with the light from the bedroom. The bedroom was lit by a side lamp and the window, which overlooked a communal light shaft. And I could hear the people next door speaking very clearly. If I spoke Spanish, I would have understood everything they said. Haha, I'm making the place sound really bad - but it was actually really nice. The location is tip-top. It is on the fringe of the Gothic Quarter, so you just turn the corner and you are in the Quarter proper. I got very lost in the Gothic Quarter on the first day, after visiting La Ramblas, but I loved the place with a passion. I got a deal for this hotel on lastminute.com. I wouldn't have used this hotel otherwise. When visiting Barcelona, make sure your hotel is central like this one. Many hotels are far out of the city, and you don't want to have to travel in. Enjoy your stay in this fabulous city!", "Date": "March 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Lubbock, Texas", "Title": "“Nice place with great location and service”", "Author": "rwb2bgn", "ReviewID": "UR55543364", "Content": "It was a very nice location. Very close to the pier and Cathedral of Barcelona. Breakfast was good. Guys at the desk spoke english and were very helpful. Room could have been cleaner but it was fine.", "Date": "February 9, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Varna, Bulgaria", "Title": "“Decent place for an overnight stay”", "Author": "infectbnl", "ReviewID": "UR50596426", "Content": "I liked it. Regular motel :). Free ice machine on site. Turned out to be pretty useful cause the only booze we could get at night (the time we arrived) was beer from the nearby gas station. Then we turned one of our drawers into a cooling drawer ;).", "Date": "December 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Boston", "Title": "“Absolutely loved this hotel”", "Author": "happytravelsKDM", "ReviewID": "UR48698772", "Content": "I stayed at the Laietana Palace with my sister while exploring Barcelona last week. We loved this hotel and would definitely return! The value for the money is great. This hotel is what I'd call \"American style\", with a bright and open lobby and front desk that is always staffed with friendly and helpful, English-speaking hotel employees. I noticed there is a bar in the lobby with alcohol behind it, but never saw anyone drinking there. Our room was small but very nice and comfortable, overlooking the ancient ruins behind the hotel, which was cool. There was a minibar too, essential in my mind for keeping bottled water and yogurt for easy snacks in the room. You can see from my other reviews that I travel with a computer and wi-fi is very important to me. This hotel gets 5 stars in that department. Free wi-fi with a very strong signal in our room, 24/7. We were able to download full movies from iTunes for watching during siesta in less than 45 minutes. It was just as fast as the Verizon FiOS I have at home. The hotel location couldn't be beat. The Via Laietana runs between El Born and Bario Gottic - the 2 neighborhoods where we wanted to spend most of our time anyway. So many excellent restaurants and tapas/sangria spots in close walking distance. Just avoid the wine bar directly beneath the hotel - overpriced and an odd scene. Breakfast in the hotel was generous. We stayed away from the eggs and bacon, but there was always cheese and ham, whole fruit and cut fruit, breads and pastries, juice and a coffee/cappuccino/latte machine. Breakfast is not included in the room cost, which we did know until checkout, but we didn't mind because it was so good, and all in all still cheaper than the terrible hotel in Madrid we were headed to (see my other review) Would absolutely return to this hotel, and to Barcelona also.", "Date": "November 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "NYC", "Title": "“I don't understand how it is rated as a 4 star hotel.”", "Author": "nanceea", "ReviewID": "UR46883513", "Content": "The very small room was bare bones minimum without even a picture on the wall. The hotel is on a very busy street, not too far from the action on LaRambla. We had several pieces of luggage, but at 8:30 a.m., nobody was available to bring the luggage down from the room when we were ready to check out.", "Date": "October 14, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "memphis", "Title": "“Rude to Asian-American guests”", "Author": "jyogawa", "ReviewID": "UR31426728", "Content": "For an expensive 4 star hotel (renovated building run by Novastar European Chain), the hotel was understaffed. No one to help with bags up the front steps (no ramp). The hotel is right over the subway, which made sleep difficult on the lower floors. The renovated bathrooms had marble floors, but was poorly designed (shower with half glass screen and flat floor, which splashed water onto the bathroom floor). The beds were hard but not comfortable. The one plus was location in the middle of the Gothic Quarter, which made the limited staff rude and suspicious of non-Caucasian guests coming in off the high traffic street. Card keys as in our Madrid hotels would have allowed the limited staff to be more cordial to the guests.", "Date": "June 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "San Diego", "Title": "“This is not a 4-star hotel...Do you hear me Hot Wire!!!”", "Author": "Streetgang", "ReviewID": "UR29873158", "Content": "Look, Let's get one thing straight, this is not a 4-star hotel...who ever says that, is just lying. What it does have is location...So, if you just want a place to crash, take a shower, then get back on to the streets of Barcelona then this hotel is ok...Period! ..No Romantic Get-a-ways, and no Romantic views. If you want that, then book the Arts Hotel Barcelona and if the gal is smart she'll appreciate you!", "Date": "May 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Scotland", "Title": "“We must have been staying at a different hotel to everyone else...”", "Author": "BeccaQ", "ReviewID": "UR28892133", "Content": "After having booked the Laietana Palace with lastminute.com my heart literally sank when I read the terrible reviews other guests had written, so I was truly expecting the worst. From our welcome at the hotel (a complimentary red rose/book as is Catalan tradition on St. Jordi's day) to very helpful internet/email assistance from the concierge, both my husband and I couldn't fault the hotel or its staff. As someone with a marketing background, I am well aware of the fact that people rarely write a good review, but are very quick to complain about bad experiences. I felt that I had to write a positive review in case other travellers are put off staying at this hotel. True, the rooms are small but are clean and well-serviced. I agree with some reviews that it may not be \"4 star\" as it does lack some services that you may expect in a 4* hotels (i.e. a pool/fitness suite) but its location is superb, close to sights and you won't want to stay in the hotel for the duration of your trip to Barcelona anyway!! A point to note that has been mentioned in a few reviews is that there is no hot water in the jacuzzi shower - there is...you just have to press the red lever on the shower as we discovered on the first morning!", "Date": "April 27, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Cardiff, Wales", "Title": "“Dreadful rooms”", "Author": "CL_Cardiff", "ReviewID": "UR27638435", "Content": "We checked in this hotel in March 2009 and checked out again 20 minutes later. The reception staff were dismissive and unhelpful, the rooms were tiny, and they couldn't give us a room with a bath. We cancelled all of our reservations (we had made several for friends) and the hotel later tried to charge us for a no show. You can get a much better standard of accommodation in Barcelona for the same price or less. I would never consider returning to this hotel", "Date": "April 8, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“well.... I wouldn't stay there again”", "Author": "classy_shazz", "ReviewID": "UR23919516", "Content": "For a weekend away, left it to the last minute to book a deal and we did end up paying 60 Euros a night. So maybe you do get what you pay for!! The staff could have not been less pleasant on check in. We got the wrong room card and spend half hour trying to get in. We were right next to the lift, so everytime it went up or down the room shock and the lift moaned and groaned. The walls were paper thin and could here quiet conversations two rooms across. On the last day our toilet didnt work and they simply told us to go the one next to the dinning room. The rooms are small enough to almost be able to touch both walls. Very small beds and surprisingly huge bathroom (but no bath). Obv spent a lot of money on fancy showers and TVs. The location is fantastic!! Could not fault it. It was also really clean.", "Date": "January 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Brit in Spain", "Title": "“Don't expect much sleep”", "Author": "PeterC1", "ReviewID": "UR22094104", "Content": "Don't expect much sleep. The plumbing is noisy & the walls are thin. Doors close noisily. Rooms are small, to use the desk in most rooms, the TV has to be placed on the floor. I have stayed in this hotel three times when I haven't had the choice, (been booked in by clients I have been visiting, on two occasions I have had to ask for a room change, which they complied with. The hotel is in a good location, in the Gothic quarter, short walk to Las Ramblas, beaches, marina.", "Date": "November 22, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "uk", "Title": "“not 4 star”", "Author": "ian7Uk", "ReviewID": "UR21502556", "Content": "Clean hotel, great location near cathedral. Bed very uncomfortable , rooms not large. Reception staff untidy . Certainly not 4 star it makes you wonder what a 2 star hotel in Barcelona is like.", "Date": "November 3, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Cascais", "Title": "“It isn't worth 4 stars rating”", "Author": "silveiradiniz", "ReviewID": "UR21342752", "Content": "I have been with my wife from October 18th to the 22nd. The hotel is on a good central location, very close to public transports and main city downtown attractions, and the beakfast was ok too. But the room itself (108) and the toillet are terrible. The room is so little that it has just enough space for you to go around the bed. You have no space to put your luggage over, so you have to leave the bags on the floor. Because there is so little space available you always have to jump over your behalfs whenever you move around the room or to the toillet. You can also hear your neighbours too much... Our room was facing backwars so we didn't have any trouble with the main street noise, as that is quite a busy road with lots of traffic. It is one of the main downtown streets. The toilet was awfull with so little space available. When you intend to have a shower (there was no bathtub) you must keep the water running for about 5 minutes before you go in, as the hot water always takes so much time to come out of those pipes, and the water pressure is very week. Besides this the toilet was very degradated. There was mould on the ceiling and some lavatory parts were missing.", "Date": "October 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "England", "Title": "“Excellent location, decent hotel”", "Author": "Travelerwiz", "ReviewID": "UR16647016", "Content": "We stayed here for little over a week. The place is very clean, staff are pleasent and helpful, the hotel is deffinitely not a 4 star as was advertised to us but we would stay here again purely for the location. We stayed here during a promotion rate of €50 a night, so would probably look longer for other hotels if we had to pay full price. On first arriving at the hotel we thought it looked nice, the first room we had was spacious offering a good view. Unfortunately we had to move a few times due to problems in the rooms. One thing we noticed was most rooms are very different in size and layout, im guessing it would be a lottery which one you get. The staff seemed helpful enough so just ask to be moved. We were given a twin instead of double room and there was a problem with the bed in another room. There is also something wrong with the water system in the building, resulting in getting inconsistent water temperature/pressure. You can use the interent downstairs in the lobby for free which is a plus. Breakfast is not included so cant comment on that. Overall we enjoyed our stay in this hotel, it was pretty standard and nothing unexpected happened.", "Date": "June 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "derbyshire", "Title": "“Good, adequate and well placed hotel but not quite 4*”", "Author": "DerbyshireJoy", "ReviewID": "UR15186495", "Content": "Have just enjoyed 3 nights at the laietana palace. No complaints - we booked a deal through lastminute and expected the worst. The room was small (bathroom huge) and though at the back much quieter than larger rooms at the front so we were happy. Air con/heating fine, comfortable beds and very clean. room safe - no key and Euro news on the TV irritating but otherwise great with very good staff. All newly decorated. If you are flying to Girona and worried about the transit bus, don't be - it's opposite the exit and was 22euros return - dropped us off at Estacio Nord where taxi waiting - fare to hotel 9 euros from there. Don t bother with breakfast - great tapas bar doing excellent coffee etc - go to traffic lights and turn right into back st. Well located for the marina and the cathedral and shops.", "Date": "April 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "east coast", "Title": "“Not as bad as I'd feared”", "Author": "bubblesEastCoast", "ReviewID": "UR12315857", "Content": "Having booked into this hotel for 5 nights over Christmas, I then read the reviews and my heart sank! I hate grotty hotels and with Christmas being a bit special, I was not looking forward to the experience. I did phone before and asked for a nice room and they said they'd see what they could do. I have to say, I was expecting the worst but was relieved to find it wasn't all bad though 4* is a bit of a joke. 2 1/2* would be more accurate. However, our room on the 5th floor rear was adequate and BBC News 24, which is dreadful, was working. The bathroom looked fine but as with other reviewers, we found the shower water pressure erratic and most of the water ended up on the floor. The room, inspite of its height, was quite noisy but no more than I would expect from any city centre location and we managed to sleep well with the windows open every night. Probably all that sight seeing! Didn't try the breakfast so can't comment. Only one lift was working most of the time so getting up and down was a bit slow but once they'd fixed the 2nd lift, all was OK. The desk staff were friendly. All in all, not TOO bad and at about 100 euros a night, it was reasonable value.", "Date": "January 4, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Rome", "Title": "“Polite service, but horrible hotel”", "Author": "SHVRome", "ReviewID": "UR11214745", "Content": "The first room they gave us smelt so strongly of solvent (glue? paint?) that we had to change rooms. The walls in the hotel must be made of paper, I could hear a pin drop in the next room and had to listen to the lift all night. The shower created a pool in the bathroom (bad design)...and why are the rooms so hot?! (Don't open the window unless you want yet more noise!) Oh, and don't try the house wine. All in all, it was nothing like the pictures in the website (different hotel??) and very dissapointing.", "Date": "December 3, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "co durham", "Title": "“good hotel - near port/cafes/bars etc”", "Author": "incaCoDurham", "ReviewID": "UR8280341", "Content": "stayed for 3 nts from 29/7/07 in a double room and it was lovely excellant location if you want to be near the cathedral / port . easy walking 10-15 mins to las ramblas & beach and just near the hotel is plenty of cafes/tapas /bars etc incl. an excellant value chinese rest'nt 2 doors up from the hotel ! the bus stop for the hop on hop off tourist bus is just about 100m away for all the sights. only minor complaints - shower looked fab but not much water pressure ! no english channels on the tv . overall staff very friendly & helpful - wld stay again .", "Date": "August 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Yorkshire", "Title": "“Nothing to Winge About”", "Author": "MissRichie", "ReviewID": "UR8226034", "Content": "I have just returned from Barcelona which was brilliant. I had booked the Laietana Palace over the internet and wasn't quite sure of the location having never visiting Barcelona and read mixed reviews was a little unsure. When arriving it took us about 20 min to get from the airport to the Hotel, costing 25 euros! The hotel is on a main street but your won't find many hotels that aren't! The hotel has air conditioning and staff were very friendly on arrival. When arriving at our room we were pleasantly suprised with the size of it (double room). The floor was marble with nice furnishings, overall very clean. The bathroom is also a great size, with toilet, beade, sink and shower and enough room to swing several cats! A little dissapointed there was no bath but shower was great. The hotel is very quiet although if you get a room facing the main road you know when its morning with the sound of traffic waking you. I did not find this much of a problem though. The hotels location is brilliant. A two min walk to the port, restraunts accross the road, gaudi musuem near by, picasso museum near by and La Ramblas is directly behind the hotel with a small walk up to it! We found taxis cheap when lost or in a hurry or legs just too tierd to walk any further, just a few pounds to your destination. Staff at the hotel are really helpful on any information you need. Make sure you check out all the back lanes benhind the hotel, quite interesting!", "Date": "July 24, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Edinburgh", "Title": "“Wouldn't Return”", "Author": "AlanH-99", "ReviewID": "UR8064974", "Content": "Overall I was disappointed with this hotel. No hot water from the shower on 2 out of the 5 nights I stayed there. No English speaking TV channels - despite BBC World being listed on the guide it wasn't working. Very small rooms with space for the bed and not much else. I was there on my own- if there were two of you it would seem extremely cramped. The first room I was offered [301] was a joke, the only window looking out into a narrow shaft running through the centre of the hotel, the result being a complete lack of natural light - do not accept any room numbered X01. I was then offered room 103 which, despite overlooking the 4 lane road running past the hotel, at least had some sunlight coming in. On the plus side the hotel is centrally located and clean enough but that's about it. If you're expecting a room resembling that pictured on the website or that the 4* rating somehow corresponds to what might be considered a 4* in the UK then you'll be disappointed.", "Date": "July 5, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Don't panic, we thought the hotel was fine!”", "Author": "LP21_7", "ReviewID": "UR7848397", "Content": "We took on board some of the tips from the site in requesting a room on a higher floor and were relieved to have a pleasant stay. The hotel is fine and was everything we needed it to be for a city break with friends. Yes, there is some street noise and the shower leaked a bit, but those are the only negatives we experienced. The staff were helpful, breakfast was good and the location is excellent.", "Date": "June 14, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "4", "Service": "5"}, "AuthorLocation": "Leeds, UK", "Title": "“Great stay - pleasantly surprised”", "Author": "mikey_jax", "ReviewID": "UR7214708", "Content": "Have read other reviews - but also been to Barcelona a lot. It is a busy city and there will always be noise - whether it is roads or street cleaners in the early hours. This hotel is no different. We got a room on the top floor with windows in the ceiling to get the great Barcelona morning light. The room was a good size, nice bed, good bathroom. The water pressure was low sometimes in the shower and the hot water not scalding - but Barcelona is an old city and all the hotels are doing there bit for the environment (a big thing for Catalonia's government) - so it worked - what else did we need? We had let the hotel know about the birthday that was being celebrated and as we were unpacking a complementary bottle of cava with strawberries was delivered - unexpected and much appreciated! Plus the reception staff wishing \"Happy Birthday\" on the day was lovely. Breakfasts were good - the restaurant is spacious and the choice of things huge. The bean to cup coffee machine is a nice touch! We would stay there again - great staff and good service.", "Date": "March 24, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Cambridge", "Title": "“would not return”", "Author": "chilly745", "ReviewID": "UR6829288", "Content": "We booked the romantic break weekend as it was our anniversary . Thought the hotel looked good on the website and as it was 4 star hoped would be ok - wish we'd read the reviews before we went', however, we have previously read reviews of places and were pleasantly surprised on arrival. We have never written a bad review before but I must say I was very, very disappointed. The hotel was fairly clean but nothing to write home about, we had a bottle of cava on our arrival and the maid did not remove the glasses from our room for two days . The room was exceptionally small with the double bed against the wall which meant that we had to climb over each other to get out of bed. There was only a shower and no jaccussi bath. The mirror and basin were behind the door and very tight, could not put makeup on or do hair if someone else needed to use bathroom and no mirror above dressing table in room as option. The air conditioning blew warm so had to have the window open at night to let in air, which was very noisy. Did not see a menu for room service so did not use, breakfast was served in the \"restaurant\" in the lobby, no windows and the rumble of the underground, not very welcoming, however the breakfast was ok with plenty of choice so that was a plus and served till 11am so you could have a lie in after a night out in Barcelona. The wardrobe was in the wall and even though we only took a small amount of luggage we both could not fit our clothes in, any longer stay and it would be hopeless, there were no further drawers and no real room to put suitcases without tripping over them. The room was very claustrophobic. The staff seemed ok although we did not have much contact, the bar never seemed open and not that welcoming anyway. On paying bill the manager did not even ask if everything had been ok. This was our first trip to Barcelona and we will definately be going back again, the location of the hotel was good and very central for everything, the people are fantastic, the underground nearby and extremely efficient and clean and local food is superb with plenty of places to go and see. However the hotel did mar our experience and we would not return, there are plenty of other hotels which looked fantastic so I think they will be having out custom in future. I would rate this more of a 2 star than a 4 star hotel.", "Date": "February 22, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "cambs uk", "Title": "“No problems.....”", "Author": "icequeen3296", "ReviewID": "UR6749285", "Content": "I'd booked this hotel before I read the reveiws on this site....needless to say I was a bit worried! Definitely unfounded though. We were greeted by the most helpful conceirge I've come across, provided with maps and details of places of interest. The room wasn't the biggest I've stayed in, but it was more than comfortable, albeit a bit sparse. We only had a shower, but it was one with 5 individual jets and some serious power behind it! Breakfast was served in the basement and wasn't the most friendliest looking of places, but the food was good and fresh and the choice was great. I think i would have to recommend this hotel. The staff were polite and friendly, the room was perfectly acceptable, the food was good and the location was excellent.", "Date": "February 6, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "MERSEYSIDE", "Title": "“New Years Eve In Barcelona”", "Author": "jaffaa", "ReviewID": "UR6569020", "Content": "Booked back in september to stay in the Laietana Palace.. Looking forward to going to Barcelona and staying for the New Year. Checked out some of the comments on trip advisor to see what other people thought of this Hotel. Some were very negative so i decided to phone the Hotel to ask for a nice room. They were so helpful, they gave me room 607 which was really big, i think one of the other reviews had said that this was one of the best rooms in the Laietana Palace, although I didn't requst this room, we was lucky to be alocated it. The Hotel was clean, our room was cleaned everyday, the staff where more than friendly. The location was excellent for what we wanted to do. I would recomend this Hotel to anyone who wants a central location. Try to book room 607 though if you can. We certainly will be staying there again. If you do go try to find a small restaurant called \"Bliss\" one of the best meals we had whilst we where there. Barcelona is certainly a City to explore, we had 5 days there and loved every minute of it. You will always get some people who like to moan about Hotels, i can only say what we thought of our room and the staff we met, and i would give it 8 out of 10.", "Date": "January 9, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London", "Title": "“No jacuzzi”", "Author": "londonsaw", "ReviewID": "UR6554028", "Content": "This hotel advertises a jacuzzi in every room - not true. We booked a smoking room and were given a non-smoking room for the first night. The -01 rooms only have a shower which is only protected on 3 sides so the tiny bathroom gets drenched. The -01 rooms are only really big enough for 1 person and have a close-up view of the other hotel walls. Desperately disappointing except for breakfast and the location.", "Date": "January 5, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Run Away”", "Author": "luvindublin", "ReviewID": "UR6170841", "Content": "Expedia rated this as a 4 Star Hotel, which is horribly misleading. I wish I had read reviews on this site prior to booking. The hotel is advertised as being \"newly refurbished\" with \"luxurious rooms\". The first room we were taken to had only a shower, and barely enough room to set down our bags. It was not newly refurbished by any means. The second room we were shown was again, extremely small, and very hot. I asked why the air conditioning was not on, and was told they turn it off during this time of the year. The small window on the slanted ceiling opened minimally and was of no help. We asked again to be moved to one of their \"luxurious suites\" (as advertised on their website) and were told they had no such thing as a \"suite\" in that hotel. The only good thing I would say about this hotel is that the manager had enough sense to call Expedia to assist with getting our reservations changed.", "Date": "November 24, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "london", "Title": "“nice place”", "Author": "daf15", "ReviewID": "UR5786564", "Content": "from reading reviews here I asked for a room on uper floors, and no 'windows in the roof thanks' as the photo on the their website shows a claustrophobic-looking room with skylight windows. If you do this you should fare ok. We had a lovely end-room with floor to ceiling windows both sides so nice and light and it was very spacious. I was very pleasantly relieved when I walked in (anticipated a dingy cupboard after reading this site!). The traffic roars by alright but nothing to be heard when windows closed. It is in a great location, couldn't be better, so makes up for minor grubbiness of the room (very minor really as it really was clean and hygienice overall). Didn't bother hotel staff much as tend not to usually, and didn't have breakfast there, but all seemed friendly and nice. Room service is advertised as until midnight but had finished by 10.30 which was a bit of a pain, not sure whehter this is a change as didn't get round to pursuing it with them.", "Date": "September 10, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sussex", "Title": "“Adequate for what we needed”", "Author": "pglau", "ReviewID": "UR5717553", "Content": "Just got back from Barcelona and stayed at Eurostars Laietana Palace. It was my hen weekend so 10 of us needed somewhere centraI to stay for 2 nights. I was a little concerned after reading some of the earlier reviews about the size of the rooms and have to say that out of the 5 rooms we had only 2 of them were of a smallish size. The bathroom was very nice and had everything we needed. We had maid service every day and we also used the mini bar which wasn't overly priced. I can honestly say that we never once heard the noise from the underground metro that everyone has been mentioning, however we did stay on the fifth floor so were probably quite lucky in that respect. Overall we were happy with our stay and never felt the need to complain about anything (although if i was to be really picky then the T.V could have done with a few more english channels!) We loved Barcelona, such a great city, and i would recommend this hotel for it's central location.", "Date": "August 28, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Netherlands", "Title": "“In the closet”", "Author": "A TripAdvisor Member", "ReviewID": "UR5041861", "Content": "So, Laietana Palace Hotel it was. 200 euro’s a night. This had better be good. A hint of what was coming came with the nondescript faces of the front desk. The elevator did not level so I tripped while stepping in. The hall was poorly lit, most certainly half the lumen that were used when the marketing pics were taken. The coloring reminded me of soviet style choices. The ever present Mediterranean watercolor paintings could not conceal the dead artist who decorated this. Before the lift started we felt a rumbling. The metro. Wow, every 3 minutes! from 5 am to 2 pm. Room 403. Door open and...... a bed! A soft ‘tabletop’ with again a nondescript flat grayish spread. I didn’t measure it. (hey, how low can you go?) It just fitted the room or should I say 'closet'! Around the bed on 2 of the 4 sides was max 2 foot! space and the feet end had some more but then again it had to hold a minibar, chair, table with TV, internet hub, menu and a comments voucher, all nicely stacked for ……..moving. All you need for a 4 star rating. The bathroom was fitted by the Blind Institute (only in remote India have I seen worse marble tiling, plumbing and carpentry) and most likely the last time they replaced the bathroom kit by was the time they built it. It was full of fungi. Tired of the trip, I took a shower. Alternatively it went from burning hot to freezing cold. Not once but always. Even at full flow! Fire regulations require a floor plan. On the door, I glanced at our room. Everything was there. The elevator, the hall and all the rooms including the beds. Aha! This was a single person bedroom converted into a double! So, this is a management decision and screaming at the front desk won’t work. I just felt the middle finger of the hotel manager/owner in my face. When passing the elevator we also saw a floor plan and I just wondered why they left out the room details on that one. I now knew why. Too many grinning faces! So, there I was. My wife booked the trip and I really love her. She assumed, and so did I, that a 4 star would safeguard against such “classic rip offs”. No such luck. I decided it would not spoil my holiday. I took it like a man and my wife did too. We took a risk and trusted the pictures. This was a write off. I decided I would not have a go at the hotel staff but kick this place where it hurts. Their reviews. Breakfast was in the basement! NO DAYLIGHT! Ever heard of Solatubes? And, yet again, a horrible coloring. What a depressing place. There are plastic coated H-beams with rivets. Why an H beam should have rivets, beats me, but it looked like the high pressure feed hose of a plastic extrusion machine ripped just as the operator was taking a siesta. Granted, the breakfast was OK. ‘Via Laietana’, the road on which this hotel is resided, is one of the main arteries of Barcelona. 6 lanes of never ending traffic. Even on level 4 with sound stoppers, sleep was virtually impossible. It could have been prevented easy with double layer glass. Probably too expensive. The only good thing about this place is it’s location. It’s close to everywhere and we decided to turn mishap into fortune. It gave us the luxury of hopping to every neighborhood without doing detailed planning. Despite that, Barcelona is a nice place. I like it better than New York, Paris or London. More beauty, more clean and more laid back topped off with a pleasant sun and good food. If this review will keep off 10 potential guests I’ll be laughing my head off. With this birdie, I guess we’re even, mister hotel manager.", "Date": "May 8, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Winchester, UK", "Title": "“Tiny room. Bitterly disappointing. Avoid.”", "Author": "WinchChris", "ReviewID": "UR4070416", "Content": "Booked the Romantic package for a 3 day trip to the city. On arrival was given Room 208 which was absolutely tiny. There was barely enough space to accomodate the double bed and small desk with TV. The wardrobe was also tiny- more of a broom cupboard. The standard of room was barely 3 star and within minutes the harrowing face of disappointment was etched on my partner's face. Tears were not a good start to the \"romantic package\". Staff unable to change room that day but we swapped to room 110 which was a vast improvementin size though was more affected by the regular rumblings of underground trains beneath the hotel. Bathrooms were OK. Enjoyed the jacuzzi. Fantastic location adjacent to the Latin quarter Public parking nearby. Mediocre breakfast. Overall vastly over-priced for what you get. Would not recommend or go again but if you have booked or get a deal then ring ahead and avoid any of the -08 rooms (I checked each floor and all the tiny rooms are stacked on top of eachother)", "Date": "October 29, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Helsinki", "Title": "“Tiny rooms!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4018716", "Content": "We had a special celebration package at the Laietania Palace Hotel in Barcelona. The twin room was really small even for one person not to mention us, a couple. The bed was hard and narrow and probably origanally meant for only one person. There was apprx. 30 cm room on each side of the bed and about one meter between the bed and third wall. We could hear everything happening in the neighbouring room which was really unpleasant. If you choose this hotel do require excact information about the room you're supposed to stay-in in advance!", "Date": "October 13, 2005"}], "HotelInfo": {"Name": "Eurostars Laietana Palace", "HotelURL": "/ShowUserReviews-g187497-d234574-Reviews-Eurostars_Laietana_Palace-Barcelona_Catalonia.html", "Price": "$152 - $384*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">17 Via Laietana</span>, <span class=\"locality\"><span property=\"v:postal-code\">08003</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "234574", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/00/15/00158d0e367740ec7c22667b47931a112large.jpg"}}