{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Clean, comfortable and quiet”", "Author": "bagladyolg", "ReviewID": "UR126907391", "Content": "After spending 2 nights at a gaming hotel, we moved over here and were very pleased to have done so. They were undergoing some construction so the elevators were very slow but I don't think that will be a problem when they finish. It was just such a pleasure to be able to walk into the hotel, through the lobby and up to our room in a matter of minutes as opposed to walking through a noisy casino, although I know that is why alot of people go to Las Vegas. The pool area was clean and tidy and easily accessible. The rooms were great. We had a one bedroom suite with a kitchen and washer and dryer. The room was clean and the bathroom was nice and big. It is definitely off the main drag but we had a rental car so it wasn't a problem getting around. There is a little coffee shop and mini grocery downstairs where you can get food. We bought coffee and bagels and brought them up to the room where we could eat at our leisure. It was a nice change from having to eat at a busy hotel dining room. A freat place and I would most definitely stay here again.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Very nice Hotel”", "Author": "Adolmoni", "ReviewID": "UR126186967", "Content": "I just stayed here last week, and i had a very nice overall experience. Staff was very helpfull and friendly, hotel was very clean and modern, and the pool was fantastic. Location is a bit out of the main strip and you do need a vechicle to get around. If you are here for a conference the hotel is located right next door. There is no restaurant or casino on site.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Meridian, Idaho", "Title": "“Great stay. Good location for Convention Center. Nice rooms.”", "Author": "dfndr90", "ReviewID": "UR126049837", "Content": "Just stayed in the Hilton Grand Vacation by the Las Vegas Convention Center. This is a great location if you are exhibiting or attending an event at the convention center. It is off the strip, and you either have to take the monorail or a cab to get to the strip. I took the monorail, which was a great way to get around. The rooms in the hotel are renovated and like new. They are clean, modern, large and comfortable. It is so nice to have a refrigerator, microwave, toaster, and coffee maker in the room. The room was nice and large, I didn't feel like I was staying in a box. The room also had a blu-ray player. They also offer free wi-fi which is a plus. The deli and market have a great selection of drinks, snacks, alcohol, and other items. The deli offers sandwiches for breakfast, and lunch. Also a nice selection of pastries. If you don't mind a bit of a walk, there is an AM/PM down the street. The pool and grounds are very nice. There are two lounges to hang out. There is an active lounge with ping-pong, pool, and a large screen TV. There is also a quiet lounge if you want some peace and quiet to read or just relax. I would recommend this hotel, especially for $99/night. It is nice to walk in and go right up to your room and not have to walk through a smoky casino.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Milwaukie, Oregon, USA", "Title": "“Nice, quiet place to stay - just off the strip”", "Author": "notamac", "ReviewID": "UR125909220", "Content": "Stayed in one of the 2-room suites. Had a decent view of one end of the strip. The room was great - we didn't care for the view from a different room so the staff let us check a couple rooms for a better view. They cared about our comfort and enjoyment. Don't stay here if you want a casino in your hotel. It's a nice, quiet place to stay. We thoroughly enjoyed it.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Amazing and exceeds all expectations”", "Author": "Honestopinionalways1", "ReviewID": "UR125755187", "Content": "i was so pleasently suprised to find this gem of a hotel!!! just so well located and so glad i didnt stay on the strip. there is ample parking and the suite we stayed in was phenominal they have through of everything and the service was super gold star!! i did not want to leave and my husband and daughter felt the same. the tubs had jacuzzi's and the beds were so comfortable even the toiletries were peter thomas roth which i love!! didnt even need to pack my toiletries> very near the strip we took a cab there and it was just minutes away. i will be returning to fully enjoy it more", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Wylie, Texas", "Title": "“Very nice, but under construction.”", "Author": "SusanPitman", "ReviewID": "UR125698340", "Content": "Loved the room--we had a suite with a king-sized bed. Wonderful big tub, great shower, nice and clean. We had paid for a bed-and-breakfast deal, though; but the dining area is apparently under construction (as is half the hotel) so we were only given a voucher for coffee, orange juice, and a sandwich in their convenience store. I'm sure once the construction is done, the hotel will be much better. But we absolutely loved our room. The hotel staff is very nice, and the hotel is a very short walk from the monorail, and from the 108 bus, which will get you most places you want to go. When we return to Vegas, we will definitely stay here again!", "Date": "March 6, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New York, NY", "Title": "“Grimy Slimy and obnoxious”", "Author": "HighTechTraveller", "ReviewID": "UR125207445", "Content": "I stayed for a single night at the HGV at the convention center. The first impression I got when I walked in was bad - there was a bad odor in the lobby and the common areas looked sticky. Kind of reminded me of a seedy motel. The check-in process was painful, even though I was the only one checking in, it took 15 minutes - I would guess it was a new guy, since he kept making mistakes and no one was helping him. When I walked in the room, it was big and had all the appliances - which would be good for anyone looking to live there.The room was not well maintained and was dusty. The bed was not very comfortable. I was very happy I checked out the following morning.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stamford, Connecticut", "Title": "“Quite place in loud Vegas”", "Author": "lvs23", "ReviewID": "UR124680189", "Content": "I think it not easy to find some quite, decent and not outrageously expensive place to stay in Vegas. I believe this was one to go to. There are two things that helps it - no casino on premises and almost at the end of the strip (by Stratospere). Both of these were not an issue for us as we always rent a car while in Vegas. We stayed two night in 1 bedroom suite over the Fri-Sat night which ended up being cheaper than even in 3 star Stratosphere quite (after all the fees added). It was a large apartment with full sized kitchen and Jacuzzi tub. The hotel was very quite and after going out all night we could come back and catch up on sleep in a what I'd say sleep friendly environment. The staff is very friendly and they were fast in processing our check-in and check-outs. I wish I would have discovered this property earlier but going forwards this would be our preferred place to stay whenever we are in Vegas again.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Cruces, New Mexico", "Title": "“First class”", "Author": "Uglybugs", "ReviewID": "UR124281493", "Content": "My wife and I have stayed at this apartment hotel on numerous occasions. The accommodation and set I've has been first class without reservation. I must say that we have been treated in a first class way.by Bill Becker. He has now departed to another hotel however I am sure that all will be fine when we return for February..April and May 2012. Watch this space and I will advise in a true English way.", "Date": "February 8, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great off-strip location with convenient parking”", "Author": "UWHusky1968", "ReviewID": "UR124233399", "Content": "Stayed for 3 nites, just before Super Bowl Sunday, in a studio unit which seemed to have been just remodeled as everything seemed new from the bathroom to the king size bed and even the coffee maker and toaster. We liked the off-strip location that shares the parking structure with the LV Hilton hotel. Parking was easy and convenient and it was about a 10 minute walk thru the parking structure to the hotel casino and restaurants. The staff were all friendly and helpful - check in/out was a breeze.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "NH", "Title": "“Short walk to monorail”", "Author": "eggegm", "ReviewID": "UR123939615", "Content": "Stayed for week. Room was a suite with full living room and kitchen. Bed was very comfortable. No restautants in this hotel so either plan on eating elsewhere or get morning sandwich from hotel deli/store. Concerge and hotel staff extremely helpful and Friendly. We took monorail to strip it was right next store at the Vegas Hotel which has a great buffet for breakfast.Plenty of parking and very easy to get to highways and to airport(4 miles straight shot).", "Date": "January 31, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Columbia, South Carolina", "Title": "“My home away from home”", "Author": "Carldaddy", "ReviewID": "UR123674640", "Content": "For several years I have worked an annual industry trade show in Las Vegas, and for the last three years I have spent the week at this property, which is a 7 minute walk to the convention center. The one bedroom units are clean, quiet and good sized, and it is great to have some room to relax in after a day on my feet. There is also a good sized Jacuzzi tub to soak in, and the beds are comfortable. The suites come with a complete kitchen with utensils, serving plates and cookware with dishes for four and there is an Albertson’s Market less than a mile away. (East on Karen Ave to S Maryland Parkway, located in the plaza on your right) I will usually cook several meals in the suite rather than fight the crowds, and breakfast without having to get dressed is always nice. There are also a couple of gas grills in the pool area to grill on. My total food cost for the week was just over $100.00 because I like to cook, but the restaurants and casino at the LVH property are less than a three minute walk if you are in the mood for more activity, unlike the Vacation Club on Las Vegas Blvd which is somewhat isolated. There is also a monorail stop in the LVH which can get you to the busy part of the strip for $5.00. I highly recommend this property if you are looking for a quiet, comfortable place to stay while needing access to the convention center..", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Guadalajara, Mexico", "Title": "“Great Hotel! Not in the strip”", "Author": "nunezjorge88", "ReviewID": "UR123549406", "Content": "This is an all suites hotel. Recently renovated. We got a one bedroom suite, It had a big bathtube, a shower, a very big bathroom a fully equiped kitchen (Oven, Microwave, dishwasher, dishes, glasses, big fridge, etc). The bedroom had a kingsize bed and in the living room there was a sofa bed, two 32inches lcd tvs and bluray players were available in the room. All carpets and furniture were new and smelled like new, I really think this hotel was our best option. It has a pool, not to big but is enough, not used by ourselves, it was cold outside. The staff was very helpful and polite. You dont get bored at this hotel, woth BBQ grills in the courtyard, and a games room. Not a casino here, but there are a lot in the strip. I recommend it as one of the best hotel I have ever been.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Torino, Italia", "Title": "“Great place”", "Author": "MarcoTarpi", "ReviewID": "UR123500642", "Content": "Excellence place to stay, good confort and clean room. I stayed there three days and also baby was always in good condition. Very close to downtown and very quite: I'll return in this hotel the next time. Good breakfast and restaurants. Great time !!!!!!!! I suggest you to go there to life Las vegas and its casinos", "Date": "January 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Everything i expected and more.”", "Author": "nicksair", "ReviewID": "UR123376457", "Content": "I had made a reservation for a 1 night stay here Sunday Night into MLK Jr. Day at the last minute when i had got into town. Great rate too after the AAA discount. I had requested a room on a high floor and away from the elevator when i had checked in, and they accommodated that request. Got a 15th floor room overlooking the eastern part of the Valley. The room was larger than i was expecting, the bathroom, while a little small, did its job, so i had no problem with the size. The free parking is a huge plus and well lit at night. I think what stands out for me and others is, the location in relation to the strip, while off of the strip, you are not far from the action if you desire to go there. I generally dont as i've seen it enough, and this was a visit to see friends and family who live in the area. If you want to be close, but not right on the strip. I think this is the place for you. I'll most definitely stay here again when i need a hotel in Las Vegas.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pinedale, Wyoming, USA", "Title": "“My favorite Vegas hotel”", "Author": "WyoBus", "ReviewID": "UR123275633", "Content": "After we discovered the HGV, we continue to return here on every trip to Vegas. We love the King Suite with jetted tub, kitchen, large comfortable living area and washing machine and drier. Lovely pool/hot tub area as well a small but adequately stocked shop where you can purchase a light meal. Just a block off the strip so peaceful but still within easy reach of all the entertainment Vegas has to offer", "Date": "January 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Munich, Germany", "Title": "“Good quality with very reasonable price”", "Author": "Alexander Z", "ReviewID": "UR122272161", "Content": "This is an excellent value for the price, and overall high quality. We had a single room suite with small kitchen with microwave etc. Hotel is not at the strip, and is not a casino, the quality is compared to a normal Hilton hotel chain most likely comparable with a very good 4* property. There is a small shop to buy everything you need with a reasonable price, of course going to a supermarket is cheaper, but I was still impressed by low prices. Room was renovated in a timeless nice quality, good bed, large TV, practical bathroom with bathtube with shower. Staff was very friendly everywhere in the hotel, concierge was able to organize everything. We planned to spend one week in Las Vegas and booked by intention not at the strip to have some quite time. There is a Monorail station and a bus stop 300m away from the hotel, making it easy to get to the strip within some minutes by bus and with the monorail to the largest hotels. The Stratosphere tower is in walking distance (12 min). I think key to know is that the hotel is not at the strip, and even if you walk to the strip to the Stratosphere tower then you're in the most northern part of the strip. to get to Venecian/Bellagio etc you need to take bus/Monorail/Taxi.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fort Erie, Ontario", "Title": "“Quiet, Convenient, Central & off the Strip”", "Author": "Chrystal H", "ReviewID": "UR122259473", "Content": "We stayed a week here on our first trip to Lost Wages. We're non smokers & non gamblers, and still found a ton of things to do. It's right on the monorail trail, $5 a trip or $12 for 24 hours. Do the 24 hour one. Go out in the evening and go out out again in the morning on the same ticket. No lineups to check in or out, no casino to walk through to get to the front desk. Self parking directly out front, minimal walking. The concierges are very friendly and helpful, and have discount show & restaurant tix if you ask. This property is a time share, so be careful you don't get sucked into a sales talk in return for free show tickets. The pool is open all year round. There's a little over priced deli/store on site, but well stocked & convenient. A games room for the kids. Lobby will start being renovated Feb/12. The rooms were finished just last week. They're good sized rooms, ours was a studio, fresh & new decor, still has that new car smell, with a kitchenette, but no stove. Tip the housekeeper well, and she'll do your dishes and maybe leave extra coffee for you. The bathroom was minuscule. The door cleared the toilet by 1/4\". We were on the top floor and had an excellent view, although part of it was of the parking garage. There was free wifi but the hotel internet was .50 a minute. I saw it as cheap as .25 a min, so hunt around. The big old Hilton, soon to be renamed LVH, is directly next door with all the amenities and a pretty good buffet. The best one is at the Fremont hotel, right on Fremont st., for 15.00 for dinner. We'll stay here again. We love Vegas.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NY", "Title": "“Extreme Comfort & Space with a View”", "Author": "STraveler2", "ReviewID": "UR121947033", "Content": "There are lots of Hilton's in Las Vegas. This Hilton Grand Vacation Suite on Karen Avenue is quiet, convenient, recently upgraded, comfortable and had a great view. We loved the separate living room, the full kitchen and the view of the Stratosphere Tower. In Las Vegas, unless you use valet parking, you can walk a mile from your car to your room, but this parking was convenient. It is also a short walk to the monorail and the larger Hilton Casino with its restaurants, shops and entertainment. If you need to be at the convention center, it's also a short walk through the larger Hilton. All in all I would highly recommend. Extremely comfortable, clean, convenient and relaxing. About a block 'off the strip' but monorail takes you to the strip. .", "Date": "December 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "saranger", "Title": "“One pleasant night in a small room”", "Author": "saranger", "ReviewID": "UR121934725", "Content": "Spent one night here last week. Spent four total in Las Vegas in different properties to retain diamond level for 2012. Check-in with Julian was efficient. Only problem was we had reserved room on different credit card than we paid for. Deposit not automatically refunded (we had to call this week and specifically ask that charge be reversed). Given a studio room on 14th floor with view of golf course. Nicely remodeled, but room was our smallest in our Las Vegas stay at 4 Hilton properties. Wouldn't want to be here for more than a few nights. Room was quiet and well-lit. Too cold to use pool, but it looked lovely. Free wifi to HHonors Gold/Diamond. No breakfast offerings for Diamond HH members nor free public computer (like Hampton or Doubletree), but quiet and active lounges were nicely outfitted for fun and relaxation. One packet of coffee provided, no matter how long your stay. Additional coffee available for purchase in the on-site store. Stayed here about 7 years ago (in Feb) and would like to visit when warmer to take advantage of the pool. Off-Strip location is great for family or non-casino types. If you have a car you're a short drive to many restaurants. Fridge and microwave allow for easy re-heat of leftovers. Would return but I also know what to expect.", "Date": "December 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“My Home in Vegas”", "Author": "AngelaMaryland", "ReviewID": "UR121506774", "Content": "I come to Vegas for Work about 4-6 times every year and this is my favorite place to stay. Five reasons why staying here is perfect for someone who's not too interested in the excitement of the strip: 1. The amazing Staff- from Front Desk to Housekeeping, this property employs wonderful, kind and friendly people. The ladies in the Deli are my favorites- and I love Martin at the front desk. 2. The Deli/ Grocery Store- I work long days when I am here and the convenience of having a mini-grocery and deli right dowstairs is such a nice perk. They have wine and beer and made to order breakfast, lunch and dinner. 3. The rooms- super clean, very quiet and the beds are so comfy 4. The location- off the beaten track but convenient to the LVCC and within walking distance to the Monorail 5. NO CASINO! :)", "Date": "December 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Prague", "Title": "“Oasis of silence yet close to the Strip”", "Author": "Alexx84", "ReviewID": "UR121124979", "Content": "We came there after almost 3 weeks of travelling for relax. There is no casino in-house which I see as benefit as if you want it, you can go downtown. It is only minutes away from Monorail an the Strip, but it gives you nice silent break. Nice pool, not big, but bigger than the averige motel one.", "Date": "November 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Better than expected”", "Author": "U646", "ReviewID": "UR121081861", "Content": "We recently stayed at this property. We had one of the rooms that has been recently renovated. I was very impressed. They have done a wonderful job updating this property. We parked in the Hilton Casino North Parking Garage. Just drive straight up to the fourth level. You can park right next to the elevator. The rear door by the pool leads straight to the hotel elevators. Very quick in and out. We had a nice view of Las Vegas Country Club and mountains off in the distance. We have stayed at The Hilton Vaction Club on the strip before. This property is a very nice alternative to that. Certainly this is a better opion if you dont have children. This property is smaller and more relaxing. The pool is not as big as the Hilton Vacation Club on the strip.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Toronto", "Title": "“A bit better than expected in some ways, worse in others.”", "Author": "FrequentFlyerYYZ", "ReviewID": "UR120471606", "Content": "We were given one of the recently refurbished suites on an upper floor. Most everything felt nearly new although stark. Yes, there is noise during daytime hours (Nov 2011) from construction in the building and we spent one day (out of 9 day stay) with water shut off from 10am-3pm which was inconvenient but understandable. written notice was provided the day before. Lobby area is a bit tired. Pool area is small. building is pretty much isolated and surrounded by parking lots. You will want to have a car as you are a 10 minute walk from the strip and as far north as you would want to be, considering the unsavory areas north. Monorail station is a 5 minute walk but it is pretty much a white elephant with limited stops in addition to being expensive. We are HGVC owners but got pressured into listening to an upgrade pitch, in exchange for a Hilton comp or free shows. It was interesting to watch the sales pro's at work but spent a solid 3 hours in exchange for $90 worth of comps. Should have just said no. Problems with unit: Black out curtains are filthy. Must have been marked up during recent reno. No sheers. Ice maker in fridge makes mouldy ice. Electrical socket in kitchen tripped circuit breaker a few times ( maybe a ground fault).", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "las vegas", "Title": "“Great Room”", "Author": "wmlv", "ReviewID": "UR120240413", "Content": "Live in Las Vegas and was attending an event at the LV Hilton. Have stayed at the Hilton before but decided to try the Grand Vacation property since it shares the same parking lot and garage. Great room! Only got to stay one night. Was upgraded to a one bedroom suite that was newly renovated. Full kitchen with all amenities.....even a new blender and pull-out faucet in the sink. Better than my house. The jet tube was large and deep. Two large flat screen tv's. The room also has its own washer and dryer and free internet. I used the Hilton web site and booked with AAA rate. The front desk attendant (Kari?) was wonderful. Very upbeat and friendly. I will still here again whenever I get the chance.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bettendorf, Iowa", "Title": "“Perfect Place to Stay for Convention”", "Author": "KenandShenea", "ReviewID": "UR120115195", "Content": "We stayed at the Hilton GV after researching several properties recommended by the organization hosting the convention. We chose this property based on the reviews from Trip Advisor guests and couldn't have been happier. We knew it was off the strip -- which wasn't a concern to us. Taxi's were mainly easy to come by. You can also call the front desk and they will call for a taxi for you. Taxi from airport was about $30. Taxi to old downtown was about $15. Taxi to strip anywhere from $10-$20 depending on which part of the strip you are going. The hotel is lovely -- extremely clean and very nice. We had a suite on the 12th floor, gorgeous, brand new. Kitchenette, fridge, micro, all the utensils, pans, dishes, awesome. Little mini mart on main level -- pricy but great to pick up a loaf of bread and dozen eggs, gallons of water for the room. Doubl sink bathrooms, spacious shower -- beautiful jacuzzi (never used but it looked nice). The only funny thing in the bathroom was the height of the mirror. My husband is about 6'1\" or so and he had to hunch a bit to fit in the mirror. Beds are nice, I've stayed at Hilton Hotels before and had better pillows, pillows are OK. Pool is nice, shady till about 9:30 or 10:00 then full sun till about 4:30 or 5:00 then sun is behind buildings. Maids did a really good job -- tip them well -- every single day. We never had the same maid. Bless their hearts for cleaning up after us and being exposes to the chemicals and the labor. They are in the process of remodeling their rooms - very nice. They notified us at check in that the workers will work from 9a-5p every day and they did, lots of banging if you are in the room you can hear this. One day I heard it for a couple hours while getting ready. But ended right on time. They do say they keep the floor directly above and below empty but construction noise travels. This is right next to Hilton which is connected to the Convention Center -- many people stayed at that hotel as part of the convention and said it was a dump. This is SO WORTH the 5 minute walk. Easy, easy, easy. Monorail is easy to use - we used it once to get to Harrah's for their Oyster Bar. GREAT but a lil spendy at $25 a dozen. Tried to use it two other times and it was out of commission. Don't rely on it soley.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Quiet, but isolated.”", "Author": "FunkShaman", "ReviewID": "UR120071579", "Content": "Best thing about this hotel: The staff was very accommodating and helpful. Worst thing about this hotel: The Location. It is off-strip with no regular taxi traffic, so you will need to call for a taxi pickup, which will take 10-15 minutes minimum. The hotel is on the edge of some pretty sketchy neighborhoods, and about a 15 minute walk the strip. (But you can walk next door to the LV Hilton and catch the monorail. But I would not advise walking to and from this hotel to anywhere, unless you are in a group. Suites are spacious, very well laid out and well appointed. Furniture is a bit dated, but in very good condition (the building is under renovation as of 10/31/11) and the furniture is being refreshed. The amenities are very basic - there is a deli and a convenience store, but no full service restaurant or room service.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“First stay off the strip”", "Author": "moprep", "ReviewID": "UR120039375", "Content": "After about 18 trips to Las Vegas, my first hotel stay off the strip was at the Hilton Grand Vacations Suites at the Convention Center. I am happy to report that I will never stay at a Strip hotel again unless absolutely necessary. As I always rent a car, the convenience of this property is great. Staying off the Strip allows you to get around faster and easier. If you are not renting a car, there is a monorail stop at the Hilton, which is next door, and a quick 5 minute walk. As for the hotel, it's unusual to stay 4 nights and not have any issues, no matter how minor. Bed was comfortable, shower was good, amenities were more than adequate, and a very friendly staff everywhere in the hotel you go. And no resort fee, a common charge everywhere else in LV. This place will definitely get my repeat business!", "Date": "November 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“One my preferred HGVCs in Las Vegas”", "Author": "Bayarearesi", "ReviewID": "UR119795573", "Content": "One of Hilton's Newer Grand Vacation locations. We stayed in a 3 bedroom 2 bath suite. Great room, clean. Love the kitchen and master bathroom. It's about a 5 10 minute drive to the main strip and about a 20 - 30 min walk to the Encore shopping center. My preference is to stay off the strip and avoid the crazy traffic, so the place works well for my family. It's has great access to the highway too for easy detours away from the strip for hiking at the Valley of Fire and Red Rock. Definitely will return to this location again.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Meet our needs.”", "Author": "aussiecocky", "ReviewID": "UR119649851", "Content": "We selected this hotel because is was not near the Strip, no casino and stated as \"family friendly\". It meet our needs completely including the on site deli. The staff were helpful and friendly, the room excellent even with building works overhead but they finished by 5pm. Only wish the Hilton hotel names were not so similar as the Grayline shuttle took us to the wrong Hilton, even though we had told him which Hilton we wanted.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Winston-Salem,NC", "Title": "“outsatnding in every way except location.”", "Author": "TheScanian", "ReviewID": "UR119562817", "Content": "A very nice hotel at a great value. Rooms are clean,staff is awesome, a 2 minute walk to the LV Hilton no complaints at all about the hotel except...location..The LV Hilton is a real dive and it is a 10-15 walk to the Strip through fairly \"iffy' neighborhoods. If you are with a group no problem, but I would not walk there alone late at night. I would definitely stay there again, but be prepared to walk.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Northeast US", "Title": "“It Really Just Sucked”", "Author": "SteelBeach", "ReviewID": "UR119265860", "Content": "There are probably 100 better places in Las Vegas. First of all, it really isn't near anything else except the Hilton which is probably a 5-10 minute walk across the parking lot. Sometimes there is a cab outside, but, if there aren't, you're walking back to the Hilton. They have a nice deli place - but it closes at around 9 (I think). Housekeeping is useless - one day they didn't bother to clean up the little kitchen area and the next day they never got to cleaning the room by the time I returned from business meetings at 3:00. I called and asked when they could do it (I wanted to get some rest) AND THEY COULDN'T EVEN GIVE ME A TIME. Other people have mentioned the construction and it sucked, too. Just a bad experience all the way around. There are far better places to stay in Las Vegas at a much better value.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Denver, Colorado", "Title": "“Quiet, nice, large”", "Author": "rockies411", "ReviewID": "UR118870008", "Content": "Stayed here for one night while waiting for another hotel's reservations. Had king suite, it was huge, quiet and nice. Quite a bargain! Easy access to strip via short walk to Hilton for Monorail ride. Nice place if you want to stay in vegas, but be able to get away from the strip.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manila", "Title": "“The full kitchen spelled the difference with a real surprise bonus, NO CASINO.”", "Author": "Amigomo", "ReviewID": "UR118800145", "Content": "My wife and daughter wanted to see the strip but not the casinos. The lights but not the smoke and lotsa people. The sober people not the drunks and gamblers. The sunlight but with the pool. The clean shower but the jacuzzi was a real treat/surprise. The strip was seen from the window but not as close to the maddening crowd. The Hilton grand suites was just awesome.", "Date": "September 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sun Lakes, Arizona", "Title": "“vegas trip”", "Author": "valeofclyde", "ReviewID": "UR118744553", "Content": "Good hotel friendly staff nice location quiet area,handy for Hilton hotel and casino,close to Monorail which takes you all over strip to MGM Grand.The hotel has a nice cafe and lounge area.The pool is handy for guests.The only flaw is check in is not till 4.00 p.m. and our Westjet flight had us there at 10.00 a.m. and we had to store our luggage etc. and wander . All in all very good.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“GREAT”", "Author": "alan w", "ReviewID": "UR118712279", "Content": "this is the place to stay if you want to be away from the turmoil that is Las Vegas.Go where you want very easily during the day and night and then go back to this place and enjoy the peace and quiet, Has everything you need and you can walk to the hilton casino. Staff here were the best,especially the front desk and deli. We had a 1 bedroom for a great price and the kitchen is there if you need it,but with the hiton over the road and lunch and dinner buffets for 15 and 20 dollars all you can eat and drink,why cook. Going again next year and will stay here for sure.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brampton, Ontario", "Title": "“Great business experience”", "Author": "Brad-martin", "ReviewID": "UR118492575", "Content": "Was at the LVH Convention Center for a conference. The apartment style of the room made for a stay that allowed more of a feeling of coming home after work. The ample living area with separate bedroom took away that clostrifobic feeling of a regular hotel room. The kitchen allowed me to buy and cook my own food and make snacks and a bag lunch to take to the trade show booth with me. Overall it was easier on the show budget without having to spend money in restaurants each evening and made me less inclinded to go out with such a relaxing and roomy environment to come back to each day after long hours on the tradeshow floor. The decorating could use some modernization, but that is my only suggestion.", "Date": "September 23, 2011"}, {"Ratings": {"Location": "3", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Charlotte, NC", "Title": "“Nice but really needs to step it up..”", "Author": "CamandKay", "ReviewID": "UR118247513", "Content": "My husband I went to the resort from Sept 10th-Sept 15th. We stayed in a 2 bedroom unit which is actually a 1 bedroom with a lock out studio. For years the HGVC at the Las Vegas Hilton has always received the better reviews of the the other two. ( one on the north strip and the one at the Flamingo) This was our first visit to this property. We stayed about 5 years ago at the Flamingo HGVC. I must say, the Flamingo property is a bit nicer. I have no information about the newest one on the North end of the strip. We exchanged our timeshare and were notified one week before our travel of CONSTRUCTION. I completely understand that this must happen at every resort but i wish they would have notified us before we booked the resort. Thank goodness we were early risers because you could hear the jack hammering from 9am to at least 4pm every day. They also gave us a nice sheet of paper at check in advising us that there would be no water in the room from 10-3 on wednesday. In vegas that probably would not be a bad thing in the middle of the day but it was just another thing that frustrated me. The rooms are nice but again in need of an upgrade. I believe they have 17 floors and they have started the renovation and are only on the 16th. They started at the top. We were on the 7th floor and we could hear the noise very clearly. ( I feel sorry for the people that were higher than us) It was nice to get away from all that smoke. The Las Vegas Hilton is a short walk away and so is the Monorail. The Las Vegas Hilton is a bit outdated but they appear to be renovating it as well. We rented a car so we were in and out and had no issues with transportation. The deli and store there is small but nice and semi reasonable. The pool is cute but i was actually surprised how small it was. I cant imagine it being sufficient in the summer with the resort being full. They have two different lounges with a pool table and ping pong area. They have a computer in the other lounge. The gym was pretty good. We had a good time and i am glad they are updating the resort. I dont think i would return to this spot for awhile. The staff was friendly and no complaints about that. I was just a bit annoyed that we did not know about the construction until a week before we were to arrive and we could have gone elsewhere and not have dealt with the jack hammer.", "Date": "September 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "4"}, "AuthorLocation": "North Carolina", "Title": "“Nice, but needs updating!”", "Author": "g35girl", "ReviewID": "UR117976216", "Content": "Just returned from a 3 night stay in a 1 bedroom suite. The room was clean and the bed very comfortable, however the entire suite was very, worn and dated. The wallpaper peeling off the walls, furniture and carpet heavily stained and old, picture tube TVs (hahaha). I won't comment on the location as others have covered that, however I will mention that if you want the \"Vegas\" experience this hotel is not it for you. Also, just for clarification...there are smoking rooms available. I was asked at check-in if I have a preference. Perhaps, only the 1 bedroom suites have that option, but the entire hotel is not smoke free. Personally, I would not stay at this property again, primarily because of the location. For the price I paid, I could have stayed on the strip and had more options for food & entertainment within walking distance.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“this let's the secret out”", "Author": "liveandlearn99", "ReviewID": "UR117923587", "Content": "I hesitate to write this review at the risk of not getting a reservation when I want it. This was a great hotel for us, but might not work out for people with small children. We usually stay at the HGVC on the strip when in Vegas but tried this and really liked it. The parking situation is so easy here and no addl charges for it. We didn't use the little deli-it is expensive and with kitchen facilities its smarter for us to go a couple miles and buy groceries. The pool isn't very big but we were well able to swim laps on the diagonal and the pool was never very busy. There aren't any fun additions (lazy river, etc) that kids look for in a pool which probably explains why we only saw 2 kids there in the 6 days we stayed. Barbq grills are easily accessed right by the pool. Tools for the barbq are available to use from the deli. There is an offer to go take the vacation club talk on becoming an owner but they weren't pushy. At check-in we were clearly told construction was being done on the upper floors for updates. We stayed on a lower floor and never heard any noise. It was quiet and comfortable-just what we look for in a vacation stay.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Excellent Hotel!”", "Author": "Toronto_Maverick", "ReviewID": "UR117096596", "Content": "Stayed here for 6 nights during my business trip in Aug 2011. My one-bedroom suit was fully furnished with dishwasher, washer and dryer and sparkling clean every day (although room itself was a bit outdated). As other fellow travelers mentioned, hotel is 5 min walking distance to “monorail”, which makes the commute to the strip very convenient. The mini café in the lobby was also a nice touch for travelers to get a quick snack, coffee, etc (although very expensive). Used the pool once and it was cool! Gym was very well ventilated, the TV equipped treadmills being the highlights! Three minor complaints: 1) my 7:00 AM wake-up call rang at 5:00 AM and 2) water outages throughout the day was very inconvenient 3) internet speed was SLOW", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Belleville, Illinois", "Title": "“Great Place, Great Time”", "Author": "BMWorking", "ReviewID": "UR116954634", "Content": "I went to Las Vegas for a reunion with friends from my military days...you know what they say about military, once a friends , always a friends. I stay at the Hilton Grand Vacation Suites - Las Vegas (Convention Center), which an excellent resort hotel one block off the strip with all the comfort of home. I had a one-bedroom suite with a large spa tub in a room between the bedroom and the bath/shower area. I had all the comforts that I would have had if I were of coming back to my own home...free Internet access, kitchen, dining area, living room, full king size bed, spa tub...which I don't have at home. The HGVC has a nice size swimming pool with a bar next to it, which is great because you can get a nice refreshing drink to cool off in the hot Vegas weather. They have an entertainment room with a pool table, meeting room, a quite room to go relax or read and a fitness center. Lastly, if you are on business they can handle that too in one of their conference rooms and they have a business room with computer and printer. The staff is very friendly and professional and they go out of their way to accommodate your wishes. I truly enjoyed my stay at the HGVC", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Hartford, Connecticut", "Title": "“Not the best but not the worst”", "Author": "jayers4", "ReviewID": "UR116572019", "Content": "I thought a Hilton would be great, but I was not too impressed. The bed was very comfy and the room was very clean, but it was also very cold. The heat was not working properly and no one could fix it. The EnergyStar lights were very dim and half only turned on half of the time. Housekeeping came everyday to clean, which was nice. However, I ordered a food package to be delivered to my room, and it did not arrive until I called three hours after check in. Even then I got the run around on who to call. The front desk told me to call housekeeping who told me to call the deli who asked if I wanted to pick up the food. I said I thought it was being delivered. When it arrived, another 2 hours later, I was charged $8 for delivery. The deli was two floors down. Had I known that, I would have just picked it up. The TV and DVD player were nice. I don't think I would stay there again. It was just so-so. There is a small kitchenette in the room.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sacramento, California", "Title": "“Really nice place away from the mobs and craziness on The Strip”", "Author": "SMFguy", "ReviewID": "UR116498424", "Content": "This was our second time staying here......the place hasn't changed since our last visit 7 years ago. And, it's just as I remember it. Beautiful, spacious comfortable suites. Very nice pool area, well maintained. A mid-sized property that makes it feel not nearly as crowded as places on The Strip....or the Las Vegas Hilton right next door. Our 1 BR suite came with fully equipped kitchen and a large living room. Our friends stayed in a single room which is comparable to a Hilton Garden Inn type accommodation (microwave + fridge, no separate living or eating areas). Access to the monorail was very easy....only a short 5 minute walk away. However, if you plan on using the monorail as your primary transportation to/from The Strip, be prepared for a LOT of walking. All the stations are at the BACK of each resort and you have to traverse the casino and shops of each in order to get to Las Vegas Blvd. We bought a 3-day pass and used the monorail almost exclusively throughout our long weekend.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“We will definitely go back”", "Author": "Transcend68", "ReviewID": "UR115798723", "Content": "The rooms were spacious which I love. They had a decent pool area. Two grill near the pool. Full kitchens. Off the strip. This is the perfect place to stay if you have kids. I reserved two one bedroom suites and I got them for less than $500 for the fourth of July weekend. I loved it.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Shreveport, LA", "Title": "“Home away from home”", "Author": "avick2007", "ReviewID": "UR115635697", "Content": "Since we were there for a convention at the convention center, this was a great location for us. The layout of the room was awesome...three girls and no trouble fitting! All three of us could do our make-up in the bathroom together and luggage was not in the way at all! It was great to have so much room. Also just a few minutes walk from the Hilton Monorail station which takes you right to the strip. We were also within walking distance of Bonanza, the largest gift shop in Vegas. Would stay here again, or at least would try for one of the other properties!", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Arundel, United Kingdom", "Title": "“Great value for a spacious suite”", "Author": "Peltt", "ReviewID": "UR115334345", "Content": "We had a really enjoyable stay at the Hilton Grand Vacation Suites. Our suite had more space than the two of us really needed, but it helped make us feel right at home there for our four night stay. We visited a local supermarket and made our own meals using the kitchen facilities in our suite. We were also able to keep a stock of fresh clean clothes with the laundry facilities in the suite. There was ample storage space too for clothes and bags. The large bedroom and living room were both very comfortable and well furnished. It was good to return and relax there after hours of seeing the sights of Vegas. We used the open air pool each day and the hot tubs for some more exercise and relaxation. Parking space was always available near the hotel entrance. The best part of all was the great rate for our suite!", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5"}, "AuthorLocation": "Sardinia, Ohio", "Title": "“What a great room! We will be back!!”", "Author": "SDDay", "ReviewID": "UR115103766", "Content": "We spent one night here before our drive to Phoenix. We had a one bedroom unit and the rate was super cheap. We would have loved to have spent several nights here. Close to tram to go to strip. Very quiet...", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0"}, "AuthorLocation": "Bartlett, Tennessee", "Title": "“Like test driving a go cart when they want to sell you a Mercedes....”", "Author": "wolfwatcher2000", "ReviewID": "UR113322104", "Content": "We agreed to sit through this time share ploy because of the good value for this extended weekend getaway. Thought we would at least be given a suite. Was told we had to pay an additional $35 to be bumped up from the studio to the suite. The room we received was smaller than a Hampton Inn (on the lower end of Hilton hotels). The room never cooled either of the two nights we stayed there. If you are looking for a clean room, don't mind the timeshare deal for about 2 hours and are planning on having a rental car, than you could consider staying here. If you are looking for something closer to the action and a little more luxurious, this is not the place.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Cincinnati, OH", "Title": "“A pleasant surprise”", "Author": "tfitz928", "ReviewID": "UR113218301", "Content": "I've never stayed at a Hilton Grand Vacation property before but the price was right so I decided to try it. I was very pleasantly surprised. Lots of room, great location, very friendly staff.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hayward, California", "Title": "“Recommendable for family”", "Author": "myli08", "ReviewID": "UR113167139", "Content": "We loved the place and we will be back. They gave us the suite with kitchen and spa inside the room. My kids enjoy swimming downstairs. Facilities are clean and employees are friendly.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Enjoyed ourstay at HGV Suites”", "Author": "rayo91", "ReviewID": "UR112997590", "Content": "We are RCI members and stayed for a week at the HGV on Las Vegas strip. It is very conveniently located and within walking distance to the famous hotels on the strip like Wynn, Treasure Island, Venetian, Paris etc. The service was good and the concierge staff extremely helpful. The hotel was clean and had very good amenities in the room like kitchenette, washing machine, dryer, microwave and a fridge. The view from the top floors was awesome. All in all an enjoyable experience and worth a stay.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Gainesville, FL", "Title": "“Nice accommodations and free parking!”", "Author": "Sewaldro", "ReviewID": "UR112099020", "Content": "I was attending a conference at the Las Vegas Convention Center and my husband came with me to Las Vegas. We enjoyed the nice accommodations at the Hilton Grand Vacations with a fully equiped kitchen, soft bed, large bathtub, and free parking! Most hotels charge for parking, so it was a breath of fresh air to have a large parking lot with plenty of open spaces and no charge daily. There was a security guard patrolling the lot as well. Also, my mother had a facial and pedicure at the Hilton Grand Vacation Spa (on the Las Vegas strip) and she received excellent service.", "Date": "June 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Very Wonderful Accommodation”", "Author": "cbar0906", "ReviewID": "UR111187371", "Content": "Stayed her with my family for 5 days. We had a 2 bedroom suite on the highest floor. It was a very well kept hotel. The rooms where huge. The kitchen was functional that has everything we needed. The main bedroom had a spa bath which my aunt loves. We had washer and dryer inside and a living living and dining area in between rooms. Staying here was very comfortable. They have sofa beds in the living room and in the second bedroom. The hotel's amenities was good. The only thing that would make this a perfect hotel was if it was a bit closer to the strip. A plus is their free WIFI connection. All in all it was a wonderful stay.", "Date": "June 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Great family fun atmosphere!”", "Author": "seanmao858", "ReviewID": "UR110799915", "Content": "Duration of Stay: 3 nights, May 27 - May 30 Occupants: Myself, 6 mo. pregnant Wife, 9yr old Son, Sister in Law, 2 friends Accommodations: 1 Bedroom Suite This resort is a little hidden but still easy to find, just remember it is on the corner of Paradise and Karen. Check-in was easy and the lobby is just excellent and clean. After checking in, our family approached the elevator and found that an inconsiderate person put out his cigarette butt in the elevator but other than that, my pregnant wife and my 9 year old son never ran into an incident where they smelled smoke. The resort staff quickly addressed the problem. Concierge was rude. We asked her questions about various shows and wanted to compare pricing between different seats. Our whole conversation did not even go on for 5 minutes and she just asked if she could help the person in line without even completing our conversation. I decided to order tickets through the Monte Carlo website instead of through her. Once we arrived in our 1 bedroom suite, we unpacked and went grocery shopping. It only cost our family approximately $60.00 to shop for all of us. That food provided breakfast, lunch, and late night snacks. We chose to shop at the nearby Smith's. When we got back we put all the food in the full-size fridge and found that the kitchen is already equipped with plates, eating utensils, pots & pans, dishwashing liquid, dishwashing scrubber, you name it. I cooked breakfast and lunch in the kitchen everyday for the family. Using the grill near the poolside is easy. Just go to the Deli to check out the BBQ utensils which include tongs, spatula, and grill scrubber. I grilled BBQ ribs and corn for the family. We later played ping pong in the recreational area. I wanted to use the pool table but my son was getting sleepy. The swimming pool is heated and has 2 Jacuzzis. Bathroom had 2 sinks so my wife and I were able to both brush our teeth, etc... at the same time. Overall, this stay was excellent. No smoke, no gambling, quiet atmosphere, and still close enough to the other casino hotels so that my wife and I could enjoy some shows!", "Date": "May 31, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "India", "Title": "“Good option amongst the myriad of hotels in Vegas”", "Author": "quarryking", "ReviewID": "UR107598227", "Content": "Nice option, not too far from the strip. Took about 5 mins to get to the strip by taxi. Suites are large and therefore more suited for families or larger groups. No restaurant though in the hotel, but there's a small store where you pick up stuff to toss up a quick breakfast in the morning. There was a pool, which seemed to be pretty popular with the guests right thru the day.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manor, TX", "Title": "“Great value and wonderful location”", "Author": "vld17", "ReviewID": "UR105648798", "Content": "We stayed here for my sisters wedding. The front desk was very friendly and helpful all druing our stay. The rooms are nice and clean. There is no mall or shopping in this hotel, so if that is what you are looking for then this would probably not work for you, but overall I would recommend and go back to stay there again. It is not on the strip, but we loved the location. It was right on Monorail so getting to the strip was no problem. It was actually very nice to get away from the strip for a bit.", "Date": "April 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Studios okay for leisure but not the best for business”", "Author": "Conraveler", "ReviewID": "UR104151749", "Content": "- Convention center walkable - Studios are one room with couch, kitchen sink, microwave, refrigerator, toaster, large coffeemaker - No desk - Small bathroom with worn bathtub/shower plumbing fixtures - Low water consumption toilet sometimes required two or three flushes - DVD player with CRT TV - A walk to the adjacent Hilton is past a free-standing parking garage - No complimentary breakfast - Only food is the deli/gift shop - Bar is usually only open when the pool is - First assigned room had dirty couch upholstery - Second assigned room had a chemical odor", "Date": "April 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“Working Vacation”", "Author": "beachlover759", "ReviewID": "UR99562556", "Content": "I stayed at this property in a two bedroom suite for a week after a long weekend on the Strip celebrating a friend's birthday. The location is good if you don't want to be in the middle of all the action. It is convient to the monorail which takes you to all the action of the Strip within minutes. If you want to gamble but stay close you can walk over to the Las Vegas Hilton where they also have a variety of restaurants. The room decor is dated but I was informed by the bellman that they are starting a renovation of the rooms which is complete on the first floor. The thermostats did not regulate very well as it required constant modifications to keep the room comfortable. Free wireless internet service is provide which is a nice change from many hotels and/or resorts. The upkeep of the common areas is great as I find at all Hilton Grand Vacation properties. The deli available in the lobby is convenient but is a bit overpriced and needs to provide more options. Overall I found this property and its staff to be very nice.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Yorkshire Dales National Park, United Kingdom", "Title": "“Quite loaction - terrible noises!!”", "Author": "lizp007", "ReviewID": "UR98931763", "Content": "We decided to stay in an apartment this time in Vegas for a change. The 2 room apartment was spacious & looked nice, although a little warn in places. But thank goodness we didn't have any neighbours the walls are almost paper thin. You can hear people in the next room talking as though they were in the same room with you! And then there's the plumbing - it is the noisiest I have ever come across in a hotel - water running, people in the bathroom above - I woun't go into detail as to what we could hear!! Staff were friendly & the loaction was quite but would not stay there again. I would only recommend this hotel to someone with hearing problems!!", "Date": "March 4, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Midwest", "Title": "“Not Worth the Timeshare \"Special\"”", "Author": "TheTwoOfUsMidwest", "ReviewID": "UR98592953", "Content": "This facility is decent enough: big rooms, comfy bed, ample free parking. However, it is a bit out of the way and with all of the other nice places to stay in Vegas, you can do better. The really disappointing part of our stay was the timeshare (Hilton Vacation Club) meeting and promotions. We thought we'd give it a try due to the strong Hilton name. Big mistake. They were very limiting on when you could schedule the meeting (10:00am or 3:00pm = right in the middle of your vacation day). They GUARANTEED that it would only last 2 hours. They PROMISED it would only last 2 hours. They kept us 2 hours and 35 minutes! We were told that the $200 Hilton voucher we would get would be good towards a future stay (multiple nights up to a total of $200). It's only good for 1 night. The sales pitch was an extremely hard sell. She wouldn't take \"no\" for an answer, even after I laughed at the $49 online reservation charge and the 17.5% interest rate they wanted to charge! So the only way I would suggest staying at the Hilton Grand Vacation Suites at the Las Vegas Convention Center is if you can get a good rate and NOT have to attend the timeshare sales meeting.", "Date": "March 1, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Columbus, OH", "Title": "“Dated”", "Author": "BusyTravelerCMH", "ReviewID": "UR96663525", "Content": "Spouse and I stayed here last weekend (Feb 12-14) on a timeshare visit trip. Couple immediate points can be made: - Hotel is a long way from the strip. Probably 10 minutes walk so cab cost probably ate up any savings. Every cap ride was $10-$15 to the strip. The hotel is close the Las Vegas Hilton but that is really it. - There is no onsite food service besides a convenience store. - The front desk should tell ask if it is OK that you get a handicapped room instead of leave the surprise to you.. The room actually didn't appear to have any features for handicapped guests. - Furnishings were probably 10+ year sold. Serviceable, but faded linens and coach. Tube based TV that didn't swivel to orient towards the bed was a problem. - Admittedly we had a connecting door, but you should to hear as much from the room next door. Rooms are clean, but next time we will spend a little more to stay on the Strip.", "Date": "February 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Southern California", "Title": "“Excellent Property”", "Author": "heumanntouch", "ReviewID": "UR94166356", "Content": "This is another property where if you were looking at it, you could not determine what lies inside. The room is spacious and elegant, and has everything you could need, washer, dyer, full kitchen, separate living room, bedroom. The best bonus is the parking is FREE, which is a bargain in Las Vegas. You are also very close to the Hilton Las Vegas and the tram way to take you to most places on the strip. I would recommend this property to anyone.", "Date": "January 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Jose, California", "Title": "“Great place for families or long stays”", "Author": "lugareslejanos", "ReviewID": "UR91479240", "Content": "Stayed for 4 nights with family including toddler. 1 bedroom Apartment/condo with full kitchen (with all tools and gadgets you may need for cooking and eating and washing dishes by hand or dishwasher), dining table for 4, sofa with queen bed, 3 sofa chairs, tv, dvd player, w/d and detergent, king size bed, jacuzzi tub, double sink, separate shower, and toiletries. Hotel has an activity room with pool table, pin pon table, and big tv. It also has another room with lots of sitting area, computers and printers. It has a deli/cafe/mini mart, no restaurant but then you have the kitchen to make meals or can go to one of the million places in vegas to eat. Hotel has no casino which was nice to us. Parking was right outside the hotel so didn't have to walk for miles before getting to our room. Hotel is off the strip but next to monorail which you can pay $12 for one day unlimited use and avoid all the traffic on the strip and finding parking. Grocery store, drug store, gas station, 7eleven, and restaurants within a mile. Staff were very nice and welcoming. Presentation for timeshare was not even brought up. Only negative would be about the carpet (blue) which stained our white socks. If you're not child/family friendly then this place is not for you as most of the guests are family w/ kids.", "Date": "January 3, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Basel", "Title": "“Froze to death.....”", "Author": "Mr_Frodo_Baggins", "ReviewID": "UR86440006", "Content": "With 2 buddies we reserved 3 rooms and went for a weekend to Vegas in early November. Night temperatures were already pretty chilly. We arrived a 1.30am in the morning at the hotel. When we entered our rooms we were hit by a wave of ice cold air - no wonder - the aircon was fullblast on the coldest level. Even the immediate change to warm did not help and I was freezing the whole night. While at least they did not touch my aircon anymore, the room maid managed to put the aircon on cold again in my colleagues rooms.... In the morning we went to the welcome desk to pick up our \"Welcome package\". The lady there gave us some discount coupons, but mostly she wanted to lure us into visiting some time share apartments...... Bottom line: The rest was ok, the location close by the strip is ok, but I still would not recommend this hotel and never go back again - absolutely unworthy for the Hilton Group!", "Date": "November 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Do NOT listen to nay-sayers; this is a great place!”", "Author": "jbwaaadeal", "ReviewID": "UR86439767", "Content": "I travel and stay in hotels over 120 nights a year. I mostly stay in Hilton properties so when my five brothers and I decided on a brother reunion in Vegas, they said that I would take care of the hotel. I knew exactly where to call and from start to finish Bill at the desk and reservations was as fine a person to work with as there is anywhere in the country. Deb is fantastic, too. Although, you hear people say this is off the strip, who really cares? It is footsteps from the Strip and we had a rental car anyway and went from valet to valet. Valet is free everywhere and all you do is tip them. Plus, there is the train that comes there, as well, but we never had the need for it. The rooms are spacious and very clean. VERY clean. I would recommend this to anyone on business or with families. The pool area is just the right size especially if you have children. They won't get lost wondering in those huge newer pools. Although, I like those myself. You will not go wrong by staying here for any reason. I am on 120 flights a year and stay 120 nights a year and I know what I like. It is cleanliness and a smiling face most of all. Here they have both and lots of it!", "Date": "November 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Just as great a second time”", "Author": "JBien", "ReviewID": "UR86408802", "Content": "Hubby and I stayed at this hotel last year for the same event, and this time booked a 1 bedroom suite for the same rate that we paid last year for a studio. We waited until a few days before we needed it to book, and we pre-paid to be able to take advantage of a special that gave you a room upgrade. The one bedroom was really spacious, and while not quite as swanky as the Signature at the MGM Grand that we had just come from, it still had everything we needed to make our stay comfortable and memorable. The full kitchen was a blessing, as we were able to cook for ourselves which was really convenient. There was a full-size drip coffee maker as well, though the coffee \"mugs\" were really tiny and we didn't bring travel mugs with us. The bathroom was plenty big, and the shower was convenient and comfortable. There was also a dining table and 4 chairs which made for comfortable dinners in the room. We used the pool this time, and enjoyed one of the hot tubs, though it was microscopic. More than 2 couples, and it's crowded. There are baskets out by the pool with white-and-yellow-striped pool towels for the guests. The pool bar is quite nice with drinks and appetizers, while the made-to-order deli/store is a great convenience to have right there in the property (and their breakfast burritos and pizzas are really good!). I think the elements that make this hotel so invaluable are their free parking, the ease of accessibility into/out of the property, and the proximity to the highway. We will definitely be staying here again. -Jen", "Date": "November 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Freiburg im Breisgau, Germany", "Title": "“Perfect Location”", "Author": "erwin65", "ReviewID": "UR84587206", "Content": "The Hilton Grand Vacation in Las Vegas was a great experience. Spaceous rooms well equioted with all you need to relax was offered. There are two large rooms ( living room , bedroom) a kitchen fully equiped ( even washing machine and dryer) a great bathtube and a bathroom with shower. Great! The hotel offers a nice gym and a wonderful pool. A shop at lobby level offers all the small thinks you might need for your kitchen. Staff very friendly. Just great!!!", "Date": "October 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Pasadena", "Title": "“Close to the strip and convenient if you have a car”", "Author": "RJDTravels", "ReviewID": "UR82226098", "Content": "I was meeting up with some buddies from NYC for the weekend. They wanted to stay at the Aria but I was not interested in spending close to $250 Plus per night. I was very happy with my decision ($55 per night) The hotel had a decent in-house gym (whoo hoo!!Precor ellipticals!!), parking was easy, and free wi-fi. While decor of the room feels like something from the set of the Golden Girls, it was OK and comfortable. The bathroom shower was a bit dated and the pressure from the shower head was not that great. As far as the staff, they were very friendly and were able to accommodate me for an early check-in. The only thing I did not like about this property was a 10:00 AM check out. I am used to a 12 noon check out with the option of pushing it to 1:00 PM. Not so at this property.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Midrand, South Africa", "Title": "“A home from home.”", "Author": "Bakeriesworld", "ReviewID": "UR82220431", "Content": "A home from home. A warm welcome for me as a first time business traveler to Las Vegas. Next time I do not hesitate to book again in this hotel. Helpfull staff, a small shop with to purchase verything you need with very helpfull staff, thank you ladies.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "South Florida, Florida", "Title": "“Good Value - Close to the Wynn and Sahara - Just Off the Strip”", "Author": "Arrege", "ReviewID": "UR81773569", "Content": "We were in town for 3 days attending a conference. Most of our time was spent outside - so we were only in the room to to eat and sleep in the evenings. My wife go a great deal on a suite - Bedroom + Den - and the room was on the high floor. The suites are clean and comfortable, they come with a full kitchen, stove, microwave, dishwasher and full fridge. This is great since you can buy food locally from a grocery store and just cook in the room. Also, any unwashed dishes and silverware are cleaned by the staff the next day. The bathroom is spacious - though there is no bathtub. It's a standing shower only. There is a hot tub in the suite - right next to the bedroom. There is no door separating the hot tub from the bedroom - so you can see it from your bed. We did not have time to use it - so I cannot comment on it much more Parking is free - both covered and outdoor. There's also a small convenient store within the hotel itself that's open till 11 pm or so. The hotel also has a pool that people appeared to be enjoying and a business center. Bed was large - and the room was pretty quiet. There may be some noise early in the day - random lour car or siren - but it's not the norm. The only issue for us was that the room had a very poor internet connection. We use MACs and had trouble connecting to email using our computers - even after calling tech support to trouble shoot. So we ended up using WEBMAIL to get our work done. But it was still too slow and frustrating. I would stay at this hotel again - since the deal is great, the location is good, and I can manage with the web connection.", "Date": "October 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "South Australia", "Title": "“Lovely spacious hotel”", "Author": "Thommos17", "ReviewID": "UR81139106", "Content": "2 bedroom apartment was lovely and spacious with a full kitchen. Staff were very friendly and interacted well with our children. Lovely swimming pool. It is a bit of a walk to the strip and back but if you have your own car a great tip is that there is free parking at any of the big casinos on the strip. You can park your own car or have it valet parked for just a tip when you collected it. (US $2) is what we were told was appropriate. This was a much cheaper option that the monorail at $5 per one way trip and made our stay much more pleasant.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“good hotel, great value”", "Author": "lososos62", "ReviewID": "UR80340576", "Content": "this is a very good hotel, no doubts. we booked a day in advance, and when the hotels on the strip like the mirage and the TI were at $150 and over, this was $100. since we had the car the fact this is off the strip did not really bother us. we had the studio suite, overlooking the stratosphere, it was quite an interesting view. the overall quality was very good, but here are few things I really did not like: the king bed was very soft, it did no go too well with my back the pools is nice, but you can't escape the music, that was too loud for me. I would not go back just for this reason. check out is at 10am: first time I see a check out so early! vacation is when I get 8-9 hours of sleep, that is hard to do if you also do not want to feel rushed in the morning. another reason I am not going back. it is still a very good hotel, I would recommend it to anyone who does not care about these 3 things above.", "Date": "September 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Chicago, IL", "Title": "“Good hotel - convenient to Monorail”", "Author": "TravelinVC", "ReviewID": "UR78647730", "Content": "Overall this is a fine place to stay if you want a place to escape to for peace and quiet. One of the drawbacks is that since it is a timeshare property, it's not like a traditional hotel experience. For example, room cleaning only occurs every 4 days, other days you need to clean up after yourself. However, the unit comes with a complete kitchen including washer and drier. It's just a short walk to the monorail station at the Hilton which will take to you to main Vegas strip area. If you're looking for a bustling environment, this is not the place for you.", "Date": "September 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Barrie, Ontario", "Title": "“very nice place to stay in Vegas off the strip”", "Author": "ChefFatCat", "ReviewID": "UR76384730", "Content": "We stayed at the Hilton vacations club for 2 days when we visited Las Vegas in July. We were recommended this hotel from our RCI membership and we were very glad we booked it. It is just off the las Vegas strip on the north end, and right next to the Hilton hotel and convention center. We had a roomy 2 bedroom suite (1200sq feet) with all the amenities of home - full kitchen, king beds, plasma TVs, whirlpool tubs, 2 full baths etc) For about $160 per night this is a very good deal in Vegas and well worth it. Although the hotel is not nearly as elaborate as most of the ones on the strip, it is great for families and because it is just off the strip, it is quite quiet. The pool area is a little simple but does the job. There is a little coffee/gift shop but no restaurants on site. There is also no casino which may be a good/bad thing depending on why you are there. Mind you everything is just a stones throw away if you want all of the Las Vegas action. The service was very friendly and accommodating. Parking is on site but a little bit of a walk if you use the underground parking. You will need to use your car or the monorail service if you want to go out to the strip - you can walk it but it is a little far for most people, and with the las Vegas heat it might be a tad uncomfortable. All in all I would recommend this hotel for families, long stays, and for people that don't want the hustle and bustle and crowds of the major hotels.", "Date": "August 22, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Francisco, CA", "Title": "“Great value!”", "Author": "cppexpert", "ReviewID": "UR75233912", "Content": "Normally I stay on the Strip - Bally's, Wynn or Caesars but since we were driving from Arizona to California I wanted inexpensive accommodation with good quality. Hilton is great - awesome value for 80$ I paid! Rooms are clean, sofa bed is pretty big for one more person, pool isn't big but nice. Wii gameconsole, pool and table tennis are available for those who bored. Location isn't that far from the strip if you're on the car. If I need", "Date": "August 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Orange County", "Title": "“good location-rooms could use upgrades”", "Author": "seasunsounds", "ReviewID": "UR74530486", "Content": "Stayed at this vegas hotel for a few days in june. It was hot as heck in vegas during june but for some reason the hotel does not have umbrellas for pool guest. You can rent cabanas but there is very little shade in 100++++ heat. The room was comfortable but small and the bathroom was not big enough for two people to maneuver around in, coffee drinkers have to go downstairs to the ONE cafe or wander over to the other side of the hotel for more breakfast type items and buy there is no coffee pot in the room but there was a fridge. The bathtub faucet leaked and I had trouble turning it off. The staff in the diner on the first floor were very nice.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "los angeles", "Title": "“Another great stay”", "Author": "andrew340", "ReviewID": "UR74241237", "Content": "as usual, a very enjoyable stay. The rooms are spacious although I feel are beginning to look a little worn. Nonetheless, spotless and everything in good repair. one broken glass and a toaster were replaced within 15 minutes of me calling housekeeping. The pool area is delightful. No loud music to spoil the tranquility - also ample shade and misters to help keep you cool. If you want a party atmosphere and loud music, look elsewhere. if you want a relaxing base with the option of self catering then you can't beat it. Significantly better than Wyndham Grand Desert.", "Date": "August 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "California", "Title": "“nice hotel at great value”", "Author": "CaliforniaTraveler73", "ReviewID": "UR70856632", "Content": "I booked a stay in a one bedroom suite during the Independence Day weekend. At about $100 a night, it was a great value - compared to the other hotels along the Vegas Strip during the holiday weekend. Our room came with a fully equipped kitchen, a washer/dryer, a separate bedroom with a king bed, a living room with a sofabed and a jacuzzi tub. I slept on the sofabed, which was adequate for a night but not as plush and comfy as the regular bed. Our room location near the very top was quiet and we had a great view of the Stratosphere Tower. The reception area is rather small - but no smoke filled noisy long hallways, thankfully. They also have a separate spacious lobby/business room, recreation room, a deli and a pool/jacuzzi outside. As for the service, the staff were generally friendly and accommodating. Check in and check out was an easy process too. When we summoned housekeeping, someone arrived promptly with some extra toiletries; they even allowed us to check out late, around noon. As others mentioned, the hotel is not in the busiest part of the Strip where the major hotels are located, but you can easily use the monorail to get around; or just walk across to the nearby Hilton Hotel if you want more dining and entertainment options. Overall, this is a great property for those looking for spacious rooms with a relaxed and quiet atmosphere at a great value.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Great Stay in Vegas”", "Author": "daplushman", "ReviewID": "UR68426578", "Content": "This was a wonderful hotel. I've been to Vegas a few times over the last year and a half and this was the best hotel I've stayed at. I had a 1 bedroom suite with a jazzuci with a great view of the golf course. The location was great for me because it was a short walk to the convention center (over 100 degrees every day during the week so I really appreciated the short walk). There was a kitchenette and a washer and dryer in the room. I didn't get any sales pitch to buy into the vacation suites so that was great. If I wanted to gamble, a short walk to the Hilton Las Vegas with their casino was all it took. Overall, a very nice facility and I will stay there again.", "Date": "June 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Port Chester, NY", "Title": "“Great Place to Stay!!”", "Author": "Mspill", "ReviewID": "UR66662233", "Content": "We stayed in a 2 bedroom timeshare for a week, Saturday to Saturday. It was a one bedroom with a one bedroom lock out to make the two bedrooms. The wifi is free although on Thursday the internet was down all day, but the rest of the day was fine. I felt the staff was very attentive, towels were replaced upon request and on the fourth day of the stay our room was refreshed, new towels, dishwasher run, beds made. Very nice. Newspaper every day to the room. Towels are provided at the pool, there is a bar poolside that had drink specials during the week. Magazines are provided poolside too. Exercise room was good, scale, and filtered water was provided. Deli was small but good in a pinch, we walked across the street to a mini-mart, beer was much cheaper than at the deli. The monorail was an 8 minute walk through the Hilton next door. Most of the week we used the Monorail, clean convenient and runs every 6 minutes. You can also pick up the Ace Bus which is an 8 minute walk in front of the Monorail at the Sahara going Southbound. You can pick up both the Ace and Deuce Bus on the strip in front of the Sahara going Northbound and Southbound. This is a little farther, closer to a 10-12 minute walk through the casino. The Ace is an express and the Deuce is a local. We went to many Wolfgang Puck Restaurants. Spago @ Caesars, Lupo @ Mandolay Bay, Postrio @ Venitian, Bar and Grill @ MGM. All top notch- I loved them all. We also went to Timpano Tavern in the Venetian, very good, but not as good as Wolfgang. At the California in Freemont Street, we had the biggest bargain meal at Pirate Pasta, an 8 oz sirloin and lobster tail , glass wine and salad for $16.00. Loved our time there!", "Date": "June 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Soutwest Oregon", "Title": "“Very Nice Stay”", "Author": "luvbnarn", "ReviewID": "UR66385372", "Content": "We enjoyed our stay at this location, it was very nice, clean and comfortable. The staff were fantastic and went above and beyond to provide accommodations for our needs. It was a very short walk to reach the tram for travel throughout the strip.", "Date": "June 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Alabama", "Title": "“Quiet and relaxing after a long day/night on the Strip”", "Author": "AlabamaAllie", "ReviewID": "UR65505440", "Content": "In reading over some of the other reviews, I realize some are actually reviewing the Las Vegas Hilton HOTEL – located next door – rather than the Hilton Grand Vacations (Convention Center). Therefore, read reviews carefully to make an informed decision and be sure the review matches the correct property. This is a ‘resort-type’ property and not a typical Las Vegas hotel. There is no casino and no buffet or fine dining restaurants directly on the premises. With that said, you can take the 5-minute walk over to the Las Vegas Hilton hotel which has a large casino and multiple fine-dining options as well as a nice buffet and plenty of fast-food restaurants. The only dining option on the HGVC site is a deli which sells cold/hot sandwiches, snacks, Starbucks coffee, salads, fruit, microwave frozen food, supplies, etc. (It is not open late, so plan ahead if you like to snack late at night!) My husband and I enjoyed the relaxed and quiet atmosphere of HGVC. After a long day/night on the Strip, it was wonderful to come back to a property that wasn’t crowded with people shopping, gambling or eating. If you want to be constantly in the action and crowds, this may not be the best property for you; however, if you want to RELAX when you get back to your room, consider this property. HGVC is not directly on the Strip, nor is it within ‘walking distance’. The Monorail is an inexpensive way to avoid traffic and there is a Monorail stop across the street at the Las Vegas Hilton. Be informed and study the Monorail map. It doesn’t stop directly at all attractions and hotels. Many destinations are far from Monorail stops – it all depends on where you want to go, some hotels/attractions are close to the stops. If you can, rent a car when in Vegas. Parking is abundant and free. The Strip is pretty congested, but you can drive directly to the hotels/casinos/attractions. It is also useful if you want to explore the surrounding areas. (Which I strongly suggest you do!) There is a nice pool area, but it seemed a bit small and was always crowded. Desk workers and hotel staff were friendly and helpful. We stayed in a nice one-bedroom suite. Some other reviewers complained of ‘thin walls’ and of hearing voices from adjacent rooms. We did not have this problem – we heard them open/shut their door, but that is all. The kitchen was nicely stocked with dishes and utensils. The appliances were nice. The bedroom, bedding and mattress were all comfortable. (Pillows were a bit stiff) OK… now to my only true complaint… we were constantly asked to participate in a time-share presentation. They called our room a few times plus asked us about it every time we passed the desk upon entering/leaving. I didn’t feel “pressured” and it was all done in a nice, friendly way… but it did get VERY annoying in that they didn’t easily take “no’” for an answer.", "Date": "May 27, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Northern California", "Title": "“Good Value, Maybe Needs Some Updating”", "Author": "Traveller_From_CA", "ReviewID": "UR65184248", "Content": "Stayed in a one bedroom suite with a buddy for the weekend. Can't speak for all of the rooms of course, but our room was in need of updating in the near future. It was fine for us and I thought a good value at $125 per night. I would stay here again for the location and the price. There is no casino in this hotel which I prefer. It is nice to get away from the non-stop action when coming back to the hotel. It just feels more relaxed. The Hilton and Sahara casinos are walking distance. The location is great, halfway between the airport and downtown and close to everything on the Strip. Best of all, this hotel is off the Strip (but very close) so that you can avoid all of the traffic. The main bed was comfortable and the bathroom was large. The double sink was nice to have. The sofa bed was your typical uncomfortable lumpy mess. I put the mattress on the floor and slept better. They have a nice small pool that was never crowded. We had a couple of margaritas one afternoon out there after returning from Red Rock Canyon, good drinks and relaxing. There was also a ping pong table and pool table in the lobby available for use. Overall a good value and I would recommend staying here. There was no high intensity sales pitch for buying into the vacation club. It is not as nice as The Signature at MGM, but it is also alot cheaper. The only problem area I would report is that sleeping on the sofa bed in the living room can be noisy. We had a room with a connecting door to the next room, and every whisper from that room could be clearly heard through the door.", "Date": "May 24, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Decent option”", "Author": "hobbyistravel", "ReviewID": "UR63764917", "Content": "We traveled here to celebrate an in-laws birthday, so we were parents, young kids, grandparents. We booked an apartment to avoid the hustle/bustle of the strip, and to save a bit of money, since it came with two bedrooms and a sofa-bed. It is next door to the big Hilton, and we used the pool there once (nice but a really long walk back in wet swimming costumes). The front desk staff are quite friendly and nice, and the place was pretty quiet. The room was clean enough, and the housekeeping staff did a nice job. We went to the nearby WholeFoods and stocked up the kitchen for a week, which also saved us money on having to eat out very much. We did miss the free breakfasts you get at a \"real\" hotel, but other than that, it was nice. If you like apartments rather than hotel rooms, this is a good option.", "Date": "May 10, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Colombo", "Title": "“The best place to stay at, if you want to save your quarters in Vegas!”", "Author": "RyanColombo", "ReviewID": "UR62056342", "Content": "This Hotel is right next to the Hilton Las Vegas and about 500 meters away from the convention center. Its a good hotel if you want to avoid the typical Vegas scene (the gambling and the crowds) and attend a convention. The suites are of good size, a large kitchen with a full sized fridge, oven, microwave, dishwasher, toaster etc. The Sitting room was large as well with a 32\" flat screen with a DVD player in addition to the one in the bed room. The bathroom had a large Jacuzzi too. If you simply cant do with out gambling the Hilton Casino is a 2 minute walk away and so is the sky train to the other Casinos on the strip. Oh and WIFI was free!", "Date": "April 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Sherman Oaks, CA", "Title": "“Stayed for Business, but Might be Back with the Family”", "Author": "TransCon1", "ReviewID": "UR62041817", "Content": "I stayed here twice for business at the suggestion of a colleague. I always got a great rate (cheapest offered) as a weekday traveler in Vegas, and upgraded to a beautiful suite as a HH Diamond VIP. The front desk staff is alway very nice and seem to appreciate my business and always recognize my HH status. I love having the extra room even if I an in town only a few nights. When you spend a lot of time in hotels, the basic room can get kind of claustraphobic at times. A prior reviewer mentioned that the rooms aren't up to HGV's standards. They must be pretty high, because I found them pretty nice. I think I am kinda of particular too. Not sure what that is about. I always get my voucher for the little general store in the lobby in lieu of breakfast as a HH Diamond ,which I like. The folks in the shop are well versed in the system and are helpful/understanding about getting full value for the voucher. Also, having all the amenities of the LV Hilton next door keep me from getting bored at night . As I typically am driven around when I am in town on business, I like to have things to do/see/places to eat within walking distance. I haven't used the pool, but might with the family if we return. There really aren't any views from the two different rooms I stayed in, but one had two full baths and a nice jacuzzi tub in the master bedroom -- the other didn't , so there are apparently differences in the rooms. I can't really tell you exactly what to ask for, but be aware that not all the suites are the same. I would definately stay there again on business, and perhaps give them a try for a family trip (although being a little more in the action might be a better idea -- although with a 3 year old, maybe not).", "Date": "April 21, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "victoria", "Title": "“convenient for the convention center”", "Author": "jumpinhorsedad", "ReviewID": "UR62016545", "Content": "it is a lower quality business class hotel. not for kids or vegas scene. walking distance to the convention center. great for beating the crowd rush to cabs, buses and trains. BUT certainly NOT the only choice within walking distance of the convention center. I was executive level in the (newly) renovated section and there didn't seem to be any benefit check in was brutally long. service staff levels were low. room service was expensive and low quality. its a tired hilton.", "Date": "April 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Harrogate, United Kingdom", "Title": "“If you want to earn Hilton Points in LAS this is the place to stay”", "Author": "dcl80", "ReviewID": "UR59987819", "Content": "Very happy with this hotel. Booked a suite, got just that, with a full kitchen, free Internet, washer and dryer. Very nice room in a good location. It is right next to the Hilton Las Vegas, and is much better. If you want to lose some money in a casio you can walk 5 min to the main Hilton for that. Staff was good and welcoming.", "Date": "March 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ohio", "Title": "“One of My Favorite Hotels to Stay at!”", "Author": "Director_CD", "ReviewID": "UR59941683", "Content": "I have stayed at many Hilton Grand Vacation Clubs and I must admit I am never disappointed. The latest stay was at the Convention Center location and I loved it as usual. We were upgraded to the suite (which I highly recommend) as the suites are very nice. The kitchen is a great, as well as the roomy living room and separate bedroom which has an amazing jet tub in it. The bathroom was nice and I have high praise for even the shower, yes, the shower.... which had awesome water pressure (was like getting a massage.) The staff was friendly and accommodating. I highly recommend staying at this location if you are attending a trade show at the convention center. The walk is not bad at all. If you are like me, and don't go to the strip in Vegas when in town, then this is the place for you. However, keep in mind, if you are staying because of a trade show, and are with co-workers, I don't recommend more than two in one suite. They have a pull-out couch but from what I heard (I was lucky and got the bedroom) the pull-out is not very comfortable. They do not offer any additional roll-away beds. We had three co-workers and had to buy an inflatable bed at WalMart. Also, the wifi internet never worked with my laptop (couldn't identify the network) but worked with my co-worker's Macbook. I will absolutely stay here again with my wife next time we are in town. Thanks HGVC!", "Date": "March 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Reno, Nevada", "Title": "“Nice hotel, but not close enough to strip”", "Author": "jb2186", "ReviewID": "UR58939144", "Content": "We chose the hilton because it was nice even though it was a little far away from the strip, we were told we would get a locals discount for the monorail but you can only purchase those at two casinos, not the Hilton. the pool was great, rooms were fairly clean, elevators were a little confusing, got to attend a craps lesson. Fun for people of all ages", "Date": "March 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Newport Beach, California", "Title": "“Comfortable, Clean, Quiet, but Remote”", "Author": "VistaDelSol", "ReviewID": "UR54628300", "Content": "These are timeshare condos that are clean and quiet but not very close to the \"action\" of the Strip. If you are looking for some Vegas glamour or excitement -- not here. However, the staff is friendly and the accommodations are nice enough being full condos instead of hotel rooms. Closest casino and restaurants are in the Hilton about a block walk away. The steakhouse in the Hilton is excellent. The monorail stops at Hilton to take you to some of the Strip casinos and hotels. But beware: the fee for the monorail is $5 one way, so it can get as expensive for 2 people as a taxi would be. Best bet is to buy a pass for unlimited on/off. Note: the Hilton Hotel and Casino is in need of updating if it's going to compete with other places. So I repeat, if you want some Vegas style or pizzaz, you will have to pay more and go elsewhere.", "Date": "January 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Arizona", "Title": "“Great out of way location”", "Author": "sedona2003", "ReviewID": "UR51844272", "Content": "This was a great out of the way location, but close to everything you would want in Vegas. Its only steps away from the Hilton Las Vegas if you want a casino.", "Date": "December 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Geneva, Illinois", "Title": "“Not Up to Par for Hilton Grand Vacation Clubs”", "Author": "bohste", "ReviewID": "UR51129072", "Content": "I stayed at this location for a business conference at the Las Vegas Convention Center. I am also a HGVC member and have stayed at a number of their properties. This was an okay location and in fairly good shape, but it was not up to par with other HGVC properties. They need to update the rooms. The staff here was extremely friendly.", "Date": "December 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Chicago, IL", "Title": "“Great hotel, friendly dealers, super price/deal with coupons”", "Author": "ord2las", "ReviewID": "UR50315689", "Content": "Look around the internet and you can find package deals to this hotel for ~$200 for a 4 night stay or 3 night with 6 free buffets. i stayed here because the monorail end here but the place ended up being nice and offering every table game i wanted, i never left!", "Date": "November 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Bridgend, United Kingdom", "Title": "“Great Stay”", "Author": "PJH67", "ReviewID": "UR49516835", "Content": "Great Hotel with a mini kitchen in each room (microwave, toaster, sink and fridge). Stayed for the week to attend a convention so ideally located for the convention centre. Can be a bit expensive travelling to the strip as you have to use a cab or the monorail. Hotel has a small deli which was not bad but limited choice of snacks. However, the Hilton is about a 5 minute walk away so you can eat there. The buffet in the Hilton was great at $17.95, which includes beer or wine, so great value. Another bonus was the free internet access and good choice of tv channels. We did get a call about the time share club, but simply ignored it so no pressure to join. All in all a good choice.", "Date": "November 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Wash., D.C.", "Title": "“Only if you can't get into the Las Vegas Hilton”", "Author": "starrysteph01", "ReviewID": "UR47523111", "Content": "My company booked my hotel room late. As a result, everyone else was at the Las Vegas Hilton while I was next door at the Grand Vacations. I was sorely disappointed when I saw what I was missing out on. At my hotel, the room was small, there wasn't any restaurant (just a convenience store), and I felt like I was miles away from any action because the hotel was so quiet.", "Date": "October 22, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "", "Title": "“Dreadful Location”", "Author": "MaryGene", "ReviewID": "UR47333022", "Content": "Unless you are very fit or rent a car, thisis a greadful location. It costs $10.00/day per person minimum to ride the monorail. Deli at HGV-La Vegas Hilton charges $3.00 for 1 ltr bottle of Coke. Miserable experience...then we found out foreigners were upgraded from a studio to 1 bedroom w/washer-dryer at no charge!!! Would NEVER stay here again. Whirlpool at main pool didn't work for entire week.. Ice Machine on our floor didn't work and was never reapaired over the 1 week visit.", "Date": "October 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Vashon, Washington", "Title": "“Relaxing and quiet with attention to detail.”", "Author": "Sundance123", "ReviewID": "UR46335611", "Content": "We were looking for a place to get some sun, warmth and just relax. We took the shuttle $12 RT from the Airport, very easy and convienent. Arrived at 10:30am and were given our room without any delays. The one bedroom is very spacious, king size bed is extremely comfortable. We really appreciated the little extras. Paper towels, dishwasher and dish soap, salt and pepper, they even had laundry soap. It is so nice to have those little extras to make our stay easier. We love to cook and found the full kitchen very well equiped, even a full size fridge.The pool chairs are some of the most comfortable you could ever want and as many towels as you needed. The security guard even brought us popsicles as we lounged. The staff are very friendly, especially the Bar Maiden, Everyone makes you feel so appreciated. They have two great gas barbeques next to the pool, we got steaks from the nearby market and griiled them up. You can the brabeque tools from the little deli. I read complaints about the thin walls, we certainly had no loud neighbors or any complaints about noise. We found it very quiet and peaceful. If your big into the gambling scene this may not be your place, you have to walk about 100 yards to the Hilton Hotel Casino ot hop the Monorail to all the big casinos. The free high speed internet worked great, very fast and even tech support for those like us that need all the help we can get. The business center has a set up to print your boarding passes free of charge.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Arlington, Vermont", "Title": "“Quiet Hotel-just a short distance from the strip.”", "Author": "LynnieArlington_VT", "ReviewID": "UR45992073", "Content": "We stayed here Sep 26 thru October 3rd. I had some issues with RCI and the name under which the reservation was made. I made the reservation myself, under my name, but RCI put it under my former husbands name. The hotel insisted on trying to call my former husband, while my partner stood there with me, to get 'clearance' that it was OK for me to check in. It was so embarassing. Then they tried to call RCI (which was CLOSED at the time). All this, despite the fact that I had the printed reservation with my name on it, which states that is the only thing required for check in. The hotel stated they did not go by that piece of paper. The whole process made me feel like I was some kind of criminal. In the end, they wound up checking me in based off the printed reservation I had...but they could have done that to begin with, or handled the situation a bit more discreetly. Our room was a studio. It was pretty small. There were only two of us and we had a hard time finding a place for our clothes. There were only three drawers and a very small closet in the room. We also found a can full of trash. When I told the front desk, they recommended I empty it myself. The hotel is located at the end of the strip. Its about a 15m walk to the monorail, which was convenient. Other than the trash, the room was clean. The pool was disappointing. The bar was literally a closet and was closed on Sunday-they gave the bartender the day of and the pool was full of people! Some folks we spoke to told us the pool at the HGV on the strip was much better, though not as quiet. The large hot tub was closed the entire time, but appeared to be in good working order. Only the small, three man hot tub was open for the duration of our stay. We were placed next to a family with young screaming kids the first two days. After they checked out, it was much quieter. The staff in the cafe/deli are really great and the food there wonderful. The hotel was not too pushy w/ the time share presentation...I was only asked twice, which is way better than most places that pour the pressure on. The next time I go to Vegas, I am going to try the HGV on the strip because its newer and the pool/bar service is better.", "Date": "October 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Northwest", "Title": "“Beware of this hotel!!”", "Author": "Murphymom3", "ReviewID": "UR45344431", "Content": "This place is so hard up for business they target Hilton Honors members offering them a package to get you into their hotel to listen to their 2 hour presentation. We were hoping to visit sometime this coming winter so purchased their package. They called on a Saturday evening, on Monday our family became ill with H1N1 and we needed the money for medication. When we called requestion to cancel our transaction they REFUSED to issue a refund and even hung up on us. We were within our 3 day window. When we spoke to Hilton Honors directly they informed us that this property has been targeting their members and creating chaos. I urge to NOT stay at this property and DO NOT become a victim of their HORRIBLE business tactics. SHAME ON YOU LAS VEGAS HILTON!!", "Date": "September 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Reading, MA", "Title": "“Good Value - Comfortable”", "Author": "zathras", "ReviewID": "UR40735588", "Content": "Attending a show at the Hilton Convention Center, we wanted - and got - convenience, non-gaming, and a good rate ($69-71 per night AAA rate). The studio room was clean, comfortable, and quiet. Not large, but adequate. The fridge and microwave came in very handy. Not recommended for business travelers as the studio rooms do not have desks. The suites looked nice. Staff was friendly and competent. Restaurants next door at the LV Hilton. Ample free parking.", "Date": "September 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Vacaville, California", "Title": "“Wow, Didn't Want to Leave!!”", "Author": "Littlelobo", "ReviewID": "UR40489219", "Content": "All I can say is, when you go to Vegas, stay here!! I reserved a 1 bedroom suite and expected a room like you get at the Embassy Suites, well I was mistaken. This is like living in your own fancy apartment. We walked in to find a full fledge kitchen, living room, dining area, separate bedroom, jacuzzi, separte bathroom, and even a washer and dryer available to use. Very nice place to stay, extremely comfortable bed, lots of living space, next to the Hilton Hotel and just a short walk to the Monorail. Definitely, a place to relax and enjoy yourself.", "Date": "September 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "swindon wilts", "Title": "“Good and bad but no ugly”", "Author": "berniesheila", "ReviewID": "UR38607408", "Content": "stayed here for 10 nights from 26th of july ,room was clean and spacious and everything in it we could have wanted .you can hear noise from from adjoining rooms even when people are just talking and when upstairs filled there jacuzzi bath it was loud,pool kept beautifully clean and even security guard giving out free icepops by the pool ,location great and a 2min walk to the much used monorail station", "Date": "August 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Olympia, Washington", "Title": "“Very nice Hotel off the Strip”", "Author": "krisq99", "ReviewID": "UR36723082", "Content": "We are timeshare owners and booked this hotel through RCI. It is at the end of the strip back a few blocks, so if quiet is what your looking for this is the place for you! There is a monorail next door at the Hilton, about a 5 min. walk and for a 3 days pass it was $28.00 per person and it stops at the back door of most of the Casino's on the strip. We enjoyed taking the monorail and it was very convienent, much better than paying for a cab everytime you want to leave the hotel! The hotel was very clean and had very friendly people working there. When you first get there they do ask you if you want to listen to a sales presentation but they are not high pressure and if you say no they will not bother you again for the rest of your stay. We had a 1 bdrm that had a pull out couch in the living room area and a full kitchen. It was very roomy, clean, and had all the ammenities that we needed. There is a pool here but very small after you've been to some of the other Las Vegas Hotels out there. But it was very quiet and relaxing, and there is a poolside bar. Make sure you save your glasses cause refills are cheaper! There is also a deli on the bottom floor which has many items you can buy to make meals in your room and they also make pizza's and sandwiches for you. Overall, we enjoyed staying at this hotel.", "Date": "August 4, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“A Comfortable Home away from Home”", "Author": "leonyrey", "ReviewID": "UR34627893", "Content": "Very courteous staff. No Pushy Sales people for buying condos. Remember to unplug your hotel phone use your cell because there is a sales call coming! The hotel is definitely away from the strip so a car is needed. You can get a full sized kitchen if you want or one with just a bar sink and ref. My cousin had a two bedroom which put a 1 bedroom and studio together with the connecting door between the rooms. The pool was small but not crowded. You can use the facilities of the Hilton hotel across the street such as the pool. It is really a place for older folks or ones with family and not crazy like some other Vegas hotels on the strip. You felt safe to stay here.", "Date": "July 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Calgary", "Title": "“Despite the challenges - this hotel is worth taking a look at”", "Author": "CipherX", "ReviewID": "UR34215506", "Content": "Stayed at the HGVC July 1-6th paying an average of 80CAD a night on expedia. I read many reviews prior to booking though i must admit i take complaints with a grain or two of salt as i feel many guests are impossible to please. I do stand corrected, as this hotel does have a few potential deal breakers depending on the type of person you are. For us, we loved it and would absolutely go back and so on that note i will begin the actual review The room was comfortable, a king bed and pull out sofa. TV and DVD player (plays Divx) which came in handy for me. Medium sized refrigerator provided more than enough room for all our drinks and food. While the decor might have been a bit dated, the room for me is mostly about the bed and the bed was great. I will second the complaint posted by one reviewer about the super thin walls and hearing noises from adjacent rooms, however i will add that this hotel is very laid back and most guests are not the hardcore partying type so this really was never an issue for us. The only other complaint here was by the lady and it was the lack of a full length mirror anywhere in the room The bathroom was decent however there is a major major problem here!!! The bathtub did not drain. I would turn the water off during my shower to lather and upon turning i back on to rinse it would still back up over an inch. This was the big concerns for us and we did our best to overlook it and focus on the other positives. Which would be the pool area :) yes it’s not huge, but there were hardly any people there and always an abundance of chairs even on the 4th of July. The setting is nice with lots of sun and shade available if needed. The lounge chairs are amazingly comfortable and would likely be the number 1 benefit for us as we did a lot of sun bathing. I second the comments on the courteous and attentive staff and this was noticed the most around the pool area. Whether the servers would be bringing out free watermelon or Popsicle's or even the security guard coming around to each guest and asking them if everything was ok was really a nice touch. Also the 2 gas bbq's available for guests came in very handy and we wish we would have used them more. This property is a timeshare and they do try and get you to attend a presentation with the lure of a $100 free gift. They were persistent but not pushy and politely backed off when it was appropriate. I would not let this hinder you unless you can't say no to salespeople :) Other nice touches were the lounge area in the hotel, pool room, free wireless internet, decent looking fitness room (i didn’t use it) and i really liked the ice water at the front that had cucumbers soaking infusing it with flavour. Regarding the location, i cannot believe people complained. Walking to Hilton took less time than it would leaving a large hotel room and walking to the strip. the monorail is right there too if you want it however we preferred to ride the deuce which was a great deal. This hotel is on the far north end of the strip, however it is only a short walk to las vegas blvd. We did order some fruit and salads from the deli which were reasonably priced and convenient. There is a grocery store about 15-20 minutes away (walking fast) which you would be doing anyhow as you are walking through a shady part of town. I cannot comment on the poolside food or drinks as we did not order any of them. Lastly, there were minor issues with the chambermaids, not refilling some of our amenities and also with small items (ie paper and a qtip) being left in the hallway for several days and not being picked up If you are looking for action, this is not the right place however if you want to be close to the action at a quiet and relaxing non gaming hotel than this is great. I have stayed at the HGVC on the strip and it is for sure a nicer and more modern property and I think next time I would pay the extra money and stay there. This is not a glamorous property so if you are looking for total luxury this might not be the place for you. However for the price the HGVC at the LV Hilton is no slouch of a hotel PS - i would have given the hotel 3.5 stars but this is not an option available", "Date": "July 8, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Rocky Mountains", "Title": "“This is no Hilton, and not grand either.”", "Author": "flying_about", "ReviewID": "UR32717999", "Content": "I am right now in a room in this hotel, and can hear every word from the next room, it is tremendously annoying. This is worse than some of the newly built and badly constructed / insulated Comfort Inns, Hampton Inns etc. The person next door is not shouting, there is no party over there, just normal voice and everything is heard here, and he is on the phone and talks since an hour. The room was not clean, crumbs and smears on table, dust on the plastic plants etc. Ridiculously tasteless furnishings, the cheapest kind, they are worn. The kitchen sink does not drain properly, and no cheaper cabinets were ever seen anywhere. To call this a \"Grand Vacation Club\" is a joke. No Hilton hotel that I know is that shabby. I guess, when selling this to the \"Vacation Club\" owners, the hotel made a bundle. The front desk people are alright, but I don't know where they found the rest of the staff that I saw, they seem under-educated. Does not look as if a dime was spent in training them. Glad to get out of here tomorrow. I am sorry I did not go to the Las Vegas Hilton next door. I have not been there for a few years, if it is similar to what it used to be, it's classes better than this \"Club\" which is completely without any class.", "Date": "June 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "2", "Rooms": "4"}, "AuthorLocation": "Conakry, Guinea", "Title": "“Quiet retreat”", "Author": "Agforguy", "ReviewID": "UR28970064", "Content": "Spent the last night of a six day stay at this hotel. It is off the strip which was attractive to us. Modern, up to date hotel with amenities such as microwave, fridge and free in room coffee. It is not on the strip. that was great for us as we wanted some quiet time before returning home. No slot machines, tables etc. Hotel could have been anywhere outside Nevada as it is more of a base of comfort rather than a destination centre. Staff were very friendly and helpful. Close to the monorail so it was easy to get to and from the strip. If you are going to stay here for several days, buy a monorail pass. No restaurants on site. You have to walk about half a block to the Hilton Hotel. Your room pass is good at the Hilton so there is no problem charging your meals to your room. We'd stay here again if we were ever to return to Vegas.", "Date": "April 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Springfield, Missouri", "Title": "“Great selection if you don't want to stay on the Strip”", "Author": "labsnbeagles", "ReviewID": "UR28900920", "Content": "Walking distance to the strip or they offer a free shuttle to the Hilton on the strip. Also just a short walk to the mono-rail if you want to go that way. Rooms are large and comfortable, pool area is fine, has work-out facilities, pool table, etc. The rooms have a mini-fridge, utensils for basic food prep. Staff are very nice and this is a very reasonable for what you get.", "Date": "April 27, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "beatricepugzilla", "Title": "“Not so much...”", "Author": "beatricepugzilla", "ReviewID": "UR26545289", "Content": "Picked this location due to good reviews, lack of casino and the location since I was attending the bar and nightclub trade show. At check in, the desk staff was more than helpful and very pleasant. As a Diamond member, I was given 2 coupons (total value of $20) to use at the deli for breakfast each AM. Since I was staying 4 nights I asked why only 2 coupons and asked if I should have one one for each AM since this is the way all other Hiltons operate. I was told that I could use the coupons like cash and not have to spend the entire value of the coupon each day. Seemed plausible. After check in - the stay started going down hill and fast. Took 5 different keys to first enter the room - when I went back to the desk to get new keys I was told that the lock needed to be fixed and they would send someone that night. NEVER HAPPENED - each time I tried to get in my room, it took another trip to the front desk to pick up keys in the hope one would work. Each time, I got news keys - at least 3 times per day - I asked the lock by fixed. Discovered the room had no working safe - let the front desk know. Front desk assured me it would be fixed the first night - NEVER HAPPENED. Let them know the seond day the safe and the locs still had not been fixed - they assured me they would take care of it ASAP - nope... Went the deli the first AM to use my coupon to get brekfast, bought about 6 dollars worth of items and was told that I had to use the full value of the coupon or lose the rest of the value. I explained what the front desk had told me and they said I was wrong. Went to the front desk and explained what the deli person had told me and they said the deli person was wrong. I asked that the front desk person come to the deli and explain and was told they could not leave the desk - there were 4 folks working and no one was in the lobby. I gave up up on this one and went to Starbucks. The third day, I once again asked that the lock be fixed, the safe be fixed and the room be refreshed since the housekeeping had not been in the room since I checked in. Was told they would take care of it ASAP. When I went up to the room later that day and the keys did not work, the sfae had not been fixed and no visit by housekeeping had been done, I packed and got out of there. When I explained why I was chekcing out early, the front desk person said OK - nothing else - asked to talk to a manager - was told they were not there. There are far too many hotels in Vegas at the corporate price I was paying to have this many problems.", "Date": "March 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“If you're looking at something quieter in Vegas, it's possible!”", "Author": "mdns", "ReviewID": "UR25203308", "Content": "Family-oriented hotel, non-gaming, which was perfect for me at the time. I just didn't want to have to go through the noisy slot machines like most hotels in Vegas. Liked the little kitchenette, too!", "Date": "February 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "linlithgow", "Title": "“Througly enjoyed our stay”", "Author": "LinlithgowTravelscot", "ReviewID": "UR22699243", "Content": "As we were staying in Vegas for 9 nights - we wanted more than a hotel room and something that was free of gambling (at least for someof the time) and this property delivered. The staff went out of their way to be friendly and answer any questions we had . As a HH gold member they also provided several little \"gifts\" of cookies and water, which were above what we normally recieve. Any minor problems were quickly remedied such as missing pots or glasses. My only minor criticism was that this is a slightly more dated HGV than some of the others i have stayed in but that was more than compensated by staff attention. Well worth the slight extra in price rather than a regular Hilton room", "Date": "December 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Haywards Heath", "Title": "“Nice & friendly upscales club hotel”", "Author": "wildthing271", "ReviewID": "UR22486648", "Content": "A few days in Vegas with my mother and father in tow saw us select the Hilton Grand Vacation Club at The Hilton. We'd stayed at The Hilton before, but rooms were better value at the HGVC so we booked there. The room was nice - a king suite, with mother and father occupying the master, and me the sofa-bed. The sofa bed was just fine, but the hotel staff do nothing to help you set it up, and there are one or two sharp corners on the frame of the sofa bed, which drew blood! But it was comfortable enough once set up. The master also featured a spa tub, and a seperate bathroom had a shower and twin wash basins. A ful kitchen was set aside from the lounge area, which had a flat screen TV (the master had an older traditional television). All was clean and the room was serviced daily to an acceptable standard. The hotel also features a small health club and pool. Despite being December, I was able to swim daily in a nicely warmed pool. I did not venture into the gym! Location wise, the facility is adjacent to the Las Vegas Hilton and room charging is possible from that property. Set back from the strip, a car is essential, but that isn't a big deal. Friendly staff make this a property I would definitely recommend and return too", "Date": "December 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wisbech", "Title": "“Great property - timeshare swap”", "Author": "ukbod", "ReviewID": "UR21078169", "Content": "Once again we chose this swap based on reviews here and a previous stay at another HGVC. It is a very clean and tidy property although our room was only cleaned once in the week. The room was very spacious and had a well-equipped kitchen - the free inroom wireless internet was a little lethargic. The shop was well stocked and did fresh rolls, wraps, salads and sweets each day - with very helpful and friendly staff as were all we had dealings with. The reception and concierge were particularly helpful. This is a quiet hotel but is adjacent to the main Hilton which is fully equipped with casino and many restaurants - inc an outstanding buffet and has headliner acts. If you are a Star Trek fan please be aware the Star Trek experience closed permanently from Sept 2008. The pool was quite small but adequate and has a large jacuzzi and towels are provided. The hotel is a little walk from the main strip - but you need to walk off all that great food....", "Date": "October 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Florida", "Title": "“Great Place!”", "Author": "hlibebe", "ReviewID": "UR20922504", "Content": "Of the three places we stayed at in Vegas, my boyfriend n i enojoyed this place the most! The room had everything we would need for a comfortable stay: kitchen counter/sink, small frig w/ freezer, microwave along w/ the normal admenties. The hotel had free washers/dryers for their guest (you just have to buy the detergent .) The room was a good size even though i booked the smallest studio there was available; the room looked great (not cheaply put together) w/ it's own thermostat. ************************ the cons wld have been that there was construction nearby and the parking garage was not attached to the hotel, nor was there a covered walkway (and boy was it cold outside the last two nites we were in vegas!); the thermostat didn't have actual numbers to indicate what the temperature really was( but that was ok since it was very easy to use n efficent-not a bulky window unit); and the toilet in our room was very slow n actually clogged up the last day we were there. (but considering our stays at the other hotels and the general layouts of other hotels we visited in vegas the small inconvenience at the Hilton paled in comparison.) if i was to revisit vegas i would definately book a room here again.", "Date": "October 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Great, but quiet”", "Author": "getachkaraoke", "ReviewID": "UR19344025", "Content": "If you are looking to escape the Strip and the sounds that come with it, this is the ideal hotel. It was very clean at an affordable price and a cab ride away from the Strip. I would recommend it for older people.", "Date": "August 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Orlando, FL", "Title": "“Good”", "Author": "Lymaris", "ReviewID": "UR18603505", "Content": "This hotel is clean, beatiful and excellent service. Las Vegas is for adults. Not recomend to bring childrens.", "Date": "August 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Great for Kids in Vegas”", "Author": "macdonaldia", "ReviewID": "UR18329465", "Content": "Stayed for 3 nights in the middle of a road trip with the kids. More of a 1 bedroom apartment than a Hotle room, full kitchen, washer, dryer etc. Great pool, jacuzzi and free barbecues. Only on block off the strip and probably the only place in Vegas with no slot machines. We absloutely loved it !", "Date": "July 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tijuana", "Title": "“Excellent”", "Author": "Edst", "ReviewID": "UR18210496", "Content": "We have been in Las Vegas probably 35 or 40 times. I have personally stayed in almost every casino hotel of the city. We are a family of four, my sons are 8 and 14. My review for this property is just a word: EXCELLENT. The suites are cozy, very well dressed, it makes you feel even better than at home. The convenience of the washer/dryer and full refrigerator and kitchenet is a major plus. I have been in other suites that has these conveniences, but here you do not really see them, they do not invade your space or make you feel like you have the kitchen in front of you, as other places. The whole resort is great, the pool, the gym (free very clean towels at the gym), and the deli market. The deli market has good prices and the sandwiches are just plain GREAT, fresh, and huge. Three of us actually ate only one sandwich. If you have a family, you can not be wrong by staying here. If you want to leave your children playing or seeing the TV (78 channels!), you can go to the \"quiet room\" which is a huge lounge, very comfortable and cozy.", "Date": "July 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "BATTLE CREEK MICHIGAN", "Title": "“loved this timeshare”", "Author": "jgieske347", "ReviewID": "UR17136112", "Content": "we stayed for 7 days and I loved this place,no noise at night, no smoky smells, no overly crowded pool! I think I am getting old! I liked that you could get away from the strip in 5 minutes and get right back if you wanted to. The bathrooms were nice and we had a 2 bedroom, 3 tvs and a full kitchen. We didnt find the deli horribly priced, expected to pay more for convenience, and the sandwiches and salads were good and fresh. the pool was a pleasure, plenty of places to sit, clean towels and very pleasant company..we had our grandkids there for 3 days. pool drinks a little pricy but the slushies were very tasty. elevators quick and the staff very nice..we had zero complaints..convenient parking (free) just across the driveway,1 mile from drugstores, supermarkets etc w/o going to the strip..take a right on Karen down to Maryland Ave..Would love to stay here again", "Date": "June 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Great Resort”", "Author": "TravelBug85345", "ReviewID": "UR16798535", "Content": "This was a timeshare exchange. We had a 2 bedroom suite for a girl's weekend. It was great. The room were spacious and the beds comfortable. We did not hear noise from any neighbors and we slept late because of our casino hopping. I was very impressed with how this resort was set up. Check in was easy and parking was a breeze. There was no high pressure sales pitch. They left a message on the phone but we were too busy making donations at the casinos to talk with them. No one ever ask us directly to attend a meeting. I really like this resort and would recommend it highly to anyone. The Hilton is less than a 5 minute walk and the monorail is right there. We had breakfast at the Paradise Cafe and the omelets were great. You can't eat in Vegas for under $10 (even a sandwich and drink) but the Cafe was good and reasonable for Vegas. We had a great time and would go back in a heart beat.", "Date": "June 9, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "New York", "Title": "“Calm”", "Author": "OBofNY", "ReviewID": "UR15242492", "Content": "Nice and spacy rooms. Somewhat distant from action. The Monorail transport option helps though. Would prefer to go again when I retire.", "Date": "April 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Orange, California", "Title": "“Very nice for the price”", "Author": "Dr_Drew2", "ReviewID": "UR14988417", "Content": "As many of the reviews have mentioned that this is a typical timeshare location and the staff are really nice. Parking is easy, check-in was smooth, and the rooms are nice. We booked a studio on hilton.com for $75+ tax/night on a weekend and we were given a 1-bedroom suite, which was quite nice. It has everything in it including laundry, whirlpool tub, and a flat screen tv. There is a little store called the marketplace and it is really overpriced, but what hotel's store isn't anymore. The store has a large variety of food and non-food items. A nice thing about the location is that it is next door to the Hilton, so if you want a real restaurant, gym, or casino, it is right there. This was the first hotel we've stayed at in Las Vegas that wasn't in a casino and it was actually quite pleasant to not have to walk through the noise and the smoke before getting to the room. But it is not the typical Las Vegas experience. If you are looking for that, this is not the place for you. However, this location tends to have quite inexpensive rates.", "Date": "April 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Litchfield Park", "Title": "“A timeshare property”", "Author": "gmanlitchfieldpark", "ReviewID": "UR14223178", "Content": "It's a timeshare property, but that just means that you may get a suite w/kitchenette, wash machine & dryer & a full-sized fridge for the price of a nice hotel room. (On this particular trip we stayed in a studio--which is pretty comparable to any standard hotel room). My wife & I are big fans of packing our own beverages and snacks whenever we stay at a hotel...and although the studio suite only came with a refridgerator and microwave...it was still very convienient. The hotel is a short walk from the Hilton Hotel/Casino, and if you're there to gamble you only need to make that walk once a day, because the monorail is right next to the entrance to the Hilton. A 24 hour pass on the monorail is $9 and it takes you to a dozen casinos. The first night we rode all the way to the end of the line and then worked our way back...and just scratched the surface. Between the monorail and a couple of taxi rides (the Wynn looked like it was too far to walk to) we felt very satisfied with both our location and our transportation solutions. The hotel property was clean and well appointed, if not spectacular. There is an onsite coffee shop/deli/convenience store. What most impressed us was how friendly each and every one of the hotel staff we interacted with were. Good job on that. We did eat one meal at the adjacent Hilton Hotel Paradise Cafe, and it was a good, reasonably priced meal (breakfast). We had also recently stayed at a timeshare property in Scottsdale for a Christmas party and loved our room there too. We're definately going to add timeshares as a \"good value\" when looking for hotel rooms in the future.", "Date": "March 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "kentucky", "Title": "“Good for business”", "Author": "KentuckyTraveladdict", "ReviewID": "UR14131842", "Content": "Stayed here for a conference at the Hilton Convention Center. It was extremely convenient to stay at the same place as the conference. The hotel was nice, the casino was considerably smaller than the others, but was very luxurious - with crystal chandeliers and all. The hotel has several restaurants to choose from. Paradise Cafe was great for a lunch, the Buffet was decent and included wine and beer, Quark's Bar was really fun and had great drinks, but the Chinese restaurant was absolutely fabulous. We enjoyed the room; unfortunately, we were in an older room that had not yet been renovated. The room was still spacious and clean and the bed was very comfortable. We did have issues with the hot water when taking morning showers - I guess because so many people were going to the conference early in the morning. Having the monorail station there was great and it is truly the best way to get around Las Vegas - especially since the Hilton is so far from the strip. We did go see a concert in the theatre (not Barry Manilow, but another headliner) and the theatre was very nice, but could definitely use some updates. I would consider staying here again, but, next time, we will stay on the strip.", "Date": "March 8, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Denver, Colorado", "Title": "“Reasonable Hotel if You Want Quiet”", "Author": "TravlChick", "ReviewID": "UR13901303", "Content": "We are members of the Hilton Club and stayed here while attending a conference at the Convention Center. We had a 1 bedroom suite. The overall room was great and the small kitchen was reasonably well appointed (fine for making breakfast; wouldn't want to make a meal here). The facility has a pool, a food store, and a very small gym (1 stepper, 2 treadmills, and a universal weight set). If you want a place that has peace and quiet and no casino noise, this is great. It is within walking distance to the Monorail at the Hitlon (across a long parking lot). You don't really get any discount or advantage at the Hilton itself but if you want a nearby casino the Hilton has one. The Hilton (hotel) spa is nice; the gym is pretty small (several treadmills and steppers and several weight machines but relatively spartan by Vegas standards. Overall the Hilton Grand Vacations Club is fine if you want a quiet place to stay but it's not anywhere near a \"Vegas\" experience. One significant downside is that it's hard to get a cab here at night. During the day they call a cab for you and one usually comes. At night you are just out of luck (even if you call a cab, they don't come). It's 2 blocks from the strip and far enough away that you just can't flag one either. We ended up going to the Hilton hotel across the large parking lot and waited in the long cab line there. Leave yourself plenty of time if you have a reservation somewhere.", "Date": "February 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "california", "Title": "“Wonderful Place to Stay”", "Author": "cadagility", "ReviewID": "UR12279875", "Content": "I have visited Las Vegas many times and have previously stayed at the Excaliber and the MGM Grand. When you stay at a casino hotel, it can get on your nerves...the long walk to and from your room, walking thru a smoky casino, very few amenities in your room, etc. I wanted a change and the Grand Vacations Club was perfect. We booked a king-size suite. The kitchen was perfect, even a dishwasher! There was a small washer-dryer unit in the closet. The kitchen had everything we needed to make small meals and breakfast and the fridge was full-sized. Our son slept on the sofa bed in the front room and we slept in the bedroom. The bath included a large jacuzzi tub. The room was extremely quiet - so much nicer than having to deal with the partying that happens when you sleep \"on the strip\". The pool and jacuzzi were clean and heated and nobody was around when we used them. It was wonderful! The MGM closes down their pool during the winter months as do many of the Strip hotels. There was a small grocery in the hotel, but I drove a few blocks to a market and stocked up on food. The new monorail is within walking distance of the hotel, in the back of the parking lot...an easy way to get to any of the strip casinos. The hotel also had a concierge in the lobby. She was awesome. She got us great seats for Spamalot, even though it was very short notice. All of the staff was extremely kind, helpful, and accommodating. I can't say enough nice things about them. Many of the hotels on the strip have shabby rooms and are extremely dirty...this is because many of the visitors are partying and are rough on the rooms. At this hotel, everything was in good order, clean, and beautiful. There also was a lounge with a big-screen TV and a billiards table. Lots of room to play games, if you wanted. I saw many families hanging out there during the day, but it was never crowded or annoyingly loud. Our room even came with a DVD player so our son could watch movies. This is one of the few hotels where we have stayed with that amenity. I also work on the road, so I was able to access the wireless internet from my room on my laptop with no problem. The internet service is FREE - included in the room charge...the casino hotels charge extra for that. Other than the small market and your room, there is no place to eat at the hotel...however, you can walk to the Hilton which is right next door or eat on the strip. We ate most of our meals on the strip while we visited the various attractions, but it was nice to be able to eat breakfast in our room and also have snacks when we got back in the evening. Even better, the price was less than half what the casino hotels charge...let's see: better service, more amenities, cleaner rooms, and a better price (about $100/nite vs. $250/nite)...sounds like a no brainer to me. This will be my first choice whenever I visit Vegas from now on.", "Date": "January 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bakersfield, CA", "Title": "“Great Stay”", "Author": "btowndude", "ReviewID": "UR11271735", "Content": "I needed to use a timeshare week and wanted to attend a sporting event at the LV Convention Center, so I chose this HGV location. The check in was quick and friendly. My two bedroom suite was clean and roomy. I appreciated the numerous electrical outlets to hookup my electronic toys. My suite overlooked the pool and the front of the hotel. The view across Paradise Road was of the other HGV on Las Vegas Blvd, the Riviera, and the Stratosphere. Although there is condo construction across Paradise Road, there was no noise pollution. Traveling eastward along Karen, I found at the next main street - Maryland Parkway - two 24 hour supermarkets - Albertsons and Vons(Safeway). The Vons, even, had a gas station, where I filled up twice for $3.01 a gallon! :) I had problems with a dead battery in the in-room safe and a backed up toilet. Both problems were fixed quickly. Each bedroom and the living room had separate heating/air conditioning system, which was a nice touch. The hotel tower shades the pool area in the morning, making an early morning swim more a polar bear experience! Patio area heaters would have made the area more useable. It turned out to be a very long walk between the HGV hotel through the LV Hilton to the LV convention center, particularly on a cold, rainy day. I ended driving most of the time - hehe. Check out was also quick with no lines. The quiet, non smoking aspects of HGV was a nice retreat from the noise and smoke of the big casinos. The only negative is the lack of fans in the bathrooms. Bring a can of air freshner! I would recommend this location to my friends and family. Because of Hilton policy, I can not exchange for this location for the next two years.", "Date": "December 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta GA", "Title": "“HGVLV was a Lucky Pick!”", "Author": "annsplans", "ReviewID": "UR11045706", "Content": "I had not plannned to visit Las Vegas at this time of year, but lucked up catching a Delta Airlines special, $139.30 R/T from ATL, so I had to go! Since I hadn't been budgeting for a trip, I had to look for bargains. I found a good deal for the Saturday arrival at the Las Vegas Hilton, and saw that for about $25 more for the next two nights, I could move to the HGVLV. I really liked the idea of a kitchenette since I'm usually carrying a to-go box back to my room after dinners out on any vacation. With no microwave, well - whaddaya gonna do with it?! :>) Check-in was super. Right away, the Host/Concierge/Manager Robert took interest in making me feel special and welcome. I was given a wonderful 15th floor King Studio overlooking a golf course and facing toward the mountains and sunrise, which I loved. The bed was wonderful, and the kitchenette was just the thing for me to fix myself a drink or snack, or re-heat my to-go goodies, without having to dress and go downstairs or somewhere else, (although I did my share of that as well!) I had a rental car and bought myself some groceries and liquor at the Smith's grocery store off North Rancho. By signing up for the shopper card I saved $27 from my final total of $122 which included an apple pie (breakfast slice!) fruits, nuts, Brie, crackers, chips, a bottle of Stoly Citrus vodka which was on sale for $11 (!), a bottle of Ecco Dominici Pinot Grigio wine and this neat bottle opener/stopper gadget, a bottle of Jose Cuevero ready mixed Margueritas, Mr. & Mrs. T Bloody Mary mix, bottles of water, some makeup and a few souveniers as well. I actually brought a lot of this back home with me, (no liquor, but the other things I could pack) so my budget trip went very well. Even though I drank only about a third of the Stoly, for $11 it was definitely cheaper than buying drinks one by one somewhere out. Plus, I had my wonderful view to enjoy while sipping and enjoying my spur-of-the-moment R&R. The room already had a complement of Starbucks coffee pods for the coffeemaker, although I did make a run to the deli/grocery downstairs the next morning for more sugar and Half-N-Half. That morning I went to the pool downstairs. Even though it was November 19th, they were saying on the TV News that this near-record warmth was due to change on Tuesday, which would be the day I was leaving. The pool was heated, anyway. So I certainly enjoyed a November morning in the sun by the pool. I really liked the hotel toiletries. The lotion smelled wonderful. There was also a ironing board/iron, room safe and hairdryer, for those who need these items. In the morning, as a HHonors member, a USA Today hung on my doorknob outside. My room was quiet enough; I did hear muffled voices a few times from the neighbors, nothing irritating, just enough to know I wasn't totally alone up there. The room attendants were so friendly and accommodating. Any request I made was immediately and graciously handled. I thought I had lost my prescription sunglasses. The day I went to check out, I moved my rental car from the HGVLV parking lot around to the front to load my luggage. When I went around to unlock the trunk, there sat my sunglasses on the back of the trunk! Only in Vegas! Great rate, great room, great experience. I hated to leave, and I hope to be back ASAP!", "Date": "November 25, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "San Francisco CA", "Title": "“Great place near monorail”", "Author": "audigal", "ReviewID": "UR10843494", "Content": "We agree that the hotel was great, suprisingly so given some of the reviews. We also had a suite (upgrade -- not sure why) and the two rooms were more than needed and fabulous. The key was how quiet it was. The room, the lobby, the deli, etc. No waiting in line to check in, no worries getting a bell service to check our bags when we left, no worries getting a taxi. A couple things to be aware: 1) The deli closes at 10:00 and there no room service. 2) It is an easy walk (probably 500 ft?) on a small sidewalk past the parking garage to the hilton for restraurants, gambling and the monorail. 3) Don't take the trolley from the Hilton -- it is slow. Take the monorail. 4) Tell your taxi driver from the airport to go not take the freeway. It is an easy shot using the back roads to the hotel. Our cab ride was $40 from the airport and less than $20 back.", "Date": "November 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "San Francisco, California", "Title": "“excellent Vegas hotel”", "Author": "giftgrrl", "ReviewID": "UR10613871", "Content": "We had a king studio, spacious for the two of us. This property is very clean. Comfortable bed, good water pressure in the shower, double sinks in bathroom, flat screen TV in the living room (normal TV in bedroom). The air conditioning worked great and was silent. We heard no noise from the hallway or neighbors. No complaints about this place, everything worked. The location is definitely not central - 5 minute walk to the Hilton to catch the monorail, but that did not bother us. We usually stay at the Westin Causarina, but we booked this one with Hilton Honors points and were not disappointed.", "Date": "November 5, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "San Diego", "Title": "“Hilton...not at its best”", "Author": "delledge", "ReviewID": "UR10079137", "Content": "I agree with previous reviewers about the location. If you want to get to the action on the strip, a car or shuttle are best. If you like the quiet nature of a non-gaming hotel, this is a good choice. I stayed only one night in a king studio. I thought the room was pretty small and no different than a typical hotel room--but it did have a fridge and microwave, along with a toaster and coffee maker. The room was clean, but I had problems with my shower and toilet. Neither worked well. The shower faucet was nearly dangling from the wall and the toilet handle required frequent jiggling to get the water to stop continuous flushing. In addition, I had problems cooling the room down to a comfortable temperature. Windows do not open. Like another reviewer, I could hear conversations and a baby crying in a neighboring room--not a fun distraction during the wee hours. In the morning, the sounds of people showering in adjacent rooms were pretty loud. While the courteous, professional staff were great and the easy, close parking was convenient, I was unimpressed otherwise, and will not return, nor recommend this property. It's likely that the 1-bedroom suites are much nicer, so I hope future guests enjoy the 1 brm accommodations. My next stay is scheduled for another Hilton Grand Vacations property, the location on Las Vegas Blvd. I hope to have a better experience there.", "Date": "October 14, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sacramento, California", "Title": "“Nice Big Rooms, Long Walk”", "Author": "TheBenners", "ReviewID": "UR10061725", "Content": "My wife and I were contacted by Hilton Grand Vacations Club, to attend a timeshare. They gave us a one bedroom suite, that was nice and large. Full kitchen, washer & dryer, flat screen tv's, the works. We were pretty happy with the hotel. Our only complaint is it is located far from the action, and the cab fare from this hotel to the center strip ran $10 - $15 one way. We Finally purchased a 24hour unlimited use pass for the monorail which has a stop next door at the Hilton. The monorail runs every five minutes, and is very easy and clean. I am not sure I would stay here again due to it's location, but we had a great time!", "Date": "October 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "New Smyrna Beach, Florida", "Title": "“loved it”", "Author": "minot_1997", "ReviewID": "UR8885783", "Content": "First of all, it's on the Las Vegas Hilton property but not attached, it's own seperate hotel but easy walking distance to the Hilton. Enjoyed the room very much, especially the hot tub. Friendly staff, a nice pool but small, used for sunbathing mostly. But would go back again.", "Date": "September 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rancho Santa Margarita, California", "Title": "“Great Hotel”", "Author": "backbayusa", "ReviewID": "UR8609189", "Content": "We stayed here one night with our kids, and loved it. We had the one bedroom suite, and it was a lovely, spacious room. The staff is so friendly and helpful. They have excellent customer service. The pool area is nice, and they have a small bar outside. They have a nice deli inside, with a good choice of food and drinks. We would love to stay here again. It felt small and comfortable, compared to the large hotels on the strip.", "Date": "September 2, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Nice rooms, good location, but too noisy”", "Author": "TravelDrone", "ReviewID": "UR8281919", "Content": "HGVC at the Hilton is a nice hotel with large rooms (meant for their time share customers). Many rooms have a separate living room, kitchen, large bathroom with separate shower and jacuzzi tub in the bedroom. Some rooms have a great view toward the strip. The hotel is off Paradise, which means it's not a good walk to get to the strip. However, there is a shuttle, and more convenient, a short walk to the monorail station. The monorail is a smooth, quick way to get to the strip hotels. It should be cheaper, but it can save on taxi fares and kids just love it. I've stayed here four times, mostly because of the larger rooms and access to the monorail. Check-in is always a challenge: they post a 4pm check-in time, and then expect a 10am check-out. Recently, I have noticed that the dividing walls between the rooms are too thin. One family was having a normal conversation in their bedroom, and it sounded as if they were standing right behind me as I tried to fall asleep in our bedroom. I complained to the front desk, who called their room to ask them to be a little more quiet. But even after they lowered their voices, I could still hear them. I think the wall construction is the problem.", "Date": "August 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "colorado springs, co", "Title": "“Very nice time @ HGVC”", "Author": "lrobin622", "ReviewID": "UR8102793", "Content": "Let me tell you a bit about us before you read the review. My wife and I are both people who enjoy a 4-5 star hotel, we are not one's to nit pick at every little thing wrong with a hotel. So please keep that in mind when you read our review. We arrived at HGVC on Tuesday night, parking was a breeze. Not many times you can park your car and walk right into the hotel. Check in was a snap and the staff was quite friendly, no pushy sales pitch to buy a condo or anything. We had a 1bedroom suite, witch was clean and had all the little things we needed to make our stay enjoyable. I would recommend a high floor so you can look out unto the strip. Both my wife and I like to lay in the sun so the pool was wonderful, a bit small but that was no problem since people seem to come and go. They do have a nice little pool side bar and towels are furnished. Not much more than you could ask for. The HVGC is located on north end so if you plan on walking to strip you might think again since it is a bit of a hike. The closest casino was the Hilton right next door. (not impressed) The Rivera sits across the street along with Saraha. Both older casino but still lots of action if you are a gambler. If you have have a car I would just suggest just driving down to a local casino and use thier paking garage and accessing the strip from there. We did go out the Red Rock Casino, (wow). If you get a chance to go out there! We had dinner at the BBQ place (Salt Lick) and then a drink at the outside lounge. It was a perfect night. All and all HGVC is a good solid 4 star hotel. It is clean has everything you need for a fraction of the price you would pay staying on the strip. Just remember it is not a strip hotel so if you are looking for the hot night life this might be the place for you, but if you dont mind being a bit on the tame side then this place is for you.", "Date": "July 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Excellent Hotel for families!”", "Author": "ChaunceyGardiner", "ReviewID": "UR8030817", "Content": "Mrs. Gardiner, Kiddo and I spent six nights here in late June, as the two of us were attending a large conference at the Las Vegas Convention Center. This hotel was absolutely perfect for our stay. Check-in went very well, where we first met some of the friendliest, most helpful hotel employees I’ve seen anywhere… and that’s a big compliment from me. They continually remembered my name everytime I walked by, and they addressed my daughter by name too! They have an “active” lounge” and a “quiet” lounge, as well as a very well equipped deli/convenience store in the lobby. The deli opened at 7a each day, and served hot breakfast sandwiches, Starbucks coffee, etc. Full assortment of chips, beer, cokes, vino, etc. The pool was small, but that kept things manageable. (The Hilton’s pool (next door) was an absolute zoo.) There was a small pool bar that served drinks at prices very close to the package prices in the convenience store. There are two very nice built-in grills by the pool gate. We had a Suite, which included a separate bedroom and a fully workable kitchen (more on that later). The greatroom area was also spacious, and had a fold out sofa. Both rooms had large flatscreen TVs, and the greatroom TV had a DVD player… meaning that our traveling Kiddo could watch her Dora DVDs on the big screen, instead of her 8” portable. Bathroom had a nice sized shower, and Crabtree/Evelyn toiletries. A vertical washer/dryer unit was nice to have as well. The bedroom had a large whirlpool tub, and a too-small (note: only complaint here)closet. PERFECT, though, for a small family visit. Housekeeping was sparkling, and everything looked pretty darn new to me. Free wi-fi throughout the building, and reception was reliably between 28 and 54mbps both in our room and in the lobby area. Location is a caution here, depending on why you are in Vegas. It is directly next door (100 yards, tops) to the side entrance to the Hilton, through which you can walk almost all the way to the Convention Center. The Hilton’s monorail stop is just another 50 feet further than the side door. From the monorail, you can get most places fairly easily. You cannot, though, walk to the strip… at least not with temps in the 105-110 range. Parking looked like it was free here. We spent the full six days here without wheels, and had no trouble getting around. The $8 for 24hrs of monorail was a very nice deal, and Kiddo is only 3, so she rides for free. So, if the Convention Center is your driver for being here, this is a great location, great facility, and great pricing. If you want to be in the center of the gaming action, this ain’t it. In fact, there’s no gaming in the HGVC at all… you have to head over to the Hilton. The HGVC does not, other than the deli, have dining… you have to walk to the Hilton… (which is fine, because you can charge back to the HGVC, and get HHonors points!) We ate at Quark’s twice for lunch (good menu, reasonable prices, and Star Trek characters visit the tables). We also ate at the Paradise Café, and found the food acceptable, but not great. We had one dinner at the Benihana, as we thought Kiddo would enjoy it. They were helpful with her and her needs, and the cooking show is always fun. Should mention that we had one dinner at the Paris Hotel, at Mon Ami Gabi. Third time we’ve eaten there, and it really is good. Excellent pricing, and the staff is a lot more friendly than up in the Eiffel Tower. Our waiter there was Dion, and he was superb… see my review at that restaurant for more. Back to the HGVC, though, and a further compliment about the staff. While here, we found that an old friend of ours was having his wife and two kids into Vegas after our conference ended. Since we had a kitchen, and they had two boys, we decided that it’d be a heckuva lot cheaper to grill out and eat in our suite than to try to feed four adults (with vino) and three kids in a restaurant. I grabbed a cab over to a nearby grocery store, while Mrs. Gardiner visited the front desk to explain what we were up to… within 15 minutes there were two ladies from housekeeping at the door with another four place settings of dishes, glasses, new silverware (still in wrapper!) AND extra papertowels and soap, --- WOW! One of the housekeepers noticed that I had corn-on-the-cob sitting in a cardboard box and said “You can’t serve friends from a cardboard box!”, then returned five minutes later with a still-in-the-wrapper cooking sheet to serve from! Outstanding! To sum, we successfully prepared and served a full dinner for four adults and three kids... no problem. We grilled by the pool, using BBQ tools readily borrowed from the deli/convenience store, and carried steaks and corn back upstairs, and ate comfortably while the kids watched TV. Net, this was a great hotel for our family, perfect for attending the conference and various meetings. The employees were nothing but wonderful. My compliments to whoever heads HR there, and to the GM. Very, very well done!", "Date": "June 30, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Vancouver, B.C.", "Title": "“Beautiful room, but loud children in the pool on 2 afternoons”", "Author": "MG214", "ReviewID": "UR8022842", "Content": "We stayed in a beautifully decorated one bedroom suite with a kitchen and FREE internet. The suite was very clean. No organized activities but it is not necessary in Vegas. The cart to take bags to the room was not available without the bellboy, who was never available when we needed him. The \"no baggage cart without a bellboy\" was annoying as we had too many computers, bags, and groceries to wait around for a bellboy with cart. We had a one bedroom, very spacious, but it was a lockoff with a studio next door and we could hear the people next door when we were in the living room. The little convenience store onsite and the bar by the pretty pool are nice conveniences not all timeshares have. We liked the free acres of parking, including the covered parking. We used the Las Vegas Hilton to gamble in and found the block walk fine for us but more incapacitated guests complained about the inconvenience of the timeshare location. Very pleasant, helpful staff. Noisy children on two afternoons ruined the ambiance of the pool. No staff corrected the children, who shouted \"Marco\" \"Polo\" for what seemed like hours. We just left, disappointed our sunshine time by the pool was spoiled. Otherwise, we loved our time at the HGVC; it was our 2nd time there.", "Date": "June 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Chicopee, Massachusetts", "Title": "“Great place, even if it is a little out of the way”", "Author": "tjbartjr", "ReviewID": "UR7853824", "Content": "I stayed there with my family & fiancee for a week when we went to Vegas this past September, and what a great place it was. It didn't feel like a hotel at all, felt much more like a home. Flat screen TVs in all 3 rooms with DVD players! Comfy beds, kitchen was well laid out (sink FACED the living room, it wasn't away from it), the property was clean, pool was nice...I'd definitely stay there again. The location off strip was nice too, although it made going everywhere a little bit of a walk. No big deal though, I had longer walks to class when I was at college. Highly recommended, good for families and everyone else.", "Date": "June 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Auckland Central, New Zealand", "Title": "“Average and miles away”", "Author": "zoomer-7", "ReviewID": "UR7842649", "Content": "We got here after a poor experience at another property. Room excellent. Taxi scarce. Staff super good. Price OK. Pool looked great (sorry, convention attendee so didn't get to lounge around it!) I'll be back with family. If you want to be close to the strip, go elsewhere.", "Date": "June 13, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Riverside, CA", "Title": "“The only place we stay in Vegas”", "Author": "edso38", "ReviewID": "UR7804030", "Content": "My family and I stay at the HGVC at the LV Hilton every time we come to Vegas. The rooms are spacious and clean (My mom is a maid by profession and she was impressed) and have courteous and attentive staff. I feel sorry for the people that stay here one time and have a bad experience, but we have stayed here 6 to 8 times and haven't had one problem. Bellman and maid service is always prompt. We love using the grill down by the pool as well as having a full kitchen in the room at our disposal in the one and two bedroom suites. A washer and dryer are included in the one and two bedroom suites as well. Our family loves to go out and we can call down for a minivan cab or walk 5 minutes to the monorail. You can get your cabbies phone number and call him/her directly for a cab. The monorail is a great deal if you want to go down to the MGM as you can purchase a 10 ride ticket (good for a year) that can be shared by those with you. If its just you and another person thats $7.00 one way as opposed to an easy $20 cab ride. What makes this property so inviting is the fact that it is private and very quiet. The Las Vegas Hilton is a stone's throw from the HGVC and you can catch a cab or the monorail or just plain ole walk to the strip. If you need to be close to the action stay at the HGVC at the Flamingo, but if you like to stay at a quiet, well maintained hotel, the HGVC at the Hilton is the best place to be.", "Date": "June 8, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great For Mini-Getaway!”", "Author": "Doraemon79", "ReviewID": "UR7713336", "Content": "I stayed in HGVC in LV Hilton on memorial weekend. Got a very good rate on a sold out weekend and this hotel is very family-welcome (unlike the LV Hilton which is VERY smokey - I am still coughing from the excessive smoke in the casino lobby as of now). The hotel lobby is small but efficient. The staff was very friendly and did find us a room to upgrade us to the one bedroom suite, which is an added bonus! The One Bedroom suite have everything you needed! This is what you will get: in Living room: Philip LCD TV (32/37\"), a sofabed, dining table for 4, full refridgerator, full washer/dryer with detergient, dish washer, blender, coffee machine, and a stove, and a DVD player and 2 little bottles of water with a box of chocolate. In the bedroom: u get a walk in shower, a king size bed with a tv (non-flat), and a spa/jacuzzi tub. The only thing that I don't like about the tub is that its in an open area (Which means no privacy to take a bath unless you are travelling with special someone - I think lots hotel in vegas tend to have a tub in an open area...thats kinda odd. As a HHonor member, you'll receive a $10 voucher thats good for purchase at the deli on the 1st floor, which is also very reasonbly-priced for a hotel property. The hotel also have shuttle (don't know if its free or fee-based), and best of all, free wireless internet ! Most of the hilton property that I have stayed at don't have this option! and its VERY quiet and not far from the monorail station and pretty easy access to everywhere in vegas (even to the strip, because paradise blvd basically got NO traffic compare to LV blvd). Overall, a great stay! I will this property if they can change the mattress to the new Hilton mattress and update the furniatures!", "Date": "May 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Honolulu, Hawaii", "Title": "“Best Place I ever stayed in Vegas”", "Author": "mksharpe", "ReviewID": "UR7478369", "Content": "I go to Vegas for the NAB Conference each year, and usually I stay at one of the big casinos. This year I brought my 15 year old son, so I wanted to stay in a place that had a kitchen. From the reviews, I decided to try the Hilton Grand Vacation Club at the Las Vegas Hilton. We loved it! This is the best hotel I have ever stayed at. Everything was almost perfect. We had a one bedroom suite and it worked out great. The king bed in the master bedroom was very comfortable. The jacuzzi tub was really nice and great for relaxing after a long day walking around at the convention. The bathroom was huge and the shower was nice and big. Since we were there for 9 days, the washer and dryer unit in the suite was a big plus. We washed clothes a couple of times. There was a free box of detergent in the room, and we asked for more and got it. It was great having a full kitchen, even though we didn't use it a lot. We love eating out! The free internet was a huge help. All of the other places I have stayed, charge around 12.00 a day for internet. This adds up over a week. We rented a car, so when we wanted to see the sights of Vegas and go shopping, we could get around easily. Everywhere you go has plenty of parking and it is free. The money we saved on internet fees, paid for the car! Also, you park right in front of the hotel and go right up to your room. No smoke to walk through, that was a plus. The store in the lobby is very convienient. They sell starbucks coffee and make all kinds of deli items. All in all it was a great hotel. We would stay there again. Probably next year for sure!", "Date": "April 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York", "Title": "“GREAT FOR FAMLIES”", "Author": "james15", "ReviewID": "UR7338830", "Content": "my wife and two boys stayed from 4/1/07-4/08/07..we loved the quiteness of the hotel ...it is off strip and i loved it... we drove to all hotels on the strip...do valet parking will cost $3.00 .the cost of the monorail is 3.50 pp if you buy the 10 trip...the monorail leaves you far off the strip and a long walk away...valet leaves you in front of the hotel ..worth 3.00 to valet..pool area was very nice as well is the store...i would most definetly stay here again in the future.. if you want crazy stay elsewhere..if you want quiet after running around the strip this is the place....", "Date": "April 12, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Sacramento, CA", "Title": "“Poor Maintenance & Motel 6 bedding”", "Author": "Vigilant_Always", "ReviewID": "UR7294421", "Content": "This is a nice property but definitely not one of the newer facilities. The location is OK for most things as it is close to the monorail and trolley if you don't want to walk or take a taxi. The main problem was that the “adjustable” shower head would only provide a poor cone shaped flow and could not be set to the standard multiple streams produced by most showers. This was reported to the front desk twice before any action was taken and after it was “fixed” it still would not produce multiple streams but just a better flow of the cone spray. Also the quality of the bedding is inferior to what should be expected in this type of a resort (Motel 6 linens and pillows?). Overall a decent place to sleep at night but not what should be expected from a Hilton Resort!", "Date": "April 8, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "1"}, "AuthorLocation": "Roseville, CA", "Title": "“Great stay - Location could be better”", "Author": "mototravel", "ReviewID": "UR7228198", "Content": "Not one bad thing to say of the hotel itself. We were in the penthouse suite and loved everything. The location is between the Stratosphere and Circus Circus at the far end of the strip. The trolly stops right at the front and the monorail isn't too far away. Just leave yourself enough time to travel when going to a show or exhibition.", "Date": "March 27, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "North Carolina", "Title": "“nice, but not the best for vacationers”", "Author": "mrs.thanks", "ReviewID": "UR6810203", "Content": "We stayed here for a long weekend in February 2006. It's a bit off the beaten path (not \"on\" the strip) BUT it is right on the monorail and at the convention center. It's nice, but not as nice as I had imagined a \"grand vacation\" property to be. We went next door to gamble in the Las Vegas Hilton casino... walking back after gambling and drinking was a bit of an adventure! My only complaint worth sharing was the location ... it wasn't as centralized as I would have hoped, although we were both up for walking - a LOT. We literally walked the whole strip (and took the monorail back). I wouldn't stay here again unless I was in town for business, attending a tradeshow at the convention center. There are better values in Vegas than this hotel.", "Date": "February 19, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "United Kingdom", "Title": "“CHANGE IF YOU CAN”", "Author": "steve1843", "ReviewID": "UR6571681", "Content": "Our stay at the Hilton Grand Vacations at the Hilton, was OK, but there were a few little niggles i have to tell you about. Because we put the \"do not disturb\" sign on the door, the second and third mornings the maid decided to make as much noise as possible cleaning the room next to ours, (opening and slamming drawers, hoovering, running the bath for ages, (while cleaning the rest of the room) in order to wake us up and hopefully get us out of the room so she could clean it. TOUGH!.. just because it was Christmas, I suppose she wanted to finish early - but we were on holiday as well!!..The third day i went down to reception and asked if anyone was staying in that particular room. I was told that there was someone staying in it - so they did their own cleaning did they?? After that though, the noise stopped. It got to be quite expensive getting to the strip every day - the monorail is not cheap, and taxis usually cost around $10 one way. Sometimes we walked to the stip, but some days it was quite cold, and we had to get alternative transport. When we were going back to the hilton at night, we still had to walk from the strip when we got off the bus (around a 10 - 15 minute walk) - and it was very cold at night If you have the choice, stay at the one on the strip. There is a bus stop right outside - so much more convenient (and better when travelling back after a night out).", "Date": "January 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "McLean, Virginia", "Title": "“Hilton Grand Vacations - Non Resort Hotel ideal for Business Travellers”", "Author": "Brit_Dip", "ReviewID": "UR6015974", "Content": "On Karen Avenue/Paradise Road a couple of (parallel) blocks from Circus Circus / Sahara. Not too far from the Stratosphere although a substantial hike to New York, New York or downtown. Handy for the convention centre. Although the Las Vegas Hilton is easy to spot, the Grand Vacations are tucked behind one of the multi-story car parks that serve both hotels. Major constructions are taking place close to the hotel although this did not disturb the my time here (from 10pm to 6am for a couple of nights). This is not a resort hotel (a requirement of company policy for some folk) and has been geared to a different, mainly business, market. Rooms are standard business size with fridge, microwave, toaster, coffee facilities and enough pots/pans/cutlery for those that need to do a limited amount of self catering. My room was clean and well presented and afforded a nice view of the sunrise through the mountains. If you are coming from Eastern Time, you'll probably catch this! Hotel has a nice pool area, not too overwhelming, which looked in good order. They provide a free outside grill should you happen to have packed your sausages. The hotel has a deli/shop for your immediate needs but does not have any restaurant facilities. Definately no free lunch (or free breakfast) here. Very small business centre ( one PC, minimum $5 charge) but free wi-fi. No queue at the desk and good sevice - my request for a quiet room away from elevators, ice machines and conctruction was met with minimum fuss. I paid $80 per night through company travel web site. No complaints and, providing the price was right, I would use again.", "Date": "October 26, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sunnyvale, CA", "Title": "“Sedate & secluded but convenient”", "Author": "Orthonormal", "ReviewID": "UR5961522", "Content": "Our standard room (no full kitchen or jacuzzi tub) was well decorated and in excellent condition. It included a small kitchen counter with a sink, microwave, mini-fridge, and utensils & plates. The entertainment center had doors to hide the TV, and included a nicely sized TV and a DVD player. The hotel was nice and quiet, and not crowded at all even compared with the fairly mellow Hilton next door. However, it was still pretty convenient to get places, because the monorail stop for the Hilton was just a short (5 minute) walk across the parking lot. The concierge was helpful for little things like getting airline boarding passes printed and letting us know where to store our luggage after check-out (they have a bell desk in the lobby). The \"deli\" and convenience shop was grossly overpriced, not unlike the convenience shops inside other hotels. I had a problem with the bill, which was that the rate I was charged did not match the rate quoted when I made my reservation and paid my deposit on the Hilton web site. The staff could not correct it at check-out time, but I was able to get the error corrected over the phone afterwards simply by providing the confirmation number.", "Date": "October 16, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Groton, MA", "Title": "“Great for business travelers”", "Author": "ipoems", "ReviewID": "UR5894306", "Content": "Great hotel for business travelers. Twelve minute walk from the conference center. Professional staff. Rooms are clean and full of conveniences (like refrigerator, toaster, sink, coffee pot). Get the 5.95 lunch special at Thai Red Pepper at 2226 Paradise Rd (10 minute walk for a relaxing atmosphere and great food). Capriotti's further down the road has very good subs.", "Date": "September 30, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Diego, CA", "Title": "“Great place!”", "Author": "radiacabeza", "ReviewID": "UR5881257", "Content": "Stayed here overnight to see a show at the Hard Rock. We were very, very pleased with these accommodations. Room was very spacious and clean. Had a lovely bathroom and master suite along with a great big tub too! The kitchen, while we did not use it, was nice to have. The washer and dryer came in handy for washing our beer and cigarette smoked soaked jeans (gross). Property was very quiet and easy to get in and out of. We will definitely come back here. It is a great hotel for a family or a group of friends because the rooms are huge! Great price too! ~ $100 for a Saturday night - can't beat that!", "Date": "September 27, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Berkeley,CA", "Title": "“perfect for business traveler”", "Author": "kritikia", "ReviewID": "UR5771201", "Content": "Stayed here for 5 nights. The proximity to the Hilton and the convention center made it an ideal location. The only negative would be the bedding. If they upgraded the linens and provided better pillows it would make a big difference. Other than that, it was clean and quiet which is just what I was looking for.", "Date": "September 5, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Leeds, UK", "Title": "“Nice and comfortable, ideally located”", "Author": "TonyPassmore", "ReviewID": "UR5621992", "Content": "We stayed at the HGVC for a week as part of an RCI exchnage The Hotel is nice and quiet. We stayed on the Strip last year at the Mirage, and felt this year we wanted somewhere a little quieter, but close to the Strip. This place was perfect for that. The rooms were of a very good size (we had a 1 bed appartment with a 1 bed studio attached) and were very tidy (if in need of a little updating) and very clean. The staff were very friendly and the deli on site was useful. The proximity to the Las Vegas Hilton and the mono rail was great also. Nice pool area with waitress service mostly", "Date": "August 18, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Southern California", "Title": "“Great weekend stay !”", "Author": "tempdragon", "ReviewID": "UR5564441", "Content": "Just returned from a weekend stay at the HGVC Las Vegas. Checking in on Friday at 5 PM was a breeze. We were the only ones in line. The service was friendly and professional We had a 2 bedroom suite. The unit on the 8th floor was clean and it was nicely decorated. It was only my wife and I along with our 5 year old son staying in the suite. My wife and son took the main bedroom and I took the 2nd bedroom. Each had a king sized bed. The room was slightly dated, but it was nicely decorated and kept in good clean condition. I’d rated it an 8 out of 10. The kitchen was nicely furnished. We ate out, but if you wanted to cook, all the pots and pans were there along with cooking utensils. There was a sponge and dish washing detergent along with plenty of towels to wash the dishes. The bed was excellent and the amenities were nice. There were plenty of towels. There is also a washer and dryer in the unit. They even provide you with detergent and fabric softener. There were plenty of storage space and lots of room to spread out. The pool area was great. It was mostly family and it wasn’t too crowded. Most of the pool was 3 to 4 feet with the middle being 5 feet in depth. My 5 year old son had a blast. The 2 Jacuzzi were kind of small and I think it would only fit 3 or 4 people at a time. However when we were there, not too many people used the Jacuzzi. I didn’t use the gym but it looked well equipped. Parking was convient. It shares the same parking structure as the Las Vegas Hilton. It is a 3-5 minute walk to the Las Vegas Hilton. The monorail is also about a 3-5 minute walk. We had a car, so we didn’t use the monorail. Friday night we ate at the LV Hilton buffet. During check in they give you a $10 off coupon. It has all the beer and wine you can drink, for those that like to indulge. We checked out on Sunday morning and it was a breeze. Checked out at 9 AM and there was only one other person in line. Again, very friendly service. Overall, a very good experience.", "Date": "August 6, 2006"}], "HotelInfo": {"Name": "Hilton Grand Vacations Suites - Las Vegas (Convention Center)", "HotelURL": "/ShowUserReviews-g45963-d234836-Reviews-Hilton_Grand_Vacations_Suites_Las_Vegas_Convention_Center-Las_Vegas_Nevada.html", "Price": "$95 - $223*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">455 Karen Ave</span>, <span class=\"locality\"><span property=\"v:locality\">Las Vegas</span>, <span property=\"v:region\">NV</span> <span property=\"v:postal-code\">89109</span></span> </span> </span> </address>", "HotelID": "234836", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/1f/a9/20/welcome-to-hilton-grand.jpg"}}