{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Art is love made visible!”", "Author": "Mermaid_Nix_ZA", "ReviewID": "UR122003374", "Content": "Propeller Island City Lodge is an exceptional place. We spent 3 nights at this hotel and found it a delight. We booked room 14, HollyWood, which had a lovely bath in the middle of the room and a balcony. Climbing ladders to get into our (very comfortable) beds was part of the fun; as was the delight of discovering the audible art. People at the hotel are friendly and willing to help in any way, and the free internet, a good bonus. A simple and good German breakfast was worth it. If you want clinical hotel chain luxury, this is not it, but I'd certainly recommend this hotel to anyone wanting an out of the ordinary experience with a comfortable bed and friendly staff.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Odd but nice”", "Author": "kingtravel1", "ReviewID": "UR119667910", "Content": "Odd place but you likely can figure that out for yourself. this is NOT a fully staffed place and was quite a pain to get in after hours... keep that in mind!", "Date": "October 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“A bizarrely amazing experience”", "Author": "jessic4b", "ReviewID": "UR106228591", "Content": "Slumbered in a flying bed in the \"Therapy\" room with white walls, mood lighting and a furry feature wall. Then after 3 nights floated on a raft attached to the ceiling with shipping rope and sacks lining the floor. This was truly a surreal hotel and a great place for a group of friends to visit. While slightly out of town it was a mere walk to the nearest train station. Lady running the place was legendary in her attentiveness and kind manner. Would definitely recommend going and checking out some of the other rooms/art installations.", "Date": "April 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tilburg", "Title": "“MUST DO - Experience -”", "Author": "GustVanDijk", "ReviewID": "UR100369176", "Content": "I have been staying at Propellor Island City Lodge since it's very beginings when rooms were still smelling like new, the breakfast had peeled apple slices and Lars himself would welcome you. Every two years I have a peek at other or new rooms Lars and his crafty team have come up with. And every time I enjoy the playfull way, with no consession made to form and the energetic designs come tot live.. Some of the room are not comfortable, that's true. Some of the rooms are definitely designed for males who do not care about putting on make up, and yes it is laboursome to clean some of the rooms because of the materials used. But despite all this we love the experience for 2/3 days and the atmosphere and the music composed by Lars which used to play through the individual headphones. We actually come for the playground feeling The staff are lovely, accommodating and helpful. Location is also quite convenient and public transport is just round the corner. Some interesting restaurants and bars as well. The designers outlets which you'll find in the surrounding streets are a must to visit when you are in Berlin.", "Date": "March 16, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“more like a museum or funhouse than a hotel”", "Author": "jwheeler85", "ReviewID": "UR85698563", "Content": "So I learned something very important while staying here: cool looking rooms do not equal comfortable and accommodating hotel experience. Our stay began around 9pm at night. We had contacted the hotel staff to let them know we wouldn't arrive during their working hours (staff is only there for a few hours every morning). They left the room key inside this little combo lock box that was built into the door frame. Weird. From there it took us about 45 minutes to find our room. The hotel is inside a larger building that has regular residential apartments. The main lobby and 1st floor rooms were easy enough to locate, but we were told that we were on the 3rd floor. Back out to the main stairway we went and up... lights were out on the floor... super. Two doors on the floor: one normal looking room and one big glass door leading to who knows what. Our key by chance opened up the normal door... which was a storage room or something. No lights, and stuff thrown all over the place. We reasoned that this couldn't be our room; but were kind of freaked out that our key opened some random room that wasn't really part of the hotel. Made us wonder if the same key opens every room. Tried the glass door next: this was the correct door. More rooms beyond this door. This place really needs to put some signs up in the hallway to guide guests to the rooms. Our room was ok, but gave us the feeling that it wasn't built for people to stay in. The sink and shower were stripped down to basic copper piping and garden faucet style knobs (supposedly the art part of room)... looked like it was made from dumpster scraps. The shower head needed fixing as it spurted out only a few tiny streams of water. I laughed when I inspected the bed: it was literally a 2 inch thick piece of foam on a wooden frame. That's not a mattress. Again, suggesting that the room was built from salvaged scrap material. I think we saw one staff member upon check out. So that's something to consider... you are pretty much on your own at this place. This was certainly a unique hotel, but you couldn't pay me to stay here again. I can't speak for other rooms, but at least I can say that ours was not built with human habitation in mind.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Regensburg, Germany", "Title": "“Original hotel that everyone should see”", "Author": "enygmatys", "ReviewID": "UR73531895", "Content": "I stayed at the most expensive room of the hotel and at a very strange room. I also had the chance to see other rooms and I have to say that the ideas of the artists regarding the rooms are exceptional. This is by far that most exquisit hotel I stayed at because of its rooms and their originality. I will definetly come back to try the other rooms. It is also close to the subway station which makes it perfect for a city visit in the historic Berlin", "Date": "August 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "London", "Title": "“Ummm, fine for one night but way too expensive”", "Author": "ukproptoppy", "ReviewID": "UR58971797", "Content": "This place is quite fun and breakfast was good and nice friendly staff as well. Our room was nicely done with a sort of sound machine for mood setting. It just really has ideas slightly above what it delivers. It is expensive (you can get a 5* hotel in Berlin for the same price) and so expectations were that it would be spotlessly clean, comfortable and have all the basics you might expect at that price. It just isn't. It is kind of cool and fun for one night but it is not anything really special. I feel bad saying it as the artist has put all the effort into it, but our room felt more like an overpriced quirky youth hostel than an 'art instillation' . It is basic with old linen, no soap, hairdryer, reception only in the morning, see through curtains (so you can't sleep) and not much else. I think at half the price it would be great but at 130EUR for 2 it is taking the mickey really.", "Date": "March 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "5"}, "AuthorLocation": "manchester", "Title": "“cool experience for one night”", "Author": "zoobus", "ReviewID": "UR52489782", "Content": "This hotel is really different! We stayed in the room completely lined with mirrors. It was very very tiny, but that was all part of the fun. Very friendly staff, good English. Ok location, very quiet area. Fantastic breakfast in cool dining room. Would love to stay in the other rooms! It's probably only good for one night as it was quite expensive but you share bathrooms (about 3 rooms per bathroom I think) - all very clean, though the shower was only average. Amusing side note: they sell postcards but they're laminated so you can't write on them! ha!", "Date": "January 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "UK", "Title": "“Oh dear!!!!!”", "Author": "turtlehead69", "ReviewID": "UR46942848", "Content": "Really really wanted to like this hotel, but I really, really didn't. When we arrived, all the lights were off and we couldn't get in. Finally after a text message we were let in, no polite talk of, \"how's your flight\", instead, \"Here's your keys a turn the lights off when you leave the room\". This was my first problem with the hotel. I thought this was about an experience of staying somewhere arty, but it was the most depressing hotel I have ever stayed in. The fact that the hallway lights only come on for about 20 seconds only added to the horrible lonely atmosphere. Location wise it isn't great, but that was my fault for not checking out Berlin first. We stayed in the granny room which was not very nice. It felt dirty and was. After this we stayed in the flying room, which was dark and finally the space room which was even darker and just as dirty. I managed to pick up bites on my legs and two on my face. I would go as far as saying I hated this hotel and it is definitely the worst place I ever stayed(and it's not cheap)", "Date": "October 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Jerusalem", "Title": "“Not for everyone but yes for me”", "Author": "BBeeps", "ReviewID": "UR45402000", "Content": "Half my life I spend in hotels while traveling for business. Berlin was a holiday and I needed a break from bland boring hotels rooms - this was it and some! We were two friends and we tried out the Museum and Hollywood, both were awesome. Granted you need to know what you are getting yourself into and the site does give you a lot of important info about each room so do your homework and even consult with the staff when making the reservation. The staff were lovely, accommodating and helpful (we even got to peak at other rooms and for next time we know which ones we want to try out). The hotel experience was more then just a bed to sleep in, it was an enjoyment of art and creativity and it made our holiday. Location is also quite convenient and public transport was quick and efficient. I actually found it refreshing to be in a real neighborhood and not in the middle of touristville... We will definitely be back and we can't wait to taste more rooms.", "Date": "September 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“A sleep-in art gallery”", "Author": "DiabloAzul", "ReviewID": "UR44250351", "Content": "Before you book a room in this hotel, you need to know what you're getting into. The hotel website gives you a pretty good idea, but they gloss over a couple of important facts: first, the only \"service\" is a receptionist, present only from 8am till noon. The rest of the day, it's just you and the other guests! Second, most rooms do not have an en-suite bathroom, so you will have to share the facilities. Did this detract from my experience? No, not in the least. Frankly, all I wanted was a room in which to sleep. And as far as rooms go, these are certainly special. I was shown both the Orange room and the Mirror room, but unfortunately both were already taken so I stayed in the Therapy room: an odd-shaped white volume with a bed on a plinth in the middle, and a full-length mirror suspended from the ceiling over it. A number of switches on the wall lit red, green and blue neons which you could combine to suit your mood. A small control panel let you play with ambient sounds and other (allegedly) therapeutical effects, but I did not dare touch it. After a good night's sleep came the pleasure of waking up in such an unusual place - it brought a huge grin to my visage! The continental breakfast was simple but good.", "Date": "September 24, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "3.0", "Value": "1", "Location": "1", "Rooms": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Room 24 - Worth a look but a little creepy & bad location”", "Author": "Mayzer", "ReviewID": "UR39211841", "Content": "We moved here after staying in ahostel for three nights. It was supposed to be a treat on the last night. We moved from Rosa Luxembourg (city centre) to Wilmersdorf. The change in location was not worth it. The area is kind of tacky. You'll need to travel back to the city centre for anything nice. The room we stayed in was small, the round bed only is not very deep so we both had to sleep in the middle and stick our legs off the edge to be comfortable (and we're not an exceptionally tall couple!) The bathroom is made out of dark blue perspex so if you want any sort of privacy when going to the toilet then avoid this room. Internet didn't work either. The giant seat raised about 9ft from the ground makes this room more like a place to live out some weird sexual fantasy more than anything else! Do with it what you will!", "Date": "August 30, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "5"}, "AuthorLocation": "brussels", "Title": "“Valentine's Day Experience Never to Forget”", "Author": "parmo1", "ReviewID": "UR28131718", "Content": "We stayed in the Upside Down room, i saw an article in an English newspaper about the world's most unusual hotels. The room was smaller than it looked in the photograph, it was a tiny bit disappointing, but not much. Some of the rooms do not have bathrooms/toilets, ours did. It was an artistic experience, yes, as others have said. No frills really, a part time hotel built by an artist. A little expensive, no frills, just the incredible rooms, there are breakfasts available. It is more like a set of appartments than a \"hotel\". It all makes makes you feel somewhat liberated, wild really. I wouldn't return, but recommend it for a 1 night experience.", "Date": "April 16, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "New York City", "Title": "“Creepy and Uncomfortable”", "Author": "LHope05", "ReviewID": "UR26447714", "Content": "We checked into the Propeller Island after seeing all the amazing photos on the website. Clearly, we either chose the wrong room, or the photographers had some real tricks up their sleeve. We got off to a terrible start at check in, where the front-desk attendant was flaky and forgot to even give us our room key until we reminded her. When we walked into the SpaceCube, I actually involuntarily shuddered. The room was cold, dark and dungeon-esque. The divider that goes in the middle of the bed is similar to a blunt guillotine, and the lights in the room were a sea of blue. No TV, no remote for the music, broken wifi. We were in hell. I totally agree with past reviewers that say that this is not a hotel to sleep in--purely to act out all your weird sexual fantasies. Unfortunately, my gal pal and I were unwarned and were forced to endure a see-through bathroom (awkward), very uncomfortable mattresses, and a nightmarish environment. I did not sleep a wink. To make matters worse, the flake at the front desk messed up our bill at the end and charged me twice instead of properly splitting the bill. Don't stay here. Save your money and spend it at the Circus Hotel--which rocks.", "Date": "March 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Amazing but come prepared”", "Author": "KPPinnage", "ReviewID": "UR25762159", "Content": "This is an experiance. Often a hotel in a city break is a place of rest and comfort, here is it a continuation of the cultural experiance. This is like staying in a modern art installation. This is not the Marriott. Do not expect the usual pampering services. If you want room service, TVs, fluffy bathrobes etc then do not come here. We loved it. We stayed in the Blue room for one night and the Nude room for the second, changing rooms incurrs a fee - irritating but understandable. The blue room was probably one of the most normal of them - we chose \"safe\" options, unsure of what to find - next time we´ll be more adventerous. The nude room was ok but maybe not naughty enough :-) The shower in the nude room caused slight discomfort, not very practical but you have to live with a bit of that here. Bathrooms are not as separated as much as in most hotels and I would suggest that non couples might find it awkward at first. The staff were helpful and spoke good engligh, although they are only around for specified times. The location isn´t great, but it is still in central berlin, didn´t need a train or anything, easily walkable. The most interesting hotel I have ever stayed at, but you need to be sure it is for you.", "Date": "March 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Phoenixville, PA 19460", "Title": "“A Fun (And Sometimes Scary) Adventure!”", "Author": "Shawnofthedead", "ReviewID": "UR21143537", "Content": "I just returned from a business trip to Berlin and this was the hotel I called home for four nights. Though there might have been more convenient hotels I had a unique experience and left happy that I choose to risk staying here. For the purpose of my review, please note that I stayed two nights in Freedom (actually a prison cell) and two nights in Therapy. If you are considering staying there, remember forewarned is forearmed: The registration desk is only open from 9-12 and they mean it. If you need help at other times call the mobile and don't waste your money with the main number -- no one's there and you'll just hear a long message directing you to the mobile anyway. Pack a travel alarm clock. There's nothing telling time in the rooms I enjoyed. The first had a TV with a couple channels and the other didn't. When you arrive, listen to the whole introduction to the hotel before asking questions. The staff has a prepared set of instructions and most of the things you need to know will be covered -- just be patient and save questions for the end. The main downside of this hotel is the location. The street is kind of boring and in an expensive, not-really-happening part of town. It's also not too dodgy, so that's a plus. You can easily catch the train to the big tourist spots and Propeller Island City Lodge makes a great jumping off point for the rest of Berlin. I'm American so the lighting system (very normal in Europe) threw me for a loop. Lights on motion sensor and timed to shut off meant I got startled by lights going on or off when I wasn't ready for it. The upper levels of the hotel and the fire escape were intimidating as well, when I went exploring one night. (Who wouldn't in such a place?) There's a glass door in front of a barred door that was as frightening as any haunted house I've gone through back home. I like haunted houses, actually, so the fact that the hotel seems relatively safe and quiet despite the scary atmosphere made for an entertaining night. A couple things, in relation to earlier reviews: the staff (who some have called clueless) were very helpful in all of the times I dealt with them. And the noise level (some people mentioned it was noisy) was not a problem at all. I didn't hear one other person at night. Perhaps this is a bigger concern during the summer when more tourists visit. It's a shame that the hotel doesn't allow posting photos of the rooms or gallery. I had an amazing time and would have loved to show everyone how brooding and cool this hotel is.", "Date": "October 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Unusual stay,very nice experience”", "Author": "dennistang", "ReviewID": "UR19392604", "Content": "We booked the glass house through the internet. Booking was straight forward through an email confirmation. The lady was very nice to wait up on us as our flight arrived quite late in the night and the journey into city took longer than expected. Did the usual 'oohs...ahhhs...' the moment we stepped in. Although the feeling subsided as quickly as it came :) The remote control to the soothing music was unique and interesting and really helped me to fall to sleep through the 2 nights! The see-thru toilet caused slight inconvenience if you are staying with someone other than your partner although the balcony did the trick easily of staying away when need be. Free wifi is available although you have to ask for the password from the staff. Staff were very helpful and helped us to navigate the city, pinpointing the key sights to visit for our 2 days. Would have been better if we had the chance to peep into the other rooms as well. It is located in a very nice quiet residential area with easy access to the metro and bus within a 5min walk. The S-bahn from airport is just 10min walk away as well. Some pics can be found on flickr - [-]", "Date": "August 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Colorado", "Title": "“Unique experience”", "Author": "greggoak", "ReviewID": "UR13847765", "Content": "I found out about this hotel in the Time Out Berlin guide, which recommended it as a quirky and unique experience. That it was! My partner and I stayed at the Arcotel Velvet for several days, and then traveled on to Moscow (the Velvet is very well located and certainly wins points for style - service was quite minimal). Our flight schedule required us to spend one more night in Berlin on our return journey from Moscow, so we decided to pick someplace a relatively close drive from the airport and more interesting than the usual room with bed, armoire, TV and mini-bar setup. We chose one of the more user-friendly rooms (the Temple room), although even in this one I think staying there more than a few nights would have become rather tedious. You can put up with awkward inconveniences in the name of art and adventure for a night or two (or three), but beyond that, I'd imagine being ready to move on. The staff was very friendly and very casual. It felt like we were guests in an artsy/hippie communal house. And the location is very quiet (not a busy street), but just a short walk to plenty of restaurants and cafes. Come here with no expectations other than to be surprised and you'll enjoy yourself.", "Date": "February 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Would definitely go back again”", "Author": "Leda74", "ReviewID": "UR13334761", "Content": "Having been told about Propeller Island via an e-mail forward, I decided to visit Berlin JUST to stay at the hotel, taking my father with me. We weren't disappointed. The hotel is, first of all, very conveniently located for the major sights of the city; it's an interesting walk straight down the Kurfürstendamm to the Berlin Zoo, or to the bus terminal which will take you further afield. The hotel itself is frankly eye-popping. As we were staying for more than four nights, the management offered us a change of room mid-stay. I started off in Forest (#45), which I chose because of its soothing red colour, and then moved to Hol(l)y-Wood (#14). My father had Clouds (#4) and then Landscapes (#32). We found the bathing/toilet facilities to be perfectly acceptable, although we had purposely chosen rooms with their own private facilities. (Incidentally, the shower taps in Forest are, for some reason, labelled backwards. The hot tap turns on the cold water, and vice versa. A little disconcerting, yes, but okay once you've worked out what to do!) The rooms could have been a little stuffy, although both of mine had their own private balconies and I had no issue with leaving the balcony door open for ventilation overnight. What can I say about the breakfast? It was superb. Soft-boiled eggs were offered and well-cooked, and everything else was delicious. The staff only work part time, but when they are there they put in a fine effort for the guests. In summary, I didn't find everything about this hotel to be top notch or up to the standards of the Dorchester, but then, I wasn't expecting to. I visited hoping for an unusual and lasting experience, something to tell my friends about, and this is exactly what I got.", "Date": "February 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“Great experince”", "Author": "Meltwaterfalls", "ReviewID": "UR11494251", "Content": "I really enjoyed my stay here, it was a very individual experience, and very reflective of the artistic trends in Berlin. We stayed in the Castle Room, which was very good, it was the first room designed in the Hotel. The Castle room and Cloud room are actually in a separate part of the building from the main part of the Hotel, they share a bath room and small kitchen dinning room so if there is a small group of you this may be a great opportunity to have a self contained unit. The bed was surprisingly comfortable, I thought that comfort may have been overlooked in favour of style, but this was not the case. The only entertainment in the room was a very high quality stereo and CDs created by the designer of the hotel, to be honest I liked this, I have had enough of sitting in Hotels and watching 24 hour business news, or attempting to decipher some of the local language TV, so it was nice to just be able to relax. The music may not be to everyone’s taste though, if you like Warp Records or similar stuff then perhaps you will be presently surprised. I did take photos of the rooms but they asked you not to reproduce them anywhere, and to be honest the photo's on the official website are much better than any of mine and are very accurate. We were also told that we can walk around the main Hotel and Gallery and have a look in the rooms if we wanted to see more, but we were a little pressed for time so didn't take this up. All in all a great Hotel and one of the best ways to experience Berlin's art scene.", "Date": "December 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "middlesex", "Title": "“Couldn't have picked a better place for my 40th Birthday”", "Author": "crazy60", "ReviewID": "UR7656367", "Content": "It was just FAB!!! Stumbled across it whilst searching the internet looking for something different and it certainly was!!! Booked three rooms for myself and 6 friends for my 40th Birthday only didn't tell them where!!! I couldn't have picked a better place, we all loved it!! Our rooms were great and we got to see about 10 of the others too!! Going to re-visit and take my two boys (12 and 15), they're going to love the coffin room!! Breakfast was good and the staff were lovely and VERY helpful. YOU MUST GO!!", "Date": "May 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Macclesfield, United Kingdom", "Title": "“We loved our friend/family-friendly apartment”", "Author": "Seonaidr", "ReviewID": "UR5884381", "Content": "I travelled with 3 friends and we stayed in the Castle and Cloud rooms. It was a self-contained apartment in a residential block behind the main lodge. This was better than anticipated and gave us our own area to hang-out in. We had no problems with noisy neighbours and unlike other reviewers, there was a functioning stereo in the Castle room with several of the lodges own ambient CD's. I was worried the Castle room may be too colourful but it was totally fab. Although it is a double room they provided us with 2 single duvets and it was comfortable and no problem sharing with a friend. The kitchenette was great for getting together whilst planning our days or disecting our nights. It has a fridge and a couple of small hobs so not for a gourmet feast but perfect for snacking. The bathroom was clean and modern and the shower was powerful. There were a few really nice restaurants and bakeries nearby. The second night we took a taxi to find somewhere more lively. The lodge is only a couple of minutes from the Ku'damm. The tour buses run along it but leave from the other end. It is a pleasant 15-20 minute walk (which would've taken us a lot longer if it wasn't Sunday and the shops were closed). I loved this place and would definately consider coming back. This apartment didn't have an overtly sexual undertone unlike some of the other rooms. It is in a peaceful and sedate area so the only drawback is if you want lively night-life on your doorstep.", "Date": "September 28, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "San Francisco, California", "Title": "“Really did not like this place”", "Author": "SFVoyager", "ReviewID": "UR5880767", "Content": "I stayed here during a time when there were NO other rooms to be found in Berlin, so i am grateful that they had a place for me. Also, the staff was very very friendly. BUT, i ended up in a single room (#38) which was exceedingly small, and had no shower in it. The shower was down two flights of stairs and through the lobby. There was a toilet, but if i had been just a few inches taller, my knees would have hit the opposite wall. The sheets didn't seem that clean, and the hallways had a slight but persistent smell to them due to lack of ventilation. The room looked out on an interior courtyard, so i had to keep the curtains closed all the time, and the light was not particularly strong. The room wasn't particularly \"creative\" - just cramped and tired-looking. I would have preferred a youth hostel, and for the price, i do not think it was good value, particularly compared to the Ku'damm 101 just around the corner.", "Date": "September 26, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "USA", "Title": "“Hand crafted for fun sex romps. A few function problems.”", "Author": "mothnm", "ReviewID": "UR5768627", "Content": "Propeller Island Each room is uniquely crafted around an aesthetic theme. “Wrapped” room 16 was shaped like a checkmark with a beer keg sink in the short arm and three beds on a ramp up the long arm. A fourth bed is tucked under the top bed with a pulley system to open the bed’s door. Like sleeping under the stairs. Two tall, thin windows side the sink and a barred window is by the middle bed. The windows look into treetops and vines. Each single bed has a metal shelf with a candle and reading light. The switch for each light operates with the main room light by the door, not independently, meaning you walk down the ramp to turn out your light. The wall paint is mottled wrapping paper with safety zone diagonal black and yellow tape going every which way. Overlapping corrugated panels cover the ceiling lighting. There are two yellow and black wall sconces. The custom audio system didn’t work in the room. The room was clean and smelled fine. Location was close to the front desk. Room doors are thin, heavy and close loudly. A key deposit is required. The rooms have no clocks or alarm clocks, nor does the desk supply one upon request. With the doors closed you can clearly hear tiptoe footsteps, people quietly having sex, outdoor noises and the previously mentioned loud doors. Perhaps this hotel isn’t intended for sleeping. The computer is in the stairwell on the way down to the gallery. Use it during the day since it is locked up at night. The breakfast room is large, bright, and attractive and has a two-chair porch. Meusli, cold cuts, cheeses, pumpernickel/pinon nut bread and some fruit are available. The hotel location is South of Adenauer Platz, a lively location off the Ku’damm. You can buy ordinary supplies or groceries nearby, plus expensive furniture and clothing. There are cafes, restaurants and theaters. Bus M29 and the U7 subway line are close. People walk around the area at night. The hotel is visually fun and creative but the audio aspects (noise, no \"included\" hotel music offerings, no alarm clock) and having to walk down the ramp to shut off the light would deter me from staying a second time, unless a travel companion really wanted to.", "Date": "September 4, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "3", "Service": "3", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Weird, fun, friendly and did I mention weird!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4326754", "Content": "This place is great. I wish every city had a hotel like this. My friend and I stayed in the room with the coffin beds. I have to say it was a nice, peaceful rest. The staff were very nice and the breakfast was excellent. I want to go back to Berlin just to stay in the other rooms. Someone needs to do a film set in this hotel. It's wonderfully too crazy!", "Date": "January 5, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Midlands", "Title": "“Brilliant!!!!”", "Author": "WillyWonka1", "ReviewID": "UR3759236", "Content": "What an experience, it was so much fun staying in a hotel like this one, it is so unusual and unique, you could just tell that the people who ran this place really looked after it well and took pride in this friendly ran themed hotel. My boyfriend and i stayed in the flyiong bed room which was great we loved it, he didn't like the fact that it did not have a tv but i wa not bothered as we were only staying one night and just the experience of staying in such a cool hotel was enogh for me!! Great hotel to vist there should be more of these hotel about. It was in a bit of a strange location bit but once on the main road your fine and iit's a nice walk down to the shops. I would stay there again in a different room, i justa want to pick this hotel up and place one in every captial!!!!", "Date": "August 13, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York", "Title": "“Amazing Experience!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3624653", "Content": "To my knowledge, you will not find another hotel like this one anywhere in Europe. All the rooms are totally different from one another, each having its own style and personality. As someone who travels often, I can not tell you how good it felt to stay in such a hotel. While the Propeller is not in the greatest location in Berlin, it is only one block away from a train station, and there are several nice places near by (a theatre, shops, etc). I highly recommend this hotel to anyone who wants something different, and doesn't mind spending 10 minutes on the train to get to CheckPoint Charlie. If you have any questions about the hotel, I'd be glad to try to answer them. JohnWilmot at gmail dot com.", "Date": "July 1, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Service": "2", "Rooms": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“A Unique Experience! Worth Trying it!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3280956", "Content": "We stayed at this unique art hotel for 3 days. A very original hotel, the most unusual room I have ever stayed in. It is worth experimenting and staying at this hotel. The room was comfortable, but I would recommend it mostly to young, non-conservative people. The hotel has a great web site, where you can choose the room that fits most you taste and expectations. We stayed at the Glass house. Gallery Room is also great. However, I was disappointed when I asked the staff to show me around to several rooms and they only showed me a couple of them, with the excuse that they were too busy. When you visit such an intriguing hotel you may want to have a quick look at other (unoccupied at the moment) rooms, especially if you intend to come back and stay at another room for a different experience. The location is excellent, underground train around the corner & next to Kdam, one of the most beautiful avenues of Berlin, full of boutiques, bars, places to eat, full of life.", "Date": "March 17, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Just for fun”", "Author": "AussieinSingapore", "ReviewID": "UR3005325", "Content": "We checked into this hotel with our 16 year old son. We had the 2 lions room which was truly amazing. The bathroom was beautiful with large mirrors and a bit excentric. the bedroom can be just a circus tent or maybe something a little more voyeuristic/exhibitionistic (just depends on your mind). Our sun had the floating bed room which was jsut perfect for a teenager but it didn't have a tv but was a lot of fun. The location is good with respect to the Kdam although it does look a bit dodgey if you apprach late a night. The breakfast room is also amazing. To me this was truly a berlin artistic night. we stayed a few nights in the radisson and did the \"wall\" history things and then went to this hotel to shop on the Kdam and go to a berlin Cabaret. I think the hotel is fun for the experience", "Date": "January 13, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "UK", "Title": "“Are they finished yet?”", "Author": "A TripAdvisor Member", "ReviewID": "UR852917", "Content": "Looking forward to our stay at the Propeller Island City Lodge. Excited by the fact, it was unusual and somewhere different to stay. Unfortunately it seemed as if our room still had to be finished off, with its bare breeze blocks and exposed pipe work. A scene which on this occassion was not appealling. So appalled we took photo's in dis-belief. Disappointing, as hotel concept could have been done to a high standard but was not. An expensive experience !!", "Date": "February 5, 2003"}], "HotelInfo": {"Name": "Propeller Island City Lodge", "HotelURL": "/ShowUserReviews-g187323-d234880-Reviews-Propeller_Island_City_Lodge-Berlin.html", "Price": "$75 - $180*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Albrecht-Achilles Str. 58</span>, <span class=\"locality\"><span property=\"v:postal-code\">10709</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "234880", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/16/e0/e9/mi-habitacion.jpg"}}