{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“BB Hotel Berlin”", "Author": "maryp990", "ReviewID": "UR123144744", "Content": "Nice enough hotel with comfortable rooms. However the staff were not friendly and the service was terrible. Bought meals included and waited one hour to be served dinner on two occasions. Food medicore also. Would not recommend", "Date": "January 16, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Malmo", "Title": "“Terrible location, questionable service, small room but good breakfast!”", "Author": "gridchic", "ReviewID": "UR73170195", "Content": "The Tourist Information office in Berlin booked this hotel for us - which is simply not acceptable that it was such a bad hotel, after asking for a recommendation. From the moment we walked in, things didn't feel \"right\". We were asked to pay cash upfront because the card machine was broken, the promised WiFi internet connection is \"still being installed\" and the so-called free off street parking turned into an 8 Euro per day park out the back of the hotel. The room was simple and very small. The bathroom was acceptable and clean (although to our horror, it had a RED heat light when you switch the light on!). The location of this hotel, whilst being only about a 15 min walk to the city centre, is across the road from a seedy looking car dealer and is in the gay bar district so we certainly didn't feel comfortable heading out after dark. The breakfast was the only good part of our stay here - they do offer a wide variety buffet breakfast.", "Date": "July 31, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "5", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Heathrowcountry", "Title": "“BB Hotel, Berlin = my bad experience”", "Author": "Heathrowcountry", "ReviewID": "UR62494961", "Content": "on my third visit to Berlin but my first stay at this hotel, a bad experience. It was a busy weekend and the hotel was full, I was put in a small room at the rear of the hotel: plug in basin would not open and close properly, shower head tied up with fabric tape to keep it in place, television kapput ariel missing, at 1800 hours on both days horrendous banging commenced demolition work like a wall was being taken down, for the morning of my departure the hotel staff had offered me coffee and a light breakfast, all I received was a surly response from the front desk that it was not possible. Having paid 300 euros for two nights stay i decided to complain in writing to the Management, to this very day I have received no acknowledgement whatsoever, I thought Berliners were nice people ?", "Date": "April 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Brazil", "Title": "“THE WORST HOTEL I HAVE EVER STAYED IN MY WHOLE LIFE”", "Author": "tewel", "ReviewID": "UR50388628", "Content": "Well, lets start from the beginnig: i had to wait almost 40 minutes until they find a room to me; there's no elevator in the floor, but between the floors, so you have to take your bags downstairs or upstairs depending on the floor you will stay; the room was the smallest room I have ever stayed and the bathroom was terrible, small like a little box; people dont speak English, so you have to try to speak in German; if you are lucky maybe you will find a woman that speaks English (depending on the time she works); sometimes one of the waiters who looks like Mr. Magoo (he only speaks German) works both at the reception and kitchen and eventough you explain in German that you dont speak German he continues speaking in German; I have not been informed that the Hotel could offer a diner so I arrived sometimes and everybody was having diner because the hotel offers a package including diner but nobody informed me about this; you dont have a key as a card, so you have to deliver the room's key when you go out (which is terrible because sometimes theres nobody at the reception to give your keys back). Well, the worst place, a nightmare. I have only stayed there for 2 nights, if I had to stay more in this hotel I would have searched for another hotel. After all this explanation I still have to say that its not cheap at all (81 euros per day!!!!) I would have paid twice or 3 times for another hotel. Tks god the others hotels in Europe I stayed were better than this terrible hotel.", "Date": "November 30, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "cardiff", "Title": "“ok for a cheap short break”", "Author": "rhyd78", "ReviewID": "UR36008041", "Content": "this is not a hilton or even anything close to luxury but it's clean and the staff relatively hospitable plus it wont cost you the earth. we did have one or two problems, no clean towels on the last day despite having asked for some, very little english spoken by the staff (not really a dig - maybe we should have a greater grasp of german but it just made life a bit more difficult) but there was a drink available at the bar anytime, 24 hours a day and never any real problems. bear in mind that the hotel is situated in one of berlin's gay-friendly areas but you're only a 10 minute walk away from the iconic kaiser wilhelm cathedral and the surrounding shopping area. all in all a good budget stay.", "Date": "July 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Apeldoorn", "Title": "“Friendly people and good service”", "Author": "traveler70Apeldoorn", "ReviewID": "UR22289040", "Content": "November 2008. We had booked another hotel but there were some problems so after some phonecalls we checked in at the BB hotel Berlin. The personel was very friendly and we've got a room directly. It was no problem that we were there very early (we left home, the Netherlands at 03.00 am so we were very tiered) In the morning they have a breakfast buffet with lots of different kind off food and in the evening the have diner. First you get a homemade soop, than diner and after that desert. It was realy tastefull. Our room was not so big, but it was clean and the bed's slept very well. The hotel was very close to the underground station and busses. We had a perfect stay in Berlin thanks to the personel of the BB Hotel.", "Date": "November 29, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Belfast, Northern Ireland", "Title": "“Great Gay Location - Poor Facilities”", "Author": "pup_pup_pup", "ReviewID": "UR8659657", "Content": "Hotel was okay - great location for Folsom Europe (on fuggerstrasse) - but the hotel facilites and hospitality are VERY BASIC. The general hotel was kept clean and tidy, there is no do not disturb signs in the hotel, or housekeepers who observe your wishes. The hotel isn't profecient in bookings - as they got ours mixed up! and the language barrier is an issue for non german tourists. The hotel however does offer some privacy and discression - providing you keep quiet, as walls are thin. I don't think I'd stay here again as it is overpriced for the facilities it provides, and the lack of services, and other hotels in the area seem more competitive when it comes to value for money.", "Date": "September 5, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "usa", "Title": "“Look elsewhere- There are better choices”", "Author": "rg142Usa", "ReviewID": "UR7154027", "Content": "Small rooms- dated and rather dirty- Beds are uncomfortable- old TVs with limited programs- Sparce bath with 1 hand and 1 small bath towel- Staff is rather cold and unfriendly- Limited english. Location , ok but not great. Would not stay here aagin.", "Date": "March 13, 2007"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Strasbourg, France", "Title": "“Decent place for a few nights”", "Author": "smartnik", "ReviewID": "UR3203879", "Content": "We stayed at the hotel BB (also known as Wenzel and BB Berlin - we could not figure out which was the correct name) for six days in February 2005. The hotel was basically okay, however, it obviously had some hospitality problems. Although we booked in advance, at first they placed us in a chillingly cold room on the second floor that had no double glazing and only one weak light bulb. Besides, the windows faced a rather busy Martin-Luther-Strasse. After some complaining, we obtained a transfer to an obviously renovated room on the first floor with PVC windows that faced the courtyard. This one was thoroughly enjoyable: spacious, with high ceilings, light and quiet. The breakfast was excellent: a good choice of salami, cheese and cornflakes. Finally, it has to be noted that the hotel is about 7-10 minutes away from the nearest metro station, but it is conveniently located in the midst of a gay neighbourhood and in proximity to a few nice Italian restaurants.", "Date": "February 17, 2005"}], "HotelInfo": {"Name": "BB Hotel", "HotelURL": "/ShowUserReviews-g187323-d234901-Reviews-BB_Hotel-Berlin.html", "Price": "$68 - $148*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Fuggerstrasse 13</span> | <span class=\"extended-address\">Sch&ouml;neberg</span>, <span class=\"locality\"><span property=\"v:postal-code\">10777</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "234901", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/43/bb/43bbde847d57db1bd37ef9f57703a9a81large.jpg"}}