{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "budapest", "Title": "“To stay in a nice(r) part of Berlin -with fairly good access to travel”", "Author": "handhungary", "ReviewID": "UR124532083", "Content": "We chose Hotel Benn as it has a good compromise in communication to both: Berlin Schönefeld airport and our daily target: Messe (Süd). Altstadt Spandau (nearly the only part of Berlin with \"atmosphere\") has 2 stations. One is called Altstadt (the U-Bahn station is 3 minutes walk from Hotel Benn) -and the station of Spandau (U-Bahn, S-Bahn and the railway stops here), which is 5-6 minutes walk from the hotel. There is not much difference (in time) to come from the airport between the different railways: more or less 1 hour. The hotel is nicely maintained: clean rooms and helpful personnel. the breakfests are really great. The prices (like everywhere in Berlin) are overpriced - particularly during any important Fair. The hotel has 2 blocks: one is a charming wing (looks to be a mediavel builiding from the outside) -the other just the opposite: an appartment building from the forties (or so). We had expereiences with the second one: like most so called hotels in Berlin: the flats are converted to small individual rooms and sold as hotel. (Not quite a real hotel, though). I had the chance to stay on the 3rd floor - a real climb (particularly with luggages) through the narrow and squaky staircase... First time I stayed in a room, where the shower-cabin was inside the room. (The WC was separate). But once you get use to it - it can be OK. I have not seen the other rooms of the hotel, they could have been different. All in one: ** and a half.", "Date": "February 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "castricum", "Title": "“Clean and friendly”", "Author": "truus z", "ReviewID": "UR119446158", "Content": "I stayed in hotel Benn for 3 nights with my daughter. De room was clean and the personal was very friendly. Public transport is realy nearby and welcome tickets are for sale in the hotel.The manager was very helpful for us, he did help us with finding the best route to our destanations in the city!", "Date": "October 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hoboken, New Jersey", "Title": "“Good location, very helpful personnel, great breakfast!”", "Author": "Baerkel", "ReviewID": "UR86974607", "Content": "My first room was on the top floor - no elevator... my luggage was brought down to a room on lower floor the next day! - The hosts are very helpful! I loved the breakfast buffet! - The hotel is in two different buildings, you'll have to cross the cobblestone street to go for breakfast if you're in the \"pale green\" building - I guess if you're so inclined you could jog for a few minutes before breakfast? - All in all I felt very comfortable, and I loved exploring Alt-Spandau. Even got to watch a wedding in the church nearby, on a perfect spring day! And an outdoor concert on the Marktplatz! - I'll go back to Hotel Benn anytime, and next time I'll bring my husband to show him around!", "Date": "November 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "santa ana, ca", "Title": "“We would stay here anytime”", "Author": "narek1", "ReviewID": "UR83588906", "Content": "This hotel is one of the friendliest hotels we have ever been in. Only having one day to explore Berlin we were hard pressed to see the top sights. The manager put together a cost effective wonderful plan using the local bus system that was fabuous. My sis and her husband had a very early before breakfast departure the following morning, 5:30am, and the manager had breakfast and coffee all prepared for them. This kind of service is rarely found. We would stay here ANYTIME and recommend this hotel to one and all!", "Date": "October 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nizhny Novgorod, Russia", "Title": "“Good value for money: nice and calm”", "Author": "GoesAroundTheWorld", "ReviewID": "UR73381637", "Content": "The hotel is located in Spandau area. It's near the subway (so it was good for us to get there). The hotel could be easy found by the foreign people. The room that we had was small but good and clean. It had not separated bathroom, but the shower was in the room. I like the breakfast that we had there. There were plenty of eat and everything was tasty. However the hotel doesn't have moder design, but nevertheless it has good look. It is a good deal for its money. So if I need to stay in Berlin in Spandau, perhaps I would choose this hotel again.", "Date": "August 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Berlin", "Title": "“Just the one from the set of others”", "Author": "Sergey_xxx", "ReviewID": "UR73354310", "Content": "We've stayed here only one night. It was on 1 January :) The hotel is far from the Berlin centre: it's situated Berlin's Spandau district. But it is very accessible via public transport: for example, altstadt spandau u-bahn is only a 5-minute walk away. I can't say that room was perfect, because it was just 3 star hotel. For one night - it was enough. There wasn't separately bathroom, the shower was in the room. The breakfast was good, but nothing special. In conclusion: it's usual 3 star hotel. But I am sure that I would not stay here again.", "Date": "August 2, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Harrison Township, Michigan", "Title": "“Comfortable”", "Author": "ckow85", "ReviewID": "UR64442202", "Content": "The owner was very pleasant and helpful and breakfast was always very good. The rooms were comfortable and fairly large compared with other hotels we had looked into staying at in the same price range and I loved staying in Spandau - it was very quiet compared with the rest of the city but close to all methods of transportation.", "Date": "May 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cincinnati", "Title": "“A comfortable family owned samll hotel”", "Author": "Gungadin", "ReviewID": "UR5926801", "Content": "My German sister in law booked this small, inexpensive hotel and I highly reccomend it for those on a budget. It was spotlessly clean and comfortable and about 60 euros a night for one. The breakfast had everything you could want . It was around the corner from the subway. It is a bit of a ride to downtown Berlin, but the town itself has much to reccomend it--not the least a small restaurant Behind the more famous Kolk ( about a half block, white with brown timber on the outside) that served the best duck I ever remember eating , for about 15 euros .", "Date": "October 8, 2006"}], "HotelInfo": {"Name": "Hotel Benn", "HotelURL": "/ShowUserReviews-g187323-d234927-Reviews-Hotel_Benn-Berlin.html", "Price": "$68 - $127*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Ritterstrasse 1a</span> | <span class=\"extended-address\">Spandau</span>, <span class=\"locality\"><span property=\"v:postal-code\">13597</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "234927", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/96/66/9666972fb761ad64d554cb6044ea421f1large.jpg"}}