{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Indianapolis", "Title": "“Westgate Towers”", "Author": "Anthony P", "ReviewID": "UR128178236", "Content": "Units are spacious, however furnishings and Tv's are very out dated. This resort was probably considered very nice in the 80's- early 90's but is major need of updating. I consider the room cleanliness to be surface clean as there were wrappers, and crumbs under the furniture. The staff had little interest during check in once I explained that I was NOT interested in another timeshare preview. Another staff member was rather rude when we were walking about the grounds to view some of the resort offerings. This resort is diffidently not a 5 Starr or Gold Crown by any means. The only positive to this resort is it is located close to all the Orlando parks and close to many restaurants.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Panama City, Panama", "Title": "“Menia”", "Author": "Menia K", "ReviewID": "UR127525701", "Content": "the hotel has excellent customer service, location is great, the rooms are comfortable and very clean.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Enjoyed our stay at the Towers!”", "Author": "Shannon2m2", "ReviewID": "UR127297492", "Content": "My family of four recently stayed at the Towers for 4-nights in a one bedroom. After reading the reivews we were a bit skeptical; however, in our opinion, the property and room were just fine. The location was great; close to a variety of retaurants, shopping and the interstate. The front desk staff was friendly and helpful. The room was just like an apartment. I've heard that the property is going through a renovation where some rooms are updated with new decor. I had requested to be in an updated room when making the reservation, but was told at check-in that the owners had first grabs at those rooms. We are not owners, so we were not in an updated room. However, the room was clean and worked out fine. The photos on the website do give a good idea of the room you'll get. Typically, my family vacations in a \"regular hotel room\" with two beds as we never plan to spend much time in our room. This time we wanted to chill out more and that required more space. We got it! It was nice to have a full kitchen, washer and dryer, jacuzzi, two bathrooms and a screened porch. We were on the first floor close to the pool and it was fine, not as noisy as I had expected and especially during Spring Break. The pools and property were nice and clean. Also, we had access to parts of the other properties, The Villas, and we visited the ice cream parlor and Bar Grille to watch the Final Four ;). The Villas is larger property and had LOTS of guests, much busier than the Towers. The only con we would had was the sofabed. It was not comfortable. Again, we enjoyed our stay and plan to return to the Towers in the future!", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chichester, West Sussex", "Title": "“First Time, didn't know what to expect but BRILLANT!”", "Author": "Lastminuteone", "ReviewID": "UR127232326", "Content": "We were very kindly offered to use this accomodation by a UK owner, so apart from the photos we had viewed on line we didn't know what to expect - We weren't disappointed (and I only usually stay at 5* accomodation); the accomodation was exceptionally clean and tidy, spacious although perhaps the decor was overall a little outdated, that however, wasn't any problem at all. Couldn't fault the staff, who were always attentive, offering exceptional service (we just didn't have Jason experiences at all - see other review). Service was always prompt, polite (although I will agree there was 1 member of the Guest Services Team, an older lady, who was appeared a little clueless, but she got there in the end bless her - we just make sure we always spoke to Miguael during his shift as he was brillant). Couldn't fault any of the services or accommodation! Would definately stay there again. Miguael (hope thats how you spell it), was simply the best, he went out of his way to help us if we needed any assistance, he'd been employed by Westgate for many years and his experience showed. Power to you Miguael! We went mid season (1st to 17th March 2012), so the complex we stayed in was very quiet, the bonus being we had the pool to ourseleves most of the holiday. Check out the fab hot tub!! Best one I've been in. It got a bit busier the second week of our holiday, we're told due to Canadian Spring Break. We didn't really use the facilities on offer at the main part of the resort, but took a stroll over there (bit of a walk in hot weather - but us brits like to walk). Took the 'swan' out on the lake but the amercians do like you to sign your life away first don't they, couldn't believe the huge disclaimer we had to sign before we even stepped near the lake! Never got round to trying the Spa. We only realised at the end of the holiday that the reservation staff had booked us into the wrong Resort location (we should have been at Westgate Lakes), but not knowing the area or Resort locations in detail we weren't to know (booking by phone from the UK). I'd been told to ask for 'the tower' overlooking the lake so we could view Disney Fireworks at night. This was mistaken for Westgate Towers, rather than the towers at Westgate Lakes! We only found out by accident as we shared a taxi back from one of the Parks and the people were staying at Westgate Lakes. Seeing the huge Lake and the view it offered everything clicked into place about watching fireworks over the lake at night from our balcony. Never mind, both were great locations though, so it wasn't a problem, only in that we could see just the tip of the fireworks over the neon signs! It just means if we go back again we know what location to ask for. Shuttle buses allowed us to get back and forth to the Parks (only 15 mins from Epcot & then picked up the Disney buses to get from park to park - they run every 20mins to the different Disney locations). There were only two shuttles from Westgate each way to Disney, one at 9am & one at 12 noon, returning at 6.15pm and 9.30pm. (don't forget to book your seat in advance - as we planned what we were doing each day roughly this wasn't an issue). It meant however, you were either out all day or half a day, so little flexibility - either have an early breakfast or skip breakfast if you wanted a swim or to sleep in a little! It also meant a bit of a run if you stayed to watch the fireworks at Epcot as they finished about 9.20 and the bus left at 9.30pm (and the bus was always prompt so you couldn't be late). Perhaps a slighlty later bus, say 9.45pm would have least meant you could have strolled back to catch the bus rather than the marathon sprint (but it was fun!)! A car for at least some of the holiday would have been appropriate (prices hiked up due to sping break, and as there were 6 of us car hire was expensive), but we managed to get around and do everything we planned using the shuttles to both Disney and Universal (only 1 bus each way to Universal, 9.45am, with return at 8.30pm.) When shopping we used the Universal bus and then a taxi to get to both Millenia and Premium Outlets (watch out for the Taxi's, some of them are unroad-worthy, go for Yellow Mears ones, so take a phone so you can ring for one if you need more than 5 seats!). Again, a car would have been preferable for shopping just so you had flexibility in timing - you could shop at least a day in each and still go back for more!!!. The local supermarkets were expensive, only serving the tourists I suppose, but we ate out all the time (on holiday, who wants to cook!). Can definately recommend the Sizzler restaurant next door to the resort, all you can eat ($4.99 for breakfast and from $10.99 for evening meal - great value, and the foods not bad either, but it gets busy so be prepared to que a little!). We never quite got housekeeping schedule (for clean towels/cleaning the room), but we just asked the staff who were in the corridor and they always obliged, even though there was a bit of a language barrier. We could of called Guest Services to arrange, but never found any problem getting from the staff who were manning the housekeeping cart. Oh, and just one more thing - being Brits we loved our tea and there was no kettle, never thought to ask for one either as we just used a saucepan to boil water, but a kettle would have been easier in hindsight. Make sure you take your own Tea Bags for your morning cuppa, bought some over there from the local supermarket - expensive and not a patch on Typhoo or Tetley! All in all I can't fault Westgate Towers, clean, comfortable, spacious accomodation, with friendly, helpful and efficient service, real value for money!!", "Date": "April 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Awesome 1 Bedroom”", "Author": "martin18042", "ReviewID": "UR126563420", "Content": "Great price and location. There were a Lot of pros but the cons would be sofa bed was the most uncomfortable things I've ever laid on. The kitchen was a tad bit outdated but was not a serious issue. I stayed in an one bedroom condo with an awesome master bath and would absolutely stay here again.", "Date": "March 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Super experience, very affordable”", "Author": "PippaBlue", "ReviewID": "UR126462530", "Content": "This was a real find for our no-frills budget. The property had everything we needed, staff was extremely kind and helpful and left us to ourselves unless we asked for help. Rooms look *exactly* like the photos on the website--super nice! Skip the gameroom and bring your own DVDs (selection is poor at this location).", "Date": "March 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Niagara Falls, Ontario", "Title": "“Good Value”", "Author": "Romyn-Michaud", "ReviewID": "UR126181482", "Content": "Pros - central location - a couple of pools; good pool hours - very comfortable beds, lots of pillows available in rooms - kitchens are spacious and well stocked - big bathrooms with spacious showers - friendly staff who are not pushy about the time share - they offer a free breakfast if your whole family attends the tour - very close to highway - close to all parks an other attractions Cons - wifi is not free and you can only buy it for one device - pool hours run late (good if you're swimming) but noisy if you're trying to sleep - blinds in the room are not good; they do not block out sun very well and you wake up with the sun - no supervision at all at the pools and not all parents supervise their children so sometimes the pool is quite wild with screaming, running kids", "Date": "March 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Cary, North Carolina, United States", "Title": "“Westgate Issues”", "Author": "Dee G", "ReviewID": "UR126133624", "Content": "We traded for Westgate Towers through Interval last week. This was our first trade for a Westgate property, and I will not do it again. Unfortunately, they put us in an older villa, but our resort is a Premier resort. Clearly, the trade was far from equal, as our resort is really nice. We have always been put in a nice, newer villa when trading, but they chose not to give us adequate accomodations. We were okay for the first evening, but then realized that our patio was indeed 12 inches (no patio). No ability to sit outside & enjoy the nice weather. I just thought all their villas had this option. Would have asked them to move us, but we were already fully unpacked with a busy day ahead. I later discovered that there were newly renovated villas on property that were clearly not being used. We were there during a slower week. The kitchen was old with a microwave that could not cook evenly (so old it had no carousel), the dryer stopped working in the middle of our laundry, and the power, lights, & A/C went out for no apparent reason one afternoon. We went for their timeshare presentation to see what they had to offer & the representative was surprised to see that we were not put in a nicer villa. This made me even more angry. This would NOT have happened at a Marriott property! Then, they tried to get us to sign a form saying we could not trade in the Orlando area for the next 5 years...really? That was the biggest untruth ever & was very disappointed that they would scam people into believing that just to but a timeshare from them & secure a guaranteed place to stay. We have done timeshare for many years & this experience was disappointingly an all-time low. The only good thing I could say was that the staff at the Towers was always very friendly & accomodating. Overall, they only treat their owners well apparently. If this was your way of making us want to become owners, it was an epic fail. I came home feeling tired, because it was hard to sleep. Lots of outside noise...the villas is quieter, but the Towers is in a restaurant parking lot, adjacent to another hotel.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Orange Park, Florida", "Title": "“Horrible Customer Service!!!”", "Author": "Libby N", "ReviewID": "UR125993992", "Content": "Room was very clean and staff was friendly at check-in. That evening, we noticed air was NOT working (over 78 degrees all night). Called the front desk several times, but no one answered. Called the main Westgate number only to be redirected and then disconnected. Advised staff upon check out and they seemed to not care. This alone should have been addressed. There was another large issue which I spoke w/the assistant manager about later that day (possible compromise my of account info by staff). They eventually comped 1/2 of the room rate for the night - not enough. This was the worst customer service experience ever! Issue could have been easily resolved. Very disappointed. :(", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "cottondale fl", "Title": "“kudos to Westgate Towers”", "Author": "spittmanh", "ReviewID": "UR125644012", "Content": "We were down for our annual vacation during the All star weekend. We enjoyed our stay and were very pleased over our accommodations and the outstanding service we received. We stayed on the 6th floor. It was a beautiful experience. Every need was met with little effort. Special shout out goes to Travis in security and YADHIRA at the front desk. We were greeted soon as we entered the premises, which is a great first impression. Thank you so much for a memorable experience and we will be returning next year.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Stittsville", "Title": "“Don't stay in Complex \"B\"”", "Author": "Chris F", "ReviewID": "UR125366598", "Content": "If you go to the towers, make sure you request and get confirmation you are in a newer villa or an updated room. I got stuck in complex B with a shower that had no drip edge and the water ran away from the drain. Guess what, yes my shoes and cloths got soaked. When I told the front desk about it, they knew of the problem and told me to roll up towels to act as a barrier, then ring them out after I was done in the shower. There were no other rooms to go available and basically left me with the impression it was my fault. If I was there for longer than 2 nights, I would have demanded my money back and found another hotel.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Evanston, Illinois", "Title": "“Outstanding experience; excellent accommodations”", "Author": "Bruce B", "ReviewID": "UR124410902", "Content": "We did an Interval International last minute timeshare trade into Westgate Towers and are pleased to report an excellent experience. Our one-bedroom, two-bath unit was exactly as depicted on the Westgate website - immaculately clean, excellent linens, refreshing decor, lots of storage space. The huge shower had a trickle of water from the showerhead - called maintenance and they replaced the showerhead within ten minutes. Wow! A truly distinguishinng factor at Westgate Towers is that every staff member is genuinely friendly and helpful. Our stay in February 2012 proved to be very quiet, although I do recommend a sound mask if you are on the side that faces US 192. The surrounding neighborhood is typical strip mall USA, but its filled with plenty of restaurants. If you are looking for a convenient, well-managed place to stay as you explore WDW and Central Florida, this is an excellent choice.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "nj", "Title": "“Great stay....”", "Author": "misty99nj", "ReviewID": "UR123439273", "Content": "Me, Hubby and 10yr old son went for a quick getaway from 01/15 to 01/18(way to short) and stayed at Westgate Towers. From the time we checked in to the time we left all staff we encountered were wonderful. Our room was spacious and perfect for us, we had a 1 bedroom on the second floor. We spent quite a bit of time at the Villas for lunch, breakfast and of course the gameroom. We rented from owners and were treated like owners....now we want to become owners...Westgate treats their owners well with little things like free breakfast on certain mornings or free lunch bbq...with cute games for whoever wants to join. We were never hassled for a timeshare tour...although if we had more time we would have like to take the tour...hopefully our next trip will be longer!", "Date": "January 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Glens Falls, New York", "Title": "“Okay stay...”", "Author": "kelisa323", "ReviewID": "UR123185972", "Content": "I stayed here in April and it was a great unit overall. It was our first time trading our timeshare and it worked out pretty good. I think the unit was very large as it had 2 bedrooms, 3 bathrooms, living area and a kitchen. It was not too far from Disney and they provided a shuttle service which saved on driving and parking fees. It was pretty close to alot of shopping and other activies as well. I do think that the area is very commercialized, but this was my first visit to Orlando and havent stayed at any other resort/hotel. We had a few issues with our bathroom and had to ask for maintenance several times. It was never fixed, but we didn't really need that bathroom anyway so it was fine. When mentioned at check out, she said that we should have told them this issue wasn't fixed and was kinda \"snobby\" about it. Other than that pool was great and amenties we never had a chance to use due to our full itinerary. I would stay with Westgate properties again, maybe not this specific one. It wasn't terrible, but it definately wasn't what we expected as a resort.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Very upset with stay”", "Author": "deseree g", "ReviewID": "UR122476151", "Content": "I booked our Christmas vacation 12/22-12/27 with Westgate TownCenter, then received a call from the rep to tell us to have a washer and dryer we can be moved to Westgate Towers, which was newly renovated and on property. Upon arrival we discovered the Towers is only a renovated hotel with the stinch of a motel. I could have stayed at Caribe Royale which is nicer( just farther away from Disney) like I did the year before. The location is great for a Disney trip because its less than 5 minutes away from all parks. The sheets on the bed was too little and they did not fit on the matress. I would have I was not accustomed to this type of stay and told the reps on the tour they should have had us to stay in the best of the best instead of the hotel since they were going to pressure of into buying the time share. Needless to say our tour started at 7:45am and they held us captive until I told them Im walking away at 11:45am. We also had purchased a vip card for the children to do fun activities on the property, but, did not use it because it was not in walking distance and a 3 mile drive to the main property. When I requested a newer room in the newer facility I was told they would get back with me and never did. Just remember to alway ask for the newer built buildings when booking and not the newly renovated resort. Last thing I must say is there is a big difference between a villa and a hotel.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“It Was as close to Perfect as you can get”", "Author": "247HardWorker", "ReviewID": "UR122467419", "Content": "Overall the experience at Westgate Towers was great. Lots to do in the area so we were hardly in the hotel room. The room was spacious and being on the ground floor we could walk right out to 1 of the 3 pools. It was truly a wonderful time. The staff will do whatever they can to make sure you have an awesome vacation. I cant wait to go back.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "CAPE CORAL FL", "Title": "“FOR THE UNHURRIED”", "Author": "ANDYINDACAPE", "ReviewID": "UR120838532", "Content": "FOR LIFE IN THE LESS HURRIED LANE, This place was perfect. We traded our 1 week Marriott Lake Tahoe timeshare so other family members could use same at Westwood Kissimmee while we stayed 2 days at Westwood Towers Kissimmiee. The rooms were spotless. I believe they use the Westwood towers to attract potential timehare owners. They did push a little bit but all you have to say is \"NO\"..For us it was perfect, I would do it again.", "Date": "November 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tamarac, Florida", "Title": "“We loved it and we will be back”", "Author": "Yvonne B", "ReviewID": "UR117827628", "Content": "Overall the experience at Westgate Towers was great. From the moment we entered the Guest Service area, the Tour desk unpon departure. They gave detailed concise direction, my fiance had some issues with his phone & we had to go visit a Sprint store near by, even when we were on the road they were able to assist us.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "Beacon Falls, Connecticut", "Title": "“Convenient location.”", "Author": "lyndeedesigns", "ReviewID": "UR117321427", "Content": "Used our timeshare as a trade. Westgate Towers are just across the road from all of the Disney parks. Easy to get to (about 3 minutes) but somehow we always had a tough time getting back in the dark as the signs is Disney were not very clear. Thank goodness for GPS on my phone! We had a two bedroom unit which as stated in several reviews it is basically an efficiency unit (sleeps 4) connected to a one bedroom (sleeps 4) with a full kitchen. We had plenty of sleeping room and three full baths. I am glad I had read other reviews about the efficiency units as we would not have been happy with it had we traded for one. The unit itself is small and the single door that connects to the two units does not keep out noise, so you have the feeling of being with the people in the larger unit. The shower door in the smaller unit was pretty moldy but it really didn't bother us since we really never used the efficiency unit. Besides the shower door both units were very clean. The larger unit had a washer and dryer while the efficiency unit does not have laundry facilities. The furniture and decor is very dated (1980's) and it appears that some of the units are being redecorated. The decor did not bother us at all. The units together were very large and had all the set ups you needed. We also had two large balconies overlooking a pool. We never made use of the balconies or the pool and we also weren't around very much so if it the pool was noisy it didn't effect us. The staff was very pleasant and helpful. This property is part of the Westgate Villas right down the road and there looks like there is a lot of activity going on there. If we were with small children the villas seemed to be a better choice, but for us the towers were perfect. There is maid service midweek and you can get extra towels from housekeeping at any time. We would stay here again on a trip back to Disney. Shopping - Publix, Target, Walgreen's, restaurants were all within a few blocks of the condo. If you don't have a car, you could still walk to some shops and restaurants. While the towers did have limited service to Disney, the hours didn't seem very convenient for our needs.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Ft. Mitchell, Ky", "Title": "“HUGE Room, great time had by all.”", "Author": "aleigh333", "ReviewID": "UR116321902", "Content": "We recently went on a trip with our four and two year olds so we could take them to Disney World. We stayed in a two bedroom condo (which is basically a one bedroom and a efficiancy room opened up together.) We were on the ground level directly outside the pool. The pool area was very quiet while we were there, with the exception of some cheerful \"musak.\" Our rooms were so incredibly big, we could not believe how spacious our rooms were. We had three bathrooms, all were nice and clean, two large jetted tubs, which the kids LOVED. The decor was a bit dated, but very clean and for with size of the condo, we certainly did not mind. The kids had so much fun running around the rooms (especially since we experienced some bad weather during our visit.) The pool areas were nothing spectacular for little kids (meaning no slides, waterfalls, etc.), but they were clean and large. We were there to see the beach and Mickey Mouse anyway, and we knew what to expect ahead of time. Apparently there were additional pools nearby on another sister property, but we never had the chance to check them out. There was also a little outdoor playground right outside the hallway door which the kids loved. We had one issue upon arrival (the inner door to the additional bedroom was locked) but a handy man was there in minutes to fix it for us, we were very impressed. The beds were large and comfortable, and the kitchen well-stocked. There was a bit of hassle at the front desk upon check in to get you to do the time share thing, but we had no interest and tld them so and they left us alone after that. Otherwise check-in was pretty quick and easy. We liked our room so much, that when we decided to extend our trip by a few days because it had rained so much of our trip, and we had stuff we still wanted to do, my husband offered to book us at the newer nickelodeon hotel for the extra days thinking the kids would enjoy the water features there, but not one of us wanted to leave the westgate towers, and we got such a great deal on the extra nights that we got to go to Animal Kingdom :)", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Exceptional in all areas!! Loved it!!!”", "Author": "MelissaJ63", "ReviewID": "UR114650126", "Content": "My spouse and 2 small children stayed in a 1 bedroom suite. We made breakfast and lunch in our kitchen each day and had dinners out. The suite was very clean and roomy. We loved the jet spa tub as well. The 3 large pools were pristine every day and also quiet. There was usually about 1-3 families at the pool at any given time. If you like a more active pool scene with pool bars, be sure to visit the sister property at Westgate Vacation Villas, a short walk away. The whole time we were there we were never once approached by any timeshare people. We didn't even see any as other reviews indicated. We enjoyed the private balcony which was screened in which was a great safety feature for our little ones. Our only complaint was that the shower was barely luke warm. It didn't get hot enough for us. Keep in mind that you do not get daily sheet changing or room cleaning so you maintain the suite upkeep on your own during your stay. This was not a problem at all for us. You do get towel service quickly when needed. Overall this hotel was clean and quiet. If you want more activities, scenery, and people then definitely visit the Vacation villas next door which have everything like mini golf, theatre for kid's movies, etc. We would love to stay here again!", "Date": "June 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Show Low", "Title": "“Unplug the Phone!”", "Author": "ShowLowBecky", "ReviewID": "UR112509308", "Content": "The only people calling on the room phones are sales people trying to line you up for a breakfast timeshare presentation. They are relentless, and call at ridiculous early morning hours, apparently forgetting travelers come from different time zones. Skip the breakfast; it was substandard and crowded. The best thing about the 2 bedroom unit was the 3 full bathrooms with showers, allowing anyone sleeping on the hide-a-bed to have their own bath. You'll want to pick up a package of real toilet paper, sugar, and salt and pepper before you arrive. The kitchen was a nice size and had full size appliances. The kitchen utensils were cheap, wobbly stuff and inefficient. No cookie sheets, pizza pans, or other basics. No free Wi-Fi, which should be routine in EVERY hotel. The housekeeping staff was helpful. The elevators worked well. The parking was free and easy to use. The pools are a nice size and well maintained. Overall, an okay place to use as a base for other activities; it was close to Disney. The place is nothing fancy and definitely not a destination resort.", "Date": "June 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Greensboro, North Carolina", "Title": "“Westgate Towers(Hotel) is definetely more like a hotel suite than other Westgate properties.”", "Author": "KayKoo4965", "ReviewID": "UR110644626", "Content": "Checked in early AM and was greeted by a an associate at the front desk who was fully awake at the late hour,pleasant seemed to enjoy his job! Got a key to my room(S)which was to include a lock-off unit. The door connecting the main to the smaller lock -off was still locked. Security came by quickly to unlock it for me in a short order. He did happen to mention that it should have been done already but for me I would rather enter a room that had the door still locked than one 'accidentally' unlocked. The Beds were very soft which I liked but others in the party disliked. The sleeper sofa didn't evoke the usual 'there's a bar in the middle of my back' complaint by those sleeping on it which was unusual for a sleeper sofa. The main and lock off units were exceptionally clean with plenty of supplies. The units appeared to have been recently upgraded with new appliances of all sorts. There didn't seem to be many people staying here at all and I only saw a few people during my stay. The one pool out of two that was open wasn't very large but cooled the kids off. The grounds and buildings appeared to be well maintained. Upon entering the hall by the elevator after entering from outside there was the strong smell of something(curry?), probably left over from cooking in the rooms. Which besides not really having a view out the windows and off the decks is my only 'real' complaint. The lack of a view made it seem more like a hotel.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin Ireland", "Title": "“Had a great time”", "Author": "lizzie4916", "ReviewID": "UR108387457", "Content": "We stayed here for the first time for 2 weeks having purchased a weeks timeshare in a 2 bed/3bath apartment in 2010. Apart from trying to sell us another timeshare or move over to Westgate Vacation Villas ( which were half the size of the apartment we had ) we had a great time. We had some problems with the toilets but they were sorted out immediatly. We found it to be very quiet & very relaxing. Most times we had the swimming pool to ourselves & the sunbeds were always available if we wanted one. At 9 o'clock every evening there was the firework display from Epcot which we had a free view of. We hired a car at the airport but there are shops & restaurants within easy walking distance, there is also a free shuttle bus to Disney every day. The kitchen was very well equiped with dishwasher, washing machine & dryer, large american fridge & large cooker, I especially loved the waste disposal unit in the sink. We also had a sink, microwave & fridge in the second bedroom. We bought a 4 day Disney pass from Westgate which included a water park at a discount rate & being owners we & our guests could use all the amenities on Westgate Vacation Villas for free. We did a sunrise balloon ride with Orlando Balloon Rides which was a once in a lifetime experience. Had been to Disney before & also Universal, but we like disney the best. Just turn right out of Westgate Towers & a few miles driving you will come to Maingate Flea Market, It is all indoors & air conditioned & has lots of bargains. We are only going to Westgate every 2 years for 2 weeks as the air fares are so expensive but we are already looking forward to 2013.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Windsor, Canada", "Title": "“Awesome stay!”", "Author": "Reco69", "ReviewID": "UR101563178", "Content": "Front desk staff were very friendly and knowledgeable, as well as the pool staff. Had a few minor issues with coffee maker, was switched with 1/2 hour. Location is great, found the resort quieter than other Westgate resorts, but loved it with small children. Will definitely stay here again, and strongly recommend this resort.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Windham, Maine", "Title": "“Haven't showed up yet but we love it already:)”", "Author": "Jonnay30", "ReviewID": "UR100133204", "Content": "We are long time lovers of our every year Florida trip, We are leaving in two day to check into our west gate towers suite, In the past years we have always stayed at the likki tikki Village resort and we have always been completely satisfied. This year we decided to switch things up and change resorts, When we call the central reservations office they were so friendly in helping us reserve our stay, We are anxious to arrive and are already sure our stay with westgate towers will be amazing, Thank you to all the staff for your hard work, see you soon", "Date": "March 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brunswick, Ohio", "Title": "“Fabulous Customer Service”", "Author": "queenlisa84", "ReviewID": "UR99591338", "Content": "This resort, although somewhat dated, was wonderful! The staff were all very friendly and helpful, even though we arrived late in the evening (after 11 pm). After being in the car for 14 hours, all the way from Lexington, KY, it was great to check in very quickly and have someone help us with all our luggage. Several of the rooms were obviously being renovated from the 1970's mirrored wall style, although our suite had not been done yet. Despite the dated decor, our suite was roomy, comfortable, and very clean.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Palm Beach Gardens, Florida", "Title": "“Great Stay-Can't wait to go back!!!”", "Author": "TheEtterFamily", "ReviewID": "UR99527626", "Content": "We traveled to Orlando to take our daughter to Disney and stayed at the Westgate Towers. It was great because it had a full kitchen (perfect when you have little ones) and was minutes from EVERYTHING!!!! Loved everything about our choice in hotels! We will be back every year!", "Date": "March 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Delaware, Ohio", "Title": "“We liked it so well, we stayed an additional week.”", "Author": "Khudd", "ReviewID": "UR96196555", "Content": "If you're looking to be on top of the \"touristy\" part of the area, this might not be your resort. However, if you want to have a nice, quiet stay, while being within a few miles of the action, this is an excellent choice! It was not a busy time, and we enjoyed the relative solitude. The room was clean, well-furnished and everything worked as it should. The king bed had an extremely comfortable mattress, and the linens were first rate, with the only exception being the pool towels. They were small and rough. The kitchen was well-equipped and all appliances worked well. The over-under washer and dryer in the room was very convenient. Having two full bathrooms was a definite plus. The pool was very nicely heated. Any and all staff, from front desk to housekeeping to maintenance and security staff were extremely friendly, pleasant and helpful. At least one floor was being renovated while we were there, showing that they are working to keep the rooms in excellent shape, and the only negative we can give this facility is that the work tied up the elevator in our end of the building during the day. Another elevator was available at the other end of the hall, so with some extra steps we were able to get where we needed to go. Another nice feature of this facility is a huge paved parking lot diagonally across a side street where you may park boats, trailers or motorhomes during your stay.", "Date": "February 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Englewood, Florida", "Title": "“Very happy with unit/apt.”", "Author": "Surfside2270", "ReviewID": "UR95372517", "Content": "Went to Westgate Villas / Town Center by mistake when arriving and when I realized we were staying at Westgate Towers, was hoping for a good place to stay with family members. Lobby is a little hard to find, but once you do the experience is great! People at multiple desks were great to work with and the two bedroom unit was very clean and comfortable. Extra bathroom was great to have. Kitchen was well equipped for cooking breakfasts. Pool area is just beautiful. Most happy about how clean the unit/apt. and entire building and grounds were.", "Date": "February 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "5", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Naples, Florida", "Title": "“Huge disapointment”", "Author": "Alepe1", "ReviewID": "UR91957169", "Content": "This is really not was we were expecting. It had bee recommeded to us y some friends but we did not ejoy it at all. It is a small hotel and the only thing to do is go swimming. They have two pools. The unit that we stayed in was spacious, but not very clean. we had to have housekeeping up about three times in order to get it right.", "Date": "January 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Tampa, Florida", "Title": "“Old hotel advertised as condo”", "Author": "Roddy66", "ReviewID": "UR89693819", "Content": "I wanted a reasonable alternative to a hotel that had a little extra living space to relax. This room was listed as a condo studio. As it turned out it was a clean but older hotel room, it did a have a fridge/microwave, but we ended up sitting on the beds since there was really no other furniture. To make matters worse they wanted $10/day for internet, I don't think so. I was able to log onto another provider free from my room. Basically I paid $70 for a $40 room. Staff also tried to mention the timeshare offer which I quickly declined. I can't imagine intentionally paying to stay in this place as a time share (The studio anyway), very close to many restaurants and Disney.", "Date": "December 12, 2010"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "3.0", "Location": "5", "Value": "5"}, "AuthorLocation": "Cooper City, Florida", "Title": "“Comfy Stay: Watch out for Timeshare Sharks!”", "Author": "Billie S", "ReviewID": "UR74077264", "Content": "The 3 flat screen TV's, 2 full kitchens, 2 roman tubs, 2 patios and separate rooms where quite lovely, It was comfortable for the entire family. However house keeping never stopped by the 7 days we were there and we were held prisoner at the \"Timeshare Breakfast\" the \"Manager\" was pushy and won't take no for an answer! Be prepared to stay wake every night from the noise at the pool until 11pm. They allowed vendors to slip flyers under your door every night which was annoying. On a positive note we slept comfortable every night, after the furniture stopped moving from the guests upstairs EVERY NIGHT until 1am.", "Date": "August 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pollock Pines", "Title": "“If you don't buy,you loose”", "Author": "deborah31333", "ReviewID": "UR68835178", "Content": "Don't get me wrong this is a bueautiful property and when you first arrive you are treated real well. We checked in on a Saturday morning after traveling all night and decided just to rest. They offered an amazing ticket deal for us but we had to go to a 90 minuet presentation of their properties, why not we said. So we went a head and purchased the tickets right then and went to our room. very nice 2 bdrm, 2 bath kitchen patio washer dryer. We had 5 in our party and we all thought wow this is great we settled in got some rest and groceries and waited to hit the parks the next day. we had an early appointment for the presentation since we had lunch reservations at one of the parks. After we met or presentor we sat down and he said we would be out in 90 minutes no problem. We toured the property and all of us really liked the 2 bdrm model that they had which included a loft; a real nice set up. well by the time we got back we were starting out second hour and wanted to get out. We were showed a price list and right on it the 2bdrm w/loft was sold out (why did they show it if sold out)? Well we declined and said thank you but the model we liked was sold out so please give us our tickets and we will be on our way. they kept us there another 20 minutes and guess what a unit we were interested in suddenly became available - we again said no and please give us our tickets (which we paid for) all in all when they finally let us go it was 3.5 hours and we missed our lunch rservations. They never spoke to us again until the last day when a housecleaning lady came banging at our door at 7:50 a.m. asking when we would be out so she could clean the room - we told her check out was at 10:00 and that was when we would be out. 10 minutes later she came banging again with all her cleaning supplies and put them in our entryway. our yeah did i mention the \"Do Not Disturb\" sign was on the door? We asked to talk to a manager and were told that one would beat our room that was at 8:15 - at 9:55 when we were leaving they stioll did not have someone out - they said they were too busy - those were the major problems I wontget into the minor ones. oh yeah if you are not an owner you do not get to use the ammenities they offer at the resort unless you got though the tiem share nightmare", "Date": "June 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Coral Springs, Florida", "Title": "“Beautiful place - Just don't go to the FREE BREAKFAST”", "Author": "IfPigsFly", "ReviewID": "UR68213352", "Content": "The check-in process was interesting being scooted around to 3 desks before finally retreating to our room. I must say, after the front desk check-in we were moved to the time-share desk. I was not prepared for the sales pitch the lady put on me and told me I wouldn't be able to do anything on site without the VIP card which was only given at the 90-minute breakfast. I would also get great Disney discounts. I told her, \"I work for an exchange company and am not interested in the 90-minute thing, and we were not going to Disney\". She then tells us we can get a $50 dinner gift card at the Smokehouse Grill (NASTY, DISGUSTING DINER FEEL TO THE PLACE WITH GROSS FOOD - IT FELT LIKE A STEPHEN KING NIGHTMARE). So we succumbed to her push as to silence her and get our keys to move on. To make it short - that 90-minute breakfast the next day is not accommodating to vegetarians (starches only like grits, cereal but no soymilk, potatoes, bitter fruit, etc.) but we started at 10:46am with out \"presentation guy\" and were not FREED until 3:12pm. I was so furious by the entire process that I cried when picking up my wonderful gifts. All in all, the VIP pass was a lie and no one during any activity at the resort asked me for it; the YukHouse Grill was Disgusting, and our first day of vacation was RUINED! On a lighter note - the room was great 2bed 3bath in the Towers overlooking Pool 1. Loved that. So I recommend the place just don't do the breakfast unless you want to purchase a WEEK vacation to share with others.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ohio", "Title": "“This place rocks!”", "Author": "hogn99", "ReviewID": "UR63367160", "Content": "Exchanged my timeshare for two two-bedroom suites in building 5300, ground floor. This is pool 13, the busiest of the pools at the resort. Walk out of the screened-in porch at you are looking at the pool. The only thing missing was a gate to the pool located at our back doors. No big deal, the gates were about 25 yards away. When needed, maintenance and housekeeping responded without too much waiting. Activities at the resort were enough to keep the kids and adults busy. No more than 5 minutes drive to the Disney gate and 25 to the Universal area. We did the tour to get some discounted tickets and gift cards. The breakfast was horrible, as they often are so skip that if you take the tour. The tour was quick and painless and you do get to see the property so do it as close to arrival as you can. Our salesperson, Farrah, was really nice until we said no to the third, and final offer. After that she wanted nothing to do with us. The offer was pretty good. If I didn't own two already it would have been very tempting. Over all, great place. Internet is way too expensive, which is standard for every place out there. They are in the process of building a restaurant area and a water park right behind the main building which will definitely add to the resort.", "Date": "May 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "5", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Conyers, GA", "Title": "“Not a \"Hotel Snob\" by ANY means, but THIS was dissapointing”", "Author": "TheBonners", "ReviewID": "UR60883100", "Content": "Where do I start? Would it be the cheesy 1990s decor from the lobby to the furniture and bedding? Or maybe the fact that I could hear my upstairs neighbor coughing and moving furniture all night -- even as I type this at 2:45 am. How about all of the lamp lightbulbs blowing out in the livingroom and bedroom? I mean SERIOUSLY, it's 2010 and I literally feel like I stepped into a time machine and made a pitstop in 1991 -- when just my luck -- the engine failed! Granted, for $50/night what can I expect -- I DID get to wash a few loads of laundy I accumulated while on our cruise this past week -- but good grief!? To be forced into a 90 minute presentation at the \"nicer\" Villas next door, one would HAVE to think that booking cheapy guest like me in this rathole is a mind game to get you psyched out about the \"newer\", \"upgraded\" and \"classier\" timeshares. Well, NOT GONNA HAPPEN. I pray that 90 minutes goes by fast! LONG AND SHORT: If you're on a budget, have 90 minutes to waste and want a step up from the regular hotel room -- then this is the place. If you want/need to be within 2 miles from Disney -- this is the place. HOWEVER, if you want a good night's sleep and a cozy, aesthetically pleasing environment -- keep looking, 'cause THIS location is a semi-glorified extended stay hotel, essentially.", "Date": "April 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Apple Valley, CA", "Title": "“NOT worth the money.”", "Author": "horsebbls", "ReviewID": "UR60321922", "Content": "We booked this on Hotwire w/rental car. The registration staff were professional, not really \"friendly\". Upon arrival to our 2nd floor condo, we found that the microwave hadn't been cleaned, the light in the master shower was out and the security lock on the door was broken. There are only 2 towels racks in the whole 1 bdrm condo. One in the toilet closet of the master and one in the other bathroom. None in the kitchen or near the shower/tub or sink in the master. The bed was a mattress on a shelf, VERY hard. There are sliding glass doors in both rooms with a railed 18\" shelf..don't expect to sit there, you can stand. The maintenance staff came right up when we called about the problems, also the o-ring in the shower was cock-eyed and the pressure was bad, but they did fix it. The people that fixed the light in the shower and cleaned the microwave (above the stove) used the dining room chairs to stand on, guess they can't afford a stepladder? Even though we paid for the 4 nights we stayed, they still tried to entice us to attend the timeshare presentation by offering us discounted tickets to any show we might want to see. I'd rather pay full price for the show! They did provide plenty of towels for the room and the pool. Toilet paper, Kleenex, paper towels, etc. Although, there is NO place to hang up the paper towels in the kitchen. Provided soap for the dishwasher and washer/dryer which is nice. Plenty of soap in bathrooms, also complimentary shampoo & conditioner. Lousy old 27\" TV's; either they were bad or the cable was. They do provide a DVD player in the living room. The only electrical outlet in the bedroom was by the bathroom sink...that is, unless you take the drawers out of the nightstands and look behind them. Even the built in desk didn't have one near it. The living/dining room & kitchen had plenty. We decided to go to the pool on the first afternoon. There were 13 kids screaming, horseplay, and floating on the life preserver after one of them removed it from the wall. At least 8 or more of those children were unattended by adults. My husband complained to guest services, they called security and the kids finally went inside after it got dark. No security ever showed up, we know because our room overlooked that particular pool. If the guest/hotel building is any indication of how the timeshare is run, I would be very disappointed if I bought there. The villas next door apparently are the timeshare units. All in all? NEVER again will I consider staying at any Westgate property.", "Date": "April 4, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Great customer service - not so great neighbors”", "Author": "scotch75", "ReviewID": "UR59932024", "Content": "I spent 5 nights at the Westgate Towers (room 312) earlier this month with my parents and my toddler son. We arrived late after a long flight; the employees at the front desk (Myrna and Cortez) were extremely friendly and professional and made us feel like family. We stayed in a deluxe studio, which was basically a hotel room plus a washer/dryer and mini kitchen. The room was functional and clean and provided basic accomodations. I received laundry detergent, which came in handy and the room was stocked with full kitchen utensils, towels, etc. The decorations were pretty vintage 1990, but everything appeared clean and nothing was broken. On the second to last night, there was a very large party in the room adjacent to ours. I called the front desk 3 times between 2 am and 6 am, and only after the 3rd call was the situation resolved. (I later found out that the hotel had to contact 911 in order to remove the unruly guests from the property.) The following morning, I spoke with the hotel manager and he agreed to remove the charge for that night from our bill. I was unhappy that I had to contact the front desk 3 times to resolve a difficult situation, but in the end, I was pleased that I didn't have to pay.", "Date": "March 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "florida", "Title": "“Clean & ...”", "Author": "freshee61", "ReviewID": "UR58615912", "Content": "Clean and what else could you ask for... this hotel is 2 min away from disney. *****its very clean and priced right******** very spacious rooms equiped with everything. all these people leaving negative reviews need to book a $300 a night room if they can afford it. service was super nice. location has walgreens, resturants, etc at door step only complaint hard king bed. PS they have awards every where to prove this feed back upon arrival.", "Date": "March 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sarasota, FL", "Title": "“Much Improved”", "Author": "VacationTravelers84", "ReviewID": "UR56658171", "Content": "My wife and I stayed at the Westgate Towers a few years back and have seen many improvements since. The resort is much more intimate that some of the larger Westgate properties. The staff is extremely friendly and the resort is very clean. Our room was surprisingly nice given the price we paid. The property is located directly on 192, next to many restaurants and entertainment options. The resort had 3 pools and a fitness center, however there were no other amenities that I saw on property. Fortunately, the Westgate Villas is right next store with many amenities. The Towers staff took my wife and me over there to spend the day. If you are looking for a smaller boutique style resort, without the long check-in process, I would recommend this property.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Manitoba", "Title": "“Non-biased Review”", "Author": "mbliving", "ReviewID": "UR54858465", "Content": "We stayed at Westgate Towers from Jan 19-29. We did NOT book a deal that included a timeshare as many of the previous reviewers mentioned. We got a 1 bedroom condo for 67.00 a night which I thought was an amazing price. I found the price on a discount hotel website and the resort matched it. The condo is a 3 1/2 star.. fully equipt kitchen, king bed, 2 bathroom, whirlpool tub, washer and dryer (in room) and screened in balcony. It was very roomy and very clean. The unit is a bit older and had a few minor issues like a slow tap but I have no complaints for the price we got the unit for. You can exchange towels anytime by leaving them outside your door. Not once did anyone even mention going to a timeshare.. not a call, not a whisper. Being a middle aged couple and ready prior reviews, I was a bit worried... There was dish soap, toiletries, tide, paper towels, eveything you needed to get started and they would replace stuff mid trip. I agree, internet was a rip so we found a place in walking distance that had free wi-fi I thought it was a great place, very clean, great value. Stores were close by, free parking and very close to Disney. We got great value for our money and would stay again. Any specific questions, please email", "Date": "January 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Puerto Rico", "Title": "“Just superb!”", "Author": "ElisamPuertoRico", "ReviewID": "UR54500318", "Content": "I'm proud to say that I am the owner of an apartment at Westgate towers and the Town Center. Thank you for a wonderful stay. I stayed for a week at Westgate Towers and onether one at the Town Center. from December 18 to Jaunuary 1. My wife, my grandson, brother , his wife and I had a wonderful time there. Thank you.", "Date": "January 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Massachusetts", "Title": "“one of best vacations ever”", "Author": "reenybean", "ReviewID": "UR54277656", "Content": "This trip was so much more relaxed than staying on the Disney property. The staff were friendly, no pressure. We did attend the tour and ended up buying a 3 bedroom week. We stayed there using a bonus week and had no plans to buy. We loved it so much we are selling the other time share and bought this one before selling the first one. I would make the same decision again today.", "Date": "January 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Marysville, Oh", "Title": "“very roomy and lots of ammenities in the kitchen”", "Author": "debcanter", "ReviewID": "UR38097797", "Content": "We have stayed at Westgate towers in 2007 and now in 2009. Once outside of the gated area in the North Towers and this last time in the gates accross from the put put golf. Both times have been wonderful. The first time we had a two bedroom with 3 bathrooms which was huge and this last time a 2bed 2 bath condo that was still very nice. Apparantly they shut the other tower down becuase of business being slow and they were not staffing it... Wewere hoping to stay in the North Tower again. The place has always been clean and the jaguzzi in the room was awesome..after a long day at the park my husband and I would soak in the jaguzzi with the jets on and it was great!! Walmart is the place to go for food and you can get internet at the hotel beside it by buying a card and using their computer room and printer. That was very handy..I am not paying afortune for internet that did not work... They would also shuttle you to the parks if you just waited outside at the partner hotel beside them where the Westgate Grill was... they don;t tell you that we found out because we had to have a belt replaced on our car and did not have tranportation to Disney for a day. After I found out all this I was set to go.. The kitchen had Dishsoap,dishwasher diet., towels and everything.most places do not..I found that very nice.. Debra Canter", "Date": "August 18, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Tennessee", "Title": "“We had a good time.”", "Author": "TravelNurse1", "ReviewID": "UR37299819", "Content": "We just returned from a week stay at the Westgate Towers in Orlando. We thought we would not get a vacation this year due to my husband's layoff but he found work independently as well as this was my dad's timeshare exchange so we were happy just to be going. The resort is not as fancy as some others we've stayed at. The staff we friendly. Sometimes overly friendly to the point of annoyance but I would rather have that then the alternative. My husband and I traveled with our two boys, ages 12 and 11. We stayed in a 1brm. It looked like it was right out of Miami Vice. I expected Crockett and Tubbs to come thru the door! But the unit was clean and it had two full bathrooms, full kitchen, as well as a in unit w/d. That sold it for me! Most of the amenities were located at the Westgate Villas across the street. They had a shuttle you could use but we never used it because it was too much of a hassle and we were there to do other things in Orlando. We had a simple pool right in front of our unit and that was enough for late swims after a day of activities. Overall it was a clean decent unit although a little dated. FYI, you have to pay for WIFI thru a third party server and it wasn't great although service got better the longer we used it. For me the two full baths and in unit w/d made me overlook the lack of more posh amenities. And it was clean.", "Date": "August 10, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "florida panhandle", "Title": "“Horrible Customer Service”", "Author": "orlandotampa2009", "ReviewID": "UR36979304", "Content": "I just returned home a day early from our stay at Westgate towers. The location and condo are great, while the employees are horrible and lack greatly on customer service. We checked in having to repeat ourselves constantly as the clerk was texting on his personal cell phone the entire check in time. We we're then handed off to a person \"to be our contact for the week\" who turned out to be trying to sell us a time share (we allready own and had traded our week to this location). We then get to our room and our air clicked off and on 24/7. I reported it and no one ever showed the entire week we we're there. The first night we we're there our neighbors we're teenagers who partied all night and after numerous calls to the front desk they finally shut off the music. One night we'd been out at the parks and came in to find our keys wouldn't work called security from our cell phones and no one ever showed to let us in our room. We flagged down drivers who we're taking other guests to let us in. Then two days before we we're scheduled to leave the hot water went out in our entire building and we recieved note on the door stating they would attempt to work on the hot water the next day between 9 and 3p. We had reported the water being out at 9a that day. I spent an hour on the phone trying to bet a manager to change our room and after no luck we packed our bags made reservations at a nearby hotel and checked out. You also have to dodge the drivers on golf carts they text while driving and speed thru the lots paying no attention to cars or people.", "Date": "August 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Kentucky", "Title": "“Great for College Students”", "Author": "TravelingBosnian", "ReviewID": "UR33942061", "Content": "The reason why is great for college students is that you won't be hassled to attend a timeshare presentation. So for example, they asked us right away if we were college students, and after we said yes, we actually got another person to show us our room, not the boys from the timeshare. Staff in my opinion were little rude, they spoke Spanish in front of us, so we could not understand what they were laughing about. A lot of Hispanic employees, which does not bother me one bit. Condo was 2BDR, three bathrooms next to the pool 14...GREAT!!! Resort is really beautiful. Jacuzzi in the room, hot tub next to the pool. Resort is nearby Disney, and about 20 minutes to Universal down the I4. Arabian Nights is also close. You have supermarket on the resort and just outside of resort, but I would suggest you make a trip to Wal-Mart, because prices are outrageous. Resort itself was peaceful for 7 days we stayed there, no disturbances from neighbors of any sort. You also have washer and dryer in the condo, yep that's awesome. Even later check-out is available upon request. All balconies have nets, so you can enjoy breakfast or dinner on the balcony, and you don't have to worry about the annoying flying friends invading your food. There is also Pizza Hut on the resort, so if you don't feel like cooking, just order up. Also, one bad issue about the resort is that they charge you $5 per hour to access the internet. We opted out for the library, but it was not close. Also, they have some discounts on Universal tickets, but you could find better deals on Ebay. But they are still cheaper than if you would buy them at Universal. Overall, it was great for me, but I think just because our group were college students. We saw other guests having their arms twisted on purchasing a timeshare.", "Date": "July 5, 2009"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Rooms": "4", "Value": "4", "Location": "3"}, "AuthorLocation": "Skillman, New Jersey", "Title": "“Enjoyed Stay”", "Author": "Youhoo", "ReviewID": "UR26950272", "Content": "I was concerned after reading some of the comments about our stay at this but it was a timeshare exchange. When we first arrived the clerk had to do a lot of searching to find one that had been cleared by housekeeping even though it was well after 4 PM. Based on experiences at other places we decided to check on it before we moved the our luggage. For the life of me I do not understand why a developer would construct a unit that faced a wall. We requested a different room and said we would go to dinner, well the unit was fantastic, on the ground floor with the pool just steps away. It should be noted that there are no amenities by this pool which is usually frequented only by adults and older children. The room was clean and, although it had the chemical smell initially, a run of the A/C eliminated most of the smell. The only complaints that were the beds which were hard and the wifi access which was mostly non existent for most of the time. The service did provide me with a refund. All in all, we enjoyed our stay at the Towers.", "Date": "March 27, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "5", "Value": "5", "Location": "5"}, "AuthorLocation": "homosassa, fl", "Title": "“Better than expected”", "Author": "prudenville", "ReviewID": "UR26007192", "Content": "I booked my stay through AAA of Michigan, for the price the rep said it was probably only like a regular motel room, it was described as a studio, oh were we surprised, we had a room w/micro frig, toaster,microwave,coffee pot, dishes,glassware,whirlpool tub, 2 double beds, balcony w/table 4 chairs overlooking the outdoor pool. I will check it out next year when we visit Disney World again.", "Date": "March 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "mississippi", "Title": "“Hard bed - not a great experience”", "Author": "MississippiDisneyfan", "ReviewID": "UR25408360", "Content": "We stayed here with Interval International Getaways (timeshare). The location was great. The size was ok. The washer and dryer were a plus. It had internet - for a FEE. The bed was VERY hard. The room was not great. The toilet overflowed and the floor was not cleaned after it was fixed. The television did not work in the living room and the phone did not work in the bedroom. I think they are trying. The lobby and hallways show some remodeling in the process. Our main problem was the VERY hard bed. I did not sleep well.", "Date": "March 1, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "UK", "Title": "“AVOID AT ALL COSTS”", "Author": "TRIPWEAVER", "ReviewID": "UR18898624", "Content": "I am a time share owner with Westgate Towers, and I would urge anyone thinking of taking up ownership NOT to do it. Westgate are masters of the con trick. They will constantly badger you to upgrade, add additional weeks etc etc, and they will not take no for an answer. The last time I visited I ended up signing up for an additional week of ownership that would only cost $3500! This would be added to my existing ownership, and wouldn't extend the payment period. How wrong was that! The actual cost will be nearly £10000, and its very difficult to get out of - I know I,ve been trying for 3 years! They will constantly badger you by phone and if yoy don't want to talk to them they will send out threatening letters by the bag full. Oh and don't beleive them when they give you their names - they never exist! The resort is poor, all the ammenities are miles away, - I couldn't even get a kettle for the room for 10days! We had leaks from upstairs bathroom, a room by the lift, and most of the kit didn't work. Once again avoid at all costs. You've been warned!", "Date": "August 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Engalnd", "Title": "“great place”", "Author": "Houghton1", "ReviewID": "UR17122070", "Content": "We have just come back from Westgate towers. The room we had was a two bed/ three bath apartment which was wonderful. The rooms were clean, and well furnished and equiped. The only down side was the shortage of pool umbrellas, and the sun was raging,over 100 degrees and not enough shade. The hotel location on 192 was in the middle of everything. Good access for theme parks. The room accomodated six adults perfectly and comfortable, and I am hotel fussy. Everything has to be right, if not I will tell the world, but this holiday experience was magnificent. Thank you WestgateTowers and staff", "Date": "June 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "prosser", "Title": "“Loved the location”", "Author": "garoot", "ReviewID": "UR17100730", "Content": "The check in process was 2 hours long travelers beware of the time share pitch and pressure to tour the resort.The resort was always clean.The room we rented had light bulbs out no tv remote for the master bed room one phone call and it was corrected within 5 minutes.", "Date": "June 21, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "4", "Location": "3"}, "AuthorLocation": "michigan", "Title": "“Buyer Beware (there is always a catch)”", "Author": "vinsons", "ReviewID": "UR14935095", "Content": "We have been owners of westgate since 1998 and always seem to upgrade which is what they want you to do what they dont tell you is all the charges, taxes, maintenance fees, going up every year and oh you have all weeks but that doesnt mean you really do there are still black out weeks which you find out the hard way and they charge you a whopping $250 for these weeks well no one (including us) knew 3-23 week was Easter week and a \"black out week\" our first time in our villa and we paid $250!! well they refuse to give us that money back as it is their mistake they didnt tell us it was a black out week as of course when we signed the dotted line and $188 a month payments for the next 5 years of our lives and $700 a year for maint. fees later this one week stay was very costly to us as a middle class family in which Mr. Siegel states in his mission statement that the goal is to make a middle class family have a five star stay- well yes the grounds are breathtaking which they should be for what they charge every \"owner\" maint fees but all of Westgates gotcha costs will take the breath out of you literally and the money out of your wallet too- we too had an extremely rude hispanic woman check us in. This was in the new headquarters that was built. Beware of the seller they well tell you everything you want to hear and than when you go to make your first reservation is when you find out the real deal. You are truly not an owner of your place when someone is alway dictating when you can and cannot come and if you do there is a price to pay. stay away from these sales persons listed: Neil Bartz, Rich Mattsson, and Manny Rucker. They are liars and dont back up what they say and dont have the nerve to call us personally on the phone and will not communicate with us-which is in the mission statement to that communication is important and half the staff their cannot speak english! Hillarious- we have a condo for sale if you want to buy it ( will not accept calls from the leach companies who call)-only serious individuals need to call J. Vinson in Woodhaven Michigan, we are listed. jvinny0501@yahoo.com", "Date": "April 10, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Good stay”", "Author": "chilee21", "ReviewID": "UR14208791", "Content": "Stayed in a two bedroom villa and we were very pleased. Master suite with a king bed, walk in shower next to jacuzzi tub and second bedroom had two Double (or small Queens) and the same shower,jacuzzi tub. Three bathrooms in total which helped when everyone was getting ready at the same time. We used the kitchen for breakfast (saved $$ b/c we didn't have to eat out) and to make coffee or tea at night. We used this villa to mostly sleep & I will recommend this place if you are going to Orlando to visit the parks and not stay in the hotel room. The location is great - close to disney & you have restaurants around the hotel. It is located on US 192 so it is a busy street - so not as comfortable to walk outside like International Drive is.", "Date": "March 11, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Not Worth the Aggravation...”", "Author": "Mygree22", "ReviewID": "UR8260309", "Content": "This was a terrible vacation stay. We arrived at the desk to a very unwelcoming staff, who felt bothered and troubled at the fact that we inquired as to whether our room was possibly ready earle. NOT! Once checked in, we were given room 4 room keys of which 1 worked. kept having to go to the desk every day for a new key. No housekeeping (AT ALL) so plan on cleaning and emptying your own trash. Don't even think of asking for extra towels because they recommend that you do your own laundry or suggest you pay and additional $40 for the week for their services. Game room and video rental machine steals money. (Credit was given at desk though). Hallway rugs were dirty always after 11am and had a foul smell due to big trash bins at ends of each hallway. The 90 minute tour scheduled for 7:30 was a lie. Didn't even get to the door to register until 8:00am. The representative was very rude and when we requested a new rep, everyone ignored us. Very upsetting. Save your money and stay elsewhere (Prefferably at the Ramada Plaza, also owned by Westgate, but with no presentations, professional staff, and free shuttle service to attractions and parks.)", "Date": "July 30, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Windsor, Canada", "Title": "“Not alot to offer”", "Author": "bmwx5rocks", "ReviewID": "UR7195033", "Content": "We were actually supposed to be in the Westgate vacation villas which is done the road from the propertery but upon the hour of checkin time we were told we were in the towers. When we got to our room which was on the second floor facing the parking lot we noticed it was un cleaned. We revieved another room 30 minutes later across the hall that had a view of a pool heater, all other rooms were supposldely booked. The pool was warm but that was the only thing to do at this place. The room was pretty big and had a large balcony but we would have enjoyed a better view. We will not be returning.", "Date": "March 20, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Worth every penny”", "Author": "ReaReaAtlanta", "ReviewID": "UR6688272", "Content": "After reading all of the many bad reviews, I was nervous about staying at the westgate towers. However to my surprise the stay was the best I've ever had in Florida. The room was very nice and it accomadated the entire group of 8. I had the 2 bedroom. The room was very clean, the staff at the front desk was very nice and pleasant. The view was wonderful, our balcony faced the Irlo Bronson highway which we could see the firework show at Disney from out balcony (priceless). I would definitely recommend this location to anyone. The only thing I didn't like is that there is no complimentary daily breakfast. The location is great because universal studios is only about a 15 minute drive and disney is about a 7 minute drive. Grocery stores, shopping plazas and restaurants are all along the same strip as westgate towers. My 5 day vacation was wonderful!!!!", "Date": "January 24, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "5", "Location": "2"}, "AuthorLocation": "LongIsland", "Title": "“Lies, Lies and Lies”", "Author": "waitinginthewings", "ReviewID": "UR5533198", "Content": "This trip was on a scam deal the Westgate organization pulled on my boyfriend and I in February this year. We were promised by a Westgate sales representation that all are meals for four people were included in this vacation plan. What we got we 2 continental breakfasts, one cookout that only had hot dog, chips, potato salad, saurakut and a soda. When we got to the \"so called resort\" there was mass confusion even getting into the condo. We had to go to two different buildings and three different counter to get our keys. This was suppose to be a \"four star resort\", but the first condo they but us it was barely \"two stars\". After a few conversions with one of the on site managers we finally got the condo we were promised in the first place. It was very nice, but the walls are paperthin. We heard washers and dryers going all day and night. Lots of noise. The pools were so overrun by children. There was many young kids walking into the resort very late at night. I would NEVER go to another Westgate Property, Condo, hotel. We were promised four vacations in Vegas, but because we wouldn't sign up for a timeshare while we were in Florida, we were then told those were void. DON'T DO BUSINESS WITH THIS COMPANY, PERIOD!", "Date": "July 31, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Boca Raton, Florida", "Title": "“Overall, Not Bad, Much Better Than I Thought”", "Author": "A TripAdvisor Member", "ReviewID": "UR4475965", "Content": "After reading so many negative reviews about Westgate Towers, we were very pleasantly surprised by our experience... We checked in late in the evening and the people at the front desk were nice and checked us in rather quickly. We were offered and we accepted assistance with getting our things up to the room. Our 1-bedroom accommodations were very nice. The carpet had just been cleaned (indicated by a sign on the floor that the carpets had just been cleaned and all of the ceiling fans were on and the A/C was blowing like crazy to dry them). The pull out sofa bed could have been more comfortable, but then again what sofa sleeper is comforatable?!?! The room itself was spotless, practically sterile! The FULL-kitchen was well equipped and everything was in perfect order. The silverware, bowls, dishes & pots & pans looked brand new! Jacuzzi tub in the Master bedroom was great. The floors were clean & shiny. Our 2nd floor room had a nice view of the jacuzzi & heated pool. The only reason I would recommend NOT requesting a pool view is that the pool area is open until 11pm and you can hear all of the converstion & action that goes on, even with the sliding doors closed. When we requested more bath towels & toilet paper, housekeeping was at my door within 5 minutes! Since we checked in late, we went to the Welcome Center the next morning to pick our 2 complimentary 1-day adult tickets for Disney. They gave us a voucher to pick up the tickets at any Disney Theme Park...pretty simple. We went to Westgate Towers on a package deal, so we were obligated to attend a 90-minute sales pitch on buying into Westgate time-shares. We were scheduled for a 10:30am start, and they pretty much started on time. You get your own personal tour guide who escorts you to a continental buffet breakfast. The salesman then goes into his pitch which ends with a tour of the property via golf cart and a sit down with a manager. The entire ordeal lasted a total of 2 1/2 hours from beginning to end (they all do), not 90-minutes. In the end, we declined to buying a time-share and that was the end of it. Our salesman was obviously disappointed, but he didn't go on, he left it at that. Didn't feel any high sales pressure, they did their thing and I simply said not interested! Since we started at 10:30am, we didn't leave the sales pitch until 1:00pm. If you plan on doing this, schedule the 7:30am start time, so you have most of the day left to go do your own thing. Westgate Towers is literally 1 mile away from Osceola Pwky, which leads you to Disney World. You are just about 1 mile from the entrance to Animal Kingdom. Very conveniently located if you plan on driving yourself to Disney World. There is a grocery store within walking distance, so you can get almost anything you need when you get there, instead of hauling everything from home! There are a number of places to eat within walking distance as well. For the price, this package was a steal. We were very happy (lucky?) with our room as it was VERY,VERY clean and very spacious for 2 adults and a child. We only spent the very early mornings & late nights in the room to sleep as we were at the parks & out and around all day. That is why we were looking for space & cleanliness. Didn't really care for amenities, as we would have had not time to use them anyway. Hope this review helps!", "Date": "February 21, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "nottingham england", "Title": "“Not a bad hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4446670", "Content": "I must say we quite enjoyed our stay at Westgate towers.. We arranged a trip to see our friends in Louisanna but because of Hurricane Katrina we never got there so we decided to have an extended holiday in Orlando. The customer services seemed organised.. I was very impressed with the room especially the spa bath in bedroom. the room was clean the only problem was the sofa bed was very uncomfortable but my 3 year didn't care one bit. No maid service which was a shame. I had no idea about the timeshare selling but they did call to arrange an appointment to go to see the pitch which I convienatly booked for the time we were on the plane back to England. I would book this hotel again purely for value for money but having read the other reviews I would be alittle warey.", "Date": "February 8, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "5", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Miami, Florida", "Title": "“OK to stay for a few days, however, ownership is not for us.”", "Author": "Coquiman", "ReviewID": "UR4355376", "Content": "My wife to be and I stayed at the WestGate Towers over the MLK holiday weekend. I found the deal over the internet at $29 per day - the catch - we would have to attend a 90 minute sales pitch on Time Share Ownership. We live in Florida and have done all the parks in the past so I figured what the heck, it'll give us something to do for an hour and a half. Besides, it may be something I'd like to invest in. We checked in at 10 pm with no problems, however, Pablo, the gentelman that checked us in was lacking in personality: not very talkative. The employees at guest relations were nice and informative. Before arriving I figuered that since we were going through a sales presentation that we would be getting a room with at least decent view. Not so, we got the parking lot. The room was nice, spacious and besides the dirty rugs, small leak under the kitchen sink and broken vertical blinds, the price at $29 per day was fabulous for the room we had. I did some homework on WestGate before we arrived on Trip Advisor and 2 other sites where reviews are posted. The news was not good. I printed over 100 reviews of the timeshare property, with a minimum of 95% negative reviews from people who own or toured with WestGate. Our sales person was informative and attentive. Young, however somewhat expierienced in keeping the attention of his potential buyers. He asked alot of questions when he thought he was looseing you. Since I was able to do my homework on WestGate before we arrived, I had documented evidence to contradict almost everything that was in the sales pitch and I brought it with me and even showed it to him. Persistent he was, even with what I showed him from numerous complaints of people that own at WestGate. Truthfully, he did not present us with a hardcore presentation and was rather nice. However he was a salseman and was there to make money so he did not give up. Finally after 2 1/2 hours, I called it quits (2 or 3 times before he finally got the message). DO YOUR HOMEWORK, CHECK THE INTERNET. IF YOU PLAN TO BUY A TIMESHARE CHECK WITH STATE, LOCAL GOVERNMENT AND A GOOD LAWYER BEFORE YOU BUY. ALWAYS READ YOUR CONTRACT. My advice - invest in a residential or commercial property where you have full control, 52 weeks a year. If you have nothing else to do with your money, then timeshare is for you, but buy it outright and don't fall into the 18% interest rate. BUYER BEWARE If you can say NO to drugs you can say NO to timeshare.", "Date": "January 16, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "3", "Service": "1", "Rooms": "3"}, "AuthorLocation": "Missouri", "Title": "“Attention: Forget the positives it is lies. Avoid this place”", "Author": "A TripAdvisor Member", "ReviewID": "UR4325465", "Content": "This place is a joke. It used to be a Motel that went bankrupt and then they took it over and made it into a resort. They state there are lots of ammenities here but there is really only one. (Swimming Pools) 3 and on top of that only one of them is heated. There are no vending machines in the North tower either you have to walk all the way to the other side of the resort to even get a soda. Yes they have more ammenities if you don't care to walk a mile to Westgate Villas. It is not a place to take your kids. PERIOD I will state that the rooms were nice and the furnishings looked good at first sight but they are all old and broken down. Including the mattress. Their other resorts are alot nicer and have the true ammenities that are stated. If you go here stay at the Villas or Town Center.", "Date": "January 4, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "sc", "Title": "“DO not GO for the TOUR of Westgate Villas”", "Author": "A TripAdvisor Member", "ReviewID": "UR3238164", "Content": "While the Westgate Towers offers very nice condo style accomodations the obligatory 90 minute tour may be a downer to your vacation pleasure. Our tour was to be at 7:30 AM with a breakfast promised. We arrived along with about 100 others and stood in line for 40 minutes before getting to the registration desk. After going into the Lobby to wait yet again, we were called to our tour and sales pitch. Plan for 2 hours + of your time. Needless to say, we and most of those around us were truely angry at this treatment. We had fullfilled our part of the bargain, we came, we were prepared for the sales people. NO breakfast yet after an hour and the salespitch had not begun. Do not take this treatment lightly, speak up. We protested this treatment strongly with the management and we were signed off and went on our way. Take advantage of this reduced hotel rate and tour offer only if you are desperate, really plan to buy no matter how you are treated, or have lots of vacation time and like standing for 40 minutes. Otherwise, Go elsewhere.", "Date": "March 1, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "san antonio", "Title": "“Wonder why it gets from 1 star to 5 stars?”", "Author": "dbalc", "ReviewID": "UR3223268", "Content": "How to enjoy your Westgate stay: DO rent during non-peak times. This avoids headaches associated with busier weeks, such as check-in woes, dirty rooms, misplaced reservations and lottering kids. (One midweek day in early December only 17 families registered; a Saturday in the summer can have 500 check-ins.) It's a good deal when you get condo through online sources that don't require a \"property tour.\" I've paid $50 for a 1-bedroom and $95 for a 2-bedroom, including tax. Condos are spacious with semi-luxury appointments. The Villas are fine but the Towers are newer and nicer. There is no daily housekeeping and no garbage pickup ... deal with it. We wash our own sheets/towels midweek. DON'T book a vacation that requires a \"property tour,\" it will spoil your vacation. NOTHING IN LIFE IS FREE, pay for your theme park tickets. Don't buy an overpriced timeshare, you will be unhappy. Online shoppers can rent for a week for less than an owner's annual maintenance fee. Don't believe anything sales people say: One tried to make appontment to answer a questionaire at 8:30 am b ysaying \"the parks are crowded then\"; the questionaire apparently is a hustle to make a sales pitch. Just politely decline. If you are weak, don't answer the phone. Don't rent on summer weekends or on spring break. Clerk tells me they have up to 500 families coming in on a summer Saturday. You will wait in line and rooms might not get great cleaning.", "Date": "February 23, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Highly recommended!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2898899", "Content": "My family of four stayed at Westgate Towers Dec 11-16, 2004 during a Disney vacation. Westgate Towers is only a couple of miles from the exit to Magic Kingdom. The 2 bedroom/3 bath unit included two jetted tubs, full kitchen, two screened balconies and 3 televisions. The place was spotless, and the customer service was excellent. I managed to forget the code to our room safe, and the security dept. took care of it with no delay and no cost. The condo does not have daily maid service, but for a fee you can request it. I would definitely recommend it and hope to return one day. (Stay away from the on-site Sizzler Restaurant. Horrible!!)", "Date": "December 18, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "San Francisco, CA", "Title": "“I would definitely not recommend Westgate”", "Author": "A TripAdvisor Member", "ReviewID": "UR2835744", "Content": "I've had so many problems with Westgate -- being referred through their owner-referral program, I was expecting a great experience as promised. We were put in their only room available -- a smoking room with a broken toilet. We requested a non-smoking room, especially because I was 6 months pregnant - but they said we were out of luck. The staff was okay. The accomodations were not good, and for the price we paid per night, it was not good at all.", "Date": "November 19, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "buffalo, ny", "Title": "“The devil”", "Author": "A TripAdvisor Member", "ReviewID": "UR2506632", "Content": "Book them for 64@night through expedia, they give us the wrong room had us waiting infront of a lock door for 30 min. We sat on the floor waiting for someone to open the door for us no one came. My husband went down to complain, they got mad and called the police, in the meantime another lady was yelling and scrameing because they moved her three times. Come to find out they give us the wrong room to begin with. Needles to say they no longer wanted us there. We left and I called expedia to tell them how upset I was and what was I going to do. They book me into DoubleTree resort, they was great they even upgrade my room. Stay away for Westgate they are the devil.", "Date": "September 1, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Long Pond, PA", "Title": "“I wasnt that impressed!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2229957", "Content": "We stayed here for 3dys. Nov. 2003 The unit was ok. 1 bdrm but i thought it was small for a timeshare. The kitchen wasn't well equipped. They left dirty towels and garbage outside of our room. We had to call to have it removed. The decor was contemporary, but all this was not worth the high pressure 90 min+ sale.", "Date": "June 29, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Jacksonville, FL", "Title": "“Loved It!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1839044", "Content": "I am only 20 yrs old and have visited here twice, once w/ my parents on a sales offer and again w/ my best friends for my 20th birthday because i enjoyed it so much the first time. My parents had to endure the horrible sales presentation, but this review is about the hotel itself. I honestly feel the hotel is very relaxing and comfortable. I dont feel that people see the hotel for itself because of the sales pitches the management burden you with. I think they should let the hotel sell itself. The accomadations were wonderful, the floorplan is beautiful and my favorite parts are the jacuzzi tub, big screen tv and screened patio. Westgate will always be my vacation spot every time i visit Orlando!", "Date": "April 26, 2004"}], "HotelInfo": {"Name": "Westgate Towers", "HotelURL": "/ShowUserReviews-g34352-d235227-Reviews-Westgate_Towers-Kissimmee_Florida.html", "Price": "$88 - $137*", "Address": "<div class=\"amenFloat\">", "HotelID": "235227", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/3e/de/81/westgate-towers-resort.jpg"}}