{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Beautiful hotel great service and close to everything”", "Author": "Twinmommy123", "ReviewID": "UR128471639", "Content": "We had a double supreme room and it was spacious. Breakfast is included and you can have it delivered to your room daily for no extra fee. There is free wi if and the front desk is extremely helpful. It is very close to San Marco plaza and very near most attractions. We had a lovely time and would go back here in a heart beat!", "Date": "April 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Quaint Hotel in the heart of Venice”", "Author": "Sylviane D", "ReviewID": "UR127803926", "Content": "3 days in Venice are not a lot, so you want your hotel to be where the action is. Hotel Flora is perfectly located: 2 to 3 minutes away from piazza San Marco in a quiet street and a short walk from 2 Vaporeto stops. The family hotel is small and very cozy. You simply feel at home surrounded by old wooden furniture. The welcoming staff is extremely friendly. Breakfast is served in a salon filled with photographs of local beauties from the family's previous photo business. Notice the tables and chairs that seem to come from a doll's house!!! Too cute! Why did we pick that hotel among all others? because of its garden, a peaceful private green enclosure in this stone city. The hotel also offers free internet (but be careful as we got hacked...after all it is Venice) and a gym. We got the family suite with its own entrance. The suite is composed of 2 rooms and 2 bathrooms. Like the chairs and the tables, the bathtubs come from the same doll's house. Tiny bathtubs where you can barely fit your whole body (petite size) forcing your knees in your mouth and most of your body out of the water. Suggestions to improve the bathrooms were made!! For a place like Venice, Hotel Flora is definitely a place to remember.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arlington, Virginia, United States", "Title": "“Comfortable, close and scenic”", "Author": "Teresa_DAnna", "ReviewID": "UR126729578", "Content": "Everything was exactly what you wanted in a hotel. The view from our room was their cute little garden piazza. Our bed was comfortable. Our down comforters kept us warm in the Venice spring. Their breakfast was tasty, and their waitstaff curtious. It was everything you wanted for tired feet after being pleasantly lost for hours walking through the maze that is Venice. One thing to note though. My boyfriend is an uneuropean 6ft tall, which makes it tough to shower in their tiny little bathroom.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Charming Gem of a Hotel”", "Author": "JamesE99", "ReviewID": "UR125384810", "Content": "Stayed here for 3 nights on our first trip to Venice. We were totally impressed with the location, charm and service of this lovely hotel. In particular the personal and welcoming service from every member of staff, which was exceptional. Would recommend it to everybody", "Date": "February 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "USA", "Title": "“still a charmer!”", "Author": "RomeHome", "ReviewID": "UR124750730", "Content": "the Hotel Flora has become my go-to hotel in Venice: you can't beat the location, the staff is wonderful (for the most part), and the charm of the hotel unbeatable. The hotel isn't on a canal so don't get your hopes up, but it is down a quiet little alley, right next to Bulgari, and is truly a hidden gem among Venice.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Swanley, United Kingdom", "Title": "“A Truly Magical Little Hotel”", "Author": "dwwright", "ReviewID": "UR124583606", "Content": "Its was our first visit to Venice, the position of the hotel is prime and everywhere is within walking distance. We stayed in the height of winter the temperture outside was well below 0 but the room was nice and warm and cosy. We had breakfast delivereid to the room at no extra cost, nice breakfast of croissants, bread, cereal, yogurt & coffee, a great start to the day. We used the waterbus(Alilaguna Lines) from Marco Polo airport it cost 25 euros return & takes about an 1 hour 15mins. The hotel staff are very polite and helpful, after a long day walking around venice it was nice to go back to the hotel bar for a beer & a bellini from our charming bar tender. A good tip is to turn left from the hotel away from San Marco where the bars & restaurants were alot more reasonable. A truly magical little hotel, you will love it!", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "san anselmo, CA", "Title": "“A lovely hotel in true Venice style”", "Author": "telegirl68", "ReviewID": "UR123312518", "Content": "I was here for 2 nights with my daughter, and my brother with whom I shared a room, and my brother and his wife. It's hard to find if you're not used to Venice, but an easy walk from the vaporetto stop (sorry, I forget which one), even with roller bags (we each brought one small roller bag, so we weren't over-burdened). Perfect location from which to walk Venice, very close to Plaza San Marco, etc. The hotels down a tiny little alley which is charming, we took many photos before we even got to the hotel! Nice lobby, elegance but mini-sized, like most European hotels. Very polite and knowledgeable concierge who always addressed us by name and sent us to two wonderful restaurants. Our rooms were small, with that very Italian aesthetic, less opulent than Parisian hotels, but nicely furnished. Great linens, very clean, a view down into the courtyard where they serve breakfast. Tiny bathroom, but comfortable and serviceable. My brother is 6'1\" and didn't have trouble with the size of things. We got settled and went down to the bar for a glass of prosecco before taking a walk. This little lounge is also very charming, and we were given some snacky things. The chairs are low tables are small, but very pretty, well maintained. Service here was impeccable. The breakfast was quite good, great coffee, eggs cooked well, good bread, fruit. I think they had some nice meats and pastries as well. I thought the price was in line with Venice hotels of this ilk. Everything is expensive when travelling in Europe, and this was high season. I bet they'd give good rates for off-season travellers. I'd definitely recommend this hotel unless you dislike small spaces, in which case, you might want to avoid Europe altogether!", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Raleigh", "Title": "“Most Charming Hotel in Venice”", "Author": "professorRaleigh", "ReviewID": "UR122821622", "Content": "We've been to Venice several times and have stayed in 6 different places, but we keep going back to the Hotel Flora. It is absolutely our favorite and first choice from now on. The location is so central between San Marco and the Rialto. But, the best part is its ambience and charm. Just precious. Great service, too!", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Littleton, Colorado", "Title": "“Garden Oasis”", "Author": "Sue L", "ReviewID": "UR121532011", "Content": "We picked the Hotel Flora after much research, and on a Rick Steves recommendation. We stayed in the Family suite (two couples) which included two bedrooms and two bathrooms at a rate cheaper than two separate rooms. The rooms and bathrooms are very tiny but it seems that is common in Venice. What makes it worthwhile to stay here is the lovely garden area where we had breakfast and afternoon drinks. Service was wonderful - thanks to Stefano. The location was perfect - a short walk to San Marco square, and convenient to everywhere else we wanted to go. When you first arrive, look for the small Hotel Flora sign on the building at the entrance to the narrow walkway that leads back to the hotel entrance. On a side note: We highly recommend attending an opera performance at the nearby Musica Palazzo. We attended La Traviata and it was an experience like no other!", "Date": "December 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Great location but chose for the right reasons”", "Author": "BuckeyeChef", "ReviewID": "UR121316321", "Content": "I booked this hotel without knowing much about it. Last time I was in Venice I was a starving graduate student staying in hostels so this seemed fine enough and the location could not have been better, right next to piazza San Marco. We chose a larger room for 220 euros per night since we are familiar with the space constraints of European hotels although I saw the smaller rooms and they seemed fine enough for the price (much lower than our rate for larger room). However, I chose hotel Flora specifically because they have a gym but that was a bit disappointing. Perhaps Hotel Flora can charge more for the fact they have a gym but there is only one treadmill and it is reserved for their private training clients and we could never get on it. Next time, I would book a room in Venice through a third party engine to get better comparative pricing for the area. Breakfast was great and they have a lovely garden but it was too cold to enjoy it. Basic things like the size of the seats in the breakfast room may not work for the average American and the bathrooms are tiny no matter want room you get. The staff was nice and informative directing us to restaurants, tours and taxis. We ate at the restaurant across the street, la Caravalla at the hotel Albergo Saturnia and would consider staying there next time. They have nicer common areas and slightly nicer rooms for less money during the winter. Their restaurant and cocktail area adds a lot to the experience albeit expensive but it is Venice after all! Hotel Flora could easily be better than other hotels at it's price point in the area by making some slight improvements to the amenities that have, especially the gym which is in a beautiful building next door. Adding another treadmill to the gym, adding directional signs to find the gym. Adding more pillows for the rooms, at least the larger rooms and updating the bathrooms a bit to include new hair dryers. Overall it is a nice place and we would recommend it.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oviedo, Spain", "Title": "“really special place”", "Author": "Cathe d", "ReviewID": "UR121259382", "Content": "We stayed 4 nights at the Hotel Flora and our stay was gorgeous. The location can't be better as you are few steps away from San Marco square but in a quiet narrow street out of the main passage. Our room was perfect, confortable, clean and beautifully decorated with an incredible view over Venetian roofs and gardens. Overall they help us with usefull suggestions regarding what to do and what to visit ...we discovered hidden venetian treasures. Also the Gym studio is very nice and their personal trainer really helpfull. The Flora was a perfect choice.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Madrid, Spain", "Title": "“Just a magical experience”", "Author": "Valerie I", "ReviewID": "UR121249685", "Content": "We had the most amazing time, the staff was so kind and helpful ( it was are first time in Venice) the location its simply priceless and the ambiance at the lovely garden just magical and peaceful, the room.... so romantic, we are definitely coming back for Carnaval To Hotel Flora. We loved it ! Valerie & Jack", "Date": "November 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fort Collins, Colorado", "Title": "“A quiet oasis in the middle of the hubbub”", "Author": "CharlesRevier", "ReviewID": "UR120765268", "Content": "In addition to the Rick Steves recommendation, we were attracted to this hotel by their charming Web site. Unlike some of the other Trip Advisor reviewers, we were not disappointed. My wife and I, our two daughters and their husbands, and our baby granddaughter stayed here for 5 nights in early August. The hotel met our expectations perfectly. The garden was just as it looks on the Web site, a beautiful spot for breakfast. Yes, the breakfast is Continental, but it met our needs and had enough variety that we did not get bored returning for 5 successive mornings. The staff were extremely helpful with every question I came up with. Although I usually took the stairs, the elevator was very welcome at times. I thought the furnishings and decorations in all the public areas were lovely. The rooms were small, yes, but I thought the furnishings were nice and the bed very comfortable. The rooms were always very clean. The location is fantastic--a five-minute walk from Piazza San Marco along the busy and crowded Calle XXII Marzo, but the hotel is some 200 yards away at the end of a tiny, quiet side street, and returning to it after a busy, exhausting day of sightseeing always felt like returning to a peaceful oasis. And the wireless Internet always worked, which is more than I can say about some hotels. But here's the clincher for me. Honesty?! I made the reservations by email, and the hotel's confirmation promised us a Rick Steves discount. I didn't have a chance to review the amount we should have been charged when we checked out; I just signed the credit card charge slip and we left. When we got home, I discovered that the amount of the discount was 45 euros less than I thought it would be. With some trepidation, since I had signed the charge slip without a quibble, I emailed and asked that my account be credited for the additional amount. To my relief, they replied promptly, readily admitted their mistake, and gave me the credit on my credit card. I was very impressed with their honesty and willingness to make things right. So as far as we were concerned, out stay at the Hotel Flora was a delightful experience!", "Date": "November 18, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Florida", "Title": "“Rick Steves please remove this hotel from your book”", "Author": "sunsetsail", "ReviewID": "UR120403284", "Content": "This hotel is in need of a serious makeover. We had room 5 and if are brave enough to stay in this hotel, definitely ask for another room if they give you this one. The room was small like all in Venice but the bathroom was tiny. You had to sit on the toilet sideways because there's not enough room between the toilet and wall. The shower is so small that you have to open the door to bend down if you drop the soap. Washing your feet is a challenge. And I am a thin person so anyone who is big will have a problem even fitting in the shower. The room was not very clean and the furnishings were old. The safe is not much bigger than a cigarette pack so was pretty much useless. But the thing that surprised me the most is their lack of honesty. I left a tablet computer in the room and when I called and told them exactly where they would find it, amazingly it wasn't there. i even offered a reward to have this returned but their response was that I must have left it somewhere else. I would not have expected a family owned hotel to steal from their clients. We stayed here because of the recommendations on this site and the info in Rick Steve's book but I now see that the reviews here are not as favorable. The location was good but there are plenty of other better hotels in the same area. Breakfast was included but the selection was very limited. I would not. recommend this run down hotel.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Neuenhof, Switzerland", "Title": "“Great location, garden and service”", "Author": "Zosh_11", "ReviewID": "UR120390776", "Content": "This was our third time back at the Flora, which distinguishes itself by its superb location, friendly service and lovely garden, which is a real haven of peace and quiet in the middle of a busy little city. I had booked for a \"Biennale package\", which apparently the hotel had discontinued, but given that I had a written confirmation of what it included, the hotel agreed to cover the additional cost of the Biennale tickets. I was glad to have the written confirmation with me, however. Anyone who walks well will be able to reach any part of the city within 45 minutes from the Flora, and as one gets father and farther away from the center, the number of tourists appreciably declines. Further, the place is within 5 minutes from the boat dock to the airport, so if your suitcase is heavy, you needn't take haul it up and down too many bridges. The Flora service was nice: friendly and accommodating. Breakfast includes fruit salad, yoghurt, crossiant, toast, cereals, and juice. For an extra fee, you can order scrambled eggs, which someone in the guest book wrote were \"the best in Europe\". While we have always come in November and had found Venice dry, there was \"high water\" this year.. so we had to buy rubber boots on the first day. It was an experience.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Hotel Flora - Not Recommended!”", "Author": "deRohan", "ReviewID": "UR119999006", "Content": "I have stayed in Venice on a number of occasions and I always like to experience a new hotel on each visit, but I did not enjoy this hotel one bit! We all know and accept that Venice's uniqueness often requires compromise and a degree of understanding with accommodation standards in all categories. I was attracted to Hotel Flora due to its reputed charm, only to discover to my disappointment that it is one of those hotels that features beautiful rooms on its website which do not match reality! I stayed at the hotel for 5 nights in a spartan, single room (200 Euros per night) and in my view, the hotel is tired and needs refurbishment. The room was shabby with cheap, spartan furnishings, dirty walls and with small stained, threadbare rugs on the timber floor. The bathroom was tiny (as are most in Venice) with a cracked handbasin and toilet flush mechanism that fell apart every time it was used. The bed was one of the worst I have slept in at any hotel - ever. It comprised two very short single mattresses pushed together on a double base to form a very small double bed. The mattresses were raised at the centre join and sloped down towards the sides, so you constantly had the sensation that you were going to roll off the edge of the bed. The mattress was hard, lumpy and uneven and two pillows provided were old, hard and flat in the middle from overuse. I am average height but the bed was too short for me. Both bed and pillows were way past replacement date!! Perhaps worse - the wall adjoining the next room was so thin that I could clearly hear all conversations and activity (you can use your imagination here) of the two guests next door. This was disgraceful and really unacceptable. The buffet breakfast was sparse and with very few choices and many very basic breakfast items that were included on the buffet of other hotels I had stayed in within this category had to be ordered and paid for as \"extras\" and they were not cheap. (For example: Ham 8 Euros, scrambled eggs 6 Euros, Bacon and eggs 8 Euros, Salami 7 Euros, etc.) This gave an impression of meanness and money-grabbing. On a more concerning note, my room was on the top floor of a wing at the end of a corridor with no exit. In the event of a fire, I would have had no escape route. Had I not pre-paid my accommodation, I would most certainly have checked out. I would not recommended this hotel to anyone.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Adelaide", "Title": "“Charming Little Hotel”", "Author": "Boyfromoz_8", "ReviewID": "UR119929990", "Content": "We spent 3 nights at Hotel Flora early in October. We had a smaller room booked for the first night and then a larger one for the next two. Both were neat & clean and presented in a traditional manner. The staff were excellent and attended to everything required. We particularly enjoyed the breakfast in the peaceful courtyard each morning. We'd be happy to stay at Hotel Flora if in Venice again.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montana", "Title": "“Great location”", "Author": "lc5528", "ReviewID": "UR119718507", "Content": "We chose to stay at the Hotel Flora because it was close to where friends were staying, but much less expensive. There were three of us, and the room was small, but there was still enough space for all of us. The bathroom was narrow, but clean. The beds and pillows were hard, but usable. Overall, this was a nice, quiet place to stay in the heart of Venice. The front desk helped us make dinner reservations and provided us with directions. The garden is very nice and the breakfast is good.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“The Emperor's New Clothes”", "Author": "Linda M", "ReviewID": "UR119510958", "Content": "The Emperorâ€™s New Clothes I am wondering how so many good reviews have been posted on Trip Advisor about the Hotel Flora. Like the Emperorâ€™s new clothes, I was just not able to see it. Perhaps there is a section of the hotel we did not know about. Based on Trip Advisor reviews I made a reservation for October 10th-13th for my daughter, my granddaughter and myself at the Hotel Flora. Our accommodation was the family â€œsuiteâ€�; two very small adjacent rooms with two bathrooms. The small part I could live with since European hotels are sometimes like that although these were miniscule. However small spaces can certainly be fresh and charming, but unfortunately these rooms were not. Both of the bathrooms had peeling paint and cracked tiles. The door handle in the smaller bathroom fell off the door repeatedly; once I was locked in. The curtains, rugs and furniture are in serious need of updating. The rugs in particular need to be changed. Shabby, depressing, and run down would properly describe our rooms. Upon check out, I mentioned my disappointment to one of the managers who responded with this, â€œpeople who stay in the family rooms with children do not care about the decorationâ€� REALLY? I wanted my 11 year old granddaughter to feel our trip was special but instead I was mortified that I had chosen the Hotel Flora. When we checked out I suggested the management take a walk upstairs for a hard look at our rooms. My guess is that nobody had seriously evaluated them for a quite a while although after the fact, I did notice similar criticisms about hotel accommodations on Trip Advisor. To my surprise, the hotel â€˜s Trip Advisor responses seem to focus on how serious they are about the hotel and to blame the guests for not letting them know about these problems. Asking for extra towels is one thing but it is not the responsibility of the guest to inform the management of cracked tiles, dirty rugs, and peeling paint. The management needs to be concerned with and on top of that constantly. Restaurant recommendations were simply non -existent. Three nights in a row different front desk staff suggested the same restaurant which we walked out of the first night when the waiter asked us which hotel sent us. You can guess what that meant. Why didnâ€™t we check out? Our time was very limited and we had plans every day that did not include searching for and moving to another hotel. The location is great. The cappuccino was very good. I would be embarrassed to recommend the Hotel Flora to anyone and would certainly never return. Maybe there are nice rooms somewhere in the hotel but I wouldnâ€™t take a chance. Like the Emperorâ€™s New Clothes, I just did not see it.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Gatos,California", "Title": "“Venetian charm”", "Author": "LosGatostraveler", "ReviewID": "UR119482885", "Content": "My daughter and I each had double rooms for single occupancy at our \"home in Venice\". They were very quiet and the air-conditioning adjusted to the desired termperature. A perfect experience began with the concierge arranged transfer from Marco Polo airport. A driver met us as we exited , having seen no customs or immigration authorities, and took us and our baggage to his SUV. He drove us to Piazze Reale and then escorted us to our private water taxi. What a lovely ride through the Grand Canal at twilight to a stop near our hotel. There the porter, Manuele, helped us make a great leap up to the bank and took our bags. Never could have done it without his helping hand. When we left after a week the concierge again arranged a private water taxi to the train station. Throughout our stay every need was beautifully taken care of. If we returned after a day of sightseeing too tired to go out for dinner, Vicenzio the factotum served drinks.prepared a light repast and served it., all with a sincere smile. At breakfast the waiter told me where my daughter was sitting and brought a cappucino without being asked. The housekeeper was a stylish sight with her pink uniform and elegent coiffure. All in all, our stay was so enjoyable we regretted leaving.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Maldon", "Title": "“good location”", "Author": "Daisymaisy_10", "ReviewID": "UR118558495", "Content": "What a lovely hotel tucked away behind the scenes. Only 5 mins walk away from St Marks. Our room was quiet and comfortable overlooking the garden. The garden is a charming place to have breakfast or just sit and enjoy the ambience. The staff were very helpful. The room and bathroom were very clean as were the bed linen and towels. Lots of nice toiletry goodies in the bathroom. Shame we only had two nights there.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cardiff, Wales", "Title": "“Venetian style in the heart of Venice.”", "Author": "Gwelly", "ReviewID": "UR118546998", "Content": "Stayed here for two nights in September. Easily reached from the Alilaguna line but I would recommend one of the faster methods from the airport for a little more money. A good welcome at reception and help with our small amount of luggage. We stayed in a \"corner\" room, very spacious and comfortable. Bathroom narrow and long, some would say small! If you are very large not the place for you! Decor Venetian style definitely not chain-hotel style. We took aperativos in the terrace - a veritable oasis away from the throng of tourists. Giovanni's recommendations for Osteria's etc were very good...especially if you are after fish and away from the crowds. Breakfast was again taken on the terrace - a very good selection of fresh fruit, cereals, cold meats and pastries. All in all a very good place to stay close to San Marco's. Would recommend.", "Date": "September 24, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Hoboken, NJ", "Title": "“Fabulous location - quiet & beautiful”", "Author": "ELP98", "ReviewID": "UR118266184", "Content": "We spent two days at the Hotel Flora with our daughters. We were delighted to arrive and discover we were in a family suite with the girls having their own room - AC worked well. Breakfast on the patio was a perfect way to start the day. It is a very short walk from San Marco square (opposite the Duomo/Pitti Palace) off one of the fanciest shopping streets. We would definitely return!", "Date": "September 18, 2011"}, {"Ratings": {"Location": "3", "Overall": "3.0", "Value": "5", "Service": "2", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“good value in expensive Venice, rooms are perfumed”", "Author": "jooleea", "ReviewID": "UR118097333", "Content": "We had a satisfactory experience staying here for two nights in early January. We stayed in the lowest price room, and it's a good value for such an expensive city. Our room was actually larger than I expected, and breakfast is quite good in a charming sitting room. Front desk service was sufficient, but not that helpful, and as stated by other reviewers, their restaurant recommendation was incredibly touristy and terrible. My issue with this hotel is the smell. When we arrived and entered our room, it smelled like the housekeeping staff had sprayed the place with a bottle of cheap perfume. I suffer from allergies, and the smell was enough to give anyone a migraine. I called the front desk, and they sent housekeeping to change the sheets, which helped, but not much. We kept the window open the three days we were there (in January!) and it never aired out. Maybe you can request in advance - no perfume!", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Great location, helpful staff, comfortable room”", "Author": "Mimia2", "ReviewID": "UR117974790", "Content": "Our room was quiet and comfortable with enough room to fully unpack for our 3 day stay. The room and the bathroom were very clean, with nice linens and soaps. The front desk staff were very helpful and provided excellent advice on restaurants and directions. The breakfasts were nice and served in the inner courtyard garden which was charming. Our only complaint is very minor. The free wi-fi was difficult to access from our room which was down a hallway towards the back of the hotel. Some days we had to go into the lobby to connect, which was somewhat inconvenient, however, there was a small parlour adjacent to the lobby where we could sit as we worked on our laptop.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney", "Title": "“Unbelievable! An amazing gem hidden in the best part of town!”", "Author": "BelleBearSyd", "ReviewID": "UR117967873", "Content": "We stayed at Hotel Flora for two nights in August, just on a whim. We booked the hotel the morning of leaving Milan and didnt hope for much, what with it being peak season, gorgeous weather, and a last minute booking. This hotel is AMAZING! It's right in the snooty part of town, tucked down beside Bulgari, Burberry, etc. The staff are amazing, the most friendly people in Italy, but I guess that's because the hotel has been family run for decades. The establishment itself is pure old-world class. Everything was perfect, the beds the BEST in Europe, as are the pillows! Breakfast in the courtyard is stunning. If we could live here and never go back to reality we'd be the happiest people on earth!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Cozy find that feels like home”", "Author": "GeorgicaPond", "ReviewID": "UR117962396", "Content": "A wonderfully cozy boutique hotel that makes you feel like you are staying in a private home. Small, but charmingly furnished room, lovely breakfasts in the beautiful private garden, and a delightfully friendly concierge in Giovanni who goes out of his way to be helpful day or night. The hotel has a great location.....one block in from a private water taxi stop and an easy 3 minute walk from St. Mark's Square, yet just far enough away to be out of the madding crowds. This is the place to stay when you want to relax and disappear without fuss. It has none of the grandeur, room conveniences (including sufficient outlets) or full restaurant services of the top hotels. In the nicest possible way, you feel like you are staying at your dowager grandmother's private residence and that she has instructed her staff to make sure you are happy. What you forgo in luxury you make up for in intimacy. We loved it.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Jill1354", "Title": "“Charming and central”", "Author": "Jill1354", "ReviewID": "UR117671390", "Content": "Hotel Flora is midst the designer shops and a stone's throw from San Marco - also an easy walk from the airport ferry - yet does not break the bank. The hotel staff are absolutely charming, and the garden is a perfect retreat for al fresco breakfast and a cold beer any time. The room we stayed in was small but perfectly adequate. The bathroom (behind a space-saving sliding door for very good reason) had an excellent shower but no room to swing the proverbial cat; however for a couple of nights this would not have been a problem. Hotel Flora is pretty and elegant and a great choice for a short stopover in Venice.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Perfect location, delightful setting”", "Author": "Astrobenandemily", "ReviewID": "UR117247891", "Content": "A brilliant location, a short walk to St Marks. Very quaint hotel, small rooms, but that's to be expected. Wonderful outdoor dining / garden area, staff were fantastic.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Fresh Meadows, New York", "Title": "“Romantic at any age”", "Author": "archiebeck", "ReviewID": "UR117040040", "Content": "This hotel is beautiful, clean, friendly. Well located, yet quiet at night. And Oh that blood orange juice for breakfast", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Loved this hotel!”", "Author": "Megan M", "ReviewID": "UR116905622", "Content": "Great location, excellent staff, breakfast was delicious, and our favourite part was the \"oasis\" garden sitting area. Also, the room was spacious for our family of 5!", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Melbourne Australia", "Title": "“Loved it and hope to return”", "Author": "Colourqueen", "ReviewID": "UR116878754", "Content": "Delightful hotel, with lovely staff. Nothing was too much trouble for them, in fact after we left and got to the other end of Italy, I realised that I had left a bag of shopping there under a chair in our room. I phoned Roberto and he tracked it down, and kindly arranged to have it posted home to Australia for me. Now that really is service! But more about the hotel, upon arrival everything was swift, we were checked in and bags bought up to our room promptly. As we were travelling as a couple and our 15 year old, they gave us a \"sort of\" apartment. It was actually 2 rooms, each with its own bathroom, both rooms come off a private corridor that can be securely locked at night. Fantastic for families, and nice and quiet at the end of a hallway. Breakfast was served in the dining area/bar, loads of food to choose from. The staff reminded us a bit of faulty towers, the way they rushed around sorting tables, and extra chairs for guests, but much more politely than Basil Faulty. Very clean hotel, it was in a good central location, not far from restaurants, and shops are everywhere. I highly recommend it.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Waldwick, New Jersey", "Title": "“Very nice hotel in Venice”", "Author": "timbosul", "ReviewID": "UR116106616", "Content": "We stayed at the hotel for three nights. It takes about 5-10 minutes to walk to it from the ferry stop. Its tucked down a small alley so you have to look up to find the sign. My travel agent gave us a map that made it a little easier. We had a very nice room that overlooked a beautiful courtyard of another property. The hotel is perfectly situated and is about a 2-3 minute walk from San Marco Square, 5-10 minutes to Accademia bridge, 15 minutes to the Rialto Bridge. Its about a 40-45 minute ferry ride to the train station. The hotel staff was very friendly and spoke very good English. The breakfast service was superb and they brought coffee and cappuccino to you. Our kids got hot chocolate and they grated chocolate over the whipped cream. We asked the hotel staff for restaurants on two occasions and both were great dinners - and not overly expensive. The hotel was our favorite of three that we stayed at during our vacation. We would definitely recommend it and would stay there again.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Exceptional”", "Author": "IanRoss82", "ReviewID": "UR116085299", "Content": "This was the most expensive hotel during our Italy vacation... but definitely worth it for about $210/night for a double. Tucked down a small lane, this hotel lived up to recommendations on Tripadvisor and Lonely Planet. The patio garden was wonderful as an afternoon retreat from the Venice crowds. The service was exceptional.... very helpful and colourful. The rooms were great with soft beds and little noise. The breakfast buffet was tasty. The bar and fitness centre were very nice. But the location... minutes from St. Mark's Square was the biggest bonus.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Return Trip After 25 Years!”", "Author": "Catsitter", "ReviewID": "UR115769803", "Content": "It was easy enough to find this hotel . Take the water bus to San Marco Vallaresso, take a right at Harryâ€™s Bar, a left at the end of the street, haul your bag over the bridge at San Moise (said to be the ugliest church in Venice, if not in Italy), and turn left down the small alley just past the Bulgari store. And there it is, the Hotel Flora. I stayed there in 1985 on my first visit to Venice, and not much has changed. I booked a single room, knowing that it would be small (and it was!). But then, I wasnâ€™t there to spend time in a hotel room. It's got a nice bed, a shower, a TV (mostly Italian) and air conditioning. What more does a single woman need? One reason I chose to come back to the Hotel Flora is that you can have a â€œlight dinnerâ€� served by the bar manager (Vennichio). I donâ€™t mind traveling alone, but I really donâ€™t like going out for dinner alone, so this was a perfect solution. Vennichio gives me the dinner options, I select the time, and I have a little table in the garden or lounge for my dinner. On my first night, I was the only one dining this way, and enjoyed my gnocchi with artichokes and insalata mista, with a bellini to start, at 9pm. The humidity was very high, and the mosquitoes discovered that I was in the garden, so I slipped inside after finishing dinner, and sat in the lounge with a glass of prosecco to do some reading. The lounge is like an old style parlour, with leaded glass windows, old area rugs, ornate red upholstered furniture, wood spindle tables, lace doilies, Murano glass chandeliers and velvety fabric wallpaper. Oh yes, and air conditioning!!! I found out that most of the staff have been here for many years, and likely were the same people serving me 25 years ago (including Vennichio and the front desk manager). In fact, Vennichio commented that he probably tried to pick me up 25 years ago. I said, \"No, I donâ€™t think so -- I was here with a man. But then, you are Italian, so maybe you did try!\" As I was coming down the stairs from my room for breakfast a couple of days later (they make perfect cappuccinos and the garden is amazingly beautiful), I heard the man at the front desk saying to the breakfast manager something about \"bella donna\" and \"quattordici\" (my room number is 14). I love this hotel! Others were asked for their room number, but they treated me like a queen. Although traveling solo can be lonely at times, itâ€™s times like at the Hotel Flora that makes it a great way to go! The only slight negative was that the wireless Internet was inconsistent. The best place to find a signal was in the lounge or lobby. But again, Venice is to discover, not to sit around and surf the Net!", "Date": "July 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Charming hotel in a great location”", "Author": "786ZHR", "ReviewID": "UR115586034", "Content": "We arrived for a 2 night stay in beautiful Venice on our anniversary. From the airport using the Alilaguna shuttle, an easy walk from the San Marco stop, over a couple of bridges, along an elegant street leading to the main piazza, and down a quiet alley leads you to this hidden and quaint hotel. Staff are very polite and helpful but we found the room to be slightly small and the bathroom the size of a spacious closet. Decor makes up for this, as the interior is tastefully done. The best part of the hotel is the enchanting garden, providing a peaceful retreat from which a scrumptious breakfast can be enjoyed. The neighbouring palace is rumoured to be the home of Desdemona from Shakespeares tragic Macbeth, indeed a romantic place, one we would love to return to some day and would recommend as a choice of stay. All in all, value for money considering the steep prices for accommodation in Venicem", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New Jersey", "Title": "“Absolutely Charming”", "Author": "cjc1261", "ReviewID": "UR115456428", "Content": "This hotel was filled with old world charm. The accommodations were clean and the staff was pleasant and very helpful. They saw that all of our transportation and touring needs were met in a timely fashion. The gardens are beautiful. A must for your to do list when in Venice.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "4"}, "AuthorLocation": "Scottsdale, AZ", "Title": "“We won't stay here again”", "Author": "dahlialady", "ReviewID": "UR115255683", "Content": "The hotel was not worth the money we spent to stay here. Our room was very rundown, sparce and the bathroom door kept swinging open. Right outside our window, guests were dining. We could hear the people talking and the smoking would drift into our windows. We had to keep the windows shut. The wait staff was nice and the breakfast nice.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Elkin, North Carolina", "Title": "“A Hidden Gem”", "Author": "balddoc", "ReviewID": "UR115230472", "Content": "Just off the main drag we found the Hotel Flora, a real charmer. Great, helpful staff, always accommodating. The rooms are charming, quiet and well appointed. Breakfast (included) is bountiful and delicious. Quite reasonable for central Venice. A must stay.", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“ADORABLE hotel, PERFECT location. SWEETEST breakfast spot!”", "Author": "2011Italy", "ReviewID": "UR115135209", "Content": "We loved this hotel. It was perfect for our family. We had 2 rooms with a shared funky little hallway, doors kind of opening every which way. Charming. 2 bathrooms was nice but the SMALLEST bathtubs with a strange slanting base (it is rather alarming and a little dangerous!) which are also the base of the shower so be careful! Free wifi is a great plus! Wonderful breakfast setting in their inner courtyard garden. Walk to San Marco in 5 minutes and you are in the heart of Venice. Friendly and helpful front desk staff. Highly recommend!!", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Singapore", "Title": "“The Flora was perfect - loved Venice - we'll be back!”", "Author": "LuxurynCulture", "ReviewID": "UR115020557", "Content": "We booked our rooms way ahead in December, as it was for during the season of Biennale, and wisely so - the rates just shot up after January (and note that we stayed in June !) . The booking was handled very professionally and promptly, and when I sent an email to ask for a quiet room, they replied almost immediately to say they would make sure I got a nice room, that was very nice of them. I booked a deluxe double for myself and it was luxurious, a treat. The hotel is only a 5 minute walk from the closest vaporetto stop, and off a posh shopping street, the lane being next to the Bulgari shop, no less. It was a welcoming sight, with the ivy (?) hanging off the walls and their garden just like it is shown on the website. In fact the hotel is nicer than what the pictures show - it is brighter, and we were never bothered by birds. The airconditioning (important in the summer) worked perfectly, and the staff were always attentive and friendly., especially the breakfast staff. Upon arrival, check in was smooth. My room was on the third floor, it looked into the garden, it was quiet, had lovely shutters for the night, one of the the cleanest bathrooms I've seen in Europe, and of a good size. Brilliant shower. The bed was a queen, good mattress (firm) , the TV worked and the room was well lit. Perfect, I could not have asked for more. The public areas were also well-kept, clean, and no-smoking throughout. The hotel and my room were both great to return to, when it got too hot or for an afternoon rest before dinner. The room was always made up perfectly whenever I returned to it, and they sprayed it witha lovely scent too. The hotel is near everything. In the morning, you would be woken up by the sound of birds chirping. Breakfast (if you managed to drag yourself out of bed in time) was a generous selection of breads, eggs, yoghurt, juices, fruit, whatever your morning beverege, toast do-it-yourself. In a cheerful breakfast room off the garden, and you could choose to sit outside if you wanted to. There was free wi-fi, and also paid internet PC off the lobby, which was very convenient, and worth the money (I am not good with fiddling with blackberries). No problems with connection. There's no restaurant but they can make you a hot meal or a sandwich if you really need to stay in. If there is one criticism, that was with restaurant recommendations. They didn't seem to want to recommend the really good ones - Fodors gives pretty accurate reviews - we tried 4 of Fodors' recommendations and they all hit home. So read up and just make your own choices. You really do not need to go to the overpriced Alla Madonna to be ushered into a room that is reserved for tourists, to be served mediocre food by indifferent waiters. We would recommend without hesitation in order of ranking: 1. Vini da Gigio - it is very special - do not miss! 2. Osteria ae Sconte - lovely and romantic , and reasonable 3. Al Paradiso - lovely setting, choose carefully, better for seafood than it is for meats. All had great wines. We spent about 150 Euros including a nice bottle of red for two of us, and we ate very well , and felt that the prices were very fair, considering that Venice is an expensive city. In summary: a) say that you want a quiet room overlooking the garden b) a deluxe double is a very comfortable size for one person c) the breakfast and internet really make a difference d) the hotel is totally ROMANTIC, very clean and very safe for a solo lady traveller even e) Absolutely loved the Flora, Loved Venice, Can't wait to return ! Choose the Flora - forget about those 5-star hotels on the grand canal - this is better.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "East Fishkill, NY", "Title": "“Utterly charming”", "Author": "nysnork", "ReviewID": "UR114957346", "Content": "Nothing is cheap in Venice. Quite the contary. So while I can't say Hotel Flora is an exceptional value, I will say we had a nearly perfect experience. It is perfectly located for a shot stay in Venice -- close to major attractions and vaporetto. (For a longer stay I'd probably not stay in San Marco area). Staff was delightful, accommodating and helpful -- and everyone spoke excellent English. Breakfast in the garden was magical. The birds flying around are perhaps a bit of a nuisance but totally add to the atmosphere. My son gorged on yogurt and ham and fresh fruit. They served him a beautiful cup of rich hot chocolate. Our coffee came with hot steamed milk. Our triple room was large enough, clean and bright, looking out on to the garden. Absolutely silent at night. Air conditioning was fine. And windows open so we had a choice of air or no air. We were in a family group of 10. My brother's family stayed in the \"family room\" which was not as pretty as ours -- the kids' room was small for 3 and a bit stale smelling. But asa family they had two rooms and two bathrooms in a suite which was great for the five of them. My parents' double( immediately below our triple) was very spacious (same as triple just without the cot) and decorated in a similarly elegant style. (Pretty typical of Venice from what I can see) My parents enjoyed a delightful dinner in the garden one night. And while they took all the grandkids on a gondola ride, we relaxed with spritz cocktails in that same quiet, cool, peaceful oasis. Upon arrival, a porter picked us up at the water taxi spot and led us through narrow alleyways to the hotel. Two porters helped schlep our bags back to the water taxi upon departure. The desk staff recommended restaurants, helped with directions, maps, phone calls, interenet etc. Always pleasant. The wifi was annoying because the time is limited and you have to plug in a code and log in and log out. But that seems to be the norm in italy. If I had the money I would definitely stay here again.", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "2.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Johannesburg", "Title": "“Fawlty Towers of Venice!!!!!”", "Author": "ehp_9", "ReviewID": "UR114795978", "Content": "Where do I start? Room was absolutely tiny , a cabin on a cruise ship is bigger than the room! Staff were extremely unfriendly , I overheard a guest telling reception that there was no toilet paper in his bathroom , the answer : look in the cupboards in the corridors and you might find some there!!!!!! I went to reception to check out at 8pm as we were leaving very early the next morning and was told that the accounts were closed for the night, I could check only check out after midnight as they had closed their books for the night! On the plus side the hotel is very charming and the outside area is very pretty but that far from made up for the awful room, which is microscopic , cramped , carpet was filthy, had a shower cap the first night and it was missing in action the next night , perhaps the room next door had run out of shower caps!!!!! Thank goodness I didn't order the Waldorf salad!!!!!!", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Kendal, United Kingdom", "Title": "“Great for a luxury treat.”", "Author": "amanda_eastwood", "ReviewID": "UR113985123", "Content": "We have just returned from The Hotel Flora in Venice after spending a fabulous weekend away with 8 girlfriends to celebrate a 40th birthday. The hotel was traditionally Venitian with an amazingly tranquil courtyard, perfect for a glass of wine and breakfasting outside. The concierge was wonderful and we gave him our requirements and he booked our meals out ensuring we didnt get caught out by what can be a very expensive poor experience. He also reccomended and arranged our walking tour and trip to the Glass factory. Inevitably we had a gondola trip which was memorable though be prepared for a 100 euros bill per boat! We all would like to go back.", "Date": "June 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Severna Park, Maryland", "Title": "“Wonderful experience!”", "Author": "debay11", "ReviewID": "UR111420887", "Content": "Had 2 days/1 night by myself, after a vacation in Italy with a girlfriend. Choose La Flora because of its great recommendations on numerous sites. Was not disappointed. I did get the tiny room, but I was by myself and did not mind. Knew I was getting it. No surprise. If you are with someone, get a larger room. People were great. Got a recommendation for dinner at a small place where the food and service could stand along side any 5 star. The hotel is in a great location. Felt safe both day and night. Hope to return with my husband.", "Date": "June 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Lovely Hotel”", "Author": "freckledsmile99", "ReviewID": "UR111163075", "Content": "My best friend and I stayed here for over a week and what a great time we had! The Romanelli family and staff were friendly, helpful and steered us in the right direction when we asked them where to go and what to do. Giovanni and Stefano specifically were terrific. The courtyard where you have breakfast every morning and where we read our books on many an afternoon, is just lovely! I hight reccommend this hotel!", "Date": "June 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tucson, Arizona", "Title": "“classic”", "Author": "1st-timer2010", "ReviewID": "UR107422925", "Content": "Great location, 5 minute walk to Piazza San Marco. Wonderful patio, surrounded by vine covered walls and fencing. Excellent place to chill at end of day. Typical european rooms styles. They hooked us up with reservation at a restaurant that said they had no availability at all for night we desired. Room was warm at night, as we were on top floor. Typical \"feel good\" thermostat control in room had no apparent impact. What I find common in Europe, by the way.", "Date": "May 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "qld", "Title": "“Charming”", "Author": "dollyQld", "ReviewID": "UR107315284", "Content": "Absolutely charming,wonderful staff and perfect location. Rooms are olde world so don't expect a chain hotel experience. This is better", "Date": "May 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "finland", "Title": "“Enjoyed our stay”", "Author": "joe57", "ReviewID": "UR104667614", "Content": "I read the reviews and knew what to expect. For a hotel in Venice, I didn't expect large rooms and all the modern facilities. Look at the pictures at the hotel's site, it looks and feels like that in real life on location. We enjoyed the look and feel of an Venetian palazzo. And the friendly service. You will also like the central location close to everything in San Marco. Good beds to sleep well in. However, note the small bathrooms. Everything was clean and worked well. Our room faced the small alley leading to the hotel and some noice could be heard as the alley echoed voices. But after a day's walking I never woke up a night!", "Date": "April 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Hotel Flora helped me complete a \"Decent Proposal\"”", "Author": "mzimmerman2", "ReviewID": "UR104588104", "Content": "Venice was the centerpiece of a two week European vacation. It was in Venice that I was going to pose that matrimonial question and I had the image of how I wanted to orchestrate the evening, but I was going to need help with some details leading up to \"the ask\". The staff at Hotel Flora (Giovanni in particular) were just the perfect resource and they had no idea of my agenda. They just were doing their job as only they know how. \"I need a romantic restaurant for the two of us this evening.\" \"How Romantic?\" \"Very\" \"I have two choices, \" he replied as he gave me a fairly detailed overview while showing me locations on the map. He dialed immediately to secure a reservation while we waite. The one I selected at his recommendation was spot-on perfect for a dinner of this significance. 4-Star Gourmet ++. Quiet. Out of the tourist traffic. Modern, yet warm and intimate. As we sat at a corner table, a jacketed waiter flicked his lighter to ignite a long candle taper on our table. And from that point on it was surprise after surprise. A young husband and wife own and operate the establishment. As a sommolier he matched a wine to our appetizers and entre' selections. Now the lone required component to this evening was a gondola ride where I could ask the question in a quiet Venetian canal. It's not peak tourist season so these gondoliers pack up early. The couple who owned the restaurant summoned a personal friend who is a gondolier, and he agreed to meet us at the restaurant; walk to his gondola and at 10:30pm at night we were the lone boat traffic in the canals near San Marco. It could not have been better scripted...until the gondolier dropped us off at the Hotel Daniele (See movie: The Tourist)...told us to buy one celebratory drink at the bar and just soak in the history and architecture of the lobby. As the piano player tickled the keys with a romantic ballad, our evening was complete and a success. It started with my friend Giovanni at Hotel Flora. We picked this hotel for these great features: we had access to use a health club next door...great perk when traveling two weeks without some fitness break (for us)...close to a water bus stop (key for luggage transporting through the streets...very close)...great breakfasts...historic rooms/cozy size/clean/all we needed to keep our bags, shower and sleep...quaint courtyard to sip a cocktail or glass of wine before dinner...great little bar and sitting room...computer access (fee...but reasonable)...centrally located to any sightseeing or shopping or dining you care to experience. Excellent hotel...professional staff. We will stay at this hotel the next time we return. They did a great job making us feel welcome and comfortable.", "Date": "April 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Beautiful hotel, a little hard to find”", "Author": "pilarkitty", "ReviewID": "UR104543334", "Content": "We loved the Hotel Flora. It's in a fabulous location, just a few blocks from Piazza San Marco. When we arrived in Venice, we got off at the wrong vaporetta stop and had to walk through Piazza San Marco. I logged on to the web site and it was a little hard to find based on the directions given by the hotel. If you stay there, make sure to print out a map so you know where you are going. It's next to the Bvlgari Store. We chose this hotel, because of the free wifi. We got so much more. The breakfast and bar staff was very friendly and remembered our drink orders from day to day. The courtyard was beautiful and really made you enjoy your breakfast experience. Breakfast (included) was very good. They even provided an additional menu if you wanted something more hearty. I never needed anything else than what was provided. The decor is very quaint and the rooms are expectedly small, but comfortable. The hotel could provide more comfortable bedding. I am a huge fan of the bedding at the Starwood and Marriott full service hotels.This bedding was sub par. They did provide nice duvets, but I could have used another pillow and a softer mattress. The only thing that bugged me about the hotel was that you kept having to ask for a code to access the internet. It was a slight inconvenience, and certainly did not ruin our stay.", "Date": "April 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canterbury, United Kingdom", "Title": "“Exceptional value in low season, typically Venitian”", "Author": "wesaw66", "ReviewID": "UR102788789", "Content": "A beautifully quaint hotel, very central. Staff were friendly and spoke English. The real treat was being able to have a substantial breakfast deliveried to our room, with no extra cost. Room was beautifully decorated and olde worldy. I would recommend in low season as prices are a bit steep in the Summer.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Romantic Weekend”", "Author": "birthdaytravel", "ReviewID": "UR101471843", "Content": "Fabulous weekend which had been long awaited and the Hotel Flora was a great choice which helped make the weekend live up to high expectations of Venice. Great location with everything you could want on the doorstep. Great Room that was quiet and overlooked the garden at the side and back. Friendly, cheerful and helpful staff. Good breakfasts to set us up for all the walking required when in Venice. it was lovely to stay in an old traditional environment with all comfort provided for. Would highly recommend.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Taos, New Mexico", "Title": "“great location...great service”", "Author": "wanderingtraveler60", "ReviewID": "UR100918589", "Content": "Solo traveler, stayed 4 days - all was ok, expect some noise -- don't know where you can escape noise -- but -- not bad..great service -- for the value of 80 euros a nite -- excellent deal...", "Date": "March 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Beverley, United Kingdom", "Title": "“A TRUE VENETIAN GEM”", "Author": "190813Sandy", "ReviewID": "UR100755960", "Content": "A small hotel hidden away amongst the designer shops close to San Marco, within sight of the San Moise Bridge.The inclusive continental breakfast was generous, with a cooked option offered if preferred either served in the garden, lounge or your room. The hotel bar and lovely garden were a perfect base to return to during the day or evening. The staff wthere incredible and could not have been anymore helpful. The room was very comfortable and clean.....what a gem !!!!", "Date": "March 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Minneapolis, MN", "Title": "“Fabulous!”", "Author": "sst03", "ReviewID": "UR100268774", "Content": "My husband and I stayed at Hotel Flora after reading reviews on this web-site as well as a recommendation from Rick Steve's. We got a great rate because it's off season - 125 Euro/night. I mistakenly booked at \"triple\" room thinking that it would be bigger but it was in fact a room for 3 people - oh well. Anyway, it worked to my favor because we ended up getting 2 rooms - one with 1 bed and another with a twin bed so it was kind of like we had our own \"wing\" of the hotel - rooms 41 and 42. The bed was fabulous and we both slept great. The desk agent on the morning shift was the sweetest man ever (his evening colleague not so much). Details: shower is small but amazing water pressure, everything else is pretty standard. Remember, they don't use top sheets in Europe (they're the best sheets in the world!) - just down comforters - no big deal just thought I'd mention it. The location of the hotel is not too far from the San Marco vaporetto stop. As a side note, wear flat shoes as it's easier to navigate on the cobbled streets and up and down the little bridges over the canal. The breakfast, included in our stay, was really yummy - you can select what you want and have it delivered to your room (they phone you about 5 mintues before they come up) or you can eat downstairs in their little cafe. I had coissants and yogurt each morning. I brought my own assortment of tea bags from home which made it special. Enjoy your stay!", "Date": "March 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Location, Location, Location!”", "Author": "TravlFam", "ReviewID": "UR99866186", "Content": "We were in Venice for a quick, 3 night getaway during the end of Carnival. Hotel Flora was a fantastic find! The location is superb, in the posh shopping area just two short blocks from San Marco. It is easy to miss the hotel as it is tucked inside a little walkway between an art gallery and a designer store. Once you enter the hotel, you enter an oasis of peace and quiet . Our booking had us in a standard room for two nights and final night in a deluxe room. Hotel staff made us feel welcome and cherished us as guests. We were in a standard room for the first two nights and the last night had a deluxe room reservation. The standard room was small but comfortable with very high ceilings and a beautiful Murano chandelier. We slept blissfully and refreshed to tackle each day of crazy Carnival. Our final night, in room 3, a deluxe room was fantastic. The room is featured in their brochure and frankly, I believe they must have upgraded us to a suite. What a perfect way to end a getaway. Breakfast was lovely. Plenty to choose from. Cappuccini and hot chocolates were delicious! A perfect little hotel with all the charm of Venice!", "Date": "March 12, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Henley-on-Thames, United Kingdom", "Title": "“Couldn't be better - fantastic apartment, central position, friendly, helpful staff”", "Author": "wendypenrose2002", "ReviewID": "UR98683879", "Content": "We were offered a two bed apartment in the building next to the hotel which was perfect for our family with kids age 7 and 10. It gave us extra space and even a roof terrace but with the benefit of being able to enjoy a generous breakfast at the very friendly and cosy hotel next door. All this and so close to St Mark's square too. We took a private water taxi from the airport and they dropped us a very short walk from the hotel. Carnival was on and the kids had made their own masks to wear which they really enjoyed. We were offered a free return trip to Murano to see glass making which was fun. The only draw back is that it is very expensive to eat out with the family and with fussy eaters this can be tricky. We ate a lot of pizza! It would have been ideal if there was a small kitchenette int he appartment to allow us to at least make sandwiches for lunch. The service at the hotel was excellent. The kids were very well looked after too - they even gave them a typical venetian carnival pastry for free.", "Date": "March 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "antwerpen", "Title": "“nice little hotel”", "Author": "michgile", "ReviewID": "UR97862275", "Content": "For the weekend in Venice me and my wife decided to stay in Flora hotel. And we were not disappointed. A small nice hotel in the very center of this beautiful city ( about 5-7 minutes from San Marco square). Our room was rather small, but really important that it was clean and nice. The same with the bathroom. The hotel got the most beautiful courtyard I ever seen. Full of green, with the antique statues. It was a great pleasure to drink a cup of coffee there. It's a pity it was a bit cold - we visited Venice in February, but if you will be there during the warm time, I suppose this courtyard is perfect to have a breakfast or a late after dinner drink. The Flora stuff was really friendly, happy to give an advise if needed.", "Date": "February 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ho Ho Kus, New Jersey", "Title": "“Great Little Hotel”", "Author": "Timcor061", "ReviewID": "UR97324697", "Content": "We very much enjoyed our stay. The staff, location and breakfest were great. The rooms are a little small as one would expect in Venice and the AC could be improved in some of the rooms. nevertheless it is a great value.", "Date": "February 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3"}, "AuthorLocation": "USA", "Title": "“pefect little hotel near everything”", "Author": "RomeHome", "ReviewID": "UR95071361", "Content": "I love this hotel and stay here every time I can when I come to Milano. You can't go wrong: it's close to Piazza San Marco and thus, everything else. The rooms are small, and there is no restaurant, but you're not here to spend all your time in your room, much less eating at a hotel restaurant. If you can get in, stay here!", "Date": "January 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Great hotel in excellent location.”", "Author": "Aussie12Syd", "ReviewID": "UR94718197", "Content": "We booked this hotel through the hotel's website based on other travellers reviews and we were amazed at the value of this well located hotel. The staff at reception and in the breakfast room were exceptionally friendly and went out of their way to assist us with making our stay comfortable. The room we were allocated (3 adults) was comfortable and spacious and looked on to a gorgeous private courtyard.", "Date": "January 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Surrey", "Title": "“Wonderful, beautiful and amazing!!!”", "Author": "butterflysurrey", "ReviewID": "UR93896392", "Content": "Hotel Flora is just so wonderful, we stayed for 2 nights 14th-15th Jan. The location is just perfect for sight seeing and the room we had was so beautiful and soooooooo clean! Breakfast is very nice with lots of choice. The staff cant do enough for you and are so friendly we felt looked after from the moment we walked into the hotel until the moment we booked out. We will go back to Hotel Flora next year and would say to anyone this hotel is worth visiting. Thank you so much Hotel Flora for making our stay in Venice so special.", "Date": "January 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“The perfect place to stay in Venice”", "Author": "ccmacy", "ReviewID": "UR91035971", "Content": "We just checked out of the Hotel Flora and I am compelled to write this review. The location is perfect- within walking distance to all the sights of Venice. The staff are so friendly and accommodating,especially Sergio. The linens are soft and of high quality and the rooms are immaculate. The beds are firm and comfortable. This is a great place for families as they have rooms to accommodate you. Their dinner recommendations were phenomenal and they made reservations for us with no difficulty. Breakfast was fresh and high quality.The garden was gorgeous even in Winter. We did not want to leave it was such a great experience. I recommend this as the best hotel option in all of Venice! You will not be disappointed! Thank you Hotel Flora for a fabulous experience!", "Date": "December 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Gorgeous!”", "Author": "SummerTravelerx4", "ReviewID": "UR87042659", "Content": "My family and I loved this hotel. The staff were friendly and the place was beautiful and clean. Meals were served outside on the charming patio. Food was fresh and there was a good variety of options as well. Relaxing, comfortable, and very family friendly. Location is great! Within walking distance to everything in Venice. We were there in July and never felt crowded or had to wait for any service. Also a great value for our money. We will definitely be returning to this hotel some day.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Search no more...This is where you should spend your Venice vacation.”", "Author": "TravelBuzz93", "ReviewID": "UR86898794", "Content": "Flora is a charming hotel tucked away in a quiet alley. The front desk manager was MOST helpful...provided excellent restaurant recommendations with specific directions, arranged a taxi to Murano and the airport, and even helped us exchange email documents with our real estate agent in the US to sell our house. We enjoyed our breakfast in the courtyard each morning, but don't leave your plate unattended. The birds love the buffet, too! We hope to return to Hotel Flora soon.", "Date": "November 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“perfectly situated, breakfast in lovely courtyard”", "Author": "LuKn", "ReviewID": "UR86470399", "Content": "The Hotel Flora is just the perfect basis for a relaxed venice vacation. it s next to the opera in the heart of the city, and yet you are in complete calm and peace. they have a lovely court yard where breakfast is served - this you will share with dozens of lovely sparrows waiting to be fed... good choice!", "Date": "November 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Great little hotel in Venice, would definitely stay there again when in Venice.”", "Author": "rc51cgy", "ReviewID": "UR85590266", "Content": "We booked Hotel Flora based on Trip Advisor reviews and on the emails we got back from them when querying for room availability. Very happy with our booking and stay at this wonderful little hotel. Staff was great. Excellent recommendations for dinner/lunch. Check-in was the fastest I've ever done and we've stayed at alot of hotels on business and leisure. I think within 5 min we were checked in and on our way to our room. Courtyard is wonderful and morning breakfast is quite adequate and service was top notch. Well done!", "Date": "November 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Fabulous Hotel, Perfect Location”", "Author": "GoingBacktoItaly", "ReviewID": "UR84683760", "Content": "LOVED this hotel - we spent a month in Italy, and this was my favorite hotel. Elegant lobby and room; friendly, helpful service; great location, great breakfasts with fresh, warm pastries. If return to Venice, will stay here again.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Newport Beach, California", "Title": "“Great Location in Venice”", "Author": "cj0517", "ReviewID": "UR83055496", "Content": "Friendly service in a good location in Venice. The hotel is moerately priced. Rooms are not large but comfortable. Nice courtyard for breakfast. We would definitely go back.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Silicon Valley, Ca", "Title": "“Lovely hotel with old world charm”", "Author": "TravelEatRepeat", "ReviewID": "UR82201998", "Content": "Walking through the courtyard of the Hotel Flora feels like walking back in time. The exterior of the hotel looks like it's several hundred years old and really made us feel like we were in a different place. The rooms are similarly charming with fabric wall coverings and a glass chandelier. Bed is large, linens clean, and the bathroom has modern amenities. There is a tiny safe in the wardrobe, big enough for a wallet or some cash, but it has a skeleton type key that must be left with the front desk when leaving. Would be nice to have a larger safe with electronic lock. No iron or pants press in room. The morning staff, especially Sergio the desk clerk, were gregarious, helpful and charming. The afternoon and evening staff weren't quite as charming but still friendly and helpful. Breakfast is included with the room rate and includes coffee, breads, jams, cheese slices, boiled eggs, yogurt and cereal. This is the one weak spot of this hotel, but it's something to get the morning moving. Location is good. 5 minute walk from San Marco and vaporetto stops on lines 1,2 and airport lines red, blue and gold.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Perfect”", "Author": "Krenian", "ReviewID": "UR80838484", "Content": "Hotel Flora was an excellent experience for us. The location is perfect yet quiet. The staff is extremely friendly and the food was excellent. We were there with 2 teenagers and while the bedrooms were small, they were very comfortable and clean. We travel a great deal and highly recommend this hotel.", "Date": "September 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "toronto", "Title": "“Hidden Gem!”", "Author": "lovesworldtravel88", "ReviewID": "UR73986354", "Content": "Wow hotel Flora was incredible! Staff was amazing Breakfast was great - with delicious cappuccinos Rooms were Victorian style - felt like we were back in time (but in a good way)-they modernized the hotel and it was so beautiful All in all had a great stay there!", "Date": "August 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Dissapointed with my experience-would not recommend”", "Author": "Lucythepug", "ReviewID": "UR71766788", "Content": "Venice was the last stop on our honeymoon and we were looking forward to staying at Hotel Flora. We paid 300Euros to stay here in a Deluxe Room. We checked in early, around 9am and the room was not ready (totally understandable) so we left our luggage and returned at noon. When we came back, we went up to our room and the person and the front desk our luggage would be right up. 20 minutes later, my husband and I are in our room and without even knocking, the bellman guy opens the door without any notice. Thank goodness we weren't doing anything private. The room was ok, but the bathroom was ridden with mold. There was mold all over the ceiling and in the creases long the wall. The toilet seat was full out broken, but was on there to look as if nothing was wrong. We put a ton of items in the safe. When we left the hotel, the man at the desk insisted we leave our room and safe key at the front desk. I know that his is typically normal--and is an OPTION for guests, but he insisted and when we told him that we preferred to hold it, he told us this would be a big problem. ? He was rude and told us that if we lost our keys, there are no replacements. We took that chance. When we checked out, the owner was rude as well. The breakfast area was lovely to look at, but once you sit down and eat there, birds are not afraid to fly around you and pick at your food. The hotel is in a good location, thats about it.", "Date": "July 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "san diego, ca", "Title": "“hotel flora - good value”", "Author": "adiosamiga", "ReviewID": "UR71416511", "Content": "we choose to say off the grand canal due to comments on noise and price. hotel flora was good choice. breakfast lncluded. good room but not luxurious. clean and staff was as accommodating as any. good location. air conditioned.", "Date": "July 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Albany, New York", "Title": "“Hotel Flora”", "Author": "brosen50", "ReviewID": "UR70494061", "Content": "Five minutes from St. Mark's Square, this inviting hotel was our home for 5 nights. We had a family suite, 2 small separate rooms which accommodated myself, my wife and 2 kids-21 and 16. Warm and friendly staff, great breakfasts in an open courtyard. Excellent service, good advise, and willing assistance. Reasonably priced, don't miss this gem.", "Date": "July 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vienna, Austria", "Title": "“Cosy, wonderful hotel in Venice”", "Author": "soldan66", "ReviewID": "UR68150066", "Content": "The hotel is hidden away in a side alley, 5min walk from St. Marko square. There is a beautiful inner garden for breakfast, typical venetian rooms (we had the 3 bed room we window to the garden, for a couple with 1 child it's perfect). The hotel staff are extremly friendly and helpful.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Venice, Italy", "Title": "“A must stay”", "Author": "dlitz224", "ReviewID": "UR67067319", "Content": "Loved the Hotel Flora, friendly, warm and very accommodating. Definitely would stay here again. .Have the hotel make a reservation to have the water taxi pick you up at the airport....saves time and energy (dragging suitcases from the bus-boat to the hotel is exhausting!!!!)", "Date": "June 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wilton, New York", "Title": "“A Long Lovely Stay at Hotel Flora”", "Author": "Wanderful77", "ReviewID": "UR66974833", "Content": "I stayed at Hotel Flora last month for 10 days as a solo traveler, and the hotel and its staff helped make my trip something I will always fondly remember. My room, while small, was a perfect fit for me, and was, most importantly, very, very quiet. The staff was uniformly courteous and helpful, and the gentleman who orchestrated the charming breakfast room was an absolute gem, unfailingly cheerful and on the spot every time, often even before I asked for something. He remembered every morning that I wanted my cappuccino without their customary sprinkling of chocolate and would call out to have it ready even before I had fully entered the breakfast room. The breakfast was ample and appetizing, with croissants, fresh cut fruit, cereals, juices, everything you would want or need to begin your day. The location is ideal, tucked down an alleyway, just off a fashionable calle, across from the excellent (and highly recommended) La Caravella restaurant, and near enough to Piazza San Marco and its vaporetto stop without being too close to the mayhem of either one. If I should ever be lucky enough to return to Venice, I will return to Hotel Flora.", "Date": "June 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Great location at a good price”", "Author": "bethalewallen", "ReviewID": "UR66584761", "Content": "I spent two nights in Hotel Flora, and loved it. Though I prefer more modern room decorations, the room was very comfortable and the staff was helpful at any hour I needed assistance. Don't miss the garden - eating or drinking there will cost you quite a bit but the relaxing experience is worth it. The hotel is in an excellent location that provides a much-needed calm - you'll breathe a sigh of relief every time you turn down the quiet walkway. My only complaint was that the hotel charged for internet access on the shared computer - the only hotel I had in Italy to do so.", "Date": "June 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Intimate hotel with amazing service”", "Author": "LLL69", "ReviewID": "UR65409888", "Content": "What a fantastic hotel in the heart of Venice. Tucked back off one of the main streets leading to St. Mark's square, this is a charming hotel with fantastic staff who really take care of you. Breakfast is included and was great...especially sitting in the courtyard. I had a single room which was small by north american standards, but it made up for it in character and style. Anyone looking for an intimate boutique hotel in an excellent location with top-notch service will enjoy Hotel Flora!", "Date": "May 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Fort Collins, Colorado", "Title": "“Slept like a log in a tiny, beautiful room.”", "Author": "psk219", "ReviewID": "UR65095550", "Content": "Hotel Flora is an upscale hotel hidden on an upscale street in Venice. It is beautiful! Every detail of the place has been thought about and examined to make it extremely clean, remodeled with excellent service. The single room I ventured into was the tiniest room I've ever stayed in...yet the bathroom, also very small, had the cleanest tile work, grout and toilet I've seen in three months of travel. The wallpaper, furniture and bed were all A+ and the scenery out my little window was of the garden. The garden is a place where breakfast is served each morning for the guests. It is absolutely beautiful, complete with robins resting on the fountain and on table tops. It was a serene and lovely place to rest after hectic sightseeing in Venice. Breakfast is included in the price of the room. Tables are set very elegantly with beautiful fabric for tablecloths with excellent, professional and polite waiters. Everyone who works at this small, boutique hotel is service oriented. As a tall, bigger person, I thought the room was extremely small but it didn't matter once I made it my own. Everything worked perfectly from drains to tv to the comfort of the mattress. I'll go back again and again. It was worth every euro!", "Date": "May 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Charming hotel, gracious staff, great location”", "Author": "lcollens", "ReviewID": "UR64969492", "Content": "Hotels in venice are expensive for the most part but the staff at this hotel are extremely helpful and knowledgeable of things in the area to do and how to get there. The how to getbthere is important in the labrinyth that is Venice. The rooms are smallish but pack a lot of stuff in there. Very near to San Marco, Harrys Bar, Hard Rock Cafe and about 5 minutes walk from Rialto (once you know where you're going). I went with my girlfriend and we slept through the breakfast but I have heard good things about it from other guests. I would stay here again. It can be a little hard to find as it is off a shopping street down an alley.", "Date": "May 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wien", "Title": "“Charming hotel with excellent service”", "Author": "_Le_nochka_F", "ReviewID": "UR64300498", "Content": "We have stayed in Flora for 4 nights. The location is very good- close to St.Marco. It is not my first time in Venice, so I was aware of the local pecularities. In Venice you can't expect spacy high-tech rooms, it is not about it! I mention it, because I have read the reviews that complain that rooms are tiny (especially american tourists, who are used to different standards). Inner patio is absolutely beautiful, a consolation for those tired from hustle and bustle of big cities! Our room was small indeed (not tiny though in comparison to places like Paris :) ), but charming and clean. Bathroom was tiny, but we were fine with it as we know what to expect. For the overweight people it can be a problem though. Hotel staff was very friendly and helpful, the receptionist's restaurant recommendation (followed by a reservation) was exceptionally good. The best food and service that I ever had in Venice! Breakfast could be better (ham was missing), but was was still fine. Overall, I would recommend to stay in Flora. It is charming and well located.", "Date": "May 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Connecticut", "Title": "“It is a gem.”", "Author": "nomenemo", "ReviewID": "UR62660330", "Content": "So many people I know told me to stay here and I wasn't disappointed. Yes, the room we had was small, and the bathroom teeny (hint: don't drop the soap in the shower because if you're over 7 years old you won't be able to bend down to pick it up!). But the rooms are nicely appointed in a sort of slightly shabby old Venetian style. Best, the staff is wonderful--couldn't be warmer or more helpful--and the location can't be beat. You're about two blocks from Piazza San Marco and in the midst of the best shopping (i.e., most expensive) in Venice.", "Date": "April 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sussex, England", "Title": "“A haven in the heart of Venice”", "Author": "Tonto2304", "ReviewID": "UR49396490", "Content": "Recommended by a friend with very good taste, this hotel did not disappoint in any way. The green and tranquil courtyard provides a memorable start to each day over breakfast (usually 'shared' with hungry sparrows!) and a perfect setting for evening cocktails or candle-lit light supper. Our room for three was small but perfectly adequate and, more importantly, clean, with a good bathroom and shower. We were particularly grateful to the concierge for three marvellous recommendations for supper places - all different, off the beaten track, and good value for money. Top marks!", "Date": "November 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Auckland", "Title": "“Excellent hotel”", "Author": "PackingQueen", "ReviewID": "UR48804372", "Content": "Gorgeous hotel, in a very handy location literally 3 minutes walk from Basilica San Marco. Helpful staff, lovely rooms. Bathrooms too small, but this was a minor thing.", "Date": "November 9, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "New York City, New York", "Title": "“Don't Listen To Rick Steves - One Of The Worst Hotels I Ever Stayed At!”", "Author": "peterworldtraveler", "ReviewID": "UR48663813", "Content": "Iâ€™m not one to do this, but against my better judgment, I took Rick Stevesâ€™ recommendation and booked a room at Hotel Flora. I arrived-after a long search to find the hotel which is located down a narrow dead-end kind of street-in the morning, and my room was not ready. Ok, fine, understood. Upon check in the front desk clerk asked for my passport, wrote down the information in it, and then insisted on keeping it until my room was ready, which made me really uncomfortable. I didn't then and still don't understand why, but I reluctantly agreed and left it with him. A few hours later, I returned and was given keys (yes keys) and shown to my room. First off, the key chain had a heavy door knocker attached that weighed about 3 lbs., and I'm not exaggerating here. Since my backpack was heavy already, I immediately removed this from the chain. Attached also, was a skeleton key for the safe (later on that). As soon as I opened the door to my room, I was unhappy. The room was very tiny-the bed almost ended at the bathroom door-and the decor was really in need of an update. I felt like I was in some weird cabin in the woods rather than in Venice, Italy. There were dark wooden shelves on both sides of the beds for your clothes, covered by a gold somewhat musty curtain. The shower was another story. The only way I can describe it is \"small space capsule\". If you've ever had a closed MRI youâ€™d know what I mean. I felt like I was standing in a pizza oven. I kept thinking that a large person could never shower in that room because as slim as I am I was having a difficult time moving around. Next, the safe. You could fit a wallet in it, and nothing else. The lock chamber on the back of the door to the safe was so thick it took up most of the space! I was always squeezing things in there and still had to carry the rest with me since there was never any room. Honestly, it was the tiniest safe I've ever seen. The only thing that was big was the key to it! When I returned to the lobby I asked if I could upgrade to a bigger/nicer room and very politely expressed my dislike for my current accommodations. I was told nothing was or would become available. I was perfectly willing to pay for a room like the one shown on the website-which by the way is the only one like it, I think, and the answer was no. I honestly think itâ€™s because I was traveling alone and they wanted/needed one of those rooms for two people. I saw many room keys dangling from the shelf behind the clerk at the reception desk, but my key was noticeably vacant because my room was occupied!! I settled for my fate and since it was only two days I thought I could live with it, but when I thought of the rate I paid, I was even more upset. This little single room cost me nearly 320 Euros (nearly $500 USD) and wasnâ€™t worth that at all. Two days later I stayed in a beautiful hotel in Florence for two nights that cost $252 Euros ($354) and had a room twice the size and breakfast fit for a king (later on that great review). Now breakfast. It was included, but thanks for nothing. It was the cheapest continental breakfast I've ever seen. Usually in Europe continental breakfast will include lunch meats, cheeses and scrambled eggs. None of this here, but they did have a small dish of hard-boiled eggs, so I do have to mention that. There's an outside garden but I sat inside, and there were birds flying inside and perching on the cereal dispensers eating the droppings people left behind. They were probably the only happy ones. That was really disgusting-not to mention unhealthy-and no one said a word or did anything. I mentioned Rick Stevesâ€™ recommendation again at checkout time because according to his book youâ€™ll get a 20% discount for doing so. Completely untrue! When I asked, I was told that I already had the lowest discount, so no. Meanwhile, this was the regular price so I donâ€™t know what discount they were talking about. I paid the more for this hotel than any other in Italy, and yet I liked it less than any other! Every time I headed back to the hotel I dreaded going there and I never felt like it was an extension of my home or had a warm and nice feeling when I was there. I traveled this time without a laptop so the only positive thing I have to say is that they charge only 3 Euros for Â½ hour, but considering Milan and Florence offered free internet, again, really, thanks for nothing! Please do your research and look for a better hotel. During my last trip to Venice I stayed at The Saturnia, which oddly enough is located directly across from Hotel Flora. I even considered just going there and biting the bullet, but since I felt ripped off already, I stayed. No matter how the The Romanelli family responds here, this is my true experience!", "Date": "November 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Still a gem!”", "Author": "elainesl", "ReviewID": "UR48055980", "Content": "The following is from an email that I sent to the hotel earlier this week: I am eager to express my appreciation and delight at the wonderful stay we recently had at your hotel. I had stayed at the hotel a number of years ago, and, with the passage of time, I wasnâ€™t sure if the hotel would still be the right choice for me and my travel companion who was visiting Venice for the first time. We were both very happy with the Flora. Our superior double room was large and comfortable. The breakfast buffet provided a good start on each busy day, and the coffee was excellent (not always the case with hotel coffee.) The hotelâ€™s location, of course, could not be more convenient. But what really distinguishes the Flora is the level of service we received, from the waiters in the breakfast room, to the porters, to the front desk staff. I would challenge more expensive hotels to display the same level of warmth, service and courtesy that we found at the Flora. I assure you I will always recommend the Flora, and look forward to more visits in the future. As further comment to the above endorsement, I will add that the hotel offers a small computer access off the lobby (there is a nominal charge per half hour) though it's not particularly comfortable. I also haven't stayed in hot weather so I can't comment regarding air conditioning. Room decor was pleasant, and in good condition, though dated. These were minor issues relative to our overall experience.", "Date": "October 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York, NY", "Title": "“A total haven”", "Author": "LuckyLuckyDog", "ReviewID": "UR46955365", "Content": "Beautiful room, courtyard is out of a romance novel, lovely breakfast, perfect location (central but hidden), great staff. Tiny bathroom, but it serves the purpose. Can't wait to go back!", "Date": "October 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "California", "Title": "“What a wonderful hotel.”", "Author": "Travelling33", "ReviewID": "UR46897257", "Content": "Hotel Flora was great. I was there for a week, and could have stayed another week, easy. I had probably the smallest room in the hotel, room 35. A single room, it was just big enough for a twin bed, wardrobe, and desk. My bathroom was slightly larger than others' in my group, and had a separate window, so that made up for the small room. Very clean and comfortable. The front desk staff were friendly and helpful with transportation questions that I had. The breakfast, and Stephano, were wonderful. It was hard each morning to decide what to have for breakfast. Egg, croissant, yogurt, fruit, so many choices. I also recommend arranging to have dinner at the hotel. The bartender cooks a limited number of dinners each evening and while slightly more expensive than you might pay elsewhere, the food was wonderful. It was warm outside and we were able to eat in the garden. It felt like eating in your own backyard. Wonderful. The location is very convenient. Just a few minutes to Piazza San Marco, vaporetto station, and a pleasant walk everywhere else. We had vaporetto passes for the week, but actually walked most places, including to the Rialto, and back from dinner close to ferrovia.", "Date": "October 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "White Plains, New York", "Title": "“Hotel Flora is a little jewel in a magical city.”", "Author": "richchar", "ReviewID": "UR46613819", "Content": "Venice was the last destination of a 9 day trip; we were celebrating a milestone birthday and semi-retirement , so we wanted to mark the occasions with something special. Many people, with a wide range of travel experiences and tastes, recommended Hotel Flora as just that - something special. Based on reviews in TripAdvisor, we reserved a deluxe double overlooking the garden .... a wise choice. We hoped for the best, but based on written reviews we steeled ourselves for cramped quarters and uneven experience. In fact, Hotel Flora exceeded our expectations. Everything about it is unique and wonderful. The location is phenomenal - a short walk from the Grand Canal and St. Mark's Square, yet set back in a remarkably quiet and peaceful setting. This boutique hotel oozes warmth, welcoming charm and old-world elegance: the beautifully appointed lobby, the magnificent garden, the gracious staff. The room itself (#15) was fabulous: large, beautiful, clean, quiet, with a serene view of the garden. It became a haven when we needed a break from other tourists and sight-seeing. The staff were wonderfully helpful, while respecting privacy and space. We are already planning a return visit to this magical city, and this jewel of a hotel.", "Date": "October 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Massachusetts", "Title": "“Great location, wonderful staff, terrific breakfast, fantastic courtyard”", "Author": "pauljuliuspeter", "ReviewID": "UR46306247", "Content": "Fantastic location, just down the way from San Marco, terrific staff, Internet was a bit awkward (common room), room was small but clean, crisp, quiet, and more than adequate, breakfast lasted me the day, and the courtyard was like an park, what a way to start the day. We loved it. I believe it is a three star only because the rooms are a bit small (we were in Venice, not interested in spending a ANY time in the room.) - Paul", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "denver, co", "Title": "“Perfect location, beautiful little hotel”", "Author": "Trekker13", "ReviewID": "UR45432417", "Content": "My husband and I spent two nights here and enjoyed the location and ambience of this great little hotel. Hotel Flora is just a few minutes walk from St. Mark's but its location at the end of a quite alley and its beautiful courtyard allowed us to feel a million miles away from the crowds. The staff was especially helpful and the rooms were beautifully decorated.", "Date": "September 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Utah", "Title": "“Excellent location! Excellent service! A great place to stay...”", "Author": "Luv2trvl27", "ReviewID": "UR44764121", "Content": "My husband, mother and myself stayed for 3 nights at the Hotel Flora. We initially chose the hotel for its proximity to St. Mark's Square. We reserved a family suite which gave us 2 separate private bedroom areas and 2 bathrooms. The rooms, while small, were absolutely adequate for what we needed them for..... sleeping!!! Since we only had 3 days, we spent very little time in the room and explored the city. The breakfast in the a.m. was wonderfully done and the staff were very attentive to our needs. The front desk staff were also incredibly helpful and friendly. If going back to Venice, I would not even bother to look for a different hotel! Thanks Hotel Flora for helping us to feel so welcome in Venice.", "Date": "September 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Charming hotel in an elegant street, near Piazza San Marco”", "Author": "flanar", "ReviewID": "UR42936185", "Content": "I had already been in Venice twice; my mother too, but it was my two daughters (10 and 13th) first time. My mother is 80th and needs some help to walk. I was looking for a hotel well located, near Piazza San Marco and found Hotel Flora. By the time we arrived, we liked the decoration, the atmosphere... It is side by side with Bulgari and steps from lots of nice shops, like Gucci, Fendi, Etro, Botega Veneta, etc... Walking to the other direction there are lots of art galleries. Breakfast is served in a patio with lots of plants and there is a CafÃ¨ or bar at the entrance of the hotel where we can get a capuccino or any other drink all day long. They serve even a light meal: the day we check out we had lunch there, a nice salad and a pasta (very good). The staff was very nice, everybody can feel like an abituÃ¨ but they are not invasive.", "Date": "September 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Florida", "Title": "“A Quiet Oasis in a Hectic City!”", "Author": "Travel4ever84", "ReviewID": "UR41357751", "Content": "We booked the Hotel Flora directly through their website--and were not disppointed. It is a splendid little hotel in a perfect location. We were on an extended trip to Venice, Paris and London starting in Venice. Venice is a special city--granted it is very crowded and expensive-but the Hotel Flora in our opinion was a good value at 200 euros a night for a deluxe double room. The staff are very accomodating and helpful. We did not arrive until about 6 PM after a long day of trvelling. We checked in quickly and got to the room-beaufifully furnished in antiques. The rooms are small--but that is genererally true in Europe. We did find it very comfortable. The garden is a hidden oasis of tranquility in a very hectic city. Breakfast was served every morning--buffet with croisants, rolls, cereal, fruit, yogurt, and eggs. Also juice and coffee--iIloved having a capaucinno every morning!This is included in the room rate. If you want for addtional cost they will provide a cooked breakfast. Service was excellent--We didn't even have to ask for the coffee after the first morning--there he was with coffee and juice. We loved returning to this quiet oasis after each day of sightseeing. One afternoon we had some coffee and cookies in the lounge. Service is excellent and the hotel is quaint and romantic. As an example one night we had a special dinner where my wife go a beautiful rose boquet. We were not sure what do do with it--the roses were in the sink. The next day when we returned to the room the maid had left a vase to put them in! The location is only a 5-10 minute walk to Piazza San Marco-but is quiet and down a short narrow little Calle.", "Date": "September 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "4"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Don't ask front desk to recommend restaurant”", "Author": "SAtraveler63", "ReviewID": "UR37755368", "Content": "The hotel was very nice, but expensive -- 150 Euros for one night. Beer was 5 Euros ($7.50) each for bottled beer. The rooms were nice with antique furniture, but key to room safe was on room key ring that you turn in to front desk before leaving hotel. Yeah, right!! What is wrong with electronic safes that you set your own code in? Hotel did have a restaurant but it was Sunday and the chef was \"off.\" As you can see from title, we made a big mistake. Buy and use a travel book (like Frommer's). We had the book and then went to the restaurant recommended by the front desk. We sawseveral other hotel gusts there. Bad mistake. The dinner for my wife and me was 95 Euros -- one wine, salad Caprese and \"fresh sea bass\" at 30 Euros per plate. Well, Venice has 20 million visitors per year, and they try, and in our case succeeded, in gouging every one. On our next trip we will stay in Verona or Padua and day trip to Venice. Or, catch the cruise ship with a 30 minute train ride to Venice docks. We did spend the money to take a gondola ride. Their license fees to operate a gondola are about 250,000 Euros and the gondola costs about 200,000 Euros, so there is at least some reason for the $300 charge for a 45 minute trip. Well, we have done that. $700 for 24 hours in Venice is not quite Europe on $10 per day. We wish you better luck. Oh, did I forget to mention that 10 million tourists were in town the day we were there? RM", "Date": "August 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "San Diego, CA", "Title": "“Great place, can't beat the location.”", "Author": "SB4SD", "ReviewID": "UR37603281", "Content": "We just returned from a trip to Italy and stayed at the Hotel Flora for two nights with our family. The rooms were a bit tight, but still comfortable. The location is wonderful but still away from the crowds with no noise at night which was great. The breakfast in their garden is outstanding. We took a boat that they offered to Murano Island which was nice, BUT beware of the pushy sales people once you arrive!", "Date": "August 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Los Angeles", "Title": "“What terrific staff!”", "Author": "sydsmom10", "ReviewID": "UR35930159", "Content": "My sister and I took our first vacation to Italy and stayed at Flora for 3 nights. It is in a great area, very clean and comfortable. It is the staff that adds the real value to this Hotel. They are accomodating, professional and work very hard to please. Would recommend!! Thank you Hotel Flora!!", "Date": "July 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Tucson, AZ", "Title": "“Loved the Flora”", "Author": "Mama_Duck_Tours", "ReviewID": "UR33392158", "Content": "This hotel is a little gem in Venice. It is very walkable from the San Marco Diretto stop. The hotel staff are most helpful and will book concerts, etc. The rooms are large by Italian standards (we had a triple) and well appointed. The garden is a great spot for a drink after a long day of site seeing. The breakfast room is very nice and a decent buffet breakfast is served. Wonderful ambiance and hospitality at this hotel.", "Date": "June 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Location": "5", "Rooms": "4"}, "AuthorLocation": "St. Louis, Missouri", "Title": "“Fabulous breakfast at the hotel Flora”", "Author": "Solange72", "ReviewID": "UR32562654", "Content": "We spent one night at this hotel in the large corner room with a magical view on a next door palazzo garden and sculptures. This is a very charming hotel, with kind and welcoming staff and, as noted by many many others, a very lovely garden. The garden, which is really an oasis of verdant loveliness in a particularly bustling and touristy area of Venice is a great spot for reading the paper, having a drink or...a fabulous buffet breakfast which includes expresso or cappucino or hot chocolates (highly praised by the jr set). Our room was comfortable with lovely fixtures (see picture).", "Date": "June 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Small by any standards”", "Author": "RobReno", "ReviewID": "UR30955421", "Content": "We wanted to be close to St. Marks Square, and knew the room would be small, but \"two cats couldn't dance\" in this room. Bathroom was even smaller. Felt like I had to open window to turn around. They also have the smallest bar Iâ€™ve ever seen. We did open the window, and door, and window in hall to try to cool things off. Then we had to worry about mosquitoes. Hotel was in nice location, and had a good breakfast in the courtyard. We were out of there in one day.", "Date": "May 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Oxford", "Title": "“A wonderful hotel”", "Author": "OxfordRose", "ReviewID": "UR30713078", "Content": "I have just returned from my second visit to the Hotel Flora. As so many others have said, it is a gem of a hotel. The staff take their work very seriously, but are also friendly and welcoming. My previous trip was with our two young children, the one just finished with my elderly mother. All were treated with great warmth. If the Hotel Flora is full, try the Novecento, which is run by the same family, with simlar warmth and efficiency.", "Date": "May 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Wedding Bliss”", "Author": "JEY08", "ReviewID": "UR29925893", "Content": "My wife and I had decided to get married in Venice and when looking for accommodation for the wedding party we came across the Hotel Flora. From the moment we enquired about availability to the when we arrived and then departed, everything and everyone was handled perfectly and with a smile. The entrance to the hotel is tucked away down a narrow path and enchanting when you walk in. The courtyard is wonderful to relax in and have your breakfast or a late afternoon G&T in. The rooms are not the biggest, size to be expected in Venice, but they are decorated and furnished brilliantly with a window overlooking the wonderfully green courtyard and completely in the Venetian style. We did not spend to much time in the room as we were sorting out the wedding and then meeting family and friends but we were looked after brilliantly. The breakfast experience is wonderful way to start the morning and the hotel recommended great restaurants for lunch and dinner. A complimentary bottle of champagne the night before the wedding, an easy change of rooms on the day of the wedding along with the waiters guaranteeing that the rain would stop before the ceremony (which it did thankfully) made it a stay to remember and thoroughly enjoyed. Definitely a recommended if your are going to Venice.", "Date": "May 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Vancouver", "Title": "“Our most favourite hotel of any we've ever stayed at”", "Author": "burr66", "ReviewID": "UR29155385", "Content": "From the moment we turned into the narrow opening between buildings on a main street and first saw the Hotel Flora we were in love with this hotel. It only got better from that moment 'til we had to say goodbye. The hotel is located an easy five minute walk from San Marco Square and the same from the Grand Canal where water transportation to just about anywhere is located. For those who worry about getting to the airport, a ten minute walk to water transportation that takes you right to the airport for 17 Eur or a direct boat for 25 Eur. Quick, easy and reasonable. The hotel's rooms are clean with all modern amenities. The common areas, like the tiny, two-stool bar, the lounge and separate dining rooms are quaint beyond telling where my wife and friend would sit over tea before calling it a day. For me and my wife's friend's husband, it was always outside in the hotel's incredibly beautiful courtyard over a glass of very good local wine. While we all fell in love with Venice, the courtyard of the Hotel Flora was my favourite place to relax and unwind. I can't say enough about the staff at this hotel. Friendly and warm with always a ready smile. The service level was some of the best I've ever experienced and all of the staff were helpful and informative. Without being intrusive, they were always there when needed and seemed to anticipate our every need. For all four of us, it was a sad morning when we had to leave for our trip home and we can't wait to return for there's not another hotel in all of Venice we'd stay at other than the Hotel Flora.", "Date": "May 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Virginia, USA", "Title": "“Watch Out for Small Rooms”", "Author": "Jim_in_Virginia", "ReviewID": "UR27287278", "Content": "The Flora has much going for it. It is a short walk to San Marco Square, very convenient to shopping, the Grand Canal, and numerous great restaurants. It has an excellent full breakfast, and a very charming garden courtyard, where we enjoyed drinks from the bar. The front desk staff were very helpful in recommending some very good restaurants, and the bar tender has a photographic memory for drink orders. The room was clean. BUT, beware of room size. We asked for the largest room available and got one with barely enough room for a queen-size bed, armoire, chair, and tiny table for tiny TV. The shower in the bathroom was so small that the door popped open if you bent over. You couldn't open the armoire doors all the way since the bed was in the way. It took some advance logistic planning for two of us to maneuver around at the same time. That said, we weren't in Venice to spend a lot of time in the room. It was clean and comfortable, very conveniently located, very charming, and not overly pricey for its location. So, with the warning to make sure you don't get one of the closet rooms, this is a keeper, and we would definitely return another time.", "Date": "April 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Mount Waverley, Australia", "Title": "“Would stay here again in a heartbeat.”", "Author": "AlbaLima", "ReviewID": "UR27196343", "Content": "I was travelling in Italy with my two daughters to see family and see many of the beautiful things Italy had to offer. We arrived at the Hotel Flora and fell in love. The staff were tremendous and helped us with any questions. We loved our room which was very spacious and had a beautiful Murano chandelier. The bathroom was wonderful as well. We loved breakfast in the morning and made great friends with the waiter there Stefano Bonn. I would go back there again and stay longer. The hot chocolate in the morning is a must. The beautiful garden area is just magical. It is lovely to sit there in the late afternoon and have a campari & soda. I would reccomend this hotel to anyone I know.", "Date": "March 31, 2009"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Rooms": "1", "Service": "4"}, "AuthorLocation": "switzerland", "Title": "“Disapointing”", "Author": "dumdidum", "ReviewID": "UR23257957", "Content": "We just came back from our new years eve trip to venice staying 3 nights at the flora. There have to be very nice rooms in the hotel but we definitely did not get one although we booked two month in advance. The room was tiny and had no correspondence with the pictures available on the web. Only the bed was (maybe) antique but e.g. the cupboard was pretty ugly. The bathroom was tiny but very clean and is probably acceptable for such an old house. Furthermore the walls were thin such that one would wake up early. For 260 euro per night the room was very disappointing which we were complaining about at the reception without effect. The breakfast was good and the breakfast service very charming. If you go there make sure that you get what is advertised on the net because the staff at the reception desk will not care about your complaints.", "Date": "January 4, 2009"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Overall": "5.0", "Rooms": "5", "Service": "5"}, "AuthorLocation": "Accra, Ghana", "Title": "“Perfect place for a perfect holiday”", "Author": "KashifMarvi", "ReviewID": "UR22746232", "Content": "Recently stayed for 2 nights at Flora Hotel, Venice. The rooms were spacious and cozy, the staff were very friendly, the facilities were perfect. Since I travel the whole world around, sometimes there are very little littel things whcih matters most to me, and Flora had all those things to make my trip to Venice a perfect trip. I must admit that out of all my travels, Flora was the only hotel where on checking out, I had to specificaly ask for the Owner of the hotel and thanked him personally for the wonderful hospitability extended by the management during my stay. I would absolutely recommend it to anyone who is travelling to Venice, and specially for those who are travelling to Venice for the first time.", "Date": "December 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great little hotel tucked away from the hustle and bustle”", "Author": "abc583", "ReviewID": "UR22160188", "Content": "Just back from a weekend in Venice, staying in Hotel Flora after reading the TA reviews. The location of the hotel is perfect, in a lane off Venices most chic shopping street, 5 mins walk from St Mark's and the nearest water bus stop. Staff were friendly, and helpful. The room was small but the bed was very comfortable and the linen excellent. The bathroom was the smallest I've ever seen! But we were there to see Venice not a bathroom. Venice is a very expensive city, so be aware, of water taxis (â‚¬70 from San Marco to the bus stationn 10min trip, wish the concierge had told us when we booked it) and restaurants within the main tourist areas. The Hotel was perfect and would recommend it. The only shame is the bar closes very early, got back to the hotel at 10pm, hoping for a night cap and the bar was closed.", "Date": "November 25, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Bucks County, PA", "Title": "“\"Lovely Botique Hotel \"....”", "Author": "likestocook", "ReviewID": "UR21818530", "Content": "My husband and I have just returned from a wonderful 7 night stay at the Hotel Flora. We were especially pleased with the kind and helpful treatment we received from the desk staff, Sergio and Giovanni, and the breakfast waiter, Stefano. Our bed was very comfortable and the morning breakfast buffet and cappucinos were a perfect way to start the day. The hotel location was great with an easy stroll to San Marco Square or the Rialto. We are looking forward to return to Venice and would definitely make reservations to stay at the Flora!", "Date": "November 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellently situated small hotel”", "Author": "CarolineSWLondon", "ReviewID": "UR21630580", "Content": "We have just returned from staying at this charming well situated hotel. Having read some of the comments on TA, I was worried that it would turn out to be a mistake. This was far from the case. We had a delightful, although on the small side, room overlooking the attractive courtyard with a well designed small bathroom. The staff couldn't have been more helpful and friendly and we had an excellent breakfast every morning. We would certainly return to the Flora. It is so conveniently situated and quiet and I am sure it is an oasis during the summer months with its lovely garden. We will certainly recommend the hotel to our friends.", "Date": "November 7, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Melbourne, Victoria", "Title": "“Don't believe the hype”", "Author": "ElwoodMelbourne", "ReviewID": "UR21162388", "Content": "After reading the glowing reviews of this small hotel on the Trip Advisor website and in the current Eyewitness Travel Guide for Venice, as well as having looked at the hotel's own website, we were expecting a small, but thoroughly charming hotel. Sadly we were very disappointed. As we were spending a week in Venice to celebrate a big birthday of mine, we really wanted something special. And at 300 euros a night for a superior room overlooking the garden, we thought we'd find that. Instead on arrival we found a hotel with generally surly staff on the reception counter and very shabby common areas (worn and grubby carpet, scuff-marked walls). Our room, although generous in size, did not appear to be furnished with antiques as mentioned in very cleverly designed, but completely misleading website, but reproduction furniture. The decor felt outdated and there were absolutely no extras included in the room - no robes, no mini bar, and only two plastic glasses (like those you get in economy class on a plane) wrapped in gladwrap on the bathroom shelf. At less than a metre wide, the bathroom itself was the narrowest I've ever been in which made using the facilities, let alone drying oneself adequately, almost impossible. The shower was at one end of the 'bath-corridor', with the heated towel rail located inside the shower cubicle! Breakfasts in the dimly lit downstairs lounge were passable but not 'rich' nor lavish as suggested by the website, however the waiting staff in the dining room were very sweet. To sum up, the position of the hotel is great, but for this kind of money there are a great many other better choices. Don't waste your money.", "Date": "October 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Great Location with Charm”", "Author": "ccctravels", "ReviewID": "UR20965312", "Content": "I stayed at the Hotel Flora last weekend with my parents. We had a fantastic stay. The hotel is in a very nice, upscale area mere moments from San Marco and the ACTV/Allilugana stop. It is also only a 10 minute walk or so to the Rialto. Everyone was gracious and helpful from the minute we arrived! We felt as welcome as we would in someone's home! The courtyard is beautiful and relaxing after a long day! My parents had a fantasic room with a view of the courtyard, the decore is very \"shabby chic\" with antique pieces and Venetian Style Decore! We thought it was perfect. The beds and linens were very comfortable which is great after a long day of touring. I had a single room that was the perfect size for one! Breakfast was very nice and they had yummy cappuccinos in the morning! Staying at Hotel Flora when in Venice will always be on the top of my list!", "Date": "October 17, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "san jose, ca", "Title": "“Nice Garden, Small Rooms”", "Author": "phyllis777", "ReviewID": "UR20741806", "Content": "The pictures you see of the garden are accurate. It is quite nice. Our room, on the other hand, was quite small. I've travelled throughout Italy and realize that room sizes are not what we experience here in the states. However, our bathroom was so small, it was difficult to use the facilities. You had to squeeze through the shower door to get in. Once in, you could not bend down if you dropped something to pick it up. Also there was a window with clear glass in the shower which was very uncomfortable. I had to open it up and throw a towel over it for privacy. The people at the front desk were rude. I must say though, that the breakfast was very good and the server during breakfast was very polite, cheerful and helpful.", "Date": "October 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "DÃ¼sseldorf", "Title": "“Fab Hotel”", "Author": "AKK77", "ReviewID": "UR19366134", "Content": "This was a brill hotel. Extremely friendly staff and great location. The room size is smaller than average but they do have different sizes and the size is not that important when in Venice. The room was very clean and was done up everyday. Although the furniture is classic which gives the room a great character the bathroom was very modern with power shower. The location is great, it is just a two min walk from San Marco Square and easy to get to from the airport. Staff all speak a range of languages and go out their way to help. If we would not have had to go back home we would have moved in. ( ; If we ever go to Venice again this is where we will stay.", "Date": "August 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Paul", "Title": "“Loved Hotel Flora”", "Author": "St_PaulLeb", "ReviewID": "UR18512194", "Content": "My husband and I just spent 2 nights at the Hotel Flora in Venice, Italy. We loved everything about the place. Venice is truly a magical place for couples. The Hotel Flora was perfect for us. Our room was lovely, clean, and roomy. The decor was beautiful and the view of the garden below was really special. The staff was friendly, efficient and very helpful. Breakfast in the garden was a wonderful way to start the day. Eggs, fruit, cereal, bread, rolls, etc., as well as fresh orange juice and excellent coffee or cappuccino. We were very pleased with the Hotel Flora and will go back again.", "Date": "August 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mill Valley, California", "Title": "“Happy place to stay”", "Author": "MomWriter", "ReviewID": "UR17055281", "Content": "Friends stayed here and told us it was nice. We are wary of unknown hotels but Hotel Flora is so beautiful. We had a Quad family room and it was large, airy, three windows to views of neighboring courtyards. Nice breakfast included. Evening light meals or desserts and drinks in the courtyard were peaceful and lovely. Staff is amazingly helpful, steering us to good restaurants.", "Date": "June 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lewes", "Title": "“The Flora- a blooming treat”", "Author": "Golfing-Steve", "ReviewID": "UR16937491", "Content": "The Flora is a small gem. Situated in the prime shopping street of Calle Marzo XXII hard on the western side of St Mark's Square this is a superb and quiet location for people who want a top flight base to explore Venice. Although it does not offer evening meals it is within a few minutes walk of some fine eateries and also some less expensive venues to be found in Santa Croce and Dorsodouro, two of the city's six sestiere or quarters. The staff are excellent, especially Stefano who waits on table at breakfast which is served, weather permitting, in the delightful garden to the rear of the hotel. So if it is that good why have I not given it five stars? Two reasons: one the beds and pillows could have been made from pig iron and there is very little storage space in the bedroom we were staying in for which we paid â‚¬260 per night. Space is tight in any good hotel in Venice but we really struggled to find enough space in the bathroom to put our toiletries and could have done with more coat hangers and shelves in the wardrobe. Cupboard space is minimal. But this is still a great base for a visit, especially if it is your first visit and unlike many other hotels on the lagoon is an oasis of peace and quiet.", "Date": "June 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary", "Title": "“Cozy and comfortable”", "Author": "pontificator", "ReviewID": "UR14961881", "Content": "My girlfriend and I stayed here in mid March for 3 days. The hotel is in a hard to find but excellent location a few minutes away from St. marks Square (the heart of Venice). It is in an area surrounded by really expensive looking hotels and shops. We found this hotel after a late arrival and no room booked and were given a small comfortable room overlooking an alley. The bed was excellent but the bathroom was cramped even by European standards. We were transfered to a room overlooking the beautiful garden for our second and third nights - with a bigger bathoom at the same price (E140). This is a really elegant hotel for the price, the desk staff, especially the manager, were excellent as were the beds, bedding and breakfast . The garden was wonderful after a long day of walking and floating. Highly recommended and romantic -especially \"the garden room/s\"", "Date": "April 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Reading, UK", "Title": "“Gorgeous local hotel in fab location!”", "Author": "luxurybackpacker", "ReviewID": "UR13068752", "Content": "I stayed in the Hotel Flora for two nights in early December with my ten year old daughter and we loved it. The hotel had been recommended by a friend who works often at the opera and always stays there when in Venice. It is in a fantastic location - 3 minutes from St Marks square and just off a fashionable shopping street, yet quiet and cosy and very Italian. The staff were fantastic and particularly treated my daughter like a real lady rather than a kid which she loved. Breakfast buffet was just right and cappucinos top grade. We found ourselves popping back in several times a day for a rest and a drink to refuel for yet more sights and walking. It is old world charm however, so if you like a huge bed and all mod cons of a business style hotel, you might be less enamoured, but if you like chandeliers, beautiful wardrobes and ornate wallpaper you will be happy. But above all it was the staff that charmed us - and of course the beautiful outlook from our room over the garden.", "Date": "January 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“Lovely Hotel”", "Author": "Christopher-Robin", "ReviewID": "UR13059773", "Content": "We have just returned from Venice where we stayed 2 nights at Hotel Flora during Carnevale. The Hotel was really peaceful and beautiful, the staff were very friendly and helpful without being too instrusive and our room was very large and beautifully decorated with a lovely view over the garden. We had plenty of room to change into our 18th century costumes for the ball we were attending and the location of the hotel made it easy to reach San Marco. Breakfast was lovely the hot chocolate was especially nice and the room where it was served was very charming and relaxing. The garden looked very nice but it was too cold in January to enjoy. We had a fabulous weekend the carnevale and the Ball were fantastic and Hotel Flora made it all extra special. We will be back!!! Claire and Mike Lakey", "Date": "January 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Minneapolis", "Title": "“The highlight of our honeymoon”", "Author": "msmelis", "ReviewID": "UR12337626", "Content": "My husband and I stayed at Hotel Flora for the first part of our honeymoon. We have seriously talked about going there for some part of every future trip we take abroad. It is the perfect blend of beauty and charm. The staff were amazing and had the ideal cappuccino waiting for me as soon as I headed down the stairs each morning. Breakfast in the garden is delightful. Even better is sipping wine by candlelight there late at night. Our luggage had been lost (actually didn't return until we got back to the U.S.A.), but we hardly noticed while being lost in Venice and the romance of Flora.", "Date": "January 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Buxton, United Kingdom", "Title": "“wonderful hotel”", "Author": "CarolCallaghan", "ReviewID": "UR11149705", "Content": "My husband took me to Venice for my 40th Birthday. It was a wonderful experience in a beautiful city. Hotel Flora was the icing on the cake! Very central just a couple of minutes from St Marks square but hidden away in a quiet spot with a lovely garden. It was wonderful to have breakfast in the sunshine. The staff couldn't have been more helpful and friendly. We were given advise of where we could find nice restaurants - all found just as described, gondola ride was arranged for us at a very reasonable price and I'm sure any other request would have been met. Our room was clean and had lovely antique furniture and venician chandelier. wonderful place to stay and would certainly recommend this hotel.", "Date": "November 29, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“An overall good experience.”", "Author": "Anna-Roz", "ReviewID": "UR10180913", "Content": "This was our second trip to Venice and a repeat stay at the Flora. For this second visit, we reserved a four (4) night stay in a superior double. However, later on we chose to arrive in Venice two (2) nights earlier than originally planned, which resulted in an inconvenience of having to move after the first two nights. Still, the inconvenience was of our own doing; it all worked out fine and we were generally happy with our second stay at the Flora. The room we stayed in for the first two (2) nights was pretty but very-very small; however, we were warned by the management that this is what it would be so no surprises there. As indicated above, after the first two (2) nights, we were transferred to room no. 28, which was absolutely gorgeous with a large antique bed, the softest linens and dawn comforters, and a high ceiling with dark wood beams. The room had beautiful wood furnishings, hardwood floors, and floor rugs. It also had two windows overlooking a palazzo across the garden. Even though rather small with not much space to arrange one's necessities or to move around, the bathroom was newly remodeled. In all honesty, though, the room was just beautiful and I would recommend asking for it specifically. Flora also serves a very nice breakfast, consisting of several varieties of breads and croissants, hard and soft boiled eggs, cheeses, yogurts, and pastry. A huge plus is that the Flora, unlike other hotels in Italy, serves a fresh fruit salad every morning. Somewhat of a minus is that a glass of orange juice is served from the kitchen, as opposed to being a part of the breakfast buffet, and it is quite obviously diluted with water. The morning wait staff is extremely helpful and attentive, and will look out for when one's cappuccino is finished so that they could offer a second cup. We were also fortunate enough to score one warm and sunny morning and have breakfast in the garden of the hotel. As far as the front desk personnel, some of them are more accommodating than others, as is the case with anything else in life, and we did notice that one of the front desk attendants was treating guests with a polite tolerance rather than genuine hospitality. Another issue, I would mildly caution against a blind acceptance of Flora's dining recommendations, since the recommended restaurants were only o.k. As far as my recommendations for a good meal, I would suggest the following three and would warn against dining at a fourth: Birraria la Corte, San Polo, Tel.: [--], has a menu full of wonderful offerings. However, we stuck to the recommended by a friend arugula salad with thin slices of pecorino cheese all drizzled with chestnut honey, and pizza with porcini mushrooms and wild boar salami. Delicious! Since we were walking all of those calories off, we treated ourselves to a dessert of pana cota with caramello and were ready to lick the plate if no one would notice. We enjoyed a great lunch at Alla Madonna, Calle Della Madonna, San Polo, Tel. [--]. Unfortunately, they do not take reservations and this is the reason we chose to have lunch rather than dinner when the restaurant gets much busier. Both of us had a plate of pasta (I had the best spaghetti with squid ink) and we shared an appetizer of proscutto and melone. Vini Da Gigio, Cannaregio, Tel.: [--], serves traditional Venetian food at a relatively reasonable prices in a very pleasant atmosphere. My fegato veneciano (liver and onions), my husband's branzino (seabass), and our first courses of pasta were wonderful, as was sgroppino for dessert. Now, I would strongly advise against dining at Trattoria da Remigio in Castello, because I cannot recall any other occasion in any other restaurant, either in the States or abroad, where we were treated with such snootiness and disregard as we were at this establishment, and after hearing the same comments from others, I understand that we did not catch the place on a bad day. There are many other terrific restaurant in Venice--pick those instead.", "Date": "October 21, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "USA", "Title": "“Marginal ok but stay eleswhere if you can”", "Author": "RonUSA", "ReviewID": "UR10077045", "Content": "Very small rooms. Bathroom barely useable. Comfortable bed but insect bites every morning. Location is good and the garden is a delightful place. The staff was too formal and the overall atmosphere stuffy to the point of snobby. Don't ask staff for help like where to eat type questions. We received poor service and were charged far too much when we made that mistake. We did far better just walking in on crowded places. Breakfast was the best part of the day there. On the upside, we spent very little time at the hotel. We were out and about all day only using the hotel to change and sleep. I felt the hotel was a bit too expensive for what they offered in the way of services but then again this is Venice and one should expect to overpay for just about everything. Oddly Venice itself is worth it all.", "Date": "October 14, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Key West, Florida", "Title": "“A beautiful Flower in the Heart of Venice”", "Author": "Kittylover", "ReviewID": "UR10077012", "Content": "Originally, I went to the Net to find a Venice hotel. But my daughter was in Venice and stayed at Hotel Flora a month before. She highly recommended it, and personally booked us the biggest suite on the 4th floor. There were 3 of us traveling for 3 nights, and the room was perfect for us. Breakfast was included and delivered to our room, promptly each morning. Our room was huge, with a king size bed, single bed, table and chairs, dressing table and large armoir and dresser. The bathroom was adequate, and would be my only fault of the whole experience. It was very small, but with beautiful tile and new fixtures. The hotel staff couldn't be friendlier. The front desk staff, bartender/waiter, and the bell staff were perfect. The bartender was also the waiter and also the cook! He was so much fun. Every evening we met in the bar for drinks and on one occasion decided to eat there. The meal selection was 2 items, but the quality and price was great. The location was perfect, a short walk from the ferry and St Marks, but be ready to carry your luggage up over one bridge. If you were never in Venice it may be hard to find. In fact, one day when we went separate directions from my daughter, we did get lost for about 20 minutes. However, the location was very quiet at night. Very good mattresses and sleeping. I would highly recommend this hotel.", "Date": "October 14, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Quiet very good hotel in a perfect location”", "Author": "Magsters", "ReviewID": "UR8688606", "Content": "Our first stop in Italy among 5 other cities and all recommended or reviewed on TripAdvisor. Overall, a very good hotel in an excellent location. Not a large, touristy, overpriced hotel (unless you're looking for that), but rather a quiet, secluded oasis just west of San Marco. The best feature is the breakfast area in the middle of a courtyard amid ivy-covered walls, a bird fountain and serenity. It gave us the feeling of being in a quiet romantic Tuscan villa. We travelled with 2 children ages 9,12 and our room was one queen and 2 temporary cots - large enough for our 2-night stay. Very nice rooms but padded with fabric (although no mustiness or odor was detected). Highly recommended, helpful staff. NOTE: Save 100 euro by avoiding the overrated gondola and instead spend 100 euro by taking a private water taxi to a stop just 1 minute from the hotel. Much better view of Venice from the outside and through the main canal. 45 minutes direct by water taxi may also avoid the longer but cheaper route by public transportation. See my photo of the courtyard, as peaceful as it looks.", "Date": "September 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Romantic, quiet and central: perfect!”", "Author": "BippyBee", "ReviewID": "UR8508650", "Content": "We stayed here for Carnevale and it was instrumental in ensuring we had a fabulous time. Our room was small but it was beautifully furnished, and it felt and looked exactly as a cosy, romantic Venetian hotel should. (Larger, and rather opulent-looking rooms are available, I discovered, as I peered in a couple whilst they were being cleaned...Presumably they cost extra: we went for the cheapest.) There is a bar/lounge area downstairs, so after a long tiring journey we were pleased to be able to order a couple of bellinis, and it was nice to be able to pop back to the hotel at the end of an evening out and enjoy a brandy or two. Despite being really close to St Mark's and off a busy shopping street, the hotel itself was really quiet, and it really felt like a little secret hideaway in the midst of the crazy carnival crowds. I really don't have any criticisms of this hotel at all: for Venice it wasn't badly priced, considering location, tranquillity, furnishings and overall standards of cleanliness. The staff were nice and friendly too, tolerating my appalling Italian with grace and charm.", "Date": "August 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“Exceptional”", "Author": "TBird7", "ReviewID": "UR8439285", "Content": "Charming! Staying at the Hotel Flora made our trip to Venice magical. The staff were exceptional! Giovanni especially, whose suggestions of where to go, where to eat made our holiday more than we could of asked for especially the dinner at restaurant Monaco. Our room captured a true venetian atmosphere and was very clean and in the height of summer was very cool. It overlooked an internal garden which captured the true secret garden feeling. This is where we had our wonderful breakfasts watching small birds enjoy the water fountain whilst we took in the scent of the flowers surrounding us. Location was superb and very central, a short distance from San Marco, shopping, restaurants and the Grand Canal. A small note to anyone visiting Venice travel lightly and if parking a car call the hotel to find out which car park they have a discount with. We will be back....Thank you again Hotel Flora.....truly magical and in fact we couldn't bring ourselves to leave and extended another 2 days!", "Date": "August 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Switzerland", "Title": "“Charming with good location”", "Author": "Msafiri1", "ReviewID": "UR8130353", "Content": "Located not far from St Mark's Square, this hotel offers good value (by Venetian standards) in a charming conversion of an old palazzo.", "Date": "July 16, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montana", "Title": "“A gem in the middle of Venice!”", "Author": "RockyMontana", "ReviewID": "UR7631243", "Content": "Hotel Flora is nestled between stores on a lovely shopping street but placed back off the main traffic area (foot traffic, of course since there are no automobiles in Venice). It is very quiet, the staff are extremely helpful (tried valiently to locate my lost baggage) and the best part is the beautiful courtyard where breakfast is served in the morning and wine in the evening. The hotel serves a limited-menu dinner, however, we did not eat there. You need to ask about it, they don't advertise. The rooms were small and bathrooms smaller! but with oodles of charm and romance - also very clean! We would stay there again and hope we can soon!", "Date": "May 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4"}, "AuthorLocation": "chicago,illinois", "Title": "“Wonderful place to stay in Venice”", "Author": "Matt500", "ReviewID": "UR7331341", "Content": "The Hotel Flora is a wonderful place to stay while touring in Venice. It has a very central location- near the San Marco Square. They also have a very nice breakfast buffet that comes with the room. We had a very charming room overlooking a garden. The staff was very helpful. Also, there is a very charming room for cocktails and a place to relax. This place is a real find, and I highly recommend it..", "Date": "April 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Springfield, MA", "Title": "“This hotel and Venice were both a nice surprise!”", "Author": "Suess567", "ReviewID": "UR7191430", "Content": "We drove from Milan and took the waterbus to San Marco. We had trouble locating the street/alley address on our map for the hotel. A helpful man on the waterbus gave us directions. After a long day of driving Italian style (scary!), we were happy to find this lovely hotel. Our room small but very clean and quiet. My aunt was happy to have two twin beds instead of the usual one single bed. The breakfast buffet was extensive and was a nice way to start our day of sightseeing. Venice is beautiful and the weather was sunny and warm. Took an waterbus to Lido and walked across the island to the gorgeous beach. Had a great time.", "Date": "March 19, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London, UK", "Title": "“Choose the superior deluxe room”", "Author": "felicityLondon", "ReviewID": "UR6640539", "Content": "Perfect location - less than 5 min from San Marco, down a quaint alley offf the designer shops street. Hotel lobby/public rooms - very small entrance, rather dated interior and did worry me about the room. considering the hotel is not cheap, the public areas don't really encourage you to sit and relax with other guests. Room - This is what made me love my stay at Hotel Flora. We chose the superior deluxe room on 3rd floor i think. The room was very large, the bed was huge and the decor was venetian and antique wood. The space was truly beautiful and what I imagined a venetian bedroom would be like. I did have a nose in another room next to ours which was considerably small and pokey - rather surprising. I think the key is to book in this smaller hotel but only go if you get one of the best rooms. Service - Very pleasant, helpful but not as fantastic as others have made out. Breakfast - We had breakfast delivered to our rooms as the lounge area downstairs really wasn't that great. I understand the norm is to have it in the courtyard, which is pretty, but too wet in winter. Consisted of cereal, croissants, OJ and tea. Very simple, not a great choice or fantasically fresh, but fine for us. So, in all, I would definately recommend this but only if you get the best room. We compared prices to the Grand Monaco and had a look at the rooms - swish entrance but the superior rooms were tiny, standardised and although you got a canal view the windows were pokey. After that, we realised our hotel was a true Venetian experience", "Date": "January 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Surrey", "Title": "“Brilliant find”", "Author": "161205", "ReviewID": "UR5797391", "Content": "We have just returned from a 3 night stay at the Hotel Flora and would recommend it to any visitor to Venice. Tucked away off one of the nicest streets near St Mark's Square with it's own beautiful courtyard in which to enjoy a lovely breakfast or an evening drink. The bedrooms are small and simply furnished in a classic Venetian style, however this added to our whole experience. The staff were so friendly and couldn't have been more welcoming. You'll definitely have to look hard to find this hotel, but it's well worth it.", "Date": "September 13, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Maine", "Title": "“Perfect spot - right in the heart of Venice”", "Author": "rsg62", "ReviewID": "UR5794805", "Content": "We stayed at the hotel Flora for two nights. It was the perfect location in Venice - down a quiet side street right off St. Mark's. The staff was unbelievably accomodating and helpful. Would highly recommend it.", "Date": "September 12, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "1.0", "Value": "4", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Connecticut", "Title": "“Disapointed”", "Author": "Traveler082006", "ReviewID": "UR5619482", "Content": "Hotel Flora location is good, just a few minute walk to St Marks Square. The courtyard is a nice place to have breakfast and relax at the end of the day. The room furnishings need to be updated, chair was worn and a bit dirty looking. I awoke with many bug bites on legs and believe it came from the bed. The bathroom was very small. Overall I would not return because of the bug bites, which are still visable after 2 weeks.", "Date": "August 17, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pasadena, California", "Title": "“Charming, well located, comfortable, outstanding service”", "Author": "DrWeniki", "ReviewID": "UR5518750", "Content": "I really, really liked the Hotel Flora. Charming, very pretty, great location. Website's photos are very representative of hotel. Just 2-3 minutes from St. Mark's Square and the St. Mark's Square vaporetto exit (and thankfully, only one bridge with steps cross), and on a well marked alleyway just off the \"Rodeo Drive\" of Venice, the Via 22 Marzo, not that street names mean anything here. Totally by luck, my vanDam StreetSmart Venice map that I had brought with me had the Hotel Flora marked on it. So, I actually knew how to find the hotel (not an easy thing in Venice!) Venice was horribly hot, so we appreciated the best AC we've ever had! Lots of Americans here. After our long, hot journey via train and overcrowded vaporetto feeling cranky and weary from lugging our overstuffed bags thru the crowded streets of Venice, we turned the corner to the charming alleyway well marked by the \"Hotel Flora\" sign from above, the bellman opened the door and walked down to meet us as if they were expecting us. The bellman took our bags from us and ushered us into the well air-conditioned lobby. Indeed they were expecting us as the concierge greeted us by name, quickly checked us in and had the bellman efficiently escort us to our comfortably cooled room. (OK, that's the limit of my journalistic stylings.) The room and bathroom were incredibly tiny, but we did only reserve a standard room. There really wasn't any room for our bags without climbing over them. But, the bed and comforters were just the best. The hot/cold water were plentiful. There was American Kleenex brand facial tissue which was a strange but nice comfort to have! The toiletries and towels were lush. Our 180 euro room was tiny #29 (on the 3rd floor not the 2nd!) and overlooked the lovely courtyard. Judging by the hotel map, looks like larger rooms were available. The included breakfast was nicely continental, and more substantial items like eggs or prosciutto with melon could be ordered and were reasonably priced. The servers remembered us and our food preferences everyday! The concierges were very polite and helpful and gently encouraged us to ask them for help and recommendations with a very non-intrusive \"what are you doing today?\" And then would very politely encourage us to do other things if they thought it would be too crowded and would produce maps and recommendations (my husband wanted to go to St. Mark's first thing in the morning, but the concierge managed to rightly convince him that going in the less crowded afternoon would be better). Again, the concierges were outstanding. Ok, a plus, but in conversing with one of them, found we may be distantly related cousins as his wife and my husband are from the same village in Shanghai of all places. You need a login ID and password from the concierge which is doled out in unfortunately small time increments for the free internet (We'd get only 1/2 hour increments, but I'm sure if we asked for a longer increment, we'd have gotten it.) I'd definitely stay here again for the charm, wonderful staff, great location, beautiful courtyard, comfy beds, best-in-class AC, free wireless internet, totally worth it price, all totally making up for our tiny room (which sort of grew on us). Next time, we'll just maybe upgrade to a larger room!", "Date": "July 27, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Boca Raton, FL", "Title": "“Nice place for the money”", "Author": "MikeandCarmelyn", "ReviewID": "UR5480682", "Content": "Stayed at Hotel Flora for two nights during our honeymoon. The room was a bit drab. Make sure you ask for a courtyard view. I hear the top floor corner room is the best. The staff was pretty helpful. The breakfast (included) was quite nice. The entrance is kind of off the beaten path (down an alley) which I thought was a good thing. The best part about the place (other than the reasonable price for Venice) is the location. The hotel is literally a 3 minute walk from San Marco square and it is very close to the water taxi. I recommend it.", "Date": "July 18, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Alexandria, VA", "Title": "“Room too Small and No AC”", "Author": "emma123", "ReviewID": "UR5225922", "Content": "Yes, it has a great location, just steps from St. Marks, but this hotel was a disappointment, based on our tiny room on the top floor of the hotel (clearly, was originally for staff) and the smallest bathroom on the planet (clearly, there was originally no bathroom in this room). On top of that, because of a dubious \"law\" that said hotels couldn't use AC until June 1, we had none, and sweltered all night when not fending off the bugs. Worst night sleep you could imagine. Stay at the Hotel Mocenigo instead, where we had a blissful three nights (with AC, I might add) in a huge, spotless and charming bedroom with giant bathroom.", "Date": "May 25, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Hove, England", "Title": "“World class”", "Author": "A TripAdvisor Member", "ReviewID": "UR5040182", "Content": "Having spent more than 30 years in the hotel trade myself, I feel strongly enough to write a quick review of the Hotel Flora having just spent three days there. Credit must be given to the owners of this business for assembling staff who are the most charming, attentive and efficient that it has been my pleasure to stay with just about anywhere in the world! There are many reviews on this hotel that explain the location etc, so I would only add that if you do not wish to be disturbed at breakfast time, ask for a room that is not on the ground floor adjacent to the garden area. Otherwise I'd recommend this as a superb hotel in a fantastic city!!", "Date": "May 7, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Houston,Texas", "Title": "“Hotel Flora-Charming small hotel”", "Author": "lonestartravels", "ReviewID": "UR4739538", "Content": "We recently stayed at the Hotel Flora for 2 nights. It is a small, charming but slightly worn hotel. It has the feel of a large villa, rather than a hotel. We had an extremely large triple at the back of the hotel-room 23 with a small, modern bathroom. The heated floor and heated towel bar were a nice touch. The rooms are decorated in Venetian style. The hotel is in a great location, and the concierge provided detailed instructions on how to get there from the train station. A typical Italian continental breakfast was included in the price of the room (205 euros). It was very cold so we were unable to sit in the lovely courtyard in the center. The courtyard filled with iron tables and chairs would be a wonderful place to relax and have a drink at the end of the day. The hotel staff were very attentive. I would highly recommend this hotel to travelers who like small hotels with a flavor of the city which they are visiting.", "Date": "March 28, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Pretty hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4072229", "Content": "We stayed in the Hotel Flora for 1 night (Sept 17). We thought it was very nice. PROS: - pretty hotel - great location - 5 min walk to St. Marks - delicious breakfast - croissants, cheese, fruit, yogurt, etc - pretty garden for breakfast, and pretty lobby, breakfast room, etc - friendly staff - free internet PC in breakfast room - nice toiletries in washroom CONS: - room was nice but nothing exciting and a bit small for the price; hairdryer didn't work - very expensive (230 euros a night) We thought it was a lovely hotel (as you can see by the photos I posted).. we would consider staying here again, but due to the cost and the fact the room was just average, we would probably look around at other hotels too for a better value.", "Date": "October 30, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "NY", "Title": "“A Great Retreat off of St Mark's”", "Author": "travelin'bunch", "ReviewID": "UR4031227", "Content": "We stayed in a 4-bedded family room (2 adults 2 kids) which was huge by Venician standards. The location is barely 5 minutes off of St. Mark's and perfect if you need a quiet retreat that is still within the hustle of it all. The hotel garden is beautiful and a great place for breakfast. It rained for us so we were served in the breakfast room. Be prepared to spend alot in Venice. Dinner might cost you almost the same as a room! Bring boots if traveling soon and be ready for fun!!", "Date": "October 18, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Richmond, Virginia", "Title": "“Location is terrific, hotel is ok.”", "Author": "Julwin", "ReviewID": "UR4028993", "Content": "The Hotel Flora came with great recommendations. You could not beat the location--5 minutes from the Piazza San Marco--but our room was MINISCULE!! We could not enter or exit the bathroom without knocking the hair dryer out of its holder. Our room had a musty smell, but then most of Venice has a musty smell...I wasn't sure if this is the Hotel Flora or Venice in general. Everything in Venice is very expensive and this hotel was the most expensive of our entire trip and the most disappointing due to the size of the room. T I give high marks to the staff--they were quite helpful and friendly--we could not fault our service while there. They arranged for a free boat to Murano as well as arranged our private taxi on our departure. We would not stay at this hotel again due to the high price and very small room...but the neighborhood was excellent.", "Date": "October 17, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Cleveland, OH", "Title": "“Just OK”", "Author": "bitsandpieces", "ReviewID": "UR3997845", "Content": "Here's the ups: Terrific location 5 minutes walk from St Mark's, breakfast was a very nice spread including eggs, breakfast garden was pleasant to look at, bellman were excellent, very close to a canal for private departure to airport. Here's the downs: Hallways were absolutely in need of renovation, room was definitely TIRED, shower head didn't work, had to wait to get a seat at breakfast, if you arrived late for breakfast, there were no eggs left, the construction going on right outside our bedroom window and the breakfast garden. The thing that bugged me most is the dinner recommendation for the Hosteria ai Coristi (restaurant). I should have known better. We didn't even say we were going there, but when we did arrive, our name was on the reservation list (obviously so the guy at the hotel got his commission). If that happens to you anywhere in Venice, run the other direction. Do not eat at this TOTAL tourist trap. I'm not going to waste my time writing why. If you are looking for a nice meal, albeit pricey, try Corte Sconta for fresh seafood or nearby L'Osteria de Santa Marina. If you're looking for a nice hotel, you can do better.", "Date": "October 6, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "San Francisco Bay Area", "Title": "“A Hidden Gem”", "Author": "oxenburgh", "ReviewID": "UR3914008", "Content": "Lovely, pleasant hotel quietly tucked away off the smart S. Marco shopping street. Hearty breakfast included and enjoyed in the walled garden. Waiters and staff are all polity, funny, friendly and helpful. This hotel is so conveniently located, 5 min. walk from arrival by the Alilaguna transport from Venice airport. Equally close walking distance to St. Mark's Square and Vaporetta. Highly recommended for at 3 star hotel and we will definitely go back to this hotel.", "Date": "September 19, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“Adorable-hits the right note!”", "Author": "tcsteve", "ReviewID": "UR3807751", "Content": "Hotel Flora has cute rooms complete with charm, small but useful bathrooms, tv, views and an adorable garden where you can have breakfast or a drink. The location is in the middle of it all yet tucked away from noise. If Venice is the first stop on your trip as it was for us, it is a great place to \"land\" and sleep off a little jet lag and wake up and be really close to the sights and shops of Venice.", "Date": "August 25, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Bothell, WA", "Title": "“A hidden treasure in Venice!”", "Author": "tqj", "ReviewID": "UR3674879", "Content": "Loved every minute of the stay here. The staff is very service-oriented led by their wonderful concierge, Sergio. He handled three changes in our travel plans to other hotels in Italy within a very short period of time during a busy morning. The gentlemen serving the morning breakfast make every effort to learn your name or room number quickly as well as provide a pleasant personality to their service. You are a 5-minute walk from the water taxi (very efficient from the train station) and easy to find. Get off at the first St. Mark's stop by Harry's Bar. Go staight to the main street, turn left and it is a short walk over a small canal bridge on your left. It is set back from the street, thus making it very quiet. The room is a bit smallish, but worked for us. You will appreciate its convenience even more as you walk through the streets of Venice and watch other travelers walking all corners of the city with suitcases and maps looking for their hotels.", "Date": "July 17, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Woodway, Washingon", "Title": "“Hotel Flora was AMAZING!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3638858", "Content": "This was a beautiful hotel, with charming rooms. The garden (where the included, delicious, and energizing breakfast was served) was spectacular. Hotel Flora is very near to San Marco Square and other crowded, busy, tourist-filled attractions, but the hotel still managed to be peaceful, calm, and relaxed. The staff were fun, accomodating, and always helpful. My family loves Hotel Flora!!!", "Date": "July 6, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Loved this boutique hotel!”", "Author": "keira78", "ReviewID": "UR3536231", "Content": "This is probably one of my favorites. It is a small boutique hotel, keeping with the old style of Venice in the St. Mark's Square area. The courtyard is beautiful and you have the option of breakfast in bed, courtyard or in the breakfast room. The waiter is extremely friendly, breakfast is average, and the capps are included with breakfast and are great! FREE INTERNET on the hotel computer. The concierge even arranged a boat trip to Murano, free of charge and we didn't buy anything there. Did I mention? FREE INTERNET!", "Date": "June 7, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Westport, Ct", "Title": "“Nice but not terrific”", "Author": "Barbeque", "ReviewID": "UR3438510", "Content": "I was surprised by the quality of the hotel given the glowing reviews I had seen. This hotel is in a terrific location, with friendly staff, but the rooms were on the small and tired side, and my bathroom was dated and cramped -- I couldn't actually stand up straight in the shower. My room looked onto a wall, but at least the soundproofing was fine --no noise at night.", "Date": "May 4, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Santa Monica, California", "Title": "“Molto bene!”", "Author": "shellm", "ReviewID": "UR2863551", "Content": "Our bathroom was very small, but other than that- excellent! Great value for the $. Good breakfast, charming lobby, friendly and helpful staff. Until I become a millionaire this is where I will stay in Venezia!", "Date": "December 5, 2004"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Zurich", "Title": "“Wonderful Hotel”", "Author": "helmi", "ReviewID": "UR2589075", "Content": "We liked the location, the venetian style of the interior decoration , the patio, the breakfast, the atmosphere as a whole etc. etc.", "Date": "September 21, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Oregon City, Or, usa", "Title": "“The Flora is Fabulous”", "Author": "A TripAdvisor Member", "ReviewID": "UR2576006", "Content": "We took our first trip to Italy in June, 04. We stayed at the Flora Hotel in Venice. It was lovely. A very helpful English speaking staff, and the Courtyard garden was a wonderful place . The location is just a minute walk to St. Marks Square.This was our favorite place we stayed, and can't wait to return.", "Date": "September 15, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Very charming hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR2484506", "Content": "Excellent service, cute patio, and great location. The room was small, but overlooked the patio which made it feel bigger. A bit Old World so the rooms and common areas can be a bit dark, but we thought it just added more character. It seemed like the most European of all of our hotels and actually became the favorite from our trip.", "Date": "August 23, 2004"}], "HotelInfo": {"Name": "Hotel Flora", "HotelURL": "/ShowUserReviews-g187870-d235863-Reviews-Hotel_Flora-Venice_Veneto.html", "Price": "$144 - $400*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">San Marco 2283/a</span> | <span class=\"extended-address\">San Marco 30124</span>, <span class=\"locality\"><span property=\"v:postal-code\">30124</span> <span property=\"v:locality\">Venice</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "235863", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/5a/45/58/facciata.jpg"}}