{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Delhi, India", "Title": "“Charming hotel in the heart of Venice”", "Author": "atoorva", "ReviewID": "UR126700196", "Content": "Its a very good budget hotel. A family run place....superb location and friendly staff. The rooms are clean and comfortable. The place is just 5 min walk from Piazza San Mark and is surrounded by many shops . Very nice bakeries and bars nearby . Breakfast is a fair spread. Though not many options for a vegetarian, it was presented very well. The Wi-fi worked well .", "Date": "March 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Overland Park, KS", "Title": "“Terrific Place to Stay in Venice”", "Author": "NoOceanInKansas", "ReviewID": "UR126327811", "Content": "I went to Italy as part of a Rick Steve's tour a couple of years ago (Venice, Florence, and Rome), and this was the hotel we stayed at during our Venice leg of the trip. This little place was perfect! Getting to the hotel isn't all that easy, but getting to any hotel in Venice isn't easy unless you are staying by a transportation hub (train station, vapparetta station, etc.), as there are no cars/taxis/buses on the Venetian island. From the airport, we took a bus to the island, then got off, walked a bit to the closest vapparetta station, took a vapparetta to the Rialto bridge, and from there is was a walk of about ten minutes to the Hotel Serenissima. It seemed to take forever to get there because we had just gotten off an international flight, were tired, cranky, hungry, and wanted to brush our teeth. ;-> When we did make it to the hotel, we were warmly greeted by the front desk clerk, a lovely young woman, who took our suitcases and let us use the upstairs hall bathroom, even though our rooms wouldn't be ready for several hours. We were able to leave our bags, freshen up, and begin our wonderful adventure in Venice. The hotel was a gem! After we got over the initial shock of how long it took to get there (and again, probably the jet lag talking), we realized it was in a central location, a couple of blocks from St. Mark's Square and the Rialto Bridge. There is also a gondola station around the corner, as well as a small opera house and the typical small squares around the city. Pefect location if you factor out the time it takes to get there, or to leave and get back to the airport. The rooms were quite functional. The room my travel partner and I stayed in was a \"double,\" meaning we had two twin beds, a wardrobe, and a decent sized bathroom. It was located on the second floor, overlooking a small, quiet square out back of the hotel. It was quite lovely to see all the flowers, and watch the owner's golden retriever, Sleepy, play out back. We also had a beautiful Murano glass chandelier in our room, and I think every room had a different chandelier. They were quite lovely! Breakfast was included with our stay, not sure if this was because we were part of the Rick Steve's tour, or if this is something that would be extra if you're not part of a tour group. It wasn't anything fancy, just pastry, yogurt, fruit, juice, and coffee. The perfect breakfast if you plan to be out all morning, taking in the sites. There is no laundry facility here, so if you plan to stay for a few days, either take enough clothes for your entire stay, or head out to the nearest laundrymat, which was a fair little walk away. The bathroom in our room was very functional. It had a bathtub, bidet (which was new to me!!), a sink, and regular toilet. One thing I would always recommend, and it's not just because of our stay in this hotel, is that you take your own soap with you on a trip to Europe, and maybe even your own towell. Towels are skimpy and the bars of soap are tiny. The hotel is located on a charming side street close to everything. Oh, I forgot to mention that there is a Burger King right around the corner if you miss your American food. Believe it or not, there were quite a few people eating there, although I don't understand why you would want to. I would highly recommend this hotel for a stay in Venice. You could certainly stay in one of the \"chain\" hotels, but they aren't located on the island, and since the transportation closes down in the evening, you would totally miss out on St. Mark's Square and gondola ride at night. I plan to take my husband to Venice some day, and this is definitely the place we will stay. Great location, friendly owners, clean, affordable. What's not to love??!!!", "Date": "March 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vlissingen, Zeeland", "Title": "“charming little hotel, perfect location”", "Author": "Siesje", "ReviewID": "UR125026790", "Content": "stayed here for two nights 3 years ago and we have lovely memories of the hotel, the super location and the wonderful magic town of Venice. Thanks to a description placed on tripadvisor we walked straight up to the hotel after arriving early in the morning with the vaporetto from the airport. Luckily there was allready a room waiting for us. Very friendly staff, charming room, french windows overlooking the street below, near all the sights. We loved it! Breakfast: tea, coffee, orange juice, bread, crackers, some yoghurt, some fruit, enough to get started. All in all a very romantic stay in a very romantic town.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Monterey, California", "Title": "“Great Location”", "Author": "Katiel7", "ReviewID": "UR121472513", "Content": "This hotel, while small, was extremely charming. We had two rooms, side by side and found them to be small but nicely appointed. The beds were extremely comfortable for Italy - where we found hard mattresses were the norm in several other cities. The family that runs the hotel is extremely helpful should you have any questions or need directions (which definitely come in handy while in Venice). The location is wonderful as you are only minutes from St. Mark's Square one way and the Rialto Bridge vapporetto stations the other. Also, there are several shops and restaurants very close. The hotel is quiet, with a good breakfast, with warm croissants that are delicious. A wonderful place to stay while in Venice, allowing you to experience all the charm this beautiful city has to offer without and extravagant price tag. We look forward to returning soon.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Midlands", "Title": "“Fantastic location for the price!”", "Author": "robsarahsadventures", "ReviewID": "UR120082042", "Content": "A very comfortable hotel, especially for the price & in a fantastic location between the Rialto bridge & St Marks square. The hotel staff were extremely helpful & friendly. The breakfast was more than adequate with fruit juice, bread rolls, croissants, jam & coffee etc. The rooms were very clean & the bathroom was immaculate with fresh towels every day. We couldn't fault the hotel at all other than there wasn't a lift (no problem to us) & only a shower head on the bath with no curtain, so we had to have a bath. This didn't detract from the enjoyable holiday. Would definitely stay there again if/when we return to Venice.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Nice budget hotel”", "Author": "Hillegersberg", "ReviewID": "UR119233409", "Content": "Nice budget hotel in a great location, between the Rialto Bridge and Basilica San Marco. Breakfast is doable, staff friendly, rather noisy, but as I said before, you can't beat the location.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "israel", "Title": "“we had no choice”", "Author": "Mysuitcase5", "ReviewID": "UR119097924", "Content": "since the hotel we booked had a plumbing problem we were put there for one night . Not a hotel I would choose, very small room, no elevator and not very clean ( the garbage in the bathroom was from previous guests!) as well the noisy airconditioning was leaking so that the floor was wet. The breakfast was very poor. The only plus frendly staff.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oklahoma", "Title": "“Nothing to get excited about.”", "Author": "mdw50", "ReviewID": "UR118576305", "Content": "The best thing about this hotel was the recommendation for a good restaurant from the desk clerk. The lobby is tiny and there is no elevator or guest computer tho I was told there was wi-fi if you have your own device. The window was open when we arrived and we had to kill a large dragonfly before we could go to bed. Thank goodness they had air conditioning as we had been warned about mosquitoes. The breakfast was not satisfying and we ended up walking about a block to purchase a better breakfast.", "Date": "September 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Great hotel & you can't beat the location!”", "Author": "blana78", "ReviewID": "UR116118342", "Content": "Serenissima is a wonderful little hotel halfway between Rialto & San Marco. The common areas are beautifully decorated and, while our room was plain, it was perfect for our needs. The staff were helpful and friendly. Only drawback is that there's no elevator, so if you're on the top floor, be prepared!. If I ever get to go back to Venice, I will probably stay there again.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London", "Title": "“PERFECT”", "Author": "Anna2946", "ReviewID": "UR116033309", "Content": "Perfect hotel, excellent location, lots of character, lovely staff, good breakfast, wifi for free, amazing price for venice with the quality you get, everything you need, would stay here everytime i come to venice", "Date": "July 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Perfect for a few nights stay”", "Author": "Snk1774", "ReviewID": "UR115918938", "Content": "Great little place. Clean and comfortable. Paid 80 euro per night for three nights. The service was great. Would recommend this if you are on a budget.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fyn", "Title": "“Fantastic”", "Author": "MetteHanning", "ReviewID": "UR115747190", "Content": "I, my husband and our 10 year old daughter, arrived to Venice by train. Following the signs to the Rialto Bridge, we easily found the Hotel La Serinissima. You can choose to take the waterbus, better if you are carrying heavy bagage. At the Serenissma we were welcomed in a very pleasent way, and one of the staffmembers helped us carrying our bagage up the stairs. The room was great, with windows facing a quiet backcourt. Everything very clean and nice, the bathroom with bathtub too. Breakfast, youghurt, bread, brioches, coffee, tea, etc....not overwhelming but ok. We found that this place fulfilled our needs, a nice place to stay and a very kind staff. Located near the Piazza San Marco, Ponte di Rialto, who can ask for more!", "Date": "July 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "worcestershire", "Title": "“Excellent location”", "Author": "lazyh7", "ReviewID": "UR110546979", "Content": "Location is star point for this hotel less than 5 minute walk from Rialto bridge and St Marks square. Double room we had was small but comfortable and clean with a decent shower. Staff were very all very friendly and helpful. Although a basic hotel would recommend it as a place to stay in the heart of Venice.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Excellent location, great staff”", "Author": "PWRBECKS", "ReviewID": "UR109308949", "Content": "The Serenissima is centrally located, family operated hotel. The \"mama\" runs the kitchen and helps at breakfast time, the friendly family dog hangs around. The single rooms are as expected by europe standards, small bed (but comfortable), very small bathroom. No elevators, wifi access for 3-5 euros. Breakfast room, were mama serves rolls and juice. The hotel is centrally located and near St. Mark's square, Rialto bridge, Doge Palace, etc. Also near shops and restaurants", "Date": "May 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "West Chester, Ohio", "Title": "“Nice, but ask the right questions.”", "Author": "kathysommer", "ReviewID": "UR107842690", "Content": "Stayed here as part of a group tour. Found the rooms very clean, gleaming porcelain and plenty of towels. However, make sure you ask for a shower if you're over 5'5\", as we had only a very narrow soaking tub. Breakfast was minimal. Location couldn't be better, and we found it very easy to learn the city from here.", "Date": "May 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“Great location!”", "Author": "Anita19111493", "ReviewID": "UR97384651", "Content": "Good price, good size rooms, friendly staff, great location, clean and smells well. The draw backs are: no elevators (but I think this is typical in Venice), they keep their golden retriever inside the hotel (I am sure some people are allergic), we got a two twin sized beds next to each other instead of a full/double bed. This is a good hotel, but the bed issue was not acceptable for me. Still I would recommend the hotel, but would give warning about the bed to couples. PS: Checking out can take a few minutes so try not to leave in a hurry. Also the hotel is a little outdated but that is not a problem for me.", "Date": "February 21, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Pompano Beach, Florida", "Title": "“Manager was extremely rude - DO NOT STAY HERE”", "Author": "TFrall", "ReviewID": "UR91836153", "Content": "After making reservations in person, we walked from another hotel on the opposite side of Venice with 3 small children & luggage to stay one more day in Venice. Upon arriving, we were denied our room because of our children. The person who made our reservations denied ever seeing our children with us and the manager would not check us in with the kids. He then proceeded to begin insulting us in Italian and my husband's Argentine heritage (after he saw his passport). Never in my life have I been treated with such disrespect! I would not recommend this hotel to anyone. The manager told us that he did not care if we had to sleep on the street while my daughter cried her eyes out!", "Date": "January 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Hotel with great value and location”", "Author": "alex1liz", "ReviewID": "UR88799049", "Content": "Hotel is located almost at midway point between St. Marks and Rialto Bridge which was great. For its location, it is a great value. Our only complaint is that the hotel staff was a bit stuffy. They didn't have local places to recommended and seemed annoyed that we had asked for restaurant recommendations. We had free internet with our package but they refused to give us the password for the last night we were there which was odd. Besides the staff, the hotel was great. The rooms were a good size and clean. The hotel was at a great location. I would recommend though asking for a room away from the breakfast room if you like to sleep in. The breakfast was very good. Overall, it was very good for the cost.", "Date": "December 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great Experience/Great Hotel”", "Author": "Smitkis", "ReviewID": "UR76817912", "Content": "The Hotel Serenissima was fantastic. The price was very reasonable and the location was right between San Marco Square and the Rialto Bridge. Very clean and nicely ran. Quiet, yet next to everything you need to be by. Walking distance to everything. We had three rooms with ten people. We all had an amazing time and an amazing stay at the hotel. Watch your head with the pigeons though.", "Date": "August 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Arlington, VA", "Title": "“Charming hotel at a great value”", "Author": "shortiiee21", "ReviewID": "UR75941553", "Content": "My husband and I stayed here for one night when we got back from our Mediterranean Cruise. We picked this place because it was cheap and got good reviews from other people. Our cruise ship arrived back to Venice around 8am. From the port, we took a water bus from P. Le Roma to San Marco. The hotel was about a 5 min walk from the water bus stop. There were a couple bridges we had to cross which is not fun when you are carrying several pieces of luggage. Since we were checking in early, our plan was to drop off our luggage and then roam around Venice until our room was ready. Surprisingly, they told that our room would be ready in a hour. Our room was on the second floor overlooking the main street. For the price we paid, the room was a great size with cute vintage furnishings. The only complaint I had was that we could hear people entering and walking through our hallway. The best part about the hotel is the location. It is conveniently located between the Rialto Bridge and St. Mark's square. We had lunch near St. Mark's went back to hotel and hung out and then ate dinner near the Rialto Bridge. We didn't stay long enough to get to know the hotel staff. I would definitely recommend this hotel to people who don't need the frills and are just looking for an affordable place to stay that is in the heart of Venice.", "Date": "August 19, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Berkeley, California", "Title": "“This hotel is centrally-located yet has quiet rooms.”", "Author": "JohnMuirLib", "ReviewID": "UR66783206", "Content": "This hotel is right in the heart of things on a busy street, yet it is easy to sleep here. The beds were excellent, the service was excellent, and the breakfasts were more than I ever expected. The room is a bit small with the big bed in the middle of it. You do have to walk up a couple sets of stairs with your luggage to get to the reception desk, but it was well-worth it.", "Date": "June 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Arvada, CO", "Title": "“Great central location”", "Author": "Aliciak_r", "ReviewID": "UR65205316", "Content": "This hotel is a great bargain. Our room was small and clean. The bathroom was small but clean as well; just big enough to get ready, and certainly not suggested for those traveling with small children due to the lack of a tub. Friendly staff, GREAT central location, good price/value, cheap internet. Hotel does include breakfast, though its not anything spectacular, which is typical for Italy. SUMMARY: Those wanting a good value hotel in an ideal central location should book here. Leave your American expectations at home and remember that Italy boast wonderfully charming old buildings :-) PROS: - Great central location (very short walk from the Rialto vaparetto stop) and half way between San Marco and the Academia - Includes breakfast - Inexpensive internet (only 6 Euros for 24 hours, which are only counted when you are logged into the network) - Friendly and helpful staff CONS: - No elevator/lift. - No other cons really, definitely not recommended for those with small children ** Note: I gave the sleep quality a 3 of 5 stars because I personally found the bed to be stiff and uncomfortable; however, I have a sleep number bed at home so my opinion is very tainted.", "Date": "May 24, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Clean, quiet and convenient”", "Author": "Triggersue", "ReviewID": "UR60022353", "Content": "We saw this hotel in a guidebook and booked over the Internet. Confirmation was quick and rate was very reasonable. We heard that Venice can be very expensive, so we were not expecting too much from the hotel, but were pleasantly surprised by its humble charm. The staff were friendly and helpful. Our room (#154) was nicely furnished; headboard, table, and armoir painted in light blue and accented with flower pattern. Very quaint. Bathroom was surprisingly spacious. Room looked out onto inner courtyard that was very quiet. Breakfast was simple, bread rolls and croissants with coffee/tea and selection of yogurt. Location was excellent! Very convenient to all attractions. 5 minute walk to Piazza San Marco and Rialto Bridge. Close to restaurants and boutiques. Would definitely stay there again!!!", "Date": "March 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Handy place, did the job”", "Author": "caitni2000", "ReviewID": "UR48396343", "Content": "Went to Venice to sight see and needed somewhere central just to lay our head. Hotel Serenissima was recommended to us and fitted the bill perfectly. Its small and clean. Unfortunately two single beds pushed together and beds a little creaky, but all was clean and a perfect location. Breakfast was simple and nice - fresh coffee and breads. Perfectly central to St.Marks and Rialto. Everything in Venice is so expensive. We paid 100euro for 2 B&B. Elsewhere this would have been expensive, but in Venice it was the most reasonable and central we could find.", "Date": "November 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Good value in the middle of everything”", "Author": "swede1102", "ReviewID": "UR25499985", "Content": "Venice is expensive, but this hotel gave us an affordable option for a quadruple room. The hotel is cozy, but the room was small for four people. Nevertheless, it was good value for the money we paid, particularly when I compared to the options we had. The great thing with this cozy hotel is that it's in the middle of everything. A five minute walk from San Marco Square and a five minute walk away from Rialto Bridge. We wanted to experience Venice for a few days before we continued to Slovenia, and Serenissima gave us the opportunity to do so at an affordable price. Breakfast was nice and included in the price.", "Date": "March 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Panora, Iowa", "Title": "“Cozy, Private Hotel Amid the Chaos that is Venice!”", "Author": "amandalynn0220", "ReviewID": "UR24005334", "Content": "What a lovely hotel! We loved our stay, we loved the location, we loved the breakfast, we loved the staff....not much more can be said! What a bargain, and what a perfect escape from the hoards of people (and the heat). A couple small tip:, wake up early and take a small rest at midday. You will see and accomplish much more! Also, for meals, walk an extra 5 or 10 minutes from the hustle and bustle to find a restauraunt. There is exceptional food in Venice; you just have to find it!", "Date": "January 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Northport, NY", "Title": "“Venice is magical!”", "Author": "SoLucky2Travel", "ReviewID": "UR21012997", "Content": "Stayed here for two nights while on our Rick Steves' 17-day Italy tour. A perfect location in Venice, just steps away from San Marco and Rialto. Small and traditional, but clean and comfortable. Besides, you're in Venice! Who cares if the bathroom is small and you have to walk up stairs to your room! Breakfast was included in our stay and it was fine. But don't linger at the hotel--get out and enjoy this magical city.", "Date": "October 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Escazu, Costa Rica", "Title": "“Very good option in the midde of everything”", "Author": "JaimeQ", "ReviewID": "UR18069968", "Content": "We selected this hotel from the Michelin green guide and found it to be very well located, a friendly athmosphere and staff. We recommend it to anyone traveling to Venice. DonÂ´t miss the island tour, specially Burano and Torcello.", "Date": "July 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Hertfordshire", "Title": "“Wonderful location and a friendly little hotel”", "Author": "MissyW13", "ReviewID": "UR16469010", "Content": "We were recommended this hotel and it turned out OK. It is in a great location between Rialto and San Marco in Venice. In Venice terms the rates were competitive/cheap however as the most expensive hotel we stayed on for our trip I'm not sure on value for money. However the receptionist was very friendly, helpful and welcoming and though the room was small it didn't really matter as we were out most of the time. The bathroom was very small and I'm not sure the air conditioning worked. I heard another customer asking on this and being assured it was on but I'm not convinced. The breakfast was quite basic but nice and the staff for this friendly. Can't be beaten on location and we enjoyed our stay.", "Date": "May 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rotherham", "Title": "“Just right for the perfect break.”", "Author": "Jane G", "ReviewID": "UR14164127", "Content": "After being confused with the many options and locations to stay within Venice I am so pleased I booked the Serenissima. The location between San Marco Square and Rialto Bridge was brilliant. The family run hotel was very friendly, very clean and all their recommendations for where to eat were perfect. This was important to me as I was a woman on my own. It wasn't important to me at all that my room didn't have a view and that it was small but adequate. (My 6ft 2in hubby would have had trouble in the minute ensuite though!) They have a small bar and areas off the landings to sit and read. Breakfast is basic with lovely coffee. I have a terrible sense of direction and had trouble with getting the right exit out of San Marco Square. I hope this will help others as it is simple and quick if you get it right! Look to the right of the banners for the Correr Museum. Opposite end to the Basilica etc. The number above one of the shops at the exit you need is 88 and one is called Markus. The exit is marked Per Rialto. There is one bridge to cross and when you get near a 4* hotel and Georgio Armani you will see the sign and the red flag outside the hotel. I was never asked to see my ticket on the ATCV water bus but they were very keen on the Alilaguna from the airport and back. They only take cash at the ticket office at the airport for the alilaguna trip into Venice (12 euro) and if you buy a 2 day (26 euro) etc ATCV water bus ticket there. I got a ticket from the Doges Palace which included the museum there and others at the Correr Museum. They tell you it is good for 3 months but they don't tell you that you cannot re-enter. So I wanted to go back into the Palace as I missed the museum there but you can't go back in! however the cafe at the Correr is great value (if that isn't a contradiction in terms in Venice) as you can sit and look out at the Sq to the Basilica, Doges Palace and Campanile and have a coffee for 2.5 euros. Compare that to 7 euros in Florian where you don't have the same view at all. But was the 13 euros in florian worth it for the iced coffee I had? Oh yes! The weather in early March was very cold and a drizzle of rain everyday. I had a bad cold too but went to a Pharmacy and got some great tablets to stop my nose running so don't let anything spoil your trip. I did find the overload of religious art and over elaborate explanations of the governing system too much on the audio guides. Then the Peggy Guggenheim home was a complete contrast in the opposite direction of Pollock etc. But I embraced it all.", "Date": "March 9, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Rio de Janeiro", "Title": "“Great Location”", "Author": "brazilianwanderlust", "ReviewID": "UR14055410", "Content": "Italy is always a difficult place for hotels, and Venice is a city where you have to be extra-careful. I already used Trip Advisor when I stayed here, nearly two years ago, so I knew what to expect. This is very conveniently located in the heart of Venice, very close to San Marco square, and, most importantly, not too far from the vaporetto stop. It is always a good idea to stay in a hotel in Venice that is easily acessible. The Serenissima hotel has probably seen better days. I remember seeing a framed letter signed by some german writer or actor praising the hotel for its good services back in the seventies or so. But it is not a bad hotel. My room was a bit tight, but Venice was so enchanting that nothing was a problem in the end. This is one of the many hotels in Italy that offers discounts if you pay cash instead of credit.", "Date": "March 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Amazing Hotel”", "Author": "irisheyes3Ireland", "ReviewID": "UR13703242", "Content": "I have just returned from Venice where i had the most amazing stay with my partner in this hotel. The staff were so friendly, welcoming and they could not do enough for us. The owner (Marie) was just divine and like a typical mother to people in the hotel hence the reason why we nicknamed her \"Mama Italia\". The rooms were so cosy and gave a real Italian feel to them. Breakfast was so tasty even serving heated rolls and croissants along with jams, cheeses, juices, tea, coffee or hot chocolate. Nothing was a problem for them. The staff were also extremely helpful with advice on places to go and where not to go which was a real help as it was our first time there. The hotel was right in the centre of all the attractions. The Rialto seems to be the place to go. We were minutes from Saint Marcs Square and minutes from the cafes, shops and restaurants. Overall i would recommend for anyone to stay in this hotel. It was amazing.", "Date": "February 20, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Manchester", "Title": "“good value hotel in a very expensive resort”", "Author": "davejames", "ReviewID": "UR7938380", "Content": "The hotel was very well positioned only 5 mins walk from both St Marks Square and the Rialto bridge. The room was slightly bigger than we had anticipated, after reading some of the previous reviews. If you find that your air cond is not working,just check with reception, because ours had been turned off. It is very stuffy without it. The breakfast was the most basic we have ever had on a holiday, and whatever you do , dont order tea at breakfast. The minute we arrived at the airport , we were parted from nearly 80 euros for public transport and bus passes. This proved to be the way it was for the whole break . Dont be under the illusion that you can do this trip on the cheap,because you cant. We paid generally 10 euros for 2 small beers, and in one restaurant ( AL BURCHIELLO) we paid 50 euros for 2 plain pizzas and 2 beers. The beers were 9 euros each and they took 12% and 5 euros service charges on top. Scandalous! The biggest dissapointment was the attitude of the people that we encountered, working in Venice ie. waiters etc . Niceties and good manners do not exist. We appreciate that a lot of the big cities are this way, but we found Venice to be in a class of its own. We did visit the Lido, ( 15 mins on the water bus ) and we found it a great relief from the hustle bustle of the main areas. I think that we would agree with some of the previous reviews, in that in the future we would stop there , away from the madding crowd. Venice is a place unlike anywhere else, and everyone should visit once. It has great places of historical interest with fabulous churches and palaces. All in all it was too hectic to be romantic,and too expensive to really enjoy yourself. Pay a visit , but dont stay longer than a couple of nights.", "Date": "June 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Portland, OR", "Title": "“Good little semi-private hotel/hostel”", "Author": "Delorean", "ReviewID": "UR7836947", "Content": "Overrall very nice. The check in office was two minutes from the train station, and very easy to find. The room itself was just two minutes from San Marco square, with a guide to lead you there from the check in office. That's a great set-up - I never would have found it myself, without a guide the first time. Air conditioning worked great, which is a must-have for me and more rare than it should be. Room was nice - beds were pretty basic, though. Paid for an \"ensuite\" bathroom, and it was actually down the hall. Don't think I shared it with anyone - I think it each room had their own bathroom...they just weren't connected. Next time I'll try to stay in a more expensive, brand-name hotel. If I had to do it again on a budget, I'd consider this again, mostly for the location.", "Date": "June 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Fantastic location”", "Author": "choward1", "ReviewID": "UR7645978", "Content": "Fantastic location - minutes from San Marco in the heart of it all, the hotel is very clean, the room and bathroom were a little small but perfectly adequate. There is no safe in the rooms but I always felt the hotel was safe - reception was always manned. The hotel is very quiet at night as they did have carpet in the hallways unlike a lot of hotels in Italy where tiles are the norm. However there was NO LIFT in the hotel and I don't think there were any ground floor rooms. Breakfast is just crossaints and rolls as in most hotels in Italy. The hotel staff had good English and were reasonably friendly. The map on the website looks basic but in actual fact is very accurate and easy to find the hotel from Rialto bridge. Venice is an experience - a definite must on any travellers wish list. Throw your map away once you find the hotel, most streets aren't listed on any map and it is literally a maze of alley ways and canals so be prepared to get totally lost! Venice is extremely safe, I was in Florence and Rome aswell and definitely felt most at ease in Venice. San Marco is beautiful at night and I was lucky enough to be there at high tide so it was great to see it partially flooding - not so great for the restaurant which had to close due to this but great atmosphere around the place. Make sure you go to San Giorgio and for â‚¬3 you can get a lift to the top of the campanile - the views are amazing! Check the times it opens at though as there is nothing else there - the church also opens at the same times - I think it is open from 2.30 - 5.30 in the summer. The Guggenheim museum is a waste of money - very small for the price you pay.", "Date": "May 19, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rio de Janeiro, RJ", "Title": "“Excellent location!”", "Author": "AroldoSilva", "ReviewID": "UR6598786", "Content": "booked via [--] Location Excellent, a few steps to San Marco square. is a trully bargain in Venice The Staff Friendly and polite. The room Small, but confortable. Air conditioning working well, essencial in the summer of Venice.", "Date": "January 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cardiff", "Title": "“Safe and sound”", "Author": "SKYEYE", "ReviewID": "UR5707763", "Content": "After a dreadful start to our stay in Venice when we were presented with a dingy b&b, we found this hotel in a super spot just round the corner from St Mark's. The staff were so friendly and welcoming. Although we arrived on their doorstep asking for a room for the next night, they were able to provide us with a great deal that was within our budget. The price was not much higher than dingy b&b and the quality of our room was superb. The service from all the staff was excellent - the porter even carried our suitcase to the room. If you like modern art you will have a real treat walking through the corridors of this hotel... So if you want somewhere to stay on the island we definitely recommend this hotel.", "Date": "August 25, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bath, UK", "Title": "“Value for money”", "Author": "Molepolole", "ReviewID": "UR5544940", "Content": "We are a family of 4 and we stayed for 3 nights in mid-July. Pluses: Very central location (3 minutes from San Marco, 5 minutes from the Rialto), friendly and helpful staff (especially the owner), air-conditioning in the bedrooms (it was 42C in Venice both days we were there), clean, inexpensive for Venice. Minuses: very poor breakfast, no lift. The bedrooms were small but that's normal in Venice", "Date": "August 2, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "New York City, U.S.A.", "Title": "“Great value”", "Author": "Remanso", "ReviewID": "UR5325563", "Content": "My wife and I stayed 6 days. The room was adequate size, very clean, decent bathroom. The personnel were generally friendly and helpful, and the location is superb. The only negative was the mediocre breakfasts. But for Venice, where everything is very expensive, this hotel is a real bargain.", "Date": "June 8, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "PR", "Title": "“Disappointing”", "Author": "Mildrilla", "ReviewID": "UR5226997", "Content": "Great location, but many negative issues. A/C not working until June as a Hotel rule; didn't have a fan. We had to leave the windows open, no fresh breeze coming in, but mosquitoes and noise from the passage below. Small bar, with no ice for drinks (I asked for Amaretto on the rocks, and it was served w/o ice, which of course I returned). This manager at the counter seemed not to understand english well, and no effort to try or listen, not only with us, but he was kind of rude with other american tourist who left a message for friends and he couldn't get an answer if the message was delivered to them. Staff at breakfast (male) was in the same attitude. Breakfast too simple; small. Staff needs more customer service knowledge.", "Date": "May 27, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Mixed feelings”", "Author": "A TripAdvisor Member", "ReviewID": "UR5067361", "Content": "On the plus side, this hotel is definitely in a great location. Most of the staff were charming. I enjoyed the breakfast and my room had internet access which was a real bonus for me. On the down side, considering the other reviews, I think I must have been unlucky in terms of the room I was given. I don't mind small but this was also dark, the walls were very thin and I was next to two toilets. I could hear the toilets being used in excrutiating detail and then flushed so loudly as if they were right next to me. My toilet also 'gurgled' quite a bit (these building's and their plumbing are admittedly pretty old). Also, if I opened the window for even a short while during the day, mozzies came in. I asked if they had anything to help get rid of the mozzies and was advised just to keep the window shut. Basically I had a choice then -fresh air of mozzie bites. The mozzies, plus the toilet noises meant I had quite a few sleepless nights and I stayed for a week here so this was a problem. There were a couple of other issues - I don't think my sheets were changed during the whole 6 days. The cleaners came in twice when I had the 'do not disturb' sign out. Finally, the shower head was placed at mid-calf-level (I've included a photo) which meant I couldn't stand under the shower at any point but instead had to shower one-handed (not much fun when trying to wash your hair!).", "Date": "May 14, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Beaufort SC", "Title": "“Outstanding hotel with atmosphere”", "Author": "A TripAdvisor Member", "ReviewID": "UR5040525", "Content": "This is a 30+ room hotel tho it seems a bit smaller. The rooms are of decent size for Venice, and kept very clean and neat. The service is excellent, the prices very reasonable. Baths are a bit small, but quiet clean and adequate. The family who runs the hotel are very helpful, absolutely honest, and very knowledgeable. They speak English excellently. Maids, porter are friendly and helpful. The breakfast is included and is simple but adequate. Try to get an interior room as those on the street are noisy. Excellent location, within 5 mnutes of San Marco piazza, and easily reached by motorboat from Venice airport -- the only way to travel really from the airport and worth the 80 or so euros. The art found throughout the house is another sign of the high quality of this establishment.", "Date": "May 7, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Wigan,England", "Title": "“WOULD RECOMMEND TO ALL”", "Author": "daggers", "ReviewID": "UR4964963", "Content": "We stayed for 3 nights from March 14th 2006, booked with Thomsons and got the third night free.Hotel is easy to find from the Rialto water bus stop ( with a map ).Reception / Bar area is small but elegant with lots of dark wood glass and brass.Family run,who apart from the mother can all speak English.Our luggage was carried for us up 4 flights of stairs on arrival,our room was on the second floor with a balcony overlooking the street.Average size with all amenities,and a spotlessly clean bathroom with a powerfull hot shower. Breakfast consisted of cereal,croissants,bread rolls,jam,cheese,tea,coffee and fruit juice which was plentiful and adequate,all wonderfully served by a little old lady who is the family 'treasure'.St.Marks square is literally a 3 minute walk away and the Riato Bridge is about 5 minutes.Great location,Great hotel,we would definately stay here again", "Date": "April 11, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Somerset, England", "Title": "“Excellent value and location”", "Author": "liz.badgers", "ReviewID": "UR4104150", "Content": "We have just returned from three nights at this small hotel and considered the 116 euros per night for a double room including breakfast to be exceptional value for Venice. We chose it because of its location and the fact that it is included in a hotel guide book we use a lot called Small Charming Hotels in Italy. As the weather was likely to be wet and/or cold in November we wanted to be within easy reach of restaurants, shops, Rialto and San Marco. Our room had painted furniture and small but perfectly adequate bathroom with shower. Two friends joined us for the latter two nights and their room was a triple with bathtub. They were also very happy with the hotel - particularly as they didn't need a big breakfast after fantastic dinners at the Marco Polo restaurant nearby. The family members who man the reception are all friendly and helpful (and most speak good English) and the man who carries your bags up all the flights of stairs is unbelievably strong for his size - he obviously gets lots of practice! Don't come here if you are looking for 5star luxury but if you want to enjoy a short break for reasonable money then you should be happy.", "Date": "November 10, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Great value..the others got it right...”", "Author": "uk2Wellington", "ReviewID": "UR3942542", "Content": "This hotel is listed in the Green Guide as a good bet in Venice. Booked for 1 night by phone and felt rate was very reasonable and considerably less than rate listed on back of room door. Family rooms all taken so we took 2 rooms on same corridor. One was charming with blue painted furniture and the other more modern. Both spotlessly clean and comfortable and with effective air-conditioning. Staff all very pleasant and breakfast good although not enough tables for number of rooms so some people had to wait their turn. Only downside is the lack of lift although it wasn't a problem for us despite having small children. Would stay here again - location excellent. Very little public space - just small bar and breakfast room but they still let you leave your luggage/buggy once you've checked out. Large expensive hotel opposite has good restaurant and they were good with the 3 and 6 year old.", "Date": "September 27, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "La Habra, California", "Title": "“A Treasure”", "Author": "travelerforfun", "ReviewID": "UR3899350", "Content": "This family run hotel in a real treasure. I stayed four nights in June of 2004 and again for ten nights in July of 2005. I would NEVER consider staying any place else in Venice. The price is unbeatable. The staff is wonderful and a great source of information regarding restaurants and how to get to various sites. The location is ideal -- midway between the Rialto Bridge and the Piazza San Marco. The rooms are small, immaculate, airconditioned and have individual baths. American frequently complain about the size of bedrooms and especially bathrooms in European hotels. It is true they are smaller than bedrooms and bathrooms in Las Vegas hotels but that is part of the charm of being in Europe. If one requires Las Vegas style rooms one should go to Las Vegas. The one drawback in this, otherwise, outstanding hotel for some might be the lack of an elevator. The stairs are narrow and steep but the desk staff will have bags delivered to the room.", "Date": "September 13, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "2"}, "AuthorLocation": "London", "Title": "“Good value”", "Author": "Clem78", "ReviewID": "UR3737032", "Content": "My partner and I found the hotel easily with the map faxed to us before the stay and the staff were courteous and helpful. The room was small but clean with daily housekeeping. Noise from outside was quite loud and there was also a lot of noise from other guests (there was a chandelier on our ceiling that rattled anytime people above us moved - we had to take it down it was so loud!). Internet access was very useful (we brought a laptop with us) and included in the room price. The breakfast room was a bit dark and depressing and the breakfasts weren't great (croissants and bread with hot drinks) but overall we found the hotel to be well located and well priced for Venice (we booked an internet deal via their website).", "Date": "August 4, 2005"}], "HotelInfo": {"Name": "Hotel Serenissima", "HotelURL": "/ShowUserReviews-g187870-d235835-Reviews-Hotel_Serenissima-Venice_Veneto.html", "Price": "$103 - $260*", "Address": "<div class=\"amenFloat\">", "HotelID": "235835", "ImgURL": ""}}