{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Good choice”", "Author": "Goran T Posted by an Easytobook.com traveler", "ReviewID": "UR128308475", "Content": "The best thing about Hotel Hortus is the location. 15 minutes walk from the Amsterdam Central and with easy access to all main attractions. Botanical Garden is around the corner, ZOO is 3-4 minutes away while Dam Square and Red Light District are 10 minutes away. Area is very quiet and safe. Our room was on top floor and stairs are very steep but for us it was not an issue (others may find it difficult), Room was very basic but all we needed and expected at that price point was a bed to sleep on. Amenities are shared although we had a bathroom in our accommodation (twin room), not sure if it's the case with other rooms. Breakfast is included so we were more than happy with the price. So, while we understand it may not appeal to everyone we were more than happy with Hotel Hortus and would gladly stay there again.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Budget Hotel Hortus Amsterdam”", "Author": "caroline47UK", "ReviewID": "UR127423401", "Content": "very friendly staff, clean facilities, smoker friendly :). Close to Dam Square, stayed for 5days and 4 nights. Will be returning to same hotel in July.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brussels", "Title": "“Ideal for a group trip”", "Author": "Milton R Posted by an Easytobook.com traveler", "ReviewID": "UR127418741", "Content": "5 people room was basic but comfortable. Friendly and helpful staff. Bathroom and toilets were quite clean. Senior travelers might find very difficult to climb the steep stairs.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Helsinki", "Title": "“Excellent location, poor room”", "Author": "tomumo Posted by an Easytobook.com traveler", "ReviewID": "UR126696316", "Content": "I had a slightly higher expectation based on reviews than what I encountered. We spent a long weeking in Amsterdam with my friend and the location (1 km to center) was the main reason for selecting this hotel. We travelled with a friend and paid only 190â‚¬ (combined) for 4 nights. I've stayed in some 20 hotels and hostels from all price ranges, but I'd say Hortus is one of the least comfortable places except for the (mostly) nice and laidback staff. The room we stayed in was nr. 16. Pros: Nice and friendly service from hotel keepers who were mostly from US Fast wi-fi in the lobby Free pool table in the lobby Free insta coffee until 10 pm Cons: No wi-fi in the top floor (3rd) even though it was stated otherwise Cold rooms, heaters didn't work all the time Only shower in the room but no toilet. The communal toilet was really small Very small room and low ceiling (around 3x4 meters) If you don't smoke there might be a distinct smell in the room Very narrow stairways which were being painted during our stay Safe deposit box in the room didn't work", "Date": "March 26, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Stay Here For The ZOO!”", "Author": "wilhelmfink", "ReviewID": "UR126618735", "Content": "This place was so easy to find and an easy tram ride from the Amsterdam Centrale on Tram 9 brought you basically to the front door. The zoo is a short walk from the hotel and there are a few coffee shops close by. You can smoke in the rooms which was a plus when you are Amsterdam :)", "Date": "March 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“great place”", "Author": "dale p", "ReviewID": "UR124132083", "Content": "stayed here for just one night. great place to meet new people and fellow travellers, staff were friendly, though clearly not morning people at breakfast!! stayed in an attic room which was very interesting being over 6ft tall and had to duck all the while! watch out for the stairs, which like every where else in holland they are very steep indeed! very clean indeed and all basic ammenities are available including a safe. breakfast is intersing... a loaf of bread on each table with a toaster and jam,spread,and peanut butter boiled eggs, cheese and ham are also available, along with a hot drink machine. i would stay here again next time i visit. great location, around 15 mins walk to main centre of amsterdam. right next to the zoo and close to the waterlooplein flea market which is very fun!", "Date": "February 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Hell yeah!!!!!”", "Author": "Jodes89", "ReviewID": "UR123520991", "Content": "Hotel hortus .... A big big thumbs up! Would certainly return to stay here ! Fantastic location, excellent service and lovely choice of breakfast. The Americans who run the hotel are cool and friendly and make you feel ever so welcome! Big love to you Brent ;)", "Date": "January 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brno", "Title": "“Great hotel in a style atmosphere of Amsterdam”", "Author": "PietroEllen", "ReviewID": "UR123367403", "Content": "i would like to recommend all of you this hotel. The room was clean, staff were friendly and the location was very good. The rooms werent so modern, they are simple but there were all important things. How Jim Carey said: ,,itÂ´s goooood\":-)P.S. Breakfast are so tasty", "Date": "January 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“Ok for Budget”", "Author": "Marsalex", "ReviewID": "UR123006474", "Content": "The Hotel is okay for budget and short stay. I only stayed for 1 night and skip breakfast since I have to leave early. The room is not very clean but the shared bathroom is clean. They gave me the room on first floor as requested since I am with big luggage and quick response on my email. They have a tea/coffee automatic machine to be used but not 24 hours. They have available PC at the reception.", "Date": "January 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“A song comes into mind ...”", "Author": "JJ_Dragon", "ReviewID": "UR121668578", "Content": "We stayed here as a large group, taking over 4 rooms, so ideal for a large group willing to share. The beds were surprisingly comfortable and the rooms warm. The stairs are alarmingly steep but saying that after a couple of days, you get used to them, even like us upto the third floor! The staff were pleasant and helpful, even getting out the kettle and teabags when we all piled in too late for the coffee machine (which was actually pretty decent coffee). The breakfast was a help yourself to toast, cereal, cheese and eggs affair. The shower temperature was a bit random. You had a shower in the room and the toilets were on the landing - these were very small rooms with air fresheners but not always very fragrant! The other guests could be noisy but that is to be expected in a hostel type room, turns out the neighbours were from the same town as us (evening all!) - so we know what you got up to and who you are! On occassions, you got the whiff of wacky bacy being smoked in other rooms but then that goes for most of Amsterdam too. The downside to this hotel, was the extra guest - we had left some \"cookies\" out and during the night, we could hear rustling and then we clocked a mouse! ..... I saw a mouse! Where? There on the stair! Where on the stair? Right there! A little mouse with clogs on, Well I declare! Going clip-clippety-clop on the stair, Oh yeah - I'm still seeing the funny side of this - to be fair, we saw no signs of mouse before this incident or after. So all in all, if you are looking for a cheap place to stay with a large group, this would fit the bill. Just don't leave food out or you won't get the song out of your head.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Warsaw, Poland", "Title": "“Avoid unles you can stand party behind the gipsum wall”", "Author": "Krzysiek23", "ReviewID": "UR121637816", "Content": "Ok the stairs are narrow and neverending, but it's Amsterdam. The toilet door smashed a hundred times a night, but it's a cheap hotel. Gipsum wall divideng space into super tiny rooms, but's the guests are happy to stay not in the suburb. BUT a nonstop party taking place at night at each floor is too much for those not taking part in it. Screaming, braking glass, running down the stairs... An absolute disgrace! How can you call the place a hotel, even a hostel if you simply can't close an eye at 3 am? Guess what a receptionist said while we complained about the noise. She said that \"people are allowed to make parties in their rooms and Amsterdam is a party town\". Avoid at any costs!", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Cologne, Germany", "Title": "“Only A Bit Nicer Than Prison”", "Author": "gjeva", "ReviewID": "UR119541358", "Content": "I'd like to apologise in advance for the possibly excessive use of upper-case letters. My sister and I stayed here for 3 nights. It was SO AWFUL and uncomfortable, there was nothing we could do but cry with hysterical laughter. It was like we were in a situation comedy. First of all, the infamous stairs - they're ridiculous and treacherous. Can I suggest singing \"Climb Every Mountain\" as you ascend, it adds to the adventure. We had a twin room with a sloping ceiling (under the roof) - meaning, you CAN'T STAND UP STRAIGHT! The walls were literally prison walls - white concrete with no pictures. The curtains were threadbare and had holes burnt through them. The linen, and the room itself, was clean, but the mattresses were so thin you could FEEL THE FRAME BENEATH! All of this I could handle - unbelievably, I've stayed in worse - but what really got to me was the noise. I don't think I slept a wink the first night. You can hear people BLOWING THEIR NOSES in the next room. You can hear people USING THE HALLWAY TOILET. Every person coming and going throughout the night and morning was accompanied by a loud BANG as the door slammed behind them. On a positive note, the people who run the place were lovely to us, helpful and friendly.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "edinburgh", "Title": "“terrible”", "Author": "ketch1973", "ReviewID": "UR119245994", "Content": "myself and a male friend stayed here a couple of nights ago for just one night. I had requested a twin room however we were given a double. seeing as it was for one night we could cope with this. we paid for the room then climbed the neverending stairs to the room at the top. There was barely enough room to swing a cat and it was in a bad state of repair. we both felt uneasy about staying here so we left our bags and left for the day. when we arrived back we decided to sleep in our clothes as we were both convinced these horrible beds would have bed bugs. $50 for this room is really daylight robbery. I strongly advise to never ever stay here at hotel hortus. it really is a disgrace!!", "Date": "October 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Clean and Comfortable”", "Author": "DonMegan", "ReviewID": "UR117598503", "Content": "Basic but Clean, Close to tram, walking distance from supermarket and cafes. Friendly staff, smoking rooms! (weed friendly :D). A good place for a short stay.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“Very good hotel!”", "Author": "betasatan", "ReviewID": "UR116311880", "Content": "the hotel was clean, and just what we were looking for. however on getting to the hotel we noticed we had two single beds, instead of the double we asked for. when my boyfriend asked one of the hotel employees, totally deadpan, he answered 'you just push them together and get a single bed'. other than this slight hiccup everything was lovely. breakfast was simple bread, cereal, coffee etc. they had plenty of information in the reception, and most of the staff were lovely and welcoming. would come back again, provided we get a double bed!", "Date": "August 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "oxfordengland", "Title": "“love this hotel ,”", "Author": "fionabennett", "ReviewID": "UR103302187", "Content": "ended up here after hotel i originally booked had double booked our room. And what a bonus for us that was . hotel hortus was brill we stayed for 3 day and enjoyed ever minute staff was so friendly room small but clean and cosy , bath rooms although shared and on landing was also very clean. a great breakfast. every morning and free tea and coffee all day witch saves us loads of money as they varie from 2.5 euro to 4 euro in most coffee shops . would definitly recommened to other travelers and will be back july 2011 myself already booked", "Date": "April 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Tsukuba, Japan", "Title": "“Good for budget travellers”", "Author": "muuuuu", "ReviewID": "UR98694612", "Content": "The staff were very nice! They provide good breakfast; breads, cereals. Coffee is available until 11 pm. Stairs were a bit scary and the room was very small, but that's good enough for the price in Amsterdam. Shared bathroom was clean. There are computers with good internet connection nearby the receptionist desk. Unfortunately, my sleep quality on that day wasn't so good because the people staying in the next room were very noisy, screaming and knocking doors around 3AM. I know this is not the hotel's fault, but just be aware that you can easily hear noises from outside your room.", "Date": "March 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "coventry", "Title": "“everything i wanted”", "Author": "changinglocation", "ReviewID": "UR98075762", "Content": "i went with 9 other people on a 4 day trip i only have one bad point about this hotel and that was the stairs which i fell down twice although your in amsterdam so you get used it. the staff were very helpful and really nice also. its only a 10 min walk to dam square. we got what we paid for and was happy :o) oh and take a pillow with you as you only get one and its really soft so your head just sinks into it", "Date": "February 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "lancaster", "Title": "“Clean but noisy”", "Author": "rowan5000", "ReviewID": "UR93525901", "Content": "Very clean and handy with the tram just a couple of mins away, breakfast good with a help your self style. Room was very basic but clean so for the price can't grumble. However both nights where very noisy and especially when the the place was filled up with noisy teenagers on a school trip the second night!! adding to this all the doors need a good oil as they squeak like mad and a bit of sanding here and there to stop them needing to be banged so loudly, if the warden was about to tell people to shut up this would have made it so much nicer! on the sunday night when it was quiet it was like a different place!", "Date": "January 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“Excellent choice, friendly staff, and nice location”", "Author": "Khaled3", "ReviewID": "UR87427428", "Content": "I went for 3 days in Ansterdam, the hotel is located in a quiet resedential area to the east of Amsterdam, 5 min walks from the Zoo, and about 12 min from the centre (old/new city). and 15 min walk from the central station. I was impressed by the level of cleanliness of the room and sitting area, where we had breakfast, watch TV, and use freely the cooking facilities. Our room was equiped with nice shower and sink, instant hot water, nice street view. Toiled was shared, but it's OK. Keeley, the owner, was so nice and helpful, friendly with all guests. Internet access is secured via 2 PC in the sitting room, as well as free WiFi. What can I say more, just be carefull, smoking is allowed, and it may be sometimes stinky when cannabis is in use!! and a bit noisy in the sitting room if the other guests are in the \"happy\" mood, again, free tea and coffee all the day, but if you fancy doing it in your room, take a small kittle with you. Generally, excellent value for money, no tricks, close to sightseeing and central station. By the way, most of amsterdam is best seen by walks, no need for tram or taxis, just a little guide will do. I strongly recommend it for a nice budget holiday.", "Date": "November 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“Clean,comfortable,laidback and smoker friendly”", "Author": "JDONE1963", "ReviewID": "UR84754539", "Content": "My husband and I stayed here in early October and would not hesitate to recommend this Hostel to anyone. The rooms are well cared for and clean,the staff are helpful and friendly. Cooking facilitys are available to use and with a good supermarket just down the road makes for a cheap alternative to eating out every night. Will definately be back to stay as soon as possible.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Nice, clean, friendly.. good location!”", "Author": "_chaka_82", "ReviewID": "UR84411059", "Content": "Me and my girlfriend stayed there for 3 nights in the beg of Oct 2010. The room was clean and simple. There were 2 double bunk beds, a safe and a tv, and a bathroom sink. There was no hairdryer but we could ask from the staff. The shared showers were always clean and we only had to wait one time to get in during the 3 days. The staff were friendly and helpful. It is located in a calm area from a 7-8 minute walk from NieuwMarket and around 10-12 mins from Dam Square. So it is nice place to stay if you want to spend a couple of days exploring Amsterdam and stay really close to the downtown.", "Date": "October 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Lowestoft, United Kingdom", "Title": "“watch out theres a bike coming!!!!”", "Author": "iddsy", "ReviewID": "UR82172586", "Content": "stayed here for 3 nights at end of september with partner and another couple.cant understand why there are some bad reviews on here,as we all had a fantastic time at this hostel.staff were friendly and helpful(brent who works the 3pm-11pm shift was especially a cool and funny guy).free tea and coffee all day up till 11pm which was nice after a hard days smoking!!free internet which was a nice touch.room was basic,but very comfortable.hot shower everyday and never had to wait for someone to finish.stayed in room 2 which was a nice size room.for value for money,you cant beat it,slightly further to walk to main center,but we found some good coffeeshops within a few minutes walk(arabica lounge).tram stop round the corner to take you to the center.overall a great,comfortable,chilled and friendly place to stay,and a big thank you to the staff for letting us hang in the lounge on our last day when we were skint waiting for a late flight!! will be coming back here july 2011 with any luck.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Blackpool, United Kingdom", "Title": "“Ok if you are looking for a cheap place to stay”", "Author": "Shiddytripper", "ReviewID": "UR80435019", "Content": "Stayed in the hotel (room 5) and the stairs looked grim at first but there wasnt a lot, missed breakfast every day so cant comment there, the owner was laid back and wasnt pushy for payment. Hardly heard any noise from other guests, room was basic with double bunks although they were comfortable. The hotel was clean enough and the area it is in is quite nice, dont go if you are looking for luxury or creature comforts because there aren't any, all in all a good place to stay if going on a tight budget.", "Date": "September 21, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "istanbul", "Title": "“Great Value”", "Author": "brannant", "ReviewID": "UR79278708", "Content": "went there after reading the reviews on tripadvisor and nothing disappointed me. noisy? some times. clean? shared facilities were always clean location? tram no 9 is one street away and 15 minutes to Nieuwmarkt if you are willing to go \"en foot\" best breakfast and you'll get private room for a cheaper price than any other hostel's dorm price pp. if you want to wake up with the songs of birds from hortus botanicus and dont expect too much, it will be a great place for you...", "Date": "September 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Newcastle", "Title": "“Best value if you just need a bed to sleep”", "Author": "AH81Newcastle", "ReviewID": "UR78504405", "Content": "This place is excellent for what it does. The rooms are as bare as you could imagine, the service is practically none-existent, and it epitomises the term 'no-frills'. It has a communal area which functions as breakfast room, kitchen, reception, and lounge area but absolutely does the job as you're not going to spend much time here. It's basically a hostel but with private rooms and shared bathroom facilities. Don't stay here if you're with family, on a romantic break etc. Do stay here if you're a traveller, backpacker, young(ish) etc. I've been to Amsterdam quite a few times and it's the best place I've stayed in terms of value for money. Good stuff: Cheapest in Amsterdam, pretty much Has all facilities you need (i.e.bed, toilet, shower) Has safe in room, if you're bothered about stuff like this Breakfast included (bread and a toaster on each table, coffee machine, get on with it yourself) Vending machine which sells cans of beer Ridiculously lax 'smoking' policy Laconic staff (doubtless due to the above) No curfew Decent area of town, nice neighbourhood near the zoo 2 PCs in communal area offering free internet The not-quite-so good Possibly 5 minutes' walk too far from the main areas of town but I'm being a bit churlish here and it's definitely worth it Stairs are dangerously steep, but then they are in every place like this in Amsterdam", "Date": "September 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Delhi", "Title": "“AVOID if going with FAMILY”", "Author": "AbhaySingh", "ReviewID": "UR75483442", "Content": "I went to the hotel in the first week of August and didnt like the place, Negatives 1. Its a little far from the main city (DAM Square, Rembrant Sqaure etc). You wll have to take a tram for every plance. 2. I was on the 3rd floor, there are NO LIFTS. the stairs are so small and so steep. U need to be very Careful. 3.Rooms are very very small, 2 beds cannot fit in. We had a bunker bed. 4. There are about 6 rooms on each floor and each room in very very small. You can actually hear people speaking in the other room, and considering its amstredam people usually do not sleap at all. Positives 1. Cost is not very high . For 2 people i has to shell about 65 EURO for a night for 1 room with shared bathroom. 2. The only sight to see closeby is the ARTIS zoo which is like 2 minutes walk. 3. It has 2 PCs which has free internet in the common area. we had an early train so didnt try the breakfast which was included in the 65 Euro for 2 people package. AVOID if not on a Tight budget. Recommeded if going in a big group and tight budget.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Birmingham, England", "Title": "“Best budget hostel in Amsterdam!”", "Author": "Monkeyglands", "ReviewID": "UR69110750", "Content": "We stayed here after staying at numerous places in the past and compared to all of them it was a hundred times better and less than a fraction of the price. The rooms were very well looked after and very clean and tidy, the staff were amazingly helpful and the whole experience was brilliant. Loved every second and I will stay here every single time I return to Amsterdam.", "Date": "June 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sankt-Petersburg", "Title": "“HoStel Hortus”", "Author": "yboris", "ReviewID": "UR66280597", "Content": "Not hotel but a youth hostel - very good for it's price. Friendly stuff. Nice atmosphere. You can play pool in common room. Free wi fi. Smocking in rooms is alloved - in common room only grass. Not far from center (I've never used bus - only by feet). Few nice pubs near the hostel. Continental breakfast: eggs, coffee, tosts with jam or cheese. Shover on the second floor. No toilets in room (only one per floor).", "Date": "June 3, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "AndalucÃ­a", "Title": "“I would never come back”", "Author": "LUNALUNERA452", "ReviewID": "UR64417187", "Content": "The room was small and cold. We had to come downstairs everynight to ask them for turning the heating on. Breakfast was poor. Location and cleaning was ok. The worst thing was that one day they didn't offer breakfast because they were painting the lunch area's walls. They told it to us by writing an asign on the front door. Besides, next day we complained about that. They threw 5 â‚¬ to our face in a very rude way. I wouldn't come back.", "Date": "May 17, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Free Mouse Trap With Every Room!”", "Author": "saladoor", "ReviewID": "UR59162895", "Content": "Hotel is situated within walking distance from the city, opposite the Botanical Gardens and round the corner from the Artis (Zoo). Full of stoners, which I'm not concerned about, hey it's Amsterdam, what more do you expect, in fact was offered some free grass on last day, which was nice, or not depending on your view of drugs. It was unreasonable to have to share a shared bathroom with so many other guests though, our room was right next tot he toilet and the shower (which did not work well) so there was a constant barrage of door slamming. Rooms were ugly, dirty and came with a mouse trap in the corner! The bedding was yellow, so as not to show up any sweat or urine stains. Breakfast was acceptable when owners could be bothered to refill the cheese or ham plate and the eggs were cooked the day or so before hand! The coffee was lovely... People keep complaining about steep stairs but need to get over that, it's Holland, nearly all the stairs are like that! All in all, if your going to stay here do not expect to much, you are not booking the Hilton, you are booking a hotel stoke hostel and not a great one at that, but despite not being very cheerful, it's cheap, and if you have had a few drinks you can even sleep easy...", "Date": "March 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "uk", "Title": "“DO NOT STAY AT HOTEL HORTUS. FIND SOMEWHERE ELSE”", "Author": "preecejon", "ReviewID": "UR50376746", "Content": "I work in a hotel and have done for several years so i think i have a vaid point of view here. iv also stayed in amsterdam 8 times in budget accomodation. im not going to moan about steep stairs or small rooms as i expect that in amsterdam. what i will moan about is poor service, rude staff, unsafe rooms and generally the worst place iv stayed in amsterdam. 1) staff are rude, grumpy, unfriendly, unhelpful. they actually grunt, tut and moan when tidying up! id get the sack if i did that 2) service offeref is a lie. we stayed 3 nights and every day asked if the wifi was on and everyday they just said no and seemed angry we were even asking! on the last day (an hour before check out) the gave us the code to a wifi point that had been there the whole time! and its not that the hotels wifi was broken (which i could understand) it was due to some staff member taking it home! what a joke 3) there is no bar (unless you count cans of beer in a vending machine) and tea/coffee is not available all day, it stops at 11pm and is rarely avaiable in the day. the 3 times i went to get coffee it was empty and again the staff were in no hurry to refill it when i asked. at one point i went for breakfast at 8.10am and with breakfast starting at 8.00am youd expect coffee, right? WRONG. the staff was more intrested in smoking and took until 8.40 for some coffee to be ready! 4) stuffy rooms with exposed pipes that are scolding hot. this must be a saftey hazard as the guest have no way to turn them off and they are HOT and exposed right next to the bed. the window was also faulty and would not stay open without a bottle wedged in between it. there was also shattered glass on the floor in the shower room which had been noticed by staff but not cleared away. i would only reccomend this place to some i didnt like! id reccomend you either pay a little more and get so much in return or try somewhere else of similar price. unless of course you litterly just want a bed for the night (but they may be a health hazard on its own) DO NOT STAY AT HOTEL HORTUS", "Date": "November 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Dubrovnik, Croatia", "Title": "“Don't expect heavens, but good enough for the money spent.”", "Author": "Dubravko", "ReviewID": "UR47350334", "Content": "This hotel has one toilet and one shower per floor but it never got too crowded (and you can go up or down in case of emergency), so had no problems there. Breakfast is quite OK and if you are not too late (it is served from 8 to 10) you'll get eggs and sometimes cheese or ham. Room that we were in was very small but other rooms are normal size. Steps are quite steep, but that is quite normal for Amsterdam. It is clean and usually quiet, except for weekends when lots of young people come in. You can smoke marijuana inside but not cigarettes (in back yard). Close to the town, only 5 tram stations away from main center. Internet is on 2 computers in the hall of which one was out of order most of the time and second one is not slow, it is slower than slowest snail. There is wireless, but due to security issues, they didn't give out password, so...", "Date": "October 20, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Stoner hotel!”", "Author": "nannaskibber", "ReviewID": "UR47067101", "Content": "This place is really horrible. The rooms are clean, but worn down with holes in the carpet, grafitti on the furniture and a horrible, horrible smell of cannabis that surely stems from the fact that you are allowed to smoke in the rooms! Everything is secured to the wall like a juvenile prison and alot of noise from the backyard where people where partying. We stayed there with my boyfriends mother, and had we known this was not a nice, but cheap hotel in a quiet part of Amsterdam, but actually a place to stay for young people getting stoned we would have never booked it. The staff is not friendly or helpful in any way, so I'm afraid I cannot recommend this \"hotel\"in any way.", "Date": "October 17, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "England, UK", "Title": "“Not my cup of tea”", "Author": "polka_dottygirl", "ReviewID": "UR46527879", "Content": "My partner and I stayed at Hortus for 3 nights. It was good in terms of it including cooked breakfest (two eggs and bread), tea and coffee station all day (although they ran out of coffee at night), hot shower facility in double room. However we were on the top floor and had to contend with very steep stairs (not great for older people), our lock box did not work so we had no were to put our valuables and our hot shower tap fell off- We asked the staff on two occassions if they could fix this and sort out the lock box but they had a very laid back atitude and said they will try to sort it before we leave but never bothered. We also had a little visitor in the night (think it was a mouse) and found some poop on the floor and a trap too!! I think this place is good for group stay especially for young people but not good for families or older people. We certainly wont be staying here again....to be honest your prrobably better off paying a little extra to be closer to the Centre and have a more confortable stay.", "Date": "October 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Stoke On Trent", "Title": "“Friendly no-frills hostel”", "Author": "kaylid", "ReviewID": "UR34560591", "Content": "I stayed at this hotel for 3 nights in may and I have no real complaints. Yes the stairs are steep, but its amsterdam, you get that everywhere! The staff were extremely friendly, pointing out the best sights and cafes not to miss. In amsterdam you want somewhere to sleep, and thats about it, there is so much to see and do that you dont need a 5* hotel to come home to, you need a bed and damn good breakfast, and Hotel Hortus gives both! Would reccomend to any groups of travellers/young couples...probably not the best place for family with kids though", "Date": "July 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Edinburgh", "Title": "“What you would expect for the money-Very cheap”", "Author": "JadePolly", "ReviewID": "UR34386171", "Content": "Friendly service, only toast and eggs for breakfast but then it is a travellers hostel so suitable for a couple of days.", "Date": "July 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Glasgow", "Title": "“Great place for the price!”", "Author": "WeHateJimmyHill", "ReviewID": "UR31931672", "Content": "Me and three friends came for Holland v Scotland and were basically looking for somewhere to sleep, nothing more. If you want a five star hotel with room service etc, you wont find it in amsterdam for â‚¬25 a night. If you want a hotel without a steep staircase, you wont find it amsterdam, so stop complaining! There's a difference between stoners and crazed druggies too! We loved this place, granted we were on the ground floor. The breakfast, no curfew, own key for front door, shower, bed, clean sheets, smoking allowed in room, the friendly staff, the vending machines, the free tea and coffee 24/7, even the short walk to the city centre was enjoyable. The only complaint we had was our radiator wouldn't switch off, but nothing major. (And Scotland lost 3-0) I would definitely consider this place again if we ever return to the Dam. Murray, Scotland.", "Date": "June 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "edinburgh", "Title": "“good location but way too noisy”", "Author": "ducksontourEdinburgh", "ReviewID": "UR29179384", "Content": "room was very simple but ok: double bed with sink in the room shared bathroom and toilet the place was far too noisy , we could hear people listening tv in the lounge very loudly and talk playing pool until 4 am... then the staff comes in about 7am so no much time to sleep in between... breakfast is very limited:coffee or tea(no milk) toast and fried eggs(no juice or cheese or cereals...) the good thing is the location", "Date": "May 2, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "England", "Title": "“Mmmmmm.....”", "Author": "Simon016", "ReviewID": "UR27566530", "Content": "Well im not sure whether to slag this place off, or sing its praises. I was here last weekend for 3 nights, we were put on the top floor after climbing the steepest staircase ive ever walked up. The room was a little small for 2 people, but it had a bunk bed which i quite liked. It was good for the price, cant complain about that. But next door to us was a dorm full of annoying teenage boys who were off the leash. They caused so much noise for us during the night slamming doors and shouting that it was a relief to leave on Monday. But as far as everything else went, breakfast included, i couldnt really complain. If i ever come here again, i will definatly ask beforehand not to be put next to the dorm, because im sure the rest of hostel isnt like this. And the location was great too.", "Date": "April 7, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "jenny-smith99", "Title": "“Worst place I've ever stayed in.”", "Author": "jenny-smith99", "ReviewID": "UR27369621", "Content": "Climbed Mount Everest to get to room on 3rd floor. Room tiny, filthy, very thin walls. Crazed druggies running up and down stairs screaming and banging doors all night long. Got 30 mins sleep in whole night. Toast, jam, peanut butter and football on TV for breakfast. Rude, unhelpful staff.", "Date": "April 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "minmi99667", "Title": "“Perfect for the price!”", "Author": "minmi99667", "ReviewID": "UR25484184", "Content": "I stayed here for a week in february and it was exactly what i wanted in a hotel - sure the rooms are small and the stairs are steep, but this is amsterdam fool! You get a nice bed, sink and mirror in the room, big window and most importantly a flatscreen lcd tv. Free breakfast too with eggs on toast if you want. Overall this hotel is everything you could want within the price range - clean, safe and a good location.", "Date": "March 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Overall": "2.0", "Value": "2", "Rooms": "2"}, "AuthorLocation": "Bideford, United Kingdom", "Title": "“lost cash”", "Author": "muzzer11", "ReviewID": "UR21066990", "Content": "It was a ok place to stay as hostels go, as it was more a hostel than a hotel, staff seemed pleasent and helpful. Unfortunatly i could not reccomend this to anyone as i checked out and left my passport behind and wallet with my Â£s in it,(in my room) when i realised and returned to the hotel a hour later it had been handed in by the cleaner, i was so releved to get my passport i didnt realise the Â£70 that was in the wallet had been taken, not untill i was on the plane home, as it was left in the room and i locked the room before i handed the key in i can only assume there is disshonest staff. I phoned hotel and basically i was told tough luck. so dont use this hotel if your on a budget coz anything could go missing! I was hoping to return in the future but never again and i would not suggest anyone else did! good luck, and happy travelling!", "Date": "October 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "leeds", "Title": "“Pretty Sweet Place - Biggus Willus”", "Author": "bigguswillus", "ReviewID": "UR17913693", "Content": "For Â£65 for 3 nights, Its a sweet place, we had 6 in a room, all bunks, and our own shower. Shame we didn't have our own toilet, but having our own shower was a big benefit. Room was clean, big windows etc.... the breakfast was a bit [--], eggs and toast, but there are plenty of bakeries down the road. The big problem was the stairs very very steep and dangerous we were on the top floor, and had 3 flights of stairs to climb..... twisty and steep the area is the plantage bit of amsterdam, tram goes right past, to centraal etc.... Albert heijn supermarket a few minutes walk etc, and the red light district 10 minutes away, its a very safe and quiet bit of Amsterdam, famed for its Artis botanical gardens. plus the hostel has 2 pcs which are handy to use and on all night.. If I go back to amsterdam i'll defo be staying here again, cheap and cheerful...", "Date": "July 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“Ok for short stay”", "Author": "AussieMelC", "ReviewID": "UR14778740", "Content": "This is definetly a hostel, not a hotel. We had a private room which was clean and comfortable. The shared bathrooms were small and probably the worst we have seen on our travels. Good breakfast for the price and pleasant staff, although they made you feel uncomfortable using the kitchen facilities. Bit of a walk to central town, but could catch tram. Overall good for the price.", "Date": "April 4, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Colchester, United Kingdom", "Title": "“Student Stopover”", "Author": "Jonster_201", "ReviewID": "UR10612477", "Content": "Cheap and cheerful is the best description. A hostel, but a with seperate rooms, which made it better than a hostel. Rooms were ok, basic but with a sink and mirror, we had a shared shower which was ok, ive been in worse halls of resisdence and some did have en-suite. Staff were very friendly, with the attitude of 'do what you like, just clear up afterwards' and you were always greeted in the morning with 'would you like schum eggsh? Free internet access, a pool table and beer vending machine made it all quite livable. Its in a good location, about 20mins from dam square in a safe neighbourhood, with some nice resturants and bars close by. For Â£30 a night, I wouldnt stay anywhere else.", "Date": "November 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "boro", "Title": "“Excellent value at the Hortus!”", "Author": "amsterdam4life", "ReviewID": "UR8722929", "Content": "Most people who give this place a bad review are obviously expecting too much. Yes its basic, but the rooms are of good size , theres a friendly atmosphere and then theres the nice breakfast too! beerstocked machines always available and theres also free internet! me and 7 mates stayed for just the one night and everyone liked the place. Only slight disadvantage is the distance to the center...but it literally only took us 5 minutes to walk there,so cant complain! Definitley recomend this place to any one who just wants a good time,nice room and comfy bed!", "Date": "September 16, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sardegna,Italy", "Title": "“Perfecgt for a bunch of friend in their 20ies”", "Author": "Andyvegas", "ReviewID": "UR7554128", "Content": "Let's be real,you do not want to take your loved one in this rat-hole. At the time we used to go,few years ago,they did not even provide towels in the rooms,you had to go in the back of the house in this sort of boiler room and pick an old but clean towel from a full stack of them left years before by some other visitors.The rooms are VERY basic and many of them don't even have a bathroom,just a sink an that's it. As said,if you are a bunch of good friends in town for some real Amsterdam fun (you know what i mean) this is the place to be. It did not even bothered us that you haver to take a short 15 minutes walk to the warzone (you know what i mean,again). Staff is rude at times.", "Date": "May 7, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Oakham", "Title": "“Not a hotel”", "Author": "Emily2489", "ReviewID": "UR7379078", "Content": "At the time of booking, 'Hotel' Hortus seemed the best option to go for because it was reasonably priced. We did not know what we were letting ourselves in for! I would advise anyone coming to Amsterdam to pay more for a proper hotel with warm water, a shower that drains and a bed that doesnâ€™t bow in the middle. We arrived in the 'hotel' and were greeted by a receptionist who didnâ€™t look like he cared. Climbing the stairs with a weeks worth of clothes in my suitcase was the hardest part of the trip; the steps were so steep and what made it worse was being on the second floor... I pity those on the third. In our room were two bunk beds, a foldout and a mattress which looked like it had been slept on by the whole world and its dog! The back of our door had a great deal of graffiti on it since 2004 and no effort had been made to clean it off. We had been told by the hotel management that towels were provided (thankfully I took my own) but the people that didnâ€™t received bits of old cloth, the size of dish towels. The showers were another thing; there was no door on it just an old curtain. Hot water came through the tap when there were no other showers on in the building and when there were 20 running at the same time it was always a fight to see who could twist the handles fast enough to get the hot water! The plug in the shower was blocked so we had to turn it off let the water drain for 5mins then turn it back on and fight for hot water again, the fan was broken meaning that all the steam went into the bedroom. Breakfast was probably the nicest part about the hotel, a toaster was placed on each of the tables along with a big pot of Jam, Peanut Butter and Chocolate spread which had been used by many people before us. Eggs were offered to people when the guy could be bothered. Since being home I have noticed many bites up my arm and on my back, I have been told that this was from the bedding which I did think was fine. I have also been sick many times but I have not determined the cause yet. If a Hostal is what you want then the Hortus definatly has the charicteristics of one, it is definately not a hotel. Its not all negative at least we came back alive.", "Date": "April 17, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“ooo well....different but ok in the end...the price is right”", "Author": "jenyrocio", "ReviewID": "UR7283106", "Content": "well....we originally booked the hotel brian...over the other side of damtrak.....and we arrived there nice and tired after an early flight to be greeted by bauldrick from black adder eating and smoking over a table disguised as the reception....and a dutch woman ranting there were no rooms left...we were then packed into a taxi and taken to hortus....an \"upgrade\" were the words of bauldrick!!....and sure enough he was right compared to brian this was like the savoy!!!......it depends what you want from your trip...the breakfast was ok...toast and eggs if you wish...clean towels and the rooms are cleaned everyday nice and noisy and early everyday!!!.....truth is though we didnt ask for bunk beds...but nevermind....oh and the walls are so thin!!!!....all in all though its what you want if you are up and out everyday and arriving late at night....great location to...not too far out with a supermarket round thecorner!!!....book it ...i would again.....xxx", "Date": "April 5, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Rutland", "Title": "“Hell On Earth”", "Author": "WillDL", "ReviewID": "UR7251467", "Content": "on first impressions when you get out side the hotel it looks like any other hotel in amsterdam but when you walk in to the hotel its a different story. The rooms are not fit to keep rats in they have sick stains on the carpet the beds have fleas in them and they are bent in the middle from the fat people that have stayed there. when we arrived there the light in the room did not work and it took 2 days for them to fix it. The shower flooded because the plug hole was full of crap. and in some of the rooms the plaster was falling off the wall and in some cases it had already fallen off. If you have any trouble with walking you will not be able to get up the stairs because they are so steep (we struggled and we are a group of college students). some of the staff are ok but some are so busy on their computers they have no time for their customers. the breakfast that they advertise on their website is an egg if you are lucky! and some bread if you are down stairs early enough. there is on fire exit and it is in on of the rooms so if there is a fire you have little chance of getting out. if i could give this place a lower rating i would. i think it is the worst place that i have ever stayed!!", "Date": "March 30, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Middlesbrough, England", "Title": "“Do not contemplate visiting this place”", "Author": "pauliej", "ReviewID": "UR6140617", "Content": "We stayed here for one night for the Holland versus England friendly football game and i can honestly say it is the worst place i have ever had the misfortune to stay in. I have stayed in plenty of poor places during my travels over the years both watching England and on holiday in General. This place was disgusting! The room was tiny with a set of bunkbeds that were filthy with rotten torn mattressess and smelly pillows. We both woke up the next morning covered in bites that required anti-histamine tablets!!!! The room was at the top of three horrendously steep flights of stairs and the shared bathroom and toilet facilities left a lot to be desired. The best thing that i can say about this place is that it had a nice relaxed atmosphere. I did not go to this hotel for that, i went for a nights stopover in what i thought would be at least half decent accommodation after reading some of the reviews on here.I am certainly no prude and generally know what to expect when staying at the cheaper budget places. This was a really bad place that we decided on and i would not want anyone else to go through what we did after visiting this place.I would not reccomend this place to anyone. We got another hotel the next night, for the same price (Amsterdam House hotel Eureka) and it was a palace compared to this. Go there if you can it is so much better.", "Date": "November 17, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "5"}, "AuthorLocation": "MISSOURI", "Title": "“Excellent for price!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5057629", "Content": "THE hostel is a bit out of center-mile walk maybe. Tram and metro very close. Nice Staff-clean rooms. Other guests were a bit noisy-but area was quiet and pretty. Everything surrounding hostel is much cheaper than in the center. PROBLEM: we booked online and when we arrived Hortus told su that they were overbooked-gave us 100 euro and sent us to another hostel in the center. That was a bit annoying, but it worked out all right. We also thought we would have our own bathroom-but instead we had a private shower. But, I am actually planning on staying there again-it was just such a good price and pretty area.", "Date": "May 12, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Shrewsbury", "Title": "“Perfect location, Good Price”", "Author": "A TripAdvisor Member", "ReviewID": "UR4987290", "Content": "I stayed here with my girlfriend here last august, booking was very conveinient. On the map it seemed like a way from the centre, it really wasn't, 3 minutes on the tram from central station and only 15 minutes walk even in a right state! about 5 minutes until you get by shops/bakeries etc then another 5 to the edge of the red light district and coffee shops. It's right next to the Hortus Botanicus and Zoo, and on a couple of main tramlines, near some nice cafes, a couple of small chilled grassy areas/parks nearby. the hostel has a back yard that gets some sun. Cool front room with all sorts of sporting memrobilia, a pool table, bongs, free internet access. The rooms are the only slight let down due to having thin walls and can sokmetime be a bit noisy if someone is getting their end away (luckily the guy in the room next to us was a one minute man so only kept us awake for a second!!) but theyre clean, the one we stayed in was a decent size and had a semi-decent view. I've booked to go back for a whole week during the world cup. Right i'm rambling now, but basically there are some whinging people who have rated this place, who expect the ritz for Â£19 a night. Don't listen. I HIGHLY recommend the Hortus due to value for money and superb location. If you don't fancy drug dealers on your doorstep but having all the action within 10 mins stumbling time this is the place for you! See you at the Greenhouse!", "Date": "April 19, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Leicester", "Title": "“All OK by me”", "Author": "Bradfields", "ReviewID": "UR4724568", "Content": "Myself and seven friends stayed in an 8 bed room at the Hortus for five nights. OK, it isn't the most glamourous hotel and is probably better described as a hostel rather than a hotel but it would perfectly adequate for most travellers. The room had enough bunks to sleep twelve, a sink, shower and table / chairs and sofa. This meant we were able to relax in our room as well as in the common room area downstairs. The common room area has a couple of vending machines (which sell beer) and a pool table as well as Sky TV and plenty of seating. The hotel is quite large and I would imagine that at peak times of year the common room could get pretty busy but it was alright while we were there and a lot of guests stop in for a last few smokes before bed and to watch some TV. Smokers will like this hotel as you can smoke in your room as well as in the common room area. Soft drugs are tolerated throughout. The price was the biggest bonus of the whole thing, I paid just under Â£90 for my five night stay.", "Date": "March 22, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "1.0", "Value": "2", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Athens, Greece", "Title": "“not good”", "Author": "gas", "ReviewID": "UR3841558", "Content": "hotel hortus was clean..the staff was polite but in their own worlds the rooms was small and like cells...my room was absolutelly like prison....the breakfast was not good...and furtermore the last day when we pay we gave 54 euros for a double per day then 50euros we knew and they had told us...!!!!also i can say that the true word of this place is hortus miserable...no any funny atmospere or a celebration or even something that will make you feel nice(things that are musts at youth hostels)..i will not also forget the doors of the rooms it was something like a war and you couldnt sleep at least one min..when they close are shouting like bombs. i was asleep when one door closed... a mizery place to smoke downstairs with football channels...if you want to feel like prissoner is the best place..and this was the only funny thing there....the next time i will prefer much better hostels and the only advantage was the location...", "Date": "September 4, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Australis", "Title": "“relaxed”", "Author": "A TripAdvisor Member", "ReviewID": "UR3002833", "Content": "The hortus was our first stop on our long journey. Although the rooms were very small, we did only have two per room, and for saftey reasons this was a bonus. Also because each room has its own safe it was very comforting to know your valuables were ok. The party atmosphere wasnt huge but the hortus was very relaxed and many joints were shared in the common room. The staff were friendly and helpful and so far it is the only hostel we've been to, to cook eggs every morning!!!! I would definately stay there again. Next time I wouldjust choose a busier time of year!", "Date": "January 12, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“nasty room but good vibe”", "Author": "A TripAdvisor Member", "ReviewID": "UR2900298", "Content": "Ok...a very good vibe but this place has nasty rooms...to get to your room you may have to climb 3 dangerously steep staircases...a tricky move if your carry your whole life on your back as I did traveling through europe...then they couldn't be bothered to put a hook in the shower closet so you actually have to try to hold your clothing while showing...the sound of the dutch toilets flushing can be heard at all hours of the night...plus this place is actually very far from the city center...many hostels are much much closer but there is a charming park and canal right there so the walk to the hortus is worth it...also you have to pay in cash...and it isn't that cheap....also some people get personal showers and toilets in their room and don't pay a penny more for them...so ask ahead if you can...so overall...not too bad..but not that good", "Date": "December 19, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Tel-Aviv,Israel", "Title": "“greate place! any hotel doesn't compare to!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1623481", "Content": "greate location.near by the city center like dam or the rembrandt. the hotel rocks. with free d.v.d,playstations,pool tables.microwave and free hot drinks in the loby. don't miss it! sending ho to aric and jeff!", "Date": "February 1, 2004"}], "HotelInfo": {"Name": "Hotel Hortus", "HotelURL": "/ShowUserReviews-g188590-d236057-Reviews-Hotel_Hortus-Amsterdam_Noord_Holland.html", "Price": "$63 - $278*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Plantage Parkln. 8</span>, <span class=\"locality\"><span property=\"v:locality\">Amsterdam</span> <span property=\"v:postal-code\">1018 SR</span></span>, <span class=\"country-name\" property=\"v:country-name\">The Netherlands</span> </span></span></address>", "HotelID": "236057", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/56/41/5641b07526c26fce0b7933f8c0b8cab05large.jpg"}}