{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bognor Regis", "Title": "“What a find!”", "Author": "Hugh42", "ReviewID": "UR127870924", "Content": "This hotel was ideal for the brief time we had in Rome - good for transport links, only 5 euro taxi from Ostense station which brought us from Fuimicino. Metro just down road and buses pass front of hotel. It is quiet as it is above the level of the road. It is clean and adequately furnished. Clean bathroom with shower. Friendly staff. Free internet and wifi and they printed our boarding passes for nothing. Excellent price for a double room. Brilliant local, cheap restaurants that make you feel welcome. Only downside was breakfast (included in price) - orange squash, stewed coffee from an urn, cereal, no toast or bread, biscuits and mediocre pastries. But what do you expect from a budget hotel near the centre of such a city? Would go again tomorrow.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Curitiba, PR", "Title": "“Horrible service!”", "Author": "Just_Keep_Traveling", "ReviewID": "UR123193584", "Content": "The room is ok, but the breakfast is very poor and the man that serves the coffee is unwilling and does not even try to be friendly. The worst part of the hotel is an old man that works in the reception, he is very rude, impolite and unkind. I would never stay in this hotel again!", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York, New York", "Title": "“Very clean hotel in a great location”", "Author": "funromanticgetaway", "ReviewID": "UR122539158", "Content": "We stayed in this hotel for a few days after Christmas. It is an affordable gem in a neighborhood easily accessible to all of Rome's sites. Testaccio, the neighborhood in which the hotel is located, has great restaurants, shopping, and nightlife. It's a wonderful area to stroll in and avoid the tourist traps found in other neighborhoods. There is no such thing as a tourist trap in this area. The restaurants are spectacular. If you like the nightlife, this is a good location, as there are several bars and nightclubs just a 5 minute walk from the hotel. The attractions (Pantheon, Vatican, Piazza Navona, Trastevere, etc...) are about a 15-20 minute walk from the hotel. It's also very convenient to the Colosseum; a street leading directly to it runs just in front of the hotel. The staff working at this hotel are very friendly and helpful.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Texas", "Title": "“Santa Prisca, a welcoming and secure place in the heart of Rome”", "Author": "Texas_guy_in_30s", "ReviewID": "UR118514695", "Content": "Right next to the independence park and the over-two thousand year old Piramide of Gaius Cestius, which is really close to a major Metro rail hub (but not close enough where you can hear any noise). This gated property welcomed me after my long flight from the US, and allowed me into the room early instead of just holding the bags while I went to Ostia Antica. This place was a recommendation by a guy who owns a company in Rome that sells me sculpture supplies and rare stones, and I'm happy that I stopped by. The cleaning crew is really thorough here, no problems. I was on a tight schedule, and when checking out in the morning they knew I didn't have time for breakfast, but they graciously offered me to at least have a made-to-order coffee. The air conditioning and cleanliness of the room was a great value, and it was close to the restaurant area of Trastevere. I would stay here again because the price is hard to beat for what you get. Five minutes and one Euro later, you can be at the Termini from here!", "Date": "September 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Otterndorf, Germany", "Title": "“Perfect Hotel”", "Author": "Andy S", "ReviewID": "UR116737612", "Content": "Always when I stay in Rome (Holiday, Business) I stay in this Hotel. It was now the 4th stay there and I enjoy it everytime because it is in central location, cheap, very clean, nice people and in the side streets you have a lot (little) Restaurants with a nice ambiance. You are far from all the trouble of tourist the stay in big Hotels and also from the (expensive) Restaurants only for Tourists.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“\"Elegant, Quiet, Compact ... value for money\"”", "Author": "EasyBizTrvlr", "ReviewID": "UR114729174", "Content": "We stayed for couple of nights at this place .. landed late in Roma and Cab driver dropped us in the central district Diattchio.. so Santa Prisca was the only good ,rated hotel nearby... smooth check in..very friendly staff.. rooms were small and very italiano in detail... internet was good... breakfast was basic but good and fresh.. dont miss the great black coffee that the chef makes to kick start your day ... nice concierge service.. its a very much living in a villla kind of feeling with the tree lined walk to the gate.. overalll would recommend as a safe and elegant option to any traveller \"", "Date": "June 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Paphos, Cyprus", "Title": "“Only if \"clean\" is all that matters to you!”", "Author": "ar1us", "ReviewID": "UR85372745", "Content": "The Hotel Santa Prisca is CLEAN. You may stay there and enjoy it, if ''clean'' is all that matters to you. The rooms and the common areas are well taken cared of and so clean one can eat off the floor... Provided one can find something to eat, since the ''breakfast'' -sic- was the poorest version of hotel breakfast I have ever come across! The major shock, though, was the size of the room. 130 euros per night, for a tiny nun cell (the hotel used to be a female convent) which was turned into a 2-bed guest room. The hotel is near Piazza Albania, about 5 minutes walk from the Pyramide rail and Metro station, so one can have easy access to the airport, Lazzio and Rome. The Colosseo is only 2 metro stops away, but not really within walking distance. A noisy avenue passes infront of the hotel, where one can find a few Cafe and Restaurants of below average standard.", "Date": "October 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Francisco,CA", "Title": "“A pleasant surprise”", "Author": "sfojws", "ReviewID": "UR84006514", "Content": "I was one of a cycle tour group that stayed at Santa Prisca on the last night of the tour, and I stayed for an additional night (as did a couple of others in the group). From what I had heard, I was prepared to be underwhelmed. I have stayed at a couple of other hotels in Italy that were converted convents, and did not expect much. When I entered the room, my face lit up with a smile. Yes, it was not as large as you would find at an American corporate hotel, but considering that other hotel rooms in which I have stayed in Rome were not much larger than the twin bed in the room, it was spacious enough. The room was clean and sunny, with only a bit of noise from the school that is nearby. By night, the room was quieter than others where I've stayed in Rome. At no time did I feel that my quality of sleep was hindered by noise. The staff was very friendly and helpful. The breakfast was fair, and a bit of fresh fruit would have improved things considerably. The brewed coffee was a treat; I didn't check to see if would have been possible to get a cappucino or latte, as I was ready for an alternative to espresso drinks. The location seemed to be good for a few days stay in Rome, and the tariff was quite reasonable. The Tevere (Tiber) is nearby, the Vatican is about a 40-minute walk away, and Trastevere is across the river. On the final night, we ate at a restaurant a couple of blocks away, and had one of the best meals that I've eaten on seven visits to Italy. Yes, the bathroom was small, and the shower about the size of a phone booth, but everything was clean and worked well. From other reviews,. it appears that the rooms can be inconsistent, but I had no complaints with the room I had. It's probably a good idea to check in advance, to get a good one. I'd stay here again.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "2", "Rooms": "3"}, "AuthorLocation": "New Jersey", "Title": "“A nice reasonably priced hotel well worth the stay.”", "Author": "MuseumMaven", "ReviewID": "UR31235315", "Content": "A family member and I just returned from Rome, where we stayed at the Santa Prisca. It was pleasant, very clean, and served our needs well. The room was small and the bathroom was too but seemed new. Both were air conditioned. We enjoyed not being in the tourist areas of Rome. The hotel is at the foot of the Aventino, one of Rome's lovliest residential neighborhoods, Across the street is testaccio, a bustling local working-class neighborhood with some excellent local restaurants and trattorrias. (You'll need reservations for Felice but go!) The street in front has one of Rome's great deli's, Volpetti. While off the beaten track, the hotel is convenient to bus lines and the subway is aobut four blocks away. The price is well worth it.", "Date": "May 31, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Boulder, Colorado", "Title": "“Two Weeks at the Santa Prisca”", "Author": "N2RUINS", "ReviewID": "UR20593158", "Content": "I've been here in Testaccio for the last two weeks on a work related trip. I have 2 more nights to go. The company takes care of the accommodations so, I didn't really have a choice. Needless to say, I would not recommend this hotel to anybody. The building is a converted convent thus many of the rooms are former nuns cells - tiny! The street noise is the worst I've experienced anywhere. In my line of work that's saying a lot. The Econo Lodge on Main street in Winnemucca, Nevada is quieter. The bathrooms are very small with the classic 2' x 2' Italian shower, but instead of the usual Plexiglas doors, they come with very clingy shower curtains. It's like being smothered in wet tissue paper. You're lucky if housekeeping remembers to give you clean towels. They will, however, always remove the dirty ones, leaving you with no towel at all. For the price, get a bigger room with a real bathroom closer to the center and just take the metro to come to Testaccio or Trastevere. You'll sleep better!", "Date": "October 3, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "London", "Title": "“Very basic, and uncomfortable”", "Author": "ADailey", "ReviewID": "UR20276429", "Content": "Stayed there on business in September 2007, and the room was a twin bed room, with an ensuite bathroom. Sounded nice, the room was extremely basic, the beds had very thin mattresses and what was effectively a camp bed frame. The pillows were very hard, making it difficult to sleep. The TV was tiny, and only provided local TV, no sky or international channels. The bathroom was awful, paint was peeling, and mould in the corners. Bars on tne windows made it feel like a prison. There was little food served at breakfast, and the pastries provided tasted stale. The milk I requested for my tea had a fly in it. It is not walking distance to the centre. very little in terms of restaurants around it. Service was lacking, as needed an iron, to iron blouse for meeting the followng day, and the staff were most unhelpful. Said irons were not allowed! The lounge area did have internet access, but the seating was old and tattered. I would not stay here ever again.", "Date": "September 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Good Location and Service”", "Author": "Tablo", "ReviewID": "UR14284217", "Content": "Like others have mentioned, this place isn't fancy or luxurious, but it's always solid and the staff is very helpful. Nice that it's set in a little park with palm trees. The best thing it has going for it is the more quiet residential aspect of Testaccio, plus the restaurants and farmers market south of Via Marmorata. With a pastry shop and cheese/meat shop across the street, what more do you need? But more seriously, the metro is nearby, trams and buses go up and down Marmorata, and you can take a pleasant walk up the Tiber to get into the heart of the city with the main Renaissance and Classical monuments. Really liked the area around the hotel the first time I was in Rome, and have subsequently rented apartments in Testaccio on other visits.", "Date": "March 14, 2008"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice little hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR5314123", "Content": "stayed there twice last year. Price is right, location great. Only two Metro stops from the central train station, and two bus stops away from Palatine Hill, forum, and Colisseum. Has a small park next to the hotel where we enjoyed a free concert one night. In a quiet residential neighborhood, but can find several good restaurants around it frequented by the locals. Altogether it is close to the heart of Rome yet somehow off the tourist track. Pros: * They have internet access. Used it to book train. * Staff very nice overall, and accomodating. * helped in booking taxi, making concert reservations - manager very nice * very quiet - hard to find in Italy Cons: * breakfast is mediocre * there seems to be a primary school next door. Wakes you up early on weekdays * one waiter was rude - we had come down for breakfast, and apparently he had just rearranged one section of the dining room for lunch. There were no signs, so we just picked a table, only to be greeted with a \"no, no, no\" from that waiter. How are we supposed to know? No manners. Issues: * Did not have room I requested upon arrival, so upgraded us to bigger room with promise to move us the next day. The new room had a private bathroom, but like many Italy hotels, the bathroom was not in the room. They gave us a discount for that inconvenience. Next day we decided to stay in the big room and keep the discount. * Somewhat hard to find. We did fine ourselves with a combination of Metro and bus the first time. Second time I had run out of cash [no banks open on weekends] and so couldn't use Metro. Had to wait 1 hour at the station for a cab that takes credit cards, and he had a hard time finding the place. I had to tell him to take me to the Pyramide and then gave him directions myself. The hotel is not hard to find - more likely it was my Italian accent that the driver couldn't get.", "Date": "June 6, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Brussels", "Title": "“Charming S Prisca!”", "Author": "naftalinabrussels", "ReviewID": "UR3704768", "Content": "Hotel Santa Prisca was defintely a find! After spending hours surfing 'round, comparing rates and services to find a clean, familyrun type hotel with a little extra, I went for S Prisca and did not regret it for a second! At first I was surprised that they took my reservation without deposit or credit card nr. ... Just my name seemed to be sufficient. Already had a good feeling when calling to book the room and it only got better PERSONNEL: all very nice and helpful LOCATION: in the lively and \"real Rome\" Testaccio neighbourhood, with Underground (M: Piramida), train and buses within minutes walk. Buses to Vatican and many other central destinations stop right in front of the S Prisca The hotel's location is on a small hill above street level which is a really nice detail All very close to the hotel are Testaccio Market, Volpetti (the best deli in Rome), lots of specialty food and wine shops, cafes and terrific restaurants and a vibrant nightlife scene a bit further down ROOMS: mine was really small but very quiet, and had a small but immaculate bathroom - I partucularly liked the old fashioned style (mix of 50s and 70s) furniture and details, so refreshing after having stayed too often in hotels belonging to international chains There is a lounge, a little bar at the hotel and a bright breakfast room. Breakfast is simple but OK though try to go early. You can have breakfast extras but be prepared to pay the price... S Prisca also has an outside terrace with tables and chairs to relax If you want to stay in the real Rome, in an immaculately clean, pleasant hotel at a reasonable price then the Sta Prisca is ideal!", "Date": "July 27, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Mc Lean, Virginia", "Title": "“Very Pleasand Little Hotel Not Far from the Centro”", "Author": "A TripAdvisor Member", "ReviewID": "UR3166538", "Content": "I have stayed at the Santa Prisca maybe a half-dozen times over the last 14 years. It is always a pleasure. I like the staff, who take the time to make sure I am happy with the service. I have driven into Roma and found this hotel in a pretty straightforward manner. I do NOT recommend that an inexperienced American try to drive in Roma, but with patience and care, it's doable. Parking is free, the rooms are comfortable, and the hotel has a small breakfast room. Rates are reasonable for a capital city. I would recommend it to anyone.", "Date": "February 6, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Francisco CA", "Title": "“Treat Yourself to Testaccio”", "Author": "A TripAdvisor Member", "ReviewID": "UR1344415", "Content": "As frequent travelers to Italy, we find it very appealing to explore Rome in more depth. Hotel Santa Prisca has been our choice three trips in a row because of it's central location, it's cleanliness, it's excellent value, and the delightful Signore DeLuca who patiently answers our questions in perfect English. The rooms are small (remember, it was a convent) but very quiet and they face a central courtyard, that keeps the street noise to a whisper, and the hot Roman sun to a minimum. The hotel is on a small hill above street level and has parking for guests, although we do not recommend driving in major cities when public transportation is so great. The Pyramid metro stop is two blocks away and trams are all around the hotel. There is a small train station next door to the metro where you can depart for Ostia Antica (a must if you can't go to Pompei). Hotel Santa Prisca is in the Testaccio neighborhood that housed slaughterhouses and tanneries 100 years ago. The urban poor wasted nothing and developed a \"cucina povera\" based on the \"5th quarter\" that guide books refer to as \"variety meats\" (tripe, brains, liver, kidneys etc.). It's an easy walk across the river to Trestevare for inexpensive restaurants, but one of our favorites, Perelli's, is across the street from the hotel. It serves typical \"5th quarter\" Roman dishes. Try the oxtail sauce over penne and the typical roman artichokes, you won't regret it. If a snack is what you want, the best deli in Rome is also across the street from Hotel Santa Prisca. Volpetti's has the best cheeses, cold cuts, and breads for your picnic or you can go to their caffeteria around the corner called Volpetti Piu. If you crave fresh fruits and vegetables, walk one block west of the hotel and you'll find the Testaccio Market, a daily open air covered market with many merchants selling all kinds of food, housewares, and clothing. Take trams to all the tourist sights, then go back to Hotel Santa Prisca to experience the \"real\" Rome.", "Date": "September 18, 2003"}], "HotelInfo": {"Name": "Santa Prisca", "HotelURL": "/ShowUserReviews-g187791-d236155-Reviews-Santa_Prisca-Rome_Lazio.html", "Price": "$115 - $158*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Largo M. Gelsomini 25</span>, <span class=\"locality\"><span property=\"v:postal-code\">00153</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "236155", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/4a/4b/4a4b62c1641259124efef294cd48279c1large.jpg"}}